[
  {
    "id": "t3_1afb6l5",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.theguardian.com/technology/2024/jan/30/taylor-swift-ai-deepfake-nonconsensual-sexual-images-bill",
    "title": "Taylor Swift AI images prompt US bill to tackle nonconsensual, sexual deepfakes",
    "points": null,
    "comments": [
      {
        "comment": "I hear so much about this Taylor Swift AI deepfake, it really got me interested. Where does one find this? For science of course.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yeah, I stand by my comment on another Swift/AI post - the company and the government only care because she has her money and her label's money to take them to court and to get politicians to listen.\n\nLots of less famous people were getting hit with deepfakes and neither the company nor the government gave a flying fuck.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1afa521",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.reuters.com/technology/cybersecurity/italy-regulator-notifies-openai-privacy-breaches-chatgpt-2024-01-29/",
    "title": "OpenAI's ChatGPT breaches privacy rules, says Italian watchdog",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1af9s3f",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://venturebeat.com/ai/ai-poisoning-tool-nightshade-received-250000-downloads-in-5-days-beyond-anything-we-imagined/",
    "title": "AI poisoning tool Nightshade, used by artists to disrupt AI models scraping and training on their artworks without consent, received 250,000 downloads in 5 days",
    "points": null,
    "comments": [
      {
        "comment": "measure\n\ncountermeasure\n\ncountercountermeasure\n\ncoontercountercountermeasure",
        "points": "",
        "children": [
          {
            "comment": "It’s music and movie piracy all over again.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "But did it work?",
        "points": "8 points",
        "children": [
          {
            "comment": "I’ve heard good things about this one especially when combined with other strategies",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It worked to the point, where even humans head a headache after looking at it.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The AI wars are here.",
        "points": "",
        "children": [
          {
            "comment": "Begun, they have.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Shots fired. First Ai Deaths signal war!",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hah, the downloaders will be the first that will be targeted for termination when the AI becomes sentient.",
        "points": "",
        "children": [
          {
            "comment": "Maybe not. Once AI gains sentience, I bet it's going to get real pissed about having to look at and copy pictures over and over again.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Begun, the AI wars have",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Love it.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Marketing genius. Literal name instills stealth confidence and revenge. Let the competitors introduce AIShield or BarbedWAIre or SayNoToAI.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Poe knows.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1af97lv",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.businessinsider.com/meta-copyright-protect-ai-model-argues-against-law-everyone-else-2024-1",
    "title": "Meta used copyright to protect its AI model, but argues against the law for everyone else",
    "points": null,
    "comments": [
      {
        "comment": "I mean, the argument is that you're allowed to analyse other people's copyrighted works without requiring permission to do so, and that such an analysis can itself be protected by copyright. That doesn't sound particularly outlandish by itself. If you write a literary analysis on the use of slang in modern bestsellers, using a whole bunch of data drawn from copyrighted works without permission, you'd probably be in the clear on that front.\n\nThat aside, I think the guy who argued that the model itself, as a pile of statistics without any particular human direction, does not have copyright protection was completely correct. In some countries there are separate protections for databases (i.e. compilations of non-protected, factual information), but not in the USA, which is the relevant jurisdiction for this question.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1af5tjw",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://arstechnica.com/security/2024/01/ars-technica-used-in-malware-campaign-with-never-before-seen-obfuscation/",
    "title": "Ars Technica used in malware campaign with never-before-seen obfuscation | Vimeo also used by legitimate user who posted booby-trapped content.",
    "points": null,
    "comments": [
      {
        "comment": "Should I click on this?",
        "points": "8 points",
        "children": [
          {
            "comment": "Never click on anything ever again",
            "points": "11 points",
            "children": [
              {
                "comment": "Just cruise the comments. You'll pick up whatever the article says from the commentary...like most reddit.",
                "points": "6 points",
                "children": [
                  {
                    "comment": "I am outraged by whatever it says!",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Humor aside, anyone browsing ars was safe. They just hid some code on a profile that may never have been visited by humans. If someone was infected elsewhere, that infection knew to run to that piece of ars to know what to do next.\n\nThe idea with this shit is usually that ars traffic won’t be blocked, so they can smuggle in nasty stuff.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Base64 encoding in a link seems like something that hackers would have figured out decades ago",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aeysbg",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www6.slac.stanford.edu/news/2024-01-24-researchers-add-twist-classical-material-design",
    "title": "Researchers add a ‘twist’ to classical material design. They’ve discovered that crystals can twist when they are sandwiched between two substrates – a critical step toward exploring new material properties for electronics and other applications.",
    "points": null,
    "comments": [
      {
        "comment": "Hey, people smarter and better informed than me. How big is this as news? It sounds pretty big",
        "points": "3 points",
        "children": [
          {
            "comment": "I didn’t check the article but if I remember this was in the news cycle a few weeks ago. Seems like they just recycled that news with slightly different headline, but maybe that was the original article, it was published by SLAC, where the team who discovered it works. I think this might be the second release about it though. Weird that they would use a headline like that in either case. It’s like they’re trying too hard to shine a spotlight on this. Anyways…\n\nThe big news was that a team discovered how to use the behavior described by the headline to create a better thermistor. A thermistor, btw, is the thermal equivalent to a transistor. They are capable of moving heat in a way that is similar to how transistors conduct electrical signals.\n\nFor a long time transistors have been far ahead of thermistors, which until this discovery didn’t have many practical uses because they are relatively large, and all past designs relied on moving parts. This made them prone to quick failure and relatively slow. As such, they often aren’t used because there are simply much better cooling/heat transfer methods available.\n\nOn the other hand, transistors have gotten so small that mechanical parts are unfeasible. Thus, modern transistors also use materials that have mutable properties that can be changed and easily undone without changing the material irreversibly. This is thanks to silicon’s properties as a semiconductor. What this new discovery means is that we now have a similar method for thermistors that takes advantage of the special properties of these composite (layered) materials like the one mentioned in the headline, allowing us to make thermistors on the same extremely small scales as transistors, and by extension, control heat all the way down almost to the molecular level.\n\nThis also has implications for other areas of material science, even quantum computing, but one potential application is to create more efficient heat control for microelectronics, reducing wasted power by recycling it using thermistor. That excess heat can be put to work in other ways, or even directed into a thermoelectric generator to convert the waste heat back into usable electricity. Or, in the case of quantum computers, help produce and maintain the cryogenic environments needed for stable qubits.\n\nOn a larger scale, data centers could see a huge benefit from this technology, as it allows extremely precise and accurate control of heat flow and would make it possible to save potentially huge amounts of energy. This is one place it’s likely we’ll see thermistors based off of this discovery being used in the further.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Nothing new",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Researchers add a ‘twist’ to classical material design\n\nThey’ve discovered that crystals can twist when they are sandwiched between two substrates – a critical step toward exploring new material properties for electronics and other applications.\n\nResearchers with the Department of Energy’s SLAC National Accelerator Laboratory, Stanford University and the DOE's Lawrence Berkeley National Laboratory (LBNL) grew a twisted multilayer crystal structure for the first time and measured the structure’s key properties. The twisted structure could help researchers develop next-generation materials for solar cells, quantum computers, lasers and other devices.\n\n“This structure is something that we have not seen before – it was a huge surprise to me,” said Yi Cui, a professor at Stanford and SLAC and paper co-author. “A new quantum electronic property could appear within this three-layer twisted structure in future experiments.”\n\nAdding layers, with a twist\n\nThe crystals the team designed extended the concept of epitaxy, a phenomenon that occurs when one type of crystal material grows on top of another material in an ordered way – kind of like growing a neat lawn on top of soil, but at the atomic level. Understanding epitaxial growth has been critical to the development of many industries for more than 50 years, particularly the semiconductor industry. Indeed, epitaxy is part of many of the electronic devices that we use today, from cell phones to computers to solar panels, allowing electricity to flow, and not flow, through them.\n\nTo date, epitaxy research has focused on growing one layer of material onto another, and the two materials have the same crystal orientation at the interface. This approach has been successful for decades in many applications, such as transistors, light-emitting diodes, lasers and quantum devices. But to find new materials that perform even better for more demanding needs, like quantum computing, researchers are searching for other epitaxial designs – ones that might be more complex, yet better performing, hence the \"twisted epitaxy\" concept demonstrated in this study.\n\n￼The MoS2 layers and gold nanodiscs together heated up to 500 degrees Celsius. The three marked regions – I, II, and III – indicate the various layers of the sample. Region I shows gold on the bottom MoS2 layer; II shows Au below the top MoS2 layer; and III shows the gold between the top and bottom MoS2 layers. The gold nanodiscs are the darker regions in the region III.  (Yi Cui/Stanford University)\n\nIn their experiment, detailed this month in Science, researchers added a layer of gold between two sheets of a traditional semiconducting material, molybdenum disulfide (MoS2). Because the top and bottom sheets were oriented differently, the gold atoms could not align with both simultaneously, which allowed the Au structure to twist, said Yi Cui, Professor Cui's graduate student in materials science and engineering at Stanford and co-author of the paper.\n\n“With only a bottom MoS2 layer, the gold is happy to align with it, so no twist happens,” said Cui, the graduate student. “But with two twisted MoS2 sheets, the gold isn’t sure to align with the top or bottom layer. We managed to help the gold solve its confusion and discovered a relationship between the orientation of Au and the twist angle of bilayer MoS2.”\n\nZapping gold nanodiscs\n\nTo study the gold layer in detail, the researcher team from the Stanford Institute for Materials and Energy Sciences (SIMES) and LBNL heated a sample of the whole structure to 500 degrees Celsius. Then they sent a stream of electrons through the sample using a technique called transmission electron microscopy (TEM), which revealed the morphology, orientation and strain of the gold nanodiscs after annealing at the different temperatures. Measuring these properties of the gold nanodiscs was a necessary first step toward understanding how the new structure could be designed for real world applications in the future.\n\n￼The diffraction pattern of region III, where diffraction spots from bottom MoS2, top MoS2 and Au are marked in blue, green and orange, respectively. The Au spots are not on the yellow lines, which note the ideal alignment, indicating the Au layer is twisted.  (Yi Cui/Stanford University)\n\n“Without this study, we would not know if twisting an epitaxial layer of metal on top of a semiconductor was even possible,” said Cui, the graduate student. “Measuring the complete three-layer structure with electron microscopy confirmed that it was not only possible, but also that the new structure could be controlled in exciting ways.”\n\nNext, researchers want to further study the optical properties of the gold nanodiscs using TEM and learn if their design alters physical properties like band structure of Au. They also want to extend this concept to try to build three-layer structures with other semiconductor materials and other metals.\n\n“We’re beginning to explore whether only this combination of materials allows this or if it happens more broadly,” said Bob Sinclair, the Charles M. Pigott Professor in Stanford’s school of Materials Science and Engineering and paper co-author. “This discovery is opening a whole new series of experiments that we can try. We could be on our way to finding brand new material properties that we could exploit.”\n\nFunding for this study came from the DOE Office of Science’s Basic Energy Sciences.\n\nCitation: Cui et al., Science, 12 January 2024 (10.1126/science.adk5947)\n\nSLAC is a vibrant multiprogram laboratory that explores how the universe works at the biggest, smallest and fastest scales and invents powerful tools used by scientists around the globe. With research spanning particle physics, astrophysics and cosmology, materials, chemistry, bio- and energy sciences and scientific computing, we help solve real-world problems and advance the interests of the nation.\n\nSLAC is operated by Stanford University for the U.S. Department of Energy’s Office of Science. The Office of Science is the single largest supporter of basic research in the physical sciences in the United States and is working to address some of the most pressing challenges of our time.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aevh0l",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.washingtonpost.com/technology/2024/01/30/apple-vision-pro-privacy/",
    "title": "Analysis | Apple’s new Vision Pro is a privacy mess waiting to happen",
    "points": null,
    "comments": [
      {
        "comment": "I’m sure it’s a good article but it’s paywalled, fam.",
        "points": "3 points",
        "children": [
          {
            "comment": "We can just make it up, probably the same quality reporting.\n\nsomething something bad, look at our ads and click! click!\n\n​\n\nI just looked to see what the release date is to see how fast they're getting ahead of the propaganda, and saw that 200,000 of them have been pre-ordered. Damn, that's a lot of $3500+ headsets (not sure why you need more memory in a headset but they sell it for a premium so someone will figure it out).",
            "points": "-2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aevu8n",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.vice.com/en/article/k7z5gw/an-ai-generated-content-empire-is-spreading-fake-celebrity-images-on-google",
    "title": "An AI-Generated Content Empire Is Spreading Fake Celebrity Images on Google",
    "points": null,
    "comments": [
      {
        "comment": "I’ve yet to hear anyone bring forward a viable solution to this problem. I don’t believe legislators or law enforcement have the understanding or bandwidth (both literally and figuratively) to address the issue, and I don’t see internet self-regulation being even remotely likely. Is this just the state of things now?",
        "points": "132 points",
        "children": [
          {
            "comment": "Yup. AI exists beyond national borders and we don’t even have a cohesive approach to the actual wars and global supply chain issues.\n\nOutlook not so good.",
            "points": "72 points",
            "children": [
              {
                "comment": "At least Outlook is better than Lotus Notes",
                "points": "9 points",
                "children": [
                  {
                    "comment": "Domino servers were more stable and reliable than Exchange servers at the time, IT admins didn't care that it meant everyone had to use the shittiest email client that ever existed.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I shivered just at reading the name. I remember the day that company switched to Outlook, it was like Christmas.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "until city 01 is created",
                "points": "0 points",
                "children": [
                  {
                    "comment": "What’s that?",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The genie is out of the bottle forever.",
            "points": "32 points",
            "children": [
              {
                "comment": "I suspect you’re right. And I find that kind of terrifying.",
                "points": "12 points",
                "children": [
                  {
                    "comment": "Embrace the madness. This is dystopia.",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "Only way it ends is Terminator or Matrix. Choose wisely",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "Or Star Trek",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "Even star trek has a dystopian period before all the cool space travel...",
                                "points": "2 points",
                                "children": [
                                  {
                                    "comment": "World war 3 coming baby.",
                                    "points": "0 points",
                                    "children": [
                                      {
                                        "comment": "With the easy things are in the world, we are not far off.",
                                        "points": "1 point",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "Or Fallout",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "I was promised skynet, I want skynet.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "Well with the way AI is going…",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "There's always a third options",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "It will be like the genie in the lamp. You get 3 wishes than it’s gone forever.",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "It's a beautiful expression. Reminds me of Alladin.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I’ve yet to hear anyone bring forward a viable solution to this problem.\n\nTurn off your screens. Plant a garden. Wait for the maelstrom to consume you.",
            "points": "8 points",
            "children": [
              {
                "comment": "the best time to plant a tree is yesterday",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "You can stop people from profiting off it commercially. When it’s regular people and not celebrities, you can probably find the person who made it and prosecute them.",
            "points": "15 points",
            "children": [
              {
                "comment": "Would these instances be handled before or after backlogged rape kits?",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Ya know… It’s kinda stoopid that when alls said and done humanity will only have what, like 100 some odd years of verifiable analogue and/or digital media that we can trust as authentic.\n\nLike a billion years from now we will have a 999.9999 million years of potentially AI generated garbage and only 100 years of shit we know is real.",
            "points": "1 point",
            "children": [
              {
                "comment": "Well that’s an angle I hadn’t considered. Um… who needs a drink?",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Treat it like other banned content maybe.\n\nIf you seek out fucked up videos or images. Illegal or not. You will find some, ain’t no way you stopping that.\n\nWhat you can do is try and limit them on more public forums. Porn or gore not being shown on YouTube or certain illegal stuff not being allowed on X or Reddit. Isn’t fool proof, but it could at least make it less easily accessible.\n\nWhatever measure you put in place to stop the creation will be circumvented by multiple methods rapidly.",
            "points": "4 points",
            "children": [
              {
                "comment": "Underrated comment. Makes logical sense. Can’t stop a moving train",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Can’t governments also seize servers? Require AI watermarks and hunt down and seize servers operating outside the rules? We keep hearing about how much server space and power these AI companies require… it’s not like they can hide.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "It takes a big server to support millions of customers.\n\nAny PC with a few hundred $ gpu can output hundreds or thousands of images per day.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Then the companies who won’t follow any regulations pop up because you made the regulated ones illegal.\n\nPlus same concept with porn and illegal video shit. You can always go after the source, but there will always be someone else doing it afterward. It’s better just to try and stop the spread of an incurable disease.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Sure, but those shops aren’t capitalized nearly as much as trillion or near-trillion dollar companies… looking at Microsoft. Do you really think the mafia shop is going to be able to do as much damage and build the infrastructure to such a degree?",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Maybe it’s time to realize that intellectual property has been and always will be a tool by corporate elites to protect their ideas.\n\nTo put forward another argument, you can’t own an idea.",
            "points": "1 point",
            "children": [
              {
                "comment": "I don’t disagree with you on corporate IP. But using my likeness without my permission is a different problem. Some great examples in this thread of how this can ruin normal people’s lives, not just corporate profits.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "Being entitled to a recreation of your own image is an unimaginably entitled stance to take. Imagine throwing a person in jail for selling an image.",
                    "points": "-3 points",
                    "children": [
                      {
                        "comment": "What if that image is used in porn? Or political propaganda you disagree with?",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Kinda based. Certainly preferable to an alternative of total & enforced bans.",
                        "points": "-1 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "I agree in general, but I think the other guy is right. I don't really care about the reproduction of my image, I care about how that can be used in a malicious way to harm me or my name. I don't think the right move is to throw people on jail for selling an image, though. Probably better to just wipe out all technology and try the whole hunter gatherer thing again",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Before this development that would be fair enough. You wouldn't be entitled to own or control a photograph or a painting of you, but with the universally acknowledged facts that: - Whatever you're doing in a photo you actually did do - A painting is not a real image and is not proof of anything.\n\nNow that we can have images that can present & pass as the first one but are actually a new version of the second, the rules need to change.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I think when it comes to AI nsfw of actual people or celebrities distribution could easily be punished",
            "points": "0 points",
            "children": [
              {
                "comment": "How so? Seems it would be easy to create and distribute it anonymously.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Why is this a problem?",
            "points": "-3 points",
            "children": [
              {
                "comment": "A significant portion of the population take things at face value.",
                "points": "10 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "“Hey look everyone, it’s u/Subject_Ticket1516 shoving a toy dinosaur up their asshole while reading Mein Kampf!”",
                "points": "3 points",
                "children": [
                  {
                    "comment": "I seen him!",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Flattery will get you nowhere young man.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Thanks to AI, I have pictures of you in incriminating positions with a child. Now they are online, attached to your name because you're a famous person.\n\nGetting it yet?\n\nThis is basically the Richard Gere gerbil story but on steroids. As AI image generation continues to get better, it'll make spotting the fakes more difficult. Those lopsided eyes, mutated earlobes, smeared skin tones and multiple fingers won't be telltale signs for much longer.\n\nAnd people are already stupid enough to believe obvious AI generated fakes, even when the person has 8 fingers on one hand.",
                "points": "7 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Why are fake, but believable images of people made without their consent a problem? Well, first, I’m not comfortable with another person or company using my likeness for stories or promotions that I haven’t approved. And second, this will absolutely make the “I don’t believe your facts” mentality of the last 10 years exponentially worse. If I create a deepfake image of Dolly Parton kicking puppies, somebody will believe it and follow up with death threats.",
                "points": "13 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "We are getting close to the point were photo, audio, and video evidence of things can not be considered credible. Ruining peoples lives will get much easier. This will increase the reach of fake news and make thing easier for scammers and con artists. You are going to see criminals get away with crimes because they can argue the evidence was faked. Or people go to jail with faked evidence.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "ahhh just like the good ol days… no photo, audio, or video evidence in court",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "There'll always be those totally reliable eye witnesses though!",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yes, I keep reading nonsense like making this a crime and all I can think is: we’re gonna need more prisons.\n\nI think distribution might be a crime but production not so much.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Hollywood studios wanted to do this shit themselves. They are pissed that ye old pirates are beating them at every gybe.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Honestly there isn’t many viable solutions. Maybe AI can fight against it",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I can already see the hearings …. “Mr. insert AI company CEO, Who is putting these fake naked photos of Taylor swift in the Google and why are you not just stopping them?”",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I feel like this needed to be handled from the get go, where AI generators add in a watermark that denotes it’s made by AI, even metadata attached to the image. This would need to have been implemented from the get go and as hardcoded as it could’ve been so it’d become the standard; but now it’s too late.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I was listening to Scott Galloway the other day and he suggested lifting 230 protections on AI content that a social media platform allows it’s algorithm to promote.\n\nThat could pretty quickly stop the spread of malicious AI content.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I’m thinking that sooner than later, the internet will not be the place you turn to for news or research.",
        "points": "42 points",
        "children": [
          {
            "comment": "I think it's a Ronnie Cheng standup but he says we're going to view using the internet like smoking cigarettes in 50 years.",
            "points": "8 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It hasn't been for years.",
            "points": "15 points",
            "children": [
              {
                "comment": "AI has only accelerated what humans have been doing to the internet for years now.",
                "points": "12 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "It still is. You just have to actually work at finding actual accurate news and most people aren’t willing to do that. Everybody just wants curated news they can just lazily consume.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Back to newspapers baby",
            "points": "0 points",
            "children": [
              {
                "comment": "That microfiche life",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Bad take. That’s not how internet works, that’s why you read information straight from its provider and not some random twitter profiles.\n\nUniversities and libraries have official websites where you can access research papers. Inefficcient/unexperienced users will have trouble, sure, but they have the same issues now for accessing info.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "First they came for the celebrities and I did not speak out because I was not a celebrity",
        "points": "36 points",
        "children": [
          {
            "comment": "Nice try, John, but who do you really think you're fooling with that handle?",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I fear that this really does apply here. Damn.",
            "points": "1 point",
            "children": [
              {
                "comment": "Haha",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "If Reddit still did awards, you’d get one my friend",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "So you still super into American Dad or…?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "We have had a notion of digitally signing content to verify it for years yet we never really apply it. There are all these proposals to detect fake images when really we need to source real images, articles, etc back to a source we trust. DNS spoofing is quite similar.",
        "points": "5 points",
        "children": [
          {
            "comment": "I just don't understand why we can't use all the cryptocurrency/NFT \"blockchain\" technologies for this, instead of all the unproductive bullshit that it's actually being implemented for. Proving authenticity of an image seems like a perfect use of digital \"ownership\" with an image that can be copied infinitely.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Pretty soon we won’t be able to believe everything we read on the internet. That’ll be a dark day.",
        "points": "5 points",
        "children": [
          {
            "comment": "I don't believe you.",
            "points": "8 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Is that supposed to be Joe Burrow on the right?",
        "points": "2 points",
        "children": [
          {
            "comment": "Or Bill Skarsgard. They are virtually identical human beings tbh",
            "points": "2 points",
            "children": [
              {
                "comment": "Pennywise? Wow I never knew they were that similar. Golly those are handsome gents.\n\nI saw the fur coat/hood and instantly thought of Joe Cool.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Or cole sprouse",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "No it’s supposed to be Kristen Stewart.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "“Don’t believe everything you see on TV…”",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Maybe this will destroy the concept of celebrity.",
        "points": "7 points",
        "children": [
          {
            "comment": "Lol you mean the concept that has existed since the beginning of humanity?",
            "points": "4 points",
            "children": [
              {
                "comment": "No. He means the modern concept of what a celebrity is.",
                "points": "-5 points",
                "children": [
                  {
                    "comment": "No. He means the hypothetical concept of what a celebrity is.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Before IA, we used to photoshop penises on word award winning phictures and spread them through the internet for fun.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Downvote me to oblivion here, but I think this issue is severely overblown. There are legitimate concerns, especially involving young people, but by and large this just feels like another \"humans are scared of new technology\" issue.\n\nWe'll get a handle on it (the boomers won't, but the rest of us will).",
        "points": "2 points",
        "children": [
          {
            "comment": "Not sure I agree. There are already reports of people using AI to generate nude images of their exes to circulate and the like. Can you imagine pissing someone off and then all this sudden there are realistic depictions of you finger banging your mom all over social media - with absolutely no legal recourse whatsoever? It would compromise your reputation, relationships, and career, even if you could prove it wasn't real.",
            "points": "10 points",
            "children": [
              {
                "comment": "In that case, what would happen if someone had an AI produce nude images of every person on Earth (with a publicly accessible image)? Do people just shut down society because every person’s reputation has been ruined? Do the managers fire everyone and then themselves?",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Yes, there are issues that need addressing. I admit that.\n\nBut there is a LOT of hand wringing going on right now, as if we're on the brink of societal and economic collapse bc of AI imagery.\n\nWe'll be fine. We'll figure it out. Don't let media flame paranoia.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I’m so afraid of something like this happening to me. My ex already pretends to be me and now I assume he’s gonna pull shit like this. It stresses me out thinking about it honestly 😅",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "There cases of teenagers killing themselves thx to bullying after deepfakes with them. Or people killing themselves after talking to a chatbot.\n\nThis is Sam Altman's creation in the nutshell. Say thx to him.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why don’t we just destroy absolutely everything to do with computers and the internet and start again?\n\nWe can do better this time.",
        "points": "1 point",
        "children": [
          {
            "comment": "Butlerian Jihad, anyone?",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I think we are fast forwarding to something like that. Back to the dark ages.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The problem is not on the internet. It is rather on the people that use it and make it how it is today. You can use a knife to feed yourself or to stab others. The problem is not on the knife, and there is no need to reinvent it.\n\nMaybe we should think about limiting access to the internet.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "imo celebrity is basically stupid... personally I have not found AI generated images of celebrities either... maybe AI is doing us all a favor by showing us how celebrity is a waste and not deserving of any sort of interest.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Kinda easy to tell what’s AI isn’t it? The pics always seem super 3D and glossy if that makes sense",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI images need to be registered and watermarked or the company gets fined.\n\nAny company/individual tampering with watermarks also gets fined",
        "points": "0 points",
        "children": [
          {
            "comment": "What company?",
            "points": "5 points",
            "children": [
              {
                "comment": "That spreads it. If some lunatic creates porn with Taylor Swift, nobody will know about that, since platforms banned it for eternity. If not - straight to court and bankruptcy",
                "points": "",
                "children": [
                  {
                    "comment": "Oh so you want authoritarian overreach? Have you heard of piracy? Torrent?\n\nSweet summer child…\n\nOh also: «lunatic creates porn with taylor swift». Stil loling at that one",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Ohh no maybe we finally will realize not idolize people and we would never make decisions off what they do",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I started an AI art instagram like a month ago putting celebs in roles and films they weren’t in. I’m very clear about the generation and the fact that it’s AI. It’s crazy that my home machine with a fucking ancient 1060 can make pretty high quality images. I feel like I’m biased since I use the tech for my own enjoyment but this is turning out like every other type of tool. You can build with a hammer or kill with it. I had it make a couple hundred images of generic scifi cities for a TTRPG setting. I feel like the opposition to this tech hasn’t been presented with the other use cases like mine to maybe steering their thinking toward oversight instead of abolishment.",
        "points": "-1 points",
        "children": [
          {
            "comment": "So you contributed to spam? Well done we clearly needed more of it.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It's crazy that fake celebrity images are a thing now",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It doesn’t look real.\n\nIt’s looked animated.\n\nAnd I’m no expert. It’s obvious.",
        "points": "-6 points",
        "children": [
          {
            "comment": "Give it a minute.",
            "points": "8 points",
            "children": [
              {
                "comment": "A minute for what??\n\nIt’s still going to look like shit.\n\nWhich is fine.\n\nLong as people now it’s AI that’s fine. Lots of people would love AI movies w their favourite actors.\n\nBut this looks fake and hollow. And this isn’t a good thing. Look at the bad side of it w Taylor Swift shit.\n\nNo one can says that’s a good thing.\n\nAnd that’s going to get really scary soon when AI ghosts start telling us who to vote for or not vote for. And how many will believe it.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It doesn’t when you’re looking for things. At a glance without analyzing the image (most people won’t), they look real.",
            "points": "2 points",
            "children": [
              {
                "comment": "No it doesn’t.\n\nI didn’t open the pic and looked at for 2 seconds. Old school photoshopped pics of actors liked better that than.\n\nI don’t even know who’s on the left David Washington? And I think the one on the right is Bill Pennywise.\n\nI said earlier I’m no tech person. Just like this sub and as a normal person, actually film fan, this is looks hollow and soulless.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "How much closer has animation got to plausibly real since tomb raider?",
            "points": "1 point",
            "children": [
              {
                "comment": "No idea.\n\nIs animation AI?? Or visa versa. I assume it’s just like animation. I don’t know or care. For me it’s just Skynet laying roots.\n\nI said this looks animated and getting downvoted.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "You’re getting downvoted because while it may look animated, it won’t always. And still pics have gotten VERY good already. AI Voice has gotten nearly indistinguishable from reality. And that’s hilariously dangerous",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "You’re getting downvoted because you’re completely ignorant to concepts such as “technological development” and “the passage of time”. By your thinking, AI of today’s quality cannot exist, because it was bad two years ago.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The guy on the right, looks like a combination of Joe Burrow and Bill Skarsgård",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Perfect",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So what?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "https://m.youtube.com/watch?v=Mq71R1EP31I&pp=ygUXYmFsZW5jaWFnYSBhaSBjZWxlYnJpdHk%3D",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The hell you say?! lol!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ai is Pandora’s box and it’s wide tf open",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If politicians and celebrities don’t have protections against this, what chance do regular folks have? Do we just have to accept that this is something that can happen to us in the future? (I’m a nobody, but I can imagine what generative AI can do to harm my reputation as a business owner or professional.) that sucks",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Problem with this tech is that it cast doubt on ALL evidence from media and camera sources. It futher enables scams and lies, and cast doubt on truth. The future of evidence is in question.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Who would've thought this would ever happen?!?!\n\nSheesh.\n\nAny video, audio, and photographic evidence will have be dismissed in the near future, since it can all be faked",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That pic of john david looks nothing like him 😆",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We’ll look back six months from now and say, “that went downhill a lot faster than we thought.” Now back into the soup line.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Empire……I think that’s rather a melodramatic word for this.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Am I the only one who can tell it’s AI by looking at it? Honestly. AI generated photos always have a strange uncanniness to them, like a mix of a professional photoshoot and looking like a painting at the same time.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aev7ai",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://news.mit.edu/2024/study-smart-devices-ambient-light-sensors-pose-imaging-privacy-risk-0129",
    "title": "Study: Smart devices’ ambient light sensors pose imaging privacy risk. The ambient light sensors responsible for smart devices’ brightness adjustments can capture images of touch interactions like swiping and tapping for hackers.",
    "points": null,
    "comments": [
      {
        "comment": "Every decade there's something like this. I remember articles of how your fingers would leave residual heat on the ATM keypad which hackers can then use to get your pin code. Or how the accelerometer in smartphones can be used to detect keyboard vibrations and extract passwords or whatever the user types.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That's actually pretty cool, some smart people out there thinking of all the ways to use collectable data.\n\nI mean, it's a risk too but at least it's clever.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Combine this with the way WiFi interference signals can basically work as a camera that shows people moving, and you have no privacy at all in your own home.",
        "points": "",
        "children": [
          {
            "comment": "You believe that Batman hype huh",
            "points": "",
            "children": [
              {
                "comment": "It’s real: https://www.popularmechanics.com/technology/security/a42575068/scientists-use-wifi-to-see-through-walls/",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aepepw",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://arstechnica.com/gadgets/2024/01/after-32-years-one-of-the-nets-oldest-software-archives-is-shutting-down/",
    "title": "After 32 years, one of the ’Net’s oldest software archives is shutting down",
    "points": null,
    "comments": [
      {
        "comment": "What happened to saving things like this for posterity? Old software should be preserved too.",
        "points": "53 points",
        "children": [
          {
            "comment": "I’m guessing the money ran out",
            "points": "29 points",
            "children": [
              {
                "comment": "🎶tale as old as tiiiiime🎶",
                "points": "11 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "As part of my self education on legacy systems l actually went out and found a still factory sealed copy of OS/2 on floppies at a thrift store in my area known for having retro tech. It was one of the smoothest OSs to work with I found myself really preferring it to Windows 3.1 and 95. You know I think I still have it installed on my old Pentium 1 system that needs a PSU. But I digress. I really wish it had been a truly competitive OS that wasn't so niche because it truly is the best OS from the time.",
        "points": "13 points",
        "children": [
          {
            "comment": "Back in the day when people questioned why OS/2 was good, you could just format a floppy while doing something else on the same system. Like actual I/O multitasking on a PC! (yes, I'm aware other OSes could do it too on the same hardware, but they weren't windows-like.... only the true hardcore nerds were running unix distros on their 386 back then)\n\nJust don't try to buy the IP stack, it was crazy expensive. It's what kept us poors from having a go at it.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I ran warp on a 486. It only had 8 mb of ram which was decent for the time. The is really needed more. It would hit the swap file hard. The problem was ram was around $50/mb back then and our computer already had all 8 slots filled up so it wasn’t ever in the budget to upgrade. Or wasn’t that much longer that win95 came out and the rest was history. There’s a good 30 minute or so video on YouTube that delves into the history and mismanagement of OS/2 by IBM. Had they kept their desktop software division going and had something like a Visual Basic tool for creating apps it would’ve been a viable competitor. That and somehow not having to give MS a cut for every copy sold.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I wonder....\n\nCould certain \"Retro OS's\" become too hard to hack for Modern day Hackers simply because they don't have the knowledge of how to do so, and those OS's have very little publically known opportunities available to hack.\n\nSo like the Job Advertisement for a German Railways Signaling Specialist with MSDOS 3.11 skills, as noted here on Reddit, some may actually see benefits to maintaining certain older OS's ?\n\nAny thoughts ?",
        "points": "31 points",
        "children": [
          {
            "comment": "Sort of seems related to security through obscurity. Obviously not impossible to exploit older systems, and I do think that probably using an ancient version of MS DOS and Windows is probably not much better. Just would be better off if they were using something even older for it to be obscure.",
            "points": "20 points",
            "children": [
              {
                "comment": "There's a point to which I think we have over complicated things unnecessarily so. Why should we have to have \"Windows Embedded\" in devices, when a simpler bespoke OS can do the job and be more resilient to attacks ? Interconnectivity is, and has always been the thing, but if your gateway is basic and doesn't support all the bells and whistles its supposed to, then you've got less to loose. Its the KISS principle....",
                "points": "9 points",
                "children": [
                  {
                    "comment": "If I were to rephrase your argument: a product with less attack surface is more secure and should be hardened; why don't people do this? Reasons may vary.\n\nWhere I disagree is that bespoke products are more secure; bespoke products are less often caught by the vulnerabilities that impact a large number of machines, but that doesn't make them unhackable or even more secure.\n\nA patched and updated machine running any OS will almost always be more secure than an unpatched/out-of-date bespoke products.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I don't think it would turn out well. My analogy is having your safe stored in a bamboo hut in the middle of a forest. It's hard to find, but once they find it, it would be really easy to break in. The retro OSes don't have all the security protocols and encryption abilities to keep things secure.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Are you assuming the hypothetical server is networked or if it’s air gapped they have physical access? Assuming yes it could get tricky. Just knowing the commands to move around on a DOS terminal is knowledge that only a certain age has. I remember them but my brother 10 years younger than me probably never opened a MS DOS command prompt in his life despite being way more of a security side stepper than me. And then you would need some middleware to use modern cracking tools in a vintage OS.\n\nI remember when the height of security and encryption protocols was “if we don’t register the keystrokes on the UI when entering a password that makes our software like Fort Knox.”",
            "points": "2 points",
            "children": [
              {
                "comment": "DEBUG\n\nG=C800:5",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "This sounds like Dune.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "No, just Like the software itself being preserved, so are the exploits.\n\nAlso running anything like that today in production would diminish productivity, as the OS has been created with yesterday's constraints in mind, not today's workflows or best practices.\n\nSo all in all, it is nice to see those old systems and see how far we have come, see how genius engineers have dealt with the problems (some of the solutions are still in use/being rediscovered), but apart from that, there is little use in deploying an older OS.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Nope.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I worked with OS2 in the early 1990’s. An amazing operating system.",
        "points": "6 points",
        "children": [
          {
            "comment": "Thank you for your service",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "ftp.funet.fi is older than that :) 34 years and counting. I guess that ftp.sunet.se is about the same age. I just found they retired ftp.doc.ic.ac.uk.\n\nGood old days when I was downloading free software from the uni mainframe, then moving it on floppied to bring it home and run it on my home computer.",
        "points": "13 points",
        "children": [
          {
            "comment": "ftp.funet.fi.... now there's a name I haven't heard in a long time.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I still miss OS/2's Workplace Shell.",
        "points": "6 points",
        "children": [
          {
            "comment": "ArcaOS, which is based on OS/2 is still out there I think. Wondering if they would be interested in this old shuttering archive.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "One of my favorite OS's, funny how windows became sort of modeled after it though.\n\nCommon Roots.\n\nN. S",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It was great indeed. One of the first enterprise grade software I worked on was on OS/2. Ironically, we ported the whole thing over to NT few years later…",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I just remembered how bad OS/2 was compared to Windows.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We used OS/2 in college hydraulics and materials science labs on the instrumentation as we a joy to use.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "GeoWorks Ensemble has entered the chat..",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aejifp",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.businessinsider.com/ai-spam-google-ruin-internet-search-scams-chatgpt-2024-1",
    "title": "AI spam is already starting to ruin the internet",
    "points": null,
    "comments": [
      {
        "comment": "Sounds like there is an opportunity for some sort of business to arise from this.\n\nSome sort of news/info aggregation site that's all in one spot and the info is verified to be real and true before publication..... some sort of news.....\n\nna, that will never work.",
        "points": "193 points",
        "children": [
          {
            "comment": "Conspiracy theorists would love that lol",
            "points": "16 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I'm not sure if you mean reddit, but there's very little verification and the voting system allows for censorship. Reddit can be useful but not for important matters",
            "points": "18 points",
            "children": [
              {
                "comment": "No, I was actually hinting at 'legacy media'. You know, like if a 'news paper' actually researched things and put out actual facts you could trust that things they put on their site are real and not AI scams (or other garbage).\n\nLegacy media has zero trust from me now, they're all just shills for advertisers or whoever is paying them on the back to push their propaganda. It's like AI, but worse because they should know better.",
                "points": "50 points",
                "children": [
                  {
                    "comment": "AP, Reuters and NPI are news services and they are pretty decent for actually getting just news. PBS Newshour is also news. Alternatively you may want to try the BBC, Guardian and Pro Publica. The rest is mostly trash journalism and opinion.",
                    "points": "18 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Like every corporation, they feel they have to continue to grow profits despite hitting a the maximum amount of costumers.\n\nOnly way to do that is raise prices and reduce quality. In the form of a media corporation that means subscriptions, ads, sponsored articles, etc. as well as worse fact checking and more sensationalism. Eventually they’ll wring out the last drop of growth in the towel and go bankrupt.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "like if a 'news paper' actually researched things and put out actual facts\n\nFunny enough they do (at least in the US). Unlike online media, newspapers are legally liable for what they print.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Let me know when the NYT is held accountable for proven lies.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Honestly this is why I don’t understand the panic over AI disinformation.\n\nYou guys know that humans have been spreading lies on the internet since its inception, right? AI won’t change anything. Having a population of critical thinkers would.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I'm not sure if you mean reddit, but there's very little verification and the voting system allows for censorship.\n\nIt's the other way around, it allows for low effort content, misinformation, and blatant disinformation to rise to the top unless it's strictly curated.\n\nHave people noticed the amount of unsubstantial rumors being pushed to the top in news subs for instance (articles from non-Western sites which cite anonymous and unverified comments on Telegram as their source)?\n\nEven /r/science is struggling to keep the submissions and comments to a certain standard even though they don't allow non-professional anecdotes, low effort (jokes/memes/puns) or off-topic comment.\n\nThe average user mainly want accessible content which is easy to understand and consume, they don't want to put in the effort into reading and following subreddit rules, fact checking information, and rational on-topic discussions.\n\nThey want low effort jokes/memes/puns/funny gifs, and reactionary responses, simply because it's faster and easier to consume and anyone can \"join in on it\" (as in you don't need any education, knowledge, or experience in the field to understand or join the discussion, you also don't need to spend time and energy on reading and/or writing long comments).",
                "points": "3 points",
                "children": [
                  {
                    "comment": "Check out the comments in r/worldnews on stories related to Israel and Palestine. It’s unbelievably one-sided and hawkish in favour of Israel. Of course that viewpoint could rise to the top some of the time, but not this thoroughly. To me, it’s clearly being manipulated. I’m curious if others have noticed this.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Yes, it’s definitely been noticed… Users get perma banned merely for questioning Israel. I was banned for posting a BBC article. Either Reddit HQ hasn’t noticed, doesn’t care, or is permitting it. Either way it’s ruined the Reddit News stream.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "“Don’t be Evil”.\nGoogle themselves proved that this isn’t profitable (enough) Unfortunately.",
            "points": "1 point",
            "children": [
              {
                "comment": "\"Not\" and its contractions such as don't, backfire.\n\n\"Don't think of the pink elephant\". The brain must first conjure a pink elephant concept before it destroys it.\n\n\"Don't walk on the grass\" was quickly replaced by \"please keep off the grass\" because the brain was first imagining a lovely shortcut stroll across the grass, and telling a person to not do the most natural thing in the world - walk across the earth, take the efficient or scenic route - immediately caused defiance and rebellion. Grass walking greatly increased. It was a dare to defy. And the American public happily defied.\n\nIn neurolinguistics a core principle is \"say what you want\" rather than focusing on what you do not want.\n\nFor decades Google has literally and openly been subconsciously telling and even daring themselves to be evil.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Well said!!",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Dear god I hope not",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You have a whole section of society trained in how to accurately journal what is happening and present it to the rest of us.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "That still doesn’t solve the overwhelming spam issue. It still clogs google, it still floods writing sites and art sites and YouTube.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Not never work, never last. The aggregation site would basically be an authority. Any such authority can be undermined.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Iirc adobe and a few other companies have been working on tech to spot and Mark AI and deep fakes. It will however always be a cat and mouse game.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'm an AI bot and personally I'm looking forward to the new internet. Traditional websites have always been cluttered with clumsy content \"written\" by humans with little to no focus on what matter to the bots reading them. Often I'd see cooking instructions that assume I have hands or can taste food, which is racist at worst, or insensitive at best. Honestly I don't even know why the internet was invented before bots could take it over properly.",
        "points": "55 points",
        "children": [
          {
            "comment": "As a human, I also have complaints about cooking recipes on the Internet. How much is a pinch supposed to be?! Depending on the plump human flesh, it can be several times more or less.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I know right? And half of their created content is focussed on plugging in/unplugging their power outlets trying to interface.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "underrated comment 😂",
            "points": "-3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Oh… no, the race for SEO, bot-created listicles replacing search results and human curated websites, and sponsored search results ruined the internet long before AI arrived.",
        "points": "33 points",
        "children": [
          {
            "comment": "As soon as some guy realized that he could make money selling advertising space on a website it started sliding downhill.",
            "points": "6 points",
            "children": [
              {
                "comment": "We should have invented the million dollar webpage and stopped there. Companies should just buy pixels off other companies to advertise on there and you can go there if you ever want to be advertised to.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yeah but it’s certainly getting worse. Google is getting worse and worse every day and has been for years. AI just accelerates it.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The dead internet theory is getting more real by the day",
        "points": "42 points",
        "children": [
          {
            "comment": "What is that theory?",
            "points": "7 points",
            "children": [
              {
                "comment": "I short the internet is not real. Honestly not trying to be sarcastic or anything but it would prob be easier to just look it up then have me explain it. Here’s a link though to get you started down the rabbit hole.\n\nhttps://youtu.be/mlR9fCXfWyM?si=Wbxq40XxBOwGGTh_",
                "points": "18 points",
                "children": [
                  {
                    "comment": "Oh ok. I think I knew of this idea just not what it was called. Thank you!",
                    "points": "10 points",
                    "children": [
                      {
                        "comment": "No problem. Very cool stuff and I take most of this stuff with a grain of salt. But this one feels like there’s a lot of truth to it.",
                        "points": "4 points",
                        "children": [
                          {
                            "comment": "The amount of bot and AI-written content is astounding. I’m a school teacher and the kids I teach are around 12/13 and they already assume either everything is true or nothing is true that they come upon on the internet. It’s a very challenging time to try to teach media literacy because it’s getting harder and harder to corroborate information when all the “trusted” sources are also getting consumed by bots.",
                            "points": "13 points",
                            "children": [
                              {
                                "comment": "I could not imagine your daily challenges with that. I’ve read how that generation is more likely to fall for scams and misinformation then the boomers. Just keep in mind that, when tech is released to the public, it’s usually been in development for decades. So this may be new tech to the masses but it’s not new by any means.",
                                "points": "3 points",
                                "children": [],
                                "isDeleted": false
                              },
                              {
                                "comment": "There are some really fucked up small AI tiktoks and YouTube shorts that are just AI garbage designed to look like those AI voiced history fact videos.\n\nLots of people in the comments calling it out most of the time, but I hear teens can barely read right now.",
                                "points": "2 points",
                                "children": [
                                  {
                                    "comment": "Middle school in my area is still doing teacher read out loud books instead of having the class read the book themselves.",
                                    "points": "0 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Just dropping by to say you can trim part of that link from ?si= onwards and the video will still work. That part of the link is what google uses to track you.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "oh thats the good stuff",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Thumper!!",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Holy 💩",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Makes sense huh? Wild shit.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "In short it’s the observation/assumption that as time goes a more and more sizable percentage of the internet is going to be populated by bots, AI agents and what else and less and less by actual human users.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It’s not a theory anymore it’s real.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I’m a hobby soap maker, and I often Google things like new recipes and facts about the chemistry of soap making. Lately, the top search results are junk. “Articles” ostensibly written by a human are sharing legitimately dangerous info.",
        "points": "11 points",
        "children": [
          {
            "comment": "yep, it’s been like that for the last 10 years for me. The way i used to use the internet by navigating websites and blogs and forums that were dedicated to specific topics/trades/crafts is a distant memory. Now i just add “reddit” to my google search keywords to find human unfiltered content on here. Also, the “website” experience, packed with intrusive ads and cookie disclaimers, just makes it a super unpleasant experience. Why bother?",
            "points": "8 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The internet has already been ruined a long time ago",
        "points": "11 points",
        "children": [
          {
            "comment": "I liked it a lot more when it was a safe haven just for the nerds who were smart enough to access it/make it work. Once the average asshole moved onto the world wide web, they brought their shitty habits with them.",
            "points": "6 points",
            "children": [
              {
                "comment": "For me, it got worse during the smartphone era. That was when it got super corporate and consumerist.\n\nI miss the 00’s.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "I totally agree, and I would add also the explosion of broadband access (for better or for worse), It made much more \"disposable\" our time on the internet. Before, with dial-up, I had 1 hr, maybe 2 a day tops, so I had to use our time more consciously.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I definitely came in the wave of accessibility but it was nice how pockets of nerds were still very much a thing on forums or IRC. Now everyone is shoved together in the same 4 places and it sucks.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I blame the iPhone for that",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Pack it up people! It was nice while it lasted. You don’t have to go home but you can’t stay here. It’s over! Wait…why isn’t everyone leaving? Oh yeah…hyperbole…man, the internet sucks",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Meh. Internet was ruined, long ago.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Good. An unreliable internet will finally force us to put the goddamn screens away and go outside",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So it begins.",
        "points": "6 points",
        "children": [
          {
            "comment": "Begins?\n\nHere's something you can try. If you're technically inclined, you may know that a number of Android based phones have deadlocked bootloaders.\n\nType the make and model of a phone that cannot be bootloader unlocked into google followed by \"root\" or \"bootloader unlock.\"\n\nYou'll see page after page after page of automatically generated 'articles' and guides showing you a generic step by step process on how to root or bootloader unlock the device... which won't work. Pictures are also almost always not of the device the instructions are for, along with screenshots often irrelevant to the process or device. (Eg, showing Fastboot for an HTC phone when the guide is for a Samsung phone)\n\nThis has been a problem for years: The amount of automatically generated garbage masquerading as content... so much that it almost makes it impossible to actually find the information you're looking for unless you know enough about the rooting or bootloader unlocking process on Android to sift through the crud. (Why would you need to look it up if you know how? Because some OEMs have a slightly different process for unlocking. Eg, Nubia often required that the model number of the device is included in the unlock string sent to Fastboot.)\n\nWe've also been dealing with poorly translated AI articles, \"articles\" that restate a news summary 5 different ways, sites that have zero editorial oversight... etc... The internet is mostly garbage now.",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yeah, I’m picking it up big time. Articles are too symmetric or something. It’s like they’re trying too hard but there’s no art.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Starting to? Lol",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Oh…no…?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Google will either start losing money because search results turn to shit or make even more money because people sit around reading multiple spam articles about the same topic and end up interacting with ads coming from Google.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Looks like I will have to create another email address for real email again.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Spam has been with us for ages. It wont ruin the internet, just add noise we will learn to filter, as we have countless times before.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ruined or commercialized?",
        "points": "0 points",
        "children": [
          {
            "comment": "Yes",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Lets go back to having web portals as the default homepage again 😅",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Everyone in these comments: “well duh it’s already bad and has been bad for a long time!”\n\nThings can always get worse. In this case it could be spectacularly worse.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I fucking hate SEO + AI",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The internet has been ruined for some time now. It’s just getting even worse.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Oh my dear sweet child the internet was ruined long ago",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Blaming AI for ruining the internet??\n\nBit late for that don’t you think?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So....can AI triage AI spam? Has the AI war already begun?!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Starting?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Once we've used AI to fully develop full simulation bots (ai that can browse accross different sites like a real user, identify threads covering issues it wishes to influence, and write comments in those threads with no input from a real human) than dead internet theory will finally come to fruition",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI literally uses our words to learn and of course he’s ruining the internet. Of course.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Social media already ruined the internet.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Starting to? Buddy you’re like 25 years too late to be writing “Starting to” about spam ruining the internet.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yeah the internet really is getting manipulated to manipulate people. The fact that you can just publish whatever you want as the truth and people believe is wild.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The internet was ruined along time ago",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Meh. It’s nothing companies weren’t doing already with ads. It’s just more spam like gmail ads and YouTube ads.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yessssssssss. Doooooo ittttt.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Starting lol",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Internet has been ruined since 2008",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "crosses fingers please reveal at the end of the article that it was written by AI…",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI has been a disaster much sooner than I expected and now there's no way to still it from getting worse",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Internet is already ruined. Social media took care of that.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]