[
  {
    "id": "t3_1adcd1b",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1adcd1b/ai_assistant_more_than_4000_pdftxt_files_analyze/",
    "title": "AI Assistant, more than 4000 pdf/txt files, analyze and reason",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1adc967",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "https://asiatimes.com/2024/01/samsung-to-build-all-ai-no-human-chip-factories/",
    "title": "Samsung to build chip factory run by entirely AI. No human labor involved",
    "points": null,
    "comments": [
      {
        "comment": "OMG so you mean to tell me even with government subsidies and the potential for new jobs, companies are going for the lower-cost options 🙃\n\nTech workers should unionize and and should have unionized a long time ago when conditions were favorable in my opinion. Good luck everyone else.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "TL;DR Samsung Electronics is planning to fully automate its semiconductor factories by 2030",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "How many times do I have to see some AI or robot news and think \"this is how it began\"?\n\nCue some android in the future making record scratch freeze frame \"yep, that's me..\" videos of his life, starting with a story of an AI-controlled automated factory.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1adc7b5",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "https://www.businessinsider.com/instacart-ai-art-recipes-photos-2024-1?utm_source=reddit&utm_medium=social&utm_campaign=insider-artificial-sub-post",
    "title": "Instacart is using AI art. It's incredibly unappetizing.",
    "points": null,
    "comments": [
      {
        "comment": "TLDR:\n\nInstacart is using generative AI to create photography for its recipes.\nThe recipes themselves are written by AI, as publicly disclosed by Instacart.\nMany of the photos have quirks making the food look disturbing or absurd, or a mixture of the two.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "BI is trash",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m not paying or subscribing to this bullshit. There’s no reason to put a paywall or subscription requirement on online news articles. I’ll find the story on another site if it’s available. If not, screw it. It’s not that important.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1adad7s",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1adad7s/what_is_appealing_about_aicreated_music/",
    "title": "What is appealing about AI-created music?",
    "points": null,
    "comments": [
      {
        "comment": "I don’t care where a song comes from. I can’t understand this mindset. If a song is good it’s good.\n\nThere are artists I love who will never make another instant classic again. If some machine could hand me 5 new Beatles albums or Pink Floyd albums, and they were good? Why would that not appeal?\n\nAdditionally I believe that a well promoted ai song has a greater capacity to be moving and high quality than a human made song if the human is only interested in crafting a hit by following popular trends, for the purpose of making money, as many do.",
        "points": "16 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I appreciate the unique perspective AI offers, even if it doesn't resonate with me personally. It's a fascinating new frontier in music creation.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So if I had a painter paint the vision I had in my head while having them make adjustments as I go: who is the artist? It was my vision, but they did the work. In my personal opinion these are two separate things: talent and vision. You respect the talent that goes into making things, we respect the vision. To us, it doesn't matter how we got to end result, what matters is that the artist is able to adequately express themselves. AI is a new avenue of expression. But you are absolutely welcome to dislike it the same way our parents hated on Rock N Roll, Rap and Electronic music lmao.\n\nEdit - And another question to help reframe this more: how great is the greatest painter if he has no creativity? It doesn't matter if you have all the techniques down if you lack creativity.",
        "points": "4 points",
        "children": [
          {
            "comment": "If you write \";\" you get a pretty damn good ai painting but how is that you being creative? Try it multiple times and you can get different beautiful variations. Multiple people writing the same prompt (usually not a super detailed one) gives them all different beautiful variations.\n\nWhatever ai generates is a collective creativity of all do humanity, its data and algorithms.\n\nThere is no way one can be that precise in describing in words what exactly they imagine. AI is always going to add its creative touch.\n\nSo AI is far from avenue for expression.... People are not being artistic by vaguely describing something and letting AI take care of all the details.\n\nIn fact, if one writes a really detailed prompt of the vision they have in their head (quite difficult to do), I doubt AI will do much differently than a vague prompt.\n\nPeople are really starting to be delusional... This is same thing as saying being an influence is an actual job.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Your argument is black versus white. In the future the most likely outcome is a hybrid of AI and human elements going into making music and all media, just as technology has been integrated into music for the last few decades.",
        "points": "4 points",
        "children": [
          {
            "comment": "That's a good point. Probably the more human involvement there is, the more likely I'd start to find it interesting to listen to, as that would be veering back towards what I think of as real music (i.e. made by a living thing).",
            "points": "0 points",
            "children": [
              {
                "comment": "Its good that you can keep an open mind about it, and look at it as a tool, not a complete replacement for creative work.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I love music, regardless of how it was created. It can be from rain against my window, a heart broken person, a functioning addict, or an AI created symphony",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "From listing to some of the suno.ai tracks, there is a distinct feeling of hollowness in the music. It might be related to what you’re describing.\n\nI think it will be more successful generating muzak/elevator music, and other non-offensive music meant to be in the background. At least for now",
        "points": "1 point",
        "children": [
          {
            "comment": "Tech moves forward. Generative ai music a year ago sounded incoherent. In 5 years you will not have the same experience",
            "points": "4 points",
            "children": [
              {
                "comment": "That’s why I said “at least for now”",
                "points": "3 points",
                "children": [
                  {
                    "comment": "True fair enough",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It sounds bangin?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The fun thing about art is that it's value is subjective.",
        "points": "1 point",
        "children": [
          {
            "comment": "I agree with you on that for sure. I just am not sure I even consider it art if it's not created by a living thing.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "There was already an abundance of soulless music out there before AI and some people love it. The track itself should speak for itself. If you like it, you like it. Doesn’t matter where it came from. Though I also do not care about who wrote or performed the music I listen to begin with. I understand some people care a lot and know all the band members names and get a little obsessed with them, but that’s not how I roll. In other words, I don’t give a shit, Dee.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You are talking about the fact that you dont like AI made songs...\n\nThey are getting so good that I just don't think you'll be able to notice in a year or two",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I just don't care about people I guess.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There's nothing appealing about it. Music is art. Good art comes from the wild, mad & warped minds of human beings who make it.\n\nAI will be able to make music that sounds technically perfect. If you find yourself enjoying AI-generated music in the future, like if it becomes your thing, know that you're a tasteless bore and you should keep your opinions about music to yourself.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have ideas for very specific songs in very specific genres, yet little in the way of music theory to create what I want to hear.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If the music is good, the music is good. No matter who or what created it.\n\nSame as all other art. 99%, I don't even know who created the shows and random music I consume, and it doesn't matter to me, could as well be AI-generated for all I care. If I enjoy it I enjoy it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nothing that I’ve heard. I went to a Google IO, they had all kinds of presentations demonstrating it, they worked it into concerts for two major acts that they put on. It was just terrible. It didn’t have what I guess I would describe as a strong identity. It was just mush.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don't enjoy music, or art, or anything else because of who or what created it; I enjoy it because of what that song or image evokes in me when I experience it. (And in the case of AI-generated art, there's still a human in the loop, guiding the process so that the final result \"says\" something, reflecting whatever they envisioned and their personal aesthetic sense.)",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "for me, it's created by analyzing the sum total of human created music which already has all that mystical garbage you presume you'd be able to listen for.\n\nhave you heard? most human created music truly sucks. the songs you've heard? that is like less than 1% if the music that humans have created. it sucks so badly that nobody would ever train ai on all of it because then it would suck much worse too.\n\nif it's good music, it's good music.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Humans run on algorithms more than we realize. Ourr emotions are simulated by the brain just as every single sensory input is—we have no direct experience of reality, it’s all simulated in our brain. Truth is, we are more like AI than we realize. Our brain just has the incredible ability to process data on very low power—about the amount it takes to light a dim light bulb. That’s the main advantage we (currently) have over AI. In the end AI will create amazing music because in fact, most human music follows theory, which is a set of rules and ultimate an algorithm. Emotions are a simulated illusion. Intelligence is the real product and humans don’t have the sole authority on intelligence. We just like to think we are extra special.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I understand your perspective on this matter, especially in this era of AI art. The current generation of music AI models hasn't yet produced anything that resonates with me personally. However, I believe that as these models evolve and improve, everyone — including you and me — will eventually experience a moment of connection with a piece of music. It could be a moment when you can't resist dancing, feel chills, or even become emotional and tear up. This can happen in various contexts and circumstances, making it difficult to discern whether the music is AI-generated or not. And honestly, it doesn't matter. I think that moment will shift many people's perspectives once they experience it. I'd also argue that a significant part of our connection to music is not the intention of the artist who created it but how our brains have adapted to processing sound through lifelong exposure to music and associating certain sounds and songs with important memories. As someone who has been producing music for 8 years, I believe the experience of music is about listening to the piece, not so much the process behind its creation. That's how you determine if it sounds pleasant. Besides, if you find out a piece was AI-created after you've already enjoyed it, would you change your opinion? My point is: if you can't tell the difference, does it really matter? Most music consumption is now digital, and there's no way to tell if it's AI-generated if the quality matches that of human creation. Making the effort to manually check all of this seems excessive and unrealistic.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ad90fw",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1ad90fw/are_there_any_ai_meeting_note_takers_that_work/",
    "title": "Are there any ai meeting note takers that work with Whatsapp calls on my mobile?",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1ad78xn",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1ad78xn/social_media_analytics_with_ai/",
    "title": "Social Media Analytics with AI?",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1ad75cn",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1ad75cn/looking_for_an_audio_cloning_tool_that_can_do_this/",
    "title": "Looking for an audio cloning tool that can do this...",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1ad4hzn",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "https://www.latintimes.com/how-china-has-shifted-its-investment-strategy-latin-america-past-years-550625",
    "title": "China shifting its investment strategy from large-scale infrastructure projects to high technology, including AI",
    "points": null,
    "comments": [
      {
        "comment": "It's actually a smart move in my opinion. We know that digital is the future and we are in the midst of a much larger phase of industrial shift. The battleground is based on commerce and technology. With the right investment in resourcing and innovation, you could lock in dominance for the next few centuries. They already have laid the frame work for a raw materials pipeline with Africa. The best thing is because of the nature of capitalism, Western countries allow foreign training in not only the workplace but also higher education with many returning back perspective countries in fields that should have some conditional constraints. There is also the imbalance of acquisitions in real estate both residential and commercial (farmland) in particular). Long term, we are feeding the wolf. This is just my opinion.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "China introduced what it calls \"new infrastructure\" as part of its latest five-year economic development plan. An umbrella term for emerging tech, new infrastructure encompasses AI, blockchain, cloud computing, big data, new energy, automated factories, 5G, ultra-high-voltage transmission and industrial internet.",
        "points": "0 points",
        "children": [
          {
            "comment": "They need to do something as their population drops like a stone.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Dictator orders stuff and things it's gonna happen. It's bit difference between shoddy built apartment buildings in the middle of nowhere and high-end manufacturing facilities that never were in China in the first place.\n\nEnds up, as always, everyone will lie to the dictator so they don't get shot.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ad0kwh",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1ad0kwh/will_project_cyc_potentially_add_anything_to/",
    "title": "Will project cyc potentially add anything to current LLMs?",
    "points": null,
    "comments": [
      {
        "comment": "cyc really sounded like a great idea until i looked into it a bit. the proprietary nature of it is one huge strike. then when i saw how arbitrary the top level ontology of categories were, i just lost all faith.\n\nthat being said, i think an llm could construct a better structured knowledge graph. and if integrated into a hybrid AI would provide some transparency into what it is 'thinking' and provide a tool for a programmer to manually and forcibly control it.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Probably not directly. Projects like cyc did inspire knowledge graph projects at private companies and nonprofit projects like Wikipedia. Wikipedia probably accounts for a dominant source of LLM training data.\n\nThat said why is cyc still going? There are monks somewhere in monasteries in the mountains that are still illuminating hand copied books as they've done for centuries. So why shouldn't cyc continue as an aspirational modern version of a tibetan Mandala?\n\nAlso who is to say the cyc contributors are not also Wikipedia or reddit moderators?",
        "points": "2 points",
        "children": [
          {
            "comment": "Ex-cyclist here — the head of inference actually uses the ‘hand copied illuminated manuscript’ metaphor for how training- and labor-intensive knowledge engineering is, so your analogy is particularly apt.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1acullq",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1acullq/oneminute_daily_ai_news_1272024/",
    "title": "One-Minute Daily AI News 1/27/2024",
    "points": null,
    "comments": [
      {
        "comment": "It looks like OP posted an AMP link. These should load faster, but AMP is controversial because of concerns over privacy and the Open Web.\n\nMaybe check out the canonical page instead: https://www.marktechpost.com/2024/01/27/researchers-from-stanford-and-openai-introduce-meta-prompting-an-effective-scaffolding-technique-designed-to-enhance-the-functionality-of-language-models-in-a-task-agnostic-manner/\n\nI'm a bot | Why & About | Summon: u/AmputatorBot",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1act1d5",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "https://www.rollingstone.com/culture/culture-features/ai-companies-advocates-cult-1234954528/",
    "title": "The Cult of AI",
    "points": null,
    "comments": [
      {
        "comment": "Pies Lesu Domine Dona Eis Requiem",
        "points": "14 points",
        "children": [
          {
            "comment": "Bring out your dead 😂",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "AGI does have cult tendencies amongst people who are optimistic about it.\n\nBut so much of the optimism most people have about AI is focused simply in what we already have. Tools that exist right now. That do free us from work and help us achieve things. And when you see how that efficiency compounds, you do get optimistic about the power and change it can bring.\n\nI could use AI to help people. I could also use AI to defraud people. People do that stuff without AI. In the end, AI just allows us to do \"human\" things, faster.\n\nI also find the obsession with \"AI stole from artists and kills human expression\" stuff to be its own cult. When you point out that Adobe made theirs with the art they own, that cult gets all fired up and waves it away as \"besides the point.\" Or if you point out most people stole images from Google Images every day already anyways for whatever they need, including artists who use them as reference images, that's also \"totally different because of scale and their use was ok.\"",
        "points": "20 points",
        "children": [
          {
            "comment": "The sooner we can do away with money, the sooner stealing becomes obsolete.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Just visit r/singularity to see the extent of delusion. People there would react to any new Eva ai sexting bot avatar as a coming of a messiah of humanity.",
            "points": "4 points",
            "children": [
              {
                "comment": "It just depends on where you look over there. They did a when do you expect UBI poll the other day and people were waaay more reasonable than you'd think. By the time I had submitted there was like nobody who expected it in the first few years and the overwhelming majority said 10+ years. The crazies just stand out.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Rolling Stone: attacks capitalists in technology for being capitalists.\n\nAlso Rolling Stone: owned by ultra-wealthy media capitalist Jay Penske, net worth $250M.",
        "points": "15 points",
        "children": [
          {
            "comment": "He makes fair points. But it is ironic that they produce counterculture and proclaim to be an \"ai-heretic\" rebel, while their entire goal is to sell the counterculture they produce.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Not even one B, oh my god poors !",
            "points": "3 points",
            "children": [
              {
                "comment": "That was amazing, cheers.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "How's the Penske file doing?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "AGI is treated as an inevitability by people like Sam Altman of OpenAI, who needs it to be at least perceived as inevitable so their company can have the highest possible stock price when it goes public.\n\nGood line. The whole article touches on the idea that we live under Plutocratic Feudalism, not Democratic Capitalism.",
        "points": "5 points",
        "children": [
          {
            "comment": "Of course. Self driving cars (EV or otherwise) could easily be rolled out with sincere collaboration between industry and government. The traffic-control infrastructure needs to meet this half way, otherwise it is going to be a bloody road. Like with seat belts of all things.\n\nThe public safety impact to self-driving cars done right could really do some good - drunk driving, elderly folks, asshole d-bags, etc.\n\nBut no. Maybe Tim Apple’s 2028 car will be able to take my pulse-ox and bring me dreams of an African American Mother Nature thanking me for all my virtue signaling. Going to really save some lives there.\n\nEdit: not to pick on Tim Apple - getting our current government to get ANYTHING accomplished is not even worth berating anymore.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The author also talks about CES in these podcast episodes:\n\nhttps://open.spotify.com/episode/7t337kR3ePJiDniFFUktRk?si=zEhuARdMTa-YyjdrnoWD2Q (he's very drunk)\n\nhttps://open.spotify.com/episode/4FftDe9LQOIoVvvfurEh7v?si=wExzsr3-SYqSITjS-ZHoxA\n\nhttps://open.spotify.com/episode/3QfMnAqDoej1kPuoyhnGGD?si=IvD56wo9ReSsgYbwjy8Arw",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As if we should take anything in mainstream corpo journalism seriously. These people produce propaganda and inculcate cults for fun.",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I just want aging cured…..",
        "points": "0 points",
        "children": [
          {
            "comment": "At some point it just probably loses the point.",
            "points": "0 points",
            "children": [
              {
                "comment": "Maybe, but what’s the point now?\n\nYou’re born with a terrible disease that causes you to rot and die.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Hi, here’s just a sneak peek at what’s in store for you just around the corner:\n\nhttps://www.youtube.com/watch?v=1jTHBBkillM",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Another article from a doomer about a dystopian future. How original…",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This reads like the title was written first.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]