[
  {
    "id": "t3_1afbeyp",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1afbeyp/secure_oneway_video_feed_protocol/",
    "title": "Secure one-way Video feed Protocol",
    "points": null,
    "comments": [
      {
        "comment": "MPEG-TS over UDP, push style?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1af8yg0",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://secalerts.co/news/new-york-state-sues-citibank-for-failing-to-protect-customers-against-scams/4KRBKsEFFLIVZSFvsIWzDx",
    "title": "The state of New York is suing Citibank, alleging it failed to protect customers against scams and hacks that netted millions.",
    "points": null,
    "comments": [
      {
        "comment": "I guess I’ll go first, fuck that bank if it’s true they intentionally make red tape to make it hard for customers to put in claims and just deny all of them after they worked so hard to try and get their money back.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1af85tv",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://arstechnica.com/security/2024/01/ars-technica-used-in-malware-campaign-with-never-before-seen-obfuscation/",
    "title": "Ars Technica used in malware campaign with never-before-seen obfuscation",
    "points": null,
    "comments": [
      {
        "comment": "Lol, anyone else read the article. And then realize the pizza image is there. And think.... 🤔",
        "points": "29 points",
        "children": [
          {
            "comment": "This made me chuckle.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "A benign image of a pizza was uploaded to a third-party website and was then linked with a URL pasted into the “about” page of a registered Ars user. Buried in that URL was a string of characters that appeared to be random—but were actually a payload. The campaign also targeted the video-sharing site Vimeo, where a benign video was uploaded and a malicious string was included in the video description. The string was generated using a technique known as Base 64 encoding. Base 64 converts text into a printable ASCII string format to represent binary data. Devices already infected with the first-stage malware used in the campaign automatically retrieved these strings and installed the second stage.\n\nThe image posted on Ars appeared in the about profile of a user who created an account on November 23. An Ars representative said the photo, showing a pizza and captioned “I love pizza,” was removed by Ars staff on December 16 after being tipped off by email from an unknown party. The Ars profile used an embedded URL that pointed to the image, which was automatically populated into the about page. The malicious base 64 encoding appeared immediately following the legitimate part of the URL. The string didn’t generate any errors or prevent the page from loading.\n\nOpening the same file in a hex editor—a tool for analyzing and forensically investigating binary files—showed that a combination of tabs, spaces, and new lines were arranged in a way that encoded executable code. Like the technique involving Ars and Vimeo, the use of such a file is something the Mandiant researchers had never seen before. Previously, UNC4990 used GitHub and GitLab.\n\nThe initial stage of the malware was transmitted by infected USB drives. The drives installed a payload Mandiant has dubbed explorerps1. Infected devices then automatically reached out to either the malicious text file or else to the URL posted on Ars or the video posted to Vimeo. The base 64 strings in the image URL or video description, in turn, caused the malware to contact a site hosting the second stage. The second stage of the malware, tracked as Emptyspace, continuously polled a command-and-control server that, when instructed, would download and execute a third stage.",
        "points": "55 points",
        "children": [
          {
            "comment": "This whole thing is just... weird, so the image was only a risk for people already infected by a malware that sent them to the page containing it? What's the point really? Why not simply use a website you have full control on to host it? Why even use a browser if you already have a malware installed on the target computer?\n\nI really can't think of any reason to even do that for any kind of attack, it just makes the breach easier to spot, and on top of that potentially leaves data to track the attackers down on the website they registered to to host the image.",
            "points": "30 points",
            "children": [
              {
                "comment": "It is harder to block ars techia than suspect.domain.io. you can get a dropper or something else past most defenses that all it does is redirect. The Malicious payloqd comes from the image, and most defenders will look at it and say, \"yeah no it is good\". Because it appears to just be a stream of jpeg without the decoder.",
                "points": "14 points",
                "children": [
                  {
                    "comment": "What's the point if the second stage is on another site? Why not use that site immediately?",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Kinda hard to trick users into downloading a dropper malware from ars technica.\n\nAttackers would rather use a dropper that would download the second stage from ars technica. IMO, this would still raise a flag, as it's uncommon to see processes connecting to tech blogs aside from web browsers. Much better to use github/gitlab to blend in",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Kinda hard to trick users into downloading a dropper malware from ars technica.\n\nIt's also kinda hard to trick them into downloading a random profile pic from ars technica.\n\nWhich is why they weren't tricked:\n\nThe initial stage of the malware was transmitted by infected USB drives. The drives installed a payload Mandiant has dubbed explorerps1. Infected devices then automatically reached out to either the malicious text file or else to the URL posted on Ars or the video posted to Vimeo.\n\nAgain: Why couldn't the infected devices automatically reach out to the second stage immediately?",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "because heuristic IPS systems will pop alerts when someone's work laptop starts pinging random servers in Malaysia, but less so for Ars blog traffic that's pulling \"jpegs\".\n\nlook at the log files and looks like Bob is lookin at a few tech blogs at work but nothing that would be flagged as dubious.\n\nsimilar approaches have been used with reddit, pastebin, etc.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Sleeper install maybe?\n\nA way to execute the installation at a predefined time.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Maybe as a poc?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I don’t understand what the big deal is. How is this any different from putting the base64-encoded binary on the about page itself as text? Or embedding the string in the image data itself? What’s special about putting it in an unused URL field?",
        "points": "10 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Jesus.",
        "points": "16 points",
        "children": [
          {
            "comment": "Poisoned pizza!",
            "points": "13 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This is not a unique attack. Stuff similar to this has been working for years. Malware calls out to reddit post to grab b64 instructions, then to YouTube comments to grab half the code, then a personal profile somewhere else to grab the other half of the code. On and on. You can get pretty creative with things.\n\nNow, if you are saying a pizza picture is the unique part, I'm with you. I'm not sure how many malware devs have used pictures of pizza in their campaign.",
        "points": "6 points",
        "children": [
          {
            "comment": "You know those websites where you can upload pizza discount codes? I wonder if there's a character limit, that'd be an interesting spot to host payloads in b64",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Cool, but I feel like they used to do this with images on Twitter too.",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Uh, base64 is a technique and using it is totally new for distributing payloads?\n\nI am confused.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well, that was seen before.\n\nI guess the unique thing is that they used ars technica instead of other legitimate sites? Either way, still pretty common",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Surprised they got a reply back to the anonymous email. Emails were sent to their staff they take on Google related news, and not even a response back on a huge story.\n\nGutless cowards, they won’t touch anything that may bring heat to their journalism.",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Never before seen? The campaign just uses base64 string stored somewhere on a website.\n\nHow is this any different to malware that has c2 comms over twitter or pastebin",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1af3af0",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1af3af0/compromise_rates_for_phishing_sims/",
    "title": "Compromise rates for phishing sims",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1af4yp8",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1af4yp8/sms_phishing_data_scraping/",
    "title": "SMS Phishing / Data Scraping?",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1af7fcg",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://www.techradar.com/pro/security-pros-are-being-hospitalized-by-after-effects-of-ransomware-hacks",
    "title": "Security pros are being hospitalized by after-effects of ransomware hacks",
    "points": null,
    "comments": [
      {
        "comment": "Why does this link to a reddit post that links to a website? Is this a bot?",
        "points": "13 points",
        "children": [
          {
            "comment": "Take your meds. It's a share feature you can do with reddit. But yeah OP probably tends to act like a bot in his day to day. Thus, why he uses this silly feature.\n\nEdit: spelling",
            "points": "-13 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I can’t believe it we had an attack in 2019 and it was so stressful I nearly just walked out the door and never came back",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I say if you are not a true IT/security veteran unless you need to the emergency room for work related stress.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No shit.",
        "points": "-5 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1af6qtn",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1af6qtn/how_does_your_team_measure_success/",
    "title": "How does your team measure success?",
    "points": null,
    "comments": [
      {
        "comment": "We work in two week sprints, as do most other departments in the company. We follow them up with a sprint review on the stories worked on, the experience from all stakeholders, and what can be improved. It's hard to measure \"how well we did at making things secure\" but constant discussion on ongoing projects and operations is how we all stay on the same page.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "SLA’s",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Do a risk assessment, quantify / qualify monetary value of each cyber risks relative to data you are trying to protect, then create metrics around : simulated phishing stats, incident reports , security events addressed, look at your email filters and EDR, IPS, IDP, SIEM dashboards and find meaningful close calls and graph that.\n\nTLDR; (a) monetarily quantify risk (b) quantify progress / efficacy of risk mitigation thru various metrics",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1af6359",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1af6359/cybersec_or_software/",
    "title": "CyberSec or Software?",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1af2ehw",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1af2ehw/c_or_python/",
    "title": "C++ or Python?",
    "points": null,
    "comments": [
      {
        "comment": "C++ offers more control over system resources and hardware, similar to how lower OSI layers offer finer network control. Python excels in rapid development and automation, like higher OSI layers focus on application-level tasks. For deep system interaction and custom malware development, C++ is more suitable.\n\nSince you're considering selling your creations, dig deep with C++",
        "points": "8 points",
        "children": [
          {
            "comment": "Got it! Thank you very much for the clarification.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "what is c++ actually used for? im curious for some examples on how I could practice my cpp skils",
            "points": "0 points",
            "children": [
              {
                "comment": "C++ and other languages that support compiling to native code is MUCH faster and more native to the system, it is not interpreted like Python. You do not write commercial software in Python, you do it in a proper (compiled) programming language that isn't designed to be used for scripting.\n\nIf you want to do malware reversing and understand how things work in real processes that runs Win32/64 then go and learn C++, or a .NET Language. Python is too detached from the systems as it is multiplatform and you won't pick up as much \"close to the system\" knowledge that you will have use for doing malware research.\n\nIf you just want to do automation, you can survive with just python. Or even just Bash/Powershell scripting.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Both... no reason to 'specialize' in one language or another...",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1af0rea",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1af0rea/do_you_disable_antivirus_for_your_admins_before/",
    "title": "Do you disable Antivirus for your Admins before they install updates / applications?",
    "points": null,
    "comments": [
      {
        "comment": "But only IF you can confirm the AV is causing an issue with installation and only IF you download the file from the vendor's website and not a third-party. But usually, if there is an issue with the approved software, one can write an exception for it to move forward.",
        "points": "8 points",
        "children": [
          {
            "comment": "Add the machine to a different policy or allowlist the software.\n\nThere’s a policy for onboarding machines that has AV in more of a passive mode. Then once the machines are ready for production they are moved to a different policy. Once in production, if there’s a software that has a business case and shown to not to be malware the software/exe/script can be allowed in the AV policy.",
            "points": "1 point",
            "children": [
              {
                "comment": "We take a different approach by having them go into a default policy that has limited exceptions set by the AV vendor itself. Then we will run a performance check to measure the impact of AV on the software and services. If we are troubleshooting an issue, then we will get gnarly with exceptions. It's always java web apps..",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "SolarWind ... ransomware virus from trusted 3:rd party ... a false positive that turns out to be a true positive ... so no?",
        "points": "3 points",
        "children": [
          {
            "comment": "SolarWind ... ransomware virus from trusted 3:rd party ...\n\nExactly. Utilizing an App-Locker is essential to check hashes.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If it's going to blow up due to AV, I want to watch it happen so it can be documented and designed around. Can't do that if things get turned off every time.",
        "points": "2 points",
        "children": [
          {
            "comment": "Can't do that if things get turned off every time.\n\nYes! so true.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "My mindset as to why we do NOT allow it is because, yes, we want to be aware of what is being blocked and what we can do to fix it. Also, the risk factor of a targeted attack. I can see it now where we disable the AV and App-locker, then the file is downloaded directly from the internet, and it happens to be malicious and there is nothing in place that scanned the file. I just feel it is a very old-school mentality, IMO.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aeywmd",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aeywmd/any_cybersecurity_programproducts_that_are/",
    "title": "Any CyberSecurity program/products that are open-source that I can contribute to?",
    "points": null,
    "comments": [
      {
        "comment": "Look at open source tools on Github such as:\n\nhttps://github.com/cyberguideme/Tools\n\nNote: Not all of the tools listed are on Github but a lot them are.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aey3oo",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aey3oo/ddos_protection_solutions/",
    "title": "DDoS protection solutions",
    "points": null,
    "comments": [
      {
        "comment": "Imo the thing cloudflare does best is absorb DDoS, it's pretty impressive",
        "points": "14 points",
        "children": [
          {
            "comment": "Their free service might be beneficial with our needs. Does your organization utilize any of their services?",
            "points": "3 points",
            "children": [
              {
                "comment": "My personal domain is registered with Cloudflare, I use their free tier to expose a handful of services from my environment.\n\nI'm also leveraging pieces of their ZTNA platform for access control to my services. Some are locked down completely and require authentication, others are limited by source county, and another by source IP.\n\nI use cloudflared tunnels to expose my services to Cloudflare, they handle DNS and SSL Certificates. I have zero inbound ports open on my firewall.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yep, I've used Cloudflare for this and a few other things, and it works really well.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Cloudflare and Akamai are the industry leaders for vendor solutions. You’ll be paying for their services but think of it more as an insurance premium rather than a tool cost. Everyone pays into it all the time and it’s there for you when you need it. You might be able to use a self hosted system but know that it’ll be able to take less of a beating than a vendor would plus you have to have someone who can manage and run the system.",
        "points": "4 points",
        "children": [
          {
            "comment": "I’ll do some research on the self hosted system thank you!",
            "points": "-5 points",
            "children": [
              {
                "comment": "A self hosted system isn’t going to remediate an attack that maxes out your pipes unless you run a large distributed network. You can’t stop the attack within a few hops of the target. You need distributed remediation at peering points which is why this is usually a service you subscribe to.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I guess the question is what is the cost/lost business for every hour you are down if there is a DDoS attack, vs the cost of the service.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Threat Actors have infinitely more resources than you do. Your on-prem infrastructure will never be able to absorb a real attack.\n\nFront your apps with a cloud-based solution such as Cloudflare, Akamai, Silverline, etc.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It might also be worth exploring with your ISP. I know our AT&T services resold/packaged Radware's DDoS service when we upgraded our service.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "CloudFlare. No one does DDoS better than them.\n\nMy clients all use their services, and my 2 web sites are behind it. It handles full end to end encryption and SSL. It does my DNS and managed my records.\n\nIt offers full HSTS and a whole bunch of other really awesome features.\n\nMost importantly, it just works. And it's totally free!",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I worked for an IT Director who put his foot down and said DDoS is not a security team problem, it's a network team problem, and I agree with him in that stance.\n\nBut yea, Cloudflare is the right step.",
        "points": "1 point",
        "children": [
          {
            "comment": "it's a network team problem\n\nCouldn't agree more\n\nLol downvotes? Come on people. Geez what a tough crowd we have here",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Well Availabilty is definetly a Secuity Problem.\n\nDDoS protection is mostly expensive.\n\nIt depends on your Threat Model.\n\n1) You get a scrub provider if you have large Address space and your own Address Space and people can *somehow figure out your address space and target jt directly. Very expensive.\n\n2) If you have a few sites, generally is cheaper to buy CloudFare or Imperva or Akamai and put in front, and prevent leakage of your source IPs. I think cloudfare is relatively cheap for this scenario.\n\n3) Never buy on site protection, they only work in tandem as a trigger mechanism to Scrubbing.\n\nWhat are you protecting? What do u call sites? Websites or Offices with Internet Access?\n\nIf websites why not host in AWS and make it AWS problem?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aey0xw",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aey0xw/proofpoint_splitting_quarantined_emails_that_are/",
    "title": "Proofpoint splitting quarantined emails that are sent to two or more recipients. Any idea how to resolve this ?",
    "points": null,
    "comments": [
      {
        "comment": "Talk to support.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aexoua",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aexoua/what_paravirtualization_interface_should_i_use/",
    "title": "What paravirtualization interface should i use?",
    "points": null,
    "comments": [
      {
        "comment": "Go ask in Sysadmin or general IT sub. Why is the questions so often off topic on this sub.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aex5iy",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aex5iy/am_i_crazy/",
    "title": "Am I crazy?",
    "points": null,
    "comments": [
      {
        "comment": "To start I would say that your pay is too low for your current role. The Bureau of Labor and Statistics have your median income for that position at 85k. Now only being there two years may have a negative affect on that, but location wise I feel you should be slightly higher based on cost of living.\n\nI can see there being a disconnect from a hiring managers perspective on your position and transitioning into anything cyber. Jobs including networking and admin roles are going to want proven experience and I'm starting to see a lot of hires that have previous experience with someone in the company (old coworkers etc). I could see RMF being a good segue for you, potentially even something in the compliance sector. Especially for a healthcare organization. I currently work for a Healthcare Manufacture and they recently doubled the compliance team to keep up with the workload.\n\nMaybe look into certifications for specific software suites that deal with vast amounts of data. Getting good at using those can show as a solid skill if you are looking for more of a technical role.",
        "points": "2 points",
        "children": [
          {
            "comment": "Thanks for your insight! Any suggestions of where to look for jobs? I use indeed and LinkedIn mainly, just not sure if I’m using the best search terms or if there’s other search engines that are useful.\n\nAs for proven experience, I would say I have 2 years of vulnerability analysis and compliance assessment on the next gen of ICMB submarines.\n\nExtra info: While that sounds big, I don’t feel like I’m getting much more experience than outlook, teams, and excel. We do Tenable Nessus and STIG scanning, but that’s limited in number of times used. I basically review the compliance of all systems going into these subs from start to finish. I have hands on programming experience from my past too, but I’m not very confident it’s to professional expectations. Hope any of this info is relevant",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Nope. The job market for this field is FUCKED right now and they are hiring the extremely experienced and certified people at extremely low salaries. Many companies dumped lots of staff and moved departments overseas (looking at you, crowdstrike) and it's not improving anytime soon. Maybe shoot for an MSP job and keep trying.\n\nIt's never been this bad before and companies couldn't care less. Keep your chin up.",
        "points": "1 point",
        "children": [
          {
            "comment": "I want to believe this but I don’t know what’s worse, knowing everything sucks and it’s not my fault or having to live with everything sucks and there’s nothing I can do. I want to be optimistic ya know? I’ll look into MSP like you mentioned.\n\nAnd yeah, someone said “people who normally make way more are going to take a 80k job right now just to keep paying a mortgage, so you’re against 10+ YoE and will have to wait your turn.” Really really really trying to remain optimistic though",
            "points": "0 points",
            "children": [
              {
                "comment": "You should remain optimistic, things will change. You can't stop the waves, but you can learn to surf ;-)\n\nTake care and good luck out there!",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "What jobs are you applying for?",
        "points": "0 points",
        "children": [
          {
            "comment": "Mainly anything cybersec, but I've recently started to include sysadmin and network based jobs for the chance to increase my knowledge in those fields. Considering to start including any IT jobs next. My interviews were for a rmf job in healthcare, soc style higher up cybersec job in logistics (they did everything cyber and sounded way too broad), cyber director for a different healthcare based job (really thought I would get this one based on the interviews with VP of tech), and something research based for the DoD that I'm ok with not getting.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aex2ik",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aex2ik/cal_state_long_beach/",
    "title": "Cal state Long Beach",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1aewiug",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://youtu.be/KjcTgiT1g-A",
    "title": "Empowering The Visually Impaired In Cybersecurity (Short Documentary)",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1aevz3p",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aevz3p/dmca_abuse_to_censor_content/",
    "title": "DMCA abuse to censor content",
    "points": null,
    "comments": [
      {
        "comment": "You might reach out to TechDirt...they cover these kinds of stories fairly often and have had to fight a lot of bogus claims.",
        "points": "2 points",
        "children": [
          {
            "comment": "Thanks for that looks like they have a lot the subject will check that out",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "An alternate grey/blackhat solution would be to move to a hosting company who outright ignores DMCA complaints.\n\nCommonly known as a bulletproof hosting provider.",
        "points": "1 point",
        "children": [
          {
            "comment": "Great idea, will check that out. I was hoping to hear there might be some big hosts that ignore obvious junk requests rather than acting on them regardless. Thanks again",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "To note = Palo Alto networks maintains a list of bulletproof servers, and in class / most pro-serv engagements it is brought up to put in a block rule so your site does not talk to the proof-bullets.\n\nNot sure at all how many of your end customers would be affected, just an awareness data point",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aeudim",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aeudim/pentest_company_recommendations/",
    "title": "Pentest Company Recommendations",
    "points": null,
    "comments": [
      {
        "comment": "Full disclosure, I work for TrustedSec. A bunch of our peers are top notch, Black Hills infosec is fantastic, Red Siege and Lares as well.\n\nIf you specifically what type I might be able to provide more nuanced recommendations.",
        "points": "9 points",
        "children": [
          {
            "comment": "I can second this. Having used Black Hills and TrustedSec before, both are top tier.\n\nI have learned you get what you pay for when it comes to red team, purple team, or pen testing.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Black Hills InfoSec, CrowdStrike, NCC group",
        "points": "12 points",
        "children": [
          {
            "comment": "Black Hills is great.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "FRSecure based out of Minnesota",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "CrowdStrike, Ridgebot, and quite a bit more.\n\nSorry for not expanding on this. When it comes to Ridgebot, they are AI based Pentesting that finds the vulnerability and then exploits it. Relatively cheap.\n\nCrowdStrike has many different options. They typically get as close to possible as the adversaries that would be targeting your organization or vertical.",
        "points": "4 points",
        "children": [
          {
            "comment": "Really appreciate those suggestions! Ridgebot sounds interesting. I bet crowdstrike is awesome but they likely would be out of our price range given costs of their EDR.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "We were impressed with CBI",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Bishop fox",
        "points": "1 point",
        "children": [
          {
            "comment": "I used to work here before I started my own company, but I definitely still recommend them if you can afford them and need some really high quality and specialized work.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "https://www.blackhillsinfosec.com they are fantastic, if you check their YouTube channel they post tons of free ideas and usually have monthly webinars. You get more of a personal feel here since they aren't some giant crowd strike type company. The owner John is always reaching out to the community trying to give ideas out for the cybersecurity world. He definetly gets my respect for how he built that place.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I like Trustwave and Third Wave Innovations. If you reach out to both/either, tell them CloudHound sent you.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Rapid7 had a good review on here recently",
        "points": "0 points",
        "children": [
          {
            "comment": "This, I am a contractor that does R7 pentests. The work and process is fantastic, I'm honestly glad to just be part of the team.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I have several partners I can recommend, happy to share any recommendations! Would just need to know scope and what you're looking for to point you to the right ones.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Edgescan",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "LOL free advertising post.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Some MSSPs can be just as comprehensive as known Pentesting companies and cheaper.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Throwing our hat in the ring for consideration.\n\nWe're a small team, but we've been building up a reputation for really high quality work on the penetration testing side the last couple of years.\n\nhttps://glitchsecure.com/about/",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Are you looking for anything in particular in your test or is it just for compliance purposes. Some testers can embed into your team to support with dev advice or raising tickets. I'd be mad if I didn't try to promote my own company system-secure.co.uk We specialise mainly in infrastructure testing on behalf of MSPs and can do it at a lower rate to app testing, but we do all things really. If in doubt; ask for a sample test report to see if you like the kind of remediation advice.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Drop me a DM",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Https://Cyberteq.com",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Make sure SOW is very well defined. I have seen some pen test companies were doing just the vuln scan.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Canary Trap, App-Check, Appalachiatech if your looking for smaller players that do a good job.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Do you need an internal/external infrastructure pen test or are you looking for application specific pentesting?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Don’t use trustedsec they stole code.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "SpecterOps, Red Siege, or TrustedSec. I had a terrible experience with Black Hills, very unprofessional, but they do a lot for the community.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "NetSPI is very good. Nice platform, has remediation tips and project management built in.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Forward Security https://forwardsecurity.com/",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Take a look at Echeloncyber.com. It’s a Cybersecurity firm out of PA, with a rocking group of guys. Their OffSec team does fantastic work, is incredibly detail-oriented and in my experience, their reports are the complete opposite of the typical cookie-cutter ones that most larger firms put out.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "NetSPI is amazing.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Full disclosure - I work at FRSecure, not as a pen tester but as a consultant. Nothing but great things to say about our team. Black Hills would be my second recommendation.\n\nBoth organizations do a great job supporting/giving back to the community.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "https://Packetlabs.net",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aethfo",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aethfo/any_solid_alternative_to_veracode_its_been_a/",
    "title": "Any solid alternative to Veracode? It's been a terrible user experience",
    "points": null,
    "comments": [
      {
        "comment": "I've found that Veracode consistently overpromises and underdelivers. I also saw that the company itself is going through high turnover and a lack of employee retention. That's no surprise given their product is so shit.",
        "points": "7 points",
        "children": [
          {
            "comment": "If for WebApps, scanning and all that… check out Contrast Security. The founder is Jeff Williams (the owasp top 10 author)",
            "points": "0 points",
            "children": [
              {
                "comment": "Does anyone have a solution for the passive observation issue yet? My dev’s are mentally ill and don’t write regression tests. Contrast IAST results are untrustworthy given the low route execution. :(",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Veracode is a SAST, SCA and DAST, plenty of other vendors.\n\nFor SAST and SCA, Snyk, Synopsys, Mend, Checkmarx\n\nFor DAST Invicti, StackHawk, Bright\n\nThere's tons more vendors in the space, go do your due diligence based off your tech stack, none of the vendors are a cure all, all have their own issues",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "How about Prismacloud?",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What exactly sucks about it?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Fortify On Demand is an upgraded Veracode. Had much better experience and performance with them.\n\nAll commercial SASTs are kind of the same though.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We just decided to go with Checkmarx after evaluating Veracode, Synapsys, Snyk, Contrast, and Checkmarx. It just fit the bill overall with its integrated platform and developer experience. Wouldn't mind Contrast for RASP if I can swing it though.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not an alternative per-se, but we've been considering something like salt security. Think of it as an IDS for your APIs. Never seen anything more than a demo but it seems promising. Primarily b/c we've run into the same issue - nothing fits the bill for DAST that I've seen thus far.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aetfk3",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aetfk3/uac0050_new_campaign_details/",
    "title": "UAC-0050 new campaign details",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1aetbop",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aetbop/corso_di_cybersecurity_mi_consigliate_che_pc/",
    "title": "Corso di CyberSecurity... mi consigliate che pc acquistare?",
    "points": null,
    "comments": [
      {
        "comment": "ciao, innanzitutto ti consiglio di scrivere in inglese in questo reddit dato che non è solo italiano\n\nPotresti avere qualche problema di compatibilità con i sistemi usati durante il corso se hai un sistema operativo troppo MacOS troppo obsoleto.. ad esempio, io ho Mojave ed ho qualche problemino con VSCode, VMWare, Packet Tracer ed altri. Ti consiglierei di chiedere a chi tiene il corso quali software verranno utilizzati, e verificare se funzionano con il tuo attuale sistema operativo.\n\nIn alternativa, installa una partizione windows con il bootcamp di mac, non è proprio il massimo come performance, ma probabilmente avresti meno problemi di compatibilità con una versione aggiornata di windows (mac non lo potresti aggiornare per limiti imposti dalla grande mela e dall'hardware associato)\n\nse proprio devi prendere un nuovo laptop... penso che thinkpad è la scelta migliore!",
        "points": "2 points",
        "children": [
          {
            "comment": "Grazie per i consigli! Effettivamente chiedere a loro sarebbe l'opzione più semplice, ma l'ultima volta che ho parlato con il responsabile mi ha detto di chiedere direttamente all'insegnante quando il corso inizierà... a me piacerebbe capirlo prima :')",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Howdy,\n\nI currently use a 2013 Mac for my University courses so I’d gamble that your system is fine for a course. If your worried though, it honestly might not be a bad idea to transfer all your files and programs on your computer to a separate hard drive and run a factory reset to give the old Mac a fresh start.",
        "points": "1 point",
        "children": [
          {
            "comment": "Thank you! I didn't think about that, you've been very helpful :)",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aet8hg",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://www.blumira.com/masked-application-attack-incident-report/",
    "title": "Masked Application Attack Walkthrough",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1aesr1w",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aesr1w/what_vulnerability_scanner_would_be_best_tenable/",
    "title": "What Vulnerability scanner would be best, Tenable IO(Nessus) vs Microsoft Defender for vulnerability management?",
    "points": null,
    "comments": [
      {
        "comment": "Is Defender going to do external scans? Will it cover your network hardware? What about any other appliances or hardware you may have(UPS, printers etc.)?\n\nYou're going to get better coverage from Tenable.",
        "points": "39 points",
        "children": [
          {
            "comment": "No external scans, no network hardware. Basically just the workstations and servers. All of which are in azure/intune",
            "points": "3 points",
            "children": [
              {
                "comment": "I concur with u/moobycow.\n\nNo need to spend the $$$.",
                "points": "6 points",
                "children": [
                  {
                    "comment": "I'd say run both. Windows defender on your windows machine and Nessus on your whole network.",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yes it does: https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/device-discovery?view=o365-worldwide\n\nThe device discovery capability allows you to discover:\n\nEnterprise endpoints (workstations, servers and mobile devices) that aren't yet onboarded to Microsoft Defender for Endpoint\nNetwork devices like routers and switches\nIoT devices like printers and cameras",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If you are all Windows house and small, go with Defender.\n\nIts only when you introduce AWS, Linux, or macOS into the mix or get to any significant size that it is monumentally stupid to stay using Defender anything as there are much better products that cover all those.",
        "points": "17 points",
        "children": [
          {
            "comment": "Yeah, the consensus is that tenable is better for coverage, hwoever seeing as we're basically 100% windows, no mac, linux/ non windows server/workstations I wasn't sure if it would just be better to go with defender",
            "points": "3 points",
            "children": [
              {
                "comment": "Does your company plan on growing or expanding their technology footprint at one point? If so, you will ideally plan for that future.\n\nOnce you go position yourself heavily with Microsoft, it can be quite a bit of effort to pull it apart if you need to replace it with a better solution.\n\nMy worst days with MS were when I had to make it work on any non-windows host or show the boss the metrics stating that a significant percentage of our environment is not covered by our solution because MS doesn't cover xyz platforms.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Yep, I would completely agree here... if your plan is to scale away and use any platforms outside of the Windows ecosystem... do it now, because doing it later is SO MUCH WORK to get done right.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Definitely consider reporting when evaluating. Tenable out of the box is a disaster for reporting issues to asset owners without a lot of massaging of data. MS may not be better, but it's worth vetting reporting as, sooner or later, you will need reporting to motivate some silo to patch their sh&*",
        "points": "9 points",
        "children": [
          {
            "comment": "\"but it's worth vetting reporting as, sooner or later, you will need reporting to motivate some silo to patch their sh&*\"\n\nTrue this. May be in a small size company like OP do not have shilo, but bigger companies have to deal with this crap.\n\nWithout the reporting, it may be difficult for you to persuade people to patch their system. Also, your manager want to see the pretty report as well.\n\nWe used to use Tenable about 5 years ago, and the reporting was horrible. We switched to Rapid7, and doing POC of Tenable and Qualys. Find out Tenable is much better than before. You should check Qualys as well. It has comprehensive coverage for Network devices as well, and is cheaper than Tenable as well.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "To be honest at scale reporting should only be used for an overview. Automating the workflow by creating tickets for remediation is the way to go. We use the Tenable - ServiceNow integration so the teams responsible for patching never need to look at reports. They get assigned tickets with all of the details and an SLA to have the fix in place. They don't even need to close the tickets once they patch as the system will do that for them.",
            "points": "2 points",
            "children": [
              {
                "comment": "Wow nice... Does it integrate with things like fresh service or zendesk?\n\nAlso I assume tenable is a paid tool?\n\nLastly I thought defender was basically AV with Edr capabilities when plugged into MDE security portal.\n\nDidn't think it would do actual vulnerability scanning on endpoints?",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Not sure about those platforms. They need to support it too in some manner or at least be able to work with the API. Tenable can provide the data with the API so it would be up to them to make use of it.",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Nice! I haven't used a VA tool for a while now so that sounds fantastic. Hopefully it works as well as it sounds like it could. Cheers for the new to me info!",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "How large of an organization? What did you do for getting the CMDB correct and configuration items assigned to the appropriate support groups? We have been trying this and it has proven to be very challenging",
                "points": "0 points",
                "children": [
                  {
                    "comment": "~45K employees and a lot of contractors. About 90K assets being scanned. The integration predates my time there, but I think there are around 5000 assignment groups which seems insanely high to me, but we're in 50 countries and have over 200 legal entities so maybe that makes sense. We have a lot of data centers as well presence in AWS and Azure so maybe that number of groups isn't all that crazy.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Tenable is the gold standard, my company just bought a license and I'm happily configuring it this week.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Only benefit to defender is the cost.\n\nOnly benefit to any Microsoft product is the cost.",
        "points": "4 points",
        "children": [
          {
            "comment": "Digging around, I hear that they more or less do the same thing, Tenable being better for coverage/scalability, but if everything getting scanned is windows based then it shouldn't matter too much I would imagine?",
            "points": "-2 points",
            "children": [
              {
                "comment": "Scan times vary drastically between the two. Like a day apart.\n\nYour also paying for the gui interface.\n\nMicrosoft isn't winning against most vendors with their gui.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "If you install defender agent on each endpoint then shouldn't it report in defined interval everyday? It is the case with Tenable, Qualys and Rapid7.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "You have to retrieve the data from their logs. Their logs are massive",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "MS claim that they have more endpoint than anybody and thus more telemetry data point. Because of telemetry data point they have better coverage and can come up response of emerging threat quicker than other vendor.",
            "points": "0 points",
            "children": [
              {
                "comment": "Yes, they have massive data stores compared to other vendors. It's like connecting a water hose to the ocean, then needing compensators to control the flow.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I have deployed and used them all. Qualys with a Hybrid deployment of agents and cloud is the answer.",
        "points": "1 point",
        "children": [
          {
            "comment": "I’d like to hear more.",
            "points": "0 points",
            "children": [
              {
                "comment": "check out services that provide Qualys agent, with management on top of it, including patching, these services are called Patching as a Service. Full disclosure I work for one, www.oncyber.ca/paas.html",
                "points": "0 points",
                "children": [
                  {
                    "comment": "So you actually drive the management of VMDR and PM part of Qualys for the client ?",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Tanium is exponentially better at this, Qualys is a dumpster fire.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I don't work for them and receive 0 componstion for my recommendation. Tenable has gone downhill since the founders got ran out.\n\nQualys scales very well and can handle very large deployments. (Or small)",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "I disagree. We're very happy running Tenable and are doing so with > 90K assets and no real issues.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "90K? LOL.... no comment",
                        "points": "-1 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I'm curious do any of these solutions also have automated remediation as well? As simple as forcing a windows update or more difficult automated fixes?",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Yes. Qualys allows you to push patches if you need to.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I regularly have issues with Tenable.IO and have been eager to find an alternative.\n\nI've tried to deploy Tenable agents to all of our assets, of which Tenable would regularly find maybe 10-15 despite them all being deployed in accordance with documentation.\n\nWhen that didn't work, fell back on the traditional IP Range scans, of which Tenable.IO is able to scan roughly 50-70% of our deployments (around 400 workstations) within a 8 Hour time Window.\n\nWe run into the issue where by the time the Tenable scan is able to scan some of the IP ranges, the workstaitons are no longer online as the user has left for the day, or dropped from VPN.\n\nTo try and reduce this, we've adopted some segmentation to ensure Tenable scans are narrowly focused. Setup new target groups, IP ranges, and dedicated Tenable on-prem scanners, and at best, I still only get around 70% coverage.\n\nReady to rip it out because it's far from giving me the full picture- however I need something that ensures coverage of network devices and non-Windows devices as well.",
        "points": "1 point",
        "children": [
          {
            "comment": "Honestly you're going to find the same issues with all vulnerability management platforms, I've used tenable, rapid7, Qualys, dell secure works, openvas and none of them have ever been great at the problems you're talking about.\n\nTenable is probably the best of the lot, I prefer it, rapid7 is also decent.\n\nFor workstations vulnerability management you're best off getting a solution like tanium.\n\nI use tenable for server/cloud scanning and their AD ID exposure platform and Tanium is managed by the IT team, but I can look at the workstation vulnerabilities in there.\n\nIt's the only way I've found to get proper coverage for everything.",
            "points": "2 points",
            "children": [
              {
                "comment": "Good to know.\n\nCurrently evaluating a bunch of products, with Tanium being one of them. Will definitely bump it up to the top of our scorecard. Thanks for your comment!",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Any alturnatives so far?",
            "points": "0 points",
            "children": [
              {
                "comment": "Unfortunately nothing yet- going to try to make replacing Tenable a 2024 initiative. Going to be hard to convince the business since I believe we get discounted licenses... so whatever I find must be equivalently cost effective.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "well two things\n\n​\n\n1) I would love to hear from you if you find an alternative\n\n2) curious what problems you are having with it now, and what you are looking for in a replacement scanner. If you have general requirements etc.\n\n​\n\nI always like to talk to the community and see what people like, dont like, understand better whats out there etc :)",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I haven't been able to find any good data on the coverage of the MS solution, but Tenable is very transparent about their coverage as you can see from their plugins site.\n\nDon't get hung up on the raw number of plugins as some of those don't' equate 1:1 with a CVE, but as you look you'll see they cover a lot of ground and are very quick to release new ones.\n\nI've used Tenable quite a bit, worked for an MSSP who used them and I worked for Tenable for a few years. I'm glad we use them now where we're covering something like 90K assets using the agent as well as traditional scans.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "MS defender is just dreadful, they can't even detect Windows own CVEs last time I checked 😅",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Tenable.io is really expensive, a single license of nessus is usually like less then $2k. If you're price sensitive I would look at the plain on prem nessus license.",
        "points": "-2 points",
        "children": [
          {
            "comment": "Nessus is really for a use case of a consultant running ad-hoc scans. It's not in any way the correct tool for an ongoing VM program.",
            "points": "-1 points",
            "children": [
              {
                "comment": "For a small business with 350 users? It's more then enough when compared to the pricing of io",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Not if they have traveling/remote/WFH staff. You can't use agents with Nessus.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Tenable is cheap when priced against rapid7 or Qualys.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "A single on prem no frills license of Nessus is $3800.. I just renewed my one scanner two weeks ago.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Vulnerability Management is already part of Defender for Endpoint. Why not check it out if you have it deployed already?",
        "points": "0 points",
        "children": [
          {
            "comment": "It doesn't cover all assets that need to be part of a thorough vulnerability management programme.",
            "points": "1 point",
            "children": [
              {
                "comment": "Thats a risk management decision",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Do you access the vulnerability management separately from the a capabilities or its just assumed all in one when it scans? Also just for vms or endpoints too for the vulnerability scan?",
            "points": "0 points",
            "children": [
              {
                "comment": "im not sure i understand the question. you access it all in the defender portal. its part of defender for endpoint, but can also be used standalone.\n\nCovers Windows Clients and Servers, Mac, Linux, iOS, Android, IoT Devices and Network Devices. Can also be used to scan Windows devices via authenticated scans using a sensor instead of the agent.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "any benefit to sensor vs agent? does it have to do with an agent not being able to be installed on some platforms or OS?\n\n​\n\nI haven't seen the portal in quite some time so that may have something to do with my question being confusing. When I last saw it ( I haven't worked since July ), I also work in GCC vs commercial tenants mainly, defender scanning machines worked mainly like an AV but I was not able to see separate sections on JUST vulnerabilities. I was curious if that distinction is made in the portal itself?",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Still not sure what youre looking for. Something like this? https://learn.microsoft.com/en-us/microsoft-365/security/defender-vulnerability-management/tvm-weaknesses?view=o365-worldwide#weaknesses-overview\n\nno idea about the sensor. never tested it, but its probably a pain in the ass to set up and maintain. If you have MDE as your EDR you get the Vulnerability management automatically without any additional configuration.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "yup ty\n\nthat option was 100% not there last time I had access and this explains things well. I assume this scans all your VMs and endpoints connected to MDE and can let you know of the different CVEs, but does it tie into any kind of automated remediation? be it forced windows updates or other, or do you just take it from there and assign tickets for VM patching and run change management for pushing patches to the endpoint fleet?",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Tenable's value add is the way they present the data. There's a lot more in the way of prebaked reports and dashboards to give you useful or actionable information. My experience with Defender's VM is that it's just a dump of all vulns, and a lot of false positives at that. It seems to be okay for enrichment of EDR incidents, but not a good standalone solution for Vulnerability Management.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In short, you need both",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Our MSP runs Nessus on a regular basis against our network for web services, general vulns, our posture from outside and some AD things.\n\nGives me some nice hints on which ports to close or which services to patch or severely limit accessibility for endpoints.\n\nDefender is basically free with our Business Premium subscription. So why not look at that dash once in a while too, might learn a thing or two.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Darktrace is up there. They do a great job of prioritizing vulnerabilities not just telling you and having you sort through them",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I absolutely hate doing anything in M365 security. It’s painful.\n\nHow many browser tabs do I need before it takes me where I need to go?\n\nWhat do you mean I have to ask MS for permission to whitelist something?\n\nHas someone changed my permissions? Yes it was Microsoft.\n\nIt takes up to how many days for a change to take effect?\n\nHow many support tickets have we had open forever or unanswered?\n\nI have this on the tenant allow list and it’s still getting quarantined?\n\nHow many account managers will we have to go through to get tickets answered? As many as it takes until you get a North American one.\n\nIf I were you I’d get budget for better tools (if you can). I’d recommend Tenable or Qualys for vulnerability management. Qualys has better search capabilities than Tenable and I haven’t found it to be inaccurate.\n\nWe on-boarded M365 security and it was immediately clear during testing that we’d still need other products to fill in for its failures. It’s just not there yet to compete with the long term players.",
        "points": "0 points",
        "children": [
          {
            "comment": "Doesn't Defender use Qualys for scanning? EDIT: Spelling",
            "points": "0 points",
            "children": [
              {
                "comment": "I have no idea. But something about using M365 is usually more painful. We’re not really going to use its vuln stuff cause we’re more than a Microsoft shop ourselves.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Given Microsoft’s history of not being transparent I would def not trust them to be a check against vulnerabilities against their own platform.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Did you consider tanium?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aesdzq",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aesdzq/does_this_feeling_go_away/",
    "title": "Does this feeling go away?",
    "points": null,
    "comments": [
      {
        "comment": "You deserve it brother. Stay positive in this economy and reap the benefits of your labor! Everything else will sort itself out.",
        "points": "40 points",
        "children": [
          {
            "comment": "Thank you man 🙏🏻",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Focus on what you can control. Continue doing well at work and grow your rainy day fund.",
        "points": "13 points",
        "children": [
          {
            "comment": "Thank you so much, solid advice",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Under most circumstances, the people that hired you, promoted you knew what they are doing. Unless they have no idea what they are doing, you should have some faith in their abilities to ascertain whether you were, are, and will continue to be competent.\n\nAside from that, it’s more luck than anything else. But then, everyone is in the same boat in that regard.",
        "points": "8 points",
        "children": [
          {
            "comment": "Thank you my friend",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Imposter syndrome is real, but all the good ones have it. It makes you real and keeps you humble. Good luck. Go kill it :)",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You’re feeling something called imposter syndrome and you’re definitely not alone. Be proud of your accomplishments and don’t worry about losing it all. Just getting to the point you’re at proves you’re capable of it and that will show on your resume and through your experience. If you lose this job for whatever reason, you’ll be hire-able elsewhere. Look online for other advice on dealing with imposter syndrome as well.",
        "points": "7 points",
        "children": [
          {
            "comment": "Thank you so much for the kind words friend (:",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Great accomplishment man. I'm finally doing this at 38. I've been working my tail off, hopefully it'll pay off like your scenario did.",
        "points": "2 points",
        "children": [
          {
            "comment": "Cheers man, you got this",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Keep working hard like you are and there will never be a reason why you won’t deserve anything but more!",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nothing but kudos to you man.",
        "points": "1 point",
        "children": [
          {
            "comment": "Thank you sir!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Similar situation for me.  Dream job, got promoted 6 months in, great team, more than happy with my compensation and likely getting a raise in the next few months.   Getting good reviews, my team seems really happy with me, hitting all our KPIs, and still I wonder.\n\nIt's often referred to as imposter's syndrome.  It's pretty common in my experience.   The biggest mistake I think people like us make is not asking for help when needed.  The insecure little voice in our head tells us we should be able to handle everything that comes out way.  Don't be afraid to ask for help when you need it.",
        "points": "1 point",
        "children": [
          {
            "comment": "Thanks man, I need to read this",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "To placate your concerns, don't adjust your spending or lifestyle until you feel completely confident that you're at the level.\n\nSome contractors get their first gig on a great day rate and go and get finance on the new car or whatever, not realising that the contractor life sometimes means periods without work.\n\nWhen you're in your groove, built up a network and are confident, then you can start adjusting how you live.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "100% normal, took almost 3 years for this feeling to fade. Still comes back some times.",
        "points": "1 point",
        "children": [
          {
            "comment": "Thank you my friend!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Awwww I’m proud of you! I love reading stuff like this. Keep it up internet friend 🦋",
        "points": "1 point",
        "children": [
          {
            "comment": "Thank you so much!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Continue doing well and the opportunities will always be there. I’m an expert in a different industry and when I first got to a great spot, I couldn’t believe my luck, and likewise thought it may slip through my fingers, but nope, years later, I’m known in my field and respected, so it’s even easier to make more money. Take deep breaths and keep crushing it",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Don’t worry a layoff might humble you soon, hopefully not though",
        "points": "-1 points",
        "children": [
          {
            "comment": "Thanks for that lol",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If they're hiring, lmk? The market is absolutely dead right now! Yeah, I goes away after they pile on a crap ton of work on you and you start to feel burnout. SOC folks have the highest burnout rates next to MSP people.",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Keep doing what you're doing and grow your rainy day fund like the other user said. That may give you the peace of mind you need. If you're valuable to the team, no one would want to lose you. Hard work pays off! Congrats mann. Really good job!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is what I needed. As someone who’s about 30 and wanting to get into cybersecurity I’m worried that I’m either too late or will never be successful in this field. I never went to college and am hoping to start this fall but all I’ve seen lately is the negative aspect of this field.",
        "points": "0 points",
        "children": [
          {
            "comment": "38 here and got my first job in security last year. It's going just as well as OP, all due to my intense curiosity and motivation. Never went to college either.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Flex 💪",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I feel the same way and my story is similar to yours.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I hope I can follow your footsteps man",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You are cool. Most people see themselves as entitled to something, while you - who actually deserves it -, are humble.\nYou should be proud of yourself.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aerfio",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aerfio/conferences_and_online_infosec_communities_for/",
    "title": "Conferences and online infosec communities for networking",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1aeqqgg",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aeqqgg/daily_security_rant_anyone/",
    "title": "Daily security rant. Anyone?",
    "points": null,
    "comments": [
      {
        "comment": "\"Busy people with crucial jobs like yours are especially attractive to criminals due to the sensitive data you process. Please take it as a compliment that it's so important for you to complete security awareness training.\"",
        "points": "228 points",
        "children": [
          {
            "comment": "Very nice!",
            "points": "24 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Now, this is social engineering.",
            "points": "50 points",
            "children": [
              {
                "comment": "I am the Kevin Mitnick of apple polishing.",
                "points": "18 points",
                "children": [
                  {
                    "comment": "Steve Knobs polisher",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "And the Steve Jobs of selling turds as apples?",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "RIP :(",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Eloquently put",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I know you're just ranting and maybe not expecting a suggestion on solution, but I have dealt with this a lot at my company (which used to be small but is getting closer to medium-sized) and the answer was creating policy documents that users agree to on their first day of work. This allows me to be a bit dismissive and short with people that complain on stuff like this, I can simply say \"you and everyone else in the company agreed to the Information Security Policy. This includes phishing testing, annual training, proper device usage, etc.\" Gets them to shut up pretty quickly :)",
        "points": "46 points",
        "children": [
          {
            "comment": "I will emphasize this in our existing policy but they did agree and sign our data security policy which does talk about ongoing training. Going to have to be more specific.",
            "points": "12 points",
            "children": [
              {
                "comment": "We also let them know that our cyber insurance provider mandates phish testing and that leadership has backed the training.",
                "points": "18 points",
                "children": [
                  {
                    "comment": "I can't believe I didn't think of that. This is the answer right here that stops the arguing.",
                    "points": "7 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Fwiw I wouldn’t recommend this approach. Pulling legal on people isn’t going to win you any favors. You’re just making an enemy.\n\nBut, I’m a bit confused. How are phishing sims wasting time? She can just ignore them? Is there something I don’t get?",
                "points": "6 points",
                "children": [
                  {
                    "comment": "I work at a law firm and was able to get support from our General Counsel, Managing Partner and Exec Director on basically 100% of security matters. Being able to lean on the backbone of an org really helps to not just explain but also quell any type of discontent with security awareness or necessary changes.\n\nI think a lot of people may not have that inroad or backing from the exec level, so trying to establish that if possible would be a big priority for me.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "That's better than being \"dismissive\"",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Is that what you want though? Shouldn’t that be a last resort? Persuasion is better",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Our knowb4 is set to 11. As a result quite a few legit HR emails get ignored.",
        "points": "11 points",
        "children": [
          {
            "comment": "Preferable in my opinion. I know that may elicit some guffaws but it is what it is. We can always go looking for a legit email, just can't rewind a ransomware extortion.",
            "points": "5 points",
            "children": [
              {
                "comment": "Part of training is also telling the good from the bad, so it should be counted - also discourage the bullshitter who will undoubtedly use it as an excuse",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I dunno.. It seems to blind us a bit. We're not looking for anything else",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "the average user doesnt see any value in any interruptions due to security. just the way it is. none of it really surprises me anymore",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I love when people try to explain that they're so busy they can't do something that would take them maybe 30 seconds a month. People use excuses for things like that sometimes like a quick response to an email or anything that's really fast. I'm sorry but no one is that busy. If you're that busy you're doing something wrong.",
        "points": "11 points",
        "children": [
          {
            "comment": "Agreed! It's more like they just don't want to have to think about it and whether it's spam/phishing or not which is worse to me.",
            "points": "2 points",
            "children": [
              {
                "comment": "Also, how are you handling people who click the links in phishing emails and how are you handling people who report the phishes? Do you have a positive reinforcement system for doing things right? This is often a way for people to better buy in to the testing.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "We have immediate remedial training if they click a simulated email. Once we get the report showing zero clicks we applaud that on a company-wide level and typically we'll schedule a company-funded snack or treat event.\n\nWe don't write anyone up for not doing the training, but I start bugging them :D (wise guys and gals sometimes report my emails as spam, which is light-hearted fun and I stop by and have a chuckle with them)",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Do you call out individuals for reporting phishes?",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "I'll use them during staff training with their permission (praise) here and there but there are too many to send out a thanks to each one. We have a popup once catching a simulated email but if it's a legit spam and they report it, I'll look into it and thank them for reporting it to me. I want to encourage that. It's the one thing that really keeps me up at night.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "People who report phishes get to take a few Swedish Fish from my bowl. People remember my Swedish Fish.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAGGHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH",
        "points": "5 points",
        "children": [
          {
            "comment": "<3 this.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'm realizing this is the reality of the tech industry\n\nI got into tech cuz I'm introverted and didn't want to deal with people but proper communication is the most important part of the job 😂 fuck",
        "points": "4 points",
        "children": [
          {
            "comment": "Likes computers, hates people.\n\nTakes a job handling computers, gets promoted to handle people.",
            "points": "2 points",
            "children": [
              {
                "comment": "And now its a meeting with HR because I threatened to reboot Jim…",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If it's an Executive, they'd have to sign an Accepted Risk spelling out why we do these tests and the potential harm that could occur if we don't do it.\n\nOtherwise, I'll tell them it's required and if they want to escalate it, they'll need to bring their manager in on the conversation. That's when I'll pull out the talk about \"You heard about Colonial Pipeline being hacked, which shut down the gasoline supply to much of the east coast? That was due to someone clicking a link in a phishing email. We send these tests to be sure you know what to do when you see a suspicious email. Consider it practice. I know I don't want to be the one responsible for getting our company on the national news.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm asking because I genuinely don't know, is security training effective at preventing security breaches? How effective is it?",
        "points": "2 points",
        "children": [
          {
            "comment": "defense in depth - we've seen significant improvements in not only testing but real world reporting of phishing, and even if it's a false positive they are still actively thinking about it and bringing the questions to us. we also typically train (outside simulations) on how to be better with your cyber hygiene in real life and at work, people appreciate that.\n\nbut yes, 3-5% of people will click on anything and everything....",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I've witnessed time and time again users who come to me because of training and tell me they've dodged a bullet that slips by the firewalls. So yes, 100% YES! Can't emphasize that enough. Your users are the first line of defense. Bad actors don't usually try to break through your firewalls like the movies, they mostly try to target your users and trick them into giving them access or information.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "My monocle is still popping, won't stay in at all.\n\nGlad your sense of humor remains intact, take my upvote ma'am/sir.",
        "points": "5 points",
        "children": [
          {
            "comment": "Oh yes, have to do that to stay sane! Thanks!",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I had a funny little related incident happen recently.\n\nI was reviewing a fix to some code for a web application; the fix in question was tied to social media (i.e. clicking the Twitter icon on the web page should redirect the user to the company's Twitter account).\n\nLater in the day, I received a message saying something to the effect of my use of social media on company device(s) has been logged and forwarded to management (\"click here for more details\"). Figuring this was tied to the above-mentioned web app fix review, I forwarded that message along to my manager, with context and the JIRA ticket attached explaining why this had probably been triggered.\n\nIt turns out the message was one of those phishing training emails that had coincidentally been timed/themed. While I didn't follow-up by clicking on the link, my manager did when they received the email I forwarded. We both had a good chuckle; then when they had to do the follow-up security training, I figured I should as well in solidarity.\n\nTraining benefits everyone.",
        "points": "2 points",
        "children": [
          {
            "comment": "I do the training just to see what they're seeing. I'll be damned if I didn't enjoy it.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "“Now I’m just gunna phish you harder”",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "How about sending her an email from a suspicious looking domain, saying \"Please click on this link to opt out of security training.\"",
        "points": "2 points",
        "children": [
          {
            "comment": "Oh you evil, evil person...I love it!",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I always enjoyed receiving those Executive Opt Out of the email phishing test requests. We had Executive support to deny them and we did. We also never told anyone when the test would occur. It makes no sense to exclude, or notify in advance, anyone, especially the top level executives. Those accounts, if breached could inflict immediate and widespread damage to the company. The more power a person had within the company or more access the person had, especially to intellectual property or infrastructure/systems, the more they needed to be truly tested and made aware of the potential attack/threat vector.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m the opposite of that user, LOL. I love getting practice phishing emails. My employer sends one a month, I’ve noticed, and we get immediate feedback showing whether the email we reported was a fake phishing attempt. I don’t want to become complacent when it comes to emails and clicking links—and you’re right, when people are busy and not quite paying attention, that’s when phishing emails can do some damage. So take heart; some people do appreciate the effort!",
        "points": "1 point",
        "children": [
          {
            "comment": "That is good to hear, I've got one or two users like that at least.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The executive and council members \"take\" their cybersecurity awareness training.\n\nThen click on phishing emails and complain to me.\n\nI let them take training like everyone else who fails phishing tests.",
        "points": "1 point",
        "children": [
          {
            "comment": "And to add to this, recently policy training was announced (it's an annual thing) and the email came out with all the Hallmarks of a phishing email. Sent early in the morning, check! Sent with links and am announcement to complete training with urgency, check. Looks like external because an automated system sent it, check.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I started asking if they wear their seatbelts while driving",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That sounds very frustrating, so sorry you had to go through that! I generally agree with other comments here regarding instilling user responsibility (e.g. having them sign security policy doc on the first day, mentioning cyber insurance, etc.), but I would also emphasize that I've seen some element of empathy to be key in getting buy-in from the employee body. I realize it's probably extremely difficult to empathize with someone who is behaving like this (I feel like you need to be a saint to work in sec) but the fact of the matter is that there is probably going to be a lot more of these kinds of people in any org, so it's always a delicate balancing act... Probably not what you wanted to hear (sorry!), but try to get as much buy-in from folks (esp exec team) as possible moving forward if you can... Maybe some beer after work to calm down the monocle :)",
        "points": "1 point",
        "children": [
          {
            "comment": "Very true, very true. I'll see your beer and raise you an Old Fashioned.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You're right.\n\nOn the flip side though, I'd rather deal with this than all the users who are just confused, never hit the Phishing button, and open a damn SNow/Jira ticket about it to make sure it's legit thus making the process harder for them.\n\nIt's a revolving door, and they all know a simulation happens quarterly...\n\nEdit: sp",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The average employee doesn't care about security. I learned in pentesting you need to Oreo cookie it.\n\n\"It's great that you could tell this is a phishing email. As you know, there are phishing emails you get that are legitimate attacks -- it's important that you report all suspicious emails so that way you and others won't get any more phishing emails. Your ability to recognize these and report them is the only way to eliminate them.\"\n\nIt may seem over the top, but sending an email to their manager and BCC them on how impressed you are with their security awareness is awesome, encouraging, and something few people think to do. Killing the ignorant with kindness tends to reduce the friction.",
        "points": "1 point",
        "children": [
          {
            "comment": "Applies in many facets of life I suppose.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "There’s always these people in every organization. We’ve had red team access a normal user who was using a waterfall password, then used her account to phish like 40% of the building. These are people who are required to take security training annually. We got the csv with the list of people and most if their reasons were something like “I was too busy to really check the link. Just saw it was from HackedUser”",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "hands you a beer ey comrade, happens a lot.\n\nI too run the phishing sims for my company and Ive had that conversation more than once. Ive had very angry employees telling me that they arent taking the training (it is not enforced because that would be an HR thing I don’t need in my life) and that they definitely did not click anything in the emails. 9/10 these people are repeat offenders.. Ive had TSM’s (technology service managers, the site specific IT manager) tell me their people are FAR too busy to have us ‘spamming them constantly’ and… those sites usually had the worst response rate.\n\nI just shake my head..",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I would say sure then have someone try to phish them over a messaging system or by phone.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If this is someone who doesnt have the power to demand request like this simply say no.\n\nIf they are a higher up with the power to request such a thing then document it and go grab a coke brother.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"So you're handing me your resignation? Probably should take that to your manager and HR\"...",
        "points": "4 points",
        "children": [
          {
            "comment": "Love this",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "At a previous job (fairly large, international company), a member of senior management sent us and the CIO an extensive calculation of how much money the company was losing due to the time it took to log in, unlock the screen, and so on. The overall tone was quite aggressive, like \"stop that bull....\". CIO just responded like \"I'm not gonna do that\". Never heard back from him.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just disable her email account - no more phishing tests. Job done :)",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We're doing phishing exercises too. One user apparently failed the test (we collect aggregate data only, no userid) and sent a message to it sec apologizing(???) but also included a fwd from the rest of his team discussing the exercise and warning them(it is noted everywhere to NOT inform colleagues).",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The higher ups are the biggest targets. So, if they want to be taken off, that's fine with me. Sign this risk acceptance sheet that if there are any successful phishing attempts, breaches, etc. due to them, their machine, their email, etc., they are 100% at fault by the company, etc.etc.etc..\n\nNo one has wanted to take that risk for such a simple once a month phishing test. They do, however, report our phishing tests fairly often as well as legitimate phishing emails. So, that's a good thing. They know they're being targeted. All it takes is one to slip through by being good, in a hurry, a whoops I didn't mean to, whatever. They know.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "To me, I understand both sides. Even i find certain cybersecurity protocols to be a necessary evil, but that’s because I’m knee deep in the industry. People who don’t understand just think it’s an inconvenience and an obstacle in front of their own operations and work.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Double the phish testing frequency for her",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have conducted phishing simulations myself. I designed the emails and everything.\n\nYet management still wants to test me for phishing. Last time, I identified a header that was the same in every phishing mail and set up an automatic forward to our IR department.\n\nIt does feel patronizing and like a waste of time.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aeqej2",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://bugprove.com/knowledge-hub/cve-2023-5372-post-auth-blind-python-code-injection-vulnerabilities-in-zyxel-s-nas-326-and-nas-542-devices/",
    "title": "Post-auth blind Python code injection vulnerability detected",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1aepxcz",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aepxcz/mistakes/",
    "title": "Mistakes",
    "points": null,
    "comments": [
      {
        "comment": "Added a legitimate hash value to the IOC list in Microsoft Defender which caused a massive list of false positive events for our SOC",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Gave a presentation to a cybersecurity Vp that absolutely dumped on his program and called it out for the garbage that it was with 1s and 0s out of 5 in each security domain maturity level. Yeah I was naive and thought that was what he actually wanted….",
        "points": "1 point",
        "children": [
          {
            "comment": "I am doing this right now and asking for funding. Not going too well but risk is a moving target it changes year to year and maturity is going to get a huge makeover with NIST 2.0.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Participated in a servicenow survey to get a free coffee mug.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Imported vulnerability scan configurations from Nessus Pro to Tenable Security Center. Didn’t think to check all the settings and brought down production systems for a few hours.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Close to 20 years ago now, building a config on a monitor port and at the end of the config instead of setting the VLAN tag entered 'default VLAN' and hit enter control z and write mem.\n\nThe monitor port just happened to be on the primary office VLAN and as such I sent default VLAN to the switch for the office network which essentially deleted the VLAN. Thank goodness for every other hour network config backups. swap running config reboot and things returned to normal but every single person in the office knew something had happened.\n\nNEVER want to be in that spot again if I can help it. Sandbox network went up that same week.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aepp6r",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://github.com/lkarlslund/adalanche",
    "title": "Adalanche: Active Directory ACL Visualizer and Explorer",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1aep5ks",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aep5ks/hiring_with_family_member_on_staff/",
    "title": "Hiring with family member on staff...",
    "points": null,
    "comments": [
      {
        "comment": "I've never had an issue with that. One of my current lead engineer's wife works in marketing. At a previous company one of the dev's wife worked in IT support.\n\nThere is more a COI when the family member works for a competitor than at the same company.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As long as their responsibilities, accountabilities, reporting and decision scopes don’t overlap, it isn’t a big deal. So basically they shouldn’t work in the same team, shouldn’t report to each other, shouldn’t report to the same vertical, and shouldn’t make decisions that affect the other.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aekxtl",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aekxtl/where_do_i_find_true_entrylevel_cybersecurity/",
    "title": "Where do I find true \"entry-level\" cybersecurity positions with a Masters degree?",
    "points": null,
    "comments": [
      {
        "comment": "Learn to walk before running\n\nHelpdesk 1- 2Y > sys / network admin / engineer 1-2Y > Cybersecurity entry role.",
        "points": "7 points",
        "children": [
          {
            "comment": "This",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "So why did you take the EP job then?\n\nIt's pretty well know what type of job/schedule that entails\n\nAt any rate\n\nWhere are you in the world?\nWhat industry do you want to work in?\nwhat other job experience do you have?\nAre you on linkedin?\nHave you gone to any job fairs?\nDo your schools have a career center for alumni?\nAre you connecting with Alumni to get leads on jobs?\nHave you talked to any IT staffing companies about getting into any kind of entry level IT role?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I teach part-time and I've had a few students land SOC Analyst roles as their first tech gig - it's definitely possible but these students were involved in a lot more than just the regular curriculum. Most of them had obtained certifications like the Security+ and PenTest+. Furthermore they were on Hack The Box and Try Hack Me, and they were also involved in after school clubs like the CCDC.\n\nI do feel for a lot of you who have these degrees because you've been sold a field of empty promises. Cybersecurity jobs are in demand (True). Entry-level Cybersecurity jobs are not entirely in demand and it's fiercely competitive because EVERYONE wants to get in.\n\nHonestly when people say just go after a Help Desk or Support type roles to get some experience - it's genuine. I started in Support roles then went to Sys Admin roles and even took a weird path to the Storage world before finally landing in Security. I have previous managers who literally cannot find people to take entry-level support roles and they honestly the pay isn't even bad for what you'd be doing (60K+ base with bonus and benefits + WFH). Help Desk and Support gets a bed rep but it's still a whole lot better than doing nothing even remotely related to your degree.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You generally need some cyber-adjacent experience, even for entry-level jobs. IT/sysadmin, developer, business analytics, audit, etc are all great for breaking into cyber security.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You can go towards help desk. Only job you’ll be able to get tbh.\n\nYou’ll either use help desk as a stepping stone or you’ll slowly decompose working in help desk lmao",
        "points": "0 points",
        "children": [
          {
            "comment": "Why is that? If I get a few security certs will that change? My current job is overnight and spend 85% of the time in front of a computer, so I could get certs online.",
            "points": "0 points",
            "children": [
              {
                "comment": "I had 5 years of IT experience before becoming a SOC Analyst. I stood out to my employer because of this. The main reason is because cybersecurity is essentially an extension of IT. You are securing IT stuff. It’s not impossible to land a cybersecurity job without prior IT experience, however, having the experience makes it wayyy easier. How can you effectively secure the IT stuff if you haven’t grasped the basics of Active Directory, networks, DNS, DHCP, firewalls, troubleshooting, etc. Again, not impossible. Just answering your question :)",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "It’s no coincidence 99% of folks on here will tell you to go to help desk. Some are lucky enough to get SOC jobs.\n\nIt’s discouraging & personally why I shifted to SAAS.\n\nGuys telling me they spent 2 years in help desk just to MAYBE get a cybersecurity job didn’t sound remotely appealing to me\n\nCerts are nice but experience is king.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "SOC Analyst",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aekufn",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aekufn/coursesclasses_to_improve_employability/",
    "title": "Courses/Classes to improve employability?",
    "points": null,
    "comments": [
      {
        "comment": "I think your first step is learning how to use paragraphs...........\n\nSo you only have 2 years of job experience total and you though it would be a good idea to quit your job?\n\nWhere are you going to school for your MBA?\n\nAssuming your previous employer won't take you back, then you need to talk to every single IT staffing company in your local area, get your resume out there and get into any contract to hire role and get back to work\n\nAn MBA is pretty useless to someone who only has 2 years of working experience, especially if you're going to some random online or unranked program\n\nI would put that on hold, focus on getting back to work and getting some IT/security certs that matter",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aek5fk",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aek5fk/is_it_worth_it_anymore_to_go_for_a_career_in/",
    "title": "Is it worth it anymore to go for a career in cybersecurity?",
    "points": null,
    "comments": [
      {
        "comment": "It's the same thing across all technical fields. Security is probably one of the lesser affected fields compared to devs/SWEs. The market is just bad in general.\n\nYou're on the right path and have a solid plan post-graduation.",
        "points": "40 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "At this point, internships are going to be your best bet. Apply to as many as possible with as many reputable companies as possible.",
        "points": "9 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "depends where you are… im getting hit up by head hunters on a weekly basis in canada",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You'll be fine. Most people complaining about jobs are the ones that don't interview well, have bad resumes, can't articulate their experiences, or are still at the entry level.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Absolutely worth it. Try looking for employment with an MSSP or a security Vendor instead on just one company's team.\n\nThe one I am at was booming during covid and still has lots of growth.\n\nEveryone needs cybersecurity and the C-Suite is finally jumping on board that security is important.\n\nEdit: sp",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The market is making a shift to experience based qualifications. Certifications are nice to have, but are not enough. You need practical application of all that theory. If you can't get an internship, build a lab.\n\nApply what you learn in a lab environment in the form of projects. Network fundamentals are a must in cyber security, start there. Do some Microsoft courses, workstation, server, active directory. Build a small environment, test a ton of stuff.\n\nBuild it , break things, rebuild. You can use lab experience on your resume.\n\nHiring manages are looking for attitude, aptitude, and adaptability. In addition, soft skills like critical thinking, curiosity, analyzing, problem solving, troubleshooting, thinking differently, communication skills, leadership, etc.\n\nYou have to talk the talk and walk the walk. By having a lab environment you are showing that you are curious, willing to learn, and proving it.\n\nDo CTFs, read security articles and post comments on LinkedIn and the article link. Show off your knowledge.\n\nI had my now college graduate get Network+, Security+, build our lab environment, apply all that theory, build our active directory, build our VMware server, do a ton of CTFs, post articles on LinkedIn, and other projects.\n\nHe was getting interviews, but always fell just a little short of getting the job, usually lack of experience, Only after adding the lab experience on his resume did he get a killer job.\n\nStick to it, prove you want it, show your willingness to learn.\n\nBest of Luck!!!",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All of the job market is shit right now. Tech is experiencing it badly because they vastly overhired during the COVID Era and it's now correcting itself.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The field is going through a shift in what qualifies a cybersecurity professional.\n\nCerts used to be required so vendors like, isc2 and comptia, had the market all to themselves. Now a degree from an NSA accredited school qualifies a candidate.\n\nA lot of what you're seeing is a hiring pause until the new system picks up steam, and reaction from Cert monkeys who've been swindled by \"instructors\" and bootcamps over the last 18 months.\n\nMy next move is to senior or manager, last year was really quite but I started getting interviews and cold calls for really awesome positions at the end of November. Just got one yesterday too. Right now it's either \"lowballs\" or \"cold feet\" until salaries are figured out.\n\nHiring for everyone, especially college grads, should pick back up soon.",
        "points": "0 points",
        "children": [
          {
            "comment": "I think this is a flawed analysis, while true about the specifics. I believe a stronger reason is the general state of the tech sector and the layoffs/cutbacks that has been occurring for the past 12+ months, continuing in this year.\n\nSecurity is also all the rage now while it wasn’t very glamorous to be an analyst or incident responder not too long ago, and many companies didn’t even really start their security journey/focus that long ago and don’t often have many related positions in their organisation. So the market is relatively small and heavily saturated as well.\n\nAnd this is observed internationally as well, it’s not just a local US problem, so the NSA accreditation and cert changes doesn’t seem likely to be a big driver in this.",
            "points": "2 points",
            "children": [
              {
                "comment": "So you say it's a supply and demand issue, sure that applies to any industry and market.\n\nNothing you state is a variable that offsets my assessment, in fact your only argument is \"it just sucks right now guys\"\n\nUS regs are what made cert vendors relevant internationally, the vendors may stay afloat if they can convince enough international gov't to mandate their certificates, but that's yet to be seen.\n\nDo your research or get left behind",
                "points": "-4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "A VERY flawed analysis.\n\nGlad to be called a \"cert monkey\". ffs",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Finish your bachelors in computer engineering and you'll have no problem getting a job",
        "points": "-5 points",
        "children": [
          {
            "comment": "There are too many certification trolls in this sub to put a real answer like this.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "By the time you graduate the market may be completely different.\n\nWe placed a request for a budget to hire a few new people and weren't outright rejected, which is something. Still every position after an employee leaves is dropped by default and we need to give justification why so we still need it, but it seems like \"no new hires\" policy went away.\n\nI'm waiting to see if they reject it at some later stage, cut paygrades/positions/both or accept as it is.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Cybersecurity is probably not worth it unless you're a glutton for punishment.\n\nhttps://brothke.medium.com/the-big-lie-of-millions-of-information-security-jobs-a7cb1b30c5b6\n\nhttps://www.axios.com/2023/04/21/cyber-defenders-burned-out-survey\n\nhttps://www.securityweek.com/cisos-spooked-by-sec-lawsuit-against-solarwinds-ciso/",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Depends. I did one IT internship, starting a Cyber Defense internship soon and going to grind my butt off for a return offer. All gotten after many many failed interviews and applications. I am a 3rd year InfoSec student at uni. If you are on the right path and learning new stuff/ going over stuff 5-10 hr a week you will be farther than 50% of applicants.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I just landed a new grad job, there is hope!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aeiyq2",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aeiyq2/possible_to_find_a_job_in_cybersecurity_given_my/",
    "title": "Possible to find a job in cybersecurity given my condition?",
    "points": null,
    "comments": [
      {
        "comment": "Only if you are skilled enough",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aepb6i",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aepb6i/what_do_you_think_of_people_who_send_emails_in/",
    "title": "What do you think of people who send emails in text mode and strips out all previous emails’ rich text formating and html?",
    "points": null,
    "comments": [
      {
        "comment": "Wise people!",
        "points": "26 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is the way.",
        "points": "16 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "morse code sounds",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I usually think “thank you,”",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They're the heroes I wish I was brave enough to be.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "RESPECT, good netiquette.. but it will be more respect if he had is own mail server that strips the mail he sends via a pipe filter script, reads the outgoing mail as stdin, detects html/preformats and convert it to good old 127 bits ascii...\n\nAfter some time, you got tired..",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I only use text and I don't top quote. I'm from an era when email was used only by techies and not by executives. An era before outlook invented top quoting.",
        "points": "9 points",
        "children": [
          {
            "comment": "Same",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Extra points if people are using obnoxiously long signatures.",
        "points": "5 points",
        "children": [
          {
            "comment": "Reminds me of those 2000's-era forums where boomers would have all of that flair on their flavor text for each post where they would post one-sentence replies and their signature would take up half the screen.\n\nYeah. That sounds good. Here's a picture\n[Imgur not found]\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~\nTHE FEW, THE PROUD, THE MARINES\n3381 DEVIL DOG SERVED IN DESSERT STORM\n🧨🧨 🇺🇲🇺🇲 SEMPER FIDELIS 🇺🇲🇺🇲 🧨🧨\nDRIVE A DODGE AND I'LL RAM YOU FROM BEHIND\nOBAMA? MORE LIKE OSAMA BIN LADA\nOBAMA WAS RESPONSIBLE FOR 9/11\nLINK TO MY YT CHANNEL EXPOSING THE 👉👉👉 BLUEBLOODS 👈👈👈\nDONATE TO MY CAUSE HERE 👉👉👉tinyurl.spamspamspam👈👈👈",
            "points": "8 points",
            "children": [
              {
                "comment": "3381\n\nYour post is extremely funny, but tactical cooks get a bad rap! If you're deployed on a remote outpost, coming back from a mission and having some hot food that's not an MRE really hits the spot.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Troof",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Are we not supposed to use our resume as our signature?",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I love the ones with \"Please delete this email if you are not the intended recipient\".",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Good for them? I mean, there are still some email clients (pine, mutt) that are text only or those people might be intentionally using text only even though their client supports it for accessibility reasons",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I feel like it’s kinda old school but I like it",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Heroes",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you can't express it with ascii characters, it's not worth sending (or deserves to be a PDF).",
        "points": "2 points",
        "children": [
          {
            "comment": "Best examples I've found of bloated email content is signatures that have so many domains and images in them that they end up being blocked from sending as their TLD is flagged as malicious on OSINT. Some spread the net so wide that it almost ends up being self-inflicted DoS",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "What does this have to do with cyber security?",
        "points": "2 points",
        "children": [
          {
            "comment": "I think it’s more of a “look at me, I’m better than everyone else” post than anything.",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It's very old-school. I'm not sure what the benefit is, in any workplace with modern (or modern-ish) IT.\n\nIt's probably a plus for anybody in your organisation who's using a vt102 or a teletype machine.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm fine with it.\n\nBut I tell you, RTF helps to get complex crap across to non-techies. So I'm never on plain text for myself.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Those are my people.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aeo9m5",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aeo9m5/how_long_do_you_think_this_will_last/",
    "title": "How long do you think this will last?",
    "points": null,
    "comments": [
      {
        "comment": "I don't think it will ever go back to what it was 5+ years ago.\n\nSchools are pumping out too many \"cybersecurity\" graduates where that program didn't really exist a few short years ago. Many of these schools had good intentions on \"bridging the gap\" of professionals in the industry, not realizing the true gap was for experienced cybersecurity professionals with a solid foundation in systems and networks, rather than entry-level staff who have used Metasploit and basic SOC tools.\n\nThe schools don't care anymore because it keeps enrollment numbers high, and they are now delivering students a false promise that they will be super in-demand.",
        "points": "608 points",
        "children": [
          {
            "comment": "You just perfectly described my undergrad experience 😂",
            "points": "235 points",
            "children": [
              {
                "comment": "To be honest tho. Finding entry level IT jobs aren’t hard. Couldn’t you just built into that to get more experience and leverage that for a cyber security job ?",
                "points": "59 points",
                "children": [
                  {
                    "comment": "I wish the job market was as easy as “get an entry level IT job” to get into Cyber. That’s how it was 5+ years ago. I’m currently in an entry level job with my bachelors in Cybersecurity and Security+ and still can’t land anything.",
                    "points": "76 points",
                    "children": [
                      {
                        "comment": "Same man, a year and a half of help desk with security + and homelab projects with a pretty slick resume and haven’t heard back from anything. Been honestly considering pursuing other positions",
                        "points": "33 points",
                        "children": [
                          {
                            "comment": "It’s gotten really frustrating. Just keep at it though man. I’m probably going to find a new help desk job that pays more and just never stop applying to cyber jobs until one finally lands.",
                            "points": "17 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "Have you thought about pivoting to platforms for a year or two then into security?",
                            "points": "4 points",
                            "children": [
                              {
                                "comment": "What does pivoting to platforms mean here exactly?",
                                "points": "4 points",
                                "children": [
                                  {
                                    "comment": "moving over to another tech role, platform as in management of platforms and systems, this can get you (depending on the job) exposure to both hardware and software systems on actual infrastructure, and security related experience as sometimes these give you exposure to encryption management, physical security, vulnerability management/patching etc.\n\nthat kind of experience is also very useful for security related roles so you could do something that's an intermediary jump before getting into security if you having trouble with just your help desk experience",
                                    "points": "11 points",
                                    "children": [
                                      {
                                        "comment": "",
                                        "points": "",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "My experience is, IT helpdesk for 1.8 years, systems access admin 1.8 years, eDiscovery (cybersecurity adjacent) 1.8 years, information security Analyst (third party security, GRC heavy) 1.8 years, now in a solo cybersecurity role doing everything.\n\nTakes time and doing roles you might not want to do.",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "[deleted]",
                            "points": "7 points",
                            "children": [
                              {
                                "comment": "What type of roles were you applying for? Sounds like these roles were looking for demonstrated experience.\n\nIMHO those certs should at least get you a look at a SOC analyst role to use as a stepping stone.",
                                "points": "7 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "What positions are you applying for exactly? Just curious",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "SOC analyst mostly, I try to apply to junior or entry level analyst roles but still do not hear anything back from them. They have all been remote though because there is not anything near me",
                                "points": "4 points",
                                "children": [
                                  {
                                    "comment": "",
                                    "points": "",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "That would have been enough in 2015. Now you also need CCNA, and CySA+ or BTL1 too. And another year or so of industry time. Fair? Maybe not but this is just how competitive it's become.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "At some point you all were lied to. Entry level cyber security jobs are not entry level jobs. A few years on a help desk will not normally land you a job in cybersecurity. In reality it’s help desk > PC tech > sysadmin\\network engineer > cyber security. This path will take you at least 5+ years.",
                        "points": "40 points",
                        "children": [
                          {
                            "comment": "Alternatively, work Help Desk for a company small enough that they can't afford to hire dedicated roles for every need. Then you can at least get hands on experience that's normally outside the purview of Help Desk, and merge that with your homelab knowledge to paint a more impressive version of your resume.\n\nI've been in IT and Security for 14 years. The secret to getting a job when it's hard is often a combination of forcing yourself into situations where you'll learn things, and exaggerating the part you had to play at your real jobs. Some boy scout will come on here and tell you that's unethical, but business owners aren't playing fair either.",
                            "points": "23 points",
                            "children": [
                              {
                                "comment": "I mean it’s fairly simple math. Look at the total number of jobs available in the field compared to the total number of qualified people. The market is oversaturated with educated people. There honestly is zero demand.",
                                "points": "1 point",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "Oh hey, while you're at it, get your CCNA, CySA+, OSCP, CEH, CISSP, and a dozen other certs, but be willing to work for $15/hr if you're lucky, because you're still \"entry level.\"\n\nQuit gatekeeping. 20+ years ago when cybersec was so new that it didn't have a name, sure you needed 5+ years exp. Today? Entry level roles are absolutely entry level. It's people like you that just like to see people suffer because you did. Entry level means entry level. If you have 5+ years industry experience you aren't entry level.",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Are you able to move/applying in other areas of the country? That's what it took for me to get my foot in the door. It helped. A LOT.\n\nIf you can't, that's completely understandable... however, then your likely pool of success drops CONSIDERABLY.\n\nI got my first analyst role half way across the country. Worked there not even less than a year and was able to fully move back home to a new cyber gig for engineering. The role I WANTED in the first place, but they wouldn't look at me until I had some experience.",
                        "points": "8 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "😕 that’s disheartening to hear. It’s difficult because he market is so incredibly saturated. Keep trying I believe in you.",
                        "points": "4 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "I’m currently in an entry level job with my bachelors in Cybersecurity and Security+ and still can’t land anything.\n\nThat's because Sec+ is the minimum cert you'd need to be competitive and no one respects a Bachelors in Cybersecurity.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "This right here. I graduated with my Bachelor's in cyber Sec in 2021, have been working in help desk for over 7 years. I have my CompTia A+, my ISC2 CC and am studying for my CEH. My work does not pay for any of my training, certs or to maintain my certs or schooling either. And I STILL have yet to land or find a way to land an entry job out there. Entry level cyber Sec jobs are like finding a unicorn. Seems to be luck or who you know. I figure you just have to keep at it, you never know what might come your way.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "To be honest, it's actually hard. A LOT of entry level IT HelpDesk asks of requirements that you won't even get from San Francisco State Univerity doing Computer Science as a major.\n\nYou can still get hired, but majority of job postings will deter people from applying. Some of them ask for familarity with tools you'll never use till you're in IT... but then how do you get if you can't get experience?\n\nThat's right, you look for an internship, but wait. That internship asks me to be a current student.. guess folks can't apply there either after graduating or getting a non-tech degree looking to shift over.",
                    "points": "7 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "My background before getting into cybersecurity was systems and network engineering, and as I began training/coaching new analysts in a SOC (students fresh out of cybersec degrees) I certainly noticed this. They knew some Metasploit and Kali usage, digital forensics tools, various recon techniques, but no basic networking or IT skills. They didn't know how to review packet captures, network logs, device event logs, etc (which is a huge part of being an analyst). Pretty much none of them understood subnetting or network addressing at all.\n\nI agree that the initial intentions were good, but they are very much so not teaching the right things. To this day I still don't think there needs to be \"cybersecurity\" degrees, personally I have a CompSci degree and the generality of it is actually more useful than such a specifically-focused degree. I have always had far better luck with ex-IT or ex-network/systems people in regards to performance in a SOC space.",
            "points": "37 points",
            "children": [
              {
                "comment": "To add onto this I've seen some teachers briefly cover Wireshark, not explaining why it works, how it works, etc. Just to open the packet look for this random string and disregard the rest. That's not good. I'm not sure Cybersecurity is something that can be learned without some knowledge in at least one other discipline of tech.",
                "points": "11 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Even with all the skills you mentioned, It's hard to get a job, I have been applying to job for almost a month now, I have a Diploma in IT administration and Networking, 1 year of training from a company in Information security ( Kali, metasploit, OWASP top 10, Compliance, Forensics tools and techniques, etc ) Plus got My CompTIA A+ and Network+ last year, Not to mention countless hours of Practical labs time on TryHackMe. 3 Years of IT support Experience, basically checked all the boxes in Job descriptions, Still can't get any response back. Not sure what I'm doing wrong.",
                "points": "13 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I've been in cybersecurity for 15+ years now, and am having to get some of those \"intro\" certs for work. The prep courses are bad. So much memorization of jargon that isn't well explained in the courses, and really weird attempts at categorizing that combine things like initial access vector, privilege escalation, and payload in ways that dont make sense. (Example, which form of malware requires a user to click on a link? Ransomware). Actual network knowledge (to say nothing of various IDM solutions or enterprise approaches to anything) is almost non existent. You basically come away with the idea that security consists of basic scanning and manual pen testing, and terrorizing workers into never clicking.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I wanna get into cybersecurity and currently learning about TCP/IP and the likes … ! Hoping I can get in there",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The ads that now say if you do this short online course you can earn £70+k as a cyber security expert, used to say you could earn £70+k as a web developer 10 years ago, I'm predicting that before the end of this year we'll see the ads promoting a promised £70+k role in AI prompt engineering.",
            "points": "48 points",
            "children": [
              {
                "comment": "It’s all a bubble?",
                "points": "10 points",
                "children": [
                  {
                    "comment": "always has been",
                    "points": "15 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Everything is a bubble",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Well, the people that got tricked into this should at least go black hat so they can create a need for the fututre generations. Lol",
            "points": "22 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The other students in my cybersecurity program are blowing my mind every week with the amount of shit they don't already know. I have had multiple people messaging me asking for help on labs for the simplest things, like being stuck trying to type their password in the Linux terminal when prompted but their typing won't show up on screen.\n\nOr other extreme baseline things that you can just Google or prompt AI(chatGPT) in 2 seconds. They don't even know simple google-fu. Don't even get me started on basic information and security principles.\n\nThey aspire to work for DoD or state/county departments but don't even know simple IT/computer principles. I don't get it. Meanwhile there are professionals with 10+ YOE with multiple industry certs and bachelors who can't get a job.",
            "points": "44 points",
            "children": [
              {
                "comment": "Same. There were bright people in my classes but also people who couldn't tell a command line from a search bar. Even when I was doing interviews and mock interviews, I'd get feedback like \"wow we've interviewed people with cyber degrees before and they can't show even the most basic knowledge, like name any famous botnet or hack, any tool or strategy to troubleshoot x problem, etc., so you really stand out what with being able to tell us the difference between http and DNS, or explain in even the most vague way how an xss attack works\"",
                "points": "8 points",
                "children": [
                  {
                    "comment": "Yup job interviews are hilarious most people can barely operate their machines but have bachelors degrees in cyber it's baffling.",
                    "points": "7 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Oh I was shocked at how many older people don’t know how to use the command line in my first job, talking about devs with years of experience.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Wow",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Wasn’t everything hot 5 years ago? If anything, I worry about CS graduates, every kid comes out thinking they are gonna retire their parents. Yes, the upper tier ones will get theirs but majority will have a rough time landing a good job.",
            "points": "11 points",
            "children": [
              {
                "comment": "CS graduates are and will continue to do just fine. Your worries should definitely still be with the Cyber Security degrees.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The schools don't care anymore because it keeps enrollment numbers high, and they are now delivering students a false promise that they will be super in-demand.\n\nso, basically every boom industry since the 80s?",
            "points": "20 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I think that having the schools pump out talent only solves part of the issue. Just because there are more potential candidates, it doesn’t mean that they’re quality candidates. Moreover, it doesn’t mean companies will be willing to take chances on these hires. Even if there are enough people to hire to fill every role, the companies are asking for experienced people without wanting to develop that talent",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Just look at this sub. A year ago people asking question about entry into the field used to be experienced pros, now it’s a bunch of people who can’t even ask the right questions. Like we already had bad gate keeping before, now it might as well get ampled up.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I finished my Master in Cybersecurity in 2020. You described my master program. Lot of students were from non-technical background, and during many classroom discussions, I felt like I was one of the few contributing meaningfully.\n\nHaving a technical undergrad and work experience makes a lot of difference.\n\nCybersecurity program was new and evolving at that time. Some of the professors were from Computer Science and other related faculty of the university. But, most of the teachers were not working in Industry. Without working experience It was waste of $$. Perhaps learning programming and Cloud would have yield much much higher compensation.",
            "points": "5 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Tbh we did this ten years ago with Microsoft certified professionals. Dude could take a few tests and easily make 75k a year no college. Then wham market floods",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "rather than entry-level staff who have used Metasploit and basic SOC tools.\n\nOh fuk oh no : (",
            "points": "8 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Many of these schools had good intentions on \"bridging the gap\" of professionals in the industry\n\nMost of these schools had the intentions to get butts in seats.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "😂reading the comment exactly defining my situation 😭 got my masters degree in cybersecurity with 4/4 gpa and certifications. Was not even eligible for most roles and settled for networking role at this point",
            "points": "1 point",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Coming out of the Space Force with just about entry level soc and Metasploit and SEIM experience. Counting on my TS/SCI to get me a job basically.",
            "points": "1 point",
            "children": [
              {
                "comment": "As you rightfully should. That clearance is worth its weight in gold!",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Preach!",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The course I’m taking at my college is the National Security Certification. Right now we’re on intro to Cisco networks and next semester we will be going into Linux and Security I. So far it’s really cool learning about the hardware side and how it all connects on the backend without having to worry about the software side. Currently halfway through the Cisco networking academy modules and I think I need to take 2 more Cisco classes here to be eligible to take the Cisco Certification. This is all new to me and I hope I can find a job in the field later on. My goal is to find work in Japan lol but I’ll see where life takes me. So far I love this and before pursued this, I’m coming from world class paint production and developing for Harley Davidson and PPG and testing and creating new paint codes for Porsche.",
            "points": "1 point",
            "children": [
              {
                "comment": "To be honest with you, landing a cybersec job in Japan is going to be extremely difficult unless your in a country with a great passport. The Japanese usually only employ English teachers on a visa. And with just a degree and some certs I don't think the countries labor laws even allow sponsoring a visa unless they get no local candidates",
                "points": "3 points",
                "children": [
                  {
                    "comment": "Dude absolutely. I visited 3 times and that’s just reality of getting a job as an American in Japan lol. BUT I’m gonna try.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "You are learning stuff that is becoming out of date in the it field, everything is being codefied. People with that interest level at that stuff 15 years ago have already gotten CCIEs and are no making the hiring and firing.",
                "points": "-5 points",
                "children": [
                  {
                    "comment": "You do not learn enough from Cisco Networking Academy to get CCIE. Passing CCIE Lab (8 hours lab when I took it) is not easy. Many people attempt CCIE lab3 - 4 times after many years of experience and lab practice and still fail.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "In June when I visited Japan, I met a professor who teaches at Kyoto university. He teaches CS and is insane at C++. I told him what I wanted to do and where I wanted to work. He told me to do it and try it, so that’s what I’m going to do.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Regarding the foundation in systems and networks…any recommendations on how to learn more? I think I’ve got the networks part down. However I wouldn’t even know what to Google for “systems”.\n\nCould be books, could just be some buzzwords or concepts to search around. Anything that points me in the right direction would be great!",
            "points": "0 points",
            "children": [
              {
                "comment": "For me that foundation came from several years doing IT Help desk roles followed by a few years as a sysadmin. That gave me the foundation to be successful in cyber security and most cyber security program grads don't have that.",
                "points": "9 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "“Systems” in many cases refers to OSes, primarily Windows and Linux. \n\nBut at a larger scale, and I think it is where many cybersecurity resources need to be is a larger understanding of “enterprise systems”. They don’t need to know every configuration item on every product. How do servers connect to each other? How do clients authenticate to services? How do services authenticate to DBs? How to hypervisors connect to storage? What kind of logs should all this stuff generate that are normal operational logs? Can I tell if something is an operation outage or a security related issue? \n\nDFIR teams get quite a few calls on the last one. Client calls up freaking out that they are under attack. Turns out their DNS server was down, or their root CRL expired. \n\nWhen under the umbrella of “enterprise systems” the only real way to learn that is deploying, maintaining, and repairing them.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Get some hardware that can run a hypervisor (I like Proxmox, free and fairly simple to install and get going) and set up some VMs that run services. Can be a web server, docker, reverse proxy, Active Directory, etc. r/homelab and r/selfhosted would be good resources to start learning \"systems\" stuff at home.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I'd recommend to start looking into a CCNA. Maybe not getting one, it depends on how much you want to go into the field but what the exam covers is a good starting point. The textbooks and lectures will cover the basics of networks and how it works from IP to the 7 layers. Just know that it's got a heavy Cisco-angle because, well it's a Cisco exam. A random example would be like how it covers RADIUS (the open standard) vs TACACS+ (cisco's own standard).\n\nThing is, imo you gotta treat it like a trade. You need to get your hands dirty instead of just reading. So you need to actually start screwing with stuff. So in addition to what everyone else here has written, read some labs on how to build networks in Packet Tracer, or GNS3 (or free-er alternatives, can't remember any rn sorry).",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "All of the interns that we interviewed used Tenable or Metasploit, but could not explain what NAT is or what is the difference between a switch or a router.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "A year ago you would get downvoted and called a gatekeeper in this sub for saying this.",
            "points": "0 points",
            "children": [
              {
                "comment": "You think that might have to do with the demographics on the sub, and what they want to hear?\n\nThe demographics of jobseekers in a cybersecurity sub is obviously correlated to the market trends, but with quite a bit of lag.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Sometimes people don't see the truth until it smacks them in the face, or in this case, doesn't call them back after applying.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I believe part of the problem is the deluge of unqualified people scrambling to get in to cybersecurity. It has given organizations pause. They are tired of weeding through 500 applications to find the 2 or 3 that actually have the qualifications. Until that stops or slows down, don't expect the market to change.\n\nThe other piece is companies trimming the fat. They overhired technology resources during the pandemic and are paying for it now. Look at all the layoffs still happening in the industry.\n\nThen you have the companies who think AI will replace all of us and are either investing in that or waiting on the sidelines to see what unfolds.\n\nI don't see anything changing until at least 2025.",
        "points": "132 points",
        "children": [
          {
            "comment": "I applied to a senior Security Architect role in Dec last year during the initial wave of tech layoffs.\n\nI eventually made it higher in the hiring process and spoke to the CISO before dropping out - they all said it was awful wading through all the candidates with CISSPs, Masters of Cybersecurity and puffed up resumes that actually had little practical experience in the domains they were hiring for.",
            "points": "35 points",
            "children": [
              {
                "comment": "That doesn't make sense, if you have a CISSP you have five years of experience.",
                "points": "27 points",
                "children": [
                  {
                    "comment": "Correction, you are supposed to have at least 5 credible years of experience but that is nothing but a game. Just look at all the college grads with a CISSP cert.",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "wait, is faking experience to get your CISSP really a thing? Don't you need a sponsor who has a CISSP as well to vouch for you?\n\nOr are you talking about the Associates in (ISC)2",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "yeah, it happens. A while ago, there weren't many of them so it was harder. In 2010, there were only like 35k CISSP holders. There are over 160k now. As the pool dilutes, it's easier to find someone to vouch for you.",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Some people have exactly 5-6 years experience doing the same mundane narrow things day-in and day-out that cross off one of those 5 domains the CISSP asks for. They basically have 1 year of experience X 5.\n\nEdit:\n\nHere’s an anecdote to illustrate this: at a former org, we acquired a smaller company and were in the process of integrating their Security staff. One guy was acting as their PIM administrator and did help desk level 2/3.\n\nCool, let talk and see if he has experience with tuning role based access controls and wrestling away Global Admin away? Or did he have exposure to Access Reviews or exploring PIM for groups? Or did he work towards standardizing roles for user, or exploring PAM options? Have you documented the process or how would you change it if you could? Nope. After talking to him, he only did the work he was assigned and assigned roles to users and applications carte blanche after getting manager approval. We passed on bringing him on as a security engineer",
                    "points": "17 points",
                    "children": [
                      {
                        "comment": "5 years pushing the button vs 1 year designing and engineering the button. People overindex on raw time spent on something instead of the actual value output",
                        "points": "16 points",
                        "children": [
                          {
                            "comment": "You’re not wrong. If you can get past the BS hr filter that’d screen you out and be able to convey the value you brought over that one year on interviews that’d be your best bet",
                            "points": "6 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "Man this is a great way to articulate the impossibility of gauging cyber talent and know how. Do we just suck ass as an industry? Feels like we do.",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "5-6 years experience doing the same mundane narrow things\n\nbasically our new 'CyberSecurity Consultant' that literally has no technical skills",
                        "points": "4 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Could be they have their Associate of ISC2 thing, and they just say they have their CISSP on the resume... Wouldn't be surprised if that happens.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "And here I am, the opposite, with over a decade of experience in systems and network engineering with a shake of sec compliance but no certs because I worked my way up and I can’t  get a call back lol.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "get some certs, play the game ya dingus",
                    "points": "30 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "If you can tell good stories during an interview (using the STAR method) and get your resume reviewed, you might get some traction.\n\nDM me if you want a friendly review",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "Hello. It appears as though you are requesting someone to DM you, or asking if you can DM someone. Please consider just asking/answering questions in the public forum so that other people can find the information if they ever search and find this thread.\n\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
                        "points": "-6 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "What would really be the bar between fodder and \"skilled\" professional? u/computerchipsanddip",
            "points": "4 points",
            "children": [
              {
                "comment": "It's subjective but I mean I don't want to see someone with 8 certifications behind their name who has 0 experience.\n\nOr the person who worked as a high school English teacher for 15 years and then wants to pivot in to cybersecurity because he heard on the TV it was cool.\n\nYou need to have a technical background of some sort. A history of excelling in that kind of work. A few years technical experience is a start, some certs help, a relevant degree helps. All 3 would make you stand out for sure.",
                "points": "31 points",
                "children": [
                  {
                    "comment": "I'm an IT director of about 20 years started in technical positions non cyber related but looking to make a focus in cyber specifically.\n\nStudying for cissp now but curious what you think I could slide into? Got about 12 years o365 and defender suite and my goals are always that of digital modernization and removing physical infrastructure.\n\nI have experience with grc and compliance such as iso and nist to name a couple. Grc seemed like the most logical lateral move but then I also like being technical as well. I know some grc roles combine this. Also fine to continue in management as well.\n\nAny and all thoughts are welcome",
                    "points": "7 points",
                    "children": [
                      {
                        "comment": "You're a Director, why would you want to bother to move at all?",
                        "points": "19 points",
                        "children": [
                          {
                            "comment": "couple things in short\n\n1) I have not been able to find new work since I was let go during a round of financial lay offs back in July of 2023 ( unemployed )\n\n2) I am a bit of a generalist in the Director field and everyone wants specialists now\n\n3) Market is just trash right now and finding this position and even IT manager positions has proved extremely difficult\n\n4) The interviews I have had end up with 2000 applicants ( of course much less past the HR stage ) but the competition is nuts right now with everyone in the space being laid off\n\n5) I would love to transition to a more cyber focus and if i can do that as an IT security manager and work back to director thats fine with me, but I def thing the CISSP and or other certs will help fill in some of the generalist knowledge\n\n6) finally, GRC was an idea since a lot of my experience is in that now and obviously cyber and cyber management have several areas, GRC, Engineering, etc. I am just trying to find my place again.\n\n​\n\nHope that answers some of your question :)",
                            "points": "8 points",
                            "children": [
                              {
                                "comment": "Second the CISO vote. You'd just have to get a GRC job to get on the right track, then work back up to a leadership position. With your track record it shouldn't take that long. You're already working on the CISSP, that's great. The only other thing you'd need is maybe one of the ISACA certs like CISM or CRISC. The industries that absolutely need GRC people are defense, finance, and healthcare so any large organizations in those industries would be ones to target at the experience level.",
                                "points": "1 point",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "You’d make a good CISO with some more experience",
                        "points": "3 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I graduate in 26’ 😎😎😎",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I think that the \"education industrial complex\" has flooded the market. It'll take a long time to weed out the paper tigers.",
        "points": "75 points",
        "children": [
          {
            "comment": "Having a college degree does not make anyone a paper tiger - no one expects college graduates to do anything but entry level work in their given fields\n\nIt's the cert chasers who go for a dozen+ unrelated certifications and have ZERO experience doing anything and the Industry is to blame for allowing https://pauljerimy.com/security-certification-roadmap/ this many certifications to proliferate",
            "points": "52 points",
            "children": [
              {
                "comment": "I suspect much of it's due to teaching certs is a huge business. Along with colleges getting federal money early on to teach half ass courses. I'd be happy with a federal contract to teach $ecurity+ forever though.",
                "points": "22 points",
                "children": [
                  {
                    "comment": "I suspect much of it's due to teaching certs is a huge business.\n\nYea, as long as my employer pays the $5k, I'll goto a week long CISSP/ISSAP/CCSP camp. On my own dime? No fucking way.\n\nI've toyed with idea of starting a training school even.",
                    "points": "11 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I have learned way more studying for certs than I did from a bachelors and masters. I don’t know why people hate on certs, especially with the ridiculous argument of “bro don’t get certs, get experience” when 1. You can get certs while having a job and 2. Most of the time people are getting certs so they can get a job.\n\nI’d take someone with an OSCP and a CISSP and no degree over someone with a bachelors and no certs any day of the week. I’ve interviewed so many people with degrees that don’t even know the most basic things.",
                "points": "22 points",
                "children": [
                  {
                    "comment": "saying there are too many certs isn't hating on certs\n\nThere are simply only a handful that have any relevance whatsoever\n\nAnd of course you're picking two of the harder ones to obtain - that's why they mean something\n\nYou have to admit though the stuff coming on coursera, coming from google and even the ISC2 CC is nothing more than junk/fluff material",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "Hey now..... I feel slightly attacked there 😂",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I'm not suggesting that everyone with a degree is a paper tiger. However the 'gold rush' mentality has resulted in an increase in unqualified graduates IMO.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I am a cybersecurity mentor. I have been telling my junior analysts and apprentices this for years. Do not get a cert unless you are proficient in that area. Certs are for qualifying you to say you can do a job.\n\nI took 1 SANS class outside of my wheelhouse once and it was fucking HARD. It’s so much easier when you halfway know the material.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "What was the SANS class you took?",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Oh no you done started using fighting words. A lot of these degree programs don’t help. They promise working experience and then just piggy back off legitimate certs.\n\nDon’t blame the cert chasers when it’s actually working. Well enough that many educational institutions integrate certificates into part of their programs.\n\nYes there are many out there, but that’s what we need. We need competition. Look at OSCP and JNPT for example.\n\nYou don’t want it to turn into what it was years ago, where CompTIA and ISC basically cornered the market.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "Quality of curriculum for a given major is a different issue, but that's why there are national rankings for schools, their different departments, majors and even professors\n\nNow if you want to specifically focus on \"Cyber\" as a major - I agree that 99% of those are fucking junk because they were thrown together post 2001 to take advantage of federal funding which turned the NSA Center of Excellance program into a joke\n\nThat program originated in the 90s and focused on graduate programs and schools that were doing cutting edge research in cryptography and information security\n\nsame as the schools promoting intelligence studies and homeland security as a major - 99% of them are TURDS",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "u/DeezSaltyNuts69\n\n\"NSA Center of Excellance\"\n\nMy college was one of 50 NSA Center of Excellance when I graduated. It was turds.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "My father has been in cyber for 25 years, built entire security systems for some of the biggest names in the world but would get passed over on promotions for people with degrees and has been told it is because he did not hold a degree.\n\nYou can be the smartest person in the world but sometimes that paper matters.",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "If I register a company name, buy the Nessor software, knock on government agencies and ask if I can do a free SOC analyst, can I write it off as full time work experience",
            "points": "-3 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Once the Fed starts cutting interest rates, confidence will increase and businesses will be more willing to borrow/spend money to grow.",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The problem is a bunch of IT folks flooded the market and have no clue what they are doing. Anyone who is actually a cybersecurity professional is working and getting multiple offers for good money lol!",
        "points": "48 points",
        "children": [
          {
            "comment": "I’m graduating from college this year with six years IT experience and a couple years of SOC and detection engineering experience from co-ops and I’m struggling job hunting.",
            "points": "30 points",
            "children": [
              {
                "comment": "Posts like this are so wild to me, I had one year of IT experience, a master's degree, and no certs. Got a sec analyst job after a month of looking. I must've got lucky.",
                "points": "15 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "The job situation is all some bs really, I look at LinkedIn and there many grads without experience doing jobs with cool titles like cyber defence engineering associate at well known companies.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Network. Use the school for contacts and reach out to managers not recruiters.",
                "points": "9 points",
                "children": [
                  {
                    "comment": "Yeah I mean that’s how I have the one offer I have. Was hoping for a few more choices but it is what it is.",
                    "points": "8 points",
                    "children": [
                      {
                        "comment": "Find more. Like OWASP, ISC2, Your local FBI probably does some InfraGard stuff. Don't be shy, stand up and say \"Hey my name is icefisher225 and I am looking for cyber opportunities so please if you know anyone looking my LinkedIn is open.\" or whatever.\n\nYou have LinkedIn premium right? The only reason to have linkedin at all is for job hunting.\n\nBE ACTIVE!! I can't tell you how many people come to me crying they cant find anything and when I ask them what they are doing I get a blank stare hahahahahah!!",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "I don’t have LinkedIn premium. I don’t really understand why I’d need it.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "It seems that it will put your profile to the top of lists when recruiters are looking to fill a role. Additionally it allows you to message ANYONE",
                                "points": "3 points",
                                "children": [
                                  {
                                    "comment": "Should I be messaging people that went to my college and might be hiring? It feels really weird and awkward to do that…",
                                    "points": "0 points",
                                    "children": [
                                      {
                                        "comment": "I don't have li premium anymore. But when I did I just searched recruiter and messaged as many as I could. But tbh it didn't do much. Networking with other college peers is not a bad idea. Personally most of my jobs I got with a traditional application and interview. Networking only worked for me one time and that's when my wife, bless her ignorant little heart, told her boss I was an IT expert when in reality I had only done a little break fix stuff at a small shop. That snowballed into a CIO role where I was very lost and had no idea what I was doing",
                                        "points": "3 points",
                                        "children": [
                                          {
                                            "comment": "This is the way.",
                                            "points": "-1 points",
                                            "children": [
                                              {
                                                "comment": "",
                                                "points": "",
                                                "children": [],
                                                "isDeleted": false
                                              }
                                            ],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      },
                                      {
                                        "comment": "",
                                        "points": "",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Sounds like me! Just add a security clearance and military experience.\n\nBut part of it is self inflicted tbh",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Because you're competing with other graduates who studied computer science and have the baseline skillset that modern security requires. There are computer science graduates from UC Berkeley with no full time work experience with maybe 1-2 internships at big tech companies that will walk into entry level security engineer roles come this summer\n\ndetection engineering\n\nWhen you use the word \"engineering\" here, did you actually push code? Or did you just use a tool? If you did the former that's engineering, but the latter isn't",
                "points": "-3 points",
                "children": [
                  {
                    "comment": "I pushed code. Python for automation of false positive alerts via n8n and a bunch of code in Splunk and other SIEMs for new alerts/tuning. We had a full Azure DevOps CI/CD pipeline I was using.\n\nFor what it’s worth, I’m graduating from RIT with a degree in cybersecurity plus two minors.",
                    "points": "6 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "IT folks flooded the market and have no clue what they are doing\n\nI'm one of these people, but it felt like a natural transition to me. I started getting tasked with focusing on security at work over the past year and enjoyed setting up solutions for our SMB. The new year came around and decided to test the market and see how I'd interview. I was shocked when I landed an offer as a remote Cybersecurity Engineer for a big company making the most money I've ever made. Starting in two weeks.\n\nI might not know exactly what I'm doing when I start, but I'm damn sure gonna take the opportunity to learn the ins and outs of my role.",
            "points": "7 points",
            "children": [
              {
                "comment": "congrats man. i just started a security role in an enterprise after working IT for an SMB. be prepared for your first week to be intimidating as hell and feel like you dont know anything but ime if you rely on your team and ask questions if theres something you dont know, youll start to ease into it quick.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Thanks! 100% feeling the imposter syndrome already, but I'm up for the challenge. Congrats to you as well!",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Welcome to the tribe!",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Thanks!",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "[deleted]",
            "points": "2 points",
            "children": [
              {
                "comment": "u/AcrobaticWatercress7\n\nWhat it takes to be in Security is different than even 7-8 years ago. First CISO I worked with was a compliance assurance guy, with zero technical knowledge. Second was server administrator and rose to CISO. Both of them BS their way to be CISO. Such skillset are now only useful in small subset of GRC (Risk, Compliance). Unless the book is technical, if it is about any other facet of security, that knowledge is getting dated or not deep enough.\n\nI moved to security side in a healthcare, developing security program (engineering, operation) 7 years ago. Before moving, I managed all infrastructures - back then all our servers/systems/network equipments were in our datacenter. Healthcare is risk averse and we have almost all of our system in our datacenter now. I felt like I am dinosaur in 7 years without working cloud and automation knowledge,",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "What region and what certifications?",
                "points": "1 point",
                "children": [
                  {
                    "comment": "US and I don’t know if he has certs just 25 years of experience of being a senior security engineer with some of the top names in the world.\n\nEdit: I suppose my initial comment is untrue as he could 100% get a a security engineer role again but isn’t applying to those, and is only looking at management/ CTO etc.\n\nSo I suppose disregard comment. They just can’t find jobs that pay them as much as they want.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Because \"the fucking books\" 20 years ago aren't relevant today. There are senior level security people today - look at the FAANG CISOs or people like Jason Chan (ex-Netflix CISO and what I would call the father of modern, born-out-of-Silicon-Vally-tech, security engineering)\n\nIf that senior level sec guy is still staying stupid shit like \"using the cloud is using someone else's computer\" then they're not the labor industry demands\n\nThere are security practitioners today in their late 20s or early 30s earning $1M W2. If the guy you know can't get these jobs, all it means is he's not competitive with the new crop of talent",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Just been speaking with a recruiter contact and he's saying that January has been crazy for him for mid-level roles, all picking up which he was surprised about (London, UK)",
        "points": "14 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This sub is depressing.",
        "points": "5 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Focus on learning sysadmin or networking skills. Cybersecurity is transitioning to either technical know-how or GRC. Unless you are gonna work IR for an MSP or are trying to get something like an internship, the dime a dozen Sec+ w/ no IT experience opportunities are going to continue to dwindle. There's a huge need for engineers, not as much for analysts. It stinks, but the best bet is to make yourself a clear standout asset.",
        "points": "16 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Until regulators stack another onerous requirement on business and everyone has until the second tuesday of next week to hire a cybersecurity guy to check a box on a spreadsheet or be out of compliance.\n\nAs soon as the A needs to be C'd they call the CYA guys. That simple.",
        "points": "19 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why you're seeing layoffs?\n\nQuite a few things out of your control if you're trying to get into an internal company. First, we just finished CY23 and are now into CY24. Those who have their FY fall on the Calendar year and finishing up their books and most likely are making changes that adjust for the 10% revenue increase that most publicly traded companies will be predicted to hit. At this point, they are shoring up revenue for cost centers and revenue generators.\n\nThe other is if the company's FY falls in line with tax season, it is probably in Q4. So they are in the opposite, where they are scrambling to figure out what can be cut in order to balance the books to either have a solid earning call, or if it is underperforming, lighten the blow.\n\nAt the end of the day, the Officers, C-Suite, and Board of a company ultimately make their generational wealth off the stocks they own in the company...not their salaries\n\nI put that there because everyone needs to remember it. Even if you're in privately held practices, someone holds the reigns to the wallet and is expecting to increase their cash flow based on their investment. So changes will come down hard.\n\nWhy is it hard to land interviews?\n\nAs stated in the above, you now have a candidate pool that has Academic Graduates + Transitioning Employees with experience X Cybersecurity Employees with Experience.\n\nWith the market getting tighter, as evident with layoffs alone, that dwindles many echelon technical positions. So what was once a Principal before Jim left is now a Senior when the req is posted. The candidate pool is now over saturated with at least 2 sets of people in the equation above who are looking to fill the role. Another distinct level of graduates will attempt it. Talent and acquisition will use AI and the other scanning mechanics to dwindle the list to 10-15. Those 10-15 go to Hiring Manager who then select the 5-8. That gets dwindled to the 3-5 that will start the interview process. That will go down to 1-2. And from there the offer based on the interview scores and hiring manager approval.\n\nWhen Will It End?\n\nWe are in a field that has high attrition due to burn out, poor work/life balance, and just overall mental health struggles. I personally believe many of these companies have no intention in filling any of these roles at the present time. They are posting Ghost Positions in the hopes of compiling a pool of candidates for if they get headcount, or someone leaves the company and it impacts work production.\n\nAgain, everything that happens in a company is dictated by the market. C-Suite and Board have the responsibilities to their shareholders, of which most of them make up the overwhelming majority of the held stock. Not many C-Suites come with a cybersecurity background. Heck the degree didn't even exist until very recently when you look at how long formal academics have been around. That means their ultimate question every year at the end of the year is: \"Did we get breached? No? Then why do you more headcount or revenue for products that we already have?\" Is that overgeneralized? Probably a little. But I've sat on calls where CFO's post-breach were all about EDR and MDR solutions, until Year 3 when the question was \"Well...what are we really getting out of this? Nothing has happened since.\"\n\nDon't be shocked when you're hearing murmurs from your peers in the industry saying that their company is remaining flat this year. If anything, you'll see attrition through being pushed out vs. them quitting to free up cash flow as they try to keep the stronger personnel. Which will have a dual negative effect (it always does) because now the stronger personnel are working even harder and then burnout kicks in and they leave.\n\nFrom that point...look at the above paragraphs about why you're seeing layoffs and why it is hard to get an interview. Thus, the cycle.",
        "points": "14 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Slow isn’t even the word. It is all messed up. Most of IT needs help with more staff, especially cyber, but companies no longer want to on the job train people. If this trend continues, companies in the US will be in big trouble as the veterans age out and there are not enough young people with knowledge to replace them. It will be funny since there will be theories as to why this happened and I am sure none will be true. Companies are trying to cut corners and still don’t understand that IT is not a Cost Center. It is critical infrastructure and the most important department within the organization. Without IT your company is nowhere. It just won’t function because 99% of things are automated or require computers in some way.\n\nAs for how long will this last…hard to know. I am not sold on AI because it is trained with biased data which only gets biased results. It also means that technically it is vulnerable. Slip in malicious data of some type to create a time bomb with its functioning or some strange data back door and you could have a world of trouble. I predict another 6-12 months of this silliness of mass layoffs.m before they realize they screwed up again and need to do large hiring.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In the UK at least these last couple of weeks things have really eased up and more adverts are up. I suspect will get better In April.\n\nMiddle of year should be normalish I suspect",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What is your evidence that it has slowed down?",
        "points": "6 points",
        "children": [
          {
            "comment": "LinkedIn. It’s a hellscape out there for folks in all tiers of experience.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I think people need to get real and understand a degree and A+ isn't going to land you a job in CS.",
        "points": "2 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It’s hell if you’re new, but hotter than ever if you have experience. Have never had so many folks reaching out. The tech field like many industries is a living breathing cyclical thing. Keep grinding",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m abit of a poster child myself, I managed to land a help desk job directly out of college. Got on all of the various IT directors good side with my interest in every field. After speed running a few projects it only took 9 months from my start date to become an engineer and 4 months after that I was being trained along side the infosec team. All it takes is really drive and the right connections, I talk to strangers, goto cyber security conferences. Just about anything to increase my network. I don’t have a bachelors or any certs and I’m at a 6 figure salary because of my resume, 2 associate degrees and 5+ years experience. I’m only 25 currently but I’ve been working only in IT my entire life, never had any other kinda job aside from overnight warehouse work for Dell. Keep trying man and never give up, you will land something just start somewhere and crawl until you can run.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Join blind app and search for the answer there. This question is posted at least once a day.",
        "points": "14 points",
        "children": [
          {
            "comment": "My turn tomorrow btw",
            "points": "24 points",
            "children": [
              {
                "comment": "I call Friday",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The typical unhelpful answer I expected from a fellow Cybersec professional. I know it's off point, but is it just me or is the industry saturated with the most unhelpful people.\n\nDon't know, maybe just me...Or perhaps just US based CS ppl.",
            "points": "36 points",
            "children": [
              {
                "comment": "Asia here, IT people are the most arrogant among my friends",
                "points": "30 points",
                "children": [
                  {
                    "comment": "Thanks, I'm glad it's not just me, thought I was going senile...\n\nThe industry really needs to change it's attitude.\n\nWe're assholes.",
                    "points": "17 points",
                    "children": [
                      {
                        "comment": "The ones with a good attitude are SEs lol! I guess the money is too good to be negative",
                        "points": "7 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I think some people have their identity wrapped around being the \"IT guy\" and the influx of normies entering the field is frightening to them",
                "points": "5 points",
                "children": [
                  {
                    "comment": "I'm not saying that sometimes it's not justified or that they've no reasons to say/do that. I just find it so cringe when they do.\n\nI've been in IT for a few years (perhaps short) but not in my wildest dreams would I ever not answer a question and instead just say \"Google it\". \n\nIt's belittling and unhelpful.",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "Oh I 100% agree with you. It is really unpleasant behavior and I hope cybersecurity is not actually manned with too many people like this. Would prefer to work alongside a smart and pleasant normie any day",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Gotta remember the bulk of this reddit is career middle managers and people trying to break into the industry. The cysec folks with some humility are the ones in the trenches actually dealing with the issues the industry faces, not these bozos who haven't touched a SIEM dashboard in over a decade trying to dictate to you how useless you are (and that's why you should accept shit money).",
                "points": "7 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "When you grow up being given links to this when posting on a forum, you get tired of seeing the same things and hope other people do some basic research before posting a blanket question:\n\nhttp://www.catb.org/~esr/faqs/smart-questions.html\n\nhttps://blog.codinghorror.com/dont-ask-us-questions-well-just-ignore-you/\n\nThere are better forms/versions of this these days, admittedly:\n\nhttps://www.lesswrong.com/posts/YHRyt3NWHp4z3EAFW/asking-for-help\n\nThe reality is, our brain space, time, effort, are all limited by our corporate overlords and at the end of the day people want to relax. So if we see people putting in minimal effort just to ask for insight on something that can easily be googled, queried or poked at with AI (future state) -- why bother?",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Then just don't respond to a reddit post if your time is too precious. Sick of \"just Google it\" or \"this has been asked before\" in no other industry do you get that.\n\nI made a post here once and got one fella to respond to a genuine query I had. \n\nThen on another post you get 10 people saying just Google it or that x has been asked before. It's like these people get off at telling people that someone ought to spend more time doing research.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "The gentle (and not so gentle) suggestion to do a bit of research first is a kind of training. If you're the junior who keeps asking the same question like a four year old, you're going to get frozen out by the seniors, which will prevent you from progressing in your career.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "I mean read the sidebar, it spells out what is to be expected when posting. Do people do the same things when they're in school in a classroom? Do we do the same thing in a workplace? Unless someone genuinely doesn't know, maybe. I was merely providing context as to why someone may see, or receive those types of responses.\n\nThen on another post you get 10 people saying just Google it or that x has been asked before. It's like these people get off at telling people that someone ought to spend more time doing research.\n\nThis boils down to, at least when it comes to Reddit, poor moderation/management. You could easily create a bot that replies or sees common threads and comments with previous threads from the previous week/month/quarter/year if the same subject has come up multiple times. on other sites, users are very particular about this because sometimes, a topic may not gain much traction. A few weeks later? A lot more engagement because it is pertinent, upvotes, eyeballs/timing, whatever it may be.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Please back up ur data with stats. I'm tired of hearing this doom and gloom nonsense. We are on a downward trajectory compared to the last few years but 2020-2021 was an unprecedented year for tech. Idk if we ever see growth like that again\n\nWith that said, I got into the field in 2021. Since then I've gotten a job offer every time I've tried to look for a new job and I've never had a job offer for under 6 figures. Things aren't nearly as bad as ppl make it out to be IMO",
        "points": "10 points",
        "children": [
          {
            "comment": "People don't wanna hear it, but you speak the truth. Judging from the dudes post history his geographical location is HEAVILY influencing his experience.",
            "points": "10 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Been around since the 90’s. I don’t see this downward trend continuing. It’ll pick up, economy and spending are cyclical. Enjoy the break.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "With two decades in IT, I've experienced several layoffs during economic contractions and expansions. Currently, jobs are scarce as high interest rates are used to temper a heated economy. However, as interest rates are forecast to decrease, job opportunities should start to increase.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Do you have CISSP or CRISC? If you have either of those or both, you should be able to find a cybersecurity job easily.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m trying to get into cyber after my employer hired his grandson with no IT experience. Seems like he’s slowly being groomed to do my job. I hope by the time I get my cyber certs I can land something better.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "https://www.csoonline.com/article/657598/cybersecurity-workforce-shortage-reaches-4-million-despite-significant-recruitment-drive.html\n\n​Two-thirds of organizations lack staff needed to prevent, troubleshoot security issues Two-thirds (67%) of the 14,865 cybersecurity professionals surveyed reported that their organization has a shortage of cybersecurity staff needed to prevent and troubleshoot security issues. Cost-saving cutbacks such as budget cuts, layoffs, and hiring/promotions freezes are playing a fundamental role, the report found.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Cyber schools are pumping out guys who can recite the NIsT pubs by heart but can’t use it sensibly. Freshers and middies need to use the NIST as ref not as ‘tho shalt’.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "feels like we are at the limit of new tools and processes and the market is turning to reviewing and optomizing cyber spend. until the next big attack that requires additional regulations we probably peaked a few years ago.\n\nI think you'll see more legacy technology replaced with newer, sort of like AV to EDR in the past. that's probably were hiring will be.\n\nzero trust, data lake, and AI are still growth areas. probably IAM and GRC as well as so few companies get that right.",
        "points": "3 points",
        "children": [
          {
            "comment": "I joke about this at work all the time. I work in finserve at an F100. Our perimeter is stacked. Nothing gets past it, even legit traffic sometimes.\n\nI often joke that threat actors need to step their game up. We need another ransomware. My manager is not scared enough to throw cash in my direction. Scare my Director. Catch them off guard. I’m trying to level up. Lol",
            "points": "2 points",
            "children": [
              {
                "comment": "we are almost there - going the local firewall route and then starting to really dig in and get more value out of what we have.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The current demand is high but the \"ideal candidate profile\" (stealing this from ideal customer profile) is different. Everyone else is playing catch up to Silicon Valley tech style security engineering pioneered and made popular by Netflix over a decade ago.\n\nToday if you're a security engineer with a solid software engineering / computer science foundation, you're in very very high demand.\n\nToday if you're a security engineer with a solid software engineering / computer science foundation that also has solid undergrad math knowledge to include linear algebra, number theory, statistics (Bayesian), and quantum mechanics you're in very very very high demand\n\nThe signal that most of the people in this sub are behind the times is the incessant pushing back against basic coding skills\n\nI've noticed that increasingly non-tech companies who 5 years ago would be ok hiring non-technical \"cybersecurity\" people from Big 4 audit or legacy defense contractors now want to hire Bay Area style security engineers instead",
        "points": "1 point",
        "children": [
          {
            "comment": "u/TreatedBest,\n\nI have not coded for 15 years, so coding skill is rusty. Work in healthcare for a decade now where we keep all our data in-house - very few things such as IT tools are hosted outside. IT (including security) is considered an ancillary service, so pay is peanuts.\n\nI am looking to either Tech company or Big4 (have worked with small consulting firm before).\n\nI have not worked with Big4. What is wrong working there in a security consulting role?\nWhat kind of coding do you do? What kind of coding and cloud do you suggest to learn? Can you please give me specific example.\n\nThanks",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It will probably get slower and there will be less demand going forward. There are way too many people VS opportunities. Companies are more selective since there is a large pool of candidates.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don’t think market is that bad for IT/CS/Cyber roles. Of course it’s not as good as it was few years ago but that is a trend among all industries. Fresh Cyber graduates find it extremely hard to get jobs unless they’re in top 20%, that is due to experience requirements. If you’re only looking for remote/hybrid jobs in Cybersecurity, that is not gonna work out for majority of people. Cybersecurity professionals with 3+ years of experience and certifications are still in relatively high demand, of course that may vary based on geography.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Who remembers help desk and deskside support 20 years ago? Those used to be good jobs because it was a relatively niche skill to understand how computers worked. More education and certifications brought more qualified labor into the workforce though, automation removed repetitive tasks, and service providers consolidated efforts while reducing opex for businesses, so it eventually became an entry-level position.\n\nThis is what's happening to cybersecurity now.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Slump will get worse especially when large language models get even more parameters and more relevant abilities. Why would say a security operations center need 5 guys manning it when they can have 2 guys on call making sure the AI is on task so some humans still in the loop but not nearly as much now. Eventually SOCs will have software constantly monitoring for indicators of compromise by extracting features in the noise things we know ML is good at. That's just one sub field in cybersecurity but their all going to get their lunch ate by AI.\n\nWriting on the walls that's why infosec is becoming a clown show now. Blue Collar is the new wave not White Collar anymore. Unionized doormen in these big cities like Austin and LA make almost 85k annually and you get better job security. You don't get laid off almost every other year because silicon valley is moving fast and breaking things \"changing their vision\" or whatever the latest dumb buzzword is now.\n\nYou might take a slight pay loss but I rather make high 5 figures with a benefits package that's as good as some of these tech startups and have low amounts of job responsibility. You literally just have to open doors and accept packages for people but people rather work hard then smart. Some are just stuck in a stockholm syndrome relationship with their employer.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The current 'slunp' is just a normalization from the excesses of low interest rates.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well… plan A had this problem… plan B… is cybersecurity. You’re fucking kidding me. I hate being my age in this cursed economy where CSC is get the fuck out, and give me 1000’s of dollars so you can cry about being 40k in debt with no real assets to show. The American economy can quite frankly go fuck itself at this point, we live in the dystopian novels I read as a kid. Period, full stop.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Your not gonna get a job unless you have a Masters, A few intermediate/advanced certs, and experience.\n\nI was in cyber two years, no degree, and a few basic and one intermediate cert.\n\nNo chance in hell i will ever land a job without a degree to get passed the HR filter.\n\nI went to back to physical security. I make more money, no stress, i can have a life again, if i want more money i picl up am extra shift. PLENTY of job openings.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You're gonna get a lot of hearsay and luddite answers here. Ultimately, it boils down to US federal regs changing foundational qualifications and the advent of AI.\n\nEarly cloud services brought up the looming disruption about a decade ago, and security pros turned up their noses at the idea.\n\nWell, now we have: New regs, AI, and Cloud converging on the old guard all at once.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Slightly different for me.\n\nI can't really get into Cyber positions: I have CISSP and a BS in CyberS. With minimal experience in actual Cyber experience beyond Palo Alto configurations/Cisco ASA configs. (Just recently got extensive experience with ELK).\n\nBut I get a ton of offers for stuff like Sr. Networking Engineering, Network Admin roles and I only have a CCNA (but I do have 6 years as a Network Admin) sometimes CND or CNO Analyst pops in there.\n\nSo for tech... I think Cyber specifically is oversaturated, (but I don't necessarily have the exp to back it up) but for Networking I think it's the same.\n\nI have some Cyber positions that I've been offered... I mean actual and good offers (but declined due to timeline issues) and it was only because of who I know - not because of my credentials.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think something that the vets who are complaining about the unwashed masses of new grads seem to forget, is that there are also plenty of people with all the experience and YOE on paper but simply don't have the 'talent' for the job.\n\nI don't know exactly how to define that talent, but I've seen plenty of people who should know what they're doing skip over basic competency stuff. It's incredibly easy to coast on the fact that most issues as an analyst end up being false positive, or are automatically mitigated.\n\nEdit: Not to discount the fact that the 'education industrial complex,' is a total racket built on empty promises.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As a student enrolled in an online C/S course (compressed 2 yr into 11months) I’m blessed to have a 100 hr internship which will help me in my career change. LinkedIn posts a lot of positions, and yes, lots of mid-senior levels, but they’re entry level posts also. I strongly believe that we (as in entry level) should start applying (or gain information) about school boards and hospital opportunities. They need the most help. That’s the first place that I’m checking out. Take Care 👍🇨🇦",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Computer Science fields are not the route to go at this point. Market analysis suggests skilled tradesmen will be making more money than anyone else within a decade. Almost the entirety of the current professional development is geared toward computer/remote based education. Trades are trending towards complete inability to staff. AI will kick many of the people to the curb who jumped on the CS bandwagon. While trades will be too difficult for those sedentary individuals to start in their 40s.\n\nTrust me, fuck CS and go learn a trade.",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Interesting thread",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "no jobs, AI tools doing everything soon. no human needed, its all a lie! everyone will be removed soon!",
        "points": "-6 points",
        "children": [
          {
            "comment": "Kindly GTFO with this nonsense\n\ngo post elsewhere",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It is a very complex problem. More candidates will make it harder to get entry level jobs. Moreover, it did nothing about helping develop that talent. Furthermore, it doesn’t solve the issue of companies wanting to hire extremely skilled people for mid level jobs, without providing pathways to get there",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Budget tightening will likely continue through at least the rest of the year. I finally got the green light to open some offensive AppSec roles for my team, but my approved budget for them was half of my proposal. This essentially forces them to be offshore rather then domestic, which only adds to the drying up of the market.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's cause cybersecurity is the new wave for bootcamps, colleges and people looking to get into tech. Many people don't do extended research and get sold the dream of a six-figure job right out of college or said bootcamps. Same thing happened with mechanical engineering in the late 2000s/early 2010s. Same thing happened/is happening with computer science right now, where people are looking to get into software engineering, and now it's cybersecurity.\n\nMost of the certifications that the industry relies on like Security+ aren't enough to gauge candidates of their true ability. People graduate with zero internships in IT or extracurricular experiences and all have similar degrees and certifications. At that point, it's hard for companies to filter through the pile I imagine.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's difficult to predict how long the current slump in employment will last, as various factors can influence the job market. However, considering the cyclical nature of the economy and the fact that many tech companies are experiencing slow growth or even layoffs, it's possible that the hiring situation may improve over time. It's essential to stay informed, network with professionals in the field, and be prepared to adapt to changes in the job market",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The peak that you saw years ago has never been the norm. Feels like we are back to just below normal numbers IMO\n\nSaw this years ago with becoming a server admin then network admin then cloud admin. You ride the wave when it’s hot but must understand it won’t last",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's true that hiring in cybersecurity and tech roles has been sluggish for quite some time now, which is concerning. It's difficult to predict with certainty when this downturn will improve or if it's a permanent shift in the industry.\n\nOn the other hand, I think there's plenty of good quality jobs to be had if you have the skills. I'm a recently laid off red teamer and I've been looking at roles that are more reverse engineering and exploit development focused. I found a bunch of them from defense contractors, which is a world I'm not familiar with. Still, the jobs exist.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All the comments is scary for me 😅 i was getting ready to start my career path in cybersecurity. What I suppose to do? Shall i stop now before i pay a lot of money for courses?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "as someone who’s in a degree path for “cybersecurity” seeing these posts always depresses me. i feel like I have no fucking chance even if I do get certs or IT experience",
        "points": "0 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Who do you know in the industry that is in a hiring position? Or have you been networking in person?",
        "points": "0 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "That is very disheartening",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "cybersecurity is just IT Security.\n\n​\n\nThe fad was always hype.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think we're seeing the field self-correct a little bit.\n\nIt's difficult to acknowledge this, because the vast majority of organizations are still sorely lacking in cybersecurity. But if you're a SOC analyst and 95% of your job is running automated tools in response to SIEM events, then someone at your company is probably looking to replace you with a script. And let's be honest, those tools are getting better every day. We don't need an in-depth full forensic analysis because Frank in accounting installed yet another \"cute cats lol also coupons\" toolbar. We just need to remediate.\n\nOn top of that, there seems to be a glut of qualified candidates.\n\nThe people who are decompiling malware are fine. The people who are managing compliance are fine. The people who are doing advanced endpoint management are fine. But a lot of the entry-level jobs are vanishing or shifting. It's kind of like the difference between being a sysadmin in 1994 and a sysadmin in 2024, only compressed down to 1/6th the scale.\n\nIf you pull back and look at the bigger picture, I think we're seeing the beginning of the end of the IT era. A company doesn't need to have in-house sysadmins, network engineers, and cybersecurity analysts when they can just hand everything off to AWS or Azure or Oracle or a local MSP or whoever. And honestly, doing so these days makes a lot more sense than it did just ten years ago. IT is right about where US factory workers were in the 1960s. The industry is going to be okay for a while, but we're going to see some serious shrinkage over the next 20-30 years. And that includes Cybersecurity.\n\nThere's still time to make a career out of it, but the door is beginning to close. And the gravy train already left the station. Coasting isn't a viable strategy anymore; people who want to build their career here are going to have to keep learning or immediately sink.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aen5up",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aen5up/what_questions_should_i_expect_from_a_2_hour_long/",
    "title": "What questions should I expect from a 2 hour long interview for a junior information security analyst?",
    "points": null,
    "comments": [
      {
        "comment": "The only thing you can do is not to work yourself into a worry. I know it’s easier said than done but there is not much you can do.\n\n2 hours does seem long but it could just be for the hiring manager to afford enough time to it so to not not feel rushed into activities afterwards and so maybe the full 2 hours won’t be needed.\n\nBut for a jr role it’s not likely going to be super technical and likely only be some time towards it, but more behavioural in which case you are just talking and asking questions and they’re just gauging if you’re a good fit. Just be sure that you yourself ask questions during your interview, it’s important that you engage with them.\n\nAlso it’s okay not to know an answer to a question, what’s important is how you approach it. Applicants always worry to much on this aspect and it is absolutely okay to not know every question being thrown your way, what is more important is how you conduct yourself and how you respond in this situation.\n\nBut if you worry now about the interview your anxiety will show and your confidence and ability to prove your candidacy will degrade.",
        "points": "10 points",
        "children": [
          {
            "comment": "Thank you!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "what is the air speed velocity of an unladen swallow?.. make sure you can answer that one, just in case.\n\nThe rest...there is no way to tell. Like u/Sivyre said, do your best to relax.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Have questions for them.\n\nRelax and show them what you know and don't BS them or make up answers.\n\nRemember you are trading your time and dreams for money.\n\nAlso... Everyone interviewing you shits. They may know more than you but no one knows how to be immortal. They are affected by life too so be human like them.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Being a senior, I have sat for a number of junior interviews. How our interviews go. We start by describing ourselves and then the position. We ask about 10 lightly technical questions. If you answer any of them really well, we may ask a few follow up questions to probe your knowledge a bit. At the end we ask if you have any questions. (Always have a least 2-3 questions for us) It shows your interest in the position and the company. This usually takes an hour, but can go over a bit.\n\nYou don't have to get every question right, or answer it right away. Step back and breath. I've seen dozens of people mess up simple questions because they are nervous and answer too quick to just to finish what's in front of them. If you don't quite understand the question, ask them to elaborate. Use association and examples from personal experience to talk though a question.\n\nWhen I'm doing hiring, I'm not looking for the one to get every answer right. I'm looking for a team member who will fit in with the group. Nearly everyone is nervous at an interview. Show me how you can relax and build a rapport with us in your two hours.\n\nOh, and I always appreciate a thank you email after the interview. Gives you a chance to answer any questions you feel you missed and show that you are interested.",
        "points": "1 point",
        "children": [
          {
            "comment": "Thank you this is very useful! Should I say anything in the email about any questions I wasn't able to answer during the interview? Should I say something like: I went ahead and researched more about x to be able to answer your question, this is what I found.",
            "points": "1 point",
            "children": [
              {
                "comment": "Absolutely, shows you have initiative to acknowledge and answer something that you missed.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "A couple things to go along with the other advice you got in the post...\n\nIt might be better to say \"I don't have those details at hand, but I can look in such and such place or follow up with person/team and get back to you\", rather than \"I don't know about that\". It's effectively the same thought, but if they're looking for your customer-facing demeanor that might help (at least at my org the first would be much preferred).\n\nDefinitely use analogies, things people can relate to, that show your understanding. Even something like \"that is a unique id for this content, like a primary key in a relational database...\" can make them think \"oh yeah they know what they're talking about, not giving canned answers\". On the other hand though, don't go too deep, don't ramble or talk yourself into a corner, just pause to consider the question, clarify it if needed, and then answer as asked. Consider the whole audience too, if your panel has a technical person and a non-technical person, try to say something for both of them (it's very hard to do this well, just do your best).\n\nThirdly, with that much time, yes your demeanor will be on display for sure, try to build rapport, personal connection with even just one or two on the panel can really help your case when you log off and they later get together to choose who they want to work with.\n\nAnd keep in mind, sometimes whether or not you get the job has nothing to do with how well you do or don't do, they might love you and still it may not work out, don't take it too personally either way.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Thank you! This is really useful. I feel a bit more confident after reading everything on reddit, watching videos etc. From what I gathered even if I don't have the technical knowledge it's important to stay humble, be nice and who knows they may still hire me",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Is this for SI?",
        "points": "-1 points",
        "children": [
          {
            "comment": "Edit: sorry I saw it was for a security analyst, I was thinking of a VR role that had a 2 hour interview.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It's not unusual to talk to multiple groups of people in an interview, which can really add to time - it seems unlikely one group of people will be grilling you for 90 minutes, that'd be very unusual. Probably more likely you'll have 3 groups, with 30 minutes allocated for each of them.\n\nFailing questions happens, it matters but it's seldom a \"get one question wrong and you're out\" scenario. People want to judge your manner and your knowledge, and there's more ways to pass than to be perfect. Know enough to be reasonable for your skill level and the position, be someone who seems pleasant enough to work with, and you can do just fine.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Don't stress about the time. It probably will be mostly behavioral but some technical.\n\nIf you don't know an answer be honest about it. Don't just shit out a guess and pretend you know it. Try something like \"I'm not sure, from what I know about ___ I would probably think that the answer is ___ but I don't know. I'll have to look this up and learn more about it\".\n\nThe thing you should be most concerned about is showing you would be a good person to work with. You want them to walk away with the impression that they would enjoy spending a significant amount of time with you, be friendly, make jokes. Don't suck up though, that is really obvious.\n\nAlso, teams want juniors that are willing to learn and want to learn. If you point out things you have done on your own time to learn they will eat that up.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Do it. Take notes. Let us know how it went and what took 2 hours.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aemdtz",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aemdtz/how_to_be_safe_with_internet_turned_on_in_a/",
    "title": "How to be safe with internet turned on in a virtualbox vm",
    "points": null,
    "comments": [
      {
        "comment": "You should look into a tool called inetsim. Basically you need to setup another VM on an internal network and route your traffic through it. That second VM can then run the inetsim tool on the interface that's connected to your windows VM and it can simulate internet traffic (basically this means it will reply with something on all ports and protocols). You can configure the tool to have custom replies for certain protocols I believe",
        "points": "50 points",
        "children": [
          {
            "comment": "Thats so cool do you have a link?",
            "points": "5 points",
            "children": [
              {
                "comment": "https://www.inetsim.org/",
                "points": "4 points",
                "children": [
                  {
                    "comment": "i have setup inetsim but it doesn't work what should i do\n\ni used REMnux but i don't know how to make it work on the other vm",
                    "points": "-13 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If you're new to cyber security I wouldn't touch live malware until you really know what you're doing. Even without networking turned on in a VM.\n\nIt's entirely possible that the malware will be able to detect that it's running in a VM and spread itself to the host OS through something as easily overlooked as shared folders.\n\nBe very careful with malware samples, and always remember that what you have in that password protected ZIP file could brick your laptop if you slip up.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It seems like per your comments you are relatively new to cyber which is good and okay, but i don’t think you should be messing with Malware until you grasp some more concepts.\n\njust my opinion!",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Check FakeNet",
        "points": "3 points",
        "children": [
          {
            "comment": "This one? https://sourceforge.net/projects/fakenet/\n\nShould i set it up on my vm or host computer",
            "points": "1 point",
            "children": [
              {
                "comment": "Since you will isolate your VM , in your VM. Depends.on your setup tbh.\n\nYes that one.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Okay so i set it up in my vm but what do i put at settings like NAT adaptor? i mean internet adaptor",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "use fakenet-ng by mandiant instead. set it up on your VM",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I don't know what's going on here but it seems very skiddish.",
        "points": "5 points",
        "children": [
          {
            "comment": "Eh, we all start somewhere. I'm sure our early forum posts were cringey.",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "A VM is a computer... so do what you do for your computers?",
        "points": "-19 points",
        "children": [
          {
            "comment": "Bro i meant the virus can transmit through internet how do i protect from that?",
            "points": "4 points",
            "children": [
              {
                "comment": "The same way you protect everything else from internet viruses",
                "points": "-21 points",
                "children": [
                  {
                    "comment": "Stop it bro I haven't seen that many dislikes in a while😆💀",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "What do you mean?\n\nHow can it transmit through the internet? Do you mean exploit your host or what?",
                "points": "0 points",
                "children": [
                  {
                    "comment": "I mean it can transmit and infect other machines on your network, or even your host",
                    "points": "-1 points",
                    "children": [
                      {
                        "comment": "How?\n\nIf the malware you run has a vm escape exploit you’re fucked. \n\nIf it doesn’t how would it infect your machines when you give it internet access?\n\nInternet access doesn’t mean lan access. Internet access doesn’t mean vm host access.\n\nIn your place I’d read really well on host/vm isolation, network basics, tcp/ip, routing… before messing up with malware.",
                        "points": "4 points",
                        "children": [
                          {
                            "comment": "That is literally my thought too..\n\nUnless you've just made a worm and your worried it's gonna take over the world, I dont really understand the question OP",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "If it escapes my VM it only viruses my host??",
                            "points": "-1 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Honestly all these tools and software are great, however if you have no understanding of TCP/IP or the basic network fundamentals you won't find a resolution here. Notice how no one mentioned use Wireshark to discover how the malware is communicating than create firewall rules accordingly. Maybe analyze malware in an automated online sandbox like any.run instead of your physical device, at least until you've learned networking and A+ .",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Bitdefender blocked a virus on my vm :))))))",
                    "points": "-1 points",
                    "children": [
                      {
                        "comment": "Share a image of the infection class and other info",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "I was trying to download retro games on windows xp\n\nhttps://imgur.com/a/UJADYcw\n\n​\n\nAnd i did after all a free game i downloaded and its pretty cool",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Because the virus also needs internet or it will not work and i saw a lot of youtubers with internet turned on",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "virtualbox is trash use KVM or Xen",
        "points": "-9 points",
        "children": [
          {
            "comment": "I like opnsense or pfsense to go with with it aswell! Too easy to break out of vbox imo.",
            "points": "1 point",
            "children": [
              {
                "comment": "Wut",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Bro? i said my host os is Windows 10",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aekztk",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://medium.com/p/02ad091f8a79",
    "title": "Cybersecurity for Everyone By University of Maryland. It's a free course you can take.",
    "points": null,
    "comments": [
      {
        "comment": "Why post a crappy medium link... here's the real link: https://www.coursera.org/learn/cybersecurity-for-everyone",
        "points": "85 points",
        "children": [
          {
            "comment": "Also a heads up that it’s not completely free. It’s free to enroll but you’ve got to pay $30 a month to coursera to access it once your free trial is over.",
            "points": "43 points",
            "children": [
              {
                "comment": "thanks for digging in deeper! Do they also demand a credit card?\n\nIn other words it's yet another self serving medium post.",
                "points": "14 points",
                "children": [
                  {
                    "comment": "Well you need a credit card to pay for it once your free trial is up but ultimately it says this is a 7 week course so combined with the free trial people should be able to complete the course by only paying for on month.",
                    "points": "6 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "It's a no-effort affiliate marketing blog advertising a course that isn't even aimed at cybersecurity professionals. How did this shit get upvoted.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Corsera lets you self audit some courses you don’t get the cert but it’s the same course minus a couple exams sometimes",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Can’t you access it as a “listener”?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "This person’s Medium account is just posts of links to training programs. A complete waste of time",
            "points": "8 points",
            "children": [
              {
                "comment": "isn't that pretty much all medium accounts?",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "For complete beginners?",
        "points": "3 points",
        "children": [
          {
            "comment": "Yeah",
            "points": "-11 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "How do you go about getting a certificate when done? Excuse the ignorance.",
        "points": "2 points",
        "children": [
          {
            "comment": "Most Coursera courses literally auto print you a PDF cert with your name on it upon course completion. These certifications are quite literally not worth the 2MB of storage they take up on your local drive.",
            "points": "1 point",
            "children": [
              {
                "comment": "So what would be a better route then?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Coursera is the bane of the industry.",
        "points": "1 point",
        "children": [
          {
            "comment": "How so? I'm planning on starting this to get a good starting point for Cybersecurity info and future career paths. If coursera isn't a great starting point, do you know of any others? I'm going to be starting the path to an associates for Cybersecurity in the Fall and I'd like to cover other areas / get certs while I'm taking college classes",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Oh great, another inch deep course that will encourage unqualified people try and flood the workforce.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aekze6",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://techcrunch.com/2024/01/26/mercedez-benz-token-exposed-source-code-github/?guccounter=1&guce_referrer=aHR0cHM6Ly90ZWNodXJscy5jb20v&guce_referrer_sig=AQAAAI1-ZOsOMHMqMBj0waThm6qDN_2JLSG8cUPSfHIK1SxgBIHG_mbL6ZORRdSWv4N93HIYITfx48p9gwqfUgVrhUbg8VMyhjOHhJUKPHrLtAdFLPBkF5RFM2Zx5IhbAAefcRvoX7CwTMvV5g9uSDrzCxDQgSjpr_lVh1ljxl6-uDh3",
    "title": "How a mistakenly published password exposed Mercedes-Benz source code",
    "points": null,
    "comments": [
      {
        "comment": "Has anyone read it? Is there anything in there about the blinkers not working? Maybe we can fix the bug and send them pull request?",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That employee.... Fired!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aek792",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://apnews.com/article/biden-ai-artificial-intelligence-safe-395591bcde523416db88767fa54f30f5",
    "title": "AI companies will need to start reporting their safety tests to the US government",
    "points": null,
    "comments": [
      {
        "comment": "AI safety tests: What is a Woman?\n\nif \"crash\" then safe = OK\n\n/s",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aejtfn",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://thehackernews.com/2024/01/researchers-uncover-outlook.html",
    "title": "Researchers Uncover How Outlook Vulnerability Could Leak Your NTLM Passwords",
    "points": null,
    "comments": [
      {
        "comment": "This post links to The Hacker News (THN). The moderators of r/cybersecurity strive to maintain a professional subreddit which will often discuss news, and further acknowledge that THN is a popular source of news within the cybersecurity community at large. We always wish to act in the best interests of the community and will not restrict news content which is accurate and valuable.\n\nHowever, it has come to our attention that THN has been accused of plagiarism since at least 2012 (ref: attrition.org), allegedly copying article contents from original authors and modifying them without appropriately crediting the original source. Their behavior has been met with repeated criticism, including making false statements (ref: @thegrugq) and renewed claims of plagiarism (refs: news.ycombinator.com c. 2018, reddit.com c. 2021). Due to these incidents, THN links have been banned from several subreddits including r/privacy, r/technology, and r/hacking.\n\nWe would hope that THN is now appropriately crediting sources of its content or writing its own original content, however we are unable to police each and every article. Please ensure that the information in this article is factual, and where possible, please choose to support high-quality ethical journalism directly. If the community feels this warning is no longer relevant, we will remove this AutoModerator action. Thank you.\n\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aej7wg",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1aej7wg/interview_questions_for_system_security_engineer/",
    "title": "Interview questions for system security engineer position.",
    "points": null,
    "comments": [
      {
        "comment": "Search the sub for interview questions. These have been posted several hundred times.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Post the job description here so we can help",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]