[
  {
    "id": "t3_1ad5kow",
    "subreddit": "r/tech",
    "dataType": "link",
    "dataUrl": "https://www.smithsonianmag.com/smart-news/dna-from-oceans-twilight-zone-could-lead-to-new-lifesaving-drugs-scientists-say-180983606/",
    "title": "DNA From the Ocean’s ‘Twilight Zone’ Could Lead to New Lifesaving Drugs, Scientists Say. Researchers catalogued the genes of more than 300 million groups of marine bacteria, viruses and fungi in hopes that the database could lead to breakthroughs in medicine, energy and agriculture.",
    "points": null,
    "comments": [
      {
        "comment": "I’m assuming with the current breakthroughs in AI that the process of navigating all these various genomes will really bring new possibilities to life at much quicker rate than before? If so this is really exciting!",
        "points": "12 points",
        "children": [
          {
            "comment": "Yes, betch",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "yes betch!",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "everyone talks about the bad shit but the good shit is so good",
            "points": "0 points",
            "children": [
              {
                "comment": "Get it betch",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "But then guess what. If it is destroyed there wont be anymore.",
        "points": "7 points",
        "children": [
          {
            "comment": "if what is destroyed? the ocean?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Uh oh. Next up is orphans holding these ocean bottom discoveries internally in underwater cities.",
        "points": "3 points",
        "children": [
          {
            "comment": "Good work, came here to comment:\n\n\"Do you want Bioshock? This is how we get Bioshock.\"",
            "points": "2 points",
            "children": [
              {
                "comment": "Would you Kindly reply to this comment?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "so there is money at the bottom to sea...",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Unleash AI on this data",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I do love me some frontier science, but forgive me being a bit skeptical about a free tool coming from a university chaired by MbS.\n\nCan't help but wonder if there's a catch.",
        "points": "1 point",
        "children": [
          {
            "comment": "You have to win squid games?",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "On one hand they are creating wars and other problems to solve and on the other discovering new ways to create solutions to those problems they keep creating, so what is off about this picture?\n\nN. S",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "TIL there is marine fungi. Amazing. Does it network under the ocean floor and fruit on the ocean floor like terrestrial fungi?",
        "points": "1 point",
        "children": [
          {
            "comment": "i think it just floats around",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why does this matter if the exploitation of the ocean is literally killing the planet? Whats the drug that will heal the sick earth when we are supposedly living our best lives?",
        "points": "2 points",
        "children": [
          {
            "comment": "Putting my tiny brain on this for second since it seems to be the common reaction.\n\nWhat if it’s possible for …\n\n1) certain humans are exploiting the ocean 2) AND certain other humans studying the ocean helps us live better 3) AND while gradually studying the ocean and learning to live better we all gradually exploit the ocean less\n\nOr perhaps “we’re all dead tomorrow and what’s the point” is probably the response I’ll get along with half a dozen downdoots",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This sounds awfully nihilist, but the last thing the oceans and other species on the planet need is humans living longer.\n\nI greet these news of breakthrough stories with less enthusiasm than I wish I had.\n\nThe new cancer vaccine sounds promising, too, but also makes me question whether tens of millions of humans living an extra 10-20 years is actually a good thing.\n\nI hate to see people suffering, but I hate to see the planet suffering and the extinction rates and the ocean poisoned, too.\n\nIf not for the stupid Electoral College in the US, Al Gore would have been president in 2000, and life on our planet might look different 24 years later, today.",
        "points": "-1 points",
        "children": [
          {
            "comment": "Me too. Asteroid 2024.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "We don't need to save more humans. Please concentrate on saving the other species that you are experimenting on",
        "points": "-3 points",
        "children": [
          {
            "comment": "I agree, 7 billion is already too much. We are on pace to be the only species alive in the future, we can’t keep everyone alive.",
            "points": "1 point",
            "children": [
              {
                "comment": "Sounds like a lot but it's really not after you account for war, disease, accidents and other nasty human conditions. We are a fragile species.\n\nAlso,There's plenty of land to grow food. (Wether it's vertical or horizontal)",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "Apparently you have never heard of overshoot, which is how much more of the world's 'resources' (I hate that word, but for lack of a better word) resources that we are stealing from the future in order to keep this society alive now, Perhaps 8 billion people are not that much, if we lived in harmony, but when you consider how we live, we are no longer homo sapiens but have moved into the category of Homo Colossus.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Can’t wait to see any arrangements shut down or delayed by big pharmaceutical companies and big energy.\n\nNot to mention ton of it’s embraced by them, the price being astronomical.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "From my understanding, these aren’t genome resolved correct and the genes are from metagenomic assemblies?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That’s great. Good thing we’re taking good care of those biospheres so that we can use this stuff and benefit humanity.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Do you want Bioshock? Cause this is how you get Bioshock.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Life-saving drugs, cool. Can we get like, super weed",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1acz7t4",
    "subreddit": "r/tech",
    "dataType": "link",
    "dataUrl": "https://www.bloomberg.com/news/articles/2024-01-25/ai-needs-so-much-power-that-old-coal-plants-are-sticking-around",
    "title": "AI Needs So Much Power That Old Coal Plants Are Sticking Around",
    "points": null,
    "comments": [
      {
        "comment": "The grid gets fed with whatever generation is profitable under a given regulatory model. It doesn’t matter how the energy is consumed.",
        "points": "41 points",
        "children": [
          {
            "comment": "If they actually started charging for coal ash disposal coal would be more expensive than any alternative. In the US it’s often left on site an then the company often goes bankrupt leaving the country to clean it up.\n\nEdit: there currently are 1400 dump sites awaiting cleanup in the US alone, some are leaking into ground or surface water. These contain heavy metals like lead, arsenic and other and some coal mines even contained not insignificant amounts of uranium. In 25 years worth of US coal ash you can find enough uranium to fully fuel a nuclear reactor. Yet there is an exception coal ash doesn’t need to be treated as low radioactive waste.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "What the hell kinda clickbait nonsense is this 😂",
        "points": "30 points",
        "children": [
          {
            "comment": "Clearly AI written article.",
            "points": "4 points",
            "children": [
              {
                "comment": "AI writing about how AI is bad 😂 Decades in the future, the actual artificial intelligences that arise and conquer us are not gonna like this.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Ai reading articles written about Ai by Ai, imagine that.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Always techs fault. Or the peoples fault. Or your lifestyle. You eat too much meat. You this. You that. But never the gigantic multinational corps who buy off politicians, receive astronomical subsidies. Nah. They are “doing their best.” It’s your fault. It’s the tech industry and their awful advancements.",
        "points": "11 points",
        "children": [
          {
            "comment": "...isn't the tech industry the same thing as the gigantic multinarional corps?",
            "points": "6 points",
            "children": [
              {
                "comment": "Sure. But tech doesn’t generally run energy and vice versa. They’re both terrible in their own respect. My point is why is it always the consumers fault? Consumer being you and I, or a giant tech company. It’s never personal responsibly for corporations in general. Energy corps shouldn’t be subsidized by the government to make shitty dirty energy. Tech companies shouldn’t get 50-100% tax breaks to build facilities leading everyone else to foot the bill. They are similar but different. But no matter who the consumer is, they pay. Instead of the free market actually being free.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "It’s our fault because the demand we create is the very reason those corporations exist in the first place. It’s very hard to feed and house billions of people while also trying to grow the economy (of which is the very essence of human nature whether we like to admit it or not)",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "How can the economy, the idea of which is only a few hundred years old, be the “very essence of human nature?” Go read some Kohlberg and take a sociology class.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "The idea of an economy is much older than that. For example, the Romans were well aware of the idea of inflation, and fought to minimise... or maximise it dishonestly.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Nah, the corporations have a monopoly on their industries and make it almost impossible for smaller companies to stand a chance of survival",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Don’t forget to recycle",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "What kind of pro coal anti Ai bullshit is this?",
        "points": "16 points",
        "children": [
          {
            "comment": "Not sure how this is \"pro coal\".\n\nThat doesn't even make sense. How could it he both pro coal and anti ai?\n\nE: still waiting for someone to explain how criticizing ai tech companies for revitalizing the coal industry is somehow pro coal....",
            "points": "-8 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It’s good to see that the only meaningful contribution the blockchain has made to history is to be the first in a line of meaningless “breakthroughs” that are so computationally intensive that we’re turning back on decommissioned power plants to fuel them.",
        "points": "11 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Is this suggesting that coal was about to be a thing of the past, but then AI showed up and they had to keep the plant open? Lmao trash ass article",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI is the problem sure, not the massive profits that fill the pockets of people that go to lobby the government to legislate against renewable energy. Couldn’t be that, must be the latest boomer boogie man causing it",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And absolutely no one asked for this AI crap in the first place!!",
        "points": "-6 points",
        "children": [
          {
            "comment": "\"I don't like this advancement in technology so why are they doing it?!!! >:(\"",
            "points": "8 points",
            "children": [
              {
                "comment": "It’s creepy, invasive of privacy, it’s already cost thousands of jobs, it’s being abused by the large corporations, and it will only be used to do wildly unethical things.\n\nWhy on Earth would you want this?",
                "points": "-8 points",
                "children": [
                  {
                    "comment": "It’s not technology’s fault, it’s humans.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "\"Guns don't kill people, people kill people\"\n\nSame nonsense. Nobody has ever said that technology will cause these problems without humans making it happen. Thats not remotely what is on the table.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "All of those things are government issues. Every single one of them has already and will continue to occur every opportunity companies get because they lack adequate oversight. I'm not willing to lay the blame of that on the technology itself when the potential it has to revolutionize things like medical treatment and design/manufacturing are beyond belief.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "It’s not going to revolutionize anything. It’s a party trick huge megacorporations use to justify mass layoffs.\n\nIt is awful, has zero benefits, and will only bring about unfathomable amounts of misery and human suffering.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "\"Advacement\"\n\nNotice how anything is justifiable to tech bros as ling as its a technological advancement. Nevermind the socio-economic ramifications of their actions, if you criticize it in any way, you are just a ludite!",
                "points": "-6 points",
                "children": [
                  {
                    "comment": "Right. Because previous technological advancement didn't have any negative impacts nor socio-economic ramifications. Imagine if we had let people pursue electricity as an energy source! The ramifications would have been huge and people would have lost their jobs to automation! Thank God we put an end to that, right?",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "So, to be clear, you are just fully confirming my accusation that you beleive that technological advancement is the only true goal and we should just feed people to the meat grinder?\n\nAnd my accusation that you accuse anyone who challenges this world view of being anti-technology?\n\nDo you have anything to contribute besides mindlessly confirming everything I've accused you of because you can't seem to parse out thoughts for yourself?",
                        "points": "-2 points",
                        "children": [
                          {
                            "comment": "Not the same poster, but yes, technological advancement makes everyone’s lives better in the long term. It often inconveniences some people in the short term though. Just how these things work.",
                            "points": "2 points",
                            "children": [
                              {
                                "comment": "Hahaha oh buddy.",
                                "points": "-5 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I did.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Why are you getting downvoted?!",
            "points": "-1 points",
            "children": [
              {
                "comment": "No clue!? I’m confused myself.\n\nI mean, every corporation is using this as a way to get us pay even more for the monthly subscription thing we can’t ever own fully.\n\nAnd it does nothing of utility.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Reason 1,078,672 we don’t deserve to be here as a species. Bring on the Matrix!",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Thats why I’m not worried about it… we can just unplug it.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Anything that runs on electricity needs a source and a way to produce it and with that one now begins to understand who is behind the propaganda.\n\nThere is a way to it perpetually, but no one wants that, and I wonder WHY?\n\nThis is what happens when debts go unpaid and shell games are used to rip off the American Citizens and replace them with anyone else.\n\nAnd it can be done, because I already did it.\n\nN. S",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Noooooo",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Matrix vibes",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Good. Fire them up. We got work to do as a people, community, and world.",
        "points": "-4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "New coal plants fitted with baghouse technology put out air emissions of a single suv idling in a parking lot in a 24hr period and require clean coal is what I was told. Not sure if I buy all that.\n\nDry fork station in Gillette Wyoming is the only one I know of thats a new coal plant. The Chinese built a similar one in Colorado and it burned the building down to 4ft posts",
        "points": "-7 points",
        "children": [
          {
            "comment": "Clean coal is an industry term and is complete bullshit. Those filtration systems are just a pr gimmick. Coal is still by far the dirtiest power generation we have.",
            "points": "2 points",
            "children": [
              {
                "comment": "No doubt about it. When they say clean they mean low radiation coal. We sell all the high radiation coal to foreign countries, mostly china.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "No worries soon there will be human battery farms to power it",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Coal plants are sticking around because corrupt business owners and greedy politicians like Manchin.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "dilithium is the answer!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1acpwdi",
    "subreddit": "r/tech",
    "dataType": "link",
    "dataUrl": "https://techcrunch.com/2024/01/22/disney-holotile",
    "title": "Disney offers an elegant solution to VR’s movement problem | TechCrunch",
    "points": null,
    "comments": [
      {
        "comment": "Lanny Smoot is a genius and a gem. I work for the National Inventors Hall of Fame and created a video honoring him. Seeing this invention in real life was nuts. He’s also just a generally awesome person as well.",
        "points": "19 points",
        "children": [
          {
            "comment": "RIP",
            "points": "-7 points",
            "children": [
              {
                "comment": "RIP? He’s not dead",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "\"I'm not dead yet\" - Lanny Smoot",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Thanks for getting it and all who downvoted are stupid lol",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "He’s the guy who invented the real lightsaber",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It appears to be smaller than other treadmills, and I can see it fitting in my room. It seems a little unstable, though, and I doubt I could run that thing, for example, without any user support or restrictions. Not that I could have afforded it in the first place:D",
        "points": "37 points",
        "children": [
          {
            "comment": "Not that I could have afforded it in the first place\n\nRight? VR’s movement problem, yeah more like movement into my possession without breaking the bank",
            "points": "6 points",
            "children": [
              {
                "comment": "just a matter of time. improvement and affordability are on their way.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I imagine this would work great in conjunction with the virtual sets they’re already using. You could shoot an entire movie in a room the size of an elevator, maybe not a very good movie.. but still",
        "points": "9 points",
        "children": [
          {
            "comment": "Coupled with the Unreal game engine, movies in the future are going to just be very high budget animated films.",
            "points": "2 points",
            "children": [
              {
                "comment": "They already are. The amount of VFX used in “live action” movies like Avatar and Top Gun is ridiculous.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "That fight was over the moment dead people started 'starring' in films.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Lanny Smoot, who happens to work for Disney offers an elegant solution. https://en.m.wikipedia.org/wiki/Lanny_Smoot",
        "points": "12 points",
        "children": [
          {
            "comment": "Uh… where?",
            "points": "-1 points",
            "children": [
              {
                "comment": "He’s the guy in the video demonstration. He has over 100 patents",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "That's what this article is about. Did you look at it?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "How do you get off of it?",
        "points": "2 points",
        "children": [
          {
            "comment": "….you don’t….its a mouse trap made by a mouse. We are in the end times 😂",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I’m sure someone will figure it out. Someone always does.",
            "points": "0 points",
            "children": [
              {
                "comment": "There is a suspended harness that helps you get off of the holotile, but he did say if someone didn’t help you off you could walk forever on it.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "The video I seen seemed to require half steps to stay on it. Or maybe the guy was just taking tiny steps the whole time to feel more comfortable, or because of what ever was going on in the set required tiny steps.\n\nBut to me it looked like a full sized step or 2 would end up with u off the mat.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I’ll be on the holodeck",
        "points": "2 points",
        "children": [
          {
            "comment": "Cleaning crew to deck 9",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Just in time for Vision Pro.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Imagine this stuff in logistics, or industrial applications, there is much potential here it’s mind blowing",
        "points": "2 points",
        "children": [
          {
            "comment": "I worked at a place filled with dynamic conveyors that looked like a primitive version of this. It was an interesting bright spot in a very banal place.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Neurologically controlled will likely be good enough by the time this would be cost effective, but maybe not.\n\nI still think tech like the neurosky headset or the Emotiv sensors are the endgame for VR movement & controls",
        "points": "-1 points",
        "children": [
          {
            "comment": "Fascinating how the known tech costs more to scale down than the unknown tech",
            "points": "1 point",
            "children": [
              {
                "comment": "It’s not unknown, just because you don’t know about it. Those two companies have been making products for over a decade, and already sell wearable EEG sensors for computer interface.\n\nNeurosky was founded in 2004 & Emotiv in 2011. The technology just needs to improve reliability & fine control.\n\nEmotiv has gone from a 5 channel controller to a 32 channel controller,for $2000, in 14 years. 32 is likely enough for motion input.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Oh well $2k is basically the same price. You’re right /s",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "It’s 45% more expensive and by the time both technologies are cheap enough to be ubiquitous, I think the less bulky and stationary system will be more popular, especially if the next generations of VR tech integrates it.\n\nBut go off.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Whatever if they’re gonna roll this out, it should be big enough that the person could walk normally.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ernest Cline is the prophet we don’t deserve",
        "points": "-3 points",
        "children": [
          {
            "comment": "He’s a hack and a shit writer. Read Snow Crash if you want to see where Kline ripped his ideas from.",
            "points": "2 points",
            "children": [
              {
                "comment": "Interesting. I’ll have to check it out.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I get Disney wants to advertise it's \"imagineers\" are incredible, but how many people are really interested in this?",
        "points": "-4 points",
        "children": [
          {
            "comment": "Me.",
            "points": "1 point",
            "children": [
              {
                "comment": "/serious\n\nWhat would you use this for?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "But can you moon walk???",
        "points": "0 points",
        "children": [
          {
            "comment": "My mom always told me I could do anything if I had patience and put my mind to it. That time has come",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Introducing the new Nintendo Power Pad.",
        "points": "0 points",
        "children": [
          {
            "comment": "I’m ready for extreme track and field. So many good memories playing that game with family and friends",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "How do you get off ? Can you run off it ? What if you slip and fall ?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What the heck is this thing doing? Is there a skin covering each tile that slides freely as you attempt to move?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I used to have the Oculus Quest; it was good, but the movement and setup were awful. Taking under consideration innovations like HoloTile, seems like there's a big future for VR",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So is Disney attempting to make a very small version of Star Trek’s Holosuite? VR, with tracking?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I doubt you could run with it though. Youd have to only walk places.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What’s wrong with the one like in community? The slick surface plus socks?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Reality!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "and neuralink will take care of sensory perception eventually",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]