[
  {
    "id": "t3_1acgg14",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://arstechnica.com/google/2024/01/pixel-8-pro-finally-gets-forehead-scanning-body-temperature-feature/",
    "title": "The Pixel 8 Pro can now read body temps, if you swipe it across your face",
    "points": null,
    "comments": [
      {
        "comment": "Just tried it. Seems to work as well as other forehead infrared thermometers. Which is to say, not super accurate but good enough to know if you might have a fever. I could see this being really useful if my kids complain about not feeling good and I'm not home or otherwise can't access the thermometer. Cool.",
        "points": "34 points",
        "children": [
          {
            "comment": "Generally you can tell if you have a fever, as an adult.",
            "points": "6 points",
            "children": [
              {
                "comment": "Eh your mileage will vary.",
                "points": "11 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I mean its nice to confirm.\n\nThis was clearly a covid-era feature though. I would be surprised if the next phone kept it.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Dam the kids are going to hate google",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "",
        "points": "13 points",
        "children": [
          {
            "comment": "Ahh for fucks sake, now the damn phrase is going to be stuck in my head all day.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Got enough problems keeping my allegedly oleophobic screen clean. And you want me to do what now with it? Can’t wait til smartphones start shipping with rectal thermometers.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yeah I’m good",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My phone is too dirty to put on my face",
        "points": "-1 points",
        "children": [
          {
            "comment": "Did you even click on the article? It clearly says \"close enough without touching your face\"",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Gross. With how dirty people are this is more likely to get you sick then to show if you are sick.",
        "points": "-7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well that's not alarming at all...... I wonder what the market is for dumb phones these days?",
        "points": "-30 points",
        "children": [
          {
            "comment": "alarming \n\nExplain.\n\nIt's already covered in cameras and microphones. Your concern over a temperature sensor is weird.",
            "points": "12 points",
            "children": [
              {
                "comment": "I think they read the title wrong and assumed it could read your temperature without your consent or something, not that they've now fixed it and you can only do it purposefully.",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "What makes a temperature reading alarming? Compared with, say, a microphone or GPS or camera?",
            "points": "17 points",
            "children": [
              {
                "comment": "right lol do they have the same level of concern for blood and heart monitors in smart watches?",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Pixel 8 pro can now track women’s fertility",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have a thermometer that does the same thing, but I can't connect to the internet with it",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ace8cu",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.digitaltrends.com/space/ingenuity-helicopter-mission-ends/",
    "title": "Saying goodbye to Mars helicopter Ingenuity after 72 flights",
    "points": null,
    "comments": [
      {
        "comment": "This was one of the coolest things ever. I thoroughly enjoyed watching every single video this little guy put out.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Good night, Genny.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "🥲",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ac8som",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.theverge.com/2024/1/26/24052275/fossil-quitting-smartwatches-android-wear-os",
    "title": "Fossil is quitting smartwatches | The group is leaving the entire category behind. The Gen 6 will be the last gen of its smartwatches.",
    "points": null,
    "comments": [
      {
        "comment": "I hope they continue their hybrids as I really enjoyed mine",
        "points": "122 points",
        "children": [
          {
            "comment": "Same. But it looks like the Skagen hybrids are discontinued, so I don't have much hope for the Fossil versions.",
            "points": "35 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I want to like the hybrids. Only if their battery is a bit better with better app support.",
            "points": "5 points",
            "children": [
              {
                "comment": "Battery better? Mine lasts 10-14 days between charges! How much better do you want?",
                "points": "13 points",
                "children": [
                  {
                    "comment": "Which one do you use? I've been looking for one",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Hybrid HR series. Looks and functions as a standard watch with the benefits of notifications and step counting/HR monitoring.",
                        "points": "6 points",
                        "children": [
                          {
                            "comment": "Seconding the hybrid. Looooove mine and would wear it every day if I didn't work in kitchens.",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Mine didn't use lithium but uses coin cells and they last like 3 months",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I have it on good authority they probably won’t be continuing hybrids. Womp womp",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Same for me but my hopes are slipping because of Skagen outlook.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Seriously, their hybrids have been incredible for years. I really hope this isn't the end, just got a new one :(",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I love my Collider HR, but there is a big problem: if you don't run the Fossil app on a semi-regular basis, the watch will not give you notifications. You need to run the app every few days to \"refresh\" the connection, otherwise it \"forgets.\" People will be trying to get ahold of you, and you won't see any notifications until you actually look at your phone. I've owned several smartwatches, (Qualcomm Toq, Pebble, Fitbit) and I've never had a watch that did this.",
            "points": "",
            "children": [
              {
                "comment": "Never had this issue but I have a 1st gen? Maybe it's your Battery managment on your phone",
                "points": "",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I have similar issues. Sometimes all notifications will come in batches five or 10 minutes delayed. Sometimes not at all. Heart rate tracking in the graphs mostly doesn't work.\n\nFelt like after the app rebuild a year or two ago they just gave up on the hybrids.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "In a sea of black blobs with resin straps, the Fossil and Skagen models really stood out as genuinely fashionable smart watches, so this is a real a shame. But perhaps not that surprising seeing how bad they've been at supporting their models post release",
        "points": "363 points",
        "children": [
          {
            "comment": "They ought to just partner with Samsung and design their models",
            "points": "116 points",
            "children": [
              {
                "comment": "But why would Samsung want to just give money away?  They could simply hire the designers if they even care at all, but I don't know what share of the potential consumers in this market prioritize design over specs.  Clearly not enough to keep fossil in the game",
                "points": "35 points",
                "children": [
                  {
                    "comment": "Oh I'm betting there's a hefty market of folks that would like a nicer looking smartwatch. Even if they did one model that was \"designer\" per year. I dunno .. just a thought",
                    "points": "19 points",
                    "children": [
                      {
                        "comment": "I bought a Fossil because it looked a lot like a watch and not a toy on my wrist.",
                        "points": "6 points",
                        "children": [
                          {
                            "comment": "That's what I was trying to get at",
                            "points": "3 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "Same, and now the battery is fucked, it doesn't get support updates anymore, if I leave I can dead then it loses date/time and doesn't auto reconnect and somehow managed to lose my favourite colour of watch face.\n\nSo I'll go elsewhere.",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Because making less money partnering with fossil is better than making no money at all. Samsung has done this more than you think, look at all the things they put their screens in. Dell monitors, Apple iPhones, those have used Samsung OLED panels for awhile and those are 'competition'",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "They're a watch company, not a software company. Looks great, but they can't figure out support.",
            "points": "15 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Ain’t nothing more genuinely fashionable than my Apple Watch with its Snoopy watch face. 🧐🎩",
            "points": "9 points",
            "children": [
              {
                "comment": "My moms analog Mickey Mouse watch is still peak 90s mom-fashion.",
                "points": "18 points",
                "children": [
                  {
                    "comment": "But does your mom's mickey mouse watch tell her the time out loud? Because the mickey mouse watchface on my apple watch does haha! /s",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "My ma's used to play the Mickey Mouse Club theme on the hour.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I’ve rocked nothing but Mickey since day 1",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The problem is they made good looking watches made well but really sucked at the smart part.",
        "points": "45 points",
        "children": [
          {
            "comment": "Their hybrids were pretty good.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Isn't that Google's fault though?",
            "points": "4 points",
            "children": [
              {
                "comment": "sadly no, because pure android wear is great the pixel watch rocks. for some reason fossil did not want anyone to use pure android wear OS but a special sauce limited version and that is what makes any watch that is not running pure unadulterated wear OS suck.",
                "points": "11 points",
                "children": [
                  {
                    "comment": "Ahhh, okay. Thanks",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yeah I tried one a few years ago and hated it.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "A little sad to hear this, but not surprising.\n\nMy wife and I both were early adopters of Fossil smart watches. They looked great, but they were a little limited, software-wise, and the battery wasn't great. Still, we liked them for their looks.\n\nThen we switched to Samasung Active 2 watches, and we realized everything the Fossil watches were missing. We sold them both shortly after that, and I never looked back.\n\nI appreciate Fossil for embracing the smartwatch scene early on, but it's clear their hardware just wasn't competitive any more.\n\nGoodbye, Fossil smartwatches. Thanks for looking cool on my wrist for about 2 years.",
        "points": "145 points",
        "children": [
          {
            "comment": "Would love to get a Samsung smart watch but Samsung insists on keeping the large round watch face style to differentiate themselves from Apple. I find the round shape awkward and gets in the way of wrist movement. Found an inexpensive long rectangular sport watch that is comfortable and useful but it does not have full smart watch features. Wish Samsung would design a rectangular face watch.",
            "points": "2 points",
            "children": [
              {
                "comment": "Wish Samsung would design a rectangular face watch.\n\nYou're the first I've ever seen like the rectangular smart watches.\n\nI've heard that even Apple is looking at going away from it.",
                "points": "22 points",
                "children": [
                  {
                    "comment": "Yeah. I like round watches, and the rectangular design of the Apple Watch is one of the reasons why I own an iPhone, iPad, MacBook, AppleTV box, and AirPods, but not an Apple Watch.\n\nIf I’m spending more than $150 on a watch, it better not be embarrassing to wear outside of fitness and casual wear.",
                    "points": "9 points",
                    "children": [
                      {
                        "comment": "I'm not a watch guy or anything but damn I hate the look of Apples watches with a passion. I honestly value peoples opinion less if I see them wearing one at work, on dates etc.\n\nIn terms of style/accessories it's one the biggest turnoffs I know.",
                        "points": "-8 points",
                        "children": [
                          {
                            "comment": "I wear an Apple Watch on my right arm and sometimes a real watch on my left arm. Mostly I like it for the heart rate, blood oxygen and step counter. While probably not medically accurate, it’d good enough for me to track my progress in getting healthier after being diagnosed with heart failure.",
                            "points": "-1 points",
                            "children": [
                              {
                                "comment": "Mostly I like it for the heart rate, blood oxygen and step counter. While probably not medically accurate, it’d good enough for me to track my progress in getting healthier after being diagnosed with heart failure.\n\nHow is that related to how the square shape though? You get same in most smartwatches, many with 10-20 times more battery life even :)",
                                "points": "0 points",
                                "children": [
                                  {
                                    "comment": "The software integration was good enough for my needs. I know things like a garmin probably do a better job with some features. I got the watch on sale after the current generation watch was on the market so the price was right, at the time i needed to track the health.",
                                    "points": "1 point",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Same. Apple everything but a Garmin on my wrist. I can’t stand square watches.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "I’m looking into the garmin vivomove but it’s a little too minimalist for my taste.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "The flat edge sits better on my wrist is all plus the shape fits text better. No reason why different shapes can't be offered from either manufacturer.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "My favorite is they're claiming round watch face designs are clunky and terrible and get in the way of moving a wrist but a square-shaped one is infinitely more comfortable and sleek lol",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I find the round shape awkward and gets in the way of wrist movement.\n\nTotally makes sense...that's why 99% of watches ever sold have been in the shape of triangles and squares and octagons. Great comment all around lololol.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "People have different likes and wrist sizes. You probably have a big wrist and a big watch face works. My watch is a long thin rectangle and fits my small wrist better than a large clunky face is all. Jeeze, dude, not all of us have WWE body builds.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Samsung smartwatch used to be square prior to Apple watch existing\n\nthey also had a square curved watch",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "and the battery wasn't great.\n\nI love people like you complaining about a battery the size of a dime not being able to power a screen, wifi, bluetooth, phone calls and data, a whole slew of apps, heatlh data, the time, etc. for days or weeks each charge lol.\n\nI'm stoned and from Detroit - I shouldn't be the one pointing out the limitations of batteries to people on a regular basis lol.",
            "points": "-6 points",
            "children": [
              {
                "comment": "I can get about 14 days out of my watch if I don't track any activities (thus GPS isn't always running, etc). At least several days if I'm actively tracking every day.\n\nSo days or weeks is probably a reasonable expectation.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Which watch do you have?",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "The Amazefit Band 7 easily last 15 days on a single charge and that does notifications, fitness tracking, sleep tracking, and music controls in addition to tell time.\n\nI’m sure there’s some people that need to make calls or use apps on their wrist. But for me, I just need it to do those things and that’s it. I’ll sacrifice all the other features for not having to charge it every single day.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "TIL Fossil had smart watches.",
        "points": "55 points",
        "children": [
          {
            "comment": "They had since the introduction of the smart watch. One of the first brands to implement them",
            "points": "36 points",
            "children": [
              {
                "comment": "To be fair, I'm not a watch person. I haven't worn one in probably 20 years I got an apple watch for Christmas and wore it for a few months but got tired of it telling me to go stand while I was walking and almost invariably while I was taking a shit.",
                "points": "-9 points",
                "children": [
                  {
                    "comment": "You can turn those notifications off. The stand ones are particularly annoying.",
                    "points": "7 points",
                    "children": [
                      {
                        "comment": "I did but I also just put the watch in a drawer",
                        "points": "-3 points",
                        "children": [
                          {
                            "comment": "Well that’s that then. Lol",
                            "points": "10 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "They were my goto after Pebble. Not many other smart watch manufacturers really understand what makes a good watch.",
            "points": "8 points",
            "children": [
              {
                "comment": "RIP Pebble. So far ahead of your time.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "There has been nothing like Pebble ever since too. It just boggles my mind why all of these larger companies fail to produce anything close to Pebble's usefulness and practical utility. Fossil came close on some aspects. Garmin is probably where I'll end up next, they're just so damn expensive for what is still a limited feature set compared to what Pebble offered. But at least Garmin understands like Pebble did that the whole smart watch market isn't into OLED wrist computers that have to be recharged frequently. My Pebble Time is still working (Rebble has become more of a pain to keep going, though). I'm still getting at least 5 days on a charge, down from 14. But once it goes...man, it's going to suck finding a suitable replacement.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "It just boggles my mind why all of these larger companies fail to produce anything close to Pebble's usefulness and practical utility.\n\nPebble company actively goes bankrupt\n\n\"Wow, I wonder why companies didn't want to make a watch like Pebble.\"",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "hydrox company actively goes bankrupt\n\n\"wow, i wonder why companies are making the exact same cookie as hydrox.\"",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "\"Wow, I wonder why companies didn't want to make a watch like Pebble.\"\n\nThe problem wasn't the tech though...nor demand. The problem was a startup could not position itself in capital to transition to a larger tech company. They overspent on R&D and overextended on operating costs without the investments to back them up.\n\nAgain, it wasn't the watch...it's obvious anyone who has owned a Pebble love the hardware/software. It was the company that was poorly managed and then just sold off to Fitbit.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "And Fitbit didn't want to do what Pebble did either, even though they had more money at the time.\n\nLike, I completely get it. I was an OG Kickstarter backer and loved the watch, but clearly not enough people liked it for any company to want to replicate it.",
                                "points": "0 points",
                                "children": [
                                  {
                                    "comment": "but clearly not enough people liked it for any company to want to replicate it.\n\nI don't agree with that takeaway but understand where you're coming from/how you came to that conclusion. It's a conclusion that begins to fall apart however once you start looking at these watches objectively side by side. This guy did a good job doing just that: https://www.youtube.com/watch?v=Y4wO3jOdFTs\n\nIt's not that no one wanted the watch...it was that the tech was being produced by a startup company not everyone knew about. It didn't have the advertising/exposure that Fitbit/Samsung/etc would have. It didn't have the capital to come anywhere close to completing with the bigger established corporations. It therefore did not get the volume or production up to compete with those giants.\n\nFitbit hasn't done a Pebble equivalent simply because that was never on their roadmap to do, nor is it the market they wanted to compete on. Fitbit is chasing Apple's OLED/health monitoring offerings. Fitbit was also in a downward market trajectory from roughly $10bn evaluation in 2015 to now around $1.8bn. Chasing Apple was likely what they determined to be the least risky option.\n\nI think these smartwatch companies looking at Pebble and assuming there would less demand really do not know the watch market as a whole. That is what Pebble exceled at. It was a watch at its core, not a computer.",
                                    "points": "0 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I haven't owned a Fossil since around 1999ish? I didn't even know they still existed.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Never heard of them, read the headline and thought that Fossil was a new name for Boomers.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Shane. They were one of the few companies making Smart watches that don't look like an average rubber sports wearables.",
        "points": "24 points",
        "children": [
          {
            "comment": "Yes, real shane.",
            "points": "29 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Hi Shane",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "SHANE! Come back!!",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Ima tell u sum’n",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Garming is still solid though. They got models that people don't even realize are smartwatches.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "They should probably just pair up Samsung and make fossil licensed Samsung ones. Im on iPhone so I’d prefer that be an Apple partnership but obviously that would never happen lol",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I guess it will be quite an apt name when someone discovers one of these in a few years…",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m still salty Fossil took over Misfit a while back and killed off Shine devices. I would still be using mine if it was supported.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I never understood the appeal of a smart watch, so maybe someone here can help me. Isn't that screen ridiculously small? What do you do on these things?",
        "points": "7 points",
        "children": [
          {
            "comment": "As someone who works a physical job, walking for 14 hours a day. I love it as a fitness tracker, text message notification and playlist shuffling instead of pulling out your phone.\n\noh and they look cool, i guess.",
            "points": "14 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Personally, it’s offloaded a lot of idle doomscrolling just because I checked the time or weather on my phone. Since wearing one, my screen time had cut in half, if I’m trusting my phone’s metrics.\n\nThen there’s the health data. On a granular level, almost useless. Aggregated over months and years, though, it becomes a pretty valuable database that’s remarkably easy to parse (depending on what ecosystem you’re embedded into). It’s allowed me to become much more conscious about some bad habits I have and how they tangibly impact my health.\n\nSimple tools like calculators, timers, translators etc on my wrist are very convenient on an almost daily basis\n\nThey aren’t a watch as much as they’re an extension of the phone in your pocket. I love mine. Telling the time is the least interesting and practical thing it does.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Galaxy Watch 6 Classic user here who has used Apple Watches, tried out a Pixel watch, other Samsung watches, Fitbits, Garmins, Skagen, and a Pebble Time over the years.\n\nThere are a few cool use cases. One of the first is sleep and fitness tracking. Many have pretty accurate heart rate and other sensors so you can passively track your activity as you go about your life. Then, when it's time to exercise, you get GPS tracking of your routes as well as understanding your overall fitness. Very nice.\n\nNext is as a notifications manager. Instead of pulling out your phone every time, your watch allows you to screen and dismiss notifications as they come in. Handy.\n\nFinally, there is having Google Assistant right on your wrist. You can send messages, ask questions, and more anytime. Also good for answering phone calls when your phone is in the other room.\n\nYou're not going to be browsing Reddit or typing long emails on one. That's not what they're for. They are still very useful.",
            "points": "9 points",
            "children": [
              {
                "comment": "Thanks! That sounds pretty useful and gives me food for thought.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "If you’re an iPhone user, the Apple Watch SE is a great, relatively inexpensive, way to test the waters. Pixel and Samsung both have their corresponding watch lines and while I am less familiar, there should be a variety of other smart watches, generally compatible with Android.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "One thing to consider is whether your use case leans towards one that does the phone integration and apps better (Samsung/Apple) or an activity watch (e.g., Garmin Fenix).\n\nBoth are great for tracking and quickly checking a text.  Activity-focused watches are generally physical buttons only (no touch screen) so they handle water/sweaty hands better and have a longer battery life.  But more limited with apps and phone integration.\n\nI'm in the latter camp because I do a lot of remote trail running, paddle boarding, snowboarding, etc.\n\nBeing able to generate a course on Strava and send it to my watch is amazingly helpful to prevent me from getting lost.  It will warn me about turns and if I'm not certain about a fork in the trail I can look at the map without having to stop and pull out my phone.  It has helped me explore a lot of amazing places without getting lost. It's also very handy if I run in an unfamiliar city while traveling.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "This is something that doesn't get brought up in the discussion enough. I had to recently decide on a new watch since my series 6 wasn't lasting long enough during my hikes.\n\nI ended up getting a Garmin Instinct 2 because when I sat down and thought about it, I only really used my watch to check my notifications, the time, and fitness tracking.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "And then Garmin battery life is so much better than Apple's. I already have enough things I need to charge, I don't want to charge a watch every night.",
                            "points": "2 points",
                            "children": [
                              {
                                "comment": "That's the main reason I got mine. To be more specific I got the instinct 2x solar tactical. I forget the last time I charged it, I think two weeks ago, says I'm at 50% battery with 13 days remaining",
                                "points": "1 point",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I could take calls in my fossil, see text messages, fire up Google maps and navigate by walking, see what's next on my calendar, talk to my home automated through googled voice stuff (and anything else Google voice let's you do)\n\nThose were my common uses.\n\nYeah, it's a shame because fossil was the only smartwatch that (to me) looked nice.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Would you go back to Garmin, again? I was looking at their newer lines and I very much like their design.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "It's all about what you're looking for. I wore an Epix Gen 2 for most of last year and it was great for fitness tracking, running, etc, but I'm kind of a fat dude and only so interested. The Coach programs are pushing you to a goal - and always a bit too fast, and to exercise a bit too much.\n\nAdditionally, there are smartwatch things most Garmins are missing, particular a microphone and speaker. It's not a huge inconvenience for quick replying and such, but if having Assistant on your wrist or answering phone calls is appealing, then you have to get a Venu, and those aren't super competitive with Apple/Samsung/Pixel. They are also pricey.\n\nOn the other hand, the Epix gets a week battery with always on display and two weeks with raise to wake. My 6 Classic is good for about 36-48 hours. The Instinct line brings the G-Shock aesthetic with enough smarts for most people, and the MIP displays on Fenix watches are great when you get used to them. Garmin is very much its own world, and if that works for you, particularly if you're a runner or climber, go for it.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I pay absolutely everything with my watch, from groceries to the different transport methods. I can leave my wallet and even phone at home.",
            "points": "2 points",
            "children": [
              {
                "comment": "Yeah, okay. That's basically impossible here in Germany. I'm quite happy that it's finally more or less possible to pay everywhere with a card. Only a few \"cash only\" holdouts left.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Oh yeah, I saw in an Apple forum once that Germany still had a ton of places that took just cash!",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "99.999999% of places in the US still take cash too",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Cash and card or just cash? Because we are talking here about places that take just cash.",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "My bad.\n\n0.0000001% of places are cash only",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I run, swim, and go on walks (not hikes), often. I don’t like to carry my big phone on those instances so it’s nice to have a watch tracking my activity, having cellular in case I need to call someone, and controlling my earbuds.\n\nSmart watches aren’t for everyone. But they’re for a lot of people.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I don't get them either. My preference is a semi smart watch like the Pebble. Great battery life, always on display which is easy as fuck to read in sunlight and gives me the exact things I need, notifications and easy music controls. I don't give a shit about the fitness stuff and they really didn't either, those are kind of extra side features they tried to add but wasn't very good, I mean it's decent but not great. I'm still wearing mine and have a few I need to fix up with mew batteries and fix the vibrator on my P2",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "See who just texted me so I don't have to pull my phone out of my pocket. See the temperature outside at a quick glance. That's about it for me but seeing notifications is really useful. I have a fossil hybrid. I tried a galaxy watch for a while but grew to really dislike it. I just don't like wearing a screen on my wrist. The hybrid e-ink display doesn't feel like wearing a screen and it has real hands and looks nice.",
            "points": "1 point",
            "children": [
              {
                "comment": "Oh and I use the timer on it all the time too. Very handy.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I guess that it is because it can measure health things and make easier to look for notifications from the phone without the need to actually looking at the phone.\n\nBut I’m an analog watch guy so I can’t tell for sure.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I have a Garmin so the battery lasts about 10 days and it has all sorts of sensors and cool shit like a compass as well as tell me when a bus will be arriving at the current stop and has GPS independent of the phone so if my phone is dead i can still find a train station. (has saved me before)\n\nMostly tho i use it to show me notifications that have appeared on my phone that is in the bottom of a pocket. vvttt glance at watch. Oh it's a work email i can safely ignore while i'm on my bike.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Ironically, my last analog watch was a Fossil. It was really a nice watch. I never looked back when the OG Apple Watch came out.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hmmm expensive smartwatches with mediocre support. I wonder what went wrong 😑",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Will they continue to have watches the size of dinner plates tho?\n\nI've liked some of their designs but as a male with wrists like a baby bird's neck i can't wear them without looking like i've accidentally strapped myself to a manhole cover.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And nothing of value was lost. Their post release support was always trash.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Their build quality was absolute ass. Good.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Battery life is the primary reason I switched from an Apple Watch to my Garmin Instinct Crossover solar. It’s great for my needs which are primarily a fitness tracker with notifications. However, most people think it’s a Casio watch and that it is “cheap and ugly”. On the upside for me, I have charged it once when I first bought it and never again as the solar works as advertised even with sensors and GPS on a lot of the time.\n\nI don’t exactly have a high opinion of Fossil as their whole deal was cheap “fast fashion” stuff, but it sucks to see another non-rectangle approach to smartwatch leave the market.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You just can’t beat the Apple Watch",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "How about just get out of the watch business? They're garbage.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I had a smart watch for years, i threw it away.. never seen the upside. Switched back to a old fashioned automatic and never been happier..",
        "points": "-1 points",
        "children": [
          {
            "comment": "Have you considered hybrid smartwatches.",
            "points": "2 points",
            "children": [
              {
                "comment": "No because i wanted less digital warnings in my life.. i found that a watch for me should show the time not how many missed calls i have or push notifications about trump or whatever… i never understood for people to have the need to be realtime updated about everything",
                "points": "-6 points",
                "children": [
                  {
                    "comment": "I don’t care about the updates.\n\nThe only features I really use on my hybrid watch is an alarm that vibrates your wrist instead of waking up the whole house, the fitness tracking, and the both hands moving to #1 tells me someone close to me is calling me.\n\nIt’s a coin battery replaced twice a year.\n\nAnd because it doesn’t have a screen, I can wear it confidently in any setting.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I just did this. It's too fiddly and annoying to use, and I have a phone in my pocket anyway. You might say \"you can tell time with your phone too\", and yeah, that's true... but I preferred to use my phone for all the \"smart\" functionality despite having to get it out of my pocket, so having a smartwatch seemed pointless to me. A watch is still a fashion accessory, and I don't prefer to tell time on my phone with one on so it still serves a function.",
            "points": "0 points",
            "children": [
              {
                "comment": "Exactly, i use my phone for email calling and whatsapp and reddit ofcourse but that’s it and during the day i hardly use it for anything except businesscalls.. i wanted to reduce screen time and put my time in things i value more.. buying a automatic watch for me was the best thing ever, it never runs out of battery, it tells the time and it reduced screentime on my phone because when you’re checking on time might aswel check email and messages",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "They probably dont have the technical know how or access to equipment to make a samsung competitor (at any profit) per unit.\n\nThey dont get any other subscription funds either to support.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Never heard of them",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Huawei is the reason. My brother's $40 smartwatch works great 5 years later, still get regular updates.",
        "points": "-13 points",
        "children": [
          {
            "comment": "Xiaomi watches are also great. I got band 3 in 2018, oled screen, 25$ then from aliexpress, still perfect. Incredible value and no fake obsolescence or creation of premature e-waste as it seems it can go strong at least 5 more years.",
            "points": "-4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "They should also get out of the watch business while they’re at it.",
        "points": "-4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "TIL people still wear smartwatches, wild.",
        "points": "-6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Are we surprised? Fossil is a marketing company that happens to make accurate (lol ha!) quartz watches marketed as Rolex-quality for $400, whose founders later developed Shinola (where the big S stands for shit or scam).",
        "points": "-6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Tbh good. Fossil makes good budget watches, quartz and mechanical. The only similarities between those and smart watches are the form factor. Phone companies are more suited for making them with profit in mind.",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Who?",
        "points": "-34 points",
        "children": [
          {
            "comment": "Fossil have been making some cool looking and very reasonably priced watches for a long time. I think I read that they make the internals for a lot of designer brand watches as well. Their smart watches couldn't really compete with bigger players though, particularly not while maintaining their reasonable price point.",
            "points": "10 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "In my opinion—which you may agree or disagree with—the proper way to make these \"Who\" comments is:\n\n\"If anyone else was wondering what Fossil is, then I googled it and apparently it's..\" etc.\n\nLike.. By actually contributing to the discussion!",
            "points": "10 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It’s so funny when people “who” incredibly well known global brands or public figures. It adds nothing of value and only tells everyone else you’re clueless",
            "points": "9 points",
            "children": [
              {
                "comment": "There are 2 models available in best buy Canada stores rn. Zero user reviews on either of them.",
                "points": "-17 points",
                "children": [
                  {
                    "comment": "The point is they're actually a well-known company and instead of looking them up to see what the big deal is, you burped out a comment on Reddit that makes you look snarky and dumb.\n\nNext time actually fire up a search engine and learn something. I do it all the time, very illuminating.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Just from googling they have over close to a hundred Fossil outlets in Canada ….",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "BB is a wasteland these days, a shell of its previous self. This is your metric?",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Why does their failure to produce a competitive product with effective advertising make me clueless?",
                "points": "-23 points",
                "children": [
                  {
                    "comment": "Their failure to blah blah doesn’t make you clueless. You signalled you were clueless by whoing. You who’d a well known watchmaker. What do you want us to say",
                    "points": "8 points",
                    "children": [
                      {
                        "comment": "This post has 8 upvotes after an hour with 22m subscribers to this subreddit. They were not well known smartwatch makers.",
                        "points": "-9 points",
                        "children": [
                          {
                            "comment": "lmao",
                            "points": "4 points",
                            "children": [
                              {
                                "comment": "You do know fossil makes accessories, not just smartwatches, right?",
                                "points": "-1 points",
                                "children": [
                                  {
                                    "comment": "You still turned into a barn owl over a global well known brand mate. Stop slip and sliding and take the L. Have a nice day",
                                    "points": "9 points",
                                    "children": [
                                      {
                                        "comment": "The only ones taking the L are fossil lol",
                                        "points": "-3 points",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Who?",
        "points": "-23 points",
        "children": [
          {
            "comment": "Mike Jones.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I considered the Fossil Gen 6 because I wanted to get away from Xiaomi. Although the Xiaomi S1 is a very good smartwatch overall, it had trouble connecting with some apps I liked. The Fossil models look cool, but then I read some user reviews and thought uh-oh. So for me no surprise here.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In years to come they will be antiques and not long after that fossils again",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "dang i bought one for my dad last father's day, wanted to get him a smartwatch from a known brand with decent ecosystem support like wearOS (or i should've at least done my research)\n\nwonder how support's gonna be like in the coming years tho",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "TIL Fossil makes (made) smart watches.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have one from the holidays 2022 and I hate it. Functionality is crap, feels like there's bloatware from fossil interfering.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The “hybrid” watch is really a niche so it’s not surprising. If I’m doing sports, I want something like an Apple Watch or a Garmin. Whereas if I’m going out, I’d much rather wear a classic watch that looks good and doesn’t annoy me with notifications.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That's a shame. I recently bought a Gen 6 hybrid, and it does the job just fine for me. Love the two week battery life.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just curious - what are the best smart watch alternatives to apple?",
        "points": "0 points",
        "children": [
          {
            "comment": "Depends on your needs.\n\nFor hybrid smartwatches, Withings and Garmin have some decent options.\n\nFor Samsungs, Samsung’s watch.\n\nFor other androids, pixel watch.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I had three different Android watches, a Motorola around 2015, fossil in 2019, and Samsung in 2021. In all honesty the completely different ecosystems and OS with all of these Android watches, it's such a mixed bag, but I do remember fossil being one of the glitchiest and shortest battery life, with it looking the best in my opinion",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No surprise. But a real shame.\n\nI have a Hybrid, but I've had to get it replaced twice because the screen just fades after a while. I love how it looks, functions etc. But they just seem to naturally become unreadable after a while.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’ve had about 10 of their smartwatches and the latest ones were easily the best. I have a latest gen fossil and a latest gen skagen, and a latest gen hybrid (I received the the fossil as a replacement for a repair they couldn’t make and the hybrid as a gift). I like all three, but last year received a pixel 2 when I finally upgraded my phone. It’s pretty good too. However, I have found I can live without the smart features and have gone back to wearing a 10 year old citizen eco drive or a Casio digital daily. I love watches…it’s a character flaw",
        "points": "0 points",
        "children": [
          {
            "comment": "I can totally relate - I regularly rotate between my Apple Ultra (decided to keep it as long as it survives - no upgrades), and a collection of Citizen, Seiko, Orient, and Skagen watches… love the feel of “retro” watches.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "TIL Fossil made smart watches",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Pity, I really liked their designs.\n\nMy current watch is Skagen Gen 6 which is still under Fossil and the previous one was Fossil Gen 5.\nAesthetic wise, these 2 brands are my favorite.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ac7dmg",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://newatlas.com/wearables/exom-up-armored-exoskeleton/",
    "title": "ExoM armored exoskeleton takes a load off – and stops bullets, too",
    "points": null,
    "comments": [
      {
        "comment": "Coming to a police station near you!",
        "points": "255 points",
        "children": [
          {
            "comment": "Cant wait to get pulled over for not coming to a full stop by a dude in one of these.",
            "points": "79 points",
            "children": [
              {
                "comment": "They will change their punisher decals to Robocop ones.",
                "points": "56 points",
                "children": [
                  {
                    "comment": "YOU HAVE 30 SECONDS TO COMPLY, haha, just joking, Pew Pew.",
                    "points": "36 points",
                    "children": [
                      {
                        "comment": "“I was fearful for my life” -armored cop",
                        "points": "28 points",
                        "children": [
                          {
                            "comment": "“service guarantees citizenship! would you like to know more?”",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Funny that you think they would only shoot two bullets\n\nPew pew pew pew pew pew pew pew pew pew pew pew pew pew pew Got em",
                        "points": "10 points",
                        "children": [
                          {
                            "comment": "new officer arrives on scene\n\nPew pew pew pew pew pew Pew pew pew pew pew pew\n\nNo, I got em",
                            "points": "3 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "20",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Judge Dredd\n\nHOW DO YOU PLEAD!",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Your move, creep.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "“Your prostate is arasaka property, I’ll be taking it back now.”",
                "points": "11 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "In NYC, you can blow stop signs and red lights all you want and never, ever get pulled over. I haven't seen NYPD pull over ANY traffic violators in about 3 years.\n\nAnd the fat cops don't need bulletproof exoskeletons, they already have them. The bullet proofed cruisers they never leave.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "Are the cars really bulletproof?",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Shit he's got juggernaut equipped",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "This will be used more typically for crushing dissent but you never know what Officer Friendly will be wearing when he pulls you over.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "-but what did I do officer?\n\n-STOP RECORDING ME AND GET OUT OF YOUR CAR!",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Great, I can't wait to get taken in by Master Chief.",
            "points": "5 points",
            "children": [
              {
                "comment": "Spartans original mission was to suppress the population. So it wouldn’t be too far off.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Coming to a US school/mall/synagogue near you!",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "“To better serve the community!”",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "on the bright side, i suspect like 60% of the cops wouldn't be able to squeeze themselves into one of these suites",
        "points": "72 points",
        "children": [
          {
            "comment": "They will come adapted to the US market: in XXXL size.",
            "points": "21 points",
            "children": [
              {
                "comment": "Okay so they’ve got the smaller cops covered but what about the “BIG” ones?",
                "points": "5 points",
                "children": [
                  {
                    "comment": "The BIG ones have an ego which will protect them.",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Donut version",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Depends on if your in Oakland were all the police jacked-up roid-filled PTSD-ridden Iraq war vets with an intense and soul-devouring blood lost for “disruptive” minorities.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Wearing this to a school",
        "points": "44 points",
        "children": [
          {
            "comment": "“Only way to stop school shooters with power armor is if we arm all students with power armor”. Greg Abbott in 5 years.",
            "points": "22 points",
            "children": [
              {
                "comment": "You’re telling me I missed out on school district issued power armor? Ridiculous",
                "points": "7 points",
                "children": [
                  {
                    "comment": "“A Glock in every desk isn’t enough to stop school shootings. Every teacher needs an armored exoskeleton.”",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Fallout power armour :)",
        "points": "68 points",
        "children": [
          {
            "comment": "Combat Armour mk1",
            "points": "27 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Not even, it doesn't have any actuators. It's a passive system.",
            "points": "16 points",
            "children": [
              {
                "comment": "The chassis with no fusion core",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "How does it fair against grizzly bears?",
        "points": "19 points",
        "children": [
          {
            "comment": "I am going to need to see this guy get hit by a truck at full speed before I am convinced.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Not sure, let’s test it out",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I wonder if a civilian version of the suit could help the people with muscle problems.",
        "points": "7 points",
        "children": [
          {
            "comment": "I think it would not help very much if you have trouble moving yourself. What it is doing is reducing the load you are carrying,  including the weight of the exoskeleton.  So if I'm am a soldier carrying 100 lbs of gear, I've got 100 lbs to carry. But if I'm a soldier with a 100 lbs exoskeleton and 100 lbs of gear, I'm carrying only 60 lbs (.3 x 200) and I'm now bullet resistant!\n\nBut in either case I'm still moving myself if I'm using an unpowered exoskeleton.",
            "points": "2 points",
            "children": [
              {
                "comment": "I was more interested in that load bearing figure. So Im a 170 pound soldier carrying a 100 pound skeleton+armor and a ruck plus weapon of another 100 pounds. Even if I’m only ‘supporting’ 60 pounds of that weight at rest that doesn’t translate directly to the load I’m pushing right? That plus mass is still turning me into a bull in a china shop.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Not an expert but I think you are right! I remember watching a video about a similar unpowered exoskeleton for overhead drywall work, actually, and iirc the wearer was shocked at how her arms could shoot up if she reached up, since it was designed to support overhead tool use constantly.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Civilian versions are available in some workplaces to help older workers cope or allow younger ones to move faster or deal with heavier loads.\n\nBoth manual and battery powered versions.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Halo Spartan by any other name would be just as sweet.",
        "points": "19 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'd buy that for a dollar.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "[deleted]",
        "points": "4 points",
        "children": [
          {
            "comment": "Nah that blast shield isn’t lvl 4",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Who’s the “we” here? I’m not cool with attacking officers. You’re out in the wild attempting to stop cops from doing their job on the daily? What were you using to “stop cops” before you needed bombs? What the hell are you attempting to say?",
            "points": "-10 points",
            "children": [
              {
                "comment": "okay spergo calm down nobody’s gonna bomb ur lame ass uncle today",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Fire",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Tom Cruise would love it!!\n\nLive. Die. Repeat.",
        "points": "6 points",
        "children": [
          {
            "comment": "On your feet, maggot!",
            "points": "5 points",
            "children": [
              {
                "comment": "They are developing a sequel!!\n\nThis movie could be the one that surprised me the most in a long time w how fucking good it was.\n\nGotta love watching Tom die again and again.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "I'm not sure how another film would work. Unless it's about how Emily Blunt's character became the Angel of Verdun.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Needs larger pauldrons.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s 120 F in the desert and the cop pulls you over. ‘Just a sec while I look for my insurance…’.",
        "points": "2 points",
        "children": [
          {
            "comment": "From the looks of things it looks like it’s designed predominantly for close quarters or subterranean warfare which has become increasingly more common due to modern technologies making fighting on the surface less and less desirable. Seems like it would be pretty good for raids against terrorist safe-houses or security details. I can’t see something this big and bulky as well as expensive being standard issue and would instead see more use in specialized scenarios.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "But does it have an energy shield and sentient AI so that we can fight off the Covenant???",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is simply bulletproof armour. It has no power and adds no other capability. As an exoskeleton I was hoping for something that added functionality.",
        "points": "19 points",
        "children": [
          {
            "comment": "It clearly mentions it is load-reducing. If you watch their video you can see the exoskeleton underneath the body armour panels.",
            "points": "39 points",
            "children": [
              {
                "comment": "I think load reducing is just load distribution. The exoskeleton is work by the user who carrier the full load - no?",
                "points": "0 points",
                "children": [
                  {
                    "comment": "No.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "No it reduces effective load. Like you're wearing 100lbs worth of stuff but when standing still you only feel like you're wearing 60lbs. It's not power armor though so no crushing concrete or super jumps. Technically you could call it load distribution but since it's distributing that weight directly into the ground that's not a very good description.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "[deleted]",
            "points": "8 points",
            "children": [
              {
                "comment": "Big guns are better for winning fights but big guns are too heavy. Powered armour lets you carry heavier things.",
                "points": "8 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Lifting huge loads, opening doors, jumping to a large height, traveling at high speed.. there are many combat advantages to an exo with actuators.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "And as soon as it exceeds the ability of your tendons, ligaments, and spinal discs to react, you just ragdolled yourself inside a metal suit.\n\nThere some use cases for a suit like this, but not the fantasy stuff most people are imagining.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Obviously you’d be stuck against the G force limitations of the human body. Combat is a likely lower priority use case. If walkers have combat advantage they would pull the meatbag out and do VR/AR/AI remote/local conrol. Warehouse, assembly and inspection workers will likely use exos en masse first.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "hammertech has entered the chat",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "You need to play more post apocalyptic games",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "But if both combatants have power armor which both stops bullets...",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Tank fights happen, so yes?",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Then you need to add retractable blades in the power armor with the ability to pierce the other one off course!",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Chainswords are the next logical step, brother.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Or perhaps a new weapon. One that fires mass reactive self propelled rounds brother. Perhaps with a large open bolt system?",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Cowabunga it is.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "That’s some inside the box thinking there",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Carry big guns and stop small bullets?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It has a mechanical balance system like a steadi cam that compensates for the weight of the armor and possibly weapons system.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It’s a platform for further development. Don’t worry - there will be cops in “mech suits” to keep your kids in line when they protest.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "99% range of motion. You can jog in it, and it stops AK rounds at 10 meters.\n\nThis is more than simply armour",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "What happens when that guy needs to take a dump?",
        "points": "1 point",
        "children": [
          {
            "comment": "Robodump.",
            "points": "2 points",
            "children": [
              {
                "comment": "Strike me down if older me tries to pretend this isn’t funny.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Comes equipped with exo-diapers",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "<image>",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Warhammer 40K vibes on this.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Makes an armor to stop bullets. Well looks like it’s time to make money on bullets that can penetrate this armor.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can’t wait for the high school graduate to be wearing this when he pulls me over for going 4 miles over the limit!",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hey honey new school uniforms just dropped",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I want to work on something like this 🥺🥺🥺",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The US will certainly allow these for civilians and soon we’ll have bulletproof mass shooters :(",
        "points": "-4 points",
        "children": [
          {
            "comment": "I mean in a country where people get killed with guns, taking away protective armor isn’t the smartest idea…",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Well obviously we would sell Javelins to the public. Its right in the constitution after all.\n\n/s",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You don't need an exoskeleton to wear lots of armor. See: North Hollywood Shootout.",
            "points": "1 point",
            "children": [
              {
                "comment": "Yeah watch those dudes as they struggle to walk in the armour. Picture of they were able to sprint in it",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Did they design this after halo?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Fire gonna be lit",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Tarkov Giga-Chad Lord",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Does it tickle my pickle while I'm killin'??",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "it can stop bullets and make u come? nice",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Now we need to paint them in super bright colors and add ridiculously huge Pauldrons. I already feel like I live in A hive city.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "average American high school uniform",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That shit gonna be hot in the summer.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So the suit DOES do it",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Kinda wonder if just using an Up Armored Riot Shield mounted to a motorized Steady Cam Arm wouldn't do a better job? 🤔 Even the heaviest impacts ( assuming they don't penetrate ) wouldn't affect you due to the Arm's Kinematic absorbing the hits 🤨\n\nJa kno' going full Roman Legionnaire Style but modernized?\n\nIf you have to hightail it the push of a button could release you from the majority weight which you definitely can't do with that Exo getup.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "First this, then thunder warriors, then full blown astartes, about 30,000 years ahead of schedule",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Queue Gregorian chants with heavy metal guitar riffs",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can’t wait for a policemen to be wearing this whilst he rips my spine out of my body for not respecting his roid-rage-filled authority at a routine traffic stop. Its gonna be great!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Where do I get that crotch shield?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Please say they are WiFi enabled.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Doesn’t matter, cops still won’t confront an active shooter lol",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So they’re making N7 Specter armor now? Sheppard would be proud",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ripley wants one.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "New school uniform",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "More tools of death. So excited. /s",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ac5b4n",
    "subreddit": "u/lazyturtlegames",
    "dataType": "link",
    "dataUrl": "https://store.steampowered.com/app/2797220/Necroforge",
    "title": "Unleash your dark side in this Hexen and Heretic inspired game! Wishlist now on Steam!",
    "points": null,
    "comments": []
  }
]