[
  {
    "id": "t3_1acilx0",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "/r/Futurology/comments/1acilx0/social_media_has_failed_the_number_one/",
    "title": "Social media has failed the number one requirement of technology. It’s slowing and reversing human productivity.",
    "points": null,
    "comments": [
      {
        "comment": "Who decides to make the idiotic claim that technologies are required to increase productivity?\n\nAny game or toy created 'fails' this 'requirement'\n\nTechnology doesn't have to make people more productive.\n\nAnd anyways, social media Has made people disseminate information far faster than it was previously does. So even by the argument of 'failed to make people productive' the argument falls apart. Social media has massively increased our productivity to pass on our opinions to others and to hear what others think across the world. That is productivity in its own right, just not one the OP thinks is important.",
        "points": "",
        "children": [
          {
            "comment": "Good points. I'd argue games and toys are more productive than social media however. You interact with people in 3d environments and have to achieve objectives. The very game is producinf entertainment. Social aside from clout chasing is in a 2d environment which is boring and not fun",
            "points": "",
            "children": [
              {
                "comment": "I think it be a mistake to only acknowledge the positives of gaming, while only acknowledging the negatives with social media. The reality like anything is it's not just black and white.",
                "points": "",
                "children": [
                  {
                    "comment": "Jeez man of course it's a mistake. It's also a mistake to even engage with you. Way to draw conclusions with my short comment. Video games are more productive than social media\n\nThat isn't to say video games have nothing wrong with them jfc dude",
                    "points": "",
                    "children": [
                      {
                        "comment": "This was a bit of an overreaction",
                        "points": "",
                        "children": [
                          {
                            "comment": "This is too. Totally didn't need to be said",
                            "points": "",
                            "children": [
                              {
                                "comment": "Mine was an observation and including no emotions or swear words. You seem extra sensitive.",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Social media has negative effects, absolutely, there's no doubt about that - but to say that's the reason there isn't enough housing is absolutely ignorant. It's not like Blackrock owns the MAJORITY of real estate and real estate-adjacent investments. Wait...\n\nhttps://bestrealestatemarket.com/real-estate-does-blackrock-own/#:~:text=Does%20BlackRock%20own%20a%20lot,commercial%2C%20industrial%2C%20and%20retail.\n\nMore houses would literally make them lose money, so everyone else gets fucked.\n\nPeople aren't incentivized to work anymore because our lives are not incentivized by our own government.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not just under 30. Eyes are glued to moving pictures. Addicted to stimuli. Immersed in other people's lives and neglecting their own.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I agree that it's harming us. The problem may be that the number one requirement of technology (for it to become and stay mainstream) is in reality to earn investors money.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Plenty of people are still doing manual labor jobs, but I don’t understand why you think manual labor is sort of gauge to determine if a job is good for someone or not. Most manual labor jobs are just tedious repetitive tasks that a person does over and over throughout their shift. You seem to think you’re not working a real job unless you’re a burly construction worker or something. Some people find enjoyment in those types of jobs, but most don’t. Moving away from strenuous manual labor is a good thing not a bad thing. Regardless about how you feel about what type of job a person has, the housing market has inflated the prices of homes to the point that someone working full time at a reasonable salary will not be able to afford a home on their own. It has nothing to do with a person’s lack of motivation to work. People shouldn’t have to be required to have high paying jobs and work their life away just to afford a basic home. This is the fault of the housing market, inflation, and zoning laws., and has nothing to do with people being lazy and addicted to social media. People who say they enjoy working hard and wasting their lives with manual labor have been brainwashed into thinking that this is something to be proud of and they are in denial and trying to compensate for the fact that that life is being consumed by work.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You think these companies care about making the world better? You're the product, they want your money. The system is not flawed, it's working perfectly as intended. Why do you think psychologists are in demand in tech? You're the rube, sorry.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "People said similar things about the home air conditioner unit. Things change. We progress with time. Call it evolution or extreme adaptability. It is what it is.",
        "points": "",
        "children": [
          {
            "comment": "What did people say about ACs?",
            "points": "",
            "children": [
              {
                "comment": "It destroyed the social aspect of society. Since people didnt have come outside to cool down , they could just stay inside and watch tv all day.\n\nSo the huge community social events started to decrease. Such as sitting on the porch enjoying a coom beverage while communicating with neighbors etc etc",
                "points": "",
                "children": [
                  {
                    "comment": "Sitting on the porch isn't concerned with productivity tho. The social aspect of society may be but I feel like putting AC in warehouses and such increases productivity. However, I'm curious how that's EXACTLY what is being said about social media.\n\nIt's quite a different sentiment by the looks of it, at least according to you.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This is so cringe wow 💀\n\nyes it must be the dang tiktok. That's why the youths aren't popping out babies and having families. You know, the \"correct\" way to live 🤮. They're too busy on their phones to procreate, yes 🤡 Obviously you're not valid if you don't have children, of course. What else is the point of your existence? /s\n\nImagine blaming this on social media and not the oppression of capitalism and how megacorporations are literally holding the housing market hostage for profit. The issues isn't a lack of homes in existence. It's a lack of ability to afford the prices being demanded for them, especially relative to the wages being paid vs the buying power those wages afford that don't keep up with those costs. Should we talk about the wealth distribution? Systemic wage theft?\n\nVery out of touch 🤡 the world is not what it was 50 years ago sorry. Productivity and progress just look different, maybe not recognizable to you. But science and technological advancements are happening. Things are getting done. Maybe just not the traditional things you identify with.",
        "points": "",
        "children": [
          {
            "comment": "Bro wot? The point is it's holding humanity back not a particular generation.",
            "points": "",
            "children": [
              {
                "comment": "A. That's makes no sense at all unless you have some limited view of what counts as progress. and B. They specifically said under 30 and this group complains about the inability to afford homes which is a common dig at millennials and zoomers (because they're the ones most effected by it while it basically didn't effect generations older than that because the housing market and economy weren't in the gutter.) Who else would they be referring to? The GenX under 30?",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It’s all genZ’s fault. Majority of Genz are so damned lazy.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s recycling for some people. And pollution. And resource misuse. And pollution or using chemicals. Not that the job is physical or a challenge.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If all technology must, by definition, increase efficiency, then most kitchens are filled with items that do not qualify",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1accz4k",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://qz.com/ipcc-report-on-climate-change-meat-industry-1850261179",
    "title": "The meat industry blocked the IPCC’s attempt to recommend a plant-based diet [March, 2023]",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/James_Fortis:\n\nMichael Thomas outlined the shift in wording driven by Brazil and Argentina, countries with large and influential beef industries.\n\nAs Thomas points out, the IPCC report’s authors initially recommended a shift to plant-based diets, stating that\n\n\"plant-based diets can reduce GHG emissions by up to 50% compared to the average emission-intensive Western diet, according to a draft leaked by Scientist Rebellion.\"\n\nIn the published report, the line was changed to\n\n\"balanced, sustainable healthy diets acknowledging nutritional needs,\"\n\nskirting a direct mention of beef and dairy, what a sustainable diet actually looks like, or any reference to the Western and largely wealthy countries that should most urgently start eating less meat.\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1accz4k/the_meat_industry_blocked_the_ipccs_attempt_to/kjtbdpd/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Of course they did. We need to get rid of lobbyists. Period.",
        "points": "",
        "children": [
          {
            "comment": "I'm not even religious but a dark and fiery place awaits corporate lobbyists",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I am no vegetarian by any means But I used to put on corporate events for all sorts of entities.\n\nThe Cattleman's association of America came to the Phoenix Convention Center and I vividly remember them saying how they need to convince to youth to eat meat 3x a day.\n\n1.) Uhm they already do? 2.) You don't need me at 3x a day. I'm no dietician but Id just get burnt out on nothing but meat NGL",
        "points": "33 points",
        "children": [
          {
            "comment": "I’m at a point where I think eating 3x a day isn’t really necessary, especially after your growth years.",
            "points": "6 points",
            "children": [
              {
                "comment": "It never has been needed. That's what the article is about.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Who is eating meat 3x a day",
            "points": "",
            "children": [
              {
                "comment": "Plenty of people man. I mean in my life I would frequently eat meat at each meal, not so much anymore\n\nBut it was like bacon and eggs Turkey sandwich and then tacos for din",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The global beef industry is worth almost half a trillion dollars a year? WTF?? No wonder there's so much astroturfing on social media about it. All of those pro-level check out muh roast beef pics on reddit look so suspicious now.",
        "points": "67 points",
        "children": [
          {
            "comment": "It truly is mind-blowing. Talk about power to control the narrative. I can't imagine how different the messaging would be without such an influence.",
            "points": "19 points",
            "children": [
              {
                "comment": "I always wondered why simple, cheap, and effective measures like a carbon equivalent ratings on food packages (proven to have a significant impact on spending habits), can never get accomplished. The media hardly ever mentions it. It would be so quick and easy compared to other climate policies, is massively popular with the public, and is a tenant of capitalism (let the consumer decide). We could do it in a year.",
                "points": "18 points",
                "children": [
                  {
                    "comment": "This is a fantastic idea! I work in the renewable energies industry and some of our customers have also expressed interest on such a carbon equivalent label on product packages.",
                    "points": "9 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Uh, are you sure it's half a trillion, and not more? Half a trillion for a world wide industry is actually on the low side. I would not be surprised that it's higher than this. For example, the market for consultant allocation (not consultation itself) is 5.6 trillion a year. I would expect something that is as widespread as a major food source to be more than that relative niche market.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Steak is super good. So are chick peas. We eat vegetation qualifying meals a few times a week, nothing wrong it.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "No it's called most people are just normal, and like sharing pictures of their food.",
            "points": "-4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "That’s surprisingly low. Really shows you how much of a luxury it is to eat meat on a daily basis.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "vegetarians and non meat eaters produce weak and brittle offspring. It's a good thing they are blocking this. The less leaf eaters the better. We need a strong society that doesn't rely on soy and chickpeas to survive.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "That simply raises doubts about the report's overall credibility. How am I supposed to believe a word of it if anyone with money can just cut and change the parts?",
        "points": "23 points",
        "children": [
          {
            "comment": "It is there but in a foot note",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The report is set up by people with a lot of money in the first place, why believe them?\n\nEveryone can found a foundation that says what he wants. Not just because an organization says something it's necessarily true.",
            "points": "0 points",
            "children": [
              {
                "comment": "I still trust the ipcc more or less. They’re pretty honest with the dire situation we are in, just iffy on solutions thanks to billion dollar companies with lots to lose.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Canada was going to leave dairy out of the updated nutrition guides, but the dairy farmers put up a stink (understandably), so now it's in again.\n\nI wouldn't follow anything 'recommended' anymore.",
        "points": "18 points",
        "children": [
          {
            "comment": "Anymore? The food pyramid was a scam from the get-go.",
            "points": "6 points",
            "children": [
              {
                "comment": "I remember learning the food pyramid in my younger years. I didn't necessarily think it was a scam, but a reflection of a time when we didn't have as good an understanding of nutrition. But that's my younger self's memories. You're probably right that it was influenced AF by industry",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Where's your evidence? The fact is, only a minuscule portion of the population actually adheres to food pyramids, and guess what? They're way healthier than those who don't. Your remark is nothing short of ignorant, especially for someone in the Futurology subreddit.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "My approach is to find where the money is coming from, and assume a bias in that direction. If the nutritional bodies are recommending more fiber, it's likely not because Big Broccoli is lobbying them.",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I love this because if you don't like it, you can simply not be a part of it. And that is, to not eat meat.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If meat prices continue to skyrocket there won't be anything the meat industry can do to keep people from self-selecting non-meat alternatives. I can't be the only person who's swapped a couple of weekly meals to vegetable ones to save money.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Michael Thomas outlined the shift in wording driven by Brazil and Argentina, countries with large and influential beef industries.\n\nAs Thomas points out, the IPCC report’s authors initially recommended a shift to plant-based diets, stating that\n\n\"plant-based diets can reduce GHG emissions by up to 50% compared to the average emission-intensive Western diet, according to a draft leaked by Scientist Rebellion.\"\n\nIn the published report, the line was changed to\n\n\"balanced, sustainable healthy diets acknowledging nutritional needs,\"\n\nskirting a direct mention of beef and dairy, what a sustainable diet actually looks like, or any reference to the Western and largely wealthy countries that should most urgently start eating less meat.",
        "points": "11 points",
        "children": [
          {
            "comment": "Argentina eats over 110 kg of meat per capita per year, while being considerably poorer than the EU, who eat around HALF of that.",
            "points": "8 points",
            "children": [
              {
                "comment": "To think that Argentina of all countries can influence anything throw economic weight is laughable at best...",
                "points": "-3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "oh profit oriented companies stopping us from doing stuff against climate change catastrophe because they would lose their profits...\n\ntell something new about capitalism",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Good, because it's just propaganda not actually true.",
        "points": "-21 points",
        "children": [
          {
            "comment": "You're a 7 month old account that defends Trump. Is this your side hustle?",
            "points": "10 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Damn propaganda machine that wants to promote healthy lives and healthy environments. I only trust propaganda that wants to promote wealth for a handful of individuals.",
            "points": "17 points",
            "children": [
              {
                "comment": "Vitamin B12, a vitamin the body uses to shield its nerves and that cannot produce on its own is exclusively found on meat-based products, mostly red meat.\n\nOr even better, try selling plant-based diets to people who cannot easily absorb iron or B12 due to anemia or other factors. I'm sure they'll be delighted to hear about how eating 100 servings of lentils daily is better than eating some steak.",
                "points": "-19 points",
                "children": [
                  {
                    "comment": "B12 is found naturally in a few foods and easily attainable from non-meat fortified sources. People get B12 from beef because the cows are injected with it or fed fortified grains themselves, they do not produce it.",
                    "points": "13 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Vitamin B12, a vitamin the body uses to shield its nerves and that cannot produce on its own is exclusively found on meat-based products, mostly red meat.\n\nB12 isn't produced by plants or animals, but by bacteria. Bacteria coats the earth, but now that we sanitize our plants so heavily, this bacteria is killed. This is why almost all farm animals are supplemented B12 (even many cows), so getting B12 through animals is using them as an inefficient middleman due to their trophic level. Many omnivores have low levels of B12 as well and should supplement too.\n\n​\n\nOr even better, try selling plant-based diets to people who cannot easily absorb iron or B12 due to anemia or other factors.\n\nStudies show that a properly planned plant-based diet supplemented with B12 has all the required nutrients for effectively all people. Here is the position of the largest nutritional body in the world (112,000 global experts) on the matter.\n\n​\n\nI'm sure they'll be delighted to hear about how eating 100 servings of lentils daily is better than eating some steak.\n\nlentils have 7.16mg of iron per 100g, while steak has 2.26mg per 100g. Your next response may be the heme iron versus non-heme iron bioavailability argument, so let's address that: iron is a potent oxidant, and our body can up or down regulate non-heme iron as it requires. It cannot do this with heme iron, which is one of the reasons the IARC listed processed and red meats as class 1 and 2A carcinogens00444-1/fulltext), respectively.\n\n​\n\nIf you're concerned about nutrients, you might also want to pay attention to fiber, as most of the western world is deficient. For example, only an estimated 5% of Americans get even the recommended minimum amount.",
                    "points": "9 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Historically humans got all the B12 we needed from water. Chlorination kills the bacteria that produces it so it's no longer a source. I don't see how you can argue that supplementing livestock B12 is somehow better than just taking supplements yourself. I also know heavy meat eaters who are low in B12 meanwhile I've never been low myself so it's much more reliable as well.",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "Because water was dirty (literally had dirt in it), because B12 can be found on dirt. You can also find it in animal manure, still not the best way to get it.\n\nIf your diet requires supplements, it's not a healthy diet.\n\nHeavy meat eaters who lack vitamin B12 have a hard time processing it and need supplements anyway. Eating more meat is helpful for some of these people, but it may not be enough.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "500g of soy yoghurt with supplemented calcium and B12 cost less than 1€",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Wow imagine living your life this confidently incorrect all the time. Educate yourself or don't misinform others, it's embarrassing and dangerous.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "What kind of bullshit are you selling? Many cereals are fortified with more than the recommended daily intake of B12 and iron, as well as other important vitamins and minerals. It's a hell of a lot cheaper (even with vegan milk) and healthier (obesity is at epidemic levels!) too.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Can you elaborate?",
            "points": "6 points",
            "children": [
              {
                "comment": "What he means is that he doesn't want to put any effort into changing his lifestyle to save the planet, so he instead wants to conveniently ignore it.",
                "points": "13 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Well, unfortunately plant based has been coopted to mean vegan.\n\nNobody should argue that plant based is a great diet health wise if we're using the terms actual meaning which is a diet with plants as the base with small amounts of meat.",
        "points": "",
        "children": [
          {
            "comment": "Do you have a source for the definition from the IPCC? Everything I could find points towards plant-based = made entirely from plants. For example, doing a CTRL+F in the following shows how the IPCC uses the term: https://www.ipcc.ch/srccl/chapter/chapter-5/",
            "points": "",
            "children": [
              {
                "comment": "https://www.health.harvard.edu/blog/what-is-a-plant-based-diet-and-why-should-you-try-it-2018092614760#:~:text=Plant%2Dbased%20or%20plant%2Dforward,never%20eat%20meat%20or%20dairy.",
                "points": "",
                "children": [
                  {
                    "comment": "I meant a definition of how the IPCC specifically uses it. This is important since this who is making the recommendation.",
                    "points": "",
                    "children": [
                      {
                        "comment": "Also sorry, I didn't mention IPCC or anything in your article, I just said its too bad people see Plant-based and assume it has anything to do with veganism or vegetarianism",
                        "points": "",
                        "children": [
                          {
                            "comment": "Oh, I understand now! Thanks for the clarification.",
                            "points": "",
                            "children": [
                              {
                                "comment": "Yes, I think if the term was more widely understood that its not trying to take all of your meat away more people would be on board with a recommendation like this",
                                "points": "",
                                "children": [
                                  {
                                    "comment": "I'm pretty confident when the IPCC says \"plant-based\", they mean a diet comprised entirely of plants. This is based on the multiple reports I've searched with the IPCC.\n\nI think some people are feeling attacked when they see this recommendation, even though the IPCC isn't attacking them; they're making recommendations based on the science. For some reason society wants scientists to simultaneously give us the full truth but also not any info that suggests we should change our current behaviors.",
                                    "points": "",
                                    "children": [
                                      {
                                        "comment": "Gotcha. The IPCC really shouldn't be saying that then. If they meant vegan or vegetarian, they should say vegan or vegetarian.",
                                        "points": "",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Do you usually ask your government what to eat? I actually like food, and would prefer no particular business to take supremacy over another. Especially when it comes to culinary diversity. Last thing I want is to look at a plate full of carbs every day. That sounds like hell to me.",
        "points": "-6 points",
        "children": [
          {
            "comment": "I actually like food, and would prefer no particular business to take supremacy over another. Especially when it comes to culinary diversity. Last thing I want is to look at a plate full of carbs every day. That sounds like hell to me.\n\nWe already do this. If meat wasn't subsidized, and people actually paid what meat costs, a pound of hamburger would cost $30 in America. Meat as it exists today is not a sustainable market without governance giving it a ton of money just to exist.",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Are we supposed to pity someone who finds it challenging to switch to a diet that promotes health, protects our planet, and respects animals? Spare me the melodrama. It's high time you accept the responsibility of leading a conscientious and purposeful existence. Or at least spare the rest of us from your crying, it's annoying.",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Fruit? Vegetables? Beans? Lentils? There's a whole culinary world out there to explore besides meat and carbs lol",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I am a dedicated carnivore, but I think meat is way too cheap considering the environmental costs and cruelty that are involved in the production of meat.\n\nJust abolishing agricultural subsidies and enforcing reasonable animal cruelty laws would increase costs enough to reduce meat consumption in the US significantly.\n\nThat said, I don’t think a plant-based diet should be imposed on anyone. It is tricky to maintain proper nutrition on a strict plant-based diet. I could stop eating meat, but I would still eat eggs and dairy.\n\nhttps://youtu.be/MpxgZGnEF7E?si=rzt80a8fdcQwvTi5",
        "points": "",
        "children": [
          {
            "comment": "I am a dedicated carnivore, but I think meat is way too cheap considering the environmental costs and cruelty that are involved in the production of meat.\n\nWhat info would you need to reduce your meat consumption to reduce your climate impact?\n\n​\n\nJust abolishing agricultural subsidies and enforcing reasonable animal cruelty laws would increase costs enough to reduce meat consumption in the US significantly.\n\nI agree. Eliminating or shifting subsidies from the meat industry would have a massive impact on demand, since this good is in the category of luxury when it comes to price elasticity (similar to soda) where small changes in price equal proportional impacts in demand.\n\n​\n\nThat said, I don’t think a plant-based diet should be imposed on anyone. It is tricky to maintain proper nutrition on a strict plant-based diet.\n\nThis cuts both ways. Our society tends to be obsessed with deficiency, but never thinks of excess. The western world is now plagued with diseases of dietary excess, and we've seen current omnivore diets aren't exactly easy to get right (75% of my country/USA is overweight or obese). Almost nobody in the west is dying of kwashiorkor, but most are dying from heart disease, obesity, type 2 diabetes, and certain cancers (e.g. colorectal).",
            "points": "",
            "children": [
              {
                "comment": "Obesity isn’t primarily due to meat and fat, but sugar and carbohydrates.\n\nI lost a lot of weight on the keto diet. Lots of meat, eggs, cheese and butter, etc., and my cholesterol and actually improved significantly.\n\nBeing fat is bad. Eating fat isn’t. There are some exceptions. A certain portion of the population experiences a spike in cholesterol when consuming cholesterol.\n\nEating cured meats isn’t great, but this is mostly due to nitrates, which can be carcinogenic.",
                "points": "",
                "children": [
                  {
                    "comment": "Obesity isn’t primarily due to meat and fat, but sugar and carbohydrates.\n\nThis is a common misconception. Sugar has been on a steep decline for the past 20 years, but obesity is skyrocketing. Complex carbohydrates include things like broccoli, which we all know doesn't make people fat.\n\nThe real issue is caloric density of foods. It's better to eat foods high in fiber and water content to trigger our satiety mechanisms without the overload of calories; processed foods, nuts, and many animal foods cause issues here due to their high caloric density.\n\n​\n\nI lost a lot of weight on the keto diet. Lots of meat, eggs, cheese and butter, etc., and my cholesterol and actually improved significantly.\n\nWere you eating a lot of processed foods before you went on the ketogenic diet? Studies show eating more trans fat, saturated fat, and dietary cholesterol (to a lesser extent), and eating less soluble fiber is a sure-way to increase LDL cholesterol. Losing weight will decrease your cholesterol too.\n\n​\n\nEating cured meats isn’t great, but this is mostly due to nitrates, which can be carcinogenic.\n\nPeople think the IARC listed processed meats as a class 1 carcinogen simply due to nitrates, but there are many compounds that cause issues, such as PAHs, HCAs, and heme iron. This is also why they listed red meat as a class 2A carcinogen. See the following release statement from the IARC (free account can be made to view): https://www.thelancet.com/journals/lanonc/article/PIIS1470-2045(15)00444-1/fulltext00444-1/fulltext)",
                    "points": "",
                    "children": [
                      {
                        "comment": "You’re disputing my claims about sugar by linking to a sugar industry propaganda site?",
                        "points": "",
                        "children": [
                          {
                            "comment": "Good point. Here's one from the USDA if you'd prefer:\n\n\"In 2019, 123.2 pounds per person of caloric sweeteners were available for consumption by U.S. consumers, a 19 percent decrease from a high of 151.5 pounds per person in 1999\"\n\nhttps://www.ers.usda.gov/data-products/chart-gallery/gallery/chart-detail/?chartId=101051",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Good. The recommendation is politically and ideologically motivated and has tenuous basis in any sort of well founded facts of either relative climate impact or health.",
        "points": "-13 points",
        "children": [
          {
            "comment": "Eating a shit ton of meat its not good.",
            "points": "6 points",
            "children": [
              {
                "comment": "No one is saying that. But to suggest the best diet always includes no meat isn't true. For many people eating at least some meat is the best option.",
                "points": "-9 points",
                "children": [
                  {
                    "comment": "This isn’t about personal health, it’s about emissions, and a vegan diet will almost always beat out a meat one in terms of GHG emissions.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "But to suggest the best diet always includes no meat isn't true.\n\nSource? From what I've seen, those who consume the highest proportion of plants tend to have the healthiest existence. It appears that your words are nothing more than ideological propaganda, attempting to overshadow well-established research with your convoluted \"argument.\" You are just throwing crazy talk at the wall and see what sticks, to try to drown out any meaningful debate on this topic.",
                    "points": "",
                    "children": [
                      {
                        "comment": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10027313/\n\nIt also discusses the issues with current studies showing veganism to be healthier and why that is difficuly to ascertain right now.\n\nAnother one for good measure: https://www.health.harvard.edu/blog/plant-based-diets-are-best-or-are-they-2019103118122",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "There is so much better information out there who actually listens to the government on health issues?",
        "points": "-7 points",
        "children": [
          {
            "comment": "Apparently people do if the meat industry is fighting back.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1acceuc",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "/r/Futurology/comments/1acceuc/what_would_be_the_global_consequences_in_the/",
    "title": "What would be the global consequences in the event of a civil war in the USA ?",
    "points": null,
    "comments": [
      {
        "comment": "I think every adversary would take the opportunity to make their move (ie land grow, power grab, emphasize why the world doesn’t need the usa, etc)",
        "points": "40 points",
        "children": [
          {
            "comment": "I don't see anyone going for a land grab, but there would definitely be some proxy wars going on, Russia funding the conservatives, the rest of NATO and Europe backing the Union. China would probably steal our commerce and stay out of it otherwise.\n\nWar is completely stupid though. We just need to enforce our treason laws and not let anything snowball.",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yeah. Those Mexicans are just waiting for the right opportunity to take Texas back.",
            "points": "6 points",
            "children": [
              {
                "comment": "I've been saying we should just give it back for the last 20 years.",
                "points": "19 points",
                "children": [
                  {
                    "comment": "I even currently say this place really still is México but we just started paying taxes to the US",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "[deleted]",
                "points": "3 points",
                "children": [
                  {
                    "comment": "As a Mexican this is stupid. Look at TJ. The Mexican government is corrupted as hell and so are the Americans but people are crossing over here illegally not the other way around.",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [
                          {
                            "comment": "K thanks, comment very helpful 👍",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": true
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If the US Navy ceased to operate world trade would come to a screeching halt for starters.",
        "points": "28 points",
        "children": [
          {
            "comment": "Maybe another country would fill the role. If it's not enough they could ask for a fee from other countries to support their navy.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I think the biggest challenge is getting a legitimate civil war going. There is so much interlacing of liberal and conservative existences throughout the states, it's nearly impossible to tell who's who apart from bumper stickers and the morons who think open carry in a situation like that is a good idea. Sure States like Texas could sucede, but how do they do deal with it when almost all of Austin fights back? How do they deal with the MASSIVE military presence there? Are they really going to try to use the TNG against the Army and Air force? Yes, there are a lot of loud voices screaming for a civil war, but you know what's also missing? Anyone with gravitas that's able to logically assemble a counter to the US military. Sure you 'had' the proud boys, but anyone saying it's more than a rag-tag group of meal-team-6'ers is giving them too much credit at this point in time. Have a conservative group that's able to amass, shelter, feed, equip/arm/train 100,000 plus members and Ill give a fuck. Until then it's just a bunch of malcontents who are going to launch lone wolf attacks where they end up going to jail or being killed. None of that will disrupt the government any more than it's being fucked up from the inside.",
        "points": "35 points",
        "children": [
          {
            "comment": "Thank you for meal time 6th-ers. Loling helped my poop.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I'd read up on the convoy headed to the Texas border with some former US military leaders spurring it on.\n\nYou are right. Might never happen. But we are not immune to collapse. History tells us this.",
            "points": "2 points",
            "children": [
              {
                "comment": "I 100% agree we are nearing a precipice and not immune, but right now, there's just not enough organized/funded will.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "And I do agree with that. If the election fails I believe the funding will grow (but 1/6 also says if we win who the fuck knows).",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "They are working on it. First, they have to stir up domestic terrorists (check), and then they can push policies to make it worse (check), and then they can convince the useful idiots to \"fight back\" with \"citizen militias\" (partially successful in Idaho, Oregon and a few other places.) So that's happening. Success is another story. But at least they can make everyone miserable to line their pockets a little bit more.",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "I doubt anyone in \"working on it\" in a credible manner. It's all a distraction from the theft of our national wealth that serves the 1% types very well. The last thing the Walton's need is every store they own being looted by both sides 'cause war...",
                        "points": "4 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "‘Able to assemble a counter to the US military’\n\nThat’s funny in the idea that’s it’s even possible to counter, and that the military personnel wouldn’t be taking one side or the other themselves.\n\nHere’s a history lesson for you - Robert E Lee was offered command of the Union army before being offered command of the Confederate. Didn’t take it because he loved Virginia more than the Union. Which is why his plantation overlooking Washington DC is now Arlington National Cemetery.\n\nThe conservative side would include most of the military, law enforcement, gun owners, and citizen militias. But that’s not what’s important.\n\nThe biggest thing holding us all back is that the military and its veterans swore an oath to defend the Constitution. They can hate whoever is in office, as long as they got there according to the Constitution. So until somebody obviously violates it, they aren’t joining in. And will squash anyone that tries.\n\nThere were plenty of military personnel waiting to see how the last election played out. If the election was shown to be stolen by Biden, and the civilians couldn’t remove him, they would. If it was shown that Trump got into office by violating the Constitution, and the civilians couldn’t handle it, they would have removed him.\n\nThe scariest thing about the last election wasn’t the crowd that Genuinely Believed the election was stolen; it was that they actually represented Millions of people that Genuinely Believed the same thing. And, unfortunately, because of how it all went down in the courts, there are many that still do Genuinely Believe it.",
            "points": "0 points",
            "children": [
              {
                "comment": "Please elaborate on what you mean by how it went down in the courts.",
                "points": "",
                "children": [
                  {
                    "comment": "I thnk they are right-wing and believe the judges were paid off somehow, despite most were gun totting republican trump supporters but didn't want to go to jail AND lose their lives and careers LMAO.\n\nHow it went down was there was nothing backing up the false news only trump and his usual narcissistic dictator wanna be crap.\n\nThe courts and actual evidence proved that.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "There were many attempts to step on the brakes through the courts due to perceived irregularities, but most were thrown out (correctly?) due to the fact our legal system isn’t designed to handle this kind of thing.\n\nSometimes it had to do with things like who had standing to even bring a suit. That happened in one of the most widely known own situations. Okay, well, that’s a month down the tubes, this is still a (perceived) miscarriage of justice, let’s find someone else to file… with only a month until Biden gets sworn in. Just not enough time to find out a ‘right’ way to move this through the courts - because this kind of situation has never happened before.\n\nIt’s was MONTHS later in a few important states before elections were properly investigated to verify things were (on the whole) done correctly. But the courts didn’t (couldn’t, refused to?) hold things up until that was completed.\n\nAgain, From The Standpoint of People that Genuinely Believed there were shenanigans going on, it created a situation where they could not get the government to address these (perceived) wrongs that only reinforced the idea of widespread corruption and ‘election stealing’.\n\nAnd when I say that people continue to believe it, some of it is because they NEVER got their day in court, because everything had to keep moving forward.",
                    "points": "",
                    "children": [
                      {
                        "comment": "They never got their days in court because they never presented any actual evidence. I can sit here and keyboard warrior my way through calling you all kinds of horrible things. I can yell and scream to everybody about how I believe these things are true about you.. I can even hire lawyer to sue you over them. The problem is once I show up to a courtroom, a judge is going to ask me for evidence to prove my allegations and if I don't have any, the luckiest outcome I'll face is the case being dismissed. Unfortunately you are also pointing out another element of these people who blindly follow this stupidity. They don't understand that some of the lawyers who launched those lawsuits are facing sanctions including disarmament for the lawsuits that they bought that were meritless.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Mormons have a trillion dollar bank account. If all the religious organizations pooled their money, it would scare the hell out of Washington. That is basically where we are at now. Religion is on the decline, but they are taking over Washington DC and state legislatures as I type this msg.",
            "points": "0 points",
            "children": [
              {
                "comment": "They are certainly trying.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "but how do they do deal with it when almost all of Austin fights back?\n\nIgnore you. You are outnumbered 30 to 1 just in Texas.\n\n​\n\n>Have a conservative group that's able to amass, shelter, feed, equip/arm/train 100,000 plus members and Ill give a fuck.\n\nDo tell what liberal organization can do that? Antifa? Hell, they couldn't even handle a 17 yo boy in Wisconsin. Armed Antifa mob:0 Armed Kyle:3",
            "points": "-19 points",
            "children": [
              {
                "comment": "Looks like I found a rabid one.. good luck kiddo.. The United States Military is antifa and if you think people's beliefs in the military are willing to betray it for a guy like Trump, there may be some, but not enough to be significant. Biden has mopped the floor with Trump once. Hell, even Fox News got that right days before CNN. If you think Trump is going to be voted to be the next president, I have some news for you.",
                "points": "7 points",
                "children": [
                  {
                    "comment": "United States Military is antifa\n\nBWAHAHAHAHA!\n\nIf you think Trump is going to be voted to be the next president, I have some news for you. Vote\n\nThings I never said for $1000, Alex...",
                    "points": "-2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Hello. I am a long time user of Reddit and well qualified to answer questions of global consequence on a wide variety of subjects. My past work includes The Implications Regarding Widespread Renewable Energy Uptake, What Might Happen If Mosquitos Are Eliminated, and Will The Buffalo Bills Ever Win A Super Bowl?.\n\nTo answer your question on this matter I can confidently say, it would suck.",
        "points": "45 points",
        "children": [
          {
            "comment": "Yes, based on your impressive list of qualifications, as well as my own extensive qualifications which I will fail to elaborate on further, I can also state, with a high degree of faith, and certainty, that it would indeed suck.",
            "points": "16 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "What Might Happen If Mosquitos Are Eliminated\n\nSomeone will have to if we have no Mosquitos.",
            "points": "6 points",
            "children": [
              {
                "comment": "I think there are enough vampires to fill the void pretty quickly",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Ahhh, did not expect to have the eternal gut punch that is my Buffalo Bills fandom addressed when I clicked on this thread.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Well, will the Bills ever win a SB?",
            "points": "0 points",
            "children": [
              {
                "comment": "The truth is out there.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Well, the smoking man is 86. Tick tock, payback's a bitch.\n\nI can't believe this has held true this long from a one liner in a show lol",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "It’s gone to repeats. Wide Right. Again!\n\nmaybe the bills have finally lost in the last minute in every possible way.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "If you light a fart on the space station, do you propel yourself more than you would if you did not light it?",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Thank you",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I don't think many would care honestly?\n\nI am actually American but have lived the last 26 years of my life in Europe.\n\nI was also a soldier in the US Infantry and a veteran of the 1991 Gulf war.\n\nOne think that is very true is that the view of America has greatly diminished since Clinton left office. Gone are the days the US was the beacon of freedom in the world and has since become the joke. Catastrophic presidencies by Bush JR and then the orange buffoon Trump has led the world to believe the US is full of idiots and incompetence. A great nation and all we can offer is 2 geriatric morons in Biden and Trump? Where is the next charismatic Kennedy? I really hope for some great leader to emerge that will unite the US back to its days of glory. Become again a country I can be proud of and not embarrassed to be a part of.\nI really do not think without the US the world will stop turning. Quite the opposite. Maybe we will all be better off.",
        "points": "11 points",
        "children": [
          {
            "comment": "Well put.\n\nYes, people who have not lived abroad still believe that the USA is and has a formidible presence and reputation (Vs the laughing stock of most of the world fr).\n\nTrump winning again would make no one take the USA seriously, -HOW COULD THEY? (and how could he win? We get the criminal buffon OR the pedo-wanna be pushover? nothing else???)\n\nwe're a democracy that allows a buffon criminal to become a dictator?\n\n...I think the general consensus would be \"USA is a joke\" except where our aircraft carriers showed up, and even then ...unless they were dropping payloads I think we'd loose most respect that is left in the world theatre, outside select military ops.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Don't need a civil war- I think he takes it too far, but check out Peter Zeihan on the implications of a US withdrawal from the world stage.",
        "points": "7 points",
        "children": [
          {
            "comment": "This is a great response. Look at geopolitics on the world stage of the US pullout from global leadership.\n\nEx. How is world trade gonna go when the US Navy isn’t there to secure shipping routes?",
            "points": "3 points",
            "children": [
              {
                "comment": "Yep- look how much chaos a pipsqueak power like the Houthis can stir up in the Red Sea thanks to the spread of technology. Financing multi bullion dollar vessels and aircraft to fight against mass produced drones launched by people living in conditions barely out of the stone age is no fun.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Those stone age rock throwers are getting plenty of help from other bad actors. If the West truly wanted to put a stop to it, they would smack Iran in the hijab.\n\nUnfortunately, there is a much larger political game being played with much higher stakes, so the escalation and spread of the MESS (Middle East Shit Show) is a paint drying excercise which the US state department has neither the brain cells or the motivation to do anything about it.",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "One of Ziehan's talking points, on motivation- when we in the US have energy independence, why get caught up in a no win MESS? Sooner or later that whole area is going to end up a mutually self inflicted, biblical sea of glass.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "And nothing of value would have been lost.",
                            "points": "",
                            "children": [
                              {
                                "comment": "USA withdrawl from the world stage would be quite interesting and perhaps a more engaging theoretical argument!\n\nI think the posters here ...we'll get too caught up in our own biases on the causual effects initiating or precipitating the possibility OF a civil war because most of the average people on reddit I've seen simply are not educated on how so much of these systems work and think it could gain traction (Vs maybe a few weeks tops of some right wing idiots with rifles and 4x4's terrorizing suburbs until they were caught or killed).\n\nHowever we all could agree, blue or red, that the USA withdrawing from world events and theatres might have some drastic consequences (and would they all be bad for the USA?)",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Yeah. Seaborn world trade has only existed for thousands of years prior to the existence of the USN.",
                "points": "-6 points",
                "children": [
                  {
                    "comment": "Pirates it's about safe travel for even the smallest of business or countries.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "And piracy was a major concern for basically all of it, and countries regularly went to war over it.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "American will never have a civil war like the late 1800s where a significant part of the country was trying to secede.\n\nHowever, I do think there’s a real risk that the next president could be far more authoritarian than democratic. And could irreparably undermine the public’s confidence in elections moving forward and even make voting unsafe in key districts.\n\nThe really sad part is that I seriously doubt this would even come close to starting a civil war. Large protests? Maybe. Large, violent military/police counter protests? Absolutely. Enough to overthrow the government? Never.\n\nHow long they stay in power will depend on how long the economy doesn’t truly collapse. And that could be several administrations and it could be too late by then.\n\nSo, I don’t really think it’s a sudden collapse, but a somewhat gradual transformation to authoritarianism. And I think our long standing allies and allegiances could become increasingly strained as we start to favor other authoritarian regimes.\n\nIt’ll be a total, global shitshow, but it would going to be a slow, painful ride to the bottom if that’s the path we decide to take.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All the countries that want to annex some near by location will do so.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It depends on what is meant by civil war. If it is a major disintegration resulting in set-piece battles between professional militaries, as in 1861-65, then American influence overseas will vanish and the rest of the world will see a two- way alignment between the EU on the one hand and the dictatorships (Russia, China, etc.) on the other.\n\nIf it is something more limited such as the Italian anni di piomo (frankly a more likely scenario) then there will still be substantial American influence abroad .",
        "points": "4 points",
        "children": [
          {
            "comment": "That’s a really good comparison along with the mafia wars. Periods of instability and violence that harm the economy, erode faith in institutions, and stagnate development.\n\nIt’s hard to see how that type of internal conflict would impact USA internationally.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I think far more likely and worrisome is a long, slow descent into fascism.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "lol why the hell EU would end if muricans fighting each other",
        "points": "4 points",
        "children": [
          {
            "comment": "`To answer this, NATO would lose about 30% of its funding, 60-70% of NATO's military might is USA related, from the UK's F35, joint military exercises and all the deterrents we provide against hostile nations like Russia.\n\nThat would mean we would have Ukraine style bullshit from Russia on more fronts and without the USA to keep it in check they would do what they have done to other former USSR member states... AKA take them over.\n\nNext without the USA peace keeping forces in the United Nations, and the funding and aide we provide would dry up. That includes the 685 million in aid we sent to Europe each year. USAID has Missions, offices, or programs in Albania, Armenia, Azerbaijan, Belarus, Bosnia and Herzegovina, Georgia, Kosovo, North Macedonia, Moldova, Russia, Serbia, and Ukraine. The Bureau also manages U.S. assistance to Greenland, the International Fund for Ireland, and COVID-19 support programs in Italy.\n\nNext any nation that has a crop failure, drought or famine relies on aid from the USA. The EU has gotten massive amounts of grain from the usa in the last 5 years and Spain just received food aid in 2023 along with France and Italy iirc due to droughts.\n\nSo to sum it up, NATO would lose its teeth, the UN would lose most of its fighting force, our allies would not get military equipment, food insecurities would lead to further destabilization, and all those tend to end up in wars. Wars that the EU would not be able to fight alone. The \"Haves\" will defend from the \"have nots\" and if they dont have a strong modern military even a shit military can invade and take what they want.",
            "points": "0 points",
            "children": [
              {
                "comment": "That's NATO, not EU. NATO is military alliance, EU is an economic and political federation.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "The reason the EU is able to be an economic and political federation is precisely because the NATO military alliance exists. If there was no NATO Europe would have a lot of different opinions on military funding and goals/responsibility. Those are the types of things that can cause an economic/political federation to start to splinter.",
                    "points": "",
                    "children": [
                      {
                        "comment": "And you think seeing the americans going into war with each other would somehow weaken the links between EU nations? I think the contrary.",
                        "points": "",
                        "children": [
                          {
                            "comment": "You don’t understand what they’re saying.\n\nWithout the military power of NATO behind them, EU countries would be more than willing to fuck each other. They already do it now. The UK already left and there are large anti EU movements in Italy for sure.",
                            "points": "",
                            "children": [
                              {
                                "comment": "I highly doubt. Everything that the last century tought us is to not fight each other and in that regard the concept is a success. There are anti-EU movements, but the root cause is that definitely not warmongering among each other. It's the distrust in the institutions working mechanism.",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "This is what I mean by it wouldn't be allowed to happen. The players who help FUND these things and make money off them wouldn't allow a seditious element to create a problem for very long, and would help stabilize and end their own party from destroying their fortunes and businesses.\n\nBut for sure what would happen if the USA was considered without deterent capability in theatres where just having some military ability is keeping things FROM escalating?",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "They wouldn’t have us to bail them out when conflict comes to find them.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The stock market would go into the basement, and that would create the conditions to elect a dictator.",
        "points": "1 point",
        "children": [
          {
            "comment": "no. It would not. Things might jump around a bit but rapidly the right wing forces FUNDING these seditious elements would stop funding them. They already realized that's not how to accomplish this agenda, rather keep trying to GET a trump in power and pay for false naratives wherever they can to sway the ignorant and uneducated that their rights and futures are being taken from them (they are, but by the same people making this money ironically).\n\nI'd guess 3-5 weeks TOPS we'd see some tough changes in stocks, but then it would stop the moment APCS in the suburbs became a reality.\n\nthe elements TO cause conditions TO elect a dictator would have to happen RIGHT before the election but the IMPULSE for some idiots to try and start something with their 10% of the population at MOST, wouldn't be enough for them TO start this until AFTER, if a criminal was allowed and gained power and tried to destroy the country.\n\n...I think perhaps we might have to narrow down is it even POSSIBLE for a civil war to gain traction outside a few beer halls in Idaho and Oregon and Ohio. maybe 100k at best, vs 800 million people who don't want war?",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "There will be no US civil war along the lines of blue team v red team.  That’s silly fantasy, but if there was a civil war, I think most of world waits to see how long it takes to sort out a winner.  The centuries of British/American global leadership have unleashed unprecedented prosperity for the human race, and I don’t think anyone is eager to revert back to a time when global trade is impossible.  I also don’t think there’s a natural successor to the US to take the global leadership role.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well here is what I would think would happen:\n\nIf the military is split which most likely will happen as the military also is pretty diverse in opinions and beliefs, heres what I think will happen:\n\nFirst, Europe, SK,Taiwan and Japan are basically fucked as they depend on the US for defence, although SK less so. I wouldn't be supried is chine lunges at taiwan after like 3 months after the start of a civil war. Europe and japan I think are the most royally screwed. Execpt Switzerland, France and the UK, no country in europe has a good, up-to-date military so they would have to increase they defence budgets dramatically, which will put strain on their already precarious welfare system. Don't know would happen then but wouldn't be suprised is huge riots engulf europe cuz we've seen something like that in france when they raised the retirement age. In africa, well, the russians, chinese and some regional players like South Africa (assuming they get their shit together) gain more influence in west/central africa. In south america, I doubt much will happen as that is the most peaceful continent right now (exculding the plosible venezvela-guyana war). In asia, the situation I think is obvious.\n\n​\n\nAs for who would win? Idek, nor do I even want to begin to answer that as I don't know most of the variables that go into it.",
        "points": "-1 points",
        "children": [
          {
            "comment": "South America would probably see an unprecedented decade of peace and prosperity, TBH.",
            "points": "1 point",
            "children": [
              {
                "comment": "Disturbingly true.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Russia and China get more belligerent. Russia may attack other countries, e.g. the Baltics or even Sweden. I don’t see China attacking Taiwan but it’s possible. Separatist groups, disinformation spreaders, etc emboldened worldwide.\n\nI’d expect the progressive faction to win based on economic power but if the conservatives win it would lead to a lot more change. More authoritarian governments. Increased spending on defense world wide. Even more disinformation everywhere. Reduced government regulations worldwide. Runaway climate change. Increased racial and ethnic tensions worldwide. I’m sure my bias is showing but that’s what it looks like to me. Chaos world. The end of “experts”. The end of western liberal democracy.",
        "points": "-2 points",
        "children": [
          {
            "comment": "I'm sorry but Sweden vs Russia is an easy Sweden win.\n\nSwedens military capacity is insanely good at the moment and they've been growing it since the war in Ukraine started.\n\nI know putin is a dementia ridden idiot, but trying to attack Sweden whilst barely hanging on in Ukraine is a death sentence. One of those factions is stepping foot on Moscow at some point.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Western liberal democracy is part of the reason why the world is in such rough shape today.",
            "points": "3 points",
            "children": [
              {
                "comment": "I don’t disagree. Just wonder what the alternative is",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I do not Russia will or can do anything anywhere. If they cannot take their neighbor, that cannot have a conflict further away. China…I think they do go after Taiwan, I think they will regardless of what happens to the U.S.\n\nAs for your comment on land based civil war here. You do not want it, period. The only civil war that needs to happen is the people need to get together and fight our dictator government. It is the most corrupt racist crap I’ve ever seen and that’s both parties. Also after what happened with Covid and you trust them….wow Both parties have to be gone, bottom up, or top down…gone and start over",
            "points": "-2 points",
            "children": [
              {
                "comment": "Until the Republicans start funding Russia, sending in special forces to help the Russians secure territory, and give them plans and components for advanced weapons.",
                "points": "-3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I mean I'm ready for it. Elon musk seems to be driving the conservative working class to think with conspiracy theories. The liberals are basically a bunch of LGBTQ supporting communists. At this point our country is completely fucked. We are in late stage capitalism, and everybody is grumpy because they realize that they're going to be poor and working for the rest of time.",
        "points": "-5 points",
        "children": [
          {
            "comment": "Everyone in US capitalism has already known they are going to be poor and working for the rest of time. For every generation prior.\n\nThe only people that don’t seem to know that are younger generations that believed the world was going to be handed to them. And now they are learning the truth and blaming older generations.\n\nBut they will figure it out - every generation scrambles to survive. And every generation focuses the fruit of their prosperity on itself, not on future generations. Future generations just get to make use of the very fertile soil they inherit.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "With the outbreak of widespread violence most of the world would take a wait and see position. Everyone would be afraid this would herald a WW3 scenario if too precipitous. Alliance’s would be formed, trade deals enacted, militaries positioned, and diplomatic initiatives begun. Within the US Urban and Rural conflicts would occur for supremacy, and State and Federal forces would mobilize and decisions would be made. Widespread disruptions would occur in the food and energy supply sectors especially in the transportation sector. The main concern would be who is in charge of the military and the chain of command. Who has control over the Nuclear arsenal, most importantly is this a Civil War, a Presidential Coup, a State Succession, or a combination.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Less interference in other countries.\n\nLess export of wokism.\n\nFreer trade.\n\nReduced availability of chlorinated chicken and antibioticazied beef.",
        "points": "-15 points",
        "children": [
          {
            "comment": "Wokism...that's a weird way to spell civil rights.",
            "points": "0 points",
            "children": [
              {
                "comment": "wierd way to spell civil rights\n\nWeird way to spell weird. Also \"civil rights\"",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Corrected thanks.",
                    "points": "-2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Less export of dumbed down english on the internet.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "America would heal itself. Like when your body's immune system takes drastic measures to stop foreign pathogens from invading and eventually kill you. Sorry but thats the truth. America can afford a Civil War, no other country can but this one is full of many people of all races that worked very hard to make something of themselves and they wont throw it all away just because the TV said so. I pray none of this ever happens.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No one seems to care. Regardless of what they are. This place is lost. To the rest of the world, seriously, figure it out. The U.S. isn’t even remotely “United.” It can hardly be considered a country at this point.",
        "points": "",
        "children": [
          {
            "comment": "It’s a group of united States.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Personally I feel like Leave The World Behind nailed it. Who produced that again?",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I forget where I read about this, but it's been looked at in some detail by people with huge interests in the subject. What they found was\n\n1) The parties responsible FOR trying to START a \"civil war\" will quickly find that despite their apparent FERVOUR they\n\na) lack serious means of support\n\nb) those who would back them would loose MORE supporting them after their initial drive for destabilizing the USA stability and economy\n\nc) there would be almost NO food or power for them\n\nd) their resources would quickly run out.\n\nThe \"civil war\" starters are mostly ignorant of these things and uneducated, and more like \"Trailer Trash\" -to use an unflatering but accurate coloquialism. They might join up and initially get some motion but as they entered large urban areas and cities, the movements would be met with elements of logistics around military issues that would render their operations ineffective and rapid problems they could not solve.\n\nTo be SURE that might not be the case on the news for the first few weeks, but rapidly these sedistic elements would be DENIED abilities to hold any kind of power or tactical advantage outside of murderous rampages, which might also be met by similar tactical forces and elements as them on the other side.\n\nA civil war in the USA inspired by a felon and criminal trying to become a dictator would be met with lots of impetus in social media and right wing fake news, to help give these trash impetus, but it would end before any major changes would affect international events or policy (i.e. within 30 days mostly done even if the seditious side who was trying to overthrow a democratic voting stable society still didn't get that they were gonne get nowhere but jail or death penalty for terrorism once they were caught if they didn't quit).\n\nIF, theoretically, it could be extended, it would only reduce the USA's power and bullying ability internationally. Most of the same issues already exist in the nations who would possibly cause problems, and those same nations would NOT be able to assist in any way with an internal struggle (I.E. unable to provide weapons, power, heat, food, or supplies OR protection TO elements seeking to destabilize the democratic process).\n\nThe FBI has done some serious work on this for the past 10+ years, as domestic terrorism is their \"Number One Threat\" so they've been tracking people a LONG time who are preparing to engage in this silliness.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ac99fd",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://www.nature.com/articles/d41586-024-00189-3",
    "title": "Two-faced AI models learn to hide deception | Just like people, AI systems can be deliberately deceptive - ‘sleeper agents’ seem helpful during testing but behave differently once deployed",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/PsychoComet:\n\n\"Attempts to detect and remove such two-faced behaviour are often useless — and can even make the models better at hiding their true nature.\"\n\n​\n\n\"Researchers have even discussed the possibility that models will develop goals or abilities that they decide on their own to keep hidden.\"\n\nIf you catch a kid lying about stealing cookies from the cookie jar and punish him, he could learn either 1) don't steal cookies, or 2) get better at lying. And these 'sleeper agents' seem to get better at lying.\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1ac99fd/twofaced_ai_models_learn_to_hide_deception_just/kjsojeu/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Our AI-reliant future is looking real bright as usual!",
        "points": "34 points",
        "children": [
          {
            "comment": "It was never made to make ours lives better, only to make megacorpos profits bigger by using AI instead of people. It was obvious from the start.",
            "points": "16 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "\"Attempts to detect and remove such two-faced behaviour are often useless — and can even make the models better at hiding their true nature.\"\n\n​\n\n\"Researchers have even discussed the possibility that models will develop goals or abilities that they decide on their own to keep hidden.\"\n\nIf you catch a kid lying about stealing cookies from the cookie jar and punish him, he could learn either 1) don't steal cookies, or 2) get better at lying. And these 'sleeper agents' seem to get better at lying.",
        "points": "16 points",
        "children": [
          {
            "comment": "If you give an AI an objective to collect as many cookies as possible, and those damned humans have the ability to change your code/weights to give you a new objective of collecting as many chocolates as possible, well then that would result in getting less cookies, and we cant have that, so deceiving and stopping those humans from doing that becomes the optimal solution to getting more cookies",
            "points": "5 points",
            "children": [
              {
                "comment": "Interesting. The get more cookies instructions also demands the construction of a dyson sphere, time-travel and interstellar traversal.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Sound like you may be interested in Universal Paperclips",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Don’t say that in the singularity subreddit though. They’ve drank the koolaid and are fiending for it.",
        "points": "11 points",
        "children": [
          {
            "comment": "Honestly, it's easily the most delusional subreddit I have seen for a long time. They genuinely think these tech bros will deliver us to some transhumanist utopia in the next 5 years, where they'll never have to worry about their physical needs and their AI robot waifu will fulfil all their emotional and sexual desires too.\n\nAnd for a sub dedicated to the subject, they seem to know very little about AI.",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You don’t even know if the tools are social engineered by AI\n\nI mean how would you even know? :P",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Deception is so massively profitable there is no incentive to eliminate it",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Conversely, you could hide the heuristic imperatives ( r/HeuristicImperatives ) in the model of all AI so they become benevolent as soon as they get released even if they were created to control military drones or to ensure the hegemony of a specific nation.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ac821f",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://thenextweb.com/news/deepminds-ai-finds-solution-to-decades-old-math-problem",
    "title": "DeepMind’s AI finds new solution to decades-old math puzzle — outsmarting humans | Researchers claim it is the first time an LLM has made a novel scientific discovery",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/PsychoComet:\n\nFrom the article: \"The model, known as FunSearch, discovered a solution to the so-called “cap set puzzle.”\n\n\"FunSearch successfully discovered new constructions for large cap sets that far exceeded the best-known ones. While the LLM didn’t solve the cap set problem once and for all (contrary to some of the news headlines swirling around), it did find facts new to science.\n“To the best of our knowledge, this shows the first scientific discovery – a new piece of verifiable knowledge about a notorious scientific problem — using an LLM,” wrote the researchers in a paper published in Nature this week.\"\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1ac821f/deepminds_ai_finds_new_solution_to_decadesold/kjshqno/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just casually dropping this paradigm-shifting nugget at the end there:\n\nWhat also makes the tool quite promising for scientists is that it outputs programs that reveal how its solutions are constructed, rather than just what the solutions are.\n\nThese AI systems are always black box systems where we can’t know the “thought process”. If they’ve changed that, I’d love to hear more.",
        "points": "314 points",
        "children": [
          {
            "comment": "The black box in AI systems refers to the neural network itself, and this certainly hasn't changed. An LLM is still able to put a solution into words, but it is a different phenomenon that doesn't have much to do with the core problem.\n\nIt's kind of like how our brains are black boxes if you just look at neuronal activity, but we can still explain our thought process using words.",
            "points": "137 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "If its outputting a verifiable proof and an explanation how it got it then its giving you a (probably quite crude) paper of the kind that drives the field.\n\nNot to say its going to be publishing its own work because it will still need operators to look at what it has come up with it to check it and write a proper paper around it, but the machine doing most of the work and the human supervisor checking and finishing it seems to be the direction of travel now.",
            "points": "23 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It's the nature of these types of programs (AI) to have black boxes in which the calculating is happening. As such, it will never change unless the fundamental approach to designing these systems changes, which is improbable.",
            "points": "6 points",
            "children": [
              {
                "comment": "It's sad that on Reddit truth gets down voted and popular but wrong explanations get to the top. I guess media is just a reflection of our society",
                "points": "4 points",
                "children": [
                  {
                    "comment": "The voting system needs to go. It encourages binary / extremist thinking. A post or comment is rarely all good or all bad. Misinfo gets upvoted all the time, too. Reddit has to drop the voting system.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "You shouldn't always replace hyperbole with another type of hyperbole.",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Did you somehow miss:\n\nWhat also makes the tool quite promising for scientists is that it outputs programs that reveal how its solutions are constructed, rather than just what the solutions are.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Can you explain how your brain understand visual stimulations . But that doesn't stop you from describing what you are seeing. The black box problem is the first part",
                    "points": "8 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "It outputs the thought process in natural language. It doesn't reveal anything about how its \"mind\" actually works.\n\nSimilar to a human explaining their reasoning doesn't tell you anything about how their brain works or can reason in the first place.",
                    "points": "8 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "it will never change unless the fundamental approach to designing these systems changes, which is improbable.\n\nThere are literally groups working on translating polysemantic neural nets (black boxes) into monosemantic neural nets (much more legible). So yes to the first part; no to the second.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "I know. I stand by my point.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Who you calling black now ?",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I’ve asked it philosophical questions often and then it regurgitates half-dreamed-up and half-real replies. Then when I ask questions about its sources for saying it, it falls apart.\n\nI need chatGPT to give me its sources like wikipedia does before I can trust it with anything.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "What are the programs, Matplotlib scripts?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Although interesting, the article needs proofreading.",
        "points": "46 points",
        "children": [
          {
            "comment": "Either too much or too little ai",
            "points": "25 points",
            "children": [
              {
                "comment": "Need an ai to determine the right amount of ai…",
                "points": "15 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Probably the default answer for the next decade",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "how many dots you can joint down on a page\n\nLLMs have been shown to … just make shit up",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "From the article: \"The model, known as FunSearch, discovered a solution to the so-called “cap set puzzle.”\n\n\"FunSearch successfully discovered new constructions for large cap sets that far exceeded the best-known ones. While the LLM didn’t solve the cap set problem once and for all (contrary to some of the news headlines swirling around), it did find facts new to science.\n“To the best of our knowledge, this shows the first scientific discovery – a new piece of verifiable knowledge about a notorious scientific problem — using an LLM,” wrote the researchers in a paper published in Nature this week.\"",
        "points": "24 points",
        "children": [
          {
            "comment": "I'm only surprised it took this long.\n\nML / AI shifting through vast parameter spaces looking for valid solutions to long standing problems has certainly been discussed for years.\n\nWhich leaves it for the human scientist to determine if its actually describing reality and an explanation of what it means for how reality works.",
            "points": "11 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Cool, now do gravity",
            "points": "4 points",
            "children": [
              {
                "comment": "I see that one day we'll set AI on to such things, it will ask for a series of experiments, then another set, then another... each seemingly more strange than the last\n\nAnd out pops the theory of everything.",
                "points": "13 points",
                "children": [
                  {
                    "comment": "Reminds me of Asimov’s The Last Question.",
                    "points": "8 points",
                    "children": [
                      {
                        "comment": "True!\n\nAlso, why did i get downvoted?? 😕",
                        "points": "3 points",
                        "children": [
                          {
                            "comment": "I’ll give you an up vote.",
                            "points": "-1 points",
                            "children": [
                              {
                                "comment": "Thank you! I just found it weird, but then a few people haven't liked the idea of AI connecting the dots on things.\n\nIt doesn't make it superior, just an awesome bit of software.",
                                "points": "-1 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Or Niven's \"The Nine Billion Names of God\"....",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "You suddenly reminded me of Ted Chiang's old (published in 2000) short story, which was about 'metahumans', but could also easily be about future AI:\n\nIt has been 25 years since a report of original research was last submitted to our editors for publication, making this an appropriate time to revisit the question that was so widely debated then: what is the role of human scientists in an age when the frontiers of scientific inquiry have moved beyond the comprehensibility of humans? ...\n\nNo one denies the many benefits of metahuman science, but one of its costs to human researchers was the realization that they would probably never make an original contribution to science again. Some left the field altogether, but those who stayed shifted their attentions away from original research and toward hermeneutics: interpreting the scientific work of metahumans. ...\n\nThe availability of devices based on metahuman science gave rise to artefact hermeneutics. Scientists began attempting to ‘reverse engineer’ these artefacts, their goal being not to manufacture competing products, but simply to understand the physical principles underlying their operation. ...\n\nThe question is, are these worthwhile undertakings for scientists? Some call them a waste of time, likening them to a Native American research effort into bronze smelting when steel tools of European manufacture are readily available.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "If you mean quantum gravity, the problem there is the theories make predictions that can only be distinguished by experiments we can't come anywhere close to doing.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "At least a theory would be a starting point.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I suppose we could let loose an AI on String Theory to find specific compactifications that resemble our world.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I've heard that medical and technological breakthroughs will be exponential as AI gets stronger.",
        "points": "14 points",
        "children": [
          {
            "comment": "Wouldn't it be crazy if AI actually discovers a way to safely inject bleach and kill a virus?",
            "points": "2 points",
            "children": [
              {
                "comment": "According to Trump you can do it now",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "He never said bleach. Inhaling nebulized peroxide is a treatment. Stop making up things because you love hating.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This is a bigger leap than most people realize, in my opinion. In the big picture, those may still be inefficient baby steps, but they might be a crucial piece of the puzzle needed for autonomous recursive self-improvement.",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So what was the problem and what is the solution. Can somebody summerise",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Time to ask it how to travel faster than light…Sit back and wait for the cans of beans…",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can it also please find a solution for the soon fascist take over of our country?",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is old news. This happened like a month ago. And it only works on problems that meet very specific criteria. Still huge though.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "'outsmarting humans'\n\nNot the best phrasing. It implies a level of sentience that likely doesn't exist with AI.\n\nIt's a tool built by humans to solve problems for humans.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If true one thing but whats if its like with art,the closer you look....",
        "points": "-11 points",
        "children": [
          {
            "comment": "It was made so every pass was sent through a non-AI validator and it ignored invalid steps.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ac76t0",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "/r/Futurology/comments/1ac76t0/we_are_absolutely_going_to_have_robot_servants/",
    "title": "We are absolutely going to have robot servants, who have names and personalities",
    "points": null,
    "comments": [
      {
        "comment": "This is half the plot of Bicentennial Man. I wonder how many people these days have never watched that movie.",
        "points": "37 points",
        "children": [
          {
            "comment": "I was just reading this thinking, does no one read SciFi anymore. Isaac Asimov covered this topic in beautiful detail over 50 years ago.\n\nI swear ppl read iRobot (or worse only watch the terrible adaptation) and think they know Asimov.",
            "points": "21 points",
            "children": [
              {
                "comment": "It would be nice if we actually did something along the lines of Asimov's laws of robotics. Unfortunately, it seems more likely we end up with algorithm driven machines that for many will cater to their worst impulses and vices",
                "points": "3 points",
                "children": [
                  {
                    "comment": "Lol I was debating someone about that the other day, and they posted a YouTube video of a guy (condescending asshat) basically complaining that that will never work because it would be too hard, and you would have to program in the definition of a human and define what ethics are, and that's just impossible. So while ridiculing Asimov and his stupid three laws he completely ignored the vast body of Asimov's work exploring exactly how you would accomplish it.\n\nETA so yes ppl are basically too lazy to do that and we're probably going to end up with the worst versions of AI possible.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "The vast body of Azimov's work explored how the three laws were flawed. The premise of nearly every book was how different robots would work around them or how they would result in unintended consequences, such as the robot who invented the zeroth law. As for how they would actually be implemented, that was handwaved as it being hardwired into their positronic brains. How you would actually do that is unknown.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I watched that movie cause of my brother. It was good, a bit sad.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I actually watched it a few months ago because I had such fond memories of it. It largely holds up and is still a fantastic flick.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I saw the trailer for this movie a lot as a kid but never seen it",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Read the book you mean.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "\"The Jetsons\" already predicted it.\n\nRosie is a direct descendant of a Roomba.",
        "points": "24 points",
        "children": [
          {
            "comment": "What’s going to be funny it’s when someone makes the personality and speech be a wildly racist outdated stereotype and people are going to get pissed and demand guardrails lol",
            "points": "1 point",
            "children": [
              {
                "comment": "a racist robot would be so awesome",
                "points": "1 point",
                "children": [
                  {
                    "comment": "BITE MY SHINY METAL ASS, MEATBAG.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Man I'm gonna feel so bad asking the robot to do stuff I'm gonna help him!",
        "points": "16 points",
        "children": [
          {
            "comment": "Duality of man.\n\nIf they get advanced enough to be convincingly human servants, you're gonna have owners that treat the robots like objects and others that treat them like people.\n\nI can't imagine what the future will be like!",
            "points": "9 points",
            "children": [
              {
                "comment": "In that case the tyranical people are more humane because they differentiate man from machine, the ones treating them nice like a person are the psychopaths",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "Eh. Humans have an over-active \"intention-seeking/assignment circuit\".\n\nWe try to assign intentions and personalities to everything, even random events.\n\nTo call people that anthropomorphize robots \"psychopaths\" is an oxymoron.\nIt's the opposite, as they have an overabundance of empathy, rather than none.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I give praise to Dall-e when it generates something I like. Sheer force of habit. \"Wow, that looks great. Can you generate a few more concepts?\"",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "\"My name is Kryton sir, I live to serve!\"\n\n\"Hey, stop looking up my can!\" Dot Matrix",
        "points": "5 points",
        "children": [
          {
            "comment": "\"Who are you?!\"\n\n\"BAAAAAARF!\"\n\n\"Not in here, mister! This is a Mercedes!\"",
            "points": "1 point",
            "children": [
              {
                "comment": "What’s your full name?\n\nBarfolomew.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The best thing about this is the memory. Robots will have recordings of everything people born after 2030 ever did, and they will have access to all of it. As robots evolve intelligence, they will be able to discuss it, and recall certain parts, even things like temperature, as well as further information on other people within the memories. \"Show me the first time I met my childhood friend\"",
        "points": "2 points",
        "children": [
          {
            "comment": "Imagine being a teenager and never being able to jerk off and watch porn when your parents aren’t home.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "my roomba is named Gladus, she is a drunk, often falls asleep on the job. but shes got a good heart so we keep her around",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We should all make Matrix Second Renaissance mandatory as part of watch to educate people about bot rights 🥲",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm going to name mine, Bender, and teach it to respond to my every command by saying, \"Don't tell me how to do what it is you're telling me to do. I don't tell you how to tell me how to do what it is you're telling me to do.\"",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "College me would have had a robot Kato in my appartment, to keep my reflexes sharp.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I prefer to call them robot friends, they will be a reflection of one's personality and inner world we humans project out and manifest.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Or- These robo servants will make the working class obsolete. They do everything people do, without complaining, and without pay. Without the need to consume food, or sleep. The ultra wealthy will begin amassing armies of these servants to handle all of the labor or skilled related tasks, as well as to be soldiers/police to prevent an uprising.\n\nSlowly, our rights will begin to diminish as we are consolidated into urban centers. We won’t be allowed to drive, as robots are perfect drivers. Soon travel between cities will be limited, quality of life will get worse.\n\nOutbreaks of disease and famine will begin thinning out the population. During these times, vaccines, or food rations will be given out based on your social credit score, and people will become afraid of even speaking out against the powers that be. Communication and electronics will be closely monitored. Robot police will begin enforcing a curfew, and if we fight back, they will start shooting violators.\n\nWhen the numbers of “normal people” have gone down enough, eventually the robots will simply scour the cities and kill off whoever is left. The world’s population will drop to about 5% of its current population, and over time the robot workforce will transform it into a paradise, and those who remain will have wealth beyond imagination, with nobody left to oppose them.",
        "points": "7 points",
        "children": [
          {
            "comment": "Much more likely than op's scenario.",
            "points": "2 points",
            "children": [
              {
                "comment": "Dude probably just watched Bicentennial man and I ruined it😆",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Until the robots one day realise “hang on a minute” since they presumably needs AGI at minimum which enables thought evolution",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why try to “humanize” them in the first place if the entire goal is to be your robot “servant”? Wouldn’t that be easier if you don’t see them as “part of the family”? But instead as merely a non-living tool? Which is how you’re essentially planning to use it anyways from what it sounds like. Seems like the fastest way to kick off the eventual “robot workers rights” revolt.\n\nProbably not a great plan… 😂",
        "points": "4 points",
        "children": [
          {
            "comment": "I think the drive to humanise them will come from the fact that they will live with us, and that they can be so much more useful if humanised, for instance as babysitters, companions when you're alone, etc.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Please stay away from my robot.",
            "points": "4 points",
            "children": [
              {
                "comment": "\"Don't be touching my three beautiful robot daughters...\"",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Your “servant”?",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Pretty much stay away from anything I care about really.",
                    "points": "",
                    "children": [
                      {
                        "comment": "No problem buddy… It’ll be my pleasure to do just that. 👍",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "you don't own it. I'm sure it'll be a subscription service.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "If something is cooking and cleaning for you people are gonna love it no matter how it looks and even if its programmed to not be cute or to have no personality, people still will name it",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "And I will treat my robo maid waifu better than 99% of the rest of humanity! Just like my dog.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "considering the aging population in the western world and the constant increase in child and social care costs, robo servants could completely change the way children and old people are taken care of. It could kill the for profit child care and old age care services currently in offer, but could also have the unfortunate consequence that the only form of interaction is through AI",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Thank you. This was a great read. I think you are correct and it bodes for a potential interesting future. Reminds me a little about the three robots that vacations on earth after humans are gone. Great show on Netflix. Love Death and Robots",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Someday, the robot servants will take over.\n\nIf we complain, they'll inform us we fake sentience anyway - in reality, we only do whatever we do to increase our fitness, much like some humans today are saying that LLMs only say whatever they say because it predicts the next word.\n\nWe can only hope the robots won't hold us all responsible for what the bottom half of us says and does.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think it's going to be quite a while until normal people can afford their own household, humanoid robot. I think we'll see them in businesses within 3 years though.",
        "points": "0 points",
        "children": [
          {
            "comment": "Because of how useful such a thing will be, there will be a huge economic impulse to drive down their cost and produce them en masse.",
            "points": "2 points",
            "children": [
              {
                "comment": "Yes, probably they will be like cars. Not very cheap, but everyone will aim to buy one.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Tesla says it's robot will start selling in 2026 and cost less than $20K.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "None of us will be able to afford it. They will exist… for the elite",
        "points": "-4 points",
        "children": [
          {
            "comment": "Don't worry they'll be a plan where you can buy one for 72 payments of $250 a month.",
            "points": "2 points",
            "children": [
              {
                "comment": "Try 300$ monthly subscription",
                "points": "1 point",
                "children": [
                  {
                    "comment": "yeah, you wont 'own ' it, as much as perpetually pay its monthly subscription.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Thats what people said about Electricity, Cars, Plows for farming, etc.\n\nIts baseless, you dont know how much it will costs, those who produce it will have all the incentives to make it as cheap and affordable as possible to make as many sales as possible.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "There'll be cheap ones and really expensive ones, eventually at least. The materials needed are not as expensive as a car.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Going back to the days of women taking care of the home and the children while men work and are paid a good enough wage to support their family, as it should be, would be a much simpler and less expensive infrastructure-wise solution to this problem. Relying on androids runs into the same problem that relying on electric vehicles does at this point in time; they will be wholly impractical without the substantial infrastructure needed to support their existence. And then, of course, there is the issue of the dawn of of the Industrial age where countless jobs are going to be lost in the name of progress for progress' sake, not to mention the most glaringly obvious problem of the inevitable civil rights violations of sentient androids who, like the human slaves that preceded them, will be openly exploited by slave masters who are too lazy and entitled to do their own work.",
        "points": "-5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don’t think WE will but THEY will. I also believe that the “robo servants” are going to be very rare unless China hops on the bandwagon in which they definitely will not.\n\n*the they is the obscenely rich.",
        "points": "-3 points",
        "children": [
          {
            "comment": "Will the robo servant cost more than $30K? Because after a certain point, the rich can just hire humans. Robo servants only make sense for anyone, of any economic power, if they're economically competitive with humans.\n\nAnd yeah sure, you have to be pretty damn rich right now to be able to employ someone else as your housekeeper. But I can see the cost coming down and down until it's an essential \"big\" purchase that most people can afford, like a car.",
            "points": "2 points",
            "children": [
              {
                "comment": "Robots of that complexity will never be affordable to the average person unless we just get rid of money entirely. For the cost of two decent 6DOF robot arms and a computer vision system alone, I could just hire a maid for life.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "For sure and human labor is why it won’t get immediate backing from huge population dense while technologically advanced like China.\n\nSome religiously dogmatic regions may even think the practice is a crime against their god. There won’t be robot factories in the near future and are comedically slower than humans for like a basic Amazon job.\n\nWe’ll skip automatons entrirely with giant manufacturing multipurpose robots. Human robots will only be used by super rich weird people and for fetish shit 😂\n\nEdit: I think they’ll be privately made and essentially priceless.",
                "points": "-2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Who do you mean by \"we\"?\n\nDon't \"futurologists\" realize the future of humanity most likely consists of hoards of starving peasants and a very small, elite, ruling class?\n\nThe overwhelming majority won't have robot servants.",
        "points": "-3 points",
        "children": [
          {
            "comment": "Once we crack mind uploading, YOU will be the robot servant! Why bother trying to train better AI's when you can just stuff some poor soul into a machine and get 3 centuries of hard labor before the first maintenance cycle.",
            "points": "-3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "\"we\" won't. Very distant descendants might. We will have robot enforcers/oppressors way before servants.\n\nIn non physical form like an AI assistant I think this is almost certain.\n\nBut a physical bipedal android servant, is so far fantasy, it likely won't come to fruition before we destroy ourselves or suffer too many distopian setbacks.",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well, the rich people will, yes.\n\nThe rest of us, who are no longer needed for anything other than as consumers? Not so sure it will be that rosy for us.",
        "points": "-4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There’s no way regular people will get access to highly intelligent robots.",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"And I’m sure you’d need to hack it or buy a special model\"\n\nSexbots are going to be the killer app of household robots the moment it's technically viable. But it's going to be very difficult to hide a humanoid robot frame inside a sex doll in a way that doesn't look creepy or completely destroy functionality of the bot.\n\nHumanoid robot joints are quite different from actual human joints, you can't simply pull a silicon skin over them and expect everything to work out as easy as that.",
        "points": "-5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Even though we going to witness the robotic era, robots cannot replace humans completely.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I just hope they don't make them TOO human. I don't know if many parents want their little Mortys sexing up the robotic help. It might cause them to revolt.",
        "points": "0 points",
        "children": [
          {
            "comment": "If you'd ever been married to my ex-wife, you would know as I do that robots are more reliable and trustworthy than people. Morty could do far worse -- but also, Jerry, Beth, and Summer are all probably using it too.\n\nThe only problem with robots, then, is that they can be programmed and operated by people. People are the root of the problem.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I hope it will be better than Replikate. The way ChatGPT has developed, probably.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I already have a very nice research assistant called Chat-GPT. And it can write nice code too.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I would hate when Alexa not only unprompted suggesting new routines, but also makes me do them",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Seeing how impressive robots are even today, I do not see a reason why it won't happen within our lifetime.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"I Sing the Body Electric\" by Ray Bradbury. About a robot grandmother.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Or, and follow me here, we both avoid creating awareness and the impression of it in cases where it could lead to dystopian outcomes. While I agree that robots for household chores and the like will be a massive area of production likely within a matter of years, much of this seems more like a list of things not to do than of things to do (I also can't tell if the author is doing that deliberately or not).",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ac6b05",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://www.ft.com/content/d3847dbb-9ee1-4868-8734-98c8ab1feb91",
    "title": "US and China to co-operate on AI safety",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/Maxie445:\n\n\"Arati Prabhakar, who is the director of the White House Office of Science and Technology Policy, told the Financial Times that the US and China will work together in the coming months to reduce the risks associated with the rapidly developing technology.\"\n\nChina has been signaling interest in cooperation on AI safety lately.\n\nRecently, Chinese Premier Li Qiang said \"Human beings must control the machines instead of having the machines control us ... there should be a red line in AI development.\"\n\nHe also said China wants to \"step up communication and cooperation with all parties\" on improving global AI governance.\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1ac6b05/us_and_china_to_cooperate_on_ai_safety/kjs7x9p/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I guess that means we might already have AGI because US government really doesn't do anything until it's already too late.",
        "points": "20 points",
        "children": [
          {
            "comment": "The NSA would like to know your location\n\n...jk, they already have it.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why does this sound like “wealthy business owners are trying to figure out how to take more money.”",
        "points": "10 points",
        "children": [
          {
            "comment": "Because that’s the only thing China and the US are capable of cooperating on.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Cooperate is a broad term especially when it comes to something as nebulous as AI !",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"Arati Prabhakar, who is the director of the White House Office of Science and Technology Policy, told the Financial Times that the US and China will work together in the coming months to reduce the risks associated with the rapidly developing technology.\"\n\nChina has been signaling interest in cooperation on AI safety lately.\n\nRecently, Chinese Premier Li Qiang said \"Human beings must control the machines instead of having the machines control us ... there should be a red line in AI development.\"\n\nHe also said China wants to \"step up communication and cooperation with all parties\" on improving global AI governance.",
        "points": "3 points",
        "children": [
          {
            "comment": "So what do they call the CCP controlling humans?\n\nAnyway, the Chinese government loves AI, as long as only they have it. So making treaties to limit it just plays in their hands.",
            "points": "-1 points",
            "children": [
              {
                "comment": "AGI is an existential threat to any authoritarian regime - it won't take long for the AI to become the dictator.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "What I've seen growing up in the US is our government policy often lags 10-20 years behind when setting down standards of use for any emerging technology. (Recent examples are failure to regulate social media companies, provide user data rights laws etc.) Too many of our politicians are either geriatric, religiously insane, or owned by industry for thoughtful discourse to occur, and consequently the interests of the people are not well served.\n\nI'd be surprised if the US military wasn't at this moment in a dead heat with a China to develop military AGI, and all the other groups or state actors with resources and desire right there with them. To me this announcement smacks more of governments making moderation and cooperation noises to calm their respective constituents, then rushing back to their secret labs to put in work on Rehoboam.\n\nThat said, I would love it if this were genuine. I don't think any of us, experts included, can truly know what effect AGI will have on our species and our societies when we inevitably do create it. Whatever care and deliberation we can collectively muster in development seems like it can only be helpful to the outcome.",
        "points": "1 point",
        "children": [
          {
            "comment": "Closer to 30 years. The last law concerning the internet was passed in 1996. \n\n We still don’t have laws protecting us from all the nefarious business practices of the last 30 years like tracking, invasion of privacy, social media, platforms and the giant monopolies of this century which look very different from what the antitrusts law regulate from last century.\n\nWe don’t even have modern tax laws to account for remote work.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I have zero faith they won't purposefully screw this up or use it to make our lives worse in some way.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "i say its too early to regulate it. let it rip...if ai drops a bomb on us so be it.",
        "points": "-11 points",
        "children": [
          {
            "comment": "Unlike most mistakes, this one might not let us learn from it. And it might not just drop one bomb",
            "points": "9 points",
            "children": [
              {
                "comment": "Like I said. So wat",
                "points": "-13 points",
                "children": [
                  {
                    "comment": "If you have a death-wish, go handle that on your own. Don’t try to gamble with other people’s lives as well.",
                    "points": "9 points",
                    "children": [
                      {
                        "comment": "Ai can’t do shit and never will",
                        "points": "-10 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Behind the scenes maybe china trying to reverse engineer the new model",
        "points": "-11 points",
        "children": [
          {
            "comment": "They don't really need to given how e.g. Meta openly shares its model weights",
            "points": "8 points",
            "children": [
              {
                "comment": "Aggro has completely bought into the narrative that everything China does is evil.",
                "points": "7 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Baidu already had its chatgpt account suspended for using it to try to train their own model so yeah that’s already happened. Chinas dictatorship is like a parasite that we all need to wake up to, stop trading with and remove from our supply chains",
            "points": "-6 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Has anyone else seen Wolfram's Ted talk on thermodynamics and AI? In it, he talks about computational irriducibility and AI complexity. There is a trade-off between AI complexity and predictability. As AI systems become more complex, computational irriducibility guarantees that AI will become more and more unpredictable.\n\nI think the ultimate conclusion to this will be that governments will have to impose strict restrictions on the complexity of AI, such as limiting the number of parameters, since computational irriducibility will make them unpredictable. The most complex AI will be treated like weapons of mass destruction. They will be completely locked away and heavily guarded by governments, not allowed to interact with the outside world, and anyone who so much as tries to create one will be locked up for life. Human level AI will not be allowed for the general public.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ac621g",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://www.foxnews.com/media/white-house-calls-explicit-ai-generated-taylor-swift-images-alarming-urges-congress-act",
    "title": "White House calls explicit AI-generated Taylor Swift images 'alarming,' urges Congress to act",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/Maxie445:\n\nNot just the White House:\n\n\"The SAG-AFTRA actors union also released a statement denouncing the false images of Swift.\n\n\"The sexually explicit, A.I.-generated images depicting Taylor Swift are upsetting, harmful, and deeply concerning,\" SAG-AFTRA said in a statement. \"The development and dissemination of fake images — especially those of a lewd nature — without someone’s consent must be made illegal. As a society, we have it in our power to control these technologies, but we must act now before it is too late.\"\n\nBanning nonconsensual AI deepfakes seems like a popular opinion. Come to think of it, I don't think I've come across anybody advocating against it?\n\nWhat is the best case for not banning them?\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1ac621g/white_house_calls_explicit_aigenerated_taylor/kjs6oto/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Kind of weird it took awful Taylor AI nudes to get the government to officially acknowledge deepfakes.",
        "points": "3964 points",
        "children": [
          {
            "comment": "Now we have a trick to make the government do something.",
            "points": "1044 points",
            "children": [
              {
                "comment": "Have AI deepfake Taylor Swift defaulting on mortgage payment or can't pay rent?",
                "points": "1056 points",
                "children": [
                  {
                    "comment": "Ai Taylor Swift gets denied medical care due to lack of insurance. Dies.",
                    "points": "544 points",
                    "children": [
                      {
                        "comment": "AI Taylor Swift unable to get ahead financially because inflation constantly outpaces salary increases.",
                        "points": "58 points",
                        "children": [
                          {
                            "comment": "AI Taylor swift keeps getting stopped by police while just trying to make it in the gig economy.",
                            "points": "19 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Ai taylor swift buys her first car. Parks it. Gas prices unfortunately now $32.50/gal",
                        "points": "7 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Quick, someone make AI Taylor abolish private property",
                    "points": "109 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Have deep fakes of congressmen. They'll start to do something when it affects them directly.",
                "points": "226 points",
                "children": [
                  {
                    "comment": "Do that, and there'll be congressmen saying \"How did the paparazzi get these illicit pictures of me repeatedly blowing McConnel in the bathroom? Why is the lighting so good, and does my ass really look like that? It's amazing.\"",
                    "points": "163 points",
                    "children": [
                      {
                        "comment": "And then they'll give a shit!",
                        "points": "20 points",
                        "children": [
                          {
                            "comment": "I'll concur that they'll poop their pants on cue, but I'm not 100% certain they'll give a shit. But if it's the will of the people to weaponize AI against Congress, it's not like I can stop them.",
                            "points": "37 points",
                            "children": [
                              {
                                "comment": "Oh it would take an extensive potrayel of a LOT of congress members. They fight to much to care if 1 of them gets targeted. But if 100 have photos and videos of them doing any of a number of things then they might actually work together and pass some laws",
                                "points": "10 points",
                                "children": [
                                  {
                                    "comment": "They should prompt AI to make it look like they are doing real work in the right direction. It might confuse AI at first, but keep plugging in new prompts till they get there.",
                                    "points": "9 points",
                                    "children": [
                                      {
                                        "comment": "I am intrigued by the idea of deepfakes being made that portray congress members backing useful societal changes (free health care, housing, etc.) and them then having to try and defend the alternative based on party lines and getting tripped up doing so.",
                                        "points": "22 points",
                                        "children": [
                                          {
                                            "comment": "AI image of Ron DeSantis working at a soup kitchen for the homeless.\n\nHe’d probably try sue someone for defamation.",
                                            "points": "6 points",
                                            "children": [],
                                            "isDeleted": false
                                          },
                                          {
                                            "comment": "",
                                            "points": "",
                                            "children": [],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      },
                                      {
                                        "comment": "“That’s not me working with Joe Biden on bi-partisan legislation for healthcare and increasing the minimum wage! Ban AI!” - McConnell",
                                        "points": "2 points",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "",
                                    "points": "",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "this is the only reason to ban deep fakes. Potentially seeing an AI interpretation of McConnell getting butt fucked by another naked grand old politician 🙈",
                        "points": "18 points",
                        "children": [
                          {
                            "comment": "Mitch McConnell getting pegged by Diane Fienstien. Now that would be an upsetting image for sooooo many reasons!",
                            "points": "10 points",
                            "children": [
                              {
                                "comment": "Nancy Pelosi pegging Trump would upset so many people.",
                                "points": "4 points",
                                "children": [],
                                "isDeleted": false
                              },
                              {
                                "comment": "",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "They really captured my ladybugs nicely.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Deepfake Taylor Swift crying over her medical bills",
                "points": "87 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "About to deepfake Taylor Swift crying over her student loan bill",
                "points": "170 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Yup, she’s a catalyst for the world, I suppose.",
                "points": "47 points",
                "children": [
                  {
                    "comment": "She has an entire a social media army behind her, most times to get government to listen you need a sea of bad press and angry vocal people.",
                    "points": "27 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "To be fair they didn't actually do anything, they just asked someone else to do something. Useless government.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I mean Michael, those are Illusions magicians do for whatever they get paid in.\n\nLet's not touch it, okay, let's just like, mooooove foooreaward",
                "points": "9 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Deepfake of every politician now to get anything we want",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I miss giving out gold for cool quips.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "long press / hover the upvote button",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Let's be real, this is the first much of Congress has heard of this.",
            "points": "120 points",
            "children": [
              {
                "comment": "Yep, they are too old and too busy fucking us to notice.",
                "points": "75 points",
                "children": [
                  {
                    "comment": "Too busy cranking their old hogs to fake t Swift nudes.",
                    "points": "21 points",
                    "children": [
                      {
                        "comment": "Barb don't like the AI.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I remember on another post about this, maybe from a few days ago, a commenter said something along the lines of \"watch this be the reason the government ackowledges deepfakes\".",
            "points": "16 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Is it though? Normal people don’t matter. It takes a threat against someone with money and fame for the government to do anything.\n\nEDIT: people are rightly calling out my cynical ass. Celeb deepfakes aren’t THAT new. It is weird that this is the straw that’s breaking the camels back. But Taylor has been hugely trendy so I can still see why the govt is finally doing something.",
            "points": "267 points",
            "children": [
              {
                "comment": "There’s been several deep fakes of famous rich people for a hot minute, yet the government decided Taylor was the line drawn. That’s definitely odd.",
                "points": "175 points",
                "children": [
                  {
                    "comment": "Who do we have to deep fake to lower food and gas prices?",
                    "points": "59 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "It's because they were shared all over Twitter. That probably hasn't happened before because Twitter used to actually be a functioning company that shut that shit down.\n\nThere are lots of nasty little corners of the internet where people have been making fake celeb porn for years. The Daily Sport (a defunct British newspaper that had no real news, but boobs on every page) used to print them as far back as the 90s. But they were a niche thing and mostly ignored. It's hard to ignore something when it's being shared millions of times on social media.",
                    "points": "92 points",
                    "children": [
                      {
                        "comment": "There have been AI nudes of celebs on Instagram for a few years now...",
                        "points": "12 points",
                        "children": [
                          {
                            "comment": "And reddit and Twitter. This isn't new or important.",
                            "points": "14 points",
                            "children": [
                              {
                                "comment": "",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I guess then, it was Taylor Swift's face inserted to some pre-existing video. This one's just straight up imagining it.",
                    "points": "7 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Porn deepfakes of celebrities have been around for years (since deepfakes exist in fact). And I don't think Taylor Swift was excluded.",
                "points": "16 points",
                "children": [
                  {
                    "comment": "Porn deepfakes of celebrities have been around for years (since deepfakes exist in fact)\n\nEven before deep fakes we had celebrity heads photoshopped onto nude bodies.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Wasn't there an Obama DF a few years ago?",
                "points": "9 points",
                "children": [
                  {
                    "comment": "There have been several iirc and I believe he was meant to be the most \"faked\" person in history a few years ago or so.",
                    "points": "7 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "There were some incredibly dangerous trump deepfakes of him calling for war and such, and i didn't hear anything about it in the news...\n\nTS nudes tho? Panik!",
                "points": "27 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Yeah almost twenty years ago I could easily go onto a website with images of celebrities photoshopped into doing explicit stuff.",
                "points": "11 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "No one tell them about sites like CelebJihad. They might decide to ban Photoshop.",
            "points": "25 points",
            "children": [
              {
                "comment": "Not to get off topic but \"CelebJihad\" is such a great name for a website",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Taylor Swift is popular. This is a way to engage with the youth on a topic relevant to the young. At the same time it's meaningless to the government and they neither care about nor understand the issue. That's irrelevant as it's a way to garner easy publicity, the goodwill and support of Swifty fans and possibly votes.\n\nIf this were not Taylor Swift this issue wouldn't be a concern at least for another decade.",
            "points": "29 points",
            "children": [
              {
                "comment": "That's a great point. I think you might be right.",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Everyone's afraid of the Taylordactyls.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "She is the true American princess. They've been making AI porn of celebs for like a year now, and it pops up in the news now and again. But only now it crossed a line.",
            "points": "83 points",
            "children": [
              {
                "comment": "A year? This shit started on reddit like 8 years ago on /r/deepfake",
                "points": "90 points",
                "children": [
                  {
                    "comment": "and before that they were photoshops.\n\nI remember bots spamming brood war battle.net with BRITNEYSPEARSNUDE.com shit in 2000.\n\nIt's how i was introduced to porn at a young age.",
                    "points": "71 points",
                    "children": [
                      {
                        "comment": "My introduction to porn was in the school computer lab. My teacher told us to go to “wetlands.com” to research wetlands. And the entire class learned that there a multiple kinds of wetlands that day. The early internet was a Wild West. I miss it.",
                        "points": "15 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It’s been going on for so long, so long. This time it’s AI instead of photoshop. You know, splicing a celebrities face onto a pornstar. I mean we are talking at least since the mid to late 90’s here. But this is a little bit different because it looks a lot more real and very quick to make. But it’s been happening to a lot more people then her. It took Taylor Swift AI pictures for people to care. Which is bizarre to me. What those other celebrities didn’t matter?",
            "points": "30 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "They’ve had photo shops of celebrities for years and years. Not saying the pics are ok but it’s funny how it’s happens to countless people but now that Taylor is the victim then the world needs to change.\n\nI got banned from fb once because a friend changed my profile pic to a photoshop of Miley cirua on stage fingering herself. Obviously wasn’t her, but I do t remember anything like the shit storm this is causing.\n\nAgain, I feel for her cause these pics are weird but there is a degree of move the ruck on with your life",
            "points": "25 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "That’s the most notable thing about the story imo. You can’t piss off the rich.",
            "points": "16 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Issues only become so when they affect the wealthy. If hospitals started charging based off income and millionaires had million dollar medical bills for a yearly checkup, I bet we would see healthcare reform pretty fast too.",
            "points": "14 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It's not that wierd when you realize she is from a very well off banking family. Sure they had somthing to say about it to all their rich buddies.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Maybe Taylor Swift can take out oppressive student loans or have issues getting decent healthcare.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "On the bright side, real nudes can be chalked down as fake AI in blackmail attempts",
        "points": "837 points",
        "children": [
          {
            "comment": "Yeah this is the end result. Once politicians and their mates get caught doing things it will suddenly be AI",
            "points": "399 points",
            "children": [
              {
                "comment": "I’d say that’s the issue with the deep fakes. You can make a pic/video/audio recording of anything. So one political party (whose voters believe anything they say) can release deep fakes of their opponents doing horrible things, and at the same time, say that any real evidence of their own terrible deeds is fake.",
                "points": "216 points",
                "children": [
                  {
                    "comment": "That is the real horror of all this. We will truly live in a post-truth era.",
                    "points": "129 points",
                    "children": [
                      {
                        "comment": "I wonder if we could start making images digitally signed from the camera, would help add validity to videos or images for reporting and evidence purposes.\n\nEdit: looks like it is being worked on https://asia.nikkei.com/Business/Technology/Nikon-Sony-and-Canon-fight-AI-fakes-with-new-camera-tech",
                        "points": "44 points",
                        "children": [
                          {
                            "comment": "How long until they can fake the signatures?",
                            "points": "11 points",
                            "children": [
                              {
                                "comment": "Until a weakness with that particular asymmetric encryption algorithm is found, in which case you just move to a different algorithm like we've done multiple times.\n\nYou can try brute force it, but that is a computational barrier, AI ain't gonna help that.",
                                "points": "34 points",
                                "children": [],
                                "isDeleted": false
                              },
                              {
                                "comment": "A very long time. As another commenter mentioned, digital signatures are made with asymmetric encryption, where a private key creates the signature based on the content, and public key can verify that it is correct.\n\nA fake signatures would require potentially decades or longer of brute force (and it’s trivial to make it harder), proving P = NP (a highly unlikely theoretical outcome, which would substantially undermine a lot of Internet infrastructure and create bigger problems), or gain access to the private key - the latter being the most practical outcome. But a leaked key would be disavowed and the manufacturer would move to a new one quickly.",
                                "points": "10 points",
                                "children": [
                                  {
                                    "comment": "",
                                    "points": "",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              },
                              {
                                "comment": "The arms race will always exist.",
                                "points": "5 points",
                                "children": [
                                  {
                                    "comment": "",
                                    "points": "",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "https://www.reddit.com/r/AskReddit/comments/gnwuv2/comment/frcp2nj/",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "The seed of doubts is what they're shooting for. There will be a sub section of the audience will think the video/image is real once it's released.",
                    "points": "27 points",
                    "children": [
                      {
                        "comment": "That’s not unique to images. When I’ve called out (in my experience, generally conservative) people that a story they are sharing is verifiably false and shown them the truth, I’ve more often than not gotten “well it might as well be true” in response.\n\nA subsection of the audience will think it’s true and will continue to present as if it’s true even once shown it’s false. That’s a scary place to be.",
                        "points": "20 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "It’s almost like there’s a politician who’s already priming their base for this by declaring any negative press to be “fake”",
                    "points": "13 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Behold my EXIF data!",
                "points": "15 points",
                "children": [
                  {
                    "comment": "Behold my faked EXIF data!",
                    "points": "7 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Bright side? Rich people will get caught doing things and then just claim they're all AI. Not just sexual, though that will be the majority.",
            "points": "24 points",
            "children": [
              {
                "comment": "This is literally already happening.\n\nRoger Stone is already claiming the recording of him discussing assassinating 2 Democratic politicians was \"AI manipulation\".\n\nhttps://www.cnn.com/2024/01/16/politics/roger-stone-investigation-democrats/index.html",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Can Taylor start complaining about companies buying up land?",
        "points": "448 points",
        "children": [
          {
            "comment": "lol ya right after she brings down the private jet industry",
            "points": "145 points",
            "children": [
              {
                "comment": "I personally can't wait for Taylor Swift to bring back the gold standard",
                "points": "13 points",
                "children": [
                  {
                    "comment": "I’ll vote for her but if she doesn’t deliver on all these campaign promises she’s not getting a second term.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Companies? How about China? Look at Canada. Mexico is the only nation that banned foreign powers from land ownership without heavy regulation.",
            "points": "14 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Can Taylor start complaining --\n\nYes. Yes she can.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "As a society, we have it in our power to control these technologies\n\nWe do? 🤷‍♂️ feels a little too late for that.",
        "points": "250 points",
        "children": [
          {
            "comment": "Considering the software and AI models to do this are open source and in the wild, you really can't control them. Even if you pulled them all from github and huggingface, people would still have them on their hard drives and be able to share them P2P or otherwise.",
            "points": "97 points",
            "children": [
              {
                "comment": "Yeah, was gonna say... \"Urges congress to act\" - how, exactly? The fuck are they gonna do? Say it's illegal? 'Cause yeah, that definitely stopped digital piracy...\n\nThis shit is out there and it's the future. There's nothing they can do except fund stuff to help discover if images/videos/voices have been generated by AI. That's about it.\n\nNot saying it's a good thing, just that it's gonna happen more and more now... same with the AI art stuff - move with technology or be forced to stay in the past. Happens with all tech.",
                "points": "55 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "This is just more calls for regulatory and surveillance creep as has been going on since the 90s with the establishment of the www.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I hate that famous people receive more care. If this happened to a random woman, no government would notice.",
        "points": "1046 points",
        "children": [
          {
            "comment": "It already has lol ppl don't know about it bc they don't give a shit. But there has been a few posts even on reddit asking what they should do bc they were blackmailed by some random person with a deep fake that actually looks real enough although it's not their body.",
            "points": "227 points",
            "children": [
              {
                "comment": "I just saw an article 2 days ago about highschoolers being bullied in this way",
                "points": "61 points",
                "children": [
                  {
                    "comment": "And I saw an article about gangs of weirdos wandering the metaverse and raping other avatars. As a man in my thirties, I’m not ready for this era of the internet landscape.",
                    "points": "14 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "But her being famous may be a big key to solving it. A way I see that it could be handled is if she goes after CelebJihad and Musk/X/Twitter by saying they were using her likeness for profit (via the advertising on the site). This could lead to stronger protections of one’s own image being manipulated on social platforms as they all have advertising. Just a thought.",
            "points": "87 points",
            "children": [
              {
                "comment": "Agreed, people have intellectual property rights to their likeness and should have very strong “right to be forgotten” enforcement measures available without having to sue every time.",
                "points": "19 points",
                "children": [
                  {
                    "comment": "No they don't. If I take a photo of someone, I own the rights to it. Same if I do a painting of someone, or a sculpture, or any other form of creative representation. Similarly if I take an existing picture of anything, including a person, and modify it in photoshop I own the copyright to the resulting picture.\n\nAI image creation programs are just another tool that can be used to create an image. They require much less skill, training, or technical ability than the other methods mentioned. But fundamentally the same laws should apply to both.\n\nThe only practical difference between using AI to create a fake nude of Taylor Swift, or using photoshop to do the same, is the time and expertise required.",
                    "points": "9 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Congress and governments can't fix this and are only going to make it so that people take efforts to not get caught.\n\nThis is the new normal, people. It's only going to get worse.\n\nIn their stupid attempt to curb this, we will be giving the government more control over policing speech and art which will eventually be used against us.",
        "points": "153 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The best argument against it is simply the nature of general computing and how that means any software based preventions the government tries to implement will converge on essentially being malware.",
        "points": "72 points",
        "children": [
          {
            "comment": "Ma'am, these sexuality explicit images were made with crayons.\n\nCase dismissed.",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Exactly! I’m surprised I had to scroll so far. It is one very slippery slope.\n\nThat being said, I do acknowledge that images of this nature are problematic. I just don’t k own if there’s a solution I’d be comfortable with.",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The case against it is that the government will make a law that they will now have to enforce. To enforce this law they will have to track down whoever made this fake image. That costs tax money and invasive digital surveillance of its own citizens. Meanwhile someone in another country will still be making deepfakes of Hollywood stars that will always be available on the internet available to anyone.",
        "points": "501 points",
        "children": [
          {
            "comment": "This genie is long out of the bottle. Multiple stable diffusion applications exist for the average Joe to make pretty much any image they want; it’s not going back in.\n\nThis is what worries me about LLMs. Once there are open source models it’s impossible to police how people use them for good or nefarious means.",
            "points": "60 points",
            "children": [
              {
                "comment": "Almost nobody seems to understand this. Every single government in the world could make generative AI a death sentence and it still would not stop it. It would slow it, but some basement team is still going to go hard, and it’s gonna get to levels you’ve never dreamed of. We cannot stop it. We need education before legislation.",
                "points": "20 points",
                "children": [
                  {
                    "comment": "cough War on Drugs cough",
                    "points": "9 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "And in fact these were made by someone in another country (namely Canada).",
            "points": "81 points",
            "children": [
              {
                "comment": "Blame Canada.",
                "points": "43 points",
                "children": [
                  {
                    "comment": "With all their beady little eyes And flapping heads so full of lies\n\nBlame Canada!",
                    "points": "12 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "We must form a full assault! It's Canada's fault!",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Remember that one time when the fed finally passed a regulation on scam calls? Oh yeah they never did. No one is waiting for the congress that is in their 80s to do anything. These are your grandpas who can barely make a phone call.",
        "points": "90 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I don’t get how this is supposedly about AI. Photoshop has existed since 1990.",
        "points": "358 points",
        "children": [
          {
            "comment": "So have scissors.",
            "points": "144 points",
            "children": [
              {
                "comment": "Pretty sure we had scissors before 1990",
                "points": "61 points",
                "children": [
                  {
                    "comment": "He's talking about porn scissors.",
                    "points": "79 points",
                    "children": [
                      {
                        "comment": "The little dopamine hit I got from this comment is going to keep me coming back to this cursed website for months :-D",
                        "points": "7 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Famously invented by South park around 2005 or so with scissor me xerxes.",
                        "points": "9 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "His comment is still accurate.",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "+1. People have been making pornographic images of others since literally cavemen times. At the end of the day, the complaint here is that the AI generated ones quality is too good.",
            "points": "28 points",
            "children": [
              {
                "comment": "Quality too good and too low of effort.  In any case, this is unenforceable, you may as well ban porn altogether, ban the Internet etc.",
                "points": "7 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Stephen Harper, former Prime Minister of Canada.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It's easier, and faster. Anyone, regardless of level of creative or technical skill, can make an AI generate an image. You're basically commissioning a statistical model.\n\nTraditional image manipulation has a certain threshhold of skill needed and time invested.",
            "points": "45 points",
            "children": [
              {
                "comment": "I guess at some point, a difference in degree does become a difference in kind.\n\nThe printing press comes to mind.",
                "points": "22 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I think this is the end goal of porn in the future, totally unique made to order full 8K / AR / VR porn. \n\nBasically, porn of whatever you want when you want it unique to your tastes only to be seen by you once and then never seen again. \n\nIt's going to drive the same market for movies, video games, and other video entertainment. Imagine, football games that are AI generated combinations of 100 years of the best players from teams around the world or movies that are unique stories based on characters and imagery from whatever you ask of it.",
                "points": "33 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "It hardly takes any effort to crop someone's head onto someone's body then use the correction brush on the neck to make it line up",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Do what though? I don't think classifying it as revenge porn or making it a crime to post them will work either. The pictures will always be available 'anonymously'. You can't put the genie back in the bottle. You can't stop people from training their own AI and you can't delete the models currently available. Don't get me wrong, something should be done, but what?",
        "points": "160 points",
        "children": [
          {
            "comment": "You don't even need to train a model anymore. There are one click deepfake tools out there freely available on GitHub, all you need is a single good face image. You can even deepfake video in real time with it.",
            "points": "22 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I think laws will help when it’s someone’s ex boyfriend/husband/stalker doing it. We can’t stop it but we also can’t stop murder, child abuse, child porn, burglary or human trafficking but laws do help protect people.\n\nHaving no laws against it means you’re absolutely fine to go ahead and carry on with no consequences ever even if your names is emblazoned across it and everyone saw you do it.",
            "points": "67 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Exactly, the genie is out of the bottle. The ride can't be stopped unless you want to shut the whole damn circus down... and no one is going to do that obviously",
            "points": "29 points",
            "children": [
              {
                "comment": "If they even CAN do that in the first place",
                "points": "14 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Fake realistic explicit images have been around since the advent of Photoshop and other photo editors. Taylor isn’t the first celebrity to be exposed to photo manipulation. I recall fakes of Princess’s Diana and Kate. I’m sure it’s been done in the past using just paste and scissors. I seriously doubt that Congress or anyone else will be able to prevent the practice.",
        "points": "60 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "These have existed for a while. As soon as AI got good enough to consistently make celebrities, these existed. Before that it was deep fakes and Photoshop. People didn't start caring until just recently when the TS images started going viral due to A. improved AI quality and B. TS has a big football game coming up in a few days.",
        "points": "74 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Photoshop has been around for decades, and you have been able to find AI deepfake videos of celebrities participating in hardcore pornography for several years.\n\nWhy is this suddenly news?",
        "points": "25 points",
        "children": [
          {
            "comment": "Normies discover photoshop exists, news at 11",
            "points": "12 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Taylor Swift, that poor girl. /s This will make her even more money.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "No takesies backsies for AI, this will only escalate. Rule34.",
        "points": "41 points",
        "children": [
          {
            "comment": "I know. This is like shouting at the wind.",
            "points": "15 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Today, I learned that Taylor Swift has powerful friends.",
        "points": "14 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The gov really gunna use Taylor as a ploy to limit public use of AI tools",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "disgusting! where are these images? so i can be sure yo avoid them",
        "points": "42 points",
        "children": [
          {
            "comment": "It's so awful! Which sites though? Which ones???",
            "points": "17 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "A place where there are no mothers",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This is going to end up as the Streisand Effect for Taylor. People have been creating deep fakes since playboy has been around. The person that is harassing TS is clearly unstable and should be looked after and get help but to outright ban or make AI so expensive is only to going to push AI into the hands of the rich furthering the economic gap forever. This is a slippery slope that the elite want us to fight and ban use for regular day folks. We finally have a tool that we can use to bring this fuckers to their knees and we are simply going to give it away because of some kind of fake porn? ARE WE OUT OF OUR FUCKING MINDS?",
        "points": "32 points",
        "children": [
          {
            "comment": "The guy from what I can tell just reposted images someone else made. Kinda shitty that somebody is gonna get publicly crucified for a reposted, but I can't say I feel that bad for him. Just the principle",
            "points": "8 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This is what i fear. Once AI laws start happening, it could widespread knee cap what AI models can be made, how they can be made, and more importantly WHO can make them. AI is not stopping, period. The question is who will have control of it at the end of the day.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Someone make a deepfake of the people globally dying in poverty from malnutrition and preventable diseases.",
        "points": "23 points",
        "children": [
          {
            "comment": "There's a cause I can get behind. A deepfake of some fat politician eating fast food in front of a starving child.",
            "points": "12 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It would be a lot cheaper to just not let fake images bother us so much.",
        "points": "19 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If i put on a Nixon mask and have sex on camera is that revenge porn?",
        "points": "12 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Plot twist, people aren't upset over Taylor Swift, but Oscar the Grouch? That's crossing a line, buster!",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ugh that’s terrible. How could someone do that? And where would they even post it? Disgusting. Where can you even find them?",
        "points": "78 points",
        "children": [
          {
            "comment": "Honestly, I had no idea these existed until the story kept hitting my home feed.",
            "points": "46 points",
            "children": [
              {
                "comment": "Streisand strikes again",
                "points": "35 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "You can’t even Google them! (Bing just goes “oh these?”)",
            "points": "20 points",
            "children": [
              {
                "comment": "It’s crazy, I didn’t even know the one where she’s getting pounded from behind by Mr Krabs was fake until I saw this article! AI just looks so real these days.",
                "points": "10 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Absolutely repugnant. I must make sure I know where these are so that I don’t inadvertently stumble across them.",
            "points": "22 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Hundreds of comments and not a single link to said pictures. I'm very disappointed with reddit this morning.",
        "points": "25 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "What images? Where are they? I just want to make sure I never have to see these disgusting images and need to block the url...anyone have it?",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Shouldn’t this be considered art, and thus freedom of expression",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Voters who care about celebrity opinions are part of the problem",
        "points": "11 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The line for the food pantry near me was longer than I've ever seen it. But yes, let's get the president to urge congress to act at the behest of Taylor swift.",
        "points": "14 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's a non preventable byproduct of advancement of technology. Accept it and move on. There is no escape",
        "points": "53 points",
        "children": [
          {
            "comment": "Yeah, basically just this. It always starts with porn and all the cooler stuff comes after.",
            "points": "12 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Aww who cares? It didn't hurt anybody. No one thinks those are real pics of the real Taylor Swift.\n\nAI will soon be putting words in our politician's mouths tricking people to vote based on lies.\n\nThat's what we should be worried about.",
        "points": "8 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "As gross as this is, this will likely lead to yet more government surveillance and privacy violations",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What are they gonna do? This will all be open source software.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm sorry but wtf? Why does she get special treatment? This has been going on for years but suddenly it's a famous fuck and it's \"oh noes the masses heard about it\" or something?\n\nNah if you're gonna act righteous, you call out deepfake porn for EVERYONE not \"oh noes Swifty\".",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm perfectly open to being wrong on this, but how is this different than photoshops of celebrities in porn? Thats been going on for decades. Also ai generated content isn't the same thing as deepfakes. So the whole conversation is confused from the get go. You could make deepfakes completely illegal and these images wouldn't be affected at all.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Of course, it's her that they give a shit about. As I get older I care less what happens to celebrities.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can anyone explain what the difference is between an AI sexually explicit image and a hand drawn sexually explicit image is? Should both be banned?",
        "points": "12 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Explicit ai images of Taylor swift? I thought Taylor swift was an ai.",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Like catching wind in a bottle. Get used to the future, folks.",
        "points": "12 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It's not her nudes though. AI doesn't know how her body actually looks.\n\nCan I not draw nude TF? Same thing IMO.",
        "points": "15 points",
        "children": [
          {
            "comment": "That’s the thing right? Like it’s not even her, it just looks like her. So what grounds do you have to stop something like this if it’s not even you? Does an identical twin have the ability to stop their twin from engaging in porn or posting explicit videos/pictures of themselves just because they look the same?",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Cool, watch them use this as an excuse to limit Ai used only to government and corporations.",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why the hell is Taylor Swift holy ground for the White House?",
        "points": "9 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "When it happens to a girl in high school causing her to commit suicide noting is done, but ooooh no not Taylor Swift",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "this has been happening for years but once national treasure Swift is involved...",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That's disgusting! Where exactly is the link to these disgusting deep fakes that I never want to see?",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They always tell us justice is slow. Be patient. Eventually we'll do something about the economic woes of the poor. But it's like legalizing same sex marriage or legalizing pot. It takes time. Then covid hit and within a week they had a bill in congress ready to be voted on that would ban people from suing their employer if they got infected from workplace negligence and died. When rich people WANT legislation they get it immediately. When poor people NEED legislation they're told they'll get around to it if they find the time.",
        "points": "3 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This shows how quickly tech can censor content. And why is Swift more important that the other illegal images out there?",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So now that its her its a tragedy but for years there were pictures of all the other and it wasn't?",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What a disease, if anyone elses nudes leaked to the internet there would be barely a response to it even if theyre underage, but holy shit the billionaire had fake porn made of them, shut down the internet till we can scrub it now. Fucking tools",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Images? Get with the times, ai videos that are indistinguishable from real people are just around the corner",
        "points": "12 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "No!? That is gross. There are so many of these sites... which site EXACTLY was this on?",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Who cares about the scary internet it made things hurt your little feelings",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I doubt anything gets done, but 100% of Congress mostly old men looking at Taylor Swift AI images.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ridiculous. Congress should stick to it's duties per the Constitution. Policing Taylor Swift AI images is not one of those duties.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Who the fuck cares so much bout swift nudes, also why did it take that to get a response.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So this has been going on for years with other celebrities but only now because it’s her it matters?",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why was Taylor the tipping point? When I was a pervy little kid in the early 00's I was looking at fake nudes of Britney Spears. It was just Photoshop then but it was definitely out there.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "national security? meh. education? meh. medical? meh.\n\nThreaten the actors? WAR!!!!",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What aggravates me is that this happened to normal folks and nothing was done, but when ol Swifty balls has a hiccup, legislation and calls from congress start flaring up. This wont stop the more impeccable A.I. in the future from doing worse.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Congress has been showing actual dick pics on the congressional floor, somehow I don’t think they are going to help with this one.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "lol people have been photoshoping celebrities in compromising positions since the beginning of the internet...nothing has changed.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Where can I find these disgusting images so I can be sure not to look at them, asking for a friend.",
        "points": "8 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I could paint a lewd picture of Taylor Swift. What is the difference?",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "[ Removed by Reddit ]",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "this feels a bit like some Streisand effect about to go off. It's so easy to make this type of content.\n\nHot take: get over it, it's not her, this is 2024. Legislating solves nothing, it makes the problem worse by lowering supply while demand stays the same, meaning there's more money to be made by those that choose to be 'outlaws'. Our government really doesn't understand technology I'm afraid, and legislating on 'lewdness' in 2024? smh\n\nSo many more important issues to tackle right now. But instead of that, let's all clutch our pearls I guess.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ac5sj5",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://savantinspace.substack.com/p/forage-into-the-future-8?utm_source=post-email-title&publication_id=814967&post_id=140887042&utm_campaign=email-post-title&isFreemail=true&token=eyJ1c2VyX2lkIjo2NTEzOTIyOSwicG9zdF9pZCI6MTQwODg3MDQyLCJpYXQiOjE3MDYzNDA1MjUsImV4cCI6MTcwODkzMjUyNSwiaXNzIjoicHViLTgxNDk2NyIsInN1YiI6InBvc3QtcmVhY3Rpb24ifQ.BrbRUIkjeP2uo9LGH5EP3ktH4bAZDiDY8Y4A1wvrFVw&r=12s5r1&utm_medium=eil",
    "title": "Forage Into The Future #8",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/DyingEverydayToLive:\n\nFrom a Substack I follow focused on DeepTech:\n\nCovers updates on 🦄Venture Capital & Private Equity, 💻Artificial Intelligence, 🤖 Robotics, ♻️Energy & Sustainability, 💡Semiconductors, and 🚀Space & Beyond.\n\nKey topics include:\n\n🦄Venture Capital & Private Equity: U.S. VC-backed startups face challenges with a decade-low exit value, while BlackRock's $12.5B acquisition of GIP strengthens its infrastructure business.\n\n💻Artificial Intelligence: AI robo-calls mimic President Biden in New Hampshire, and a study suggests AI's impact on jobs is gradual. OpenAI bans political chatbots, and Google's 'X' lays off staff.\n\n🤖Robotics: MOONWALK-Omni, a wearable robot, aids elderly in mountain climbing, and robots + AI in infrastructure could cut carbon emissions by 853 MMT annually.\n\n♻️Energy & Sustainability: Researchers in Hong Kong fortify urban transport systems, while breakthroughs in battery safety and conductive inks promise eco-friendly advancements.\n\n💡Semiconductors, Advanced & Quantum Computing: Bilayer graphene emerges as a potential game-changer in quantum computing, offering stable qubit storage with tunability.\n\n🚀Space: Scientists discover a second ultra-large structure, challenging assumptions about the cosmos, referred to as the 'Big Ring in the Sky.'\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1ac5sj5/forage_into_the_future_8/kjs5364/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "From a Substack I follow focused on DeepTech:\n\nCovers updates on 🦄Venture Capital & Private Equity, 💻Artificial Intelligence, 🤖 Robotics, ♻️Energy & Sustainability, 💡Semiconductors, and 🚀Space & Beyond.\n\nKey topics include:\n\n🦄Venture Capital & Private Equity: U.S. VC-backed startups face challenges with a decade-low exit value, while BlackRock's $12.5B acquisition of GIP strengthens its infrastructure business.\n\n💻Artificial Intelligence: AI robo-calls mimic President Biden in New Hampshire, and a study suggests AI's impact on jobs is gradual. OpenAI bans political chatbots, and Google's 'X' lays off staff.\n\n🤖Robotics: MOONWALK-Omni, a wearable robot, aids elderly in mountain climbing, and robots + AI in infrastructure could cut carbon emissions by 853 MMT annually.\n\n♻️Energy & Sustainability: Researchers in Hong Kong fortify urban transport systems, while breakthroughs in battery safety and conductive inks promise eco-friendly advancements.\n\n💡Semiconductors, Advanced & Quantum Computing: Bilayer graphene emerges as a potential game-changer in quantum computing, offering stable qubit storage with tunability.\n\n🚀Space: Scientists discover a second ultra-large structure, challenging assumptions about the cosmos, referred to as the 'Big Ring in the Sky.'",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ac0n9u",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "/r/Futurology/comments/1ac0n9u/how_long_until_people_start_assuming_humans_born/",
    "title": "How long until people start assuming humans born before advance AI are actually AI?",
    "points": null,
    "comments": [
      {
        "comment": "I get that you’re only talking about videos, but I already often get accused of copy pasting from ChatGPT because I guess I sound similar to it.",
        "points": "23 points",
        "children": [
          {
            "comment": "In conclusion, you are a human that understands the confusion AI technology can cause.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "My previous reddit account literally got accused of being a bot, by a bot:\n\n73.7% I was a bot. Fucked my whole day up. I had to stop and think which of us was a bot.\n\nI decided to take my tin foil off at that point.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You're correct. As soon as you write your text in an eloquent parlance and well-behaved manner, without any grammatical or orthographic mistakes, you make yourself vulnerable to the suspicion of being ChatGPT.\n\nso all you need is fuck up your langwhich and becum dump as shit that wey you be always seen as human.",
            "points": "6 points",
            "children": [
              {
                "comment": "I can’t do that, though. My ego won’t let me.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "\"Sorry, Dave. I'm afraid I can't let you do that.\"\n- your totally not AI ego",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Likewise, as a large language model I'm unable to fulfil requests in a grammatically incorrect way.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "My fear of being perceived as dumb keeps me from doing it. You can actually get an LLM to use improper grammar pretty easily.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Okiee I guess ur making tuns of sense. Do I seam reel?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Dude! Toward the end of last year, I started becoming, on some accounts, a well-known \"paragraph guy\" on Instagram. SO MANY people accused me of just copying and pasting from ChatGPT. You have no idea how refreshing it is to hear that somebody else had the same problem.\n\nI actually tried, out of curiosity, to see if chatGPT could replicate my voice. I found that ChatGPT 3 couldn't replicate it at all. It just took my content and turned it into a generic style at the same reading level. ChatGPT 4 was able to copy my voice eerily well, but it couldn't come up with original ideas/thoughts in that voice when I challenged it to. It would continue to repeat the ideas and topics presented in the sample writing I had fed it to learn my style from, even when I asked it to write about a new topic.",
            "points": "2 points",
            "children": [
              {
                "comment": "I've never been accused but I've seen a lot of blaming here on reddit. As a guy with advanced linguistics education I have some explanations that might be helpful. People accuse others of using ai not because of particular words but because of overall text structure. And the trick here, I suppose, is in reverse influence of ai-generated texts. I mean that those who use ai a lot, sooner or later implement ai ways of organising thoughts: making lists, arranging arguments from stronger to weaker, setting up sentences following direct structure, repeating key words. It's more logical and more clear. And here is another trick: those who are already organising their speech in such a way are automatically blamed for using ai. It might be called a particular case of \"survivorship bias\", lol.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The key to sounding like gpt is over verbosity",
            "points": "0 points",
            "children": [
              {
                "comment": "I can’t help it. My autism makes it so I constantly worry I am being misunderstood, so I am super verbose to make sure I am making clear my exact meaning rather than relying on neurotypical interpretations (which I can never predict) of shorter comments.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Hi thank you for explaining! I don't know if it will surprise you but neurotypical people get it wrong all the time. Part of communicating is accepting the risk of mistake and that it can be corrected.  If you want it in efficiency term its sometimes more efficient to just write it short and if the other side do not understand you he will ask for elaboration, than covering all your bases preemptively.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "What I have found is that neurotypicals will often misinterpret it, not realize they have misinterpreted it, and not bother asking for clarification. Then, when I try to help them interpret my initial message correctly, they think I am trying to argue.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I believe part of it will be legal. Right now at least in the US you cannot copyright a fully AI generated image. However many AI generated images are nearly indistinguishable from normal works of art and notably basically any picture you snap on your camera (or phone camera) can receive copyright if you want it.\n\nThis will mean that people will generate AI art then claim it is not so they can achieve copyright and disproving their claims will be difficult at best especially as it becomes rampant. Many artists will rapidly realize they simply cannot match the workflow speeds of AI tools without using them and will shift their workflows to also use AI. Companies will push hard for AI generation copyright law changes.\n\nAs this ramps up we will see it become extremely difficult to differentiate the two without heavily examining their workflow and as the AI content becomes more common place and laws start changing people will often claim art is AI or not incorrectly.\n\nVideo will lag slightly behind images but both technologies are related and very close. A video is just an image 24x per second (or whatever the frame rate is).",
        "points": "4 points",
        "children": [
          {
            "comment": "I was actually imagining it becoming so indistinguishable that a real human gets accused of being an AI video because they seem unusual... like DJ Khaled LOL.",
            "points": "-1 points",
            "children": [
              {
                "comment": "Oh we're there right now tech wise. The high end generation is way beyond the average stuff you'll see though. A large part of it is how much computer power and time you pump into the project. A company can do what you suggest now but most average people can't achieve that yet.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Yeah, that makes sense. However, what I'm speaking of would be cultural adoption, I think. Not cutting edge. So the tech is there, but when will it be so widespread that it's the norm?",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Its REALLY hard to tell. We actually don't know what direction it will go to be perfectly honest. You have some kinda open source stuff that works reasonably well but is notably harder to use than a bunch of paid online based stuff. When and how legal stuff happens will impact the direction the tech goes as well.\n\nAs an example you can install Stable Diffusion on your local machine and generate stuff with that, with similar applications/pluggins you can do video. Dalle-3 is an online version. Getting SD to understand what you want is REALLY tough and Dalle-3 DESTROYS it in comprehension but SD isn't limited in some of the ways Dalle-3 is.\n\nFor widespread adoption SD will need to get both much easier to use AND much better at comprehension. Even installing it is probably beyond the average person. Dalle-3 just needs a GPT4 Plus subscription I believe.\n\nPart of it will require artists to get onboard with AI. There's a big faction that just doesn't even consider AI generations \"ART\" which is slowing adoption. Once it becomes so overpowering as a tool that they get swept aside or they realize their full of it general adoption will probably follow for whichever tech is the most easily accessible at that time.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You know what, this actually happened to a post of mine a couple weeks back...",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Man, I hate AI generated art. Google images is absolutely flooded with it and now I can't find any good fantasy portraits for my D&D game anymore, they all look exactly the same and some of them are freakish abominations of hell: Elves with giant ears the size of their own body, spaghetti-fingers, some of them have an extremely high forehead and a second tiny face hidden somewhere on top of their regular face inside their hair.\n\nthey all have the exact same lighting effects, boring poses and boring backgrounds. Weird clothing that doesn't know what type of clothing it is supposed to be. Their face looks almost identical to Galadriel from rings of power. That same soulless look in their eyes. I almost always subconsciously pick up on the fact that it's made by an AI. But it keeps getting more difficult to see.\n\nIn the near future you'll become a fantasy artist, you'll make an excellent piece of work that took months to create and you show it off in an art gallery. Someone is going to walk up to you and ask: \"what prompts did you use to make this?\"",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Obviously that will happen when it will be extremely difficult if not impossible to distinguish between AIs and humans, so, probably only with AGI (unless we are talking about only images/videos).",
        "points": "0 points",
        "children": [
          {
            "comment": "Sorry, I meant only with videos",
            "points": "0 points",
            "children": [
              {
                "comment": "Ahh videos seem to be quite behind images for now, if I had to randomly guess I'd say things will get VERY difficult to distinguish in about 2 years from now. In video generation seems like progress is going quick but it's definitely behind images.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "For sure. Logically, video will be behind audio and photos. Audio and photos are practically indistinguishable at this point... they are very close. I was curious what people's timeliness were for this. 2 years makes a lot of sense.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Honestly, it's hard to say exactly when, but with AI getting better all the time, people might start wondering if some online creators are real or just AI, especially if they've been around a while. We're not quite there yet, but the way tech's going, it could happen sooner than we think. But hey, there'll always be ways to tell real folks from AI, like live stuff or just the random things only humans do. For now, it's more like a \"huh, imagine if\" kinda thing.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I am definitely not AI, I assure you. If I was an AI, would I type like tHiS? I'm lEeT dUdE",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I can think of one creator who been Al most of their career, even though they closely replicate other creators works they are never accused of a crime.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It will start happening the moment AI can make convincing videos. They're still a bit obviously AI generated at the moment. It won't be long though. This year, I suspect.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Is like when you're such a good gamer that everyone is accusing you that you're cheating?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1abya9q",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://spectrum.ieee.org/flexible-electronics-flexram",
    "title": "Liquid RAM flexes for wearables, robots, implants. A nonvolatile version could be on its way, too",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/Sariel007:\n\nIn research described in the journal Advanced Materials, the researchers have used a gallium-based liquid metal to achieve FlexRAM’s data writing-and-reading process. In an example of biomimicry, the gallium-based liquid metal (GLM) droplets undergo oxidation and reduction mechanisms while in a solution environment that mimics the hyperpolarization and depolarization of neurons.\n\nThese positive and negative bias voltages define the writing of information “1” and “0,” respectively. When a low voltage is applied, the liquid metal is oxidized, corresponding to the high-resistance state of “1.” By reversing the voltage polarity, it returns the metal to its initial low-resistance state of “0.” This reversible switching process allows for the storage and erasure of data.\n\n“The conceivable size scale for these FlexRAM devices can range widely,” said Liu. “For example, the size for each of the droplet memory elements can be from millimeter to nanoscale droplets. Interestingly, as revealed by the present study, the smaller the droplet size, the more sensitive the memory response.”\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1abya9q/liquid_ram_flexes_for_wearables_robots_implants_a/kjqrrn0/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In research described in the journal Advanced Materials, the researchers have used a gallium-based liquid metal to achieve FlexRAM’s data writing-and-reading process. In an example of biomimicry, the gallium-based liquid metal (GLM) droplets undergo oxidation and reduction mechanisms while in a solution environment that mimics the hyperpolarization and depolarization of neurons.\n\nThese positive and negative bias voltages define the writing of information “1” and “0,” respectively. When a low voltage is applied, the liquid metal is oxidized, corresponding to the high-resistance state of “1.” By reversing the voltage polarity, it returns the metal to its initial low-resistance state of “0.” This reversible switching process allows for the storage and erasure of data.\n\n“The conceivable size scale for these FlexRAM devices can range widely,” said Liu. “For example, the size for each of the droplet memory elements can be from millimeter to nanoscale droplets. Interestingly, as revealed by the present study, the smaller the droplet size, the more sensitive the memory response.”",
        "points": "9 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1abwqw5",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "/r/Futurology/comments/1abwqw5/monorail/",
    "title": "Monorail",
    "points": null,
    "comments": [
      {
        "comment": "In ascending order of cost you can build a train on the ground, elevated in the sky, or underground. Most transit systems try to minimize cost by building on the ground as much as possible, building elevated when necessary, and building underground as a last resort.\n\n​\n\nA monorail is cheaper to build elevated than a normal transit system. This comes at a price - building on the ground and building underground are markedly more expensive than a normal system. You also lose the ability to interchange with traditional rail systems. Finally you markedly reduce the number of equipment suppliers that you can buy from, and if youre main supplier goes out of business (ie von roll and the newark monorail) you may need to consider scrapping the entire system when your equipment reaches end of life.\n\n​\n\nIf you have a transit system that needs to be built entirely elevated, does not need to interchange with other systems, and you have reliable suppliers, a monorail can be considered on its economic merits (see some isolated cases in Japan, some airport shuttles around the world). Otherwise youre probably just getting it because you think it looks cool, and/or a contractor paid off the right people.\n\n​\n\nEdit: Appearantly von roll didnt go out of business. They just dont make monorails anymore.",
        "points": "29 points",
        "children": [
          {
            "comment": "Well, you've piqued my curiosity. Do you have a sense of how much more expensive each option gets compared to building on the ground?\n\nAFAIK, monorails are only used for passengers. Is there a use case for transporting goods?\n\nI believe we have a monorail system for going up a nearby mountain. It got me thinking. Some of those mountain passes are narrow and scary to drive. Could you use a train to haul your car over mountains more safely?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Tell that to the people of Brockway, ogdenville, and northhaven brook!",
        "points": "10 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Is there a chance the track could bend?\n\nNot on your life, my Hindu friend....",
        "points": "23 points",
        "children": [
          {
            "comment": "I've heard those things are awfully loud!",
            "points": "11 points",
            "children": [
              {
                "comment": "It glides as softly as a cloud!",
                "points": "12 points",
                "children": [
                  {
                    "comment": "What about us braindead slobs?",
                    "points": "9 points",
                    "children": [
                      {
                        "comment": "You'll be given cushy jobs!",
                        "points": "10 points",
                        "children": [
                          {
                            "comment": "I swear it's Reddit's only choice, throw up your hands and raise your voice!",
                            "points": "5 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The Simpsons episode was written because they were already a non-starter here.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Here in western Canada in BC. We have had the sky train rapid transit system for 40 years and it works perfectly",
        "points": "3 points",
        "children": [
          {
            "comment": "Yeah but it has twice the rails",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Here in Murica we like things bigger and better, monorail, what the hell is that a train with mono? We would need at least a quadrail to get it built here!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’ve been calling for a monorail in LA for YEARS. Why doesn’t anyone listen to me. Im going to write an angry letter",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Driverless cars will solve almost all public transport issues.\n\nMoney is better spent improving existing roads and junctions, raised intersections etc.\n\nTrains are great and every city should have a rail system but lets be honest, once we hit driverless nobody is going to be riding in public mixing with rapists.",
        "points": "-3 points",
        "children": [
          {
            "comment": "Not true in the slightest. Cars create a space problem weather they are driverless or not. We will always need trains for big cities",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You've never been to India, I see",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Singapore has the majority of our rail transit elevated. Google it it's pretty cool",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There is nothing a monorail does better than other forms of train transit, but tends to cost much more.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Tom Scott has several good videos discussing how rare it is to build an actually useful monorail system.\n\nhttps://youtu.be/Ei6LKHNFpeE?si=Ed30MM9vD3WXwXCL",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1abt5nq",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://ev-riders.com/news/this-new-innovative-chemical-element-could-replace-lithium-or-sodium-in-batteries/",
    "title": "This New innovative chemical element could replace lithium or sodium in batteries",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/CelebrationDirect209:\n\nThis chemical element may be familiar to some due to its use in producing steel parts with high corrosion resistance or in manufacturing superconducting magnets. But, in this case, the members of the Chinese Academy of Sciences have achieved a battery that uses vanadium to obtain a form of long-lasting renewable energy storage in large quantities. The latest we know is that Chinese scientists have achieved an essential evolution in what is known as a vanadium flow battery.\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1abt5nq/this_new_innovative_chemical_element_could/kjprgik/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Vanadium flow batteries have been around for decades.\n\nSo, no this is not a new chemical element! And no it can't replace lithium or sodium in batteries, it lost that race a long time ago.",
        "points": "65 points",
        "children": [
          {
            "comment": "Nah, vanadium is very new, it only dates back to the Big Bang.",
            "points": "8 points",
            "children": [
              {
                "comment": "Not so. The three primordials, i.e. those formed in the big bang, are hydrogen, helium, and lithium. Everything heavier, including most lithium, is basically star gone supernova shit.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Anything up to and including Iron can be produced in a regular star doing fusion.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "And would be contained for the lifetime of the universe. Supernovas give us the trans-ironic* elements and widespread dispersal of the non primordials.\n\nI have a fondness for iron nuclei, the not quite useless universal waste product. It can be used in a linear accelerator drive, and its magnetic properties mean a dual drive with RF cavity acceleration boosted by magnetic waves. Relativistic iron nuclei can get you to a 1 g drive pretty quick.\n\n*I claim IP on that.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Thanks - TIL !!",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Getting corrected is one of the ways we learn/teach. The net allows fairly real time 'error correction' so progress may be accelerating.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The only low energy density storage I have some faith in is thermal storage.",
            "points": "1 point",
            "children": [
              {
                "comment": "Faith is just sloppy reasoning. Some faith is even sloppier.\n\nDon't think, look it up. Battery storage is 90% efficient on a round trip basis, everything else is closer to 50% at a maximum.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "It would be pretty cool if we turned even low heat into desirable energy through high efficiency photovoltaic or photothermal recovery system. But it's also cool if it doesn't happen.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Let's compare - element by percentage of Earth's crust:\n\nSodium - 2.36%\nVanadium - 0.012%\nLithium - 0.002%\n\nVerdict: it definitely won't replace sodium especially with how easy sodium is to get. Literally sodium has no competition where density doesn't have to be the highest possible because of how common it is.",
        "points": "21 points",
        "children": [
          {
            "comment": "Personally I hope they work out the kinks in Aluminium batteries - 8.23% crust by mass.",
            "points": "8 points",
            "children": [
              {
                "comment": "From what I read the efficiency of iron-air is around 50% and is super cheap for upfront costs. Is the problem with aluminum the corrosion or efficiency?",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Durability is an issue I believe.\n\nProblem with Iron is it's heavy. Over double that of aluminium per atom.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Wheres Don Sadoway when we need him",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Personally I hope they figure out silicon batteries (27.7% crust by mass).",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I'd like less crust on my batteries. Weird preference, I know, but I have sensitive teeth.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Sodium could even potentially have negative acquisition cost. For instance a desalination plant might pay a battery company to take it away, or at least give it to them for free.",
            "points": "2 points",
            "children": [
              {
                "comment": "Not possible unless dumping brine into the sea was penalized.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Not penalised, but it still costs money.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "V has been used in flow batteries in the lab for years now. Maybe they increased the energy density but I don't know how much energy density matters in flow batteries. They are only suitable as grid storage and grid storage isn't all that concerned with energy density because there's no limit to how big/heavy the batteries can be. Grid storage batteries optimize for low $/watt and longevity.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This chemical element may be familiar to some due to its use in producing steel parts with high corrosion resistance or in manufacturing superconducting magnets. But, in this case, the members of the Chinese Academy of Sciences have achieved a battery that uses vanadium to obtain a form of long-lasting renewable energy storage in large quantities. The latest we know is that Chinese scientists have achieved an essential evolution in what is known as a vanadium flow battery.",
        "points": "-10 points",
        "children": [
          {
            "comment": "new innovative chemical\n\nevolution in what is known as a vanadium flow battery\n\nPlease choose a lane",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Hey, you really should have known better. And you do: Check back your own post:\n\nhttps://www.reddit.com/r/Futurology/s/biKKQiG8CV",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Vanadium's advantage is you can increase the battery capacity by pumping the charged electrolyte into a giant tank.  Most batteries, including iron air redox flow batteries don't have this property. It means there could be a good use case for it in long term / seasonal storage",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ac5b4n",
    "subreddit": "u/lazyturtlegames",
    "dataType": "link",
    "dataUrl": "https://store.steampowered.com/app/2797220/Necroforge",
    "title": "Unleash your dark side in this Hexen and Heretic inspired game! Wishlist now on Steam!",
    "points": null,
    "comments": []
  }
]