[
  {
    "id": "t3_1adauyb",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.cnbc.com/2024/01/27/sextortion-training-materials-found-on-tiktok-instagram-and-youtube-according-to-new-report.html",
    "title": "Sextortion is fastest-growing crime targeting minors in North America – and social media companies can do more to stop it, study finds",
    "points": null,
    "comments": [
      {
        "comment": "I’ve been in the comments and advocating for comprehensive sex Ed to address this as well as bodily autonomy and consent. What was shocking at the time and less so upon reflection is just how young these sextortion crimes happen.\n\nRealistically the coordinated attacks by groups like the Yahoo Boys or their copy cats, when combined with lack of supervision and precocious puberty, it seems like we need education on this for 5th and 6th graders and even that might be too late. You can preach “don’t send nudes” until you’re blue in the face, but until they read about how quickly lives are destroyed and know the dangers, it won’t help them.\n\nSocial media companies need to act on this, and fast, but parents have to step up because this can be solved in part through education.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Had this happen when I was 16\n\nEnded up paying 200$ and nearly dying of panic thinking my life was ruined\n\nI still wonder if that image of me is somewhere out their floating around on the internet\n\nSuffice to say I never did that again but it was incredibly frightening and I think it’s sick they target minors",
        "points": "",
        "children": [
          {
            "comment": "I hate that this happened to you but it is NOT YOUR FAULT. Look at what they did with deepfakes and Taylor swift. If someone wants to strip you of dignity they already have everything they need online and the digital tools to do so",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Just finished reading about the (adult) romance scams also done from some countries (Ghana in this case). The oddest feature is that the criminals are often controlled by “priests “ who bestow magical powers of persuasion on the criminals in return for a cut of the money.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Of course they can!!!!! We ALL CAN except men rely on sexual exploitation or turn a blind eye to it because it does t affect them.\n\nWhat I love is the irony of telling girls:\n\nDon’t SEND any sexy pictures of yourself or sextortion is your fault.\n\nDONT TAKE any sexy pictures of yourself or sextortion is your fault.\n\nAnd now we’ve got Deepfakes and AI so\n\nNow what: we can’t put our faces online? Maybe cover up! Maybe stay home!\n\nI guess until we have laws girls are free game because none of this is “real” anyway and we can all use some plausible deniability.",
        "points": "",
        "children": [
          {
            "comment": "Your little schizo rant completely sidesteps the actual issue and mischaracterises the argument being made.\n\nThere are laws against it. Pretty much every social media platform has some level of protection against this but absolutely no law is going to justifiably prevent this since the vast majority of it takes place in private messages or by foreign entities.\n\nThis isn’t the imaginary argument you’re making which conflates minimal clothing with rape, this is quite literally an educational issue. Don’t send naked pictures to people, don’t expose yourself to strangers online.",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Burqas enter the chat\n\nHave I got a solution for you! /s",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I have a sick feeling this is gonna get even worse with AI and deepfakes.",
        "points": "",
        "children": [
          {
            "comment": "Or get solved by it\n\nA. That image is fake B. It’s a serious crime to generate and share that kind of imagery of someone\n\nOnce no image is believable, why believe it?",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "People are sick.\n\nNot only are we in times where depression, mental issues, loneliness, and suicide is rampant but people are trying to profit off of it as well.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1adaeqv",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.businessinsider.com/apple-app-store-shakeup-in-europe-triggers-fury-2024-1",
    "title": "Apple was just forced to crack open its App Store — but the changes are already being called 'hot garbage'",
    "points": null,
    "comments": [
      {
        "comment": "98% of people buy Apple for the ecosystem.",
        "points": "",
        "children": [
          {
            "comment": "Most people suckers for marketing lol",
            "points": "",
            "children": [
              {
                "comment": "I don't even understand what you're saying.\n\nAre you saying that long ago, having one device for my music and iphone was a stupid idea? I should just use Napster on my Android and be happy?\n\nEcosystem. Everything all in one. I'm sure you do the same thing with Google and that's actually why you continue using Android and not your counter-culture marketing trope.",
                "points": "",
                "children": [
                  {
                    "comment": "Problem with Apple is that if you wanted to use a third party app for says maps, music etc until very recently those were all locked to Apple products.\n\nHell for the longest time you couldn't even get rid of stocks on the phone and move around half the icons.\n\nThen there was the whole purposely slowing phones down, sounds like you drink the Apple Kool-Aid.\n\nApple has great marketing I'll give them that but their charge a premium for devices when for example a Windows computer can out perform a Mac but because a Mac Book at Starbucks is a fashion accessory people buy it.\n\nI've had this conversation numerous times, people say oh Apple just works, I say what doesn't work on Android.... Uhhhh. Also, for the record I am talking pure Android from Google, not customized stuff from Samsung or OnePlus, etc.\n\nFurthermore, I am glad that Apple is finally having to play ball with everyone else, getting away from their proprietary connectors, why use them? So they can gouge consumers. Now they have to come in line with USB (Universal).\n\nComing in line with texting as well and now their app store\n\nSame thing is going to happen to Tesla in the future.",
                    "points": "",
                    "children": [
                      {
                        "comment": "What are you talking about? 3rd party Navi and streaming services have been available on iOS for a long time. And you don’t understand why Apple slowed down their phones?",
                        "points": "",
                        "children": [
                          {
                            "comment": "Their shpeal was to preserve battery. If it was all good and that why did they have a 500 Mil settlement?\n\nHonestly I don't think you quite get it, I work in IT, dealing with Apple devices is not great. Even apple got rid of their own server because it was crap.\n\nIf you're a boomer who just wants texting and email it's a great (overpriced) device. If you want to do anything with a phone outside of that it's trash.\n\nAs far as nav goes you do remember Apple Maps launch right...\n\nYou buy a true android phone you can sideload apps and has been for years, able just let it's users get that feature at the end of last year.",
                            "points": "",
                            "children": [
                              {
                                "comment": "God this guy is insufferable",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I'd say most ppl buy apple because they see it as fashion accessory, because having an iPhone makes them feel \"rich\", Im saying this as someone who purchased a few apple products across the decades, oddly enough, none of them were an iphone.\n\nEdit: I knew I'd be down voted into oblivion by the people who ask a loan to buy an iPhone.",
            "points": "",
            "children": [
              {
                "comment": "Thats the stupidest take ive seen in a very long time",
                "points": "",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Wow. iPhone didn't reach its marketshare because it is a fashion accessory.",
                "points": "",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Certainly explains the vastly different market share Apple enjoys in different countries, as different cultures view wealth signalling very differently.",
                "points": "",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "A fashion accessory that makes me very productive and gives me less headaches peace of mind. Ok?? A fashion accessory like my D&G wallet? Not really.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I don’t care about openness in an iPhone. I buy Apple, in part, because they work beautifully out the box with no fucking around.\n\nIf you want to fuck around with the hardware and or software. Get a pc.",
        "points": "",
        "children": [
          {
            "comment": "or jailbreak the iPhone",
            "points": "",
            "children": [
              {
                "comment": "That too. People wanting Apple to be a thing they are not, when they have an alternative that does exactly what they want in android and pc.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yeah, but the guy who called it hot garage is Tim Sweeney. The Fortnite guy who wants to smash everything that works decently to make more money.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nice, the walls are coming down. I finally can consider an iphone, now let me default to spotify.",
        "points": "",
        "children": [
          {
            "comment": "Newsflash: It's 2023 and you can delete the Apple Music app from your phone and it automatically defaults to spotify for me. Siri even plays anything I ask for on Spotify.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ad52a1",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://arstechnica.com/gadgets/2024/01/google-launches-chrome-nightlies-for-windows-11-on-arm/",
    "title": "The year of Windows on Arm? Google launches official Chrome builds. Chrome for Windows-on-Arm should hit stable in time for Qualcomm's big launch.",
    "points": null,
    "comments": [
      {
        "comment": "I want an unstable canary.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ad3izf",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.techradar.com/pro/google-just-settled-its-multi-billion-dollar-ai-tech-patent-trial",
    "title": "Google just settled its multi-billion dollar AI tech patent trial",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1acylmq",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.nytimes.com/interactive/2024/01/25/business/ai-image-generators-openai-microsoft-midjourney-copyright.html",
    "title": "We Asked A.I. to Create the Joker. It Generated a Copyrighted Image.",
    "points": null,
    "comments": [
      {
        "comment": "I mean, I'm not a huge AI fan but...\n\n« he asked Midjourney, an A.I. image generator, to create an image of Joaquin Phoenix from “The Joker” »\n\nWhat were they expecting then?",
        "points": "34 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“We asked AI to create an image of a copyrighted character and it made a copyrighted image!!”\n\n… yeah, shocking. 🤷‍♂️",
        "points": "33 points",
        "children": [
          {
            "comment": "“… I don’t know what I expected”",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Paywalled, downvote and junk",
        "points": "14 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI doesn't create\n\nIt just reuses other people's content",
        "points": "6 points",
        "children": [
          {
            "comment": "I mean.. that’s what most of us do. It’s inspiration when a human does it. I was involved with a copyright case. The unspoken rule used in legal sitting is that the art needs to be changed roughly 20% to not infringe on the copyrighted material. Most copyright cases will go by the 20% rule of thumb.",
            "points": "5 points",
            "children": [
              {
                "comment": "Humans sometimes steal but also adapt, improve, iterate but \"AI\" does none of those things.\n\nIt's just blatant theft.",
                "points": "-7 points",
                "children": [
                  {
                    "comment": "People do it all the time already. Can get on Etsy and buy hoodies and merch with joker on it for cheap. People just hating on ai so they’re looking for any avenue they can to bring it down. Etsy",
                    "points": "-1 points",
                    "children": [
                      {
                        "comment": "this link is also blatant ip theft.",
                        "points": "3 points",
                        "children": [
                          {
                            "comment": "Half of Etsy is theft.",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "You can always tell from the reaction to ip theft who has, and has not, produced anything of value worth protecting. Only a certain kind of person acts like blatant theft is no big deal.",
                    "points": "-3 points",
                    "children": [
                      {
                        "comment": "“Intellectual property” isn’t property, it’s a legal construct protecting profits. Whether those profits ought to be protected or not, it’s not stealing.",
                        "points": "-1 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Waaah waaah waaah.",
                    "points": "-4 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Garbage post",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1acvprd",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.bbc.com/future/article/20240123-the-apple-macintosh-was-first-released-40-years-ago-these-people-are-still-using-the-aging-computers",
    "title": "The Apple Macintosh was first released 40 years ago: These people are still using the ageing computers",
    "points": null,
    "comments": [
      {
        "comment": "It cost close to $5000 with printer when first released. Wow",
        "points": "17 points",
        "children": [
          {
            "comment": "My parents went away for a few weeks in the summer leaving me on my own for the first time when I was about 14. To keep me out of trouble they bought me a Mac Plus. It was $2600 (over $7k in today’s money).\n\nI remember thinking “how am I ever going to fill up 800k on this floppy disk??” That included the OS.\n\nI don’t think I left that computer except to eat and sleep. Turned out to be a good investment since I’ve made my career in tech.",
            "points": "17 points",
            "children": [
              {
                "comment": "My first computer was a Commodore 64, then a Mac SE. My first ibm clone had 4mb of ram and my friends laughed, “What a waste! NO ONE is ever going to need 4megs of ram!”",
                "points": "2 points",
                "children": [
                  {
                    "comment": "All my friends had the VIC-20 and C-64 when I had the TI-99/4a, then an Apple //c. They were all trading games. I decided to write my own since I couldn’t trade with anyone.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Pretty cheap when you think that most business side desk minicomputers systems were still running a million dollars per unit and the cheapest board in them was around 65 thousand by itself and I do think The Osborn was the first though.\n\nN. S",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Still have mine. Complete in the box, with all the accessories, sales brochures, and invoice. Last time I checked the battery still was powering the clock. Of course that was in like 2001.",
        "points": "6 points",
        "children": [
          {
            "comment": "At auction I’ve seen complete ones go for a pretty penny.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "They had great keyboards.",
        "points": "8 points",
        "children": [
          {
            "comment": "Basically what r/mechanicalkeyboards is tryna recreate in a way, yeah? I’m always so interested in those but the last thing I need is another expensive hobby.\n\nAdded the s",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The fastest Mac back then was actually an Amiga:\n\nhttps://www.youtube.com/watch?v=8v4BaWwoyA0",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just install OCLP on it, it will be fine\n\n/s",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Everything in the existence is aging, duh.\n\nThey should have used “ancient” or something that makes sense.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Bought a Mac Plus in 1989. Still have it. It still works. 20 MB hard drive cost nearly as much as the computer.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yeah, but is it Y2K compatible?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1acorga",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://arstechnica.com/tech-policy/2024/01/nsa-finally-admits-to-spying-on-americans-by-purchasing-sensitive-data/",
    "title": "NSA finally admits to spying on Americans by purchasing sensitive data",
    "points": null,
    "comments": [
      {
        "comment": "Wyden is arguably one of the best sitting senators. Definitely the best when it comes to citizens privacy right.",
        "points": "118 points",
        "children": [
          {
            "comment": "He’s not the best, as a public speaker or taking lots of money from Big Pharma and Big Health…but yes he’s the nerd we love and need to protect American citizens.",
            "points": "32 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The ironic nature of this comment baffles me. “The government is completely corrupt, except this guy”. People, none of these folk are in your corner, no matter what it may seem.",
            "points": "2 points",
            "children": [
              {
                "comment": "But they didn’t say the government is completely corrupt. Only you said that.\n\n“None of these folks are in your corner”\n\nNot true at all.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "They said he’s “one of the best” regards to one particular issue dude",
                "points": "2 points",
                "children": [
                  {
                    "comment": "I am aware, and I don’t believe it. Hence why I posted my comment.",
                    "points": "-3 points",
                    "children": [
                      {
                        "comment": "Yeah but the response doesn’t really fit what is being said",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "You’re damn right, Chuck!\n\nThey get the job BECAUSE THEY ARE CORRUPT!\n\nThey are not corrupted by the job!",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "So someone will go to jail? Someone will lose a job (and not be allowed to return)?\n\nNo?\n\nJust telling them they must delete the data... and no verification that's done or that it won't happen again?\n\nOK then, carry on, nothing to see here.",
        "points": "86 points",
        "children": [
          {
            "comment": "Nope, prison is for the whistleblowers",
            "points": "48 points",
            "children": [
              {
                "comment": "Haha, if you're lucky you live long enough to go to prison.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Hell is for children.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "They bought the info legally, right? Shouldn’t you be more worried the data can be bought like that?",
            "points": "11 points",
            "children": [
              {
                "comment": "lol exactly. Our personal data has become a valuable commodity. They’ve put a price on our privacy.",
                "points": "10 points",
                "children": [
                  {
                    "comment": "And it’s a lot lower than most would be comfortable with.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I wonder who else is buying the same information",
        "points": "20 points",
        "children": [
          {
            "comment": "I wouldn’t be surprised if it’s anyone who’s willing to give telecoms enough money, including foreign governments.",
            "points": "13 points",
            "children": [
              {
                "comment": "Correct. And you don’t have to buy it direct from telecoms, though they do have that data. There are lots of potential (and actual) holders and therefore sellers of — in this case — “what apps are associated with this [email]” which is essentially the data they’re talking about in this NSA situation. Note that email is brackets because there are other identifiers you can tie app usage (or any other conceivable parameter) to, like ip address, device_id, etc..\n\nThink about all the 1st-party holders of the app <> email data out there? The phone maker, the carrier, the app, the email service provider, the isp, the App Store, the publisher, etc etc. that’s just first-party owners, who then sell it to lots of different types of entities who package it up in lots of different ways for advertisers (and whomever else has they money) to buy.\n\nSo the net-net of this is there are lots of different options for buying the data, meaning there are lots of sellers selling basically the same data in different packaging, and that data comes from many different first-party sources.\n\nAnd I should say the data you get is “anonymized” and yes before anyone blows me up of course you can if you’re so inclined probably work out the identity of a row of data in these feeds, but it would be a bunch of work for not a lot of value in most situations. But arguably that calculus changes when the nsa is tracking a terrorist and wants to understand the apps that dude has on his phone, probably to exploit whatever master list of known vulnerabilities the nsa has on every app out there.\n\nSo in essence, yes this is happening. This is what they mean when they say selling your data for advertising. I don’t think the data is the problem. I think it’s the revenue model based on advertising that’s the problem.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "You just have to assume that your data is free data for anyone. I wish it was different but it isn’t and it won’t be. It is simply a fact of life. I hate it as much as you but we absolutely have to adjust to that new reality. It will only get worse.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Wait really? It’s not a secret. Mainly advertisers, and the majority of this data is monetized or “bought” on an open, and mostly blind, network/marketplace.\n\nHonestly, it’s not that bad — there are bigger problems to solve in the tech sphere of influence.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Wydan said that he was \"not aware of any requirement in US law or judicial opinion\" forcing the DoD to \"obtain a court order in order to acquire, access, or use\" commercially available information that \"is equally available for purchase to foreign adversaries, US companies, and private persons as it is to the US government.\"",
        "points": "43 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [
              {
                "comment": "Go to whitepages.com and look yourself up. fastpeoplesearch.com will give you even more info on anyone you want for free. If you just google “people search,” you’ll find tons of other websites like that. It’s crazy how much of your personal info is up for sale, including your home address, past addresses, jobs, education, relatives, your age, etc.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "The only silver lining here is that sites like Spokeo are usually wrong, but they're close enough that it's still fairly terrifying.\n\nGood times if you're a stalker though.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": true
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I’m disgusted by the fact that my tax dollars are going to buying my own data. Cut out the middleman and pay me, I’ll give you my data.",
        "points": "69 points",
        "children": [
          {
            "comment": "Don’t worry, they already have 98% of your data. If they ‘got lucky’, there was a single new nugget in there - the equivalent of a missing pixel on their HD TV into your life.\n\nThe 10% they just bought is mostly just a fig leaf, so they don’t ever have to admit the true source. Paying you lets you prove they knew more than your answers - it’s proof that everything is from capturing metadata/data on citizens. So that will never be an option.",
            "points": "18 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "No no no … giving money to the working class is socialism .. can’t have that.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Your data would have to be worth something first. The average citizen is hog wash",
            "points": "2 points",
            "children": [
              {
                "comment": "monday: pornhub tuesday: pornhub wednesday: pornhub thursday: ze secret plans mr bond. jk. pornhub",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "To be fair, you agreed to give it away.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I don’t care that the NSA bought the information. It is way more chilling that the information was there to be purchased at all, by anyone.",
        "points": "63 points",
        "children": [
          {
            "comment": "Exactly. Deleting this on a government server doesn’t make it go away",
            "points": "22 points",
            "children": [
              {
                "comment": "I guess but I’ve read that it’s very easy to collect all the information you can and very hard to not collect data whether you’re a company or whatever because it’s a lot more work to be specific in which data you’re collecting, so the fact that it could be bought was an issue but it being collected wasn’t exactly a surprise.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "This! We need to wake up to the fact that big business is a bigger threat to liberty than big government. Fewer guns, but insidiously controlling our access to goods and money via controlling credit, targeted advertising/misinformation . We better reign all this in.",
            "points": "21 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yeah idk - I think you should care that they bought it. When a tax-financed entity uses our collectively contributed money to buy this info to spy on me and everyone else, that's a reason to be pissed. It shouldn't exist, but funneling tax money into that industry gives it justification and makes it more viable as a business.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yeah it's crazy how people's information is always readily available on 100s of data brokers out there. That's why some are taking advantage of this and some are having security nightmares for sure.\n\nThese data brokers collect data from different kinds of databases, and then sell it to various interseted parties/companies AND republish it on their own sites.\n\nPSA: you can request to have your info removed from these sites (usually the opt out link is in the footer of the site something like “Do Not Sell My Info”). Here's a good resource for DIY opt-outs: https://www.optery.com/opt-out-guides/\n\nFull disclosure, I'm part of the Optery team.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Wait it’s chilling? Really? As in, it’s surprising to you that the email you used to login to an app is linked to the apps you use and that they (the apps) package that up and sell it to the highest bidder (usually advertisers)?",
            "points": "0 points",
            "children": [
              {
                "comment": "Surprising is not a synonym for chilling and you know that. This is you attempting to shame another reddit for no reason.",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Corporations more powerful than government of course",
        "points": "12 points",
        "children": [
          {
            "comment": "For me it was crazy that people were happy when MS was able to gaslight UK.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Because they’re more efficient.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Purchasing our personal information with our own tax dollars..",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wtf, just purchase it directly from me in the form of a tax rebate and stop going through the middleman.",
        "points": "6 points",
        "children": [
          {
            "comment": "Agreed.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I have to renew my license at the DMV, and they require an appointment and use a third party scheduler.\n\nI submitted the required personal info in the form, which is personal personal, and not even 30 minutes later and for several days after I received hot lead telemarketing calls and voicemails nonstop. What the fuck?",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can I purchase my information back? I've forgotten all my passwords",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "*government admits that corporations putting profits over people is now inextricably linked to state surveillance of said people.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wait till people find out what they won't admit to.",
        "points": "9 points",
        "children": [
          {
            "comment": "North Korea is a hologram.",
            "points": "1 point",
            "children": [
              {
                "comment": "North Korea is a hologram.\n\nThis is a conspiracy theory that I can get behind. I bet that it would drive discount store worst Korea leader insane.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Wars coordinated jointly by both sides to prolong them might be a good one to learn about.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Love me some North Korea err ‘merka",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Be real, data brokers are literally just CIA fronts to skirt the law. This regulation will do nothing.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And they’ll never ever do it again, so no harm no foul….👍🏾🖕🏾",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Guess whose money the NSA is using to purchase your data to spy on you? Yours. They are using your money to bypass surveillance laws to gather information about you.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“It’s not spying if we bought it!” Big brain move right there.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Anyone keeping score? How many times does this make that they've made such an admission?\n\nAnd the CIA?\n\nFBI?\n\nI'm almost more afraid of what my media/intertoob providers would cop to, Samsung or Apple, Microsoft, Google, the credit agencies, my potential landlords...",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Fu€king sad",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If the power of the state is used to control rather than protect the people, sum tings Ben wong.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Purchasing from who?",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They bought the data from data brokers... Panties are knotted and small children panicked because US intelligence agencies purchased data which is readily available on the open market. Yet people willingly sign service agreements with social media entities that waive their rights and release their data to private corporate entities to do with it whatever they choose. Sheer idiocy.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Everyone here is targeting the wrong organization. The issue isn’t that the NSA buys it in support of its mission to defend the US. The issue is that this data is for sale to begin with. If the US government stops using it, we’re making it harder on ourselves when EVERYONE ELSE gets to continue to buy the data (criminals, adversary nation states, other companies, political organizations, etc.). The NSA is not the threat. The business model of collecting and selling the data en mass is the vulnerability, all the other people using it against us are the threat.",
        "points": "2 points",
        "children": [
          {
            "comment": "💯 who gains by spreading fear of the American government?",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "And this is why it will never be illegal to sell personal data.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Tomorrow’s news: NSA finally admits to spying on Americans by having telephone company delivery directories to its offices.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So yippee, they know I've given up on life and just hanging around hoping to watch it all end. Their probably doing the same thing.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Since the data is “purchased”, how is it different than other corporations?",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In a surprise to no one",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Privacy is an illusion. If The Gap can buy your spending, browsing, location data, & more you can goddamn expect the NSA to have it.\n\nWe need laws specifically stating obtaining certain data is off limits. Not just for the NSA.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s not “spying” if they are just buying the information we give away to corporations.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They are actively targeting anyone watching too many cat videos cause they know cats could take over the world one day.",
        "points": "0 points",
        "children": [
          {
            "comment": "They are actively targeting anyone watching too many cat videos cause they know cats could take over the world one day.\n\nWhew, I'm safe with bear videos.\n\nAlthough I do have a guilty cat video addiction too.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This is huge and should have a lot more press",
        "points": "1 point",
        "children": [
          {
            "comment": "It was already known by most",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "They looked at a dashboard and saw we all already knew",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I mean you have to be extreme ignorant to still believe your gov don’t spy on you",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Least surprising headline of the decade",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Okay like we didn’t know this already? It’s actually legal for them to do this ever since the Patriot Act got introduced. Does not mean I agree with this at all. I think it’s downright egregious",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So we pardon Snowden next right?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I trust the CIA more than the NSA",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Anybody else seriously disappointed? The spying yes, but also having to resort to data brokers. All those mathematicians, cryptanalysts, compromising agreements with NIST, telco trunk taps for naught when someone else does the job better.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "how is this news? everyone knows your phone spies on you",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Did anyone expect otherwise? Privacy died years ago. Move on",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Oops. We broke the law again. What are you going to do about it? Nothing? Yeah, that's what we thought. You fucks can't even agree to fund the government, we're not concerned that you're all of a sudden going to come together and create any privacy laws.\n\nThis is what I imagine the NSA is thinking.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Five eyes! Five eyes! Five eyes! Five eyes! Five eyes!",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No surprise. Obama started it",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“Buying it”\n\nIs honestly probably the least malicious way they could get private info lmao",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Say it ain't sooo!?!?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Selling it to them myself wasn’t an option?!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All of the NSA and CIA's servers should be wiped.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Purchasing with our own taxpayer dollars to spy on us lol",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I feel like we are always fighting them on these privacy issues. It’s exhausting",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What?!?!?! This is the first I’m hearing about this!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "before you approach them",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So like what happened to everyone’s biometric data that was collected in NYC during Covid under the guise “the key to NY”?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I was surprised to hear they paid for it. Since they are very tight with all the US tech and telecommunictations firms I'd have expected them to just basically send it to them real time.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Thanks Snowden",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The NSA has always been spying on its citizens. Just because Snowden revealed it doesn’t mean it stopped.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Meanwhile China tries to destroy the minds of Americans through Reddit and Tik Tok.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": ".",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Imagine if we used that info to save lives instead of blackmail and spy. We pump it it into algorithms to sell you literal shit. The internet could have been such a great cool tool.\n\nOh well",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Talk about lazy.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well, every foreign intelligence agency on the planet has done that, what gets me is how many of those foreign agents actually do work from within the N.S.A and every other agency in the U.S and WE the People (CITIZENS) just keep getting handed the bills to keep all of them in place.\n\nPersonally, I think a REALLY GOOD house cleaning is in order and way overdue but that is just me.\n\nStarted going downhill in the 60's and only gotten worse National Defense units are also in the wrong places at the wrong time.\n\nN. S",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In other news, water is wet and not a single person on Reddit will ever lift a finger against the big bad Gubment",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "so snowden can come home?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s one thing that these bastards have our data; we knew that they have our data. Did they really have to spend our tax money on it?!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Don’t worry, they are lying still and have all of the massive data storage and compute power to rival any private company pointed at collecting any and all data on Us Citizens in the US… for our “safety” of course.\n\nWhy would we trust them after Snowden? After this news?\n\nThey are just pulling the classic maneuver of any criminal caught red-handed – cop to a lesser crime. W",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s funny they always admit what everyone already knows",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So NSA not getting the data will somehow prevent the data from being collected and sold to anybody who wants it?",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Long live Big Brother!",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]