[
  {
    "id": "t3_1auwea6",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.cnbc.com/2024/02/19/nintendo-switch-2-reportedly-delayed-until-2025-shares-fall.html",
    "title": "Nintendo shares fall after report that the Switch 2 will be delayed until 2025",
    "points": null,
    "comments": [
      {
        "comment": "Nice to know any publication big enough can affect an entire market. How much do you wanna bet people there shorted Nintendo before releasing their \"inside information\"?",
        "points": "",
        "children": [
          {
            "comment": "The rumors came out for sure of Friday (when i was looking into it), and several websites had published it.\n\nThis one was literally published today.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ausipk",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.theverge.com/2024/2/19/24077233/wyze-security-camera-breach-13000-customers-events",
    "title": "Wyze says camera breach let 13,000 customers briefly see into other people’s homes",
    "points": null,
    "comments": [
      {
        "comment": "That's why I only point my cameras at other peoples homes.",
        "points": "251 points",
        "children": [
          {
            "comment": "Correct. I have a Wyze cam pointed into u/Deep90 ‘s house as well speak.",
            "points": "81 points",
            "children": [
              {
                "comment": "Can confirm. I opened Wyze and saw myself on your camera.",
                "points": "54 points",
                "children": [
                  {
                    "comment": "Ahh you hacked into my Wyze cam. I see you know your hackering well!",
                    "points": "19 points",
                    "children": [
                      {
                        "comment": "I own Wyze. I saw both of you look at each other. Now kith 📸",
                        "points": "9 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Can you link me?",
                        "points": "5 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Get your hands off my camera!",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I also choose this guys house.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "And mine is pointed at u/WildBurns1234 's mom's house as we speak.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "I dont belive you. What does the sign im holding out her bedroom window say?",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "Zoom in",
                        "points": "4 points",
                        "children": [
                          {
                            "comment": "busted.",
                            "points": "6 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Is the lens sufficiently wide angle?\n\n/s",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I didn't know Wyze made a wide-angle lens.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Can confirm. My camera is pointed at Wildbuns1234’s (user name checks out, fwiw), and saw them spying on Deep90.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This is unfortunately extremely common. Baby monitoring cameras and pet cameras, especially have horrible security. People buy them for cheap on Amazon from random no-name companies that usually just buy them and slap their name on and resell them. They usually have zero consideration for security. Having devices like these on your network can open up all devices on your network to attacks.",
        "points": "44 points",
        "children": [
          {
            "comment": "Yep. Same with the “cheap” smart plugs and many other “smart” devices that people have all over their house now. None of them have any sense of “security” and they’re all just ripe for botnet use amongst many other nefarious purposes. But the stuff is “cheap” and that is enough - just like Wyze cameras.",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This is why if you're friends with any cyber security tech and go to their house you'll notice they don't have any smart devices like washing machines that connect to the internet and least of all a RING doorbell.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Only fools buy WiFi baby monitors. Worse still, some just use or repurpose Amazon owned ring devices or Wyze cameras. The better choice is and always will be RF but I'm still not sure why folks continue to put cameras of any kind inside a home. Puzzling choice.",
            "points": "-11 points",
            "children": [
              {
                "comment": "In the case of baby monitors, I’d wager the reason is to monitor their babies",
                "points": "28 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "There are some good reasons, like making sure babysitters and/or home cleaners are on the up-and-up; or if you're renting a place, you can use cameras to make sure your landlord isn't illegally entering your home.",
                "points": "13 points",
                "children": [
                  {
                    "comment": "That's fair, but I'd literally only have them plugged in on the times I was gone and they were with a babysitter. Otherwise no point",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "The trick is to only make it accessible on your local lan and block it from https/http outbound/inbound from the internet",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Hopefully you’re blocking entirely because they can communicate over many other protocols than http/s",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "People have to have the option to watch me and then say “nahhh” so I can properly dance like no one is watching.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Love like you've never lost, and f##k like a g#$damn r#tard. RIP grandma",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "You can dance if you want to,\n\nYou can leave your friends behind!",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "People have to have the option to watch me and then say “nahhh” so I can properly dance like no one is watching.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Stop putting live feeds of the inside of your home in the cloud. If you want security cameras, invest in a system that records locally only, and is only accessible while on your network (or with a secure VPN).\n\nStop putting cameras IN your home. They should be outside only if you really value privacy.",
        "points": "143 points",
        "children": [
          {
            "comment": "Mostly people do this to keep an eye on an elderly parent in case they fall or something. At least in my experience",
            "points": "39 points",
            "children": [
              {
                "comment": "Or an animal",
                "points": "33 points",
                "children": [
                  {
                    "comment": "Yep. Got a stationary cam that only points at my pup's play pen. Nothing gets saved in a cloud, and I turn it off immediately when I get home.",
                    "points": "7 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Can confirm, saved my grandmothers life from 6 hours away.",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I turn mine off when I get home. They physically point down so even if someone hijacked my feed all they could get is the sounds of me crying.",
            "points": "15 points",
            "children": [
              {
                "comment": "Hey if some hacker wants to watch me put on my VR headset and edge for 6 straight hours that's on them. 🤷‍♂️",
                "points": "6 points",
                "children": [
                  {
                    "comment": "If I were watching I'd turn on the mic to ask how you're going for so long",
                    "points": "",
                    "children": [
                      {
                        "comment": "Antidepressants.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "It takes practice.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The idea that most people would know how to setup and use a VPN to access a camera is laughable. I think there might be a market for a bit of software you can install that does it for you, but even so, getting past router settings and ISP configuration would make this impractical.",
            "points": "8 points",
            "children": [
              {
                "comment": "The idea that most people would know how to setup and use a VPN to access a camera is laughable.\n\nThis has been a zero config needed feature on consumer routers for a decade now. Today in 2024 it’s not remotely hard. Even the concept of a VPN is commonplace today given the amount of people who had to work remotely during the pandemic.\n\nI think there might be a market for a bit of software you can install that does it for you, but even so, getting past router settings and ISP configuration would make this impractical.\n\nLike I said, this is a feature on consumer routers already. There is no configuration needed. You literally just turn it on and make a user/pass. Some even have a QR code to scan on your smartphone to make setup there a breeze as well.",
                "points": "-5 points",
                "children": [
                  {
                    "comment": "I think you overestimate the number of people who even know that they can access their router configuration, and, as someone who has provided IT services to those needing to connect via VPN, it is still very mysterious to many. The likelihood that someone would connect to a VPN if they didn't need to by their job and without an IT help desk is very low.\n\nMy mother in law doesn't even know she has a router. As far as she is aware the box that is a combination router/modem is called \"the WIFI\".\n\nI will concede that it is much easier than it once was, but it is far from as easy as plugging in a device, installing an app, and following on-screen directions. That is about as hard as it can be before the vast majority of people will give up on it.",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "My advice isn’t for the majority of people, it’s written here on Reddit, for Redditors.\n\nJust by being a reader of this subreddit, the people here are already vastly more knowledgeable on this kind of thing than the general population… and that’s even after factoring in that /r/gadgets is probably the least knowledgeable/informed tech related subreddit on the entire site.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I’m decently tech savvy and I have no fuckin clue how to do it. I got so far as to making an openvpn account and then it asked me for server details and I got stuck",
                    "points": "",
                    "children": [
                      {
                        "comment": "Do you have a router with OpenVPN? Or an always on computer, like a server, that you could install it on?",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Most people have no idea what a “router configuration page” is, let alone what to do with it or even how to access it. We live in a real bubble around here…as for remote access via the router that isn’t always possible either because of CG-NAT or other double-NAT network scenarios. So it’s not as cut and dry as you imagine.",
                    "points": "",
                    "children": [
                      {
                        "comment": "My advice isn’t for the majority of people, it’s written here on Reddit, for Redditors.\n\nJust by being a reader of this subreddit, the people here are already vastly more knowledgeable on this kind of thing than the general population… and that’s even after factoring in that r/gadgets is probably the least knowledgeable/informed tech related subreddit on the entire site.\n\nWe live in a real bubble around here…as for remote access via the router that isn’t always possible either because of CG-NAT or other double-NAT network scenarios.\n\nThere are ways to deal with that.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "We have indoor cams. but they are on a local wired network that is not connected to the outside world. Best way to do it.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Our indoor Nest cams are off when we are home. If we leave for vacation or a really long time we turn them on. My fiancée has a crazy dog that freaks out if anything loud outside happens. It's a way to keep tabs on her when we our out. Otherwise the rest are outside.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Is there a plug and play option for setting up a home server? It seems complicated",
            "points": "0 points",
            "children": [
              {
                "comment": "Yes, but they’re not usually cheap. Personally I use Ubiquiti’s ecosystem for security cameras and they all record locally to either one of their all-in-one router systems, or a dedicated NVR (network video recorder).\n\nEdit: blah blah Ubiquiti had a similar incident recently blah blah. Yeah. For users that had cloud access enabled… which you are absolutely not required to use, and I sure don’t use it. You can stop pointing this out now.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "Ubiquiti had this exact issue 2 months ago. If you use the app to view recordings outside of your home network, you need to enable cloud access. And the authorization control for that is managed wholly by cloud servers, not your device. So when Ubiquiti messed up on the mapping of access tokens to users, people could view the live feed of others.\nAnd by default you can't access your UDM or NVR over VPN because Ubiquiti puts you in a different subnet, and relies on broadcast/multicast to find the device. So you can't use the app any longer at that point. Even if that was solved you couldn't rely on push notifications any longer because those are triggered by the cloud as well and Ubiquiti doesn't give you control to set up a custom integration.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "And by default you can't access your UDM or NVR over VPN because Ubiquiti puts you in a different subnet,\n\nIf you simply cannot change the subnet or assign your own static IPs you can always set up routing to the subnet.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "lol…ubiquity literally had the same problem with customers being able to view other peoples cameras and not long ago. For what their setup costs it’s hard to believe any one would stick with that.",
                    "points": "",
                    "children": [
                      {
                        "comment": "You’re ignoring a very fundamental part of that event… it only affected users who authenticate via their cloud service, which you absolutely do not have to use. I don’t, and never would imagine using it… the idea of accessing my router via a third party is bonkers. No reason to do that.\n\nCompare that to systems like Wyze, where you literally don’t have the option to not use their cloud.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Bold of you to assume that Wyze will let you use their cameras without them accessing their serves.",
            "points": "",
            "children": [
              {
                "comment": "Bold of you to assume I’m suggesting anyone use Wyze cameras.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Would probably help to suggest guides and resources to set up such a system. Most people just go to Amazon and buy whatever the cheapest “security camera” happens to be that day. Always some cloud-based system and usually a dubious Chinese app to boot. But hey it was $19.\n\nIt’s entirely possible to setup a secure system but it’s not cheap at all.",
            "points": "",
            "children": [
              {
                "comment": "Cheap shit is cheap for a reason, because it’s shit.\n\nAs far as a guide goes… it’d be better to just search for the relevant subreddits for this subject and start talking to folks there.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Also: kill the gateways on your cameras and NVR. Them things phone home to China more than people suspect.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This doesn't sound like a breach at all, it sounds like a bug. Breaches are malicious intent, which I'm reading none of. Still bad though.",
        "points": "33 points",
        "children": [
          {
            "comment": "It’s still a “breach” due to the sensitivity of data involved. In this case it was faulty design, rather than an attacker, but private data was still breached.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "If we notice a potential threat vector in our system (for example missing credential checks) and we can't rule out access by a third party, we have to report it to all out customers as a (potential) breach. Which is annoying, but legally necessary.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "And this is why you don’t use cloud-based consumer security products, particularly ones you find on the TikTok shop for $20.\n\nThe last thing I want is for some creep on the internet to be able to see my kids playing in the back yard.",
        "points": "70 points",
        "children": [
          {
            "comment": "Well, it's one of the reasons. Not wanting a cloud company to have access to my personal data (such as, you know, my face on camera at set times) would be another one for me. I'm sure their data processing is \"anonymised\", but with enough data sets to combine that doesn't count for shit.\n\nNo thanks. It's bad enough everyone else's door cameras are already passing their street views on to the highest bidder.",
            "points": "15 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This is why you don't use cheap knock off products.\n\nWiseNet cameras are phenomenal products and used in business's all the time.",
            "points": "2 points",
            "children": [
              {
                "comment": "Wyze has nothing to do with Wisenet. A few google searches makes Wisenet look like a sketchy Korean knockoff",
                "points": "2 points",
                "children": [
                  {
                    "comment": "You've got it backwards. Wisenet is the actual enterprise product lol. Wyse is the cheap knockoff, why tf do you think it's sold on TikTok",
                    "points": "-2 points",
                    "children": [
                      {
                        "comment": "Many reputable products are sold on Tiktok. Wyze is sold by Microcenter, Walmart and Home Depot... Having a Tiktok store just means you reach more people.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This will continue to happen until companies realize that attaching their tech to the Internet makes them a data security company first and a hardware company second.",
        "points": "8 points",
        "children": [
          {
            "comment": "Only regulation or massive lawsuits would make that happen.",
            "points": "10 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I love these discussions on Reddit; they inevitably devolve into a “why I’m so much smarter/better because I do things like xyz..”",
        "points": "4 points",
        "children": [
          {
            "comment": "Aka the e-peen contest and sadly it’s par for the course.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Exactly why I don’t use cameras that require a service.",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wyze doesn’t have a perfect track record, but they’re better than most companies in their price range.",
        "points": "13 points",
        "children": [
          {
            "comment": "All the cloud camera companies have security issues and/or freely provide their customer to law enforcement & governments without subpoenas.\n\nIt’s all trade offs. I still think Wyze still has the best trade offs, I just won’t use them inside anymore (we have one to watch the dogs which happens to also be next to where we shower so chance of nude human is high).",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Sounds like settling for something in that price range is a pretty dumb idea",
            "points": "2 points",
            "children": [
              {
                "comment": "Might be dumb if perfect privacy is what you expect. If convenience is more important than perfect privacy, it’s a fine option.\n\nI’ve used Wyze cams for years to monitor sump pumps, livestock, unmanned industrial spaces, etc. Privacy is not real critical where I need them, and I don’t need video surveillance in my house.",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Agreed. They seem to be at least 'trying'.\n\nAs someone that isn't particularly privacy conscious, it's good enough for me.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "wyze is a pos all things considered, and I base that on what they tell people. Sure if you're knowledgeable in the area you can decide for yourself and research but an ordinary customer isn't knowledgeable on that. Wyze devices are used in the eu, they are lucky that their company has no direct presence there because if they did they'd have been fined into oblivion by now due to things like this",
            "points": "-1 points",
            "children": [
              {
                "comment": "Maybe but I still think they are the best option in the 'cheap ass security camera' space.\n\nIf you want privacy, you shouldn't use anything with cloud service. And since Wyze provides an RTSP firmware (and there are also some custom firmware options), they really aren't a bad option if you want to go that route either.\n\nThat said, their new generation of cameras doesn't support rtsp firmware or have any 'custom firmware' options yet, so that statement is really only relevant for wzye cam v3 and previous.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "If you want privacy, you shouldn't use anything with cloud service. And since Wyze provides an RTSP firmware (and there are also some custom firmware options), they really aren't a bad option if you want to go that route either.\n\nExcept they don't for anything newer than cam v1 or v2. And my original point stands, sure you and I know what RTSP is, does some random person in a shop know what RTSP is? No",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "And my original point stands, sure you and I know what RTSP is, does some random person in a shop know what RTSP is? No\n\nExcept for the random person, what should they buy? I wouldn't recommend ANY 'cloud' cams, as I doubt they are significantly better than wyze. You need to go for a local network option, and unless you're 'knowledgeable' you're going to need to hire someone for that.\n\nSo, yeah, my point still stands as well.\n\nExcept they don't for anything newer than cam v1 or v2\n\nAFAIK, cam v3 can as well, but that's the last of it.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "Not true, the proper way to implement security would be to have end to end encryption, this means that the camera has a key which is shared with e.g. the user's phone, this means the transit does not matter because the data is useless even to the company providing the transport. With wyze, that is not true, wyze has the keys to the cameras (this is how they can get the feed on their systems), this means that if someone compromises their database, every single device they have now has no security. There is no comparison there, any ordinary person will not have sufficient knowledge to figure out and understand that\n\nedit: And just to be 100% clear, the issue I discovered whereby you can view cameras still after having access revoked was complete accidental, a friend asked me to test sharing so I did, and from that I was able to continue viewing the camera stream hours after they revoked my access, this is not something that the company mentions at all",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "There is no comparison there\n\nComparison to what? Does any cloud camera have end to end encryption? Cause I would be quite surprised (and interested) to hear that.\n\nI mean, so what would you recommend to the average user?\n\nEDIT: Apparently there are some that do. TIL. that is a good solution, but even E2EE has it's downfalls if it's not properly implemented. And it can be inconvenient to have a proper implementation...",
                                "points": "0 points",
                                "children": [
                                  {
                                    "comment": "See edited message. Well for one it's pretty obvious to me why you can't get wyze devices delivered to the EU from wyze themselves and have to use a third party to do that, because they absolutely do not comply with the laws here at all. As for what cameras to recommend, I don't know, and frankly I don't care, the wyze cameras I have are fine to me as I've said before, if someone wants to connect and watch a stream of birds then great, by all means enjoy it! But the \"average joe\" has no idea of the issues that are in these systems and wyze does not even acknowledge them, that is a problem\n\nedit: Security comes at the cost of ease of use, the most secure system is impossible to use, the easiest to use system has no security what so ever, they are opposites for a good reason",
                                    "points": "0 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Not really. They have had several similar “incidents”. One would be enough for me…\n\nAnd to say they’re better than most is like selecting the shiniest bullet for your execution.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Welcome to my boring life.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Dale: So who wants the new introductory surveillance package? For an extra 30 bucks a month, you'll get a closed circuit feed of Bill's house. It puts it all in perspective, believe me.\n\nBill: I believe you.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I just don't understand how caching can possibly relate to userId's and deviceId's being checked against in a system. These id's are normally 36-character alphanumeric strings or better known as uuids in any type of common sense platform. They don't change once assigned to an item. So why caching could cause access to other people's cameras is beyond me.",
        "points": "1 point",
        "children": [
          {
            "comment": "Someone posted a technical explanation on the Wyze subreddit for how this might actually happen.\n\nEssentially this category of issue is common in non-thread safe code and may only happen when the pool is fully allocated.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Another win for self hosting with blue iris or an alternative.\n\nWhy anyone trusts these companies I'll never know.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don’t have any of their cameras, but I do have a couple of their smart plugs and now I’m worried someone else can use my electricity!!",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is why I don’t use the cloud and I have SD cards in mine. Hope that was enough lol.",
        "points": "1 point",
        "children": [
          {
            "comment": "Are you running the rtsp firmware? If not, it still sends data to the cloud.",
            "points": "4 points",
            "children": [
              {
                "comment": "And the rtsp firmware is deprecated, they stopped development when they figured out they couldn't profit enough from it.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "They should charge $100 for the rtsp firmware 😆",
                    "points": "-3 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I’m not even sure. I like them cause they are cheap and I can put SD cards in them and they work pretty well for cheap cameras.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why do people continue to put cameras inside their homes? You might as well just remove all your shades and leave the doors open.",
        "points": "-1 points",
        "children": [
          {
            "comment": "Dogs. They're easy enough to unplug when we need (want) them off, and the overhead of setting up VPN with PoE cameras (and the higher cost) is more than my wife wants to deal with. They're objectively lower quality than any decent PoE camera, but they're easy.",
            "points": "6 points",
            "children": [
              {
                "comment": "We like to have a live feed of our lizard when we’re away for a few days. Otherwise it’s off and put away",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "My indoor nest cams automatically turn off when me or my wife get home...",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Bro, don’t kink shame.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Virtual glass house.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Toddlers",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "There are plenty of legit reasons to have indoor cameras. The real issue is buying cheap ass cloud based ones…and the answer there is the same as basically anything and everything else: price.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Ohh so they are allowed to see/use camera with out paying 20$ per month lol",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Thats not a breach, they f’d up.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This brand is heavily promoted on TikTok.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Aww shucks they got my private privates cam. Now a guy will email me blackmailing me or he might release my naughty pics.",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Waymo cars are absolutely covered in cameras, constantly surveying every bit of public life along where they drive. Can't wait till the story breaks on that ticking time bomb.",
        "points": "-5 points",
        "children": [
          {
            "comment": "They’re outside in public, who cares? You don’t have an expectation of privacy in public.\n\nThey most likely only keep the video as long as they must for legal protection, and then it’ll get dumped. It would be WAY too expensive to keep all that video forever when 99.99999999% of it is garbage.",
            "points": "8 points",
            "children": [
              {
                "comment": "Those videos are being kept for as long as possible, mined for every scrap of data that exists, and sold to anybody, and everybody.\n\nQuestion: Twenty-Twoish years from now, the CIA is going to be deploying new field agents. Are they going to be screened to ensure they don't come up in any data sets?",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "As someone who has overseen the deployment of networked video storage systems in the hundreds of petabytes… “as long as possible” is going to be MUCH shorter than you think it is. It really will be only as long as their legal team thinks they need to keep it around to protect against lawsuits from riders and other drivers… and not a day longer.\n\nYou are vastly underestimating how expensive it will be to store that much video data, and overestimating the amount of value they could mine out of it.\n\nAt best, Google Maps and Street View is going to get really fucking good, and very up to date for the given service areas Waymo operates in. But other than that, the value of that video really is 99.999999% worthless. It’s going to be hours upon hours of the same streets over and over with almost nothing of interest to be mined at all.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "News Alert, there are cameras all over in public that are publicly accessible.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I can't imagine the mentality of somebody who thinks that video footage of public spaces is a ticking time bomb.\n\nPeople these days man....",
            "points": "2 points",
            "children": [
              {
                "comment": "I don't think you have been informed about the analytical capability of AI. Once they start adjusting insurance based on driving habits collected from Waymo you might care.",
                "points": "-2 points",
                "children": [
                  {
                    "comment": "Hah. Yeah, I work on AI models but I just don't understand the analytical capacity of AI yet. You got me.\n\nSo you mean my insurance is going to be actually applicable to my driving style instead of just a generic blanket policy? Well that's a great thing.\n\nThe only thing that's bad for is the shitty drivers in society. Things like this do one thing buddy, they show everyone that you're the one that's afraid of getting left in the dust, that you're the bottom percentage that's being held up by the rest of society. And I say let AI illuminate who those people are and let them pay for their own deficiencies.",
                    "points": "-2 points",
                    "children": [
                      {
                        "comment": "The projection is strong here. You're just telling on yourself.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "How so? Some cameras are outside. Did the breach only affect cameras inside?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What is my purpose?\n\n\"You allow strangers to watch me walking around the house naked.\"\n\nOh...my...god.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This sucks. Literally the equipment I have recommended to friends and family.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "OMG that's so creepy, can't believe this happened 😱",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I was one of those people. Someone saw me hitting a big bong rip lol",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Time for some laws regarding this. Cloud home invasion!!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Unifi Protect ftw!!!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why do y'all use this shit? I swear, people are gaslighting themselves in to believing this isn't weird as fuck to have in your house.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Aaaaaand I’m done with Wyze. Fool me once? Shame on you. Fool me twice? Shame on me. I’ve got five Wyze cameras and three smart plugs. All of which have constant issues. This is the straw that broke the camel’s back.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "For the most part it’s just going to be a lot of farts, burps, and undesirable naked activity",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I love when stuff like this happens. Maybe it helps someone learn.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So someone got to watch my pet lizard roam around her cage? Cool. /s",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Aww ......that sucks. I know someone would have appreciated my outdoor cannabis grow this year. /s",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I always see viral clips of people from within their homes and I can't understand why people have cameras in their living, and sleeping!!!, areas.\n\nWhat exactly is the reason for it? Security can be outside not inside.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aush96",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.engadget.com/the-uk-moves-another-step-closer-to-banning-phones-in-schools-132518091.html",
    "title": "The UK moves another step closer to banning phones in schools | It follows countries like France and Italy in restricting phones during class.",
    "points": null,
    "comments": [
      {
        "comment": "See now we (US) could have this but instead we've chosen guns.\n\nAfter a gunman scare at my son's high school & then an actual gun used at the school next town over, i am pro-phones in pockets.",
        "points": "16 points",
        "children": [
          {
            "comment": "A dumb phone (flip phone) works perfectly for that. It’s smart phones that need to be banned in schools.",
            "points": "6 points",
            "children": [
              {
                "comment": "Mm ok but will you pay for it for my 16 year old since they cost the same or more as a smart phone which they already have?\n\nAlso flip phones text and have some games (like SNAKE) if that's what you're thinking it would stop texting. source, i have had cell phones since 1993.",
                "points": "",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Dumb phones have apps. Dumb phones can text. Dumb phones can take pictures. Dumb phones can play sounds. So no - let's not.\n\nSwitch them off and remove them if seen/heard - this is the way.",
                "points": "-11 points",
                "children": [
                  {
                    "comment": "That’s been the rule for years, and it’s failed miserably. Flip phone or no phone.\n\nP.s.— try running Instagram on a flip phone. 😂😂😂",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "The rule works perfectly fine in my most recent two schools. Bad behaviour management in some schools doesn't mean the rule can't work.",
                        "points": "-2 points",
                        "children": [
                          {
                            "comment": "The rule can’t work if some teachers won’t enforce it— You know that’s true. Teachers who won’t enforce the rules should be fired. Is that you?",
                            "points": "-4 points",
                            "children": [
                              {
                                "comment": "So if rules aren't going to be enforced then no rules will work - government mandated or otherwise.\n\nAs for your second two sentences - wut? We can't sack teachers for any old nonsense - schools can't get enough of them as it is.",
                                "points": "-2 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "you totally can do Instagram on Galaxy Z flips",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "All this does is teach kids how to hide/smuggle/lie. You have to work with kids, not against them. Isn’t this known at this point?",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "My kids have to lock their phone in a box at the start of school, then get it back from the box (along with all the other kids) at the end of the day.\n\nI'm fine with it. Kids were annoyed at first but quickly adjusted.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They need to do this in the USA, ASAP!",
        "points": "1 point",
        "children": [
          {
            "comment": "Parents will freak out that they need their kids to have a phone in case their school has a mass shooting.\n\nAs a parent of school aged kids & as someone who works in (higher) education, I completely understand both arguments.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "My kids school district already does.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Need to do this everywhere. Phones don’t go along with attention spans. They are a fine tool but they often take away from learning.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "\"We don't know how to make learning interesting so we'll just pretend it's the kids' fault.\"\n\n- awful teachers since time immemorial",
        "points": "-9 points",
        "children": [
          {
            "comment": "Maybe not everything needs to be entertaining",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aui1lt",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.notebookcheck.net/Samsung-Galaxy-Tab-A9-review-The-90-Hz-tablet-with-4-years-of-updates-leaves-little-more-to-wish-for.804144.0.html",
    "title": "Samsung Galaxy Tab A9+ review - The 90-Hz tablet with 4 years of updates leaves little more to wish for",
    "points": null,
    "comments": [
      {
        "comment": "bought an A7 lite new in 2022 and it was fucking amazing to me that this was a product being sold new. unusable in every way, expect to wait 5 minutes just for the tablet to finish starting up. almost one minute to open basic apps. every gesture is about 2 - 5 fps. and no, there's nothing wrong with it, i didn't set it up wrong, i didn't install weird shit or fuck with it, that's just the way it is. that's how it performs.",
        "points": "245 points",
        "children": [
          {
            "comment": "Yeah the A7 lite is complete garbage",
            "points": "72 points",
            "children": [
              {
                "comment": "I have the S6 Lite tablet with the active stylus, I only use it to read One Piece every week and that's it because it's such an aggressively terrible tablet. I want to upgrade to an OLED tablet with active stylus soon.",
                "points": "-4 points",
                "children": [
                  {
                    "comment": "I've been rocking an S6 Lite for several years now and it's served me quite well",
                    "points": "6 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "S6 lite is amaaazing",
                    "points": "7 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Ha! I bought mine for the same reason.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Samsung marketing: Rave review from u/subadanus, “Bought a A7 life in 2022, it was fucking amazing… there’s nothing wrong with it”.",
            "points": "141 points",
            "children": [
              {
                "comment": "Honestly I’m so glad Google makes the Pixel. Samsungs garbage customer service and shit build quality is what swore me off android back in the Note 3/4 days.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "The phones that compete with the pixel have significantly better build quality than the pixels, the biggest win for Google is lack of Samsung bloat and better software support because they run their OS stock",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Everything samsung is garbage except their flagship phones. They have never given me issues and I've had multiple models over the years.",
                    "points": "11 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I have owned three separate pixels, and I have had hardware failure on all of them. On my current pixel (Pixel 7), the screen is starting to peel away from the body of the phone. It started when I only had the phone for about 6 months. Now I have had it for about a year.\n\nStill, it would take a lot for me to consider something else because the alternatives are much worse.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Why not OnePlus? I have the 11 and it's a pretty damn good phone. It's been amazing to charge my phone from dead to 100% in 15 minutes with the battery life being really good.\n\nThe only two things I don't like. The curved edge screens means I can't find any tempered glass screen protectors that I can use. And the camera isn't as good as the Pixel in low light (though in any other situation it is close and sometimes beats the Pixel)",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "I had the Pixel 6 and really liked some things about it, but they removed a lot of the features that I liked about it by the time I was going to buy my next phone. I didn't like how big the screen was, though. I also really hated the physical audio slider, because I want my phone on vibrate 100% of the time, but it would accidentally slide when I would put the phone in my pocket, which really irritated me. The audio slider was actually the biggest deal breaker for me. If they let me remap it, I would seriously consider another OnePlus phone despite the screen being uncomfortably big.\n\nI also got hardware failure on both my OnePlus phones (2 and 6) in the past. The volume buttons on my 6 broke and we're always being pressed. And one speaker stopped working on my 6, so I had to be on speakerphone all the time.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Still, it would take a lot for me to consider something else because the alternatives are much worse.\n\nConsidering that I, and nobody I know, have ever had any of the terrible hardware and software issues I'm seeing on this thread with an Apple product I'm not sure that's true. And I buy used.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "That's great, and for the people who prefer iPhones, I'm really happy for you to have hardware that has thoroughly vetted quality control. But I don't like the iPhone UX, none of my favorite apps are available on iPhone, and I can't sideload apps. Because of these reasons and so many more, iPhones aren't an option for me. I would rather replace my phone more often than use iPhones, personally.",
                            "points": "3 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "I have a P7 that has always been in a case with a screen protector. I bought it shortly after it initially came out. No physical issues but my battery is absolutely garbage now. It's incredibly frustrating. I'm considering either trading it in for that new OnePlus with incredible battery life or just waiting another year until the new iPhone comes out. Haven't had one of those since the iPhone 4, but I know the battery life is great and it just works.\n\nAlso not to mention that the modem still sucks for my dual sim set up.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yeah, I tested one in a showroom, and it was clear it was struggling to perform basic tasks.",
            "points": "24 points",
            "children": [
              {
                "comment": "To borrow phrasing from some tech YouTubers, it’s basically manufactured e-waste.",
                "points": "23 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I have an S7 FE. Used to be OK until the last update, now it is like 50% slower with OneUI 6.0.",
            "points": "10 points",
            "children": [
              {
                "comment": "mine actually got veeery slightly better with updates, but it's still a paperweight, why would i ever use it when i can just use an ipad and not have to spend 30 seconds waiting on my webpage to load?",
                "points": "9 points",
                "children": [
                  {
                    "comment": "I use it for reading comics, and 16:10 aspect ratio is a must if you want to have a page fill the screen. But that's the only reason I still with Android tablets.",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "mine spends its time only doing OBD app stuff, because that seems to be a mostly android thing, they don't make good stuff for iOS or iPadOS",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "They're really nice for old school emulated games.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Same, only use it for comics. Fire tabs fill my needs",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Highly recommend buying nova launcher. I’ve used it on all my android devices and it’s so much cleaner and simpler than oneui.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "It's weird but my S6 Lite (2022) got a bit faster after OneUI 6.0, writing on it is a bit smoother now too. I got it pretty cheap and it does everything I need it to do taking notes, YouTube and reading manga/comics.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "I haven't tried writing on it with a pen yet, but just in general, the animations got choppier. I don't really care, since all I do is read comics and watch YouTube on it.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I have one as well and I hate it and it only gets worse over time. It feels just ever so sluggish and unresponsive enough that I feel like I am mistapping, mis-swiping, mis-homescreening, navigating back etc all the time.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "The last update broke something with mine. I have a third party case, and when it's folded back, the magnets cause the screen to freeze.\n\nIt happened with one other update, but there was a setting I could disable so it wouldn't happen. Now, I can't find it anymore.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I don't understand why it's so slow, I have a pixel 4a 5g with the same CPU/ram and it's way faster",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Pixel 4a 5G has 6 GB of RAM (vs 4 in S7 FE) and has a 1080p screen instead of 1600p.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "You could get the S7 FE with 6GB of ram. And the resolution should only impact things using the graphics card. There's no reason for the tablet to be significantly slower opening the same app that isn't GPU heavy.",
                        "points": "-1 points",
                        "children": [
                          {
                            "comment": "Except less RAM snd a higher resolution screen.",
                            "points": "-1 points",
                            "children": [
                              {
                                "comment": "As I mentioned in my post, my tablet has the same amount of ram as my phone. And opening something like a weather app is not a GPU heavy task so the resolution should not have a major impact on opening that app. Playing a video game would have a noticeable affect at a higher resolution, not opening a basic app",
                                "points": "-1 points",
                                "children": [
                                  {
                                    "comment": "Yes, you did say that screen resolution does not affect performance. It's ok to admit you don't know hardware affects performance.",
                                    "points": "-1 points",
                                    "children": [
                                      {
                                        "comment": "Damn my guy, I think you need to reread what I said a few times. I had said, on non GPU heavy tasks, there should not be such a noticeable effect on performance going from 1080p to 1600p. 1600p should not cause a weather app to open more than a few fractions of a second slower at WORST over 1080p. The same weather app takes more than 2 seconds longer to load.\n\nIt's okay to admit that you can't read.",
                                        "points": "0 points",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "My parents have an even older Samsung tablet (not S line) and this isn't the case there. Yeah, it's slow, but it's very far from what you describe. It around 5 years old at this point.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "these devices are traps meant to trick older folks into accidentally buying e-waste",
            "points": "7 points",
            "children": [
              {
                "comment": "Seriously. Samsung anything but S-Series and the now defunct Note series are absolutely the worst products I've ever seen.\n\nYou spend $200 on a tablet you get a $200 tablet, not sure what people expect.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I can say the 2020 original A7 10.4\" doesn't fair much better. On stock Samsung Android performance is borderline unusable. However I did see that my model was compatible with lineageOS and installed that ROM. That alone made the A7 actually a speedy little bastard. Like no joke it's useable now.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I bought an s6 lite 6 months ago and i was shocked at how laggy and unusable it was. Just swiping up from the bottom of the screen, was slow and jerky.",
            "points": "0 points",
            "children": [
              {
                "comment": "I only used mine for note taking and it was alright for that, but even the most basic iPad would blow it out of the water. Cheaper devices have been getting better and better with their specifications but it seems like Samsung missed the memo",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I bought Galaxy Tab A 10.1 2019 back in the day and its similarly slow as hell, out of the box. Even custom rom didn't help much.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I got one for free from a deal with my phone provider. Returned it because I thought there was something wrong with it. Got a new one and learned that’s just how it is. Utterly unusable trash.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I just got one as a gift, I installed just a few apps and it was glacial followed a few good guides to speed it up and it is semi-usable for red reader but that's about it. What a scam.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I stand by every word you say.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yep got an A7 exclusively to use as an e-reader, and every time I used it I regretted not getting a kindle instead. Completely unusable in almost every way like you said. Even the kindle app seemed to be pushing it nearly to its limits.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The A series tablets have never been a good value preposition, ever. Always offering too little too late.",
        "points": "117 points",
        "children": [
          {
            "comment": "Yeah. The S line is fine but the A one has always been bloody slow and underperforming",
            "points": "10 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "What would you recommend instead?",
            "points": "7 points",
            "children": [
              {
                "comment": "Honestly with the A9+ being close to $200, I'd add $20 more and just get the iPad 9th gen. It's design is getting old, but it will perform way better and it's still getting updates and will probably continue being supported for another couple of years.",
                "points": "39 points",
                "children": [
                  {
                    "comment": "even ipad 6 still doing fine honestly, but not much life left",
                    "points": "11 points",
                    "children": [
                      {
                        "comment": "Plus I think one underrated aspect is that if you are not already an Apple ecosystem person but want to try it out, you can pretty much get into all of the features of the Apple ecosystem pretty much fully, with a basic iPad that's still supported.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "There's simply no decent competition to the basic ipad. Costs slightly more but it makes absolute sense. The ipad 6th gen I have still works fine except for battery which went to shit a year ago. Battery replacement is not recommended by Apple but you can still get it done and use it for 2 more years. Bought it for slightly more than $300 in 2018.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I can get either this or an iPad 9th gen for free with data plan from my carrier, and I needed a tablet data plan anyway, so this helps make the decision for me. Thanks!",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "its* design is getting old",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "In Canada, the iPad 9th Gen is almost 165$, or 60%, more. ($449 vs $285)",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "If your price point is fixed, Id always recommend something like the Redmi Pad SE or Xiaomi Pad 6. They have Snapdragon chipsets and offer a much smoother experience.\n\nIf your price point can stretch, Id recommend a Samsung Tab S9FE or maybe even a S7/S8 if you can find one.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "I've been using a Xiaomi Pad 5 that I bought for only $400 and it's nothing short of amazing. Super smooth with 120 Hz, bright, responsive. The build quality is the same as Apple products, just a single solid piece of aluminum and glass. The sound is fantastic. I also got the Xiaomi pen and keyboard for an extra $100. I really wish these products were available when I went to uni - it's a perfect tablet for studying and entertainment. 12+ hr battery life and fast charging! There's literally nothing I can complain about that one",
                    "points": "7 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "What about Lenovo Tab P11 (Gen 2), is it a good/better alternative?",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "Software is garbage. Otherwise it's OK.",
                        "points": "5 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Fairly competent hardware, but I dont trust Lenovo to be great with software support",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Lenovo xiao xin pad pro 2023\n\nUses the dimensity 9000 chip which is on par with former flagships\n\nWas so happy with mine I bought 2 more\n\nIts not going to go toe to toe with $1000 flagships. It's not meant to\n\nBut its the best bang for buck does everything tablet that isn't slow\n\nAlso has pen input. Keyboard accessory, desktop mode. Runs fortnite level of games flawlessly, wide vine l1 for netflix 4k, has Oled 2k panel and laminates display with thin bezels\n\nI bought an ipad 10 last week for kids school and thought I got a 5 year old outdated model in comparison",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I bought a Lenovo P11 Pro on sale last year and it's amazing for consuming content.\n\nNice OLED display, decent performance for the price, and excellent aspect ratio for reading in portrait mode.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I buy whatever used S-series tablet fits the budget. I have an S3, S5, S7, and S8, all in active use. They all look great with their OLED screens and run smoother than a brand new A-series, even the 7-year old S3.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "As late as this year's pre-orders, you could get a A8 on Amazon for EUR 130-140 and then exchange it on Samsung Trade-in offers for EUR 160. In that sense, it's worth the value.",
            "points": "2 points",
            "children": [
              {
                "comment": "If youve used any A series tablet, even at a Samsung store, you know its just an extremely subpar experience. It screams EUR 50 build quality. It cant even run its own UI smoothly out of the box with no apps installed.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "I still have that A8, and it is working fine. It's just that now we are spoiled so much with state-of-the-art stuff that we act like the \"high minds\" who won't deign to even entertain the idea of a sub-120 Hz screen with no OLED screen, PSHAW!\n\nAnd for a price less than a mid-range phone, you get a 10'' screen, and an expandable storage. I wasn't using it for taking selfies, just to read and watch some shows. It's better than getting a Kindle for the same price range.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Im not saying that it s a bad choice to make, just that theres other options if youre in the market to buy one. I have a Tab S7FE. No OLED. No high refresh display. Just a smooth experience, despite being the 4GB spec.",
                        "points": "-1 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "But the review says\n\nFor a tablet in this price range, the Galaxy Tab A9+ offers a great amount of value",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Best tablet Samsung did was the Tab S5e. There's no way in hell they'll release a 400$ tablet with an OLED screen again. And that is that light and thin.",
        "points": "55 points",
        "children": [
          {
            "comment": "I'm an s5e owner too. I feel like there is no upgrade path for me that doesn't end up costing 3x what I paid for s5e. Already having amoled display makes it so much harder. I'd really like a S9+ but it's god damn laptop money.",
            "points": "21 points",
            "children": [
              {
                "comment": "When they first launched the S9 there were email list coupons that knocked $150 off the price. Then they also had a trade in deal and I got $500 for my used s5e. Bringing it all down to $449. Got double the storage space too.\n\nThey do cross ship too. So you can migrate all your data between units before sending the old one away.\n\nBefore the next Samsung hardware keynote keep an eye out and you might be able to get a similar decent deal.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Agreed, I bought it second hand 2 years ago for under £200 ($250) primarily for its screen and quad speakers. \n\nApart from some minor backlighting issues where some parts of the screen are a bit darker than others, it's been absolutely brilliant as a media consumption device.  \n\nI don't play many games on it since the processor isn't that strong, but it definately can play some lighter titles well. And despite it only having a 60Hz display, for my use case it just isn't necessary",
            "points": "1 point",
            "children": [
              {
                "comment": "S5E is great for digital board games",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "That's a shame. The s5e was my first good tablet and no similar upgrades in the price range were ever released.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I got an S7+ on sale for $450, it's not that bad.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Got the 8+128 Wifi version for around USD 200. Had it for around a month, all I can say is it hasn't stuttered or lagged yet. Streaming, smart view, google sheets, facebook, reddit all running without needing to clear ram.",
        "points": "17 points",
        "children": [
          {
            "comment": "I was gonna bring that model up. The 4gb ram one is auto-ewaste. Anything with that low of RAM now a days is actually.\n\nBut the 8gb model with more storage must be considerably better for the price. Samsung tablets often go on sale too.",
            "points": "5 points",
            "children": [
              {
                "comment": "I was actually surprised performance wasn't far from my S22 at least in the basic apps I use. Apps open instantaneously. Main drawback really is just the less than average screen resolution. But for my use, I don't mind at all.\n\nI just can't seem to find the official keyboard cover that connects to the pins at the bottom.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "4 years of updates? I’m sorry but I need it to last at least seven years",
        "points": "28 points",
        "children": [
          {
            "comment": "Yep. 4 years is too little for sure",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You guys are updating your OS?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I really wish there was an Android equivalent of an iPad Mini. This just doesn't perform to the same standard, the screen is too wide, and frankly, the app situation still isn't great.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Reading this in my 2017 iPad Pro that still holds up with it's 120hz display.\n\n4 years of updates sounds absolutely 🗑️ for a tablet",
        "points": "23 points",
        "children": [
          {
            "comment": "My IPad from 2013 just died on me. It’s hard to step away from the quality of Apple products.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I'm still using a first gen iPad Pro. I don't even remember when I bought it, like 2015/16? Won't say it isn't dated especially for the Pro moniker, but it still works and mostly does what it needs to do.\n\nI keep waiting for the OLED update the never comes before I upgrade lol.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "How much did you pay for your 2017 ipad pro, how much dos this device cost?",
            "points": "4 points",
            "children": [
              {
                "comment": "Cheap devices that become trash in 4 years is not a win.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Reading this thread makes me think that it's already trash on release",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I agree, but comparing a device with a competitor which is 5x the price hardly makes any sense, especially considering Samsung has a line of good flagship tablets",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Samsung can’t use those excuses, because clearly they are way behind Apple in terms of market share for tablets. If they want to gain market share, they have to offer better things than Apple, and they clearly can’t or don’t want to.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "Sure, but do you believe Samsung should offer better things than Apple flagship offerings on their 5x cheaper entry-level models?\n\nCheap tablets can and should be better but I seriously fail to understand yours or OP's point here",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "iPad 9th gen is like only a hundred dollars more and will last you more than 4 years. Samsung A series is basically manufactured e-waste.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Yes",
                        "points": "-1 points",
                        "children": [
                          {
                            "comment": "Honestly, in a way, based, fuck these companies",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "A $329 regular ipad gets 6-7 years of support.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I still use the regular iPad from 2017. It's running the latest iOS version and performing very well in daily tasks. I'm generally not an Apple fan but I have never understood the appeal of Android tablets. Most aren't even that much cheaper than the base iPad, they are updated for a few years at most and most Android apps still suck on large screens.",
            "points": "0 points",
            "children": [
              {
                "comment": "I’m still using an even older iPad Mini 4 from 2016 that still runs well enough on the daily. It definitely has lost a few steps performance wise but it’s still a solid little tablet. I have had several Android tablets and they’re miserable experiences at best…even if the hardware is good, the lack of tablet native and optimized apps is a killer.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "it's an entry level tablet ($200) at the end of the day, 4years it's ok. I mean it's cheap hardware. You should compare it to an S tablet.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Damn. Seeing this article and its comments, not 2 mins after buying an A9+ makes me sad 😢",
        "points": "9 points",
        "children": [
          {
            "comment": "Re turn it",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I was just going to order mine too.\n\nI don't use my current tablet for much so maybe it will suffice still, just a media consumption device for me and reading tablet",
            "points": "2 points",
            "children": [
              {
                "comment": "It'll probably be absolutely fine tbh.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "It will. My son uses an older A8 and it runs ok. It’s no iPad, but it didn’t cost $400 or $500 either. All he does is watch YouTube and do other social media crap on it anyway along with a few games.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Been considering an android tablet, but ... we bought an iPad 9 years ago and the sucker just keeps on working, even though my daughter has abused it all those years. From this comment section, it doesn't seem like Samsung is there on the Galaxy tablet, does it?",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have the 8/128GB version and it has been great for my use case. I don't think the 4/64GB version is worth it if you want to use it for the four years it's supported for.\n\nOne thing they have stated wrong is the amount of OS updates. It's already confirmed that it will get three OS updates (14, 15 and 16), not two.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "WhT about micro SD card slot",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "How about a user interface that doesn’t look like it was designed in 2013?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I bought the Tab S9 Ultra after my 2020 iPad Pro 12.9\" shit itself while doing an ios update. Not a big Apple fan so no-way was I getting another iPad. The Samsung is fantastic, much more my thing software wise and superbly made.\n\nThe series 9 pads are gorgeous.",
        "points": "2 points",
        "children": [
          {
            "comment": "The s9 line up it's quite good i have an ultra too, loving it!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Droid tablet are just...",
        "points": "-6 points",
        "children": [
          {
            "comment": "More affordable, functional and higher performing than iPads.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "How about more than 4 years of updates so it doesent become ewaste?",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "S6 refresh (2017 edition) here, still works, but only slow charging. I think the charging circuitry has broken, but i just charge it slowly.\n\nBeen looking for a new one, but as long as this one works, i'll keep it. Mainly watch youtube and other streaming services on it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I use my Tab S7+ daily and it works fine but it's not eligible for Android 14...forced obsolescence in a way.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "interesting thing to note from this article that I haven't seen commented here is this is the first A series tablet with Samsung Dex support.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Cries in S7+ 😭",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Leaves me to wish I could use Procreate on that",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "How hard is it to remove facebook, the built in music app, etc?\n\nNot disable or some other BS, but full on remove from the device.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Never bought an A series. How about Huawei tab?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Does it have e-sim?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "leaves little more to wish for\n\nExcept for a smaller 7-8\" version that's better for reading. It sucks that the iPad Mini is basically the only option for a premium 7-8\" tablet, and it's over 2.5 years old at this point with no replacement due any time soon, apparently. I'll never forgive Google for discontinuing the Nexus 7 line, those were basically perfect small tablets. The size was just right for reading and the fact that they were Google products meant you got bone-stock Android without all the crapware the other manufacturers add in. Plus the price was pretty good, as I recall.\n\nAnd yes, I know I can get a dedicated Kindle e-reader, but I want a device that can read books AND do other stuff, the e-ink kindle devices are just for reading that's it and you're also locked into Amazon and Kindle for book content. Then I'd need to carry yet ANOTHER device if I want tablet functionality",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not me wanting to buy a9 a few days ago 💀 it seems if I want a tablet of 8in I'll have to buy an iPad mini.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wish they'd have made it waterproof like the s9. Sucks that the only option for people who want something they can use in the pool is $800",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1augltp",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.theverge.com/2024/2/17/24074150/cocoa-press-3d-printed-chocolate",
    "title": "I printed chocolate on a 3D printer and ate it",
    "points": null,
    "comments": [
      {
        "comment": "That thing definitely tastes like metal",
        "points": "59 points",
        "children": [
          {
            "comment": "They are pretty well engineered to be food safe. It's not coming out of a regular hotend.",
            "points": "36 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Sweet!",
        "points": "9 points",
        "children": [
          {
            "comment": "What does mine say?",
            "points": "16 points",
            "children": [
              {
                "comment": "Dude!",
                "points": "8 points",
                "children": [
                  {
                    "comment": "Idiots! Your tattoo says dude, your tattoo says sweet! Got it?",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "and then?",
                        "points": "5 points",
                        "children": [
                          {
                            "comment": "Don't look up when that movie was released... O.o",
                            "points": "4 points",
                            "children": [
                              {
                                "comment": "And then?",
                                "points": "3 points",
                                "children": [
                                  {
                                    "comment": "No 'and then'!!",
                                    "points": "2 points",
                                    "children": [
                                      {
                                        "comment": "andthen?",
                                        "points": "2 points",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Now this is a technology application I can use!",
        "points": "11 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Would be a waste to use chocolate and not eat it…",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Palm oil is a no and layer lines are a no, but I appreciate how far it has come.",
        "points": "-15 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I guess it's a first effort but those layer lines on everything have got to go or this will never be taken seriously.\n\nEdit: Wait, so obvious layers are good? Hmm, a machine that expensive with those results I guess you have to tell yourself something to make it seem worthwhile.",
        "points": "-18 points",
        "children": [
          {
            "comment": "Couldn’t you just run a heat gun over it to eliminate the lines?",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why not just use a mold",
        "points": "-22 points",
        "children": [
          {
            "comment": "Because molds can't make complex shapes?",
            "points": "14 points",
            "children": [
              {
                "comment": "I'm not against 3D printing chocolate at all but please don't generalize like that... One of many examples that you can mold what many wpuld consider complex shapes: https://youtu.be/e5XKtxXPxuc?si=GUCO_4CWU5pE_RzI And in this example the mold is not even sacrificed. You can mold much more complex geometry if you don't care about reusing the mold.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "the thing with 3d printing is that you don’t need molds..",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "True. Did I ever argue against that? I was just pointing out the misinformation that complex shapes are impossible with molds.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Some shapes would certainly be impossible without 3D printing. I guess it’s just a question of what we call complex",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "I kind of agree. Complex is a very blurry term. There are just some features that can not be created using standard molding techniques but they are not necessarily related to geometrical complexity. A sphere inside another sphere can be 3D printed but not really molded with standard equipment even though it only consists of 2-3 primitive bodies. On the other hand, an object with very complex surface detail and overhangs can be easily molded.\n\nStill, I think there are many examples of molded geometries that most people would say are complex shapes if you asked them. Imho it's a bit of an unfair blanket statement to say that you can't mold complex shapes.",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "They can though, it’s generally more common to 3d print a mold which is why I asked. I also imagine using a mold is more time conserving",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  }
]