[
  {
    "id": "t3_1at0bu0",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.theguardian.com/technology/2024/feb/17/walkman-memories-still-in-love-with-old-tech",
    "title": "‘When you use a Walkman all the memories come back’: the people still in love with old tech",
    "points": null,
    "comments": [
      {
        "comment": "Why such a nightmare photo?",
        "points": "",
        "children": [
          {
            "comment": "It's just retro cable management.",
            "points": "",
            "children": [
              {
                "comment": "I have a kitchen drawer that looks just like that.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Ive been looking for a good cassette player for a while now. Apparently all the new ones use the same less than desirable parts. Soon as spring hits, ill be hitting up some rummage/garage/tag sales for old ones.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I dont think its about “memories” it thinks about the fact that you own what you bought. With physical there is a relief that comes with the fact that your purchase is yours. Additionally when you buy physical its all packages together so you are more likely to listen ti an album cover to cover as the artist intended.",
        "points": "2 points",
        "children": [
          {
            "comment": "Nostalgia is definitely a factor I think.\n\nSame with playing retro consoles on a CRT. Sometimes the experience is improved as well since game sprites were designed for that tech and look better as a result.",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I buy digital and I’ve never felt that my purchase wasn’t mine or that I didn’t own it .",
            "points": "",
            "children": [
              {
                "comment": "Thats what they want you to think. Countless stories over the past few years of people ls digital libraries being completely wiped, with no refunds. Just this past month it happened with peoples Anime libraries with Crunchyroll and Funimation.",
                "points": "",
                "children": [
                  {
                    "comment": "MP3 has enetered the chat. I may be old fashioned, but I still trust it the most. It's why I don't do Spotify and Apple Music bollocks. Only BeatPort and Bandicamp, because I can download and backup what I buy.",
                    "points": "",
                    "children": [
                      {
                        "comment": "Music is different. Even with itunes, I believe you can actually download and store the music. Video and tv are another thing entirely. You are buying things that are locked to a service, that you cannot download and store.",
                        "points": "",
                        "children": [
                          {
                            "comment": "Even Apple Music is stupid with its iTunes app and MP4A AAC format that's not widely supported, so you need to transcode it to MP3 in the end...",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Speaking of MP3. My wife just gave me her old laptop to get rid of. I was making sure there was nothing important on it before I did, and found she had an itunes library with 4,000 songs on it. I need to figure out how to get them off there. The laptop is so old it has no usb.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "But you don’t own it. That’s the point",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Cassettes? If we’re talking about QUALITY of music the order goes cassette, cd, vinyl being the best. So people wanna go back to tapes which have worse quality than even digital. Nah, I like hearing my music without the hiss.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I had a few different versions of the Walkman, they were good devices, but I've never thought about going back to them. I use my phone. I don't miss cassettes, and the radio where I live has only three stations that come decently, and those are all owned by the same company and plagued with ads. Digital music or streaming is so much more manageable.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]