[
  {
    "id": "t3_1auxccz",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1auxccz/creating_a_custom_pdf/",
    "title": "Creating a custom PDF",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1auwylq",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1auwylq/automate_credit_reports_on_my_website/",
    "title": "Automate credit reports on my website",
    "points": null,
    "comments": [
      {
        "comment": "There so much missing info here that it would be impossible to help you. What kind of website is it, simple landing page, e-commerce site, etc? How was it made? Did you hire a developer, or build it yourself? Is it built with a particular framework? Was it made in website builder a squarespace, wix, shopify etc? Do you have a developer or are you capable of doing development? How are you getting the credit reports?\n\nI'll be honest if you don't have someone who can do web dev, you're going to need one, your going to be handling PII and their are lot of security considerations that have to be made, or you risk opening your self to massive legal liability.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1auwyaq",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1auwyaq/which_programming_language_is_the_most_enjoyable/",
    "title": "Which programming language is the most enjoyable to learn and use?",
    "points": null,
    "comments": [
      {
        "comment": "This depends 100% on person and what that person wants to do. If someone wants to learn game dev, they won't find learning HTML so interesting as someone who wants to learn to make websites.",
        "points": "",
        "children": [
          {
            "comment": "HTML is not a programming language",
            "points": "",
            "children": [
              {
                "comment": "oh no, here we go again",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I think if you’re learning and don’t know any language, either python or JavaScript. Python because it’s the most similar modern language to normal English syntax while still having a wide variety of applications. JavaScript because it’s also fairly easy to learn and it opens up so many opportunities in modern web development.\n\nBut if you want to do something specific, you will need to see which languages are used most for that task and learn those.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Modern PHP (8+).\n\nIt has all those features that have made object-oriented programming great: classes, traits, interfaces, visibility of properties...\n\nJust a small example:\n\n<?php\n\ndeclare(strict_types=1);\n\nabstract class View\n{\n    // Properties\n    private readonly string $title;\n    protected string $main;\n\n    // Constructor\n    public function __construct($title)\n    {\n        $this->title = $title;\n    }\n\n    // Final methods\n    final public function html(): string\n    {\n        return <<<HTML\n            <!DOCTYPE html>\n            <html>\n                <head>\n                    <title>$this->title</title>\n                </head>\n                <body>\n                    <header>\n                        <h1>Hello world!</h1>\n                    </header>\n                    <nav>\n                        <a href=\"/\">home</a>\n                    </nav>\n                    <main>$this->main</main>\n                </body>\n            </html>\n        HTML;\n    }\n}\n\n<?php\n\ndeclare(strict_types=1);\nrequire_once 'view.php';\n\nfinal class Home extends View\n{\n    // Constructor\n    public function __construct()\n    {\n        parent::__construct('Home page');\n        $this->main = '<strong>Main page</strong>';\n    }\n}",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ruby is an absolute thing of beauty.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "pleasure to learn: Scheme\n\npleasure to use: Haskell",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I agree with others that there's no right answer. Typescript is great because it doesn't pigeon hole you into a single paradigm so you can write however you want. But I've personally found the most enjoyment in Rust (surprise, surprise, the rumors are true) and then Elixir because I actually like the way they forcibly structure your code.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Golang!!",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1auwuiq",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1auwuiq/1_minute_loading_time_for_manifestjson/",
    "title": ">1 minute loading time for manifest.json",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1auwsw3",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1auwsw3/what_are_some_good_github_repos_to_learn_stuff/",
    "title": "What are some good GitHub repos to learn stuff related to webdev?",
    "points": null,
    "comments": [
      {
        "comment": "That's like asking if there's good material to learn English on the Internet.\n\nWhat exactly are you trying to learn?\n\nI don't think you should learn to be a \"web developer\" either.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1auwdet",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1auwdet/hugo_ssg_is_there_any_simple_alternative/",
    "title": "hugo SSG - is there any simple alternative?",
    "points": null,
    "comments": [
      {
        "comment": "If you only need two pages I think a SSG tool is overkill (unless you expect to add a lot more later). I would just write static HTML/CSS files. As for where to get templates I'm not sure, hopefully someone else will chime in.",
        "points": "0 points",
        "children": [
          {
            "comment": "yes, agree, this👆is the way, I’ve found html5up and codestich.app",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1auunra",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://www.openstatus.dev/blog/monitoring-latency-cf-workers-fly-koyeb-raylway-render",
    "title": "I deployed a basic Hono server on Cloudflare Workers, Fly, Koyeb, Railway, and Render and compared the latency of each platform.",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1auufvr",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1auufvr/naming_personal_site/",
    "title": "Naming personal site",
    "points": null,
    "comments": [
      {
        "comment": "Hyphens are never really desirable as they are easily forgettable.\n\nI'd stick with the name or initials, with another word, and the .tld of your choice/availability.",
        "points": "1 point",
        "children": [
          {
            "comment": "I found samthomas.online was available, is it bad to not stick with a classic?",
            "points": "0 points",
            "children": [
              {
                "comment": "That's a great choice. Go with it and you can always find another one in any case.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I would go for a \".me\" tld if available. Or you could go with samthom.as since \".as\" is also a tld. Just don't go for the hyphens, because they will be forgotten most likely.\n\nThere are lots of options out there. I saw you suggested .online, which would be a great option aswell.",
        "points": "0 points",
        "children": [
          {
            "comment": "I had a look at the .me I could get sthomas.me not sure if it's bad to shorten?",
            "points": "0 points",
            "children": [
              {
                "comment": "I don't see it as an issue. But the most important thing is you being happy with it yourself.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1autbkz",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1autbkz/how_to_organize_the_api_layer_in_react_apps_using/",
    "title": "How to organize the API layer in React apps using React Query",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1auszdt",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1auszdt/how_to_implement_custom_domain_names_for_users/",
    "title": "How to implement custom domain names for users?",
    "points": null,
    "comments": [
      {
        "comment": "Depends on what language and server you are using. I’ve managed to do so (similar to WordPress) by using redirects in Apache and pass the url to a PHP (could be python, etc) script to handle.",
        "points": "1 point",
        "children": [
          {
            "comment": "everything is written is javascript (using remix framework) and hosted on netlify, so all the server code is running in netlify, which uses supabase for database and auth",
            "points": "0 points",
            "children": [
              {
                "comment": "Idk, again, it depends on your server. Unless there’s another way to do it. Look into redirects (you want to redirect any request at url to a single url)",
                "points": "1 point",
                "children": [
                  {
                    "comment": "You should probably go see how netlify works, mate.",
                    "points": "-3 points",
                    "children": [
                      {
                        "comment": "Nope, don’t care. I host my own servers and never have these problems.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You want to edit the _redirects file using this guide:\n\nhttps://docs.netlify.com/routing/redirects/",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ausa6c",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1ausa6c/should_i_do_a_fourth_interview_with_this_company/",
    "title": "Should I do a fourth interview with this company?",
    "points": null,
    "comments": [
      {
        "comment": "They probably had someone else favored but it fell through. If you're interested in the role do the interview and have your concerns ready as talking points. Recruiters generally suck in that once they have the role filled or a candidate isn't viable they ghost everyone else. Consider it a red flag that the company might be disorganized, but it could be circumstantial and have no bearing on actually working for the team/company.\n\nEven companies that are great to work for or teams that are great to work for in meh companies can be disorganized or have shitty processes. I personally would take the interview and hear out the tech lead before burning the bridge.",
        "points": "54 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Unless there wasn’t any technical interview already and/or you’re not hurting for a new job I would walk.\n\nRemember: the interview process is a two way street. Whilst they’re trying to vet you , you are also vetting them",
        "points": "27 points",
        "children": [
          {
            "comment": "I agree, but I say if your given this fourth interview you have a little leverage , what I would do is bluff and say you would be interested but need to schedule it ASAP ,this throws them off , but most importantly gets it's out of the way and tests their real interest. In you",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This is the answer you should be looking for, you yourself should know if the place is for you, if your still not sure take the interview and ask all the questions.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "\"I'm excited to talk to you today, you probably know that this is my fourth round interview with your company and our conversation has been ongoing for over a month now. I'd love to use today as an opportunity to address any remaining questions you have how I can help you with {some problem / challenge they're facing that has come up in previous interviews as the reason for the hire}.\"\n\nControl the interview from the first few seconds. - Put the tech leads in a defensive position that if they reject the candidate, they're rejecting the opinions of all the previous people that interviewed you. Make them change their thinking so this is a go/no-go decision, not a \"well we could probably find someone that....\" discussion.\n\nDo keep in mind that you are not their first option OR they have a serious problem with following through on commitments (e.g. you'll hear back in a couple days). This same problem will exist in many aspects of the business and is something you'll need to continuously guard against (e.g. promotions, raises, vacation approvals, etc.)\n\nYou can however, exploit the fact you have 3 successful interviews already to hopefully steamroll this interview committee.",
        "points": "8 points",
        "children": [
          {
            "comment": "This is great advice.\n\nThey know they fucked up and put you out.\n\nYou know they fucked up and put you out.\n\nYou can be pretty sure they already had a preferred candidate and they didn't want the job, and now they've come back to you cap in hand hoping you're still available.\n\nThey morally owe you, and both sides know it. That can be a surprisingly effective bit of leverage if you take advantage and play it carefully.\n\nAfter all, if you say no what are they going to do? Go further down their list of non-preferred candidates? Start the months-long hiring process all over again and spend tens of thousands more to find, shortlist and interview an entirely new list of candidates\n\nIt's rare to find more than one candidate you're happy to employ for a role - the chance they found three or more for this role is pretty slim.\n\nIf you don't overplay your hand this puts you in quite an advantageous position.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You weren’t their first option. That first option probably quit or got fired.\n\nThey weren’t respectful enough to tell you that you weren’t hired. Big red flag, big no.",
        "points": "22 points",
        "children": [
          {
            "comment": "They weren’t respectful enough to tell you that you weren’t hired.\n\nUnfortunately this is pretty common, I wouldn't take it personally nor take it as a sign in and of itself to say no.",
            "points": "10 points",
            "children": [
              {
                "comment": "Telling people they didn't get something sucks. While annoying and a bit unprofessional, I wouldn't hold it against them too much if everything else seems to check out.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I'm thinking this is the case. But it is almost twice my salary, so I'll probably go through with it whilst gritting my teeth.",
            "points": "14 points",
            "children": [
              {
                "comment": "I ended up doing something similar. I really needed to get another job, and I was ghosted for months. I swore I wouldn't work there, but I ended up doing so since I had to get out of my current situation.\n\nYou have a good attitude, go with it and see what happens.",
                "points": "10 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I wouldn’t overthink it, it might just be a HR hiccup, if you’re going to double your salary, just do one mor3 interview.",
                "points": "8 points",
                "children": [
                  {
                    "comment": "Yeah this feels like a pretty silly thing to be asking. It really sounds like their top pick fell through for whatever reason and while it sucks they didn't get back to you immediately, you wanted to work there enough to go through 3 interviews so what's another 45 minutes of your time to double your salary?",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "almost twice my salary\n\nGo for it.\n\nSounds like the potential cons are worth the concrete pros.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "With that kind of salary bump it's almost a no-brainer to go through with it unless there are other red flags. At minimum you work there for a year and use it to get into another job for even higher salary. Having worked for a few shitty companies, I will say that shitty companies can provide some valuable insights into how things should operate and aren't entirely a waste of your time as a dev. Experience counts in this field, even if that experience is knowing what not to do next time.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Remember to keep an eye out for why their first choice guy didn't want the job.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Are you seriously debating 45 minutes to double your salary?",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Or the first option took another job, don’t get butthurt if you’re not number #1, buy a helmet. either op wants the job enough or not.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This happened to me with a reputable organisation and after talking to and getting on with the tech lead, I was ghosted. Maybe see how it goes but don’t put all your hopes into it",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I swear reddit gives the most whiney entitled advice.\n\nHere's what the question sounds like to adults: \"a company asked to speak with me a 4th time before offering me $100,000 and they were a bit slow to respond - should I tell them to fuck off?\"\n\n​\n\nYour contact there could have had any number of life events, delays, personal or professional interruptions, downtime, illness, etc. Give a little grace and be a professional, even when others aren't being 100% on the ball. They apologized. Move forward.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It would leave a bad taste in my mouth the way they have handled it. It gives you an insight of what working for them might be like...\n\nBUT if you need the work and the pay is good... then go for it.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "WT actual F.\n\nWalk away. If they don't know after 1 or 2 interviews if you are candidate material, then what will working for them be like?\n\nYou've already wasted enough time with 3 interviews and following up. You've dodged a bullet.",
        "points": "-2 points",
        "children": [
          {
            "comment": "Walk away. If they don't know after 1 or 2 interviews if you are candidate material, then what will working for them be like?\n\nI wish this were more common. I had 6 total interviews with Amazon for AWS a few years back. Granted 3 were in one long session.",
            "points": "0 points",
            "children": [
              {
                "comment": "Amazon interviews are a fucking mess.\n\nI interviewed for them years ago, and knew a guy in my hiring loop (ex-colleague) so I got the full story afterwards.\n\nFantastic feedback from everyone in my hiring loop except one guy who was adamant he didn't think I was up to the job.\n\nVery unusually instead of it being a hard pass they offered me a 6-month contractor role to prove myself, with the promise of permanent if I did a good job.\n\nWe got as far as me verbally accepting the role and waiting for the paperwork to come through, when they ghosted me for two weeks.\n\nI had numerous other offers chasing me for confirmation, so I emailed the Amazon recruiter to ask if they could confirm the offer in writing, only for them to withdraw it \"and recommend I pursue one of my other offers\" instead.\n\nTurns out someone in the hurting loop apparently started a rumour I had a permanent role offer from Microsoft, and they didn't think I'd accept a contractor role at Amazon over a perm role at MS, so my Amazon recruiter took it upon himself to make my career decisions for me, and pulled the offer instead of confirming it to me.\n\nThe kicker is I wasn't even interviewing at Microsoft, I wouldn't have worked for them even if they made me an offer, and I was absolutely ready to take a contracting role at Amazon on the team I interviewed for just to work with my ex-colleague again.\n\nI basically burned my bridges and lodged an informal complaint against the recruiter... and then spent about the next five years telling successive waves of salivating Amazon recruiters that I wouldn't ever work for their shitty company under any circumstances, as they'd obviously kept my details and interview notes on file and wouldn't stop cold-calling me to apply for roles on other teams.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Fantastic feedback from everyone in my hiring loop except one guy who was adamant he didn't think I was up to the job.\n\nI wonder if that was the cunt they call the \"bar raiser\" or whatever the fuck it is. Their whole interview tribunal format is a massive fucking waste of time. Having to prove to at least 8 people that you studied the megalomanic cunt CEOs \"leadership principals\" to a T (how hard will you bend over for Bezos) is such an insane waste of time. I'm sorry if after the second interview, you need a recruiting trainer to call you and teach you how to study/prep specifically these principals for the upcoming interview tribunal, it's stupid. But we do it anyway cause of the TC don't we lol.\n\nYou're lucky in that you did get a peek into the inner workings; mine all went great then I was ghosted lol. Honestly seems for the most part they're a shit company to work for regardless of high TC, not worth the slim chance that you get placed on one of the decent teams.\n\nI was looking to lease a house last year and the owner told me he's a senior technical recruiting trainer at Amazon and he'd help me get a job, I said nah mate I'm good.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Hard pass! There should be no need for 3rd and 4th interviews as well as not even contacting you for a month! Just shows the incompetence of the company and I would tell them that",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Did your landlord take that as an excuse when you told him wait a month for rent? You got a fourth interview...\n\nGo in and waste their time like they took you for a cunt 3 times in a row. Plus a month of your time.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hard pass. They aren't respectful to you even as an applicant, imagine as an employee. Their HR are aficionados. I personally ban any recruiters/companies who ghost me after promising coming back to me within X days.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you are at all interested in the job then take it. You might even be able to to play them up into offering you a bit more if you say you've got another interest that developed since you last spoke to them.\n\nMaybe they hired someone else that didn't work. I've been responsible for hiring on my team for a while now and sometimes over the years I've gotten it wrong.\n\nI typically wouldn't need 4 interviews but perhaps someone that previously made a bad hire is trying to cover their ass by letting the boss have a turn.\n\nIt's up to you. Good luck!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Have you not met the actual devs in those first three rounds? In my organization the boss, me as team lead and union people will have a first meeting. Second interview is with the team. That's it. Sometimes a small take home so we can discuss their approach during the second interview.\n\nI'd approach this with a 100% focus on finding out what this situation has to offer you. If it's double your salary as you said it's definitely attractive. So maybe not let your pride get the best of you, but alarms raised for sure.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "ignore it\n\nI was in similar position but it was a company where my friend worked. It was hell for doing anything - meetings, talks, nobody had access to tools without approval etc\n\nthey paid me by hour and part-time so I did others contracts and I forgot about them in one point - lol",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Twice the compensation? Ive had the similar happen then they made a bait & switch offer",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just tell them no. Red flags already.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yeah.. you should not give a damn but you should not let any chance slip by just for the sake of it.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aus1m4",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://github.com/charlax/professional-programming",
    "title": "A collection of learning resources for curious software engineers 👩🏾‍💻",
    "points": null,
    "comments": [
      {
        "comment": "Very useful and in depth. I will definitely take a look at some of the resources. Thanks for sharing!",
        "points": "0 points",
        "children": [
          {
            "comment": "My pleasure.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aurpgs",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://github.com/tmoreton/tailwind-html-template",
    "title": "Tailwind HTML Landing Page Template",
    "points": null,
    "comments": [
      {
        "comment": "Had a quick look in your repo. Looks good, thanks for sharing!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aur6xb",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aur6xb/i_made_a_chatting_app/",
    "title": "I made a chatting app",
    "points": null,
    "comments": [
      {
        "comment": "Stuff like this feeds my imposter syndrome.\n\nGreat job!",
        "points": "11 points",
        "children": [
          {
            "comment": "Bruhh, same but it's also kinda encouraging. I've been coding (with intent) for about 4 months, I actually tried starting about a year ago but all I did was read a book and got too busy to practice.\n\nSince I \"started\" a year ago, I feel like my progress is so slow. Currently learning, react, basic node.js and express",
            "points": "1 point",
            "children": [
              {
                "comment": "If it makes you feel better ive been doing this stuff for around 7 years and it would be difficult for me to make something this clean.\n\nMy css and animations always need work lol.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Honestly, this gives me hope, lol. Do you ever have anxiety while coding?\n\nLet's say I wanna style a page, I can imagine it and what I need to do but then I end up having breathing issues when working, even with JavaScript, actually html too, lol.\n\nI have to take breaks which slows me down and I still haven't found a way to circumvent this issue because it happens multiple times, so I figured I'll ask devs now.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I feel that.\n\nUsually it helps if I write my thoughts down before coding anything.\n\nBreaking stuff up into smaller pieces and getting that sense of accomplishment for each piece does a lot to reduce that kind of overwhelming anxiety.\n\nAs a bonus that process tends to make your code more modular too (;",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Yeah, you're right. I write down these days and whenever I check a feature of the list I feel really good. The anxiety still happens but it's better than before.\n\nThank you for this",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "I have to take breaks which slows me down and I still haven't found a way to circumvent this issue because it happens multiple times, so I figured I'll ask devs now.\n\nThat is very weird. What's the cause of that in your opinion? Asking seriously.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I've started learning frontend a few weeks ago with no prior experience with programming and I - too - find this very encouraging!\n\nThe journey has been so fun so far, mostly studying c++ and making fun projects on FreeCodeCamp with HTML and CSS, I'll be starting JavaScript very soon too.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "The ability to build something and see it function seamlessly or almost seamlessly is so exciting.\n\nYou've got this, it'll get way more fun. Also you could check out odin project. I'm not a fan of freecodecamp, so sometimes I recommend this platform",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I've heard of the Odin project several times before, How does it differ from FreeCodeCamp? And why aren't you a fan? I'm very curious",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Odin project gives you freedom. With freecodecamp, I remember trying it and I had to do things the exact way they want so I could progress to the next lesson but with Odin, they embrace the whole \"there are multiple ways to solve one thing\".\n\nMaybe freecodecamp is different now or I remember it wrongly but that was a no for me",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "That sounds about right, from what I hear it looks like Odin would be more fun, I'll definitely check it out",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Lmao thank you!\n\nBelieve me i made the app and when i look at the finished product as a whole i get imposter syndrome too 🤣 i have to remind myself that developement is a step by step process",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I like the design!, may I ask how long you've been a dev for? and how long it took you to complete this project? (Beginner here trying to get a scope of things)",
        "points": "6 points",
        "children": [
          {
            "comment": "Hey thank you! Its been around a year and 8 months since i started learning frontend, and 5 months since i started learning backend development\n\nI know it may seem impossible to do projects like this when you're first starting because thats how i used to feel. But just start from the basics, work you way up little by little and always make your next project a bit more challenging than the last, and you'll be there in no time.",
            "points": "6 points",
            "children": [
              {
                "comment": "I definitely expected more than 2 years, this is very encouraging!\n\nHow long did it take you to build this? and how many developers if it's not just you?",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Yeah you can do it bro\n\nIts just me and it took me like 2 months to finish",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Just keep on building projects (from small to bigger in complexity), focus on learning while building instead of learning then building and you'll build great stuff in no time.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You want the password and confirm password on the same page, so you don't get prompted to remember it by the browser if you entered it incorrectly",
        "points": "1 point",
        "children": [
          {
            "comment": "Fair enough",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Solid so far!",
        "points": "0 points",
        "children": [
          {
            "comment": "Thank you!",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Hash your passwords",
        "points": "-3 points",
        "children": [
          {
            "comment": "All the passwords are hashed before they're saved in the database, and the messages are encrypted too",
            "points": "3 points",
            "children": [
              {
                "comment": "All the passwords are hashed before they're saved in the database, and the messages are encrypted too\n\nclient-side hashing is highly recommended. All it takes is one malicious browser extension to suck up credentials",
                "points": "-18 points",
                "children": [
                  {
                    "comment": "Couldn’t a malicious extension just look for the username and password fields, pop an event listener on them and grab the data that way?",
                    "points": "13 points",
                    "children": [
                      {
                        "comment": "Yeah, that's fair. Would probably need to look into something like WebAuthn to really stamp out that risk. But I'd still recommend client-side hashing, along with salting on the backend (if you don't want to use an external service provider like Auth0). This will reduce the attack surface as your app's complexity builds. For instance, you might run into a scenario where you are unknowingly logging plaintext credentials on the backend pre-hashing. Hashed credentials also removes the dependency on the transport layer. In my experience, as a startup grows things can and will go wrong, so you might as well do yourself the favor of putting up safeguards as you build.",
                        "points": "-4 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Ahh i see, thank you!",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Hey, which browser are you using?",
            "points": "0 points",
            "children": [
              {
                "comment": "Arc (highly recommend)",
                "points": "0 points",
                "children": [
                  {
                    "comment": "I love the minimalistic design! any reasons you recommend it aside from maybe ease of use, probably being lighter than chrome and aesthetics?",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why google sign in is not implemented? Edit:I didn't ment to be mean, I just wanted to know if OP has considered this, and I thought he just didn't want to implement it.",
        "points": "-12 points",
        "children": [
          {
            "comment": "Nitpick dick",
            "points": "5 points",
            "children": [
              {
                "comment": "I did not ment it in a negative way. I just wondered if there was genuine reason to not implement it. Sometimes people e.g. want to avoid social networks. I have implemented it to my site and it was relatively easy. So I wanted to suggest that implementing it will help the app to get more users, if there is not a clear decision not to implement it.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I need to learn how to do it first but its definitely something i wanna implement in another project",
            "points": "1 point",
            "children": [
              {
                "comment": "Google explanations are absolute garbage. Good luck lol, I tried it yesterday and I was like fuck this shit, gonna work on something else.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Nice work",
        "points": "0 points",
        "children": [
          {
            "comment": "Appreciate it!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Very motivating. Building something like this is gonna be good practice! Thanks for sharing :)",
        "points": "0 points",
        "children": [
          {
            "comment": "Thank you very much!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Sending messages really takes time and there seems to be a interruption in the 'typing' indicator. There is probably an issue related to the server.\n\nEdit:\nProblem solved. It causes problems when using two different accounts in the same browser.",
        "points": "-1 points",
        "children": [
          {
            "comment": "The typing indicator stops 3s after the users stops typing too, could it be that ?\n\nAs for the messages, it should be instant because im updating the cache before making an api request so you can see the message immediately, unless there are no messages in the room yet, then you have to wait until the api request is resolved\n\nCan you expand on what you mean ?",
            "points": "0 points",
            "children": [
              {
                "comment": "I think he means typing is delayed. It seems to be a bit slow and takes some moments for the input to display what was typed.\n\nIf not, that's at least an issue I see",
                "points": "",
                "children": [
                  {
                    "comment": "Ohh i thought that was just my phone 😭 but its just typing, what could cause the slowness ?",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Are you storing messages in a database?",
        "points": "0 points",
        "children": [
          {
            "comment": "Yeah i am",
            "points": "0 points",
            "children": [
              {
                "comment": "Hmm do you not need a privacy policy, and GDPR compliance? I can put personally identifiable information in there right. Seems problematic? I'm asking for myself as well, since I'm building an app where users can also send messages.",
                "points": "",
                "children": [
                  {
                    "comment": "Im not sure honestly but i am encrypting the messages if that matters",
                    "points": "",
                    "children": [
                      {
                        "comment": "Yea probably doesn't matter since you're not making any money off of it",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Souce code, i am a student so would help me study it",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Does it use ai tools for nsfw image detection ?",
        "points": "",
        "children": [
          {
            "comment": "Its an api called sightengine yes",
            "points": "",
            "children": [
              {
                "comment": "Very inspiring, thanks for the reply and amazing work",
                "points": "",
                "children": [
                  {
                    "comment": "Thank you very much!",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "For your question: Only fetch the last 10 messages or something and Lazy Load the others. But i dont understand, why you have to fetch them? Because you dont know how many Messages are new?",
        "points": "",
        "children": [
          {
            "comment": "It just seemed like the logical and straightforward thing to do\n\nLike at first i fetch all the room messages, and if someone sends a new message i invalidate the original fetch so that the user sees the new messages\n\nBut i can see its slowing everything down a lot",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aup8u4",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aup8u4/creating_a_data_structures_and_algorithm/",
    "title": "Creating a data structures and algorithm visualization page with React and C++?",
    "points": null,
    "comments": [
      {
        "comment": "C++ be used to make a webserver. Unless you need animations just serve HTML and CSS.",
        "points": "2 points",
        "children": [
          {
            "comment": "Thank you for the response! Did some research on making a webserver with C++, it seems a bit hard but now I want to try that too haha. I'll probably compare which one would be faster between this and the solution given by igorski. Thank you so much!",
            "points": "0 points",
            "children": [
              {
                "comment": "If you want interactivity his will be easier. If you don’t mine will be.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Ah that narrowed it down then. Yeah I want interactivity for input etc… thank you :D",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "C++ code can run in a browser using a tool like emscripten which will compile it to Web Assembly (WASM).\n\nNow the question is: what will the C++ part do ? You mention you want to create popular data structures and algorithms. Is the C++ code going to parse heavy datasets to provide a result for React to render visually ? If so, WASM can do that for you. You can also use WebGL in the browser to crunch the numbers, but the GLSL language for writing the shader is not quite the same as pure C.\n\nBUT\n\nJust because you can do a thing doesn't mean it's the best solution. If your intent is to actually integrate a C++ program with React as a proof of concept or exercise, then by all means go ahead as it's a great use case.\n\nBut as far as practical use cases go, you can achieve the same result using plain JavaScript with React. At the end of the day, keeping your application within a single technology stack will provide easier maintenance and less barrier to entry when onboarding new people, which makes the considering when creating a production grade app different.",
        "points": "1 point",
        "children": [
          {
            "comment": "Thank you for the response! My idea is that the logic of lets say stacks, BFS, etc.. is written in C++ and then I would want to display that in the page (I input the number and it visualizes BFS), this isn't for something practical and Javascript and other languages would definitely make it easier to build but I'm just trying to learn both of these technologies and my curiosity wants to combine them haha. Even if is more effort than is worth I'm doing it for practice/learning so I don't mind\n\nThank you for mentioning emscripten and web assembly. A quick search of those online and found a bunch of different resources. THANK YOU.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aup5cx",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aup5cx/are_there_good_free_hosting_solutions_for/",
    "title": "Are there (good) free hosting solutions for WordPress like there are for static websites?",
    "points": null,
    "comments": [
      {
        "comment": "https://wordpress.org/hosting/",
        "points": "1 point",
        "children": [
          {
            "comment": "What are you, some kind of wizard?",
            "points": "0 points",
            "children": [
              {
                "comment": "Right? I surprise even myself sometimes with my wizardry google-fu skillz! Fer shizzle!",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "WPEngine is my favorite. It costs more but the customer support and daily automated backups make it worth it for me. Their process also makes everything so easy.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I recently discovered https://spartanhost.org/webhosting\n\nI must say that haven't tried WP, but other PHP applications, and it seems very good (thanks to Litespeed servers I think).\n\nPlans start from 1.99$ per month (even less if you pay 1 year in advance) with no surprise at renewal.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1auoxd9",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1auoxd9/is_css_documented_fully_on_mdn/",
    "title": "Is CSS documented fully on MDN?",
    "points": null,
    "comments": [
      {
        "comment": "That depends upon what you mean by “documented fully”. If you want a complete, authoritative reference, then look at the CSS specifications instead of a third-party website. But that describes how CSS is supposed to work, so you need to supplement it with things like Can I Use… to determine browser support, etc.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you mean the parts you ought to be using, yeah pretty much. If you mean every weird browser quirk or vendored extension, no",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Like this?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1auouu0",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://www.reddit.com/gallery/1auouu0",
    "title": "Adding singletons to my Sanity dashboard, but 'deskTool' is deprecated.ts(6385). What do I do? It still works, but I'm worried about it working in the future.",
    "points": null,
    "comments": [
      {
        "comment": "You could read the deprecation notice on their help page and follow the steps. Luckily, it seems as a quite minimal change.\n\nBut for future cases, you can consider locking the versions of your dependencies, allowing you to keep using a library until you have time to update / migrate your code (as long as there are no other concerns with pinning the version, for instance related to security or losing out on new features).",
        "points": "1 point",
        "children": [
          {
            "comment": "Great, thank you very much",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It's not deprecated so much as renamed",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1auno81",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1auno81/google_authentication_backend/",
    "title": "Google authentication backend",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1aundwm",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aundwm/building_an_interactive_data_visualization/",
    "title": "Building an interactive data visualization website, but lost",
    "points": null,
    "comments": [
      {
        "comment": "You should look into your heart",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You really need to break this down into more manageable pieces.\n\nI see a few immediate, foundational elements that you need to work on. These are:\n\nBackend / Server - Learn what this means, how to setup and use. Pay for a hosting account and spend time learning how to use it. I personally prefer Debian as the operating system, Apache and MariaDB are solid and fairly standard for the web server and database, and PHP as the programming language. You say you know Python, which is a great choice for data driven applications, so you could build with PHP and interface with Python scripts.\nFrontend & Backend - Learn the relationship here and where to split the responsibilities to provide a usable and performant platform. Don't rely on only one side. This will involve learning how status codes work, how to use Javascript and server API's. How to use CSS in combination with generated images. All of this can be broken down into smaller chunks to tackle in turn.\nData - What kind of data? What kind of charts, exactly? What is your goal here for the end user? Are you going to store any of the data long term? How big will these files and generated graphics end up being? Are you going to translate this data into some baseline, and store that in your database as well?\n\nIf you can answer all of these questions, you should have a good foundation to write a minimal viable product. I would suggest you learn enough of all of these disciplines to build a test example. Start with a very basic and minmal example data set, learn how to process a file upload, convert the file to your data, use that data to make a chart (after figuring out imagemagick and php libraries), then serve that into a test page.\n\nOnce you've seen the entire end-to-end flow work once, you can iterate on it in time. You can make it prettier. You can make it faster. And so on.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aun3u0",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aun3u0/which_ai_tool_would_you_purchase_if_you_could/",
    "title": "Which AI tool would you purchase if you could only purchase one?",
    "points": null,
    "comments": [
      {
        "comment": "None. I've yet to discover anything they can do for me that'd be worth paying for.",
        "points": "8 points",
        "children": [
          {
            "comment": "I have developer access to GPT-4 playground, and I pay only for the usage I use, $1-2 per month for asking it random questions now and then. Totally worth it to me.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "congratulations",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I was paying for GPT4 for some time, at some point I found myself asking the 3.5 turbo model because i wanted it to work faster and my questions were stupid. In most instances the question was super basic, like whats the tailwind equivalent for (insert-css) that i dont want to google, or *using this as a template generate from this set... Now i still use the 3.5 only but i stopped paying. Bard, Gemini and Bing all do adequate work for me for free",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Since I'm currently paying for JetBrains AI Assistant and I found none of the others useful at all, I guess that one.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The problem I have currently is that it is so hard to actually try the \"advanced\" model for free. I will not pay money for something that I HOPE is much better than the free model for my use case.",
        "points": "0 points",
        "children": [
          {
            "comment": "Github copilot is free for a month though. It's really something.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Just chose Other so I can see the results",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Neither. They are all useless. I don't get how people get 10x more efficient using them.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aumzm1",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aumzm1/chromium_browsers_have_a_problem_fetching_json/",
    "title": "Chromium browsers have a problem fetching JSON from a specific website",
    "points": null,
    "comments": [
      {
        "comment": "My first instinct is that this is related to CORS / Same-Origin Policy.\n\nDo you have a more detailed error message?\n\nI would also note that it's not normally good practice to make API calls to third parties using your API key directly from the frontend. Usually you would create a proxy in your backend that makes the API call, and your frontend would call that. This both masks your API key and avoids cross-origin issues.",
        "points": "52 points",
        "children": [
          {
            "comment": "I think OP is doing this in a bit of a strange way, they are making a request to the API without specifying an IP so it's just geolocating the IP the request is made from.\n\nThis means it has to be done client side otherwise it just geolocates the IP of the server.\n\nIt would be better to do all this server side though, grabbing the user's IP and then passing that to the API for geolocation.",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This makes sense.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Could you instead just use this built in js interface?\n\nhttps://developer.mozilla.org/en-US/docs/Web/API/Geolocation/getCurrentPosition",
        "points": "11 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Probably related to Brave's privacy blocking stuff. Turn the Lion off on the URL bar",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "blocked by client normally means adblock is blocking the request, or CORS/CSP.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Do you have any ad blockers/extensions enabled on some browsers that might block those requests?",
        "points": "6 points",
        "children": [
          {
            "comment": "I have AdGuard and uBlock in chromium browsers and Firefox, and AdGuard app on iOS",
            "points": "-1 points",
            "children": [
              {
                "comment": "Try disabling them",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "See this SO answer for possible fix. I'm guessing that the browsers may be blocking the request because it tracks the user's location.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Do you get a response code or any other details?\n\nIf you’re using vscode tunnels to run it in safari for iOS it could be that location is blocked by the browser settings.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Those errors come from ad blocking browser extensions.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aumype",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://shubhamjain.co/2024/02/19/css-impossible-thats-okay/",
    "title": "CSS is Impossible and That's Okay",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1aumswq",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aumswq/screenrecording/",
    "title": "Screenrecording",
    "points": null,
    "comments": [
      {
        "comment": "OBS",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I haven’t used it personally but UserSnap does that.",
        "points": "1 point",
        "children": [
          {
            "comment": "They marketing a lot on reddit including the comment on this post . I am not sure how they actually are- but let me try.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Getting clients to send in screen recordings is so much easier to understand the issue, I recommend Usersnap https://usersnap.com/ which can be added to your website as a widget so clients can take screen recordings whenever they see something worth reporting.\n\nThe best thing about Usersnap is that the browser info, js errors, metadata are captured too, and you can collaborate/reply/tag your clients when you are working on or have fixed the problem!",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Usually I find screen recordings to be unnecessary. Written steps to reproduce are much easier to read and skim over (as applicable) instead of having to watch a lengthy recording. It's also annoying when people add a voice over because its never brief. I'm sure most of these reporters are just trying to be helpful, but it takes time. It does have merits though, for instance when the issue relates to a graphical glitch.\n\nedit The above speaking from the perspective of devs and QA's as I got OP's question was mostly about sharing findings from within the company.\n\nBut to your question on software:\n\nMac users can just use Quicktime Player (it has a screen recording feature in the File menu), or just hit Cmd + Shift + 5. Most ticketing systems (e.g. JIRA) will compress the resulting file for you nice enough.\n\nYou can also use third party screen recorder apps, some of which are available directly as a browser plugin, like Loom, Monosnap or Kap.",
        "points": "-4 points",
        "children": [
          {
            "comment": "Asking a laymen to write out steps leaves too much room for error in describing the process. Better to just watch it play out . I've got a mute button on my audio player if they try to narrate. If it's a long video and a contract job, that is time you get to bill back to the client. You can burry a bug in the Lord of the Rings extended trilogy edition for all I care, I'll watch the entire thing and then bill accordingly.",
            "points": "3 points",
            "children": [
              {
                "comment": "100%. Users are incredibly unreliable in their description",
                "points": "0 points",
                "children": [
                  {
                    "comment": "The first question OP asked was \"Do you guys ever provide screen-recording of bug which you are facing?\" to be followed by \"my devs are facing issues with replicating bugs which clients AND qa team is facing\". So this includes a lot of tech savvy people and not just clients.\n\nAs a dev I am able to phrase the steps to reproduce accordingly. If this company works on a single product it's even more likely every employee on an engineering team has the knowledge of how it should work.\n\nArguably you shouldn't underestimate that asking a client to install a piece of software can be taxing as well. If you have a simple one pager on how to file a bug report it's remarkable how much better users can phrase their descriptions.",
                    "points": "-2 points",
                    "children": [
                      {
                        "comment": "If you’re asking your clients to install anything you’re doing it wrong. Also, unless this is coming from QA, you’re not asking devs/technical people. You’re asking end-users.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Some bugs are hard to articulate. Or they just don’t make sense without visualization. And occasionally the screenshot/video includes a hint as to what the issue is that otherwise wouldn’t have provided in the description.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I agree with this i guess. Irrespective of it coming from other dev/QA/ client . I think videos gives better visualization of what exactly is going wrong.\n\nI also understand @igorski’s point of view- but GenZ developers have very less reading ability, my developers sde1-2 definitely don’t read all the docs and end up asking for short call or screenshots.\n\nIts just how new gen of developers are",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yeah absolutely! (I'm on Windows 11) I use LICEcap for recording small .GIF's, extremely quick and easy to use, makes it super easy to record a selection of the screen. Quality isn't the best though, no controls obviously and nobody wants to look at a very long gif so if I want .mp4 instead I'll use the snipping tool.\n\nWindows also has the game bar, Windows key + Alt + R starts the recording, probably the simplest way.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "https://screenrec.com/\n\nIs free and uploads automatically online.\n\nIf you register (always free) they give you 1GB of online storage.\n\nIf you look for something more advanced and don't mind paying for it: https://screentovideo.com/ or https://www.bandicam.com/",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you are on windows 10 or 11 you can tap the windows key plus G to open up gaming options and on there is a screen recorder. That does capture the whole screen though.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Another good option is marker.io. The only action required is that the user report a bug. Screen recording is always happening via a few-minute buffer. The tool is added to your site via a code snippet.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Marker.io!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "MacOS has seen recording built in. Linux has a gazillion options. I'm sure somebody in Windows land has figured out.\n\nYes, screen recordings are very helpful",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "On MacOS, you can open QuickTime and then you can do sectional or full screen recordings from the file menu",
        "points": "0 points",
        "children": [
          {
            "comment": "Just press Cmd shift 5 to open the screen recording features",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yes I heavily utilize the screen recording feature for posting to tickets and PRs, it comes natively on Mac.\n\nNot sure if the sniping tool of Windows can do it",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In our team we use JAM. It captures all the information including network/console logs while you're recording, which is really helpful for debugging",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I was tired of getting Jira tickets from QAs without needed information so I made https://www.pageshare.dev/ .\n\nIt's for internal purposes only though but they can just pin what's wrong and all details are there including full website copy.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aumm63",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aumm63/jest_unit_tests_failing_cant_extend_class_base/",
    "title": "Jest unit tests failing, can't extend class, base class undefined, circular depencies?",
    "points": null,
    "comments": [
      {
        "comment": "Yeah, circular dependencies will leave you with a lot of gremlins in your code. Try and reorganize your file structure, split files up as much as possible, and try to avoid barrel files. Also maybe try using ESM instead of CJS if you aren’t already, sometimes that helps",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aumb1n",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aumb1n/best_portfolio_sites_you_have_ever_seen/",
    "title": "Best portfolio sites you have ever seen",
    "points": null,
    "comments": [
      {
        "comment": "Bruno Simon",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aumat8",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aumat8/easy_to_use_and_cheap_cloud_server_with_high_ram/",
    "title": "Easy to use and cheap cloud server with high RAM for a frontend dev",
    "points": null,
    "comments": [
      {
        "comment": "I know that bare metal is the cheapest, and then AWS, Google Cloud, Azure etc.\n\nBare metal is almost always the most expensive option at a cloud provider as they cannot split provision the hardware.\n\nThinking of Linode but I need to learn some stuff obviously.\n\nLinode is happy to give you a VM and is one of the better known providers. Do you actually need a whole VM though? https://cloud.google.com/run/\n\nWhat would you do? What cloud provider do you suggest?\n\nI don't think we have enough detail about the project but I'd probably find a way to do whatever it is without puppeteer if at all possible and either host at home or a much smaller service. You might be surprised at the cost of cloud for a hobby project which is what this sounds like.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aum2um",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://forms.gle/DDDkyg8w28NJxVae7",
    "title": "Research API/DAPI marketplace",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1aul6h8",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aul6h8/how_do_i_accurately_convert_pixels_to_vh_or/",
    "title": "How do I accurately convert pixels to VH or percentages of a container FROM a Figma design?",
    "points": null,
    "comments": [
      {
        "comment": "It’s hard to help without seeing what you want to achieve but for example: If you want a container to sit in the middle and have a width of 1000px on desktop then you can set this up for 100vw width and max-width of 1000px. You can use flex on parent container and margin: 0 auto; on the inner element.\n\nIMHO it’s incorrect to try to replicate 1:1 static design into responsive web and it’s simply due to the different nature of both. If you want to maximise the consistency you should use a grid approach from web in your designs to make it easier to transfer.\n\nTry thinking about designing elements as blocks that are nested in each other. Use flex and grid as well as max-width for a better control. You can also go with a grid setting volume to something like: 1fr repeat(12, calc(1000px/12)) 1fr.\n\nPs. Might have mistyped something as writing from my phone.",
        "points": "1 point",
        "children": [
          {
            "comment": "Thanks!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I tend to ask the designer to tell me these things. This is also a dialogue: some designers don't know why they made certain choices, just that it looked good. Other times they had a very specific effect in mind.\n\nIf this is within a company, make sure that the pm budgets time for both developers and designers to have these sort of powwows.\n\nDocument the results so that you do not have to work from memory when the client comes with the same questions.",
        "points": "0 points",
        "children": [
          {
            "comment": "Interesting",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why would you be doing that? Viewport can be different sizes and won't match a static figma file. What are you trying to use vh for? Images? Containers? If I have a super wide monitor the design would look completely different than on a mobile phone.",
        "points": "0 points",
        "children": [
          {
            "comment": "Why would you be doing that? Viewport can be different sizes and won't match a static figma file. What are you trying to use vh for? Images? Containers? If I have a super wide monitor the design would look completely different than on a mobile phone.\n\nI was trying to get it to look consistent across small and wide desktop screens.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aukews",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aukews/good_way_to_store_files_that_are_changed/",
    "title": "Good way to store files that are changed frequently on the backend?",
    "points": null,
    "comments": [
      {
        "comment": "File storage should be done by something that handles file storage... Your webserver ain't it. If you have access to a cloud, use something like s3 or any bucket storage.\n\nOtherwise you will need to use whatever redundant network storage you have access to. As for diffs, this can be done any number of ways and you may find it hard to find something that supports your exact set up. It might be best to pass the diff off to a service via a queue (or just a http call depending on perf and how you wish to scale) that can take that diff, download the file, update it and reupload (note, this could have bad consequences if multiple different diff happen simultaneously for the same file.\n\nGoing off that, modify your solution. Maybe you will find you can chunk your file to smaller parts, meaning you no longer need to send diffs but whole parts (decreasing simultaneous access issues to one larger file).",
        "points": "6 points",
        "children": [
          {
            "comment": "The idea behind sending diffs was to reduce the network usage. If the patching process has to download the file and then apply it, then there is no benefit to sending a diff. Your idea of making several chunks of a file and then replacing the chunk rather than using a diff sounds like a good idea. Though this will require re construction of the file when a client wants to update its copy and asks for a diff.\n\nAny idea on how products like grammarly deal with files and modifying them frequently? Thanks for the response.",
            "points": "0 points",
            "children": [
              {
                "comment": "If you are talking about Word doc style apps, doc size is likely less of an issue, due to text being relatively small in size generally. But if you want to do this. You could switch to a db and store diffs and a time stamp. To retrieve the file. You would grab diffs in order and replay them in memory.\n\nOn save (or whatever interval) you could flush the db of those records and then store as a single entry in the db or to a file storage.\n\nAs for how diffs would work client side/API level , honestly no idea. I would assume there is a library someone smarter than me has made and would just work with that.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Sorry, but why are you doing this in this manner? Are you not allowed to read the file content?\n\nWithout knowing anything else, I'd ask why you're not parsing the file into a database and serving processes from there? Dealing in files is a bit of a strange use case unless you're literally dealing in documents, in which case it sounds like your client just needs to use a back up service.",
        "points": "1 point",
        "children": [
          {
            "comment": "I want my backend to serve as a file synchronisation service and also provide backups. I dont think I understand how storing the file in a database is going to help? Can you elaborate more on this?",
            "points": "0 points",
            "children": [
              {
                "comment": "Is this an academic exercise? Use Google drive, Duplicati or whatever if not.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Its just a project I want to make for the purposes of learning. I am not keen on using this or convincing people to use it. Its a learning exercise.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Thank you, that makes a lot more sense. You might read up on distributed file systems to start learning a bit there, but in general, you don't want to deal with maintenance and overhead that you can avoid.\n\nAs others have mentioned, S3 works great and is relatively cheap depending on what you're doing.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Depends on what you're using, but I think the common go-to is to throw that stuff in an S3 bucket or equivalent remote storage option. There is also Minio, but that tends to be more pricey. Digital Ocean has buckets for $5/m. The uploading of the file with the client and sending that to the server is not that big of a deal to my knowledge.\n\nI personally use Laravel with a polymorphic files table. All models have a singular or plural form of the relationship if they deal with files at all, (profile pictures, cover photos, documents, signatures, reports, invoices, etc), and then the files table points it to my S3 bucket by saving the actual generated path to the file.\n\nI then added an url attribute to my file model so it generates or uses a temporary link for 7 days every time someone accesses the file. In our experience, the 7 day timer worked well enough for people to share their documents with coworkers, etc. Then, if they reaccess the file on day 8, or a different person in their organization accesses the file, it just generates a new url for it. S3 also has selective file versioning options you can enable too.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not super experienced so might not be the best solution, but you could look at using something like AWS EFS. Editing files would probably be easier than downloading files from an s3 bucket, editing and then reuploading them. EFS is a little more expensive though so If files aren't touched in a while, you could look at moving them to an s3 bucket for cheaper storage.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aukaky",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aukaky/been_given_a_training_budget_from_employer/",
    "title": "Been Given a Training Budget from Employer - Considering most development resources can be accessed for free online, what are some good ideas for what I can use this allowance for?",
    "points": null,
    "comments": [
      {
        "comment": "Are there career paths available to you within or without your company that require some sort of certification?\n\nHave there been subjects where you had to drop the self-study because only paid courses sufficed?\n\nI find that with self-study I follow a very narrow, deep path that only touches on things I am genuinely interested in: the advantages of conferences and such is that you get exposed to other interesting topics that you might not have thought to explore by yourself.",
        "points": "3 points",
        "children": [
          {
            "comment": "Yep, certify. I'd look for something outside my normal day to day to do.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "A masterchef class.",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Neetcode, frontend masters and gitkraken",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Pluralsight, imho the best online training site. Think it is about $300 per year for unlimited.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I tend to use this budget for books. Yes, you'll never hit the cap, but books are highly distilled sources of information that cover the rest of the iceberg that free material only touches.\n\nTechnology books are often of limited use to begin with and outdated quickly, so I focus instead on ones about broader topics. These are some of those: https://github.com/xiongchiamiov/booklist",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aujsaf",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aujsaf/what_website_is_for_designers/",
    "title": "What website is for designers?",
    "points": null,
    "comments": [
      {
        "comment": "I'm assuming you are talking about a marketplace like Envato, where you can find various assets including website / page templates, both coded in html / css / js, and PSD / sketch files.\n\nOtherwise, these days there are more and more UI kits, some (partially) free, with paid extras & all sorts of assets. Just a google search away.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Try Dribbble",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aujrit",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aujrit/whats_the_simplest_method_to_set_up_a_timelimited/",
    "title": "What's the simplest method to set up a time-limited paywall leading to a page exclusively visible to paying users for 72 hours?",
    "points": null,
    "comments": [
      {
        "comment": "I don’t know of any out of the box systems that will handle this but there are a few ways to do this..\n\n1 way that comes to mind is to generate a signed JWT token and add it as a query in the url. This way when a user clicks your link, your backend will verify the token is legit, and not expired. If those 2 cases are true, then video is served. You can change the duration of the token to 72hours in your case.\n\nYou would only send them this email with the token in the URL after they have paid.\n\nI don’t know that this necessarily the best way, but I think if you’re not going to use accounts, then you’re relying on data be stored in the URL in some way. Another way could be an encrypted string of query params stored as args..",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Standard landing page with watch now button that links to the payment page. Payment call back generates the url, sends it via email, redirects browser to page.\n\nThat page should check the url, pulling out the url parameter that is unique to the verified payment, and evaluate it.\n\nIf it’s active, return the video.\n\nIf it’s expired / not real, return some redirection to the landing page.\n\nThis would require you to have some kind of database recording payments and customer info and associating it with the unique url string.\n\nIf you don’t want a database, jwt is probs the way to go.\n\nIt does seem like a rather interesting business model though.\n\nNot sure many people would be happy with paying for something that disappears in three days.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aujnv8",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://piotrminkowski.com/2024/02/19/spring-boot-ssl-hot-reload-on-kubernetes/",
    "title": "Spring Boot SSL Hot Reload on Kubernetes - Piotr's TechBlog",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1auj7ml",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1auj7ml/stuck_in_cms_picking_loop_help_with_options/",
    "title": "Stuck in CMS picking loop, help with options",
    "points": null,
    "comments": [
      {
        "comment": "Statamic.com is definitely worth taking a look. Can run without database (flat file), and can also run headless or as static site generator. Its built on Laravel, so very easy if you ever need to extend or add some custom functionality.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The one instance where a junior dev is right on the money. Sounds like the seniors want to overcomplicate it. Sage is the best modern solution to doing WordPress right.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I work for an Agency as well as a Full Stack developer. We build all our sites now with Contentful whereas before it was all WordPress. There are some pay walls but everyone on our team preferred it. I wouldn’t recommend using Contentful unless you have a bigger scope/project though. If it’s a relatively small site WordPress will likely be the superior option.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "+1  the full roots stack with ACF. It's pretty powerful. It's taken us quite a while to get our starter theme to where it needs to be. We like WP because easy for customers to pick up.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'd argue *one size fits all* is pretty hard (and is why so many chose WordPress). WordPress remains the most common CMS by some margin - so it will depend on the likely market you'll be targeting. Headless could help differentiate your agency but it is not appropriate for *many businesses*. Part of your call is assessing how big you think Headless is likely to become and whether getting in relatively early makes sense. Headless sites are a little more complex and thus expensive, so your local markets appetite to spend will be key. It's like buying a new car - the price brackets can vary considerably. If your main audience is likely to be local / small businesses then WordPress / Squarespace / Wix can all work. If you want to offer more bespoke solutions for less budget constrained businesses then looking at Headless makes sense. However, it is a more sophisticated approach so it is preferable if these clients have front end devs in their companies / businesses (or you agree a retainer) to manage downstream issues.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wordpress with roots.io (IMHO it's the only proper way of doing wordpress development).",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As someone who doesnt know shit, I like wordpress because of the ease of set up and plugins but at the same thats its weakness, I don't like how bombarded with text and details I feel even in the tinyest of feature. Haven't tried root tho, im gonna have to take a look.\nI've been using strapi and love the minimalistic aproach, its a little harder to set up but for the customer imo its a much more clean experience, as a dev I like the challenges of figuring out what data type each collection needs, wich can be a hassle for others. Anyways thats my experience.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Every option will have pros and cons obviously. The right CMS can change on the context/requirements.\n\nYou said \"One size fits all\". If thats the case, I think WordPress with the roots stack is your best option. It gives all the power of WordPress. Clients often know how to use it quite easily, which comforts them.\nYou have the chance with the roots stack to modernize your workflow quite a bit.\n\nI personally am quite a big Laravel and WordPress fan. So using Roots Sage gives me the best of both worlds.\nFor example: I use blade, view composers and sometimes even livewire.\n\nAs long as I built as much as reasonably possible custom within roots sage, I get great performance out of sites, while still being maintainable.\nJust keep the must haves like ACF, Yoast/Rankmath and maybe WooCommerce.\n\nIf you can't choose WP for whatever reason. I have heart great things https://statamic.com/, which is built on Laravel. Haven't used it in production myself, so can't tell you from my own experience.\nJust feel like it wouldn't be as \"One size fits all\" as WP.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1auigtd",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1auigtd/how_long_should_it_take_to_make_a_static_website/",
    "title": "How long should it take to make a static website?",
    "points": null,
    "comments": [
      {
        "comment": "How long is a piece of string?",
        "points": "29 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Time needed to make a website is equal to square root of number of centered divs to the power of !important in your CSS.",
        "points": "9 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My approach to website development depends on the budget. If I have a budget of $5k, I would spend around 1 to 2 weeks building the website. If the budget is way lower, I would use AI to generate the website and complete it in two or three days.\n\nIt is important to keep in mind that customer feedback and website updates will take up a lot of time, so it is best to focus on building the initial version quickly to maximize profits.",
        "points": "4 points",
        "children": [
          {
            "comment": "Is your design finalised before you start building?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "When you’re learning, you’re learning. You can’t really compare that to the time it takes someone who has already learned.\n\nDon’t worry about other folks, just focus on your own thing. The more you do it, the easier it’ll be.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Two fitty",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "more than 3 less than 8",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "1 hour",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "6 grepples",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Varies on many factors.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "42",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wordpress is just less than an hour to install.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It really depends on a lot of things:\n\nDo you need to build this website in a way that is maintainable later?\n\nYou mention that you're using Hugo and Tailwind, but even with those tools, if you want to be able to easily add new pages or make changes later, it can take a bit longer to do it right than if you just slap it together.\n\nHow important is it that it looks right across all browsers and devices?\n\nIt's fairly easy to make a website look good, but when you load it up on Safari, or on a tablet, or the browser built in to a weird \"smart refrigerator\", things can get weird quickly. Making sure everything looks right everywhere can take a while!\n\nHow much content is there?\n\nIf the website is just a single page with some basic info, you can easily be done in a day's work, plus a few hours here or there to fix some problems when your client tries to open the website on their kid's knock-off Bintenbo Swatch. On the other hand, if there's a lot of content, multiple pages, maybe a portfolio and all that, the content is going to have to be put into the website somehow, and in my experience, even if you make a really easy tool for your client to send you the content in the right format, they're going to send you a Word document or something, and you're going to have to just deal with it.\n\nHow many different kinds of content are there?\n\nIf it's all just text articles, for instance, you only have to build one layout, and you're good to go. But if your client wants articles, and also maps, and an calendar page, and a testimonials page, you're going to have to build layouts for all of these.\n\nHow complex is the design?\n\nIt's fairly easy to make a website that has a simple title and navbar at the top, and then content underneath, but if your customer wants something with a bit more flair, maybe they want animations, and drop-downs, and cool buttons with smooth transitions, and masked images, then it's going to take a while to make it all look nice.\n\nHow experienced are you?\n\nCustomers like to have a price \"by the hour\", and sometimes that's how you need to put it on your invoices, but they're not paying for your time, they're paying for a website. As you grow more experienced, you're going to be able to make things both better and faster. The question of how long it should take only matters when you're estimating whether or not you can fit it in your schedule and are able to deliver on time. In fact, you should charge more if your customer wants a shorter deadline, since that means putting off other things you need to do, working later into the night, and maybe even cancelling your weekend plans.",
        "points": "0 points",
        "children": [
          {
            "comment": "Also did they get a figma or did it themselves. Design is a rabbit hole",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I build these all the time. When starting out, maybe 7-10 days. After you’ve been around the block a few times, maybe 5 days. Up to 20 hours.\n\nNow if I were to hand code a static site, probably 6-10 hours depending on complexity and number of pages. What you need to do is work with a designer to make your design for you, then you code that. Developers shouldn’t be designing. If you don’t have a degree in it then leave it alone because you cannot self teach yourself design as easily as coding. You’re not being judged on the order of your css properties or code structure. But your design will be judged on details as little as that and it’s very easy to screw it up.\n\nI found my designer on dribble in Asia for $20 an hour. Great work, degree, experience, and very thorough. Saves me 10-20 hours of design alone. Worth every penny.\n\nThen you need to be starting out with a finished site first and editing that. Use my kit\n\nhttps://github.com/CodeStitchOfficial/Intermediate-Website-Kit-SASS\n\nIt’s got a blog in it too. Uses 11ty static site generator. Everything is documented on how to use it and where everything is. I clone this kit to start every project and edit the html and css. This saves me so much time. I don’t have the set the projects up anymore. I start with a finished site and work from there.\n\nThen I use my template library to fill in the site and finish a whole site in about 3-4 hours. I created an assembly line essentially. There’s no reason to spend 20 hours making a static 5 page site. Horribly inefficient.\n\nAnd when you’re done, your site should be scoring 95+ page speed if you’re coding it. If you don’t know how to do that, I wrote this to show you everything you should be doing to get 100/100 page speed scores\n\nhttps://codestitch.app/page-speed-handbook\n\nFollow every step and build it into your workflow. When I launch a site I never have to go through these steps, it scores 100/100 when I finish the site because I built these practices in my coding as I work. Optimization is not a thing I do at the end anymore. It’s something I do as I build it. Saves me time and makes a much better product.\n\nIf you have any questions about this, feel free to ask. This stuff is my jam.",
        "points": "0 points",
        "children": [
          {
            "comment": "Wow, I really appreciate this reply. Thank you so much. I'll be looking into that template for sure.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1auhxm9",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1auhxm9/do_you_have_any_resources_to_learn_more_indepth/",
    "title": "Do you have any resources to learn more in-depth concepts about backend development?",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1auhagt",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1auhagt/cooperation_between_companies/",
    "title": "cooperation between companies",
    "points": null,
    "comments": [
      {
        "comment": "Unless you can confidently say that this company is not a direct competitor to you, I don't see a world where dealing with them works in your favor. Direct access to customers is one of the primary resources you have as a growing business, and any deal that abstracts you away from this relationship is not likely going to work in your favor.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's called Strategic Alliance. You're new in the industry generally new businesses should do it. You can forward the work to me just in case you get overwhelmed 😅 just another partner. It's common nothing wrong, you're growing, YaY!",
        "points": "1 point",
        "children": [
          {
            "comment": "I’ll keep you in mind haha",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aug7k7",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://changelog.com/jsparty/307",
    "title": "htmx: a new old way to build the web with Carson Gross & Alex Russell (JS Party #307)",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1aufu3j",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aufu3j/what_would_you_recommend_regarding_ui_for/",
    "title": "What would you recommend regarding UI for swapping between hours and days?",
    "points": null,
    "comments": [
      {
        "comment": "A picture's worth a thousand words here.",
        "points": "1 point",
        "children": [
          {
            "comment": "https://imgur.com/a/MoHqkDb",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "A button group?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1auexqk",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1auexqk/code_or_no_code/",
    "title": "code or no code?",
    "points": null,
    "comments": [
      {
        "comment": "\"Every time I am grilling burgers my friend says he can get the same thing at McDonald's\"",
        "points": "353 points",
        "children": [
          {
            "comment": "If youre hungry and anthing works, get McDonald's. \n\nIf youre hungry and want a burger that contacts an API and runs custom code to multiple 3rd party APIs, then youre better off making that burger yourself, instead of getting a half mcdonalds, half burger king, half pizza hut burger pizza abomination",
            "points": "80 points",
            "children": [
              {
                "comment": "And of course for a good burger don't use node. Use bun 😅",
                "points": "14 points",
                "children": [
                  {
                    "comment": "And never forget to salt your hash.",
                    "points": "10 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I don't know, I could use a McKing Calzone right about now.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "This 😂",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Assuming you are aiming to make a return on your efforts (and not just hobby building), it's important to understand when—not if— a hand-rolled solution is appropriate.\n\nIf there’s a way to implement a version of your idea without building it from scratch, then 100% go with the no-code/low-code approach. Once you've established a product-market fit, then start to look for premium features that you would unlock by moving to a custom stack.",
        "points": "41 points",
        "children": [
          {
            "comment": "I am trying to find a middle ground where I use Wordpress plugins and theme for 90% of the site, then make custom plugins/theme for unique 10%. I think this’ll save time…",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This. If you're working professionally, you want to be using a framework at minimum for most jobs, if not a full CMS or e-commerce platform.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "100% correct answer, if your doing this for a business opportunity, you ALWAYS take the most profitable and viable path. Remember customers domt care if some monkey in the backroom built the website, just that it looks good, functions and is reliable (stays up) .\n\nLots of webdevs get too hung up on the tech stack and it only matters to the person building it",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Then ask him to do it for you so you can shut them up. If it only takes them 5 minutes should be no problem for them right? That’s the amount of time it might take them to sit on the toilet. So if it’s so easy, ask them crap one out for you since they’re so much better. See what they say and how it turns out. It better look exactly like the design, score 80+ page speed score, be accessible, and fully responsive for all screen sizes. You don’t need to learn Wordpress or wix. Custom code will Always make a superior product. What sites are you working on for months at a time? Sounds like analysis paralysis where you get caught up on too many simple decisions preventing you from finishing big ones.",
        "points": "84 points",
        "children": [
          {
            "comment": "So he talks shit, while taking a shit and building a shit website. The legendary triple shit",
            "points": "30 points",
            "children": [
              {
                "comment": "The shi-fecta",
                "points": "13 points",
                "children": [
                  {
                    "comment": "A one man shit show",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Saying stuff takes 5 minutes takes seconds.",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "B2b portals with heavy load I build do take the time. Basically business owners don't know what they want, but want it next Monday, partners' API documentation is incomplete, so we build a prototype and get their feedback. Then repeat. Oh and migration of legacy code. Test coverage of business logic. Etc.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The last one I got hung up on building a carousel. I’m trying to complete my main site and start marketing builds for small businesses in my area.\n\nI am too ocd about everything.\n\nOne thing I have noticed is that most of the no-code websites kinda have a similar look. They are very ‘canned’ too me.",
            "points": "1 point",
            "children": [
              {
                "comment": "Yeah stop building Carousels. Studies show no one interacts with them and they’re a huge waste of time and resources. I never build them. They add no value to the site or user experience.\n\nIf you’re looking to sell to small businesses, this is literally everything I did starting out and how to sell to them\n\nhttps://codestitch.app/complete-guide-to-freelancing\n\nShould give you a nice edge when starting out. Especially on how to sell yourself. If you can’t explain why you’re better and why it matters you won’t get very many.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Don't forget SEO",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Depends. What is it you're building? Some things are easier with WordPress like handling pages and templates but no one is doing a full custom WordPress theme build out in 5 minutes.\n\nOther things like a one pager that doesn't need a CMS is quicker by just making your one or two files. Like I built a flexbox css generator because I don't like any of the ones out there. No need for it to be on WordPress as that's just over kill.",
        "points": "11 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "IMO depends on if you’re building for fun or for a purpose.\n\nIf I’m doing a fun “me” project, I’m gonna spend a month (or a week or two, whatever) doing some awesome, built from scratch, artisanal site. I’ll probably pull in some new tech I haven’t used before too, because learning is fun and there’s no deadline on a just-for-me hobby project.\n\nOn the flip side, if it’s a website with a purpose, or something I’m building to help a friend out/doing for a client/whatever, time is valuable and how eloquent the code is pretty much doesn’t matter, only the end result does. So for me, the right answer there is WordPress.\n\nIt also depends a little on long term goals. Web apps aren’t powered by WordPress; if you’re wanting to build the next (Spotify, Discord, YouTube, Twitter, whatever), you really don’t need to know no code/low code web builders. If you’re trying to make a “normal” website—something informational, possibly with a little custom functionality, maybe an e-commerce shop or something—then yeah, learn WordPress/Wix/etc.",
        "points": "11 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"OK. Bet. When do you want me to start the timer?\"\n\nYour friends are dicks and full of shit. Get better friends.",
        "points": "23 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Was Reddit made with WordPress? Facebook? Stripe? Udemy? AirBNB? Was Wix made with Wix? No, it wasn’t.\n\nThe issue with no code solutions is that they’re there to fill a very specific niche, low cost entry level websites for small businesses and individuals, they can be built on and modified to look a bit different but they’re inherently limited by design.\n\nIf you want to work anywhere then you have to be able to work in whatever code they’re using, limiting yourself to no code is limiting your potential, both in your earnings and in your skills.\n\nIn 5 years you can be building The Next Big Thing, in 5 years they’ll be dealing with no money clients who are an evening away from being able to do it all themselves.",
        "points": "11 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What will they do if they can no longer utilize WordPress? Or the Meta changes entirely? You'll still know programming. Chat gpt can design a website in 30 seconds but there will eventually be diminishing returns. If you're still learning you should take the time to work through it. Use WordPress if you already have a grasp of what's actually happening under the hood. You'll probably be better at using it than a non coder",
        "points": "15 points",
        "children": [
          {
            "comment": "well put",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You should hire your friend for 5 minutes of his time to build the website for you.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's like arguing about frozen food vs. cooked food.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What happens when the website breaks or doesn't function the way they want it to? Do they have the knowledge to go into the backend and fix it without using another plugin that you probably have to purchase to use any of it's features?",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yeah but he's just churning out a template that will look the same as many other sites and is hard to change. You can literally do whatever you like with yours. Plus, he's just being very rude.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No! Don't stop learning to code. As soon as you try to do something complicated or custom with WordPress you're fucked.\n\nAlso you don't want to be 100% dependent on some niche company like Wix.\n\nIf you like to code, it's better because you can do custom stuff.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I develop themes, custom blocks, and plugins for client's WordPress sites (while wishing it would only take 5 minutes). Sure, a lot of ground can be covered with Gutenburg, but the block editor is frustrating to configure to match an approved design (to your point). WordPress can be as simple or complex as you want to make it and it probably wouldn't hurt to mix both worlds: CMS + Your custom developed integrations. Just depends on what the goal is.",
        "points": "1 point",
        "children": [
          {
            "comment": "As a fellow custom WP dev. It frustrates me to no end how WP has been constantly described as only a no code solution. Like how do you think all these themes came into existence? Someone had to develop them with code.",
            "points": "1 point",
            "children": [
              {
                "comment": "Because 90% of the people who bitch about WordPress have only ever known the dashboard and the plugin search box.\n\nWordPress is really good at so many things, it has its limitations but that's where a good developer knows when to use WordPress and when to use something else.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Keep doing you. Your friends' WIX site does the bare minimum and nothing more. Based on how unsupportive your friend is in the thing you take passion in, it might even be time to find a new friend.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hey bud. Im a fullstack engineer (PERN/MERN) and know Wordpress and Joomla as well. It takes 5 mins just to install Wordpress, not even talking about configuring it. Guess what Wordpress plugins are built with? PHP! Your friend might know how to put the lego pieces together but you will be the person making the pieces and instructions to them. Not even talking about getting a job. You do NOT want to be competing for a Wordpress Job. Trust me.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If he says he can do it in 5 minutes, he's full of shit. Nothing can be done in 5 minutes.\n\nUsing Wordpress (or something like Wix) may or may not give a better final result, depending on what the client wants. If they want a website they can edit themselves, then the answer is most likely yes.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Are you still in the process of learning webdev ? Unless it's a huge project, or a side project you just spend an hour on from time to time, taking months in the making of a website is waaaaaaaay too long.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "He's full of crap, you can't build a WordPress site in 5 minutes. It has a steep learning curve to do anything sophisticated at all... and worth every second. I've written code by hand, used Adobe DreamWeaver and Muse, and some old pre-wordpress CMS that's pretty much gone now. I do everything with WordPress and Elementor now. You can do darn near everything you need to with that combination. You can hand off the site for them to run after, while making some bucks teaching them how to run the basics, (so they don't bother you every 5 minutes for mundane stuff) and still make more when they need sophisticated upgrades/changes... and they always do. And btw, I still write html and CSS using WordPress. I find plugins for anything more complicated than that. And btw #2, WordPress is running on well over HALF the sites in the world right now. It's going nowhere until AI puts EVERYONE out of work.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Code is for losers, that Zero Cool guy hacked into the pentagon using only his sunglasses and 90s techno music.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As a developer, I find building websites to be a time-consuming task, especially when it comes to compatibility across different browsers and screen sizes, this is such a waste of time I always say to my clients that building websites can be costly considering ROI.\n\nNevertheless, with AI website builders like Framer (if you are a pro designer) or PineappleBuilder (if your not great designer ;)), I really enjoy building them! These tools allow to generate 5 websites in just five minutes and choose the one you like best. Editing with no code is much faster. In my case, the biggest challenge is to structure the website and write the copy for the pages. So again, AI is a killer help here.\n\nI would suggest you to try new tools. wix and wordpress are way outdated, so try AI and see if it's a game changer for you as well.",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "code",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m software developer and I mainly work on java backend and I love coding, I even do this at my free time (yeah I’m one of those). But oh boy how I often dream that we didn’t write that code where we reinvent the wheel again and just used some library, framework or 3rd party tool. Because all the code we write we need to maintain ourselves and now when a customer comes with a request for a new feature we need to integrate it in our existing code base. And now you look at the code that you wrote like half a year ago and you think “what the actual fuck is going on here? who wrote this peace of garbage? Oh it was me. Was I high or drunk at that time?” and what would take like a day of coding now becomes a week because you have to deal with legacy. I don’t know much about website industry and how often you deal with such situations but I think this shows important lesson - the less code you write, the better. But it doesn’t mean that no code is great, it’s just less code is better. Like let’s say you develop a website for some local barbershop and they need an ability to make and manage appointments. And yes you can develop this yourself from scratch and it will have like gazillion of bugs and it will be shitty on average. And your client will be angry with you and he will never recommend you to anybody. Or you can just use some 3rd party SAAS for this purpose pay them like 10$ a month and just integrate it into their new shiny website and if this saas company is not stupid they already have a plug-in for Wordpress. Clients most often will be pleased because they have a feature reach system for pennies, and they didn’t have to wait 3 months until you finished developing your “masterpiece” and most importantly (for clients) they didn’t have to pay you for that 3 months of work. Which brings me to the next point, the most expensive part of software development is you - the developer(well and the development team in general). Unless you have like thousands of concurrent requests the hosting is ridiculously cheap. So yeah think about how much you need to earn per hour to have a good life, and then multiply this by 3 months of work you need to complete your custom build. Do you think clients would want to pay this price? Of course no, and you will need to reduce your price to market level and you will end up doing more work for less money, and I’m not sure that final quality will be better in the end. And finally, I don’t know much about Wordpress but when somebody says “I can do this in 5 minutes” they are usually bullshitting, unless it’s a teenager who saw boobs for the first time. Also, Wordpress is just a tool, there are other tools that can do the same thing. For example Django with their Django CMS, or there are these website builders like wix or Shopify. It’s your job, as a developer, to find a right tool for the job, that makes the job economically viable.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What he meant to say is I'm a script kitty who can find a script that can do that in 5 minutes and if there are any minor changes I am stuck as fuck.",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's not about doing it wrong; it's about choosing the right tool for the job. WordPress and Wix can be great for quick, simple websites, but if you enjoy the process of building from scratch and have complex requirements, sticking to your current approach might be best. Consider your goals and preferences when deciding whether to explore these platforms.\n\nhttps://jagmohankrishan.com/",
        "points": "-6 points",
        "children": [
          {
            "comment": "Why are you linking to your own site",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I code and I have a Wordpress blog so I feel like the perfect person to answer. They can do it in 5 minutes but it’s way less customizable. I just paid a girl on Etsy $50 to do mine and get the code. Then I can go in and change it if I want to. So maybe do that??",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Have you asked how it would build in five minutes?? Surely all plugins...spending time learning code is not for the faint of heart. It's good to learn to do this craft well and methodically. Don't be discouraged not all clients want WordPress. Since you seem to know your way around code, learn php and really make him feel like shit. Now you'll know what he does and do it better.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "if your objective is to learn how to write code - then keep doing what you're doing.\n\nAnd nothing wrong with using Squarespace or Wix or WordPress if your objective is to put up a decent-looking site.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yeah I mean, it depends honestly\n\nI had this website I built for months getting it all perfect, and someone legit copied it into WordPress and stole it from me when I ended up dropping that client. Thank you stupid waybackmachine 😑\n\nThe thing is, sure, it could maybe be done faster. But the point is?\n\nYou can get a car wash at a drive through one or drop it off for hours and get around the same results too...\n\nPoint is, different strokes for different folks. Do what you want/love and they can do what they want/love. There's no wrong or right way as long as it works lol. There's more efficient ways sure, but those ways may not be better in terms of functionality, advancements, etc\n\nAlso, arguably your coded website can be upgraded a lot easier vs a WordPress one. Let's say WordPress completely shuts down tomorrow, they're done and everyone who uses them is done. But not your code...",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No code solutions are a screw up when you need to customize the app/site. Yup, they can whip up a static site quite quickly, but not bespoke solutions.\n\nThis is esp. true when you're doing state management from several API calls, and writing logic based on those payloads and user events.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think the moral here is that your friend is talking 💩 Even building a theme out in Wordpress takes time. I don’t really see a time difference between custom build and Wordpress, the time saving comes from the fact that you have a ready made CMS if it’s needed with Wordpress.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why not both?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Everything has a different application. In some occasions WordPress is the answer, but regardless of that, I am sure if a clone of your site was built in WordPress, it would perform 5 times worse",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you like coding then do code. No-code solutions aren't made for developers.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It depends on what your goals are. If your goal is to be economically competitive making boilerplate-type websites, then you absolutely want to use something like Wix, Squarespace, Wordpress, etc...\n\nIf your goal is to learn the ins and outs of web development so you can make applications that stray from the beaten path, then learning how to do everything from scratch will make you way more flexible than your friend.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "First of all, WordPress is not even in the same category of good, no-code software. It's is buggy doo-doo.\n\nBut yeah, why use a hammer to build a house when you can use a nail gun?\n\nDo you need to bust out the hammer every now and then? Of course. All carpenters are using nail guns now, but they still have a hammer on their toolbelt.\n\nIf something needs to be hand coded because its complex, or because it's so simple, then hand code it. But if it's in the middle, then use a builder.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "they could build this in 5 minutes in wordpress\n\nlol okay.\n\n \n\nmaybe I need to learn wordpress\n\nMaybe. Maybe definitely. It's a valid option for many situations. Did you know that 40% of the internet is wordpress.\n\n \n\nand wix\n\nOne thing at a time\n\nYou can squeeze juice by hand, you can use a squeezer, you can use a juicer, you can just buy juice...",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "WordPress and no code options in general are great for building very simple things. If your requirements are low WordPress can be great.\n\nIf you want complexity and customization, it's absolute shit",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's wild to see how some people in here talk about WordPress. I am not saying it's a perfect fit for every situation but I'm working on multi million dollar WordPress projects, it's funny to see people here act like it's no code or comparable to Square Space or Wix.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"Amazing! Can you show me?\"",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As a professional - if something can be done in 5 minutes with WordPress, versus weeks by hand - we're going with WordPress. There's nothing inherently better about hand coding.\n\nThe catch is that, unless you learn to code, you don't understand what WordPress is doing, and you probably don't know how to ensure that the resulting site is sufficiently responsive, accessible, SEO friendly, fast, etc.\n\nThe other catch is not everything can be done with a prebuilt solution. Sometimes the tool for the job does not exist, and needs to be coded by hand.\n\nIf your goal is to learn, do it yourself even if it would be easier with WordPress. There's no other way to learn.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No code is for Project Managers that think they know how to do it better...",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There's a whole gray area between building everything from scratch and using \"no code\" solutions or WordPress.\n\nI personally like using GitHub Template Repos. I have a few that I made for various kinds of projects that cover a lot of the setup and boilerplate and all that. That way, I build pretty much everything using the code I wrote and maintain, but I can be up to like 90% done (for simple things at least) just by clicking a button.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That's no friend",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think it is a bit sad that your friend says that if you enjoy it then it is good either way. Professionally it is good to know the strengths and weaknesses of the possible technologies. In many basic cases wordpress with some customization either with some plugins or some custom html/css/js/php can get you a long way in a very short time.\n\nIn the other hand for some rather serious integrations with a lot of data or interactions, fully custom build using serious frameworks does the job better as trying to use wordpress or similar will need a lot of tweaking and will end up more like a bandaid solution build on sticks then a solid site and developer workflow. It sounds like you could benefit from getting to know site builders to see what they can do and for what/when they are used. Then you can decide for yourself, is it worse than what you bring to the table or is it about the same with less time and effort.\n\nIt might be that your friend can build something that you made in minutes, I do highly doubt it for sure viewing the whole experience and robustness of 'self build' is normally higher than wordpress if you have anything advanced.\n\nI personally like wordpress as it does fit a lot of clients and needs when they just need a site to showcase their company.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1audnhx",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1audnhx/struggle_to_focus_on_tasks_at_work/",
    "title": "Struggle to focus on tasks at work.",
    "points": null,
    "comments": [
      {
        "comment": "Make yourself a rule to only check your email once a task is finished, or every hour or so.",
        "points": "15 points",
        "children": [
          {
            "comment": "*once every 5 hours",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "That's a very good idea, I'll start doing that. Also I like your name, recently picked up PHP for work and I really love it",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You need to get with your manager on that. How are you billing the time?\n\nAnd like @phpx mentioned, only check emails after a task is finished and check in ordered received",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Also, your manager should be giving you directives on how to prioritize, so that you wouldn't have to feel bad about making clients wait.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "When I was a high-pressure dev, I would work for 25 mins, then check phone/e-mail for 5 mins. Rinse, repeat.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Taking inspiration from operating systems, you should probably use a task manager like Jira or simply prioritize your emails. Figuring out when to task switch and when to focus is a philosophical challenge. Task management itself takes time, but if you’re getting a large number of tasks, slowing down and spending more time on organizing can be worth it. So maybe spend the first 1-2 hours of the day prioritizing tasks, and then ignoring all new requests during the day unless they’re critical.\n\nIt might feel like you’re wasting 1-2 hrs of your time but it’s important. It’s kind of like stretching for athletes. If you don’t do it you will injure yourself.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My trick was. Make enough clients cry and they'll get a project manager to be the in between to handle client communication.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hey there, sorry to hear you're having a tough time staying focused at work with all those client requests coming in.\n\nI recommend using task manager app that can help you organize your tasks, set priorities, and track progress. Some popular options include Todoist, Trello, and Asana.\n\nThese apps have features like task prioritization, due dates, reminders, and collaboration tools to help you stay organized and focused.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yeah, keep track of each email and each task it creates if you can’t convey this properly to your manager or team.\n\nYou’re gonna burn yourself out because there IS a maximum you can handle.\n\nYou need to work out which is more important for your team, that you can triage all these issues or that you can work on them and get the tasks done.\n\nI assume you have some type of calendar attached to your email. Block out hours on your calendar, 5hrs for actual working on tasks, 3 for emails/meetings/everything else. Make sure these people and coworkers can see it. Have your emails auto reply your hours if need be.\n\nBlock your email notifications from showing up on taskbars/dock bar/etc during your working times. Minimize any distractions that pop up. Mute your messages except from the certain people that actually matter.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Sounds like you need a product manager(s) taking over these emails for you - just forward them if you have one, or to your manager at least.\n\nThen, get them written up (create a decent title) and copy/paste the email in to the ticket & assign to your manager/product owner for them to prioritise.\n\nYour exiting work should be in some sort of ticket system (JIRA / trello / azure devops) for you to have an organised list of tasks. You don’t move on to the next task until one is “developer done” and in to a PR or testing queue.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Here's what I'd do:\n\nFirst thing in the morning you go through the outstanding list of issues in email and you make a hit list of what needs doing. Respond to anything you can to close it out but your job for the next 15-30 minutes is to make a task list for the day.\n\nOnce you have your list you stop looking at email. You don't go back to it. If there's an actual emergency they should be calling someone, not emailing; it can wait, it will wait.\n\nIf you get through your list before the end of the day just jump right in where you left off.\n\nNever interrupt a task to look at email.\n\nEvery time you break task you lose about 20 minutes of productivity. So every little \"I'll just respond to this\" is 20 minutes poof before you're back to full speed again.\n\nIf you have an SLA that requires you to respond within a certain time frame the answer is you either set a timer for that minus 15 minutes or you tell your manager you need someone to handle ingest because it's ludicrous to have software engineers doing admin work given how much we cost. Like seriously you want to pay someone $150,000 to respond to emails? Good luck to that company...\n\n[Edit:]\n\nIt's worth me adding some context about why I'm suggesting this. For about 8 years I was the sole frontend engineer at a pretty popular site and the result was I fixed a lot of little things. So when they came in I had to go, \"is this actually worth my focus or should I get back to what I was doing?\"\n\nThe only thing that kept me on track was getting militant about my notifications (everything turned off unless it's a DM on Slack or a calendar) and making my own list of tasks so I could track how long something important had sat.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You should discuss how inputs for changes/functionalities come with you manager.\n\nReserve a time frame until they have time to give input on new changes and functionalities.\n\nIt's also nice to have one place where you can track the changes from the client, we do it in Jira.\n\nWe also had a problem with changes coming from different directions, email, client pinged me on teams, etc.\n\nEDIT:\n\nProbably I didn't help you with how to concentrate more, but maybe this will help too.\n\nFor DEEP WORK/FOCUS:\n\nWhen I am working, I go off mode for 1-2 hours, shut down slack notifications, emails etc.\n\nPeople easily get used to you responding promptly and quickly, and that is sometimes not good.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "To stay focused, try setting specific times to check and respond to emails, allowing uninterrupted blocks of time for deep work. Prioritize tasks based on deadlines and importance, and communicate with clients about realistic timelines. Consider using tools for task management and blocking distracting websites during work sessions.\n\nhttps://jagmohankrishan.com/",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If a person doesn't set their schedule, everyone else will. Similar to what other's have said: partition your days into time blocks for checking communication channels, working on tickets/day-to-day, long-term projects, professional development, personal-time, and a time for reflection and planning. Trying to play whack-a-mole and burn the candle at both ends has diminishing returns.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have worked for some pretty chaotic agencies, but none of them let the clients assign tasks or priorities.\n\nThe only exception was that one time when the agency had treated a client so poorly that management decided that for the next few months, every ticket the client wanted solved they would get solved. (Basically they got a new project built simply by breaking it up into ticket sized chunks.)\n\nIf I were you I would look into what industry standards are for dealing with tickets and present my findings to the boss.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Similarly I stopped answering the phone when clients rang, in doing so they are making you work to their agenda, I flip it around and call them back when it’s convenient to me. It’s the same with emails, just don’t look 🙈",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You should only check your mail/phone every X time period.\n\nI maxime my productive time by using focus modes on my mac. I just don't see any notification while active. It has been automated.\n\nI check my mail three times a day:\n1. Start of the day\n2. After lunch\n3. End of the day\n\nI always do 3 things:\n- Respond to all mails which requires < 1 min to respond\n- Plan all other emails in tasks for the following days\n- Respond that I will get back to the person on the planned day if I can't solve the issue on the same day.\n\nThis will improve your focus a lot.\n\nAll mails I got \"(CC)\" in, I don't respond at all. I move them to a folder in my inbox. I check this folder only once a day, because it doesn't require a direct action from me. It is impossible to manage otherwise.\n\nBut you should talk to your manager, because in the long run you probably need some kind of Project Manager in between.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aucbiw",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aucbiw/what_is_the_market_rate_for_designing_and_then/",
    "title": "What is the market rate for designing and then building a 5 page website for a small to medium sized business?",
    "points": null,
    "comments": [
      {
        "comment": "I have two packages:\n\nI have lump sum $3500 minimum for 5 pages and $25 a month hosting and general maintenance\n\nor $0 down $150 a month, unlimited edits, 24/7 support, hosting, etc.\n\n$100 one time fee per page after 5, blog integration $500 for a custom blog that you can edit yourself.\n\nLump sum can add on the unlimited edits and support for $75 a month + hosting, so $100 a month for hosting and unlimited edits.\n\nI keep things pretty simple.",
        "points": "9 points",
        "children": [
          {
            "comment": "Interesting, 24/7 support sounds intense though!",
            "points": "0 points",
            "children": [
              {
                "comment": "He's saying 24/7 because it sells well, but realistically he knows nobody is going to call at 3 in the morning because they want a paragraph changed on their \"about us\" page. It's quite clever!",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Interesting. I feel like my clients would take complete advantage over unlimited edits lol.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Depends entirely on what market you’re referring to. Prices vary wildly based on things like country, state, city, experience, etc.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Timewise about 3 months and usually around 20k for a marketing website. I don't count pages. I do not handle hosting but will assist with consulting with hosting companies and providing maintenance for $200 / hr.\n\nI also provide maintenance retainers where if you pay me $250 per week you'll get up to 2 hrs. After that, it's $150 / hr. Most opt for the retainers since it's such a better deal.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I agree that most time you spend on communicating with clients and making website updates; my strategy is to initially build a website with the help of AI. Then, I work on refining the website according to the client's preferences. This approach saves me a lot of time as I don't have to spend too much time building a website from scratch.\n\nI have created custom workflows for different niches and collaborated with a few agencies. If you want more information, feel free to DM me. Additionally, for clients with a tight budget of $400, I use PineappleBuilder, so I can build whole website under 1 day.",
        "points": "-2 points",
        "children": [
          {
            "comment": "Nah, AI made sites are shit — literally next generation of Page Builders they emit shit quality code with horrible speed standards. You won't even rank good what's the purpose of wasting on such site. They could literally go to Fiverr and get a lndian Dev doing the same shit work.\n\nBetter forward the work to me or any other quality dev that can do it in this budget thanks to living in a cheap nation. Simple maintain your quality....",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Interesting! Yeah I was thinking about using AI",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Same price as a car.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aubqul",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://www.reddit.com/gallery/1aubqul",
    "title": "How is reddit generating these og images?",
    "points": null,
    "comments": [
      {
        "comment": "When a post is submitted, this image is server-side generated and put into the open graph metadata.\n\nThe backend can render anything it wants, any way it wants, and make a picture out of it.\n\nReddit uses python. It doesn’t matter much past that, but they basically just take title, description etc and run it through a template.\n\nThen, the resulting html will be rendered with something like imgkit.\n\nThen, in the html, use opengraph :og. Something copy pasted from stackoverflow youre free to search for:\n\nhtml <meta property=\"og:title\" content=\"The Rock\"/> <meta property=\"og:type\" content=\"movie\"/> <meta property=\"og:url\" content=\"http://www.imdb.com/title/tt0117500/\"/> <meta property=\"og:image\" content=\"http://ia.media-imdb.com/rock.jpg\"/> <meta property=\"og:site_name\" content=\"IMDb\"/>",
        "points": "121 points",
        "children": [
          {
            "comment": "Yes, I know.\n\nDo me a favor: inspect the website, look in the head element, and tell me where the og:image is. It’s not there.\n\nTHAT was my question. How is reddit rendering an og:image without actually putting it in the html.\n\nThe answer (as someone else pointed out) is that they’re using some sort of cookie/session to selectively generate an og image. If I’m logged in I don’t see the og:image tag. If I log out in incognito I see the og:image tag.",
            "points": "-269 points",
            "children": [
              {
                "comment": "Well do us a favor: figure it out yourself smartass",
                "points": "164 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "So there's your solution then\n\nif (!user) { insertOgimage() }",
                "points": "56 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Yo chill lol you didnt exactly go into detail.\n\nWhat website? Reddit? Twitter?\n\nAnd youre welcome for typing that out.",
                "points": "116 points",
                "children": [
                  {
                    "comment": "You were the third comment in the thread. I posted a comment explaining further (you can’t exactly go into detail in a Reddit title) what I meant, and at the time it was the top comment.\n\nYou just chose not to read it for some reason 👍",
                    "points": "-61 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "You're coming across as a bit of a tool, man. It is okay to not know something but don't reply snarky.",
                "points": "64 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Asks 7 word question. Annoyed people didn't understand you meant a different question",
                "points": "37 points",
                "children": [
                  {
                    "comment": "I posted a comment after I posted the thread 👍",
                    "points": "-42 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "As others have already pointed out, Reddit is using opengraph, but there are only sending the meta-tags when they detect a \"social crawler\".\n\nUsing curl https://www.reddit.com/r/webdev/comments/1aubqul/how_is_reddit_generating_these_og_images/ -H \"User-Agent: Twitterbot/1.0\" we can find both\n\n<meta property=\"og:image\" content=\"https://share.redd.it/preview/post/1aubqul\" />\n<meta name=\"twitter:image\" content=\"https://share.redd.it/preview/post/1aubqul\" />\n\nin the response as well as the disclaimer: Your user agent Twitterbot/1.0 has been identified as a social crawler.",
        "points": "42 points",
        "children": [
          {
            "comment": "This makes total sense and probably saves a ton of bandwidth. Clever of them.",
            "points": "14 points",
            "children": [
              {
                "comment": "Gives me a good chuckle that someone is thinking they'll be hyperoptimising something like that when they still continue to encode and serve giant +100MB literal .gif files for some video submissions, not to mention all of the giant .gif files they use for comment reactions.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "We all tackle the problems we know we can solve and identify. For all we know, it's on their to-do list, just no one has the expertise or a solution that works for all cases.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "I mean they've already got the video-encoding pipeline semi-functional, there's 0 legitimate reasons I can think of for them to still be encoding and serving literal .gif files for some videos, other than incompetence/laziness.\n\nNot to mention there's still that bug in the new-reddit comment editor that breaks raw URLs in comments unless people go in and manually fix them, and that's been something like 4-5 years. And they left the comment sorting options on User pages broken for over a year, and their hackjob fix for that bug then broke all the other sorting options for several months after that.\n\nWhat sort of completely whacky priority system do they have where they're concentrating on hyper-optimising such pointless things over leaving basic features broken, and then also just throwing away all of that wasted effort on hyper-optimisations away by incompetently handling other things?\n\nI mean from a quick check, serving just a single person one of those giant .gif files over the video version is going to wipe out the savings of something like 150,000 requests where they've stripped out the OG tags.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "Welcome to the world of product management and engineered solutions my friend...\n\nTo be a fly on the wall at Reddit and see what they are focused on may enlighten all of us as to what they prioritized as a \"high priority issue.\"\n\nMany companies also just had a huge brain drain happen... wouldn't be surprised if Reddit had some of their own.\n\nAlso, the low hanging fruit that is OG tags and bandwidth may have been something given to a JR to give them some exposure to dealing with production traffic.\n\nWe probably wont ever know why this was chosen as a priority, but it was",
                            "points": "-1 points",
                            "children": [
                              {
                                "comment": "Many companies also just had a huge brain drain happen... wouldn't be surprised if Reddit had some of their own.\n\nThen who is doing these pointless hyper-optimisations then?\n\nFirst you say they're somehow saving bandwidth by serving web-scrapers larger versions of sites, then that.\n\nYou're not making any sense.",
                                "points": "-1 points",
                                "children": [
                                  {
                                    "comment": "you missed the last two sentences",
                                    "points": "-1 points",
                                    "children": [],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "So.. I don't often fall for this sort of bait, but here we go - Im sorry reading comprehension is hard for you.\n\nThe two concepts are not mutually inclusive. You can have brain drain, and also prioritize low hanging fruit fixes on a backlog to give someone exposure when they're new.\n\nIt's also entirely possible that when a scraper is identified, the whole thread is actually NOT served, but JUST the OG tags and some additional meta data. I didn't look at the reply.\n\nHowever, even if scrapers are served the whole thread with the additional data, that would still be a net savings of bandwidth over all. Quick googling shows reddit serves 2.2 billion requests per day. Crawlers likely account for a few thousand of those requests. When you take a small, but being generous, 700 byte OG tag and multiply that by 2 billion, you are saving yourself from having to serve 1.4 terabytes of traffic.\n\nIt's not trivial. It has a cost associated with it.\n\nWhile I don't disagree with you that they likely can have other cost savings elsewhere, this just happens to be an easy one they identified and did something about.\n\nNot sure where your confusion lies. I can't help you figure it out any more than this.\n\nGood day.",
                                    "points": "0 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I don't see this, my browsers don't download og images when visiting websites?",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Your browser identifies itself as a browser to reddit. Twitter and other scrapers do the same. So reddit checks this identity and only serves og tags when a known scraper is properly identified.",
                    "points": "-1 points",
                    "children": [
                      {
                        "comment": "I don't see how it saves bandwidth. The tag markup itself is negligible.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "You're not thinking to scale.\n\nLets say Reddit gets 1billion requests a day.\n\nHow many of those are web scrapers looking for OG tags?",
                            "points": "-1 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Thank you! Cool stuff.",
            "points": "-5 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Here’s how you can do this with php: https://getkirby.com/docs/cookbook/content/dynamic-og-images",
        "points": "44 points",
        "children": [
          {
            "comment": "Yep! I just don’t get how they’re doing it without explicitly putting the generated image url in the html",
            "points": "-63 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You can use cloudinary image generation for this.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I wanna know. Why is GoDaddy a terrible decision",
        "points": "-12 points",
        "children": [
          {
            "comment": "More like: Why isn’t it a terrible decision?",
            "points": "23 points",
            "children": [
              {
                "comment": "No idea, just asking from learning perspective. What are other options and why them over godaddy for buying domain",
                "points": "13 points",
                "children": [
                  {
                    "comment": "Heh those were some unfair downvotes for a legit question. It seems to come up a fair bit here, so I think sometimes people forget it could also be someone else's first time hearing about it too.\n\nI'm also new but from what I've gathered, they are unethical and profiteering in their business practices. This includes: - Reports of 'parking' domain names when you search with them, so they can sell it to you for more. - Poor interoperability with other services that other providers have no problems with. - Recently someone asked about their overpriced SSL offering when the general consensus was \"wtf that service is free with <other provider here>\"\n\nA lot more I'm sure, but still learning the ropes myself. I've heard less about the dirt of other providers, so not sure if it's hivemind or they really are a distant last place.\n\nAs for who to use, I've found CloudFlare excellent, for both domains and CDN. And their free CloudFlare Pages. As an amateur I really can't complain about getting to play with all of that for the cost of just my domains.",
                    "points": "7 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Same reason anything is. Someone says so. Completely objectively too!\n\n/s",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Open Graph Protocol. I used r/mealybugs to test out a workaround in getting it to work with pdfs. The code.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I know it's possible to generate dynamic og images on a node server, i've done it with vercel before (https://vercel.com/docs/functions/og-image-generation), but it still requires you to put a link inside of the og:image meta tag.\n\nThere's nothing in reddit's html defining anything with a meta image, yet Discord and Twitter (not slack) show these og images.",
        "points": "-21 points",
        "children": [
          {
            "comment": "They are including it in the HTML. At least its there for me when I got into dev tools and open up the head.",
            "points": "20 points",
            "children": [
              {
                "comment": "Really? Can you show me a screenshot because I don’t believe you 😅. I did a find on the page source and nothing came up, and I looked through the head tag line by line the other day",
                "points": "-42 points",
                "children": [
                  {
                    "comment": "When I checked earlier they were there, though checking again they were not, but I was able to get them to show up by using icognito mode, so it seems they are doing something with cookies/sessions and only adding them conditionally, proof",
                    "points": "20 points",
                    "children": [
                      {
                        "comment": "Ahhh ok. It’s the cookie/session thing. Thanks man, really appreciate it",
                        "points": "11 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "They probably detect the bot from Facebook etc and only render the image for those requests, rather than for normal users who don't need this content generated on-the-fly.",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "That makes sense. Thank you!",
                        "points": "-2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "GoDaddy Sucks. Use name cheap",
        "points": "-7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I haven't found any other way than the backend image generation by creating a webpage and taking screenshot using pupeteer, and then usung that image as og:image. But it feels like a hack, there must be an easier way to do this.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1auatyh",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1auatyh/who_are_the_best_web_developers_you_have_worked/",
    "title": "Who are the best web developers you have worked with so far and why?",
    "points": null,
    "comments": [
      {
        "comment": "One of the best developer I know has a PhD, worked at NASA and FAANG and has some of his code in space. He will take in consideration what people have to say regardless of their qualifications, you would often hear him say \"I don't know, let's figure this out together\". He was smart enough to know that despite his massive knowledge he didn't know everything and he taught me \"You never want to be the smartest person in the room\". I noticed he listened a lot and only talked when he had something important to share, he would talk to intern and juniors the same way he would other PhDs, tried to learn from everyone and share his knowledge every chance he had. He was confident but not arrogant, he knew the only way to succeed was for the whole team to succeed. He lived in the terminal and knew low level code super well and very complicated math, yet he would always see himself as a beginner.",
        "points": "784 points",
        "children": [
          {
            "comment": "Plot twist - he's talking in the 3rd person.",
            "points": "148 points",
            "children": [
              {
                "comment": "He wrote it as his linkedin description.",
                "points": "36 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Need more people like these around..",
            "points": "60 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Thanks for sharing an inspiring story, did you ever get advice from him? Like what kind of advice will he be giving the interns/ juniors?\n\nI myself is a junior frontend developer",
            "points": "22 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I’ve noticed this too. The best developers were obsessively helpful and considerate to everyone.",
            "points": "18 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Wait... is this maybe the author of \"Two scoops of Django\" ? If so we worked with the same person lol",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "always see himself as a beginner\n\nPoor guy worked at NASA and still suffered impostor syndrome like the rest of us! /s",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Sounds like NASA.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Inspiring!\n\nReminded me of an old saying - we have a ratio of two ears to one mouth for a reason!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Chris.\n\nFucking legend.\n\nHe had four monitors.",
        "points": "493 points",
        "children": [
          {
            "comment": "- One for the backend\n\n- One for the front end\n\n- One for terminal/logs for debugging\n\n- One for cat memes on Reddit",
            "points": "124 points",
            "children": [
              {
                "comment": "The 49inch curved ultrawide one to rule them all",
                "points": "20 points",
                "children": [
                  {
                    "comment": "Way too small. I prefer four 49” curved monitors, so I can have 360 degrees of coverage. Sure, it’s annoying having to crawl under my desk to get to the middle of my circle of monitors, but imagine how much more productive I am now! A swivel chair works great, since I just spin around to see the monitors behind me.",
                    "points": "9 points",
                    "children": [
                      {
                        "comment": "I just put a mirror above my primary monitors so I can see the ones behind me.",
                        "points": "6 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "What resolution do those ultra wide ones actually use? Like 1 million x 1080 or something daft?",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "should be 5120 x 1440 pixels",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "The last one might be used to /r/programminghumor",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "To make it better, he should add a fifth monitor with his music playlist",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Why not a 6th monitor - just for tracking takeaway food once you've ordered it",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "4? Damn, I was going to throw Greg's name out there, but he only had 3 monitors.",
            "points": "76 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Does he use Vim, though?",
            "points": "3 points",
            "children": [
              {
                "comment": "Everyone knows real programmers only use Microsoft Word. How else are you gonna add word art when you’re feeling fancy?",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "What's wrong with Nano?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "How many has he now?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Did he also blast Aphex Twin and talk in a robot voice?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "That guy fucked",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "They were respectful first, competent second, and productive third.\n\nThe older I get, the more I realize how nuanced those values are. You want to be respectful, but not to the point you don't show up for yourself. You should be competent, but not the point of being a brilliant jerk or over-specializing. Productivity is especially vindictive because it's the easiest way to earn praise, but you might be hoisting tech debt onto the rest of the team.\n\nIn the end, I think finding a team to which you're well attuned is the most important factor.",
        "points": "198 points",
        "children": [
          {
            "comment": "Something that has struck me to my core at 45 \"If you are gonna be a leader, be strong enough to be gentle\"\n\nAs soon as I read that my life flashed through my mind, I saw how I have not been that, at all, my whole life, even in my marriage. It was a gut punch because I knew I was always a jerk, but somehow reading that got me present to how it's been for others on the receiving end of being around me while doing any type of work or project.\n\nIt's been months and I'm still rattled. I never want to be in charge of anything ever again. I'm not sure where I even go from here, I was such a know it all arrogant prick.\n\nI feel like I'm starting from scratch \"how to be a decent human, day one\". Maybe it triggered a mid life crisis, heh.",
            "points": "28 points",
            "children": [
              {
                "comment": "I've been badly out of line sometimes, and could have supported my colleagues better sometimes. I look back on some past behaviour with deep embarrassment. But I'm also flawed and human. And sometimes pressures and circumstances exacerbated my actions. So I cut myself a little slack looking back because beating myself up doesn't help. And I try to reflect and improve how I treat myself and others from this point on as that's the only part I have control over.",
                "points": "7 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Hello stranger. I am very happy for you that you have realized this. It's never too late. Care to share why this sentence created such a strong reaction?",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Damn this is so accurate",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The best web devs I’ve known was a colleague. He was very polite, made very good comments and suggestions while reviewing PRs and was very respectful while doing it. He never made any person feel stupid - be it a fresher or a peer. He was an active open source contributor - I think that’s how his comments were super high quality ! He was also willing to learn and built a ton of fun stuff along with junior engineers - that helped him be current and fun and knowledgeable about trends.",
        "points": "66 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Mike. I hired that motherfucker as a Jr, and somehow he parlayed that career into retired at 40 with a full time passive income. Still not sure how with barely learning code, but figured out how to jump place to place until he had equity in a dozen apps and somehow negotiated enough contract money to never actually write a line of code again. Asshole.",
        "points": "149 points",
        "children": [
          {
            "comment": "Thats a salesman, not a developer.",
            "points": "50 points",
            "children": [
              {
                "comment": "jelly?",
                "points": "-5 points",
                "children": [
                  {
                    "comment": "Yes",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "Me too",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "My current manager. He's always positive, great at taking and giving feedback from engineers, product managers, and users alike, and is awesome about making sure meetings stay on task and sprints keep a reasonable scope.",
        "points": "34 points",
        "children": [
          {
            "comment": "Is he hiring??",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Your raise is in the post",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Haven’t met a best web developer yet. One bunch I worked with were really nice but not super advanced at web dev, but there was an AI researcher in an aligned team who to-this-day is the smartest person I’ve ever met by a wide margin, and one of the nicest people I’ve ever met and who I can call a friend even though there’s a large age gap between us.\n\nHuge ideas about science and AI, technically extremely competent but working in a place they are light-years ahead of because it affords them some abilities and perks, from a country they can never return to, the only person I’ve ever met that doesn’t see age, race, gender or culture and just wants to hear your opinions and ideas. Challenges you to be a better you. They can talk to anyone and they can tailor the discussions to you at your level, never showing off and never trying to look clever.\n\nI wish there were more people like them. I miss working with them, we would have “big ideas” chats over coffee every morning cutting way into work tile in the short time I worked with them. I still see them on occasion whenever we get a chance to catch up.",
        "points": "28 points",
        "children": [
          {
            "comment": "So in short - you can meet some life changing people in this field.\n\nBut when it comes to to web developers it’s a mixed bag especially in terms of how likeable they are and how competent they are.\n\nThe nicest developers I worked with tried hard, didn’t keep up with tech trends, and were generally nice to work with.\n\nThe 2 most competent devs I have worked with so far, that kept up with everything and were extremely knowledgeable and practiced were the biggest assholes I have ever met in my life.\n\n^ extremely unhelpful, impatient, ass kissing sacks of shit that sucked corporates fat juicy booty with their brown stained smacking chapped lips. They knew their shit but holy fuck were they insufferable. I think they were on the spectrum because they were socially inept. No one at the company liked them, but they got results. But everyone that worked with them quit pretty fast. They were know it alls and bought the absolute latest tech whenever it would come out, and would suck Steve Jobs corpse off if given the chance\n\nI’d rather work with pleasurable, less knowledgeable people than the above\n\nSo as you can see some web devs can get a “god complex” even though there are much more technically challenging fields in the world. Just stay humble and you’ll be fine",
            "points": "15 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This girl Amy I met. She went through a bootcamp but could walk the floor with me in code challenges and general speed of work. And a wonderful friend to boot!",
        "points": "21 points",
        "children": [
          {
            "comment": "Curious, what kind of code challenges? Leetcode kinda thing?\n\nEdit: code not coffee",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "There was a guy that I really looked up to, he was the best web developer I've ever met so far. He was literally a machine when it came to picking up languages and building useful stuff with them. He used to tutor me and others, and he was just such a nice cool guy. He explained things very well, and was always very positive. He now works at a car dealership and is very happy.",
        "points": "17 points",
        "children": [
          {
            "comment": "Was not expecting that ending. Is he a salesman or does he do IT for them?",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "My mentor and friend who taught me everything about ML (before it was cool) in 2018 and data science. Guy had a PhD. in physics - very smart, but didn't look down on me or others, always wanted to help and solve stuff together - he knew how to do it, but wanted me to be proactive and learn on the go.\n\nSadly, I don't work with him anymore because he got big boy money working as a principal engineer at a company that specialises in ML.\n\nI still speak to him, and we occasionally go out for a beer. :)",
        "points": "12 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There was this guy who always +1ed me in terms of software quality. I learned a ton from him how to test code better, how to refactor better and how large scale applications work. He was very involved with tweaking Selenium to a point where we could write tests in a breeze and we even went the extra mile to hook into the lifecycles of a Spring Boot application.\n\nI was amazed to see what software is capable of. And when I thought we were done implementing, we spent at least another day refactoring and it blew me away how much of the code could’ve been taken away.\n\nHad a nice personality as well. We was at least 20 years older than me and could teach very well.",
        "points": "9 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ones who weren't dicks.",
        "points": "19 points",
        "children": [
          {
            "comment": "Very true. Some guys cant stop talking about how good they are, and how deep their knowledge is with the tools/stack they are using. If he only knew he’s nothing compared to the other people I’ve worked with.",
            "points": "6 points",
            "children": [
              {
                "comment": "Something about this industry makes people arrogant. But worse, I've even met guys who were cruel. Taking every mistake or lack of knowledge like a sign of weakness and then preying on it.\n\nI've been lucky to work with some really nice folks too, it's like air to a drowning man",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "A great collegue from Argentina (for some reason, certain folks still think the best devs only come from SF and SV).\n\nTo this day, I'm still amazed at the esoteric, super niche issues he was able to debug and solve. I'm not the best at writing code but I'd say debugging is my best skill - primarily because of how much he taught me.\n\nBeyond that, his sense for front end architecture was impeccable. I was wet behind the ears when I started working with him, but his design patterns were like putting on glasses to see in 20/20 for the first time. He knew how to solve problems with architecture alone, when everyone else might have said we needed XYZ library or another backend service to do ABC. This guy showed me just how much more complicated front end work is than I thought, and is the reason why I roll my eyes when backend guys talk like front end is just about slapping together some janky React components.\n\nAbove all else, he was super humble and was always willing to jump on a debugging call if he had time; helpful almost to a fault. Miss that guy.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In my first role I was blessed to work within a small team of 4 exceptional devs. Each one had their own specific strengths and unique personality, that when combined, put out some excellent work. No egos or drama, everyone helped and supported each other to achieve the objective for the betterment of the team. On top of that, we also had a great manager who lead by example and backed his team 100%. Best job I ever had!",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Igor. Crazy Russian dude. Angry, argumentative, didn't get along with anyone, but wrote amazing code in a tenth of the time of anyone else, and it was solid.\n\nPlus, he hated chit-chat. We finished a 10-week job in 3. Code is still running.",
        "points": "4 points",
        "children": [
          {
            "comment": "Did we work with the same Igor? Dude was always angry but was deep down a nice dude once you got to know him",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This one somewhat reminds of Gilfoyle in Silicon Valley. Doesn't it? Lol.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "There was this Eastern European guy who emigrated to the US and worked at Microsoft. He wrote code like I couldn't even understand, and I don't mean it was hard to read or complicated.\n\nAnd he also talked about coding patterns I haven't even heard about.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Me!\n\n\"Looks in mirror\"\n\n\"Your the best!\"\n\n\"No, your the best!\"\n\nThis typically goes on for a good 15 minutes, really gets you going in the AM",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ras. He was a coach for World Skills Competition a couple of times. Smart as fuck. Always on my speed dial for help.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Sheriffderek at Perpetual Education. his knowledge of fundamentals of HTML, CSS, PHP and JavaScript are unparalleled. He’s a great teacher and person too",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The ones who are willing to compromise with each other.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I worked for a company which was as good as development gets. They were a magnet for great developers. A key was they financially rewarded productivity in a serious way. A true 10x developer could literally earn 10x.\n\nBut, they were entirely hard assed on burnout and working overtime. Not a little hardassed, but they would fire a developer they felt was working weekends, etc. They said, \"If you want to work weekends, work on your own projects.\"\n\nCode coverage was pushed as close to 100% for unit testing/integration testing and all branch conditionals.\n\nThis then created a culture of doing things right. Cutting corners, hacks, etc were generally avoided. Code reviews were fairly straightforward, do you have 100% code coverage? No, why not? This often ended a code review. The second part of a code review was, can I understand this code at a glance? If not, why not? The only excuses for code which couldn't be understood at a glance was if it were some math algo which was inherently hard, or if some required optimization was needed such as going ASM etc.\n\nThe coding rules in this company were otherwise fairly small. They didn't give a crap about spaces around == etc. Do what you want as long as it passed the \"understandable at a glance\". Most of the code was C++ at the time and going nuts with pointers or templates was a great way to break this rule. Thus, they didn't need rules about multiple dereferencing, pointer magic, etc.\n\nThe concept of managers was non-existant.\n\nWhat was amazing was productivity was far higher than any other company I've worked for before or since. With the massive code coverage, things just didn't break out of the blue. The high code coverage resulted in code which was clean and simple.\n\nLong story short, this company was filled with top developers for two reasons. They got paid extremely well and this culture of excellence ran through the company resulting in many great developers. Bad developers had extremely anemic paycheques and were quickly pushed out. What was cool was many of the \"bad\" developers were extremely capable developers. That is, they knew C++ to extreme levels, they could read ASM like the matrix movie, they could do hex math in their heads, etc. But they couldn't get their heads out of their asses and wrote great OOP templated nightmares which other developers couldn't comprehend. Their code would fail review after review after review. Whenever a few of them would show up at the same time, they might get away for a short while by approving each other's code but one of the founders would quickly put a stop to this. Seeing these hyper experts get the boot was almost as much of a learning experience as seeing the great developers work. So few lines of code doing so many features.\n\nThere was a web frontend which was just so clean. The product was all about generating SVGs and making them dance, so they had their own framework for this. It was maybe 5000 lines of code. The ramp up time for a new developer was basically a day. This last is now my simple test for company having a great process and codebase or a terrible one. How long for a new halfway decent developer to get ramped up? If it is months before they can contribute a basic feature, then there is a serious problem; 1 day is my gold standard now.\n\nOne cool thing which I was blown away at was how they mostly kept their codebase a monolith. Internally it was modular as hell, but they had two simple reasons for the monolith. It forced a coherency which kept people generally on the same page. But it was wildly intolerant of flaws; you just can't halfass your code into a monolith. Also, with a monolith your code simply had to stay inside its own module otherwise merging your code would be a nightmare as people were moving fast. You could checkout your code on Monday and by Wednesday you would merge and see 10 other merges had already happened.\n\nIf this company hadn't long ago been bought out and scattered to the four winds, I suspect they would be all over rust now.",
        "points": "1 point",
        "children": [
          {
            "comment": "Wow I'm totally biased, but I love hearing stories how great quality can actually make you faster in the long run. Have you been able to replicate this culture successfully elsewhere?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "They don't care about stacks. They are great UX designers and can do a design on a napkin.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "he actually reviewed my code and would make me re-write it",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I met 3 very competent developers and what stood out with especially 2 of them was that everything they do has a reasonable explanation, clear communication and that they were respectful and nice people, didn't question you differently if you had no experience and were always open for new ideas. They also sat down and could explain things to me in a very simple manner. They were the best communicators in the team without any bullshit and still being respectful and nice, without ever bragging about their knowledge, they only shared when necessary, unfortunately they were so far ahead of everyone else that they had to share a lot lol\n\nFrom these first 2 I learned the following:\n\n- How to organize a team and work together\n- How to properly, respectfully and clearly communicate in a team\n- How to break down tasks\n- How to ask questions if they are for the client or anyone else (matter of concern)\n- Everything should have a reason, even if in the end it was a stupid reason or not the optimal way, at least you had a logical reason and everyone can see that you tried and thought about it\n- How to break down code and code review efficiently\n- A lot more things just about efficiently working together, communicating and coding\n\n​\n\nThe third one I met is really bad at communicating and working in a team. He only ever had to work in his own codebase where he's the most knowledgable from the get go and everything is done how he wants to because he has no team. I worked with him for 6 months, then I had to quit because I couldn't take it anymore. At first he would always laugh at my questions for 5 minutes and insult me a few times because he thought it was funny and then he calmed down and explained it very nicely to me. But at some point it was just unbearable and I explained it to him, he didn't listen and thought I was the problem, so I quit. It's hard to say how good he is or was but I definitely saw some talent for how to approach tasks and break them down and that he had an amazing pattern recognition of code without reading the whole thing he knew structurally what would be wrong and where or what doesn't make sense, it was weird. But in the end it was also most of the times his own codebase and the stuff I committed he just changed the whole thing completely and it just had to be exactly what he imagined otherwise it was wrong. He was also very arrogant most of the time. Btw, he has high functioning autism. He also has a 40% job for like 5 years at this point where he earns as much as someone who works 100%, just because he writes efficient and optimized code. But they never found anyone to employ for a normal salary to take the project over because as he said \"they're all not good enough\". I on the other hand am just not sure if it's more because his code is, even though performant and secure, very overcomplicated for anyone else than him to understand. Btw., he doesn't write any documentation because as he says \"the code is the documentation, just read it\".\n\nWhat I learnt from him was:\n\n- How to approach a complex task and break it down into code bits.",
        "points": "3 points",
        "children": [
          {
            "comment": "These different types are simply working at different layers of the problem. The last person you mentioned sounds like a low-level person, in that he works very technically, with math and numbers, and hard cold steel. People who are good at math and physics, excellent at abstraction... the quintessential construction worker. They are like assassins. You give them a mission, and they complete it. No questions asked. They typically come from more poor backgrounds, where they had to fight to survive. They appear to be bad at communicating with their team, because they ARE the team. Autism definitely is related here. It's subtle but after you interact with enough of them you start to notice the patterns. Likely a relative deficit in social communication forces these people to become very self-sufficient and therefore really strong technically.\n\nThe other types are more high level in that they are more company-oriented, company meaning a group of people working together to accomplish a task. They follow the adage, \"If you want to go fast, go alone. If you want to go far, go together.\" Their main job is to figure out how to communicate to the first type the right way to help the company make money. They are more responsible for high level design concerns, and enveloping the construction worker into the rest of the engineering process.\n\nThe underpinning to both these types are that they need to be smart, because the types of problem they deal with are each important and difficult. But it's hard to only have one without the other. Kind of like the classic Jobs and Wozniak story.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Me :)",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Myself.",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Myself. I’m the GOAT 🐐",
        "points": "-10 points",
        "children": [
          {
            "comment": "Agree. I'm the best, too. 🐪",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "There was a spider in a corner of my room...",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "[deleted]",
        "points": "1 point",
        "children": [
          {
            "comment": "lmao",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The best ones I've worked with would always ask great questions that would show my flaws and funnel me into an awesome robust solution.\n\nThe secret sauce is they didn't show me how to write good code this one time, they showed me how to think like a great dev. Their questions still echo in my mind after years.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I just started as drupal developer,when boss found that this topic is way too much for me he bought me drupalizme tutorial...that is first time in my 6 years as developer. I cannot say he is the best,but i gonna stick here for a long time just becase his actions.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The best web developers I've worked with are back-end devs who don't do web development, but had to jump into the front end to implement something. They make sane choices and aren't jumping on every single bandwagon that comes along.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Met one at my current job. He's so good it makes me wonder every day why I chose this career as I'm clearly not doing the same job as he is.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "A childhood's friend of mine, Chris. Guy started to hack into an online portal's accounts just to steal some random coins to himself. Long story short, I've seen this guy progress for years, he passed everyone while in University and now is working in a goverment agency as full-stack dev. He's 24.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aua3ku",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aua3ku/host_website_from_your_computer_without_much/",
    "title": "Host website from your computer without much coding?",
    "points": null,
    "comments": [
      {
        "comment": "Netlify, Vercel.",
        "points": "19 points",
        "children": [
          {
            "comment": "Thanks, ill check it out!",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Github pages lets you host static websites for free, just upload your files to a github repo and then turn on pages from the repo settings. The repo needs to be set to public",
        "points": "15 points",
        "children": [
          {
            "comment": "I tried that earlier but i couldnt figure it out, ill try again!",
            "points": "1 point",
            "children": [
              {
                "comment": "This is definitely the easiest option if youre not doing anything fancy like a JS framework and just have static content",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You went straight to hosting your website as an onion????? How in the world did you skip straight to that, of all options",
        "points": "11 points",
        "children": [
          {
            "comment": "i mean, onion share is pretty easy to use, you just click a few buttons",
            "points": "0 points",
            "children": [
              {
                "comment": "It’s the same with the more “normal” options. You actually risk being investigated when you host on the onion, since the server is likely hosting illegal content as well, your site will show up when/if the server is confiscated as part of a federal investigation.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You might be interested in using Github Pages",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Don’t host from your computer. It’s not 1997 anymore.",
        "points": "16 points",
        "children": [
          {
            "comment": "I wasnt trying a long term thing, i just wanted to see if i could do it. Also, most the options i was looking at costed money or were very limited (except github pages, i might try that out)",
            "points": "1 point",
            "children": [
              {
                "comment": "Use vercel like someone else pointed out. They have a VERY generous free tier. I have like 20 projects hosted there for free",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Well it's way better than 97 now a lot of people have 1Gbit/s broadband and hardware is chip especially if it is a simple website and buying a domain and static IP does not cost much you can even use Dynamic DNS to not buy an IP.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "github pages. easy and free. if u buy a domain, you can link it. if u have a database or backend, just host it on the free tier of aws or watever. much luck.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As has been mentioned, you rarely want to do this. The main situation where you would is when you want to just quickly share something with people on your same local network. For that situation, if it's just html, these are a bunch of ways to quickly serve it up: https://gist.github.com/willurd/5720255 These are not intended for production use, and generally are insecure in that context.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Exposing your personal computer to the public internet like that isn’t a great idea. In addition, you likely have a dynamic IP assignment from your ISP which will complicate matters. Your ISP may even block certain incoming ports and, if this is home internet service, it may be a violation of your terms of service.\n\nFor hosting static pages, GitHub Pages is usually my go-to, and works well. Cloudflare also has a similar offering called Cloudflare Pages.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You really dont want to host from your home pc for a few reasons:\n\nISPs typically disallow this and you may have your service terminated\nevery website gets driveby scanned by attackers, looking for easy vulnerabilities. In this case, if anything were found, your personal computer and any computers and devices connected to it would be at risk.\nif youre only doing static content there are many free solutions that will do this for you",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All of these people are giving you answers in the cloud, which is the most straightforward way. If you're actually talking about hosting a website from your personal computer which it sounds like you might and having someone connect to a webserver on your PC, no one's answered that - no one does that much but it's certainly possible (I've done it a few times). If that's what you've got your heart set on, say so, and I may have some tips, otherwise cloud is solid bet.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "just forward the ports on the router to the webserver\n\nthen you can type in your external ip address and see your site",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You probably want to use nginx as a reverse proxy. What did you make your website with?",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "For hosting a website from your computer with minimal coding, consider using NGROK. It's user-friendly and doesn't require much command line work. NGROK allows you to expose your local server to the internet easily, providing a shareable link to access your website. Simply download NGROK, set it up with your account, and run it alongside your local server. This generates a URL you can share, making your website accessible without the complexity of server setup like Wamp. NGROK's clear documentation will guide you through the process smoothly.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Use blogger/Tumblr. Both are free",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Pick, choose, test, try:\n\nGitHub Pages\nNetlify\nVercel\nCloudflare Pages\n\nThis comes up every day and the answers are the same every day. How in the lord's name did you end up with an onion? You must have followed one hell of a sketchy tutorial to do that.\n\nThat said, make sure, whatever your website is trying to do, you comply with the Terms of Service of the platform you choose.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aua080",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aua080/guildtag/",
    "title": "GuildTag",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1au9r7g",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1au9r7g/react_for_my_learning_situation/",
    "title": "React for my learning situation",
    "points": null,
    "comments": [
      {
        "comment": "i mean it is the most used front-end framework in the world, even if you don't want to be hired it's still a very useful skill to have.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "When I built my first project with vanilla js I thought why do I need to learn react when I could do a lot with vanilla js? Then I tried it... Now I feel I don't want to go back to vanilla js 😅",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1au8hiv",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1au8hiv/what_actually_is_v8/",
    "title": "What actually is V8?",
    "points": null,
    "comments": [
      {
        "comment": "Other languages that don't have VM are compiled ahead of time - producing a binary. Therefore, they dont need VM.",
        "points": "52 points",
        "children": [
          {
            "comment": "V8: JavaScript\nJVM: Java\nPVM: Python",
            "points": "17 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Oh, ok. So are the terms VM and Engine basically interchangeable?",
            "points": "3 points",
            "children": [
              {
                "comment": "In this context yeah. But usually no. If you wrote a regex evaluator you might call it a regex engine. Virtual Machine is a specific and distinct concept though. I think V8 uses engine a lot because of the theme.",
                "points": "21 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I tend to think \"engine\" implies a bit more specificity than \"VM\" -- engine means somewhat less scope, less stuff being virtualized, etc. Look at this JVM spec for instance: https://en.wikipedia.org/wiki/Java_virtual_machine#/media/File:JvmSpec7.png, it virtualizes a lot of the functions of a processor and some memory and has something called an \"engine\" within it. And the JVM expects to be the world, as the major thing running, not embedded anywhere.\n\nThe V8 being an \"engine\" is likely due to its usually being slotted within a browser, and in fact it is an embeddable runtime (like Lua): https://v8.dev/docs/embed, and this is probably how Node uses it. Although I guess in the case of Lua and games, game engines are called so for a reason, maybe because they're simply expected to run your stuff and do certain IO for you but not virtualize anything per se, or handle the whole world.\n\nSo not totally interchangeable\n\nBut Occam's Razor -- I'd bet the creators called it an engine so that they could call it V8 so it sounds cool, and \"V8 = fast\"",
                "points": "8 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "No. An engine is a piece of software that can be used to make other software do powerful things. Think “game engine”.\n\nA virtual machine is an approach to implementing a language runtime where the programming language doesn’t compile to physical machine instructions, but instead into instructions for a virtual machine.\n\nThe JavaScript engine is a tool to make software (an engine) and it’s implemented as a virtual machine.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Not sure if that's a good comparison. A game engine doesn't let other software do powerful things, game engines usually are the powerful thing.\n\n\"Engine\" is just one of those overused words imo, where what it does depends entirely on context.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "A virtual machine is the abstract notion of a computing device that the language spec describes. It's basically the memory and execution model. So for JavaScript it's garbage collected, everything-is-an-object, and functions are call-by-value and the existence of non-reference-types (primitives).\n\nA JavaScript engine must implement a spec compliant VM, along with a core set of global objects (Array, Function, etc.) in order to be able to run your code.\n\nNote: Not all global functionality is part of the VM. In fact, if you compile the v8 executable (you download and compile v8 completely on its own) you'll find it's pretty bare bones and is missing a lot of stuff that you need to really be usable.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The Java \"Virtual Machine\" is more of a name than a description of what it actually is. \"Java runtime interpreter\" is what it really is. They are the part of the program that reads their respective input code and executes it line by line, doing little optimizations along way, managing the stack and the heap and threads or the event loop.\n\nIt's the program that runs the code.\n\nThe browser is the environment that V8 runs in that also renders the dom and such, and nodejs is the environment that v8 runs in that can talk to the host OS and such.",
        "points": "20 points",
        "children": [
          {
            "comment": "The java compiler compiles the java language into \"bytecode\" tough, and this \"bytecode\" has the same structure as a von-Neumann CPU. One could build hardware that is directly able to execute java byte code (and as far I recall in the original days of the java craze this has been experimented with). However tough, this Java-bytecode-machine is virtually implemented. So no \"virtual machine\" is actually true here.\n\nThis is different in javascript where the parser pases the abstract syntax tree to the interpreter/jit, skipping any generic bytecode generation.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It's a brand of Vegetable Juice.",
        "points": "34 points",
        "children": [
          {
            "comment": "i’ll be honest i can dig the spicy kind every once nd a while",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You drink it when you are leaning too hard in one direction",
            "points": "2 points",
            "children": [
              {
                "comment": "Yes, I saw that on TV so it has to be true.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Scrolled too far.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I thought it was a car engine",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "V8 is one JavaScript implementation. SpiderMonkey is another (for Firefox). Python does not have a separate name for it's default engine, it's Python. The whole argument in many comments of interpreter vs. Compiler vs Jit is beside the point. Analogoes C++ is the language, g++ or clang are names of implementations of it.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You have your compiled languages (C, C++) and you have your interpreted languages (JavaScript, Python). For compiled languages, you write source code (text files) and feed them to the compiler, a program that produces binary from source files, which you can then run on your computer. For interpreted languages, the interpreter just executes the commands from the source file. ... that said, the lines really are blurred. There are C++ interpreters nowadays, that execute C++ commands one by one, and JavaScript's WebAssembly is compiled. It's a crazy world out there.",
        "points": "4 points",
        "children": [
          {
            "comment": "JS isn't just interpreted anymore, it's JIT compiled. But my question is more around what part of NodeJS/browser runtime, the event loop, the callback queue, and the JIT compiler itself is actually part of V8. And what step the execution of javascript V8 is actually responsible for.",
            "points": "4 points",
            "children": [
              {
                "comment": "Ah, ok. Had to look up what Just In Time Compiled meant. Here's what I found in case someone else is wondering:\n\nGoogle's answer to \"what's the difference between interpreted and jit compiled?\":\n\nAn interpreter directly executes the source code. JIT compilation attempts to use the benefits of both. While the interpreted program is being run, the JIT compiler determines the most frequently used code and compiles it to machine code.\n\nReminds me of branch prediction. Seems the difference there is that branch prediction happens in hardware, while JIT compilation happens in software.\n\ntil...",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Webassembly is one thing, but C++ interpreters lmao! What are they used for?",
            "points": "2 points",
            "children": [
              {
                "comment": "https://root.cern/cling/\n\nYou can run C++ in a Jupyter Notebook.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "There is middle ground, for instance C# or Java is typically compiled to byte-code, which is lower-level. but is not a native binary.\n\nThen there's an engine/VM that is responsible for executing that byte-code. And it can decide to JIT the code for performance.\n\n\"typically\" because there are other options and complexities.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Java, JavaScript, Python, Ruby among others are interpreted (well strictly speaking Java is compiled and compiles to Java ByteCode which in turn is interpreted).\n\nTheir interpreters are the the JVM for Java, YARVM for Ruby, Cpython for Python and yup V8 for JavaScript.\n\nThey're not the only interpreters many of them more than one.\n\nYes V8 is a virtual machine, I guess it took the name \"engine\" from the previous J's interpreters that were not VMs but ...well engines ... they brought it as the \"new JS Engine\"",
        "points": "4 points",
        "children": [
          {
            "comment": "Ok cool, thanks. But if V8 is an interpreter, what is Ignition? To my understanding from reading the docs, Ignition is V8's interpreter, and Turbofan is V8's optimizing compiler. So those two together are essentially javascripts JIT. Am I just using 2 separate definitions for interpreter here? The more I look into this stuff the more confused I get.\n\n(https://v8.dev/docs/ignition) (https://v8.dev/docs/turbofan)",
            "points": "2 points",
            "children": [
              {
                "comment": "V8 is the whole thing. Ignition, TurboFan, etc are just names of components of V8.\n\nIgnition is a interpreter/compiler from AST to V8 bytecode, and then TurboFan is an optimizing compiler from V8 bytecode to machine code.\n\nOther parts of V8 are responsible for lexing and parsing JavaScript code to get the AST.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Ok, I think i'm starting to get it. So Ignition, Turbofan, and whatever else make up the javascript JIT. The javascript JIT is in V8, but V8 also has other stuff for lexing and parsing to an AST, that is ultimately passed to the JIT?",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Exactly that. V8 also contains the WASM runtime, which shares some parts with the JS parts. I think if V8 as a piece of software that takes JavaScript code (or wasm) and executes it. The environment the JS runs in also has to be provided from the outside.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "The best way to think of it is that V8 is the part of Google Chrome that handles JavaScript.\n\nYou can break that into more specificity: V8 is the part of Blink that handles JavaScript, Blink is the part of Chromium that handles web pages, Chromium is the open-source part of Google Chrome.\n\nIgnition and Turbofan (and Crankshaft and Sparkplug and Maglev) are all parts of V8 that actually run the code (Crankshaft is old and no longer exists in modern versions of V8, Maglev is the newest one). V8 has multiple ways to run JavaScript, so it can switch between them depending on which one is fastest.\n\nThe idea is that Ignition is an interpreter, so it can start instantly, but it doesn't run the code very fast. And Turbofan is a JIT, so it needs to compile everything before it can start, which takes some time, but after compiling it runs the code very fast. So by having both of them, V8 can use Ignition while Turbofan is still compiling, and switch over to Turbofan when it's ready, and so it gets both the benefits of fast startup and the benefits of fast running. (The other parts are optimizations for the in-between steps, starting later than Ignition but earlier than Turbofan, and running faster than Ignition but slower than Turbofan.)",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "It seems they're part of V8, according to this image they are AST and ByteCode parts\n\nhttps://media.geeksforgeeks.org/wp-content/uploads/20211002235143/workinggfg-768x576.png",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Yeah, so to my understanding, the javascript JIT, which is Ignition, Turbofan, and whatever else they have running under the hood is a part of V8. I'm just trying to figure out what else V8 does.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "At a glance it seems ignition is the frontend and turbofan the backend.\n\nIgnition + Turbofan + Torque + other pieces = V8\n\nSo V8 is the whole , Ignition and Turbofan are parts",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "For completeness, V8 is one JS engine, use by Chrome, Node, De no and others. There are other engines like JavaScriptCore used by Safari and Bun or SpiderMonkey used by Firefox. Those other might or might not be VMs, so the proper term is engine.\n\nV8 is responsible for all things JS( tokenize, convert into ByteCode, memory, event loop etc ) through the various components. Chrome ,Node, Debi etc handle other things like loading source into V8 and well rendering html and other stuff.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I think it’s called engine to fit the V8 theme.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "JVM is not virtual machine as like VirtualBox, it just a name.\nthey are normal interpreter like Zend Engine for PHP, or python.exe for python.\nV8 is same category with them. Basically native program that read non-machine code to do something.\n\nJIT meanwhile is a type of method / process, for example PHP also have JIT.",
        "points": "0 points",
        "children": [
          {
            "comment": "The JVM is actually a virtual CPU with virtual Assembler instructions, so its not just a name",
            "points": "0 points",
            "children": [
              {
                "comment": "sure, but it's still by definition an interpreter.\nvirtual cpu virtual assembler is just naming for sub-process/part of the interpreter.\nsee this wiki, \"virtual machine\" like JVM is one of interpreter strategies https://en.wikipedia.org/wiki/Interpreter_(computing)",
                "points": "0 points",
                "children": [
                  {
                    "comment": "It's complicated.. javac compiles the language into java \"bytecode\" which is from the design a stack CPU.. one could build hardware that would execute it directly, generally tough this virtual CPU is simulated, virtual machine is tough not a wrong name for this",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "JavaScript engine is the same as JavaScript interpreter it executes JavaScript code. The same as you have Python interpreter. VM on the other hand is a platform of running byte code compiled from different languages (it's not only Java, but e.g. Kotlin, Scala, or Clojure) . Its abstraction for real machine/computer that runs your programs.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "V8 is a C++ program that parses and interprets text files written in JS.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It is a delicious drink made from tomatoes and other vegetables. Refreshing, but somewhat high in sodium.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "https://developer.mozilla.org/en-US/docs/Web/JavaScript/JavaScript_technologies_overview#javascript_implementations\n\nhttps://v8.dev/",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you want to know exactly what it is, what it does, and how it works. I can provide you with documentation where all of this knowledge is covered. Send me message and I can email you the docs. Or guide to where you can find it it’s very interesting",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1au7jdl",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1au7jdl/code_and_coffee_discord_community/",
    "title": "Code and Coffee Discord Community",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1au79lk",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1au79lk/javascript_not_passing_data_to_python_backend/",
    "title": "Javascript not passing data to python backend",
    "points": null,
    "comments": [
      {
        "comment": "why are you using a websocket?",
        "points": "6 points",
        "children": [
          {
            "comment": "It is part of a bigger project to control a robot",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The first mistake was to paste code as text. Nasty. Use Gists or something",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Does anyone know what I am doing wrong?\n\nPretty much everything",
        "points": "4 points",
        "children": [
          {
            "comment": "Could you give examples?",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "ChatGPT can only get you so far",
        "points": "-3 points",
        "children": [
          {
            "comment": "What makes you think I am using chatgpt?",
            "points": "-3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1au60mr",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://macarthur.me/posts/curl-to-bash",
    "title": "Hold a Healthy Sense of Caution Whenever Running a curl|bash Command",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1au5rgu",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1au5rgu/how_to_get_and_store_users_input_from_a_form/",
    "title": "How to get and store users input from a form?",
    "points": null,
    "comments": [
      {
        "comment": "A quick and dirty way is to send yourself the form data via [mailto:youremail@email.com](mailto:youremail@email.com) but that really only works if your not expecting many submissions. A more common way is using a third party service or setup your own server/database. I also am currently building to solve this problem as well to avoid the whole server/database part",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Google Forms.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You'll need a backend (dynamic web site) for that. If you're using godaddy's free web site hosting (static web site), then I don't think you will be able to do this. I believe their free tier is pretty limited.\n\nIf you don't want to (or don't know how to) write code then you can use WordPress, which has a robustr plug-in ecosystem, for just about everything imaginable. There are plenty of sites that offer wordpress hosting if you don't want to host it yourself.\n\nThere's also sites that offer free dynamic web hosting, like netlify. AWS and Azure have free tiers that might work for you, although last I checked, most of the free services related to dynamic web sites were time limited (e.g. 1 year).",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "submit button, POST method on form.\n\nYou need to use redirect to prevent double data send when users press F5 (if you remember double post bug on forums then you know)",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m guessing you’re not using Wordpress but if you were ContactForm7 and Flamingo.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1au5mh4",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1au5mh4/friend_wants_to_use_godaddy_how_do_i_tell_them/",
    "title": "Friend wants to use GoDaddy, how do I tell them it's a terrible decision?",
    "points": null,
    "comments": [
      {
        "comment": "My friend says his other friend has used GoDaddy for years and \"they are fine\"\n\nAnd you know what?\n\nIt probably has been fine.\n\nI certainly wouldn't recommend GoDaddy, nor do I use it myself. But if they are just going to do something like register a domain and host a WordPress installation, it's going to do the job fine enough. It really isn't that big of a deal if your friend decides to go with them. Perhaps suggest an alternative that can do everything that they need.",
        "points": "300 points",
        "children": [
          {
            "comment": "It probably has been fine.\n\nUntil he wants to leave",
            "points": "44 points",
            "children": [
              {
                "comment": "I left pretty easily. It took like 48 hours of waiting for my domains to transfer, but they eventually did",
                "points": "52 points",
                "children": [
                  {
                    "comment": "GoDaddy has been my favorite platform to migrate clients away from- I’ve never had trouble or had them try to sell anything. They’ll email you several times if you let a plan/domain expire, though.\n\nand for domain transfers, once you’ve started the process on your end, you can go to the “Transfers Out” portal and accept it to transfer immediately.",
                    "points": "16 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I had to call, and they kept trying to sell more stuff to me.",
                    "points": "9 points",
                    "children": [
                      {
                        "comment": "That's not exclusive to GoDaddy though. Nor hosting providers in general. That's a normal, and expected part of ending a business relationship. They will do as much as allowed to try to sway that decision.",
                        "points": "17 points",
                        "children": [
                          {
                            "comment": "Google Domains let me go to Cloudflare without incident (perhaps b/c they were shutting down). [Knocks on wood] I'm hard pressed to think that Cloudflare is going to make me call a human being if I ever decided to leave...",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "I'm so disappointed Google Domains got killed(google being google again) :( Had all my domains there...",
                                "points": "5 points",
                                "children": [
                                  {
                                    "comment": "Cloudflare is my new Google. It'll probably get shitty in 5 or 10 years, but for now it's just fantastic.",
                                    "points": "6 points",
                                    "children": [],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "To be fair, they made .zip and .mov into domain extensions, so they kinda deserved it.",
                                    "points": "1 point",
                                    "children": [],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "I've been using namecheap since the early 2000's and have never had a problem...",
                                    "points": "0 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              },
                              {
                                "comment": "You're probably correct to speculate that. I personally have no frame of reference to it. Just pointing out I've experienced that from car sales to ISP services so I tend to not be surprised or bothered.",
                                "points": "2 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I just transferred two domains from godaddy to namecheap in 30 min. It's not nearly as bad anymore for small businesses or hobbiests.",
                "points": "17 points",
                "children": [
                  {
                    "comment": "It's not nearly as bad anymore\n\nWell that's good to hear.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "This is the big problem. Before I knew anything about how webdev worked, I had a few domains with GoDaddy. I left them because they charge extra to keep your information private but it was an enourmous pain in the ass to get away from them.\n\nWould never use them again.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I've transferred clients away from GoDaddy just fine. I have much bigger problems and issues with other companies, one in particular, that I won't name, but they effectively bought out the competition and is a giant pain in the ass. GoDaddy was a breeze compared to them.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "To be fair, this was almost a decade ago.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "There is also the case that criticism and competition improves a service or product over time. The PHP of 1994 was an abhorrent crap compared to PHP of 2024. Maybe GoDaddy must have improved also.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "lol godaddy is fine until it's not, then you're fucked.",
            "points": "-7 points",
            "children": [
              {
                "comment": "But that goes for literally everything.\n\nI'm not fan of GoDaddy, I don't use them, I advise my clients not to use them and explain why. But I wouldn't spend much time worrying about what my friend does. Let them know what you think and be done with it.",
                "points": "7 points",
                "children": [
                  {
                    "comment": "But that goes for literally everything.\n\nI guess I need to add more details to make my comment more logical. Normal services, if something goes wrong, you can get support/help. Godaddy is non-existent for the clients I've served over the years. That's what I meant by my comment.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Leave them alone and let them.\n\nIn the time I’ve been on Reddit, people on this site try way too hard to min-max their life or achieve the best “ideal” setup to the detriment of things that actually matter.\n\nTheir choice of hosting company isn’t a blocker. Not working directly on their core business is. If issues arise, they’ll ask for help and figure it out later.",
        "points": "197 points",
        "children": [
          {
            "comment": "I agree. I've been doing this stuff for almost 30 years and I've never used a registrar that changed my life and made me feel loyal. Most of the smaller ones have shit UIs and zero customer service. My clients that use GoDaddy have never been a problem for me at all. Easy Microsoft 365/Azure integration too.",
            "points": "24 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "If it's a friend who asked OP, \"hey, I'm thinking of getting a website set up, what service should I use?\" that's a little different from OP finding out their friends are using godaddy and making it their mission to convince them to get off it.\n\nAt the end of the day, companies just want things outside of their wheelhouse, like a website, to meet their needs.",
            "points": "10 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "very well written comment, this is out of context but this logic can be used in so many other aspects of life lol.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The only real problem I've personally had with godaddy is that their site is slow. Every page you go to takes literal seconds to load.",
        "points": "16 points",
        "children": [
          {
            "comment": "I have a couple of my flask based Webapps hosted on Godaddy and it's super fast. One of them gets several million connections a month. I prefer something I have more control over like in AWS/Azure but GoDaddy is definitely not slow. Maybe the bullshit CMS based services like WordPress but that shit is gonna be slow on any platform.",
            "points": "0 points",
            "children": [
              {
                "comment": "I'm saying I've found navigating their website slow. Not their hosting of websites abilities",
                "points": "6 points",
                "children": [
                  {
                    "comment": "Gotcha. Yeah, that shit is slow. At least getting to where you can make changes then it's not bad.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'm a noob. I use GD. I find that it worked well for me. I had never published anything before and the customer support have been really good helping me.\n\nWhere do all the pro's in this sub buy and host?",
        "points": "13 points",
        "children": [
          {
            "comment": "GoDaddy is just fine. I use AWS, Azure, PythonAnywhere, and GoDaddy Linux web hosting. They all fair up to similar performance for less complex web applications. GoDaddy is cheapest. Not sure what all the GoDaddy hate is about, their shit works just fine.",
            "points": "11 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "In term of shared hosting, it’s just expensive for what you get after the first year, compared to say Namecheap or Hetzner.\n\nBut at the end of the day their cheapest plan is still less than a Netflix subscription so not a big deal.\n\nI personally host my own website with NearlyFreeSpeech because I’m not hosting large amount of data and I don’t really need to talk to support to figure things out. My annual cost is like $5 or something silly like that.\n\nIf I want to host a large collection of photos I’d go with cheap shared hosting or better yet a Flickr account lol…",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Instead of showing why not Godaddy maybe try showing what you use and why. Maybe it will click for them.",
        "points": "10 points",
        "children": [
          {
            "comment": "This.\n\nIt took 100 'nothin burger' replies to get to this truth.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Eh, not a great company by any means, but for a non dev, 'they're fine' isn't really far off the mark.\n\nI wouldn't advise they use GD, but I also wouldn't be too invested in swaying their decision.",
        "points": "45 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Honestly, they're not nearly as bad as they used to be. I wouldn't make it my go-to recommendation, but they're competitive on price and the control panel/admin site is far less intrusive and upsell-y than in years past.",
        "points": "14 points",
        "children": [
          {
            "comment": "They have definitely stepped it up lately. Less marketing and competitive managed WordPress hosting. Better now than just a couple of years ago.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "They're probably fine for most people.",
        "points": "15 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "A SaaS company that I worked for had a client report an email as suspicious from our mail-chimp new letter. Good Daddy sent an email to our CTO that ended up in the junk folder. Good daddy decided to block our DNS after 2-4h without a response. Many of our clients who used our software couldn’t even log in. This ended up costing our clients millions of dollars because of the outage by the time they removed the block.\n\nThe very next day they started moving everything to route 53.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Speak in a language they understand: Money and risk.\n\nGodaddy deliberately makes maintaining a free SSL certificate difficult by not allowing things like certbot, so you'd need to manually update your certificate every 60 or 90 days or whatever. If you miss it and your certificate expires, users will get a big scary warning that makes it look like your site has malware, and really damages your brand. Why do they do this? Because they try to sell users certificates for something like $100/year. A certificate is not some physical good you obtain from someone else. It's generated code, just another step in the development process and one that doesn't take very long. But non-devs don't realize this, so they fall for the trick of thinking it's some product they need to buy.\n\nExplain this to them as an example of how godaddy has a practice of deceiving less knowledgeable people into buying products they don't need. They try to push all sorts of junk SEO tools and other products on people who don't know any better as well, but IMO, the certificate issue, and the fact that they deliberately take measures to prevent developers from being able to do it themselves, is the most egregious example.\n\nPersonally, I used godaddy for something like 15 years. I still have a couple of products through them I believe. But the certificate issue is what got me to finally move away from them for hosting. As for domains, I moved away because they're a few bucks cheaper on other services like namecheap.\n\nCurrently, I use digital ocean for my hosting and not only is a basic droplet (VPS) cheaper than godaddy, it seems to perform much better than all my godaddy hosted sites.\n\nimportant edit: I glossed over the part where you mention they aren't developers. Are they running their own websites, or paying a developer to build them? If the later, I would strongly recommend against godaddy. If the former, while they might get duped into paying for extra products they don't need, godaddy's probably the best at hand-holding for non-devs.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I would tell them \"When you're ready to move, let me know\"\n\nYou can't tell people to move when they think they know. Warn them and let them find out for themselves.\n\nI'll give you a worst case scenario: You coerce them into using a better host and they have a problem then say \"I should have used godaddy\". If they won't listen now, when they discover the problems for themselves then they'll never go back.",
        "points": "11 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Unfriend them, 😂",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nothing wrong with Godaddy as a registrar really. Been using them for over 20 years with various businesses.\n\nTruth is every 5-10 years or so the best host or registrar changes as companies grow and become more shitty/have data breaches/outages etc..",
        "points": "8 points",
        "children": [
          {
            "comment": "Nothing wrong with Godaddy as a registrar really.\n\nThe exact opposite actually. you should especially avoid them as a registrar. the stakes are the highest and they are the scummiest for registration. for hosting its still not good by any means but \"it's fine\"\n\nif you are already registered there you probably won't have any problems (other than price) as long as you keep the registration up. but there's a huge risk if anything ever goes wrong with your renew. so it's safer to move out when everything is working normally so you don't also have to deal with some other problem at the same time.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I mean - if your friend asks a plumber to fix a giant leak in their sewer system, do they question the plumber?\n\nHonestly - I'm in my 40's - I used to give this advice all the time, and people would ignore me, and then a year, or 2 years, or 5 years later, disaster would strike.\n\nI learned to just say \"yeah, remember how I gave that advice, and you ignored me? ... Pepperage farm remembers...\"",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What exactly is wrong with godaddy. They have a perfectly fine Linux hosting web server option that can get a python, PHP, or whatever web app up and running in minutes and can support a healthy number of connections, etc... they will be just fine on GoDaddy. Please explain what is wrong with Godaddy as an option.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just tell them to use cloudflare domains or namecheap. I've had no issues with either and you can say cloudflare domains just charges you with no middle man free",
        "points": "6 points",
        "children": [
          {
            "comment": "Huh, I'm currently on namecheap. Is it worth switching to cloudflare? Which one do you prefer?",
            "points": "0 points",
            "children": [
              {
                "comment": "I use both, get the domains cheap to start with on Namecheap and then get them at cost on Cloudflare with renewals.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Namecheap have great promotional pricing if you know how to manage everything yourself. After the initial period I'd transfer to an at cost provider.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I don't believe OP is referring to Godaddy domain hosting . Sounds more like web hosting services.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "What's wrong with GD?",
        "points": "6 points",
        "children": [
          {
            "comment": "Nothing big, really. They're far from the best option, but there's not a lot of difference between registrars.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Just by navigating on their interface you feel that there is something off.",
            "points": "-5 points",
            "children": [
              {
                "comment": "What a stupid comment, like what does that even mean?",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Politically incorrect. Me too'd by GoMommy.",
            "points": "-14 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I mean... send them this page and let them see for themselves? https://www.google.com/search?q=reddit+godaddy",
        "points": "7 points",
        "children": [
          {
            "comment": "Great answer! Thanks for a link I can share",
            "points": "-6 points",
            "children": [
              {
                "comment": "I don't believe some of you people on here are devs.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Yep.\n\nSmells like CSS and LINUX up in here...",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "\"Friend wants to buy a Honda Civic. How do I tell them to buy a Lamborghini instead.\"",
        "points": "6 points",
        "children": [
          {
            "comment": "In that metaphor, I would say if you're gonna buy a Honda Civic, you should at least buy it from a more trustworthy dealership that won't try to sell you the undercoat",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Domains are pretty much the same in quality and price no matter who you buy it from.\n\nThe difference here is who you buy it from.\n\nThink of it like borrowing money from the mob vs borrowing from a bank, both might turn out ok, but one carries a whole lot more risk than the other solely based on who you elected to do business with.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I mean, they're all the same price roughly. Godaddy just has sketchier business practices. It's more like \"Friend wants to buy a shitty screwdriver $8. How do I get him to buy this objectively higher quality screwdriver for the same price?\" Sure, you may be right that your screwdriver is better, but who cares? It's a screwdriver. They do the same thing.",
            "points": "1 point",
            "children": [
              {
                "comment": "Depends if they are going to use it once a year or to make a full house remodeling. I had screwdrivers' steel tops (don't know the word in English) made of cheap steel to crush in my hands. If they need a highly customised environment, that's one thing. If they need a landing page, that's another.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You can just tell them GoDaddy over charges and will make you pay for things you can get for free. That's why I don't use them. Money aside I'm not sure of there is any technical reasons.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Reason?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I guess it depends on the following questions:\n\nWhat do they need hosting for?\nWhat are your reasons against GoDaddy?\n\nIf your buddies just want to host a WordPress site to market their business or have a blog, GoDaddy is an okay option.\n\nIf they have some idea of building some large scale web application, they might need a better resource.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You can offer your advice as a professional, you can never make someone listen. Often the best thing is to provide advice and then stand back and watch.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All the experiences I've had with GoDaddy have been horrible, but I know some people have good experiences with them. I would never recommend anyone that company.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I use Porkbun, but recently I had to use GoDaddy for a premium domain, and initially it seemed like it improved but then the horrors began. They charged me $5k for a premium domain but an error prevented my order from going through and they had no record of the transaction. Luckily I was able to dispute the transaction with the payment provider, but it just reminded me how amateur GoDaddy seems to be. Don't trust them.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "When I am in this situation I tell them not to do it. I don't convince them, I don't send them articles about how horrible the service is, I don't link to hundreds of reddit threads about that exact topic.\n\nI just tell them: Don't do it! And I also tell them: If you do it, I can not help you with it. Not with the registration, not with the setup, not with managing it, not with connecting a domain to a server, not with unsubscribing services or deleting the account.\n\nBasically: do what you want, but as soon as GoDaddy is in the pipeline, I will not help with problems and I am sure as hell not responsible for anything that goes wrong.\n\nAnd if it's not friends but customers doing this, I would even have them sign a waivor, so that I am not responsible for uptime, function, or whatever.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Danica says they're good, so I think you're wrong!\n\n/s",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Say “eating boiled potatoes for the rest of your life is fine too, but you don’t wanna do that”",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My friend says his other friend has used GoDaddy for years and \"they are fine\"\n\nFind new friends.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "https://www.quora.com/Does-GoDaddy-have-the-right-to-suspend-my-domain\n\nThis link should explain better than anything else",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I had a number of things locked in with them and I had not time to move off but I have moved away from all the service offerings.\n\nIt is basically the modern AOL. It is appalling and no one should be using them and they should be loosing money hand over fist to enforce a buy out or change or for them to just be gone.\nTheir setup and system makes it very hard to move off the solution, it is a lot of hassle and they clearly rely on that to keep customers rather then making a product solution people enjoy.\n\n- They recently moved their email service (Again) to office365. The offering is less functional across all plans so you will find less email space for example as an issue.\n- Their web hosting just not kept up with the times and is just bad\n- Everyone else is cheaper in just about every product offering from them.\n- Their support calling you constantly the seem to think is them being good. I do mind a company checking on a customer, that is awesome but GoDaddy treat it as a means to try and upsell. Same with support, they try to offer an upgrade as the fix to actual problems as much as possible.\n\nYou can go on and on. They are just bad.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's ain't that deep bro 😂",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "[deleted]",
        "points": "1 point",
        "children": [
          {
            "comment": "Sometimes the mechanic is an idiot, or just hates a brand because of marketing.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Don’t.save your breath.",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "what is kinda annoying to me about cloudflare domains is the lack of ability to park them for resale",
        "points": "-5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why should I leave? My domain is up for renewal and cloudflare doesn’t support .ca and dnsimple is more expensive…",
        "points": "0 points",
        "children": [
          {
            "comment": "Just for info, dnsimple changed their pricing take a look\nat this blog https://blog.dnsimple.com/2023/10/pricing-updates/ or the pricing table https://dnsimple.com/pricing",
            "points": "0 points",
            "children": [
              {
                "comment": "Gotta love ✔️ “No SLA”. Lol",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Go daddy killed my daddy",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just say they dont offer free privacy protection and he will get bombared with sales/scam calls",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I use Namecheap for my site, https://lavacharts.com\n\nTheir admin panel is easy to use",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Tell them that if they go with Go Daddy, there will be absolutely zero support from you when problems arise.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Probably fine. It works for lots of people. I loathe this. We have dozens of clients in GoDaddy Pro. But it’s just easier sometimes to let them go do their thing. Save the grief.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Are there any good articles or stuff I can forward?\n\nThe search function of this sub.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Show him better/cheaper services.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Let them make their own mistakes. They’ll soon learn.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "ask them if they wanna be able to change their site in the future. if the answer is yes then GoDaddy is a bad idea. I've done multiple transfers off of it. Every single time the DNS propagation takes 3-5x longer than it should. Although easy for me, they obfuscate code made on the builder plans, so for most people it means a re-build of the codebase has to be done. For small sites this is easy but for bigger ones that can become a very large problem.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Friends don't let friends use godaddy",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You haven't specified which GoDaddy service. For DNS, it's been perfectly fine for me over the last 6 years managing 200+ domains. I wouldn't recommend it, and it wouldn't be my first choice, but I don't have anything bad to say about it either.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "OP, what’s wrong with GoDaddy?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I like Google domains",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "With your mouth",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's like using a pawn shop to do your banking.\n\nYou are going to eventually get screwed, and the whole experience will be distasteful and unpleasant. Also, most of your fellow customers are losers.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can you suggest few good alternatives here as well?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The cunts at GoDaddy keeps trying to put my domain up for sale at their other company's marketplace... My domain is not eve bought from them, fucking cunt company.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just to be clear, are they using GoDaddy’s hosting services? Because as a domain registrar, they are probably fine.\n\nAssuming they are using hosting services, I would say that the effort you’d need to expend to effectively communicate the transition lift relative to the cost savings and performance benefits aren’t worth it unless you have a financial stake in their work",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Don't use Godaddy and other EIG providers, beware with them. You better go elsewhere.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Let your friend use whatever they want.\n\nYou as a friend can provide advice/suggestion and that's it. All you can do is hope that later on when they want to become more technical/advanced or need access to more features they'll start looking at other things like vps/digital ocean/aws etc. Stop being a net nanny. We all here to learn and play you fucking narc. ban me see if i care.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I used go daddy as I didn’t know any better, built my website using the free trial then they removed it and deleted all record of it without telling me before the trial even expired\n\nI only found out when I directed a client to it. When I went on my domain is just an advert to buy it off them even though I own it through them…",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I used go daddy as I didn’t know any better, built my website using the free trial then they removed it and deleted all record of it without telling me before the trial even expired\n\nI only found out when I directed a client to it. When I went on my domain is just an advert to buy it off them even though I own it through them…",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Neither of them are developers. How do I say every web developer on earth would strongly recommend against GoDaddy??\n\nJust give them the reasons: 1) They charge you twice as much as some other registrars for renewals, 2) they rely on sleazy sales tactics, and 3) their support is bad.\n\nIf they're fine with paying $23/year for renewals, they're smart enough to not get the \"Full Domain Protection,\" and they like the support...then there's no issue.\n\nWhatever registrar you use doesn't really matter that much.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It doesn't matter all that much.\n\nDo they allow non developers to host a website fairly easy without much technical knowledge? Yes.\n\nIf they ever need to go a different route later they can.\n\nAs you can't really explain why it's a bad idea to them, then you clearly have no idea why it's a bad idea other than reconstituted bullshit from Reddit.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I use godaddy as domain registrar, site is hosted at Netlify. I'm gonna move to AWS or Azure when the promotion period ends in 8 months.\n\nWhat are other cheaper alternatives?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Huh that's crazy, I actually like GoDaddy personally and their VPS has been amazing compared to all the other sites I've tried.. guess it's just personal preference lol",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Try one.com",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I use them for domains and linode for hosting",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I would suggest saying “that’s a terrible decision” and give them a better option.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I wish I could say this post doesn’t make me sad but it does. My multimillion company I work for uses godaddy for certs and dns. It’s the absolute worst.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Where do you go personally?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have a few domains from them without issues. I host elsewhere though. What’s wrong with them?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just show these reddit comments",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I only used GoDaddy to buy domain names and point it to my hosting service and never had a problem with them. But never used their website/hosting options",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My friend says his other friend has used GoDaddy for years and \"they are fine\"\n\nThey wouldn't be in this position if they at least worked for some.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1au5jj9",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1au5jj9/lms_saas_development/",
    "title": "LMS SaaS Development",
    "points": null,
    "comments": [
      {
        "comment": "Yes, check it out, portal.thebullstrading.com. It's a LMS runs on Core PHP and MySQL (supports PostgreSQL as well). Tested with upto 10,000 Students currently. It's pretty possible to do such endeavours as a one man army. Some more features I added later included Face Unlock to stop Student's from sharing credentials.\n\nSo yes, you can do it. But incase you want any help, write me a DM. I'll spin you the code along with required modifications. Good luck 😊",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1au3vjf",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1au3vjf/looking_for_some_feedback_on_my_site_im/",
    "title": "Looking for some feedback on my site I'm developing with HTML, PYthon and Flask",
    "points": null,
    "comments": [
      {
        "comment": "Sounds like you're doing fine. You'll get better at it over time.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]