[
  {
    "id": "t3_1at1fr4",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://taig.medium.com/you-dont-need-a-static-site-generator-c3332c08d2f0",
    "title": "You don't need a static site generator",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1at1c5r",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1at1c5r/raw_code_vs_editor/",
    "title": "Raw code vs editor",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1at0u12",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://www.pcloadletter.dev/blog/agile/",
    "title": "Agile is a tainted term",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1at0ou8",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1at0ou8/showoff_saturday_armyclashio/",
    "title": "[Showoff Saturday]: Armyclash.io",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1at0iv7",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1at0iv7/new_to_web_dev_require_help/",
    "title": "New to web dev require help",
    "points": null,
    "comments": [
      {
        "comment": "their all pay to play\n\nthe free ones restrict your access to certain components, like wordpress cuts you off from the server itself in place of the wordpress interface\n\nI found the only way to learn and get it all done was to just give up on all those paths, too restricted and costly\n\nso I host from home, I forwarded the ports to my webserver which also holds my database and then gave it a domain name\n\nI can create and host as many sites as I want, I can come up with all sorts of db experiments and file upload stuff without any charges etc\n\nits very liberating and it makes the webserver and db a little more personal in that you can directly interface and explore with no penalty, and it gives real world experience rather than the sort of neutered one you'd get from most of the GUI's they put up to prevent you from actually accessing the server",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you want to avoid paying anything, use github page, cloudflare Pages or netlify for static hosting (html, js, css).\n\nFor your db, it will heavily depend on your specific needs. If you want to only use static hosting, you could use sqlite wasm : https://sqlite.org/wasm/doc/trunk/index.md",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Render and Vercel have good free tier options for hosting static sites and web services (a server).",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aszzeu",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://claritydev.net/blog/typescript-generics-guide",
    "title": "Using Generics In TypeScript: A Practical Guide",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1aszw2r",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://wirekat.com/the-history-of-http-and-the-stories-behind-status-codes/",
    "title": "The history of HTTP and the stories behind status codes",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1aszjgy",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aszjgy/i_added_ai_function_calling_feature_to_my_php/",
    "title": "I added AI function calling feature to my PHP framework",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1aszj8p",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://ahastack.dev",
    "title": "The AHA Stack",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1aszg6d",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aszg6d/how_and_where_to_store_backups/",
    "title": "How and where to store backups?",
    "points": null,
    "comments": [
      {
        "comment": "I'd assume you mean database backups from that context, so just frequent, E2E encrypted backups to a EU company (think hetzner storage boxes and the similar, maybe a local backup, your home etc) should be fine, following the 3-2-1 rule if possible.\n\nI like duplicacy for incremental, encrypted backups, CLI is free and probably fine for your usage.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asz5vd",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asz5vd/showoff_saturday_ai_assisted_date/",
    "title": "Showoff Saturday: AI assisted date pseudonymization? SaaS",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1asz2kd",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://i.redd.it/dn7gvxa0j4jc1.png",
    "title": "Code for my old project - a bookmaking website, for those who are looking for inspiration",
    "points": null,
    "comments": [
      {
        "comment": "Hello, today I decided to share the source code for my old project that allows you to bet on matches online.\n\nMaybe someone will like it and it will be a source of ideas for their project.\n\nGithub: https://github.com/Ryczko/KKbets-betting",
        "points": "3 points",
        "children": [
          {
            "comment": "Thank you!! But I never gamble with my money!! Only my life!",
            "points": "0 points",
            "children": [
              {
                "comment": "So you can gamble virtual money like in the project :)",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asyqtt",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://i.redd.it/sl7z10z4f4jc1.jpeg",
    "title": "CTA before fiiter",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1asy4ig",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asy4ig/where_does_google_get_these_titles_from/",
    "title": "Where does Google get these titles from?",
    "points": null,
    "comments": [
      {
        "comment": "They are called site name https://developers.google.com/search/docs/appearance/site-names[https://developers.google.com/search/docs/appearance/site-names](https://developers.google.com/search/docs/appearance/site-names), you can add schema to help define them",
        "points": "3 points",
        "children": [
          {
            "comment": "Thank you very much!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asy4d2",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://github.com/loreanvictor/pree",
    "title": "Pree: A simple tool to easily build no-build websites.",
    "points": null,
    "comments": [
      {
        "comment": "Some context: I wanted to write some docs but didn't want to use a framework or an overly complicated toolchain. Web components + ESM + modern CSS seems to almost resolve any need for a framework or a toolchain for such a project, though a few issues remained, mainly the fact that web components render on client side (imagine a web component that renders markdown, this means clients should download a markdown parser and wait for the markdown of the page to be parsed before they can see the content).\n\nSo I made a little tool, pree, whose main job is to pre-render web components (using declarative shadow DOM), so for making such static websites you could only use the web standards without sacrificing performance, UX or DX.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asxf3k",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asxf3k/all_of_my_website_traffic_source_is_coming_from/",
    "title": "All of my website traffic source is coming from http://statics.teams.cdn.office.net/",
    "points": null,
    "comments": [
      {
        "comment": "how many page visits are coming from there?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I imagine it's probably something like teams' crawlers for embeds in teams. Similar to discord but it'd still be odd if it's all from there",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asx6f7",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://bsort.app/",
    "title": "Prioritize requirements with bubble sort",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1aswz8h",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://codedocs.vercel.app",
    "title": "Let the Documentations be generated themselves! (Seeking early thoughts)",
    "points": null,
    "comments": [
      {
        "comment": "keen to see how this plays out! I think documentation is a very team centric thing  so I'm not sure if there's a \"correct\" way to build this.",
        "points": "1 point",
        "children": [
          {
            "comment": "Thanks for your input! I appreciate your thoughts. Indeed, it's mainly to make the team collaboration easier, because that's where documentation plays the game. Hope, it will boost your team soon enough too!",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "My early thoughts: What is this? What does it do? What type of documentation is it talking about? What languages / stacks does it handle?\n\nThere's no examples on this site. CI automatically generating documentation, particularly in the case of both internal and external API / application structure, based on code and comments, is nothing new.\n\nWhat's the USP over existing tools / services?\n\n\"How it works\" doesn't really describe in any useful way how this works.\n\n\"Try it out\" appears to just go to \"join the waitlist\", which again, does nothing to tell me how this works or what it actually does?\n\nAdditional useful information would include what technology it's based on, particularly is it based on LLM?\n\nIs this a service? Is it something I can run locally without sending information to / relying on external services?",
        "points": "0 points",
        "children": [
          {
            "comment": "Thanks for your input!\n\nMy another post on it may help with some of your basic questions: https://www.reddit.com/r/SideProject/comments/1asfcmp/make_your_code_documentations_to_be_generated/\n\nAnd yup! It's based on LLM under the hood. As mentioned in the landing page, you gotta integrate this into github and the rest is done by the tool itself. You don't need to manage, host or run anything locally. The product is not out yet, so it is little difficult to ensure further concrete information.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aswyr8",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aswyr8/domain_name_taken_shortly_after_pushing_to_github/",
    "title": "Domain name taken shortly after pushing to GitHub...",
    "points": null,
    "comments": [
      {
        "comment": "Sounds like your domain has been snipped. I would have registered the domain in advance before putting anything online and to the public.",
        "points": "109 points",
        "children": [
          {
            "comment": "Sucks. I guess I'll just \"app\" after the domain then",
            "points": "21 points",
            "children": [
              {
                "comment": "Did you consider using the .app top level domain instead?\n\nAlso what is currently running on the domain?",
                "points": "20 points",
                "children": [
                  {
                    "comment": "That's why I only search from within AWS console. They make a lot of money elsewhere that they don't need to pull stupid crap like this for their registrar services.",
                    "points": "15 points",
                    "children": [
                      {
                        "comment": "A good registrar like Porkbun or INWX will also not do these things to you.\n\nYou can also just use your shell to do these searches. It's not likely that someone will squad every unresolvable domain that someone looked up the DNS entries for.",
                        "points": "11 points",
                        "children": [
                          {
                            "comment": "Them getting multiple hits from different ips will raise an alarm though.",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "If they'd register every time someone send a url with a typoed Domain to a group chat, they'd probably waste a lot of money.\n\nBut I also strongly believe that if you're actively thinking about buying a domain that you'd be mad about not having later, you should buy it immediately. If you leave that topic for months or even years (have seen this multiple times in the past), then IMO it's on you if someone registers it.",
                                "points": "2 points",
                                "children": [
                                  {
                                    "comment": "I have the opposite problem. I come up with ideas, buy domains and then never work on ideas only to let the domains expire.\n\nFYI i just bought another one 2 days back. It's fairly short and interesting. Won't tell the exact one but it is equivalent to \"game.gg\"",
                                    "points": "4 points",
                                    "children": [
                                      {
                                        "comment": "I think the domain most often has to do with the name of the thing you're building. It's completely fine to shift naming back and start building an MVP first. After that you can think about the name and register the domain and so on.\n\nI also think that domains are not that expensive, so if I think a project will happen, I'll just buy the domain at risk of not using it, or I just run it as a subdomain at first.",
                                        "points": "2 points",
                                        "children": [
                                          {
                                            "comment": "I always figure that $10 or close to it is worth the tiny bit of incentive to work on something. (Not that its ever been enough to push anything over the edge for me but..)",
                                            "points": "1 point",
                                            "children": [],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Brb, purching a domain real quick",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Did you search for the domain previously? A lot of these shitty domain name sellers end up parking domains not immediately bought.",
        "points": "33 points",
        "children": [
          {
            "comment": "The whole industry is so sketchy",
            "points": "26 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Registrar no, but certainly bots do and add it to their ad campaign",
        "points": "13 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Absolutely everything that is public in internet is scraped. Don't make stuff public or at least don't leave any names or urls in repo.\n\nEven just code can be enough if your username can be linked to some relatively popular existing app.",
        "points": "5 points",
        "children": [
          {
            "comment": "Absolutely. To this day I get shady recruitment emails to a personal account that I used years back to commit some code.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why you write this math stuff there? What dates? I thought that ISO resorted to minus sign because the English had taken everything else?",
        "points": "-5 points",
        "children": [
          {
            "comment": "Come on, it takes having two neurons and a half to answer the dates he is mentioning.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aswcuf",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aswcuf/weird_traffic_only_visible_in_google_analytics/",
    "title": "Weird traffic only visible in Google Analytics",
    "points": null,
    "comments": [
      {
        "comment": "It's a common tactic known as referral spam:\n\nhttps://raventools.com/marketing-glossary/referral-spam/\n\nThese are not real visits, just a tool that makes fake requests to your Google Analytics with a referral value set to their own site.\n\nJust ignore. It's been going on since GA was launched.",
        "points": "3 points",
        "children": [
          {
            "comment": "ok, that can explain why no traces on the site, which is good. Thanks! I have seen referral spam before but usually only one or two analytic hits so this looked potentially worrisome. Taking a look to removing it from GA anywyas, thank you for the link.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Has anyone reported it to Google, in the hope they would clean this mess up? Considering that since GA4 it's not really possible any more to filter traffic. Afaics at least. In UA i had filters set up for all properties to throw away events without screen resolution and few other parameters. Worked 100% to avoid spam. Now it seems impossible to get rid of this noise.",
        "points": "",
        "children": [
          {
            "comment": "I did a couple of hours ago. My GA is facing the same issue but on my Cloudflare no trafic is detected so this is a GA issue",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I have also reported from the Send feedback section, not sure it is the correct place to report?",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Good morning. I too noticed a lot of traffic from this site to three of my published websites. That's how I found your question. The only thing that I know to do at this point is watch for a backlink in Google Search Console since my antivirus won't allow me to visit the site. It's not an answer, and I'd like to see what others write about this site.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is happening to me too! They seem to be on just one of the pages on my website. I want to block them but don´t know how to do that",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Any way to block it in GA or on my sites? Is very annoying.",
        "points": "0 points",
        "children": [
          {
            "comment": "I think yes, create a filter for all ghost referrals in your GA\n\nhow-to (french)",
            "points": "0 points",
            "children": [
              {
                "comment": "I have GA4",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Go to GA Console :\n\nIn Admin, under Data collection and modification, click Data streams.\nClick Web and then click a web data stream.\nIn the web stream details, click Configure tag settings (at the bottom).\nIn the Settings section, click Show all to see all available settings.\nClick List unwanted referrals.\nUnder Include referrals that match ANY of the following conditions:Conditions are evaluated using OR logic.\nChoose a match type.\nUnder Domain, enter the identifier for the domain you want to match (e.g. example.com).\nClick Add condition to add another domain.\nClick Save.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Based on the description this would not filter the spam measurements, only it would not be tagged as referral traffic. In UA it was easy to filter incoming data in terms of throwing away events. This seems to be sg else.\nStill looking for the right solution in GA4.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I've been getting referral spam from the same exact domain in the same exact way since yesterday. Very annoying. I've not found a way to remove that \"traffic\" from the GA4.",
        "points": "0 points",
        "children": [
          {
            "comment": "Same happening to one of our sites since yesterday. Sudden spike in traffic from Poland, turns out \"news.grets.store\" is spamming analytics.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I have too!!!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asw3oj",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://www.moaijobs.com/",
    "title": "I made a site for jobs in Artificial Intelligence",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1asvsb4",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asvsb4/solo_devs_how_do_you_edit_images/",
    "title": "solo devs, how do you edit images?",
    "points": null,
    "comments": [
      {
        "comment": "GIMP",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Id use gimp - If you build websites, you should deffo spend some time to learn how to use any image processor. For your task, however, it doesn't seem necessary? Just put your image in a div and style the div to whatever portrait shape you need?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Paid\naffinity software suit (adobe is better but I hate their pricing strategy)\nFree\nvector editing: Inkscape can convert your raster image in svg, fix perspective, etc. with results depending on the complexity of your logo. It has very powerful snapping features, vector effects, plugins, and the output is in actual svg format. Graphite (web app) is not as powerful as inkscape yet, but it should already be sufficient for your task (resizing a logo + separating layers), and you don't need to download anything. You could also use figma for simple vector manipulation, it's not a drawing software but it does the job.\nraster editing: photopea (free photoshop, web based. Not as complete as photoshop or gimp but sufficient for most tasks). For digital painting, use krita . If you need to fix the logo with some brush, krita brush engines are very very good.\n\nFor your particular task, if you don't have the logo in svg, I would use photopea. Otherwise, use inkscape.\n\nIf you need to remove a background, you can use one of the aforementioned tools, or go on a dedicated website like https://www.adobe.com/express/feature/image/remove-background\n\nRemember to optimise your assets, if it's svg use svgomg (integrated into inkscape or as a standalone) or a website like https://vecta.io/nano, otherwise use https://squoosh.app/\n\nIf your logo is in vector format, you can crop it with https://svgcrop.com/ to remove the blank spaces.\n\nIf you want to see more alternatives :\n\nhttps://alternativeto.net/software/adobe-photoshop/?license=free\nhttps://alternativeto.net/software/adobe-illustrator/?license=free",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Photoshop",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "For simple image editing tasks like adding a white rectangle to convert a landscape logo to portrait or separating foreground and background, you can use simpler software like Paint.NET, Adobe Photoshop Express, or even online tools like Canva or Pixlr. These tools are easier to use and don't require as much expertise as GIMP.\nhttps://jagmohankrishan.com/",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Photoshop if you have it, photopea.com if you don't.  Both are powerful pieces of software so you might have to look stuff up like you mentioned.  Gaining some some minor image editing skills can be pretty useful in web dev... you don't wanna be blocked when you just need some small tweaks. If it's a major project I usually leave it to a designer who will do a better job than I can.\n\nTaking out the background from an image can be deceptively difficult to do well, depending on the image.  There are a couple ai powered websites that might or might not do a good job at BG removal automatically, again depending on the image.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I used to use illustrator, but these days I find Figma to be very useful. Plus it’s free!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Inkscape for anything you can do with vectors. Otherwise gimp or similar.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My top picks:\n\nFor raster/pixel images: Krita.\n\nFor vector images: Inkscape.\n\nGimp is great but I find it difficult to use. The UX on Krita is leagues ahead. Krita is more targeted towards digital art than being a photoshop clone, but you can do most of the basic stuff you’d use Gimp or Photoshop for anyway.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asv6n6",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asv6n6/my_thoughts_on_cssinjs_tailwind_and_css_modules/",
    "title": "My thoughts on CSS-in-JS, Tailwind, and CSS Modules Scripts",
    "points": null,
    "comments": [
      {
        "comment": "A major drawback of adopting CSS in JS is the performance cost, which is sometimes more than noticeable.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This post does not make any sense",
        "points": "10 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Vue style tags within the component are great, regular css/sass scoped to the component.\n\nIDK why other frameworks don't do it similarly",
        "points": "2 points",
        "children": [
          {
            "comment": "What other frameworks? Angular and svelte are scoped. It's really only react 'based' frameworks...",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Such an elegant solution. I love keeping separate files for a component's CSS, and an unscoped, global stylesheet for reusable classes, like those for layout, typography and so on.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "keep your stuff as separated as possible. its easier to maintain. keep your css in css (or better yet, scss) files. Use minimal classes in your html.\n\nEach layer has its own purpose. Cross-polllution adds noise and code churn.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What I believe is happening in the Frontend realm in general is that, everyone wants to use something that is most performent, has the best DX, has the highest amount of abstraction in it. People fight over which is the best solution in each aspect of frontend development.\n\nHowever what I believe is that due to the advancements in Javascript, dynamic nature of it, its ability to have easy abstraction and a large community. We have come to a place where we have several good solutions, let it be in Frameworks, Libraries, State Management, Tooling etc.\n\nIt is only a matter of choosing the solution which suits your needs and familiarity.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All of those are bad for Stylish plugin.\n\nI'd actually prever to have generated classes over tailwind, but best is have non-generated class names that make sense. If they don't change too often.\n\nI sometimes have to use :has() selector and aria-labels for Stylish but not even all sites have them, and not all tags have good aria-labels anyway.\n\nMaybe it's good DX, but terrible UX for Stylish users.\n\nI wish CSS had :contains() that could select by text, it's only possible with JavaScript, that could solve many problems on sites that don't use sensible class names.\n\n(also it wouldn't be problem if ppl used both tailwind and sensible classes for Stylish users, if it was first class in html so it's easier to see)",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asulrl",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asulrl/newbie_needs_help_my_domain_email_stopped/",
    "title": "Newbie needs help- My domain email stopped receiving incoming emails",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1asub3w",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://starguardian.riotgames.com/en-us/timeline/",
    "title": "Reminds me of the \"all flash\" websites from back in the day.",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1asu6sw",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asu6sw/random_text_image_selected_via_a_folder_javascript/",
    "title": "Random text & image selected via a folder [JavaScript]",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1astvv7",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1astvv7/i_made_a_web_app_for_1v1_coding/",
    "title": "I made a web app for 1v1 coding",
    "points": null,
    "comments": [
      {
        "comment": "Just fyi, hamburger menu isn't working on mobile (Chrome, Android).",
        "points": "2 points",
        "children": [
          {
            "comment": "That’s the first challenge! OP couldn’t fix it so he pays $5 to get 2 devs to do it for him!",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'm not sure that giving money for invite is good business tactic.\n\nAnyway the idea of app is very good. I think it may become quite popular",
        "points": "0 points",
        "children": [
          {
            "comment": "Thanks\n\nAnd yeah the referrals thing is only temporary",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1astvbm",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://whatpwacando.today/",
    "title": "What PWA Can Do Today",
    "points": null,
    "comments": [
      {
        "comment": "TL;DR:\n\nAn interactive showcase demonstrating the capabilities of Progressive Web Apps (PWAs). It functions as a PWA itself, offering installation to a mobile device's homescreen or desktop.\n\nIf you don't like the summary, just downvote and I'll try to delete the comment eventually 👍",
        "points": "9 points",
        "children": [
          {
            "comment": "Your summary is great, thanks OP!",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Thanks for this. I doubted PWAs till today, thought they were dead and just pushed by a niche because well… they can?\n\nBut when looking at the capabilities of a real PWA and what the browser API allows the app to do, it’s crazy!",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "very neat site. thanks",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not in the EU unfortunately.",
        "points": "-9 points",
        "children": [
          {
            "comment": "EU iPhones\n\nAndroid is fine",
            "points": "16 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Almost every page says \"This feature is not (yet) supported on your device\". Could this be due to Android and/or Firefox? I'm running Android 13 under LineageOS 🤔",
        "points": "0 points",
        "children": [
          {
            "comment": "As far as i know PWA in Firefox are broken\n\nhttps://connect.mozilla.org/t5/ideas/bring-back-pwa-progressive-web-apps/idi-p/35",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The other features are great but I'm pretty happy with just PWA standalone mode and Add to Homescreen",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Currently, PWAs cannot be installed in Firefox. Please choose another browser like Safari, Chrome or Edge.\n\nI ain't going back to Chrome, nor Edge.\n\nI'll just have to wait.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1astuqg",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1astuqg/can_you_download_songs_from_spotify_onto_your/",
    "title": "Can you download songs from spotify onto your computer?",
    "points": null,
    "comments": [
      {
        "comment": "Arr matey, I be at a loss for words. Ye need to ponder if thar be other treasures ye seek. I be racking me brain fer any solutions that might suit ye needs. Arrr! 🏴‍☠️🏴‍☠️🏴‍☠️",
        "points": "11 points",
        "children": [
          {
            "comment": "Are you impersonating Captain [famous-pirate-fname]?",
            "points": "0 points",
            "children": [
              {
                "comment": "Perhaps you should visit a certain Bay",
                "points": "1 point",
                "children": [
                  {
                    "comment": "I tried sarge. This is the track I'm looking for ➡️https://i.imgur.com/wQLYUfs.jpg",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Hold on, is that brain.fm? Thats not Spotify and those are hand-crafted based on science so not really spread everywhere \n\nEdit: based on science, not ai generated",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "Yep that's a screenshot of brainfm, Are they really AI generated? Either way can they be downloaded? 😩",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "Oh whoops just double checked, its not AI generated, but they do some science and make it based on the science.\n\nBasing it off of that its most likely proprietary, so may be carefully kept/ not distributed everywhere.",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "There's an open source YouTube music app you can download from github and install which let's you listen to all music with no ads, and you can download them too. Highly recommend.",
        "points": "2 points",
        "children": [
          {
            "comment": "No I do have spotify premium I just wanted to understand if you could download the audio file from browser dev tools or by any means.",
            "points": "-2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I use Brain.fm, it had been great, been using it for almost a year now, but I notice I hear a lot of repeats lately.",
        "points": "1 point",
        "children": [
          {
            "comment": "Do you think there's anyway to download those audio tracks?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "https://github.com/Shabinder/SpotiFlyer check this out.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Noteburner gets you .wav, low license cost for what it is",
        "points": "0 points",
        "children": [
          {
            "comment": "No I just wanted to see if I could download it myself so I can use the same way to download tracks from brain(dot)fm.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I've seen browser plugin and a python program like this for youtube, so it should be possible with any streaming service, video or audio.\n\nIf you can find open-source you can look into code and use that for your program (browser plugins are open source)",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asswm4",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asswm4/is_there_any_way_to_detect_reddits_mode_in_js/",
    "title": "is there any way to detect reddit's mode in JS?",
    "points": null,
    "comments": [
      {
        "comment": "I mean, if you inspect the reddit page, the first line is:\n\n<html lang=\"en-US\" class=\"theme-beta theme-dark\">\n\nSo, I'd say, yea, you can use the classes found on the html element to determine the current theme.",
        "points": "2 points",
        "children": [
          {
            "comment": "Well. It doesn't work for reason.\nedit: I found the solution and I'm a certified idiot.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1assbne",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1assbne/how_to_improve_a_design/",
    "title": "How to improve a design ?",
    "points": null,
    "comments": [
      {
        "comment": "Why not hire a graphic designer? That's exactly the kind of work they do.",
        "points": "2 points",
        "children": [
          {
            "comment": "That's definitely an option thanks",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "On YouTube there is a video on 60-30-10 color rule which may help you. Here is the video",
        "points": "1 point",
        "children": [
          {
            "comment": "I've seen it thank you! I did learn some things from it, but not enough XD",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Well. You’re not a designer. So you shouldn’t feel bad that you have a bad design. There’s no “aha!” Moment you will have to turn it around. Theres no magic piece of advice that will make it look prefect. Just because we’re developers doesn’t mean we should also expect ourselves to be the designers. Work with a designer. It will change your life.",
        "points": "1 point",
        "children": [
          {
            "comment": "Hmm, interesting. I'm trying to do it all myself, but you are right I'm not a designer and becoming a good one is not something that can be learned overnight. Do you have any website recommendations on were go look for designers ? Thanks!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If have problems with color (I sure do too) i would suggest to use one of those color palette generators/sites to get a palette with colors that fit together, makes life easier.\n\nJust google it, there are several ones available.\n\nWould also recommend to use CSS variables for the colors as it makes it easy to test different alternatives by just do the change at one place.",
        "points": "1 point",
        "children": [
          {
            "comment": "Interesting, I will will into that. Thank you",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I just see a login page. And as a designer, I say it's pretty good.",
        "points": "1 point",
        "children": [
          {
            "comment": "Thanks! But the login page is just a default tailwindui component. That's going to need to go lol",
            "points": "0 points",
            "children": [
              {
                "comment": "Okay, here are a few general suggestions:\n1. Have Consistency.\n1a. Consistency in Fonts and Type scale.\n1b. Consistency in the use of colors.\n2. Use Design System, You can look it up on Figma Community(No need for login)\n3. Less is More. Keep things Simple. Functionality > Form/Design.\n\nTalk to a Designer, If you want, I can give you 30-45 mins.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "It's difficult for me to combine everything and have something that looks good XD. I'm going to need to go through a lot of learning before that. Thank you!",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "That is difficult for anyone. First build a scrappy but functional version. Once you have everything on the screen, break that into sections, columns, and rows. IDK if I am making any sense. But I hope in the end you build something that you are proud of.\n\nGood Luck!",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "That's what I'm doing for now. Thank you so much!",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Hey you can check out mobbin.com for UI references. Great resource targeted at designers, but I think it'll benefit you as well!",
        "points": "1 point",
        "children": [
          {
            "comment": "Will check them out thank you!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Use a framework like tailwind?",
        "points": "0 points",
        "children": [
          {
            "comment": "Yes it's awesome! Thats what I'm using thank you.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asrgtj",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asrgtj/what_should_i_use_for_an_appointment_system/",
    "title": "What should i use for an appointment system?",
    "points": null,
    "comments": [
      {
        "comment": "This can be a pretty large effort to write yourself if you’re not very experienced.\n\nAs an alternative, I think you can do this relatively easily with a Wix site and the booking plugin. I would recommend looking into this approach until you have more experience.",
        "points": "2 points",
        "children": [
          {
            "comment": "I haven't heard of wix so I'll look into it. And i don't mind if it's large, my main purpose for it is to learn, i just set this as my goal since it's something someone actually needs.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asr1c4",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asr1c4/oc_i_create_a_beautiful_clone_of_randomorg/",
    "title": "[OC] I create a beautiful clone of random.org",
    "points": null,
    "comments": [
      {
        "comment": "how do you create that dashboard? Is that use react?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asqa7r",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asqa7r/what_hostingdomain_site_should_i_use_for_my/",
    "title": "What hosting/domain site should I use for my portfolio website?",
    "points": null,
    "comments": [
      {
        "comment": "Hi. Depends on your technology stack. If you have a static site, use Cloudflare - it's free and gives basic analytics (visitors, pageviews, countries, etc) - Github Pages doesn't have it.\n\nIf you have a NodeJS backend (NextJs or some kind of apis) see on Vercel - they have a free plan too.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Cloudflare pages",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "https://hostinger.com",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'd use (I do use) Github, then it's linked directly to your Github account which lots of places will also want to see.\n\nUnless you need more functionality, but for a portfolio, tracking data, and such doesn't really seem all that important.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Buy a custom domain in your name, host on GitHub pages, put cloudflare CDN in front of it.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As far I know the portfolio doesn't contain much backend, so you can go for Vercel or Netlify without any doubt.\n\nCorrect me if I am wrong.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I like namecheap.com for domain purchasing. Vercel for hosting.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Unstoppabledomains.com",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Assuming it’s a static site, Netlify; the free tier can connect to GitHub for automatic deploys on push to main and preview deploys for every PR. They also have form functionality, so you can add a contact form and they’ll handle forwarding you the responses after some mild spam filtering.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asomev",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://docs.google.com/spreadsheets/d/1hzP8j7matoUiJ15N-RhsL5Dmig8_E3aP/edit#gid=1377915986",
    "title": "Most popular interview questions of all time - good luck everyone",
    "points": null,
    "comments": [
      {
        "comment": "This is dope. Thanks for the resource and yes good luck everyone",
        "points": "8 points",
        "children": [
          {
            "comment": "Happy to help,",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "when it comes to web development, do web developers get asked LeetCode?",
        "points": "3 points",
        "children": [
          {
            "comment": "From all my interviews, I never had to do one",
            "points": "10 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I wish I was blessed like all of you, every interview I have attempted is 1 easy mixed with a couple of mids or hards, hopefully I don’t lose my job now because I don’t want to return to study leetcode again I forgot everything after several years of not doing anything related to that",
            "points": "3 points",
            "children": [
              {
                "comment": "Im in this boat, Just got laid off and it'd impossible to get back in. Too hard",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It depends on what types of jobs you’re applying to. Most of the bigger tech companies will ask some sort of leetcode. Smaller ones ask less often.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "For my recent role, I got asked one easy LC and some web dev specific questions",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I applied to jobs in Seattle for a while and every single company did.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I was asked some basic JavaScript problem but not a brain teaser. It was more like let’s make sure you know how to work with JavaScript",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "In 13 years of web development, I have never once had to use leet code in the real world.",
            "points": "2 points",
            "children": [
              {
                "comment": "I assume they mean in interviews",
                "points": "3 points",
                "children": [
                  {
                    "comment": "Yeah, probably. Never had to do any in interviews either!",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Thanks so much 👍",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"Best Time To Buy And Sell Stock\" 🤣\n\nI'm half-surprised it's not #1.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Thanks for the help and it is gonna be very useful for me!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aso6bu",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1aso6bu/wordpress_w_elementor_or_shopify_for_affiliate/",
    "title": "Wordpress w/ Elementor or Shopify for Affiliate Marketing Blog?",
    "points": null,
    "comments": [
      {
        "comment": "For your affiliate marketing blog advising PC gaming novices on the best PCs to buy, WordPress with Elementor is likely a better choice. WordPress offers more flexibility and customization options, making it easier to create content-rich blogs and integrate affiliate links seamlessly. Additionally, WordPress allows you to easily transition to an e-commerce site in the future if you decide to sell PCs directly, while still maintaining your existing content and SEO efforts. Shopify is more geared towards e-commerce out of the box, but it may be less flexible for content creation and customization compared to WordPress.\n\nhttps://jagmohankrishan.com/wordpress-development-services-in-india-jagmohan-krishan/",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Technically you can do both.\n\nWebsite . Com shop. website . Com\n\nCan both be different sites / apps.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Elementor is trash.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asnxva",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://open-web-advocacy.org/blog/its-official-apple-kills-web-apps-in-the-eu/",
    "title": "It’s Official, Apple Kills Web Apps in the EU - Open Web Advocacy",
    "points": null,
    "comments": [
      {
        "comment": "This: https://www.reddit.com/r/Futurology/comments/1amp65h/enshittification_is_coming_for_absolutely/",
        "points": "19 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We could easily fight back by making websites \"not supported on safari please upgrade your browser\" notices like we used to do for old internet explorer.\n\nOr even funnier would be to detect safari and then do random glitching. So it looked like defective iphones.",
        "points": "40 points",
        "children": [
          {
            "comment": "Need to wait until other browsers are available on iOS. Users will typically blame the website rather than Apple.",
            "points": "5 points",
            "children": [
              {
                "comment": "That's why we should make it look like ios is glitching and do it across multiple websites 😂",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I would if it weren't for the insane market penetration of the iphone and ipad 🤷‍♂️",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Vote with your wallet",
        "points": "16 points",
        "children": [
          {
            "comment": "Android and Google are also pretty shitty, for different reasons.. There are no good alternatives. On laptops/desktop we at least have Linux, but for smartphones, we only have systems designed to invade our privacy and steal our time and attention. Linux smartphone is still pretty much very alpha, and a long way from being usable for most people.",
            "points": "-10 points",
            "children": [
              {
                "comment": "You can still pick a manufacturer that lets you unlock the bootloader and get some custom roms running without any Google whatsoever. Still android tho.",
                "points": "11 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Yeah I wanted a Pinephone for a long time, but it's an expensive experiment, not a daily driver phone. Purism is too expensive. Need a billion $ company to make a true Linux phone. Maybe ubuntu could have another go.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "I think it just need time. Look at the Linux desktop, it is absolutely useable. Sure most people don't use it, but it doesn't matter. For those who do, it works very well, compared to just 10-15 years ago. In 10 years time, Linux smartphone is probably usable in the same way.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Linux smartphones are not hard to put together, especially since tons of phones today are ARM-based - there are already different Linux flavours for it.\n\nThe problem is the ecosystem, getting people interested in and getting developers to develop for it - and you have to get all these pretty much at the same time. Even Microsoft failed to break into this world: if you have no users nobody will develop for your phones and if nobody develops for your phones then you won't have users.\n\nNobody buys smartphones today to use them as a telephone anymore.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "It's not different from the desktop Linux. And there are plenty of apps on Linux desktop. And just because it's arm-based does not make it easy. There are still a lot of driver problems with Linux-phones.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I just have. Was about to break piggy for a VisionPro.\n\nFollowing this, I won’t wait for it in the UK. Just bought a Quest 3 as it supports PC VR.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Help us fight back, follow the link! It's now or never",
        "points": "60 points",
        "children": [
          {
            "comment": "Lol",
            "points": "-26 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I am currently developing a pwa game that heavily relies on the Fullscreen of the device. This will affect my whole distribution for iOS Mobile. No alternative by the moment.",
        "points": "4 points",
        "children": [
          {
            "comment": "Forcing you to publish on their app store is exactly the point of Apple's long battle against web technology.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Did you submit to the survey?",
            "points": "0 points",
            "children": [
              {
                "comment": "Yeahp kittensandmushrooms.com",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "As 3rd party browsers will be allowed now with full engine support, it might be possible that they could provide a workaround",
            "points": "0 points",
            "children": [
              {
                "comment": "Full engine support means they will expose the Fullscreen API? They don't do it even with safari over WebKit.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The irony here is that Apple was originally one of the first (or the first?) to support web apps and modern web standards on mobiles (while everyone else were at best fucking around with Flash and Java applets).\n\nThe initial idea and I believe Jobs’ vision was that all third party apps would be web based, but then they released the App Store and here we are.",
        "points": "3 points",
        "children": [
          {
            "comment": "Pretty much. One of the first. Great implementation. The Safari team were one of the webs pioneers.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Apple are again showing themselves as a beacon of innovation by holding back progress and leveraging their customers as hostages trying to extort the rest of the world.\n\nThis company just needs to die.\n\nGuess this is gonna be served to a lot of users going foward:\n\nWe are sorry, the fruit cult Apple has blocked the device you purchased from them from accessing the features required for this application to work, please contact Apple support for more information, or upgrade to a better operating system.\n\nThis is an Apple problem, only Apple can solve it. Please refrain from contacting <Application> support about this issue.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "A very disappointing development. It almost seemed like Apple was getting ready to embrace PWAs for consumers on the Mac platform when they added the ability to easily add any website as an “app” with its own window and dock shortcut in the last macOS update, then they do shit like this to totally counteract that..",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What happens to the iOS apps that uses web view from WebKit from apple in their iOS apps?",
        "points": "1 point",
        "children": [
          {
            "comment": "Nothing stays as is. We’ve always said browser engine requirement shouldn’t apply to the system provided WebView.",
            "points": "-13 points",
            "children": [
              {
                "comment": "Nothing stays as is.\n\nThis is why punctuation is important.\n\nYou meant the exact opposite of what you actually typed.",
                "points": "28 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I‘m being slow. Do they stop working or not?",
                "points": "3 points",
                "children": [
                  {
                    "comment": "Yeah webviews will continue to work as is",
                    "points": "-4 points",
                    "children": [
                      {
                        "comment": "Oh i see. Thanks",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Do they support chrome web browser? Then PWA must be supported right?\n\nSo , people will just be forced to stop using Safari.\n\nCorrect me, if I am wrong...",
        "points": "-1 points",
        "children": [
          {
            "comment": "All browsers on iOS are essentially reskinned versions of Safari because of Apple’s rules.",
            "points": "90 points",
            "children": [
              {
                "comment": "Humm.. I didn't know it.\n\nSo chrome in Safari doesn't run on chromium engine ?",
                "points": "27 points",
                "children": [
                  {
                    "comment": "Right",
                    "points": "39 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Yes, it doesn't.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Like he said, nope.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Was that not something they were forced to change in the future?",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Yes. Article 5(7) of the DMA",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "So would PWA work through chrome then?",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "PWAs depend on two things: support from the OS and support from the browser.\n\nApple are breaking OS support for PWAs right now specifically so when they're forced to open their platform up to other browsers, those browsers won't be able to offer PWA support themselves.",
                            "points": "16 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "No because it requires OS level features that Apple has not provided … the first battle is to stop Apple breaking existing apps, the second is to support web apps via other browser engines",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I've used a Galaxy and an iPhone and my god Apple makes everything difficult and complicated needlessly. Never using an iPhone again.",
                "points": "9 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "They don't currently support actual chrome, as already said, and they don't have to fully support all of Chromes features. The new EU laws just make it so Apple has to allow other developers to have access to the same tools that Apple has access to. So, instead of supporting it on other browsers too, Apple just removed it from Safari too.",
            "points": "6 points",
            "children": [
              {
                "comment": "But this change is to EU users only right? Don't apply to the rest of the country... I guess",
                "points": "-5 points",
                "children": [
                  {
                    "comment": "\"rest of the country\"?",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "I mean India, US , Australia etc..",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "That's the world",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "Yes, the same world where not everyone is a native english speaker. Back off.",
                                "points": "-3 points",
                                "children": [
                                  {
                                    "comment": "And now they know more",
                                    "points": "-2 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "is this because of some store restriction or if theoretically chromium would publish the xproj you could compile and build your own chromium directly on the device ?",
            "points": "1 point",
            "children": [
              {
                "comment": "So Apple is becoming very rigid and high restricted system as much as possible.\n\nWill this kind of ecosystem survive for long ?",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Becoming? Brother it's been this way for years. For nearly as long as I can remember. Apple is one of the most profitable companies in the world ain't no way they're changing their tune now and I guarantee you the average Apple device user doesn't give a fuck about this change at all as utterly frustrating as that is. In fact I would venture a guess that the vast majority will be so unaffected by this they won't even know. All of that has been part of the calculus Apple did when making this decision.",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "Unfortunately Apple users don't know they've been missing good PWA support for years already.\n\nIt's like redditors don't miss their girlfriends because they never went outside and met them, so they just make do with anime figurines and sexy pillows. Apple users live in ignorance in a gated community while everyone else gets to travel.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "They will have to support other engines starting at the same update where they will disable PWA. They just won’t support PWA stuff for those other engines, many features will be simply disabled",
            "points": "-1 points",
            "children": [
              {
                "comment": "I want the apple's market penetration share to die.. PWAs are better implementations than apps",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Commission move next. They should fucking skin them alive. Anything less than billions in fines is a betrayal.",
        "points": "0 points",
        "children": [
          {
            "comment": "Not disagreeing",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Selectively quoting to remove Apple's justification, whether you agree with it or not, it's pretty poor form. The way OWA have worded this, you could be forgiven for thinking Apple were claiming the DMA directly requires this. That's not what they're saying\n\nAddressing the complex security and privacy concerns associated with web apps using alternative browser engines would require building an entirely new integration architecture that does not currently exist in iOS and was not practical to undertake given the other demands of the DMA and the very low user adoption of Home Screen web apps. And so, to comply with the DMA’s requirements, we had to remove the Home Screen web apps feature in the EU.",
        "points": "-1 points",
        "children": [
          {
            "comment": "Apple’s justification is nonsense though. The fact they haven’t built some framework to allow web apps to be powered by other browser engines does not mean they then have to go remove the existing functionality.\n\nApple is implying they need to remove the functionality because of the DMA, they state it directly.",
            "points": "-1 points",
            "children": [
              {
                "comment": "The DMA mandates equality among browser engines. No, they can't just leave the existing functionality, it's only available for WebKit. Yes, that is because of the DMA.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Well. That’s not entirely accurate. Apple can easily leave the functionality there and announce a path forward to support web apps with third party browsers. 6(7) does not require them to remove any functionality, only make best efforts to provide it to third parties when asked.\n\nApple is choosing this path because they see web apps as a threat. Not because it’s the only option.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "So leave in a load of functionality that is baked into the OS and commit themselves to have to open it all up. Must have been a tempting option\n\nEven if you were planning to do it anyway, anyone with an ounce of sense to choose the path that lets you do it on your own terms.",
                        "points": "",
                        "children": [
                          {
                            "comment": "Exactly. So Apple is choosing to screw web apps. No one is making them do it.",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "“kills web apps” that is an exaggeration, they’re removing the ability to add website shortcuts to your homescreen, they’re definitely not “killing” web apps\n\nIm not sure why people are making huge fuss about this, the majority of people didn’t even use this add to home screen feature in safari, and even if they did they can still do so using the apple “Shortcuts” app instead of through safari.",
        "points": "-118 points",
        "children": [
          {
            "comment": "As someone who worked with PWA - this is a great feature and the closest thing to have an app without an App Store. Removing it is a serious drawnback for the whole PWA community.",
            "points": "47 points",
            "children": [
              {
                "comment": "Hey, I have a stupid question about web apps. I use Android and I noticed my browsers like Firefox, Chrome, and the DuckDuckGo browser have a feature where I can hit the \"...\" in the top right of the browser and then hit \"Add to Home screen\" and I will get a little shortcut to the web page that I can put on my phone's home screen. When I tap this shortcut the web page opens the same as if I typed it into the web browser but all I had to do was tap the shortcut. I find it super useful for when I want to quickly access a mobile site when a mobile app in the Play Store either doesn't exist or sucks. Is this thing I access with a shortcut a PWA? Or is it just a regular web page? Do PWA's show up in the Play Store?",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Yes, that’s a pwa; especially if you get a loading screen and no browser controls. No, they aren’t available on app stores and thats one reason Apple is weird about it. There are services that can wrap a pwa so that it can be put on the stores though, but there are differences between these and native apps.",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "So this is a website I built and hosted on Heroku: https://sea-air-towers.herokuapp.com/ . Here is the code, it uses Node.js on the backend and Twitter Bootstrap on the frontend: https://github.com/JohnReedLOL/Sea-Air-Towers-App-2 . I opened it in the Google Chrome and DuckDuckGo browsers on my Android phone and hit \"Add to Home Screen\" to make a shortcut to it on my phone. When I hit the DuckDuckGo shortcut, it just creates a new tab in the DuckDuckGo browser and opens that tab. I can see the address bar at the top, it says https://sea-air-towers.herokuapp.com/ . When I do the same thing with the Google Chrome shortcut, it doesn't do that. With the Google Chrome shortcut to https://sea-air-towers.herokuapp.com/ , there is no address bar at the top after I open it. I can't get to my other Google Chrome tabs. When I open up all the programs running on my phone it's in a separate program from the Google Chrome browser with all its tabs.\n\nI'm kind of confused. So for my site, is the Google Chrome shortcut a PWA and the DuckDuckGo browser shortcut just a regular website, a non-PWA site? They both look identical except the Google Chrome shortcut doesn't have the address bar at the top after I hit it.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "If it opens in the browser with the search bar and other tabs, it is not a PWA, it's just a shortcut to a website.\n\nIf it opens fullscreen without the browser UI and opens even when you are offline then it is a PWA",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "This is the typical line from people who defend Apple and their decade long attack on mobile web apps. If it can’t act like an app, then it just acts like a website.",
            "points": "48 points",
            "children": [
              {
                "comment": "Hey, I have a stupid question about web apps. I use Android and I noticed my browsers like Firefox, Chrome, and the DuckDuckGo browser have a feature where I can hit the \"...\" in the top right of the browser and then hit \"Add to Home screen\" and I will get a little shortcut to the web page that I can put on my phone's home screen. When I tap this shortcut the web page opens the same as if I typed it into the web browser but all I had to do was tap the shortcut. I find it super useful for when I want to quickly access a mobile site when a mobile app in the Play Store either doesn't exist or sucks. Is this thing I access with a shortcut a PWA? Or is it just a regular web page? Do PWA's show up in the Play Store?",
                "points": "-4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The only people who save websites to home screens are marketing professionals making sure their icon shows up correctly",
            "points": "-43 points",
            "children": [
              {
                "comment": "I'm the developer of a (admittedly quite niche) paid app, and I can assure you that pretty much every one of my users installs it to their home screen because it's the only way to get proper fullscreen functionality on iOS. It's also the only way to get push notifications. I think if it was as easy to figure out as it is on Android (actual in-page install prompts, clearer UI, etc.) then it would be used a lot more. But clearly that was never Apple's goal.",
                "points": "27 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Overrated issue. The only way to fight this is by building better web apps and not relying on any web stores.",
        "points": "-54 points",
        "children": [
          {
            "comment": "The last time I tried to build a better web app I ran into PWA restrictions that only existed on iOS.",
            "points": "35 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "That's exactly the point - by removing PWA support Apple are making it impossible to build better web apps on iOS; no offline functionality, no background updating, no way fullscreen/chromeless UI, etc, etc.\n\nYou literally can't build a web app that runs anywhere except \"inside a browser, while it currently has focus\".",
            "points": "8 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "They're actively sabotaging web apps. How do you build better ones?",
            "points": "25 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "whats up with the recent news about apple killing web apps in the eu, can u explain to me like im 5:\n\nSure, I'll try to explain it to you like you're 5. Web apps are like websites that you can add to your home screen and use like regular apps. They can do things like send you notifications and work offline. Some people like web apps because they are faster, cheaper, and easier to make than regular apps.\n\nApple is a big company that makes iPhones and iPads. They have their own rules for how apps should work on their devices. They also have their own store where you can buy or download apps. Apple likes to keep their store and their devices safe and secure, so they check every app before they let it in their store. They also charge money to the app makers for using their store and their devices.\n\nThe EU is a group of countries in Europe that work together and make some rules for everyone. They want to make sure that people have more choices and fair prices when they use technology. They don't like it when big companies like Apple have too much power and control over what people can do with their devices. They made a new rule called the DMA that says Apple has to let other people make web apps and use different browsers on their devices.\n\nApple says that they can't follow the new rule because it would make their devices less safe and secure. They say that web apps need to use a special thing called WebKit that makes them work well with Safari, their own browser. They say that if they let other browsers use their own things instead of WebKit, then some bad web apps could get into your device and do bad things to it. They also say that making web apps work with other browsers would be very hard and take a lot of time.\n\nSo, Apple decided to stop letting people add web apps to their home screen in the EU. They say that this is the only way they can follow the new rule and keep their devices safe and secure. They say that web apps are not very popular anyway, and that people can still use them in Safari or other browsers. But some people are not happy with Apple's decision. They say that Apple is just trying to keep their power and money, and that they are making web apps worse for everyone. They also say that web apps are very useful and important, and that Apple should find a better way to follow the new rule and support them.",
        "points": "-10 points",
        "children": [
          {
            "comment": "This is more like just repeating apples bullshit propaganda. Say it as it. It’s not for safety or security. It’s to protect AppStore revenue",
            "points": "8 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Sensationalised title… destroys any credibility for the cause.\n\nAgree with the other comments, this a non issue. Concentrate effort on something worthwhile imo.",
        "points": "-73 points",
        "children": [
          {
            "comment": "Uneducated take is uneducated",
            "points": "43 points",
            "children": [
              {
                "comment": "Glad we agree on something",
                "points": "-43 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Another person defending Apple’s ironclad control over the web and their decade long suppression of web apps.\n\nIt’s not sensationalist, it’s exactly what’s happening.\n\nIf you don’t think this is a problem, you honestly shouldn’t be a web dev.",
            "points": "18 points",
            "children": [
              {
                "comment": "“EU users will be able to continue accessing websites directly from their Home Screen through a bookmark with minimal impact to their functionality.”\n\nOh no, the horror. May as well delete the web.",
                "points": "-33 points",
                "children": [
                  {
                    "comment": "If you don’t understand the impact, then you are in the wrong field friend.",
                    "points": "15 points",
                    "children": [
                      {
                        "comment": "I understand the impact. We just disagree as to it’s importance. Which is fine. Everyone’s entitled to their opinion.",
                        "points": "5 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "What's the real impact?",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "If we don’t win this battle. Mobile web apps will never be viable.\n\nThe battle for desktop has already been won for the web, we’re on the losing side for the battle for mobile",
                            "points": "9 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "Real time notifications from websites don’t work inside Safari. They only work if the website is added to the home screen.",
                            "points": "4 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "You are using Apple's product... You are the biggest Apple's defender here. They don't care about your opinion, they care about your money.",
                "points": "-4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Non-issue? Do you even understand what a PWA is?\nI happen to agree that the title could be worded better, because web apps aren't necessarily PWAs, but this is far from a non-issue.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Would you consider providing an actual argument?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I never saw any real need for web apps to be honest. So even though I disagree with apple in most of its policies, this is one policy which I don't think has much gravity.\n\nI wonder the matrices of users using Web apps to consider it as serious issue.",
        "points": "-53 points",
        "children": [
          {
            "comment": "Web apps are important. They can be used for apps that organizations don't want to list publicly, for low budget apps that won't target native on multiple platforms, or for apps that don't need to meet Apple's paid and arbitrary review process.\n\nThe only downsides to web apps are their limited scope, and the extra limitations Apple has placed on them for non competitive reasons.",
            "points": "28 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Of course you didn’t. Apple has been holding them back for a decade.",
            "points": "29 points",
            "children": [
              {
                "comment": "An android user here. And also I am not from US and coming from a country where probably only 5-6% people use apple.",
                "points": "-17 points",
                "children": [
                  {
                    "comment": "Very few companies are going to invest in web apps if they don’t work on iOS.",
                    "points": "17 points",
                    "children": [
                      {
                        "comment": "American* companies. My company, boasting over 5 million active users, prioritizes Android over iOS, since the majority of the user base uses Android. For instance, new features and fixes are rolled out on Android first.\n\nIt all boils down to the target audience. If you're developing an application for America, where the demographics are American, you will obviously prioritize iOS.\n\nHowever, I am not entirely convinced about the notion of \"very few companies.\" In the rest of the world, Android holds dominance.",
                        "points": "5 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Except US, there are very few countries where apple is dominant.\n\nFor non US market, android is still the majority market. I don't see how it makes a difference in the context of global market excluding US market.",
                        "points": "5 points",
                        "children": [
                          {
                            "comment": "UK and Japan are two large markets where iOS is the majority.",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "UK and Japan is miniscule compared to other Asian markets.",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Was anyone actually targeting iOS with PWAs? I looked into it a few years ago and it was already a disaster (which is exactly what Apple wants it to be).",
        "points": "0 points",
        "children": [
          {
            "comment": "There are “lots” but it would be small in % of market terms. But I agree it’s a disaster which is the whole reason OWA was created.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I think trying to force Apple's hand legally is missing the point. Apple won't care until Apple users care, and can Apple users be made to care? (If they cared, they wouldn't be using Apple LOL)\n\nI did see an interesting argument below that Apple users won't care until there are great PWAs, and that won't happen until Apple is forced to support them.",
        "points": "0 points",
        "children": [
          {
            "comment": "DMA can fine Apple 20% of global revenue. They’ll care about that!",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "People don't care. They want to use Apple and they will continue to do so.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asnreh",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://socket.dev/blog/two-typosquatting-python-packages-exploit-discord-cdn-to-deploy-malicious-payloads",
    "title": "Two Typosquatting Python Packages Exploit Discord CDN to Deploy Malicious",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1asmrq2",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asmrq2/unreal_engine_5_is_coming_to_web_browser/",
    "title": "Unreal Engine 5 is coming to web browser",
    "points": null,
    "comments": [
      {
        "comment": "Really cool!",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Unreal had official support for HTML 5 for a few years in the mid 2010s. Looks like it was deprecated with 4.24 though. I'm pretty sure you can still download 4.23 if you want to try it out though.\n\nOfficial docs: https://docs.unrealengine.com/4.26/en-US/SharingAndReleasing/HTML5/GettingStarted/\n\nThere were some demos floating around for a while, but they didn't run all that well. Think puzzle games or those gallery experiences you see sometimes.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asmhhl",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asmhhl/what_would_you_charge/",
    "title": "What would you charge?",
    "points": null,
    "comments": [
      {
        "comment": "Since it's a former employer, $250/hr with a 10 hour minimum. You already have a job, make sure your extra hours are worth it.",
        "points": "12 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Id have said $225/hour, no fixed hours. You don't know everything they broke.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No way I'll come back just for 2x hourly. Never undersell yourself.\n\nAsk for $500/hr (I'm not kidding), with a minimum of 4 hours/day of work. They'll most likely balk, but remind them of how much time and money they've spent on other developers already, not to mention the potential profits lost due to downtime. Even better if you have those numbers to back it up.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That agency is billing you out at at least double the rate they are paying you. I would start at 400 to 500 an hour. No one could do it faster so they are still probably getting a deal.\n\nBtw, If they don't talk at your first ask, you didn't ask enough.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What do you value your time at? Double it. You have to work on it after your primary job so that cuts severely into your down time and that is very valuable.\n\nSo if you did 75-100 before, I would quote 200 per hour.",
        "points": "2 points",
        "children": [
          {
            "comment": "I was going to say $250 because it sounds like you’ve got them by the balls.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "What price would it be worth for you to do? Dream big.\n\nDouble that and send it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asm15u",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asm15u/gpt4_autonomously_finds_vulnerabilities_in/",
    "title": "GPT-4 autonomously finds vulnerabilities in websites",
    "points": null,
    "comments": [
      {
        "comment": "How is this any different to what people have been doing for ages? Before I shut down my web server I used to see heaps of automated traffic trying known exploits. This is no different than a handful of scripts, except GPT uses infinitely more processing power. Saying GPT \"didn't know\" the exploits beforehand is a bit of a cop-out, because it's not like it invents new exploits by itself",
        "points": "44 points",
        "children": [
          {
            "comment": "Same thing with a new label",
            "points": "11 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "this time the 'bot' has context and it actually understands what its doing",
            "points": "-3 points",
            "children": [
              {
                "comment": "Pattern recognition != understanding",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Eventually it will be able to invent new exploits as these models get more advance",
            "points": "-12 points",
            "children": [
              {
                "comment": "We called that fuzzing in the early 2000s ;-)",
                "points": "9 points",
                "children": [
                  {
                    "comment": "Hi, yeah still called that.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asluf7",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asluf7/time_in_between_jobs/",
    "title": "Time in between Jobs",
    "points": null,
    "comments": [
      {
        "comment": "Focus on self-improvement, read books, establish a gym routine, seek therapy, work on side projects, make friends, revive old hobbies, tap into your creative side and make some art.",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Couldn't land a new job since mid-last 2023, took a decent paying client from the old company, filed with the state to register a company, working with a couple other people trying to claw our way to something in this life.\n\nTake care of pets, find a new city to move to, tell myself I'm going to go climbing, reevaluate what is important in life. Making small things in Google Sheets/ Google Apps Script. Blowing time on Reddit.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1askn0x",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1askn0x/the_ultimate_animator_in_angular/",
    "title": "The ultimate animator in Angular",
    "points": null,
    "comments": [
      {
        "comment": "You do realize that visitors probably don't care about your AbstractAnimation or your SlideAnimation or your FadeAnimation or your scroll animation or your language change animation, right? If so, that's how you're the victim of over engineering.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asi3ao",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asi3ao/should_i_get_github_copilot_individual_or/",
    "title": "Should I get GitHub Copilot Individual or Business license as a freelancer?",
    "points": null,
    "comments": [
      {
        "comment": "It's only $10 🤔",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you are using it for business (freelancing is business) then you need the business license.",
        "points": "0 points",
        "children": [
          {
            "comment": "The 10$ version specifically mention freelance.\n\nCopilot Individual\n\nCode completions, Chat, and more for indie developers and freelancers",
            "points": "3 points",
            "children": [
              {
                "comment": "Looks like you are correct.👍",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Yeah, so I don't understand why I would pay 20 in that case. No additional benefits with the business license, right?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ashsn8",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1ashsn8/what_is_the_cheapest_way_to_host_your_code/",
    "title": "what is the cheapest way to host your code?",
    "points": null,
    "comments": [
      {
        "comment": "Unless your time is free, a basic VM. A 1GB VM on DigitalOcean.com is $6/mo. You can also do things like Amazon EC2 or Lightsail, Azure, google etc. for a similar price.\n\nIf you want more powerful servers, you can get a dedicated one $20-$50/mo. https://lowendbox.com/ is a site dedicated to these, and you can follow the providers they mention to find something that works for you.",
        "points": "37 points",
        "children": [
          {
            "comment": "A few years ago I was looking for a cloud solution to host my wife's blog and Digital Ocean was the cheapest.\n\nThere may be a few competitors nowadays but their interface is so clean and easy to use that I would probably not change for a cheaper solution.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "+1 for DO, currently hosting a few personal projects on there. Super quick and easy to set up, as well as being nice and cheap.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Hetzner is amazing.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Does the digitalOcean supports a WEBGL product just used rest API to communicate with MongoDB, I had it on render free plan for a while, however, render's server sleeps every 30 mins and everytime it takes 2-3 mins to reactivate, when I tried deploy the same thing on vercel it doesn't work.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "A 1GB VM on DigitalOcean.com is $6/mo.\n\nthis is not the cheapest and actually quite limited.\nRacknerd black friday https://www.racknerd.com/BlackFriday/ get's you 4 vCPU Cores, 115 GB SSD and 4.5 GB RAM for LESS MONEY - only 52$ a year or 4.3$ a month.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "On your own laptop always connected in your basement.",
        "points": "182 points",
        "children": [
          {
            "comment": "lolololol, I see what you did here",
            "points": "13 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Any cloud based solution??",
            "points": "-9 points",
            "children": [
              {
                "comment": "The cloud is your laptop in your basement.",
                "points": "127 points",
                "children": [
                  {
                    "comment": "https://youtu.be/CewJ-ihIqaM?si=pkPG8zJ-SnGdKI7G?t=00m25s\n\nYou put your laptop on the line",
                    "points": "18 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Laptop in your basement is technically basement based solution.",
                    "points": "7 points",
                    "children": [
                      {
                        "comment": "Do you really think cloud servers are hosted in the clouds?",
                        "points": "8 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Laptop on the roof. Basically in the clouds at that point",
                "points": "17 points",
                "children": [
                  {
                    "comment": "Yes, especially if you live in Macchu Pichu",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Raspberry pi as backup and there’s your cloud",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Have someone take your laptop onto a plane.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Cloud is almost the most expensive way to host it. So the exact opposite of what you asked.\n\nBut you can probably find a shared host or VPS for 5$/month if you really want to.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Cheapest way on a cloud would be to rewrite everything to be serverless and introduce a bunch of annoying complexity to your project. Not to mention shoehorning your relational data into something like Dynamo DB.\n\nBut yeah. On AWS You could use Dynamo DB for very little money and write the API USING lambda functions + API gateway. If you have a small number of users this will cost basically nothing. If you can host the frontend as a static site on GitHub pages connected to your domain then your whole stack is free.\n\nBut working with Dynamo DB and developing lambdas has a learning curve if you haven’t done it before. You’ll waste a lot more time doing that than the $50 a month or so it would cost to host the site+ db on Heroku or even direct on AWS",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "you asked \"cheapest\", cloud is never that",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Oracle has free comput instances that I use for a couple small projects! Set up them and never have to think about!",
                "points": "0 points",
                "children": [
                  {
                    "comment": "If they don’t randomly delete your free instance that is.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "if you got an static website you can host it in an S3 for super cheap (in cloud standards)",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "The cloud is just someone else’s computer.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Depends on how much traffic you're expecting.",
        "points": "28 points",
        "children": [
          {
            "comment": "Hardly 30 customers an hr for 3-4 hrs a day.\n\nSo at max 30 POST requests in an hr",
            "points": "20 points",
            "children": [
              {
                "comment": "To echo my previous comment, since you're doing it for a business, check they don't already have a webserver. Coincidentally every restaurant I've worked with had their own inhouse server for things. Possibly just needs caddy or nginx installed to separate requests.",
                "points": "28 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Why not use supabase. You won't exceed the free plan.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Do you mean at minimum?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Computer in the basement. You can buy any Core machine and it should work for anything.\n\n./+o+- jon@chantry yyyyy- -yyyyyy+ OS: Ubuntu 22.04 jammy ://+//////-yyyyyyo Kernel: x86_64 Linux 5.15.0-88-generic .++ .:/++++++/-.+sss/` Uptime: 96d 4h 37m .:++o: /++++++++/:--:/- Packages: 584 o:+o+:++.`...-/oo+++++/ Shell: bash 5.1.16 .:+o:+o/. +sssoo+/ Disk: 15T / 20T (79%) .++/+:+oo+o: /sssooo. CPU: Intel Core i5-4690 @ 3.492GHz /+++//+:oo+o /::--:. GPU: \\+/+o+++o++o ++////. RAM: 1436MiB / 6365MiB .++.o+++oo+:/dddhhh. .+.o+oo:.oddhhhh+ +.++o+o-.:ohdhhhhh+ `:o+++ `ohhhhhhhhyo++os: .o:`.syhhhhhhh/.oo++o` /osyyyyyyo++ooo+++/ +oo+++o\\: `oo++.",
                "points": "-15 points",
                "children": [
                  {
                    "comment": "Do not do this, unless you have the slightest clue about basic security controls, routing, firewalls, vlans and making sure your other devices at home are isolated from the web accessible system",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "vlans are probably not a necessity unless you already know about vlans. A simple port 80/443 TCP forward to one machine would do the trick.",
                        "points": "-2 points",
                        "children": [
                          {
                            "comment": "Sure it can do the trick.. and how secure is your code? did you test it for exploits to know that someone could not hit it, gain elevated access into your instance running said code and now move sideways through your entire home network and the devices on it?\n\nDid you follow best practice to keep your docker containers updated, isolated and secured?\n\nHow are you monitoring these systems for attempted connections and attack vectors?",
                            "points": "5 points",
                            "children": [
                              {
                                "comment": "Yes, yes, and monitoring them with my eyes. A good 99% are just calls to various WordPress exploits, all 404s.\n\nI'm curious as to WHY I keep seeing /web/temp/Photo%20111.jpg in my logs. At one point I just piped /dev/null for all hits to wp-login.php (but capped after 20GB). Fun times. Quickly disabled it because the robots doing the crawling couldn't care less.\n\nBut creating a decently locked down website on a home network is easy peasy with a dedicated machine on it. As long as you're not trying to spin up IIS on Vista then I wouldn't worry about it.",
                                "points": "5 points",
                                "children": [
                                  {
                                    "comment": "My hats off to you then! As you are a very very rare occurrence of most who self host content.\n\nMost will just forward some ports to what ever instance they have running, which they havent actually updated in ages cause \"it just works\" and off they go, running out dated libraries with known exploits in them along with their copy & pasted code of a random github site :D",
                                    "points": "0 points",
                                    "children": [
                                      {
                                        "comment": "I feel like that's surprising, but then again I'm getting old. Back in college I made the mistake of just plugging in a fresh Windows 2000 machine straight into the campus LAN. Was unusable in under 3 minutes. Luckily it was a fresh install 😅\n\nIt's way simpler to be protected today. I mean, even if there was some random exploit on one of my rarely shared links that run on my home network, the best that could be done would maybe see the other containers running on the same server. And you'd probably have better luck running a reverse DNS on the IP.\n\nI will say that the biggest issue hosting locally would be traffic. Like, I'm positive if I shared one link on Reddit and it hit the frontpage, my home internet would be toast. Either the ISP would turn it off, reassign my IP, and slap my wrist or just drop me altogether. Luckily I live in an area with multiple ISPs so if that ever happens I'll just resubscribe.\n\nBut OP said 30 users. I kinda skimmed the content, but I wouldn't host a client's site unless pre-production. But I've worked with dozens of clients who self hosted. If you're only local, it makes sense. Like a autoshop in a town of 25,000 ppl isn't going to advertise to Paris, 99% of their traffic will come from a radius of less than 50mi.",
                                        "points": "2 points",
                                        "children": [
                                          {
                                            "comment": "I remember those 2000 days! back when I had my first cable internet connection, think it was a whole 1Mb down! Was a race to try and get that service pack in before you got hosed if you didnt already have it downloaded, or an updated ISO you injected the SP into!\n\nThe issue with today is that the internet has vastly far more resources and far more automation scanning and exploiting, 99.9999% of the scans you see are all automated, not a single person on it, only when they find what they need and run some automated tests to see if it could be exploited, does it often find its way to an actual person to see how far they could get, and is it worth it. every IP in every subnet is scanned hundreds to thousands of times a day. You dont need to share any URLs or IPs, once an open port is found, those automated tools go to work.....\n\nCertainly phishing is the #1 cause of most compromise, but the reason why IoT botnets are so huge is because of insecure routers and other things easily accessible on the open internet because someone just forwarded some ports to a device.\n\nSo many more attack surfaces out there now, that home users, the majority know very little about basic security, even while someone could write decent code, often what they run it on is not too secure. My years of working along side and in charge of Developers, security was lucky to be a second thought. Now we have to have CI/CD pipelines that do checks for stored key and accounts in code....because it is so common to find that, no secured config files, DB connector configs wide open on the public facing site, the horror list goes on and on sadly!",
                                            "points": "0 points",
                                            "children": [],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "VPS + docker compose if you know what you are doing. (50$ a year. https://www.racknerd.com/BlackFriday/)\nbut judging by the the question you are asking - you are new to this.\nhardware cheap always means you have to do more yourself, DR, backups, notifications, scaling, security etc.",
        "points": "64 points",
        "children": [
          {
            "comment": "How would you even do backups using one VPS?",
            "points": "6 points",
            "children": [
              {
                "comment": "All that needs to be backed up in this application is the database. pgdump in cron will be enough",
                "points": "13 points",
                "children": [
                  {
                    "comment": "Yes but what would be the backup target?",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "S3? Or rsync it wherever you’d like.",
                        "points": "7 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Yes, S3. Or you could connect to an additional disk to the droplet and enable snapshots for it, or just send the base archive to email. With such planned application volume the backup size will be few MB.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "Alright so it's not possible, gotcha. Was wondering if I'm missing something.",
                            "points": "-1 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "personally I also have a micro-homelab and a home NAS server (https://bytepursuits.com/12-bay-homelab-nas-jmcd-12s4-from-taobao-upgrading-my-truenas-scale-server-optionally-rack-mountable).\nBut it is technically possible to backup to your laptop/pc as well. I mean I wouldn't recommend it - but OP asks about \"cheapest\"- depends on your knowledge/skill set and discipline it can work very well.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "And I will add that GPT-4 is really good at writing basic dockerfiles and docker compose config files. Obviously anybody should know the ins and outs of their tools, but very junior people can get apps up and running with docker using GPT generated dockerfiles. It’s great",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Docker on a production environment?",
            "points": "-29 points",
            "children": [
              {
                "comment": "Noob question: why is this bad?",
                "points": "16 points",
                "children": [
                  {
                    "comment": "It's not",
                    "points": "25 points",
                    "children": [
                      {
                        "comment": "Ok that's what I thought. And the reason why, is that a docker container gives you a consistent environment right? So basically everything you build and test in dev will definitely work in prod.\n\nIs that the basic idea?",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "Yeah I’m not sure what anybody uses for production if not some form of docker. Like what’d y’all do before docker came along??",
                            "points": "4 points",
                            "children": [
                              {
                                "comment": "Upgrade the system and pray to a photo of Linus Torvalds that the project still runs afterwards, as the sacred scripture has foretold.",
                                "points": "1 point",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Well, mostly a VPS is already \"a container\" and it's already linux. With a few linux commands you have the same thing as your docker environment\n\nSafes space and easier control",
                    "points": "-21 points",
                    "children": [
                      {
                        "comment": "The difference is it's usually easier to build a docker image and push it to your VPS rather than building a new virtual machine image and creating a new VPS based on it. Plus you can run multiple containers on the same machine, like one for the database and one for the app. Many existing services you might need (postgres, redis, nginx) already have official docker images available so you don't need to do anything to install/configure them on the server. And you can run those exact same containers on your dev machine even if it uses a different OS.",
                        "points": "12 points",
                        "children": [
                          {
                            "comment": "I agree, docker / docker-compose file is a simple solution. And if it will be needed – in two commands it is a possible to convert this setup to cluster mode (with docker swarm)",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Cloud run @ gcp",
        "points": "31 points",
        "children": [
          {
            "comment": "What do you use for your DB?",
            "points": "0 points",
            "children": [
              {
                "comment": "firestore has a free tier. But then you can do whatever you want",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Atlas in my case but there are other solutions out there, Firestone as the other response said for example",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "This.. Its free for very lightweight stuff",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Railway.app - it’s a Heroku like PaaS which is free if you use less than $5 a month, no OS updates to worry about, no opening your network up to outside traffic.\n\nI’ve got a toy Django / Postgres app that gets about 2K requests a day and don’t pay a penny for it.",
        "points": "46 points",
        "children": [
          {
            "comment": "Just googled it, there is no free tier any more",
            "points": "11 points",
            "children": [
              {
                "comment": "Their wording is weird but I’m pretty sure it’s still there.\n\nThe “price” is $5 a month, but they include $5 a month in credit every month so essentially it’s free",
                "points": "3 points",
                "children": [
                  {
                    "comment": "No the 5$ is a one time payment and not every month. At least thats what the website says https://railway.app/pricing scroll down to the FAQ",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Your Hobby plan subscription includes $5 of usage per month. If your total usage at the end of your billing period is $5 or less, you will not be charged for usage. If your total usage exceeds $5 in any given billing period, you will be charged the delta.",
                        "points": "5 points",
                        "children": [
                          {
                            "comment": "I did not see that. You are right.",
                            "points": "3 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "If your total usage exceeds $5 in any given billing period, you will be charged the delta.\n\nwhat does \"delta\" means in this context? like the difference above 5 or everything. say it ends up being 6, would it charge 1 or 6? ._.",
                            "points": "-1 points",
                            "children": [
                              {
                                "comment": "A delta is a difference. EG: diff generates file deltas.",
                                "points": "2 points",
                                "children": [
                                  {
                                    "comment": "thank you very much",
                                    "points": "0 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Railway's free tier is gone\n\nBut fly.io has the $5 free tier. They need your card on file but if your monthly usage is below $5 they won't charge you.",
            "points": "12 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I might migrate from my $5 digital ocean to this. I may get 2 visits a month lol but it’s attached to a paper and sometimes I get some questions so want to leave it up",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "share the app",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "AWS is extremely cheap, at your scale it will be nearly free since you'll be at the free tier for almost everything you are doing. The trade off is, to get that absolute cheapest price, you need to build your app to take advantage of the specific services that AWS offers. So if you have an app that you've already built and aren't willing to rewrite any of it, then it's likely going to be much more expensive. Even still, you can get the smallest AWS Lightsail instance (basically a computer you can install/run anything on in the cloud) for $3.50/month.\n\nFor comparison, my website receives magnitudes more traffic than what you are talking and costs about $1/month and most of that is the $0.50/month for AWS' DNS which isn't necessary but is a nice convenience.\n\n(You can swap AWS here with any other cloud provider and basically the same thing applies.)",
        "points": "26 points",
        "children": [
          {
            "comment": "How do you keep your data on aws? I know a RDB instance gets expensive fast.",
            "points": "5 points",
            "children": [
              {
                "comment": "I assume you mean RDS? I'm not sure what RDB is.\n\nI generally use a combination of S3 and DynamoDB. S3 for static stuff that rarely changes, DynamoDB for your normal database needs.\n\nDynamoDB is special in that it can be run \"serverless\" so you only pay for what you use which can make it basically free if you have low throughput. The biggest thing is that it's a document database so it's NoSQL so if your code is all already written, you'll need to redesign the data model. But almost any database can be restructured into NoSQL and if you are trying to save money, it's totally worth it since the savings is dramatic.",
                "points": "9 points",
                "children": [
                  {
                    "comment": "Had the same advice for him. You can probably find a way to host the application cheaply but a relational db is gonna cost you anywhere. His best bet is to use DynamoDB, which involves a lot of learning if you aren’t familiar with it already and a lot of rewriting your data layer regardless of it you’re familiar with it.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I really appreciate this info brother.Thanks",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Hetzner",
        "points": "5 points",
        "children": [
          {
            "comment": "This. Stuff like Digital ocean is way more expensive. The lowest cloud tier on Hetzner is like 3 euro's a month and it's enough for an application with below average traffic.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Plenty of Vps hosting offers $3 per month pricing. Contabo for example.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Surprised no one has mentioned Oracle always free tier. You can get a decent spec Ubuntu machine on the cloud cloud for free. They're basically burning money to try and get customers. For your requirements should be more than enough. I use it to host game servers for my friends.",
        "points": "5 points",
        "children": [
          {
            "comment": "If you can get one",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It took one and a half year for me to get the account created but Oracle's free tier is truly generous.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Vercel n supabase",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Supabase for sure",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I've used Google's Firebase platform, it's completely free (up to a certain point) and offers hosting, db (it's document based though, not relational), authentication and other services. Pretty good for small projects like yours.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Google cheap vps. You can get a cheap vps for a couple of bucks a month, as long as you’re ok installing what you need and managing it yourself.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "each restaurant would use their business class internet connection which comes with a static ip to host the site\n\nto host they must pass ports 80 and 443 to the hosting machine, or setup a port proxy",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "First question is... do you need a database, or would data files be sufficient (JSON, YAML... Whatever).\n\nIf you do need a database, would Firebase or similar work?\n\nBecause you can make use of a rather generous free tier using Netlify and Firebase, for example. And use Netlify Functions for any API needs... If it actually meets your needs.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Digital Ocean + CyberPanel",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hostinger.com",
        "points": "-7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Free",
        "points": "-5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Google Cloud Run or AWS App Runner plus CockroachDB Serverless (if you can make it work with your app, it's very similar to postgres but not 100%). The app server would be around $5/month and CRDB should be free for your usage level.\n\nAlternately as others have suggested you can get a cheap VPS for probably like $5-$10 a month and install everything there, but it will be more work.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's kind of a trade-off that comes down to time/effort vs cost. Running on AWS, GPC or a VPS somewhere will be cheap, but will take a little more time to setup and effort to run.\n\nPlatform hosting type services like Heroku, Fly.io, Render, etc. will be easier to setup and run but at a higher long-term cost.\n\nFor something this small, and the wording of your question I would suggest a cloud hosting platform - at least to get started, you might find the theoretically higher cost to not be much more on such a small scale (you mention \"Hardly 30 customers an hr for 3-4 hrs a day\").",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Vultr for 5USD/mo or an old laptop with a static IP and domain.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm really into hosting my frontends on Cloudflare pages, then doing any sort of APIs / servers / DBs on render.com. It's very cost effective.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Since you don't have a huge need for database, maybe sqlite3 would be fine? Much easier to handle, as it's file based, will be cheaper on the hosting",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Staple a bunch of raspberry pis together",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Iirc aws free tier let's you get a free $5 monthly ec2 instance.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Cloudflare page + worker, deno dashboard",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "probably Cloudflare Pages and workers",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Supabase offers PostgreSQL db up to 500MB on free tier. I've been running a project that does about 1k inserts a day. Each record is a newspaper headline, a couple of urls and timestamps, and some minor meta data. After a couple of years, circa 750k records, still only at 420MB.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You can use supabase as standalone database. It gives you 500 MB database storage which is enough for the project like yours.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "A raspberry pi connected to the internet 24x7 is your cloud.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "if you add tenancy you'll be able to run 1 db and host",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Google Cloud Run, Docker containers. Cheapest tier you’re only paying when processing data",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "contabo.com they have cheap vps like 4.5 $ a month\n\n4cores and 6GB Ram",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Deploy the frontend on vercel free plan and server + db on render free plan. Then switch to other platforms if traffic increased.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hosting a cloud on Hetzner with minimum specs is like 3 euro's a month. This is already enough for a website with below average traffic. Don't think complicated when these things work fine",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I use supabase free version and nuxt 3 frontend on Netlify or Vercel, so it's totally free at the beginning, put some ads, earn money then buy server slowly move to self hosted.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'd say just use Vercel for hosting the website and Supabase for auth and db. This is assuming you can keep within the free tier!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ashhge",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1ashhge/a_new_minimalistic_dockerbased_local_development/",
    "title": "A new minimalistic docker-based local development environment: draky",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1ash212",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1ash212/do_you_use_status_codes_in_your_backend/",
    "title": "Do you use Status codes in your backend ??",
    "points": null,
    "comments": [
      {
        "comment": "JFC don't do this.\n\nThere is an RFC that documents what the status codes mean.\n\nThe \"x00\" response is a good stand-in if you aren't absolutely certain you need a different one.\n\n200 = everything went fine\n300 = things are OK but there's a slight mistake\n400 = things aren't OK and it's your fault\n500 = things aren't OK and it's our fault\n\nEach of those classifications has many subtypes under it, but you should be sure that you are using them correctly before choosing to use them.\n\nHere is the official RFC regarding HTTP status codes: https://datatracker.ietf.org/doc/html/rfc7231#section-6\n\nIf the Internet had a legal codex, it would be the IETF docs / RFCs. Don't fuck with these, I'm serious. The reason the Internet works at all is because we uphold these standards and it is unacceptable to misuse them. Seriously, do not do this again.\n\nThe MDN articles about HTTP statuses are a bit easier to read, but source from the RFCs via the HTTPWG docs.\n\n​\n\nI made them my self 420,421,423...450 + generic ones 401,403 200, 201\n\n​\n\nStatus 420 does not exist at all.\nStatus 421 means Misdirected Request\nStatus 423 means Locked\nStatus 450 does not exist at all\n\n​\n\nif(verifyEmptyFields(body.nom, body.prenom, body.email, body.mot_de_passe)){\n  return NextResponse.json({ \n    message: \"All fields have to be filled\" \n  }, { status: 420 });\n\n\nThis is wrong because the status code does not exist. A server sending a request that gets this as a response may not know what to do with this undocumented status response.\n\nThis is either a 400 Bad Request if submitted normally or a 422 Unprocessable Entity if over an API (a 400 is also acceptable in that case).\n\nif(! verifyPasswordLength(body.mot_de_passe) ){\n  return NextResponse.json({ \n    message: \"The password have to be more than 8 characters\" \n  }, { status: 421 });\n\n\n}\n\nThis is wrong because { see above }\n\nThis is also either a { see above, 400 or 422 }\n\nif( ! verifyPasswordCombinationForCandidate(body.mot_de_passe)){\n  return NextResponse.json(\n  { message: \"The password have to be  a combination of letters , characters and numbers\" }, \n  { status: 422 }); \n}\n\n\n... ok technically this is correct, but it appears to be accidental.\n\nif(  await isCandidateEmailValid(body.email)=== false ){\n  return NextResponse.json(\n  { message: \"Email address not valid\" }, \n  { status: 410 }); \n}\n\n\nThis is wrong because 410 Gone is a real status code but it means something entirely different.\n\nWhen the client receives this back from the server, the message means \"the resource that you requested DID exist here previously, but is no longer found here.\" (\"We're sorry, but our princess is in another castle\"). Practically speaking -- the client probably isn't expecting to receive a 410 Gone from this endpoint, so it may not even know how to handle this response code.\n\nThis should be either a { see above, 400 or 422 }\n\nif(  await verifyUniqueEmail(body.email) ){\n  return NextResponse.json( \n  { message: \"Email address already taken\" }, \n  { status: 409 }); \n}\n\n\nThis is wrong but in a nuanced way. 409 Conflict doesn't mean that the record isn't unique or invalid because of a duplicate entry. It refers to race conditions created by version mismatches when updating.\n\nThis should also be either a { see above, 400 or 422 }\n\nconst newCandidat= await createUserCandidat(body , body.mot_de_passe);\n  await sendEmail(\n  { receiverAddress: body.email, type: 'verifyAccount' }); \n  return NextResponse.json(\n  { message: \"New Candidate added to DB successfully\" , newCandidat }, \n  { status: 201 });\n\n\nThis is correct. A 200 OK is also acceptable.\n\n} catch (error) {\n  console.log(error.message) return NextResponse.json(\n  { error: \"Internal Server Error\" }, \n  { status: 500 }); }\n\n\nThis isn't wrong, exactly, but it could be better. a 500 Internal Server Error is an acceptable response here. I say it could be better because do we know that it's an Internal Server Error? Was the issue that some of the data was malformed and a 422 Unprocessable Entity would have been a better fit? Were they not authorized to create it? A 401 Unauthorized would be better. Is the server overloaded? A 503 Service Unavailable would be better.\n\nGenerally speaking, we don't voluntarily emit 500 Internal Server Error, we let the underlying web server emit that for us, and we just convey it. If a client sees a 500, it is typically because they did something that did NOT have code written to handle it.",
        "points": "45 points",
        "children": [
          {
            "comment": "Bruh that’s a whole lecture I wish I had at my Uni, absolutely perfect comment",
            "points": "10 points",
            "children": [
              {
                "comment": "🙇‍♂️🙏💯\n\nNot trying to be a dick or anything, but this is one of those things that there are definitely right and wrong answers for and the consequences are significant.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Very bad idea, as those status codes are all reserved. Just use standard status codes and set an error field in the json body",
        "points": "35 points",
        "children": [
          {
            "comment": "Thank you for the reply on more question please:\n\n...Just use standard status codes...\n\nI just found this on mdn docs : https://developer.mozilla.org/en-US/docs/Web/HTTP/Status what should I use beside the famous ones 401and 403 as status code with error response .",
            "points": "1 point",
            "children": [
              {
                "comment": "All of what you're returning here should be 400 bad request.",
                "points": "19 points",
                "children": [
                  {
                    "comment": "This is the correct answer. Everyone else probably does not work on any large\nscale web plaftorm or have experience with API gateways, monitoring/observability.",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "There should be libraries and frameworks to handle this for you. You're wasting time reinventing a square wheel",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Server side form validation:\n\nreturn NextResponse.json({ errors: [\"All fields have to be filled\", \"Email address not valid\", \"The password have to be  a combination of letters , characters and numbers\"] }, { status: 400 });\n\none of the most irritating things is having to fix 1 error, submit, then fix another error. Just return them all as an array and mark the resturn status 400: bad request\n\nChat GPT suggests that 409 could be used for duplicate email but I've never bothered to get that granular, 400 for something wrong with the request, 401 for authorization failures, 500 for something went wrong at the server etc.\n\nI would not make up my own statuses. If your API consumer ends up using any major libraries like react-query then I expect it's going to have trouble picking up your custom statuses.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It is a 400 for anything invalid like missing password, incorrect format. Or required fields. Anything the client sends that is in the wrong format or missing.\n\nI've replied on this before. The reason why you want 400 is for monitoring/observability. And also client-side linting from an API gateway.\n\nClient error. Anything that the client sends that is incomplete or in the wrong format. When the client sends incomplete, missing, malformed data.\n\nEven data that does not meet enumeration, you reply with a 400 status code.\n\n**Here are tons of examples:**Here is Google Example:https://developers.google.com/gmail/api/guides/handle-errors#:~:text=specific%20API%20errors.-,Resolve%20a%20400%20error%3A%20Bad%20request,Invalid%20attachment.\n\nResolve a 400 error:\n\nBad requestThis error might result from these errors your code:A required field or parameter hasn't been provided.The value supplied or a combination of provided fields is invalid.Invalid attachment.\n\nSwagger/Open API Pet Store Example:https://petstore.swagger.io/?docExpansion=full\n\nand search for:400 Invalid ID supplied\n\nLook at any modern public swagger spec. Any erroneous input returns a 400.\n\nWhen the client sends the wrong payload or malformed or incomplete., it is a 400\n\nMozilla: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/400(for example, malformed request syntax, invalid request message framing, or deceptive request routing).RFC spec: https://httpwg.org/specs/rfc9110.html#status.400\n\nThere I have you guys 4 examples: Google, Swagger, Mozilla, RFC.\n\nNow microsoft for API best practices:https://learn.microsoft.com/en-us/azure/architecture/best-practices/api-design\n\nIf the client puts invalid data into the request*, the server should return HTTP status code 400 (Bad Request). The response body can contain additional information about the error or a link to a URI that provides more details.\n\nAnother example reference:https://www.uniprot.org/help/rest-api-headers#:~:text=The%20400%20Bad%20request%20status,information%20sent%20by%20the%20client.\n\nAnd https://stackoverflow.blog/2020/03/02/best-practices-for-rest-api-design/\n\nI'll add some more to drive it home.\n\nStripe:https://docs.stripe.com/error-low-level\n\n*If you provided an invalid API key, or a 400 if a required parameter was missing. Integrations should correct the original request, and try again.*and further down:The request was unacceptable, often due to missing a required parameter.\n\nMicrosoft embraces OpenAPI style guidelines. Read through their docs.https://github.com/microsoft/api-guidelines/blob/vNext/azure/Guidelines.md\n\nI hope I provided enough info from industry leaders why it is a 400. I can even go into more detail for DevOps/SRE reasons.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Don't make up your own HTTP status codes.\n\nAs for how to use the existing ones there are a couple of different schools of thought.\n\nYou could try to embrace the HTTP status codes at your application level and use the one which best describes what's happening.\n\nOr you could leave those status codes at the HTTP level, and give your own signposting at your application level, which might be a status field of your response. When doing things this way you will treat any request which was handled as expected by your system, even if you handled an error situation, as an HTTP 200.\n\nOne advantage to the latter is that the consumer of your API can more easily tell which responses they should try to parse and which they should not. If they get a 200, they know that it's going to be in the format that they expect from your application, and where to look for a possible structured error report. If they get some other HTTP status code they know that it's an exception.\n\nIf the API tries to give different status codes depending on what happened, consuming the API becomes a little more difficult. It could be for example that a 4xx was generated either by the application or by some other layer, like a proxy, and confidence in how to handle the response disappears.\n\nYou can tell I prefer the latter approach these days (I used to prefer the former), but I'm sure others feel otherwise and have good reasons.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I just use the standard codes appropriately.\n\nNot that many other devs where I work do that…. status(200) no matter what town.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Only ever use standard http status codes. Exactly as they are intended to be used. Otherwise you're just making all consumers of your API miserable.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not all of those, but I used 451, if it was ever needed.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asglxq",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://scientyficworld.org/zed-code-editor/",
    "title": "Zed Code Editor: Technical Architecture And Performance Benchmarking • Scientyfic World",
    "points": null,
    "comments": [
      {
        "comment": "It's certainly interesting. Currently no Linux support means no ability to even test it out, which means they're not getting nearly as many users as they could. It's cool that devs so genuinely believe in the future of the collaborative editing, but even though it seems interesting to me, I don't necessarily believe it will take off and become mainstream. As silly as it is, things like themes and extensions have more popularity than collaborative editing",
        "points": "1 point",
        "children": [
          {
            "comment": "Extensions got added today (really) and Linux support is pretty far. You can watch the progress on their GitHub (it's a pinned issue)",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asgl1z",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asgl1z/how_do_you_host_your_private_repo_of_your_own/",
    "title": "How do you host your private repo of your own Organization on GitHub?",
    "points": null,
    "comments": [
      {
        "comment": "Vercel or Netlify",
        "points": "1 point",
        "children": [
          {
            "comment": "I did try Netlify and encountered some problems. I just edited my post.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You could potentially use firebase hosting and GitHub actions. Bonus it’s free.\n\nhttps://firebase.google.com/docs/hosting/github-integration",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have a CI running which builds and pushes the code to S3 or a server which is hosted already.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asg7ti",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://webkit.org/blog/15036/how-to-use-media-source-extensions-with-airplay/",
    "title": "How to use Media Source Extensions with AirPlay",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1asfab0",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asfab0/help_with_google_docs_api_on_react_please/",
    "title": "Help with Google Docs API on React, please",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1asf9e8",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asf9e8/nondev_here_need_some_guidance_about_google_maps/",
    "title": "Non-dev here. Need some guidance about Google maps API",
    "points": null,
    "comments": [
      {
        "comment": "If you are using some website builder type platform, check if the google maps integration is optional.\n\nIdk if you need it since I don't know the platform you are talking about and for what use you are wanting to to use it for.\n\nThere are many flavors of google maps APIs, like this Embed API will just spit out one of those google maps boxes with a pin on the location. There is a Geocoding API if you need coordinates, a Business Profile API for business data location.\n\nI have mainly used the Geocoding API and the Places API for auto completing addresses. It helps standardize and sanitize address information so you don't get typos or mistakes in addresses.\n\nEach API has it's own pricing structure. The Embed API has no cost. The Places Autocomplete API is .017 cents for the first 100k uses then gets cheaper.\n\nSo if your case is just trying to show a google map box with a pin of your business location, use the Embed API. Otherwise you'll have to figure out what you are trying to achieve",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asf1my",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asf1my/why_are_tech_companies_so_comfortable_with/",
    "title": "Why are tech companies so comfortable with misclassifying contractors? Can I take those jobs and just report it to the IRS to become a W2?",
    "points": null,
    "comments": [
      {
        "comment": "I don't think that 1099 classification is as cut-and-dry as you think. Sure, generally speaking contractors have their own supplies and are paid for work, not for hours, but they can specify a number of hours per week if it is relevant (I was a 1099 with a specified number of hours per week), can provide tools (but cannot require that you use them). For example, when I worked as a 1099 I was required to work a specified number of hours (although had no particular schedule) as they were charging a third-party for my hours and I was provided a \"secure\" laptop, but was only required to use it to connect to a particular database, although most of my work was done on my own desktop.\n\nGenerally speaking, companies can require that you do an amount of work (by hours or other metrics), but cannot require how you do that work.",
        "points": "25 points",
        "children": [
          {
            "comment": "can provide tools (but cannot require that you use them).\n\nIs this really true? Usually (for big corps) you need to be on the company VPN to do your work, and only company computers are allowed on the company VPN.",
            "points": "3 points",
            "children": [
              {
                "comment": "I had that exact case, where I needed to connect to a VPN to retrieve specific data from a DB, and to communicate with that VPN I needed a specific device ID on a company provided laptop. I, perhaps, could have asked to do so from my own laptop, but it was too much hassle.\n\nThis is basically the equivalent of giving a contractor a key to your home and asking them to use it and lock the door when they aren't working. It may impose some restrictions on how you work, but it serves a logical purpose that couldn't really be served easily another way.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I suppose if you can connect to the company VPN with a personal device, you are allowed to use it. Good luck though.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "No that would certainly be illegal.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "One Saturday I had to come and haul stuff from one office to another. As an employee I had to do this because I got paid the same per hour as usual. Oh actually I got no extra pay. It was declared as a company party event. At least I have never seen the paperwork for the guys working on Sunday.\n\nElon Musk makes his software dev work on the manufacturing floor sometimes…",
            "points": "0 points",
            "children": [
              {
                "comment": "Yep, that is what a W-2 means. They can make you work whenever on whatever. The only \"protection\" it offers is the ability to quit at any time (in most of the U.S.) without breaking a contract (and being sued for breach of contract).",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I have been in a lengthy lawsuit with my multi-billion dollar ex-employer regarding this. In my case, I was “laid off” and not given any severance or support at all. And I have been struggling to find any new work in this current economy.\n\n“Contractor” on paper, but our relationship was employer-employee based on numerous factors, and verified by a government authority. Severance is something employees are legally entitled to where I live. Most companies simply don’t care, because people don’t even know they’re being mistreated, and David vs. Goliath lawsuits aren’t common.",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Its complete bullshit and you should lobby your congressman for meaningful change to the laws. Contractors get treated as second or third class employees and there are no laws in place to protect you.\n\nFor example, if you're a standard employee and your employer commits wage theft (either by not paying you the hours you worked or deducting/witholding pay because or 'reasons') then you can goto the state and report them and they'll lay the smackdown on them. If you're a contractor? No such protections, you're shit outtla luck unless you want to hire your own attorney to fight it. Because of this lots of contractors get shafted out of their final paycheck because they know that its worth it for you to hire a lawyer for $100/hr to fight it when you're only out $200. Sadly that's how most of our legal system is geared, you gotta pay to play, even when you're in the right",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m not sure, but I would assume there is something you’re missing in this equation. Big companies that do this (mine included if I’m understanding the situation correctly), have entire departments of lawyers that ensure they are not blatantly breaking the law. I feel like this is labor law 101 so, I would believe that what they are doing is in fact, not illegal, for reasons that you and I don’t understand.",
        "points": "10 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You should reach out to an attorney who specializes in labor/employment law, not people who can't even center a div.",
        "points": "4 points",
        "children": [
          {
            "comment": "I can center a div horizontally.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "A relative of mine sued his old employer for this very reason. The process took over a year and he paid his attorney most of the back taxes and settlement. I would say it is not worth it. Either take a contract job, or don't.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m no expert but I’m sure companies past a certain size have the means to take on that risk and they have already thought of covering their bases. So they could contract you for under 40hrs/wk, or they could pay overtime to comply with labor laws, etc. Then if you piss them off they could choose not to renew your contract, so you’re not technically fired for retaliatory reasons.\n\nSo if you tried this with companies, you’re now out of a job with a weak case, facing lawyer fees on your own dime if you can even take them to court because companies likely have arbitration clauses.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Good luck. This is America. The Employer is king",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "A lot of people don’t know this, but you don’t actually have to take a job if you don’t like the terms. You can just walk away.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think you’re missing the difference here:\n\nThe 40 hours a week on a schedule and provided equipment are something both businesses agreed to in the contract, as are any other terms there. If they want you to go 50 after the contract is established, you don’t have to- that’s not what you agreed on.\n\nFor a W-2, there’s no agreement there. Sometimes your employer offers a handbook of terms or some sort of employment contract so they absolve themselves of any weirdness by saying “Jim knew he would get fired for this, he signed it”. If your W-2 employer says, “hey you need to pull 50 this week and work on Saturday during core hours”, you either suck it up (maybe complain) or quit\n\nIndependent of any contract, your W-2 determines how you work; where you work; what you work; how you behave when you work. As a contractor, what you do is all picked out in your contract- as a W-2, if I wear a dumb T-Shirt on a call, they can get rid of me, but if there’s no clause on dumb T-Shirts in your 1099, they can’t terminate the relationship cleanly (unless your contract lets either party end at any time without repercussions)",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If I am compensated for the difference, I do not care what the classification is, whether they set my hours or not, provide equipment or not.",
        "points": "-1 points",
        "children": [
          {
            "comment": "So if you crash their system and they sue you for everything you have, when you could’ve been an employee, you’re ok with that?",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If you do that and pull that off, I would regard you as a hero, for the record (kind of a minor hero, but still a hero). I worry web development as a career is about to be on the downslide soon. So pushing back on things like this will be necessary soon, if it isn’t already. It’s probably getting close to time to unionize too",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Tech, in general, has been on a tear trying to roll back labor rights for a long time now. I don't know why anybody would expect any different at this point, they clearly want to get as much labor as humanly possible out of people while paying them as little as possible. From outright scams like WeWork to companies like Uber and Airbnb that promise to \"disrupt\" industries (i.e. move costs on to customers and contractors and degrade quality), and Elon Musk trying to get all his workers to sleep at their jobs. Why AREN'T you surprised that tech companies are OK with this?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don't think there's much money in this. The end result is that you get classified correctly and you get some taxes back.\n\nIt's not like a wrongful dismissal or discrimination suit.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asezr8",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asezr8/chess_website/",
    "title": "Chess website?",
    "points": null,
    "comments": [
      {
        "comment": "You can stick with what you know, like Node.js for the backend and React.js for the frontend. MongoDB works well for storing data, but you could also consider other options like PostgreSQL. To handle real-time updates in games, you'll need WebSockets, which let the server send updates to the client without waiting for requests.\nInstead of making an HTTP request for every move in a game, which could slow things down, you can use WebSockets to instantly update the game state as moves happen.\n\nGood luck with your project!",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1aseu01",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://arslanshahid-1997.medium.com/let-the-sunburst-the-complete-guide-on-how-to-plot-sunburst-charts-in-plotly-ef0eadfede83",
    "title": "Let the Sunburst! — The complete guide on how to plot sunburst charts in Plotly",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1asenzz",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asenzz/error_reporting_for_client_and_server/",
    "title": "Error reporting for client and server",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1ase1ux",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://i.redd.it/517trw60ezic1.jpeg",
    "title": "Bruno Api Client gave a Trojan?",
    "points": null,
    "comments": [
      {
        "comment": "maybe fake alert\n\nthere were short time a few months ago when windows defender was blocking specific Tor's version because windows defender thought it's malware. lol",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "False positive.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asdb5v",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asdb5v/does_rebuilding_an_old_app_in_a_new_language/",
    "title": "Does rebuilding an old app in a new language showcase enough knowledge to say you “know a language”?",
    "points": null,
    "comments": [
      {
        "comment": "“Knowing a language” is overrated. Most professional developers can get through tasks in any language (provided it’s not too esoteric), even if they’ve never used it before.\n\nAs long as you’re competent and know where to get help when you’re stuck, you’re fine.\n\nYou’re always going to be learning more about your tools, so at no point will you know everything there is to know.",
        "points": "60 points",
        "children": [
          {
            "comment": "I think this depends on the position you are applying for. Some places want you to hit the ground running with all the tips and tricks. They might want you to recognize the limitations of the Python GIL for multithreading or understand certain features for certain versions of a language or framework you use. Not having professional experience, but showcasing you have built it out in the language or framework or tools required for the jobs would probably put you above just saying you did something similar and not having anything to show. I guess its how much time you want to put in.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You’re always going to be learning, you might be using completely different languages in a few years to come",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"Knowing\" isn't really quantified. Why bother with the definition. Someone asks if you know X language, respond by saying you've done a, b, c in it for z amount of time.\n\nI dont think it's worth trying to obfuscate for an interview. If it's important to the interview they'll dig into it. If it's not important,  it probably won't help you.\n\nWould a junior dev working a year in X language \"know\" it? Probably. Does that make him suited for the hiring role? Maybe.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "the only language you need to know is assembly language",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Depends on the language and the size of the project. Building a web server in Go, you probably get a decent amount of the language. Building a web server in C++? Unless you have over-engineered it to hell and back you need another dozen other projects to leave the learning stage.",
        "points": "0 points",
        "children": [
          {
            "comment": "What if my immediate aim is to pass an interview?",
            "points": "0 points",
            "children": [
              {
                "comment": "What language?",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You can say you know a language when you're comfortable working on a real project using that language, without needing to look too much stuff up.",
        "points": "-12 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ascxcs",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1ascxcs/looking_for_fellow_developers_to_assist_on_new/",
    "title": "Looking for Fellow Developers to Assist on new Ambitious Project",
    "points": null,
    "comments": [
      {
        "comment": "Hey there, I'd like to know a little bit more about this if you're interested in sending me a message. What are the conditions of the project? Is it paid or a mock-up?\n\nI have experience in full stack development with Django/HTML CSS & Javascript, Linux and Ubuntu environments, AWS EC2, S3, IAM and Route 53 and AI/Payment APIs, so I feel I could bring a lot to the table given the right conditions.\n\nGive me a message if interested and here is my website",
        "points": "1 point",
        "children": [
          {
            "comment": "You seem extremely knowledgeable, and given that, I don’t know if you’d be interested because what I’m looking for is quite a rare breed, developers who are interested in helping without being compensated (at the current stage at least) I’d love to be able to pay people for helping but it’s more of an idea phase right now so at the moment it’s not really realistic.",
            "points": "-8 points",
            "children": [
              {
                "comment": "What stops these developers from just doing it on their own under a different name? What do you exactly bring to the table?",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Absolutely nothing. Don't you figure if I wanted to keep this idea to myself, I wouldn't have posted it on a worldwide message board? The idea of someone using this as a jumping point for their idea IS exactly what I'm looking for. I bring a different view, and some different ideas.\n\nAlso, the concept of a stock trading app with AI integration isn't exactly groundbreaking, so you won't see me scared to show my concept to the world.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1ascwad",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1ascwad/common_practice_for_service_dependencies/",
    "title": "Common practice for service dependencies?",
    "points": null,
    "comments": [
      {
        "comment": "The most common practice would be for the app would poll the API, and disable related functionality when the endpoint is down.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It really depends on what you need to do and what kind of resiliency you want; you can move the API requests out to a separate pool of workers, and only interact with the workers instead of the remote API. It might be however be overkill for smaller projects, and you instead handle request errors.\n\nWriting code that is resilient to these errors (I'm guessing init failing is because of authentication) is a sign of a slightly more experienced developer that has considered what the API being down actually means for their application.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asclrg",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asclrg/do_api_requests_reset_each_month_with_sanity/",
    "title": "Do API requests reset each month with Sanity?",
    "points": null,
    "comments": [
      {
        "comment": "Yes, this is monthly.\n\nBased on your data you can add some caching to reduce calls",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asanmn",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "https://arstechnica.com/information-technology/2024/02/nginx-key-developer-starts-a-freenginx-fork-after-dispute-with-parent-firm/",
    "title": "Nginx core developer quits project in security dispute, starts “freenginx” fork",
    "points": null,
    "comments": [
      {
        "comment": "I need an ELI5 on this...\n\nthe assigning of published CVEs (Common Vulnerabilities and Exposures) to bugs\n\nLike adding the CVE number to the trac ticket? Or defining those issues as bugs? Or just in general accepting that there are vulnerabilities in experimental parts of the software that need timely fixing?",
        "points": "81 points",
        "children": [
          {
            "comment": "I think it's raising a new CVE number for bugs found within QUIC.",
            "points": "25 points",
            "children": [
              {
                "comment": "Aah the other way around. They internally find a bug in an experimental part of the code and make a public security issue out of it. That makes more sense.",
                "points": "20 points",
                "children": [
                  {
                    "comment": "So the branching dev is aiming for \"security through obscurity\"?\n\n\"It's in everyone's best interest if we don't tell people about a vulnerability\"?",
                    "points": "8 points",
                    "children": [
                      {
                        "comment": "I can see the developer's perspective here. I used to work at Microsoft on a security team and we would not file CVEs for features that were not enabled by default unless we thought it was a reasonable thing for people to enable.\n\nIn this case, the developer didn't think this warranted a CVE because the code was technically experimental. F5 disagreed as they apparently believe the number of users running the mainline version (possible including code not present in a \"stable\" version) in production is high enough to warrant a CVE.\n\nAt the end of the day CVEs are more than just a security advisory -- there may be servicing implications as well beyond just fixing the bugs. The developer's argument was probably \"we haven't stabilized that yet -- we shouldn't be on the hook to service this\".",
                        "points": "29 points",
                        "children": [
                          {
                            "comment": "What are they gonna do, fire him? Is there some kind of legal obligation to service it?",
                            "points": "2 points",
                            "children": [
                              {
                                "comment": "I think that's where the real issue is. He is a volunteer core developer working on the project for free.\n\nF5 decides to issue a CVE disregarding the project policy and attempts to pressure him to prioritise it when he feels that it's not a priority since it's experimental.\n\nF5 has incentive to get the bug fixed because they sell a commercial product based on the open source code and they provide support and security guarantees to their customers.\n\nThis is a situation of a company taking advantage of a volunteer core developer for their own benefit and ignoring their opinions and project policies.",
                                "points": "19 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "As a dev, if you refused to fix bugs unless a CVE was assigned to it - How many bugs would get fixed?",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Article worth a read. Siding with F5 who develops nginx and not the developer on this issue as it reads",
        "points": "144 points",
        "children": [
          {
            "comment": "I know, it feels weird siding with the corporation but CVEs are not bad things. We/programmers make mistakes and CVEs are issued to address and correct them. CVEs are not a judgement on coding acumen but are a benefit to the general community.\n\nThis is also the first time I have read that nginx has surpassed Apache as the most popular web server.",
            "points": "133 points",
            "children": [
              {
                "comment": "The creator of curl would disagree with you on CVEs. He’s addressed multiple false CVE reports.",
                "points": "39 points",
                "children": [
                  {
                    "comment": "I read some of that discussion, and the issue seems to be less about CVEs themselves, and more about useless idiots using off the shelf scanners with no understanding of actual exploit detection reporting bullshit findings using AI generated reports, hoping to cash in on some ridiculous bug bounty.",
                    "points": "64 points",
                    "children": [
                      {
                        "comment": "Do you have links to that discussion? I can't easily find it on Google, probably using the wrong terms.",
                        "points": "10 points",
                        "children": [
                          {
                            "comment": "https://daniel.haxx.se/blog/2023/09/05/bogus-cve-follow-ups/\n\nThis is a follow up, with a link to his original post in the first paragraph.",
                            "points": "29 points",
                            "children": [
                              {
                                "comment": "Thanks for the link. Its wild how the bodies responsible for maintaining the database of security vulnerabilities (which by their very nature tend to be highly technical issues) shows such little regard for their concrete technical details.",
                                "points": "9 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yeah I'm not seeing any reason to be angry... F5 assigned a CVE to an exploitable vulnerability in NGinx. That's exactly what they're supposed to do as a responsible CNA. The fact that the code is labelled as experimental doesn't change anything, and assigning the CVE doesn't affect release schedules or anything. I'm baffled and have absolutely no idea what Maxim's reasoning is.\n\nEither Maxim doesn't understand what a CVE is, or there's something he's not telling us...",
            "points": "15 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Seems like a rare case where people had a difference of opinion and principle, and then split without any real animosity.\n\nWe obviously don't see behind the scenes, but at least publically I have no problem with F5's explanation nor the fork.",
        "points": "41 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not sure its news, happens all the time with OSS.. he's free to do whatever he wants.",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You can find more context here: https://news.ycombinator.com/item?id=39373327",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think it's pretty simple. He and his cofounders sold to F5 with the understanding he would still lead development, with a paycheck.\n\nRussia starts the war, now he's leading dev without getting paid by F5. The Russian devs spin up a company to serve Russian customers.\n\nHow can two companies suitably serve their customers' needs when one is determining task prioritization and calling all the shots? He saw the writing on the wall.\n\nI think splitting customers between companies should have meant a fork from the beginning, or at the least a split in stake on the project. Declaring this will be the \"free\" nginx... yeah idk about that. Seems like a personal/business decision",
        "points": "0 points",
        "children": [
          {
            "comment": "Imho the Angie fork was made for this. https://github.com/webserver-llc/angie",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1asa4jd",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1asa4jd/best_practice_site_for_htmlcssjavascript/",
    "title": "Best practice site for Html/Css/Javascript",
    "points": null,
    "comments": [
      {
        "comment": "You don't need to memorize anything except for the most basic syntax. Just build things and if you don't remember something google it, that is the best way to practice.",
        "points": "13 points",
        "children": [
          {
            "comment": "Very true! I kept all of the presentations, projects etc from college on a harddisk. I thought i was going to fall back to these often while at work. That hasnt happened once. Not that i dont forget anything, its just faster to google something.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Codewars for javascript",
        "points": "8 points",
        "children": [
          {
            "comment": "absolutely agree, it makes your problem solving skills rocket",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Thank you!!!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Checkout Frontend Mentor.",
        "points": "6 points",
        "children": [
          {
            "comment": "+1\n\nThis website is too good and the best part is they said u can put those projects in your portfolio ( see their faq)",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Frontend Mentor\n\nhaha awesome, exactly what OP was looking for I think?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Thank you!!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "https://cssgridgarden.com/",
        "points": "4 points",
        "children": [
          {
            "comment": "Thanks man :D",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "https://codepen.io/",
        "points": "2 points",
        "children": [
          {
            "comment": "Thanks man!!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "frontendmentor.io",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Memorization is not the path, long term. Best practices evolve with the times.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "why not just make a local index.html, script.js, and style.css files\n\nthen develop locally without needing a 3rd party site",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Dribbble! Find a design you like and recreate it",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "!remind me 11hours",
        "points": "0 points",
        "children": [
          {
            "comment": "I will be messaging you in 11 hours on 2024-02-17 08:03:08 UTC to remind you of this link\n\n2 OTHERS CLICKED THIS LINK to send a PM to also be reminded and to reduce spam.\n\nParent commenter can delete this message to hide from others.\n\nInfo\tCustom\tYour Reminders\tFeedback",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Create your own site? You don't even need a webserver. You can save the document on your computer and reference any CSS / JS locally, and open it as a local file in your browser.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "cssbattle.dev",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1as9wka",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1as9wka/ambush_on_twilios_video_sdk_issue/",
    "title": "Ambush on Twilio's Video SDK Issue",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1as90zy",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1as90zy/tailwind_react_newbie_question_indexjs/",
    "title": "Tailwind & React newbie question - index.js??",
    "points": null,
    "comments": [
      {
        "comment": "First of all, React is a JavaScript framework that uses a virtual version of the DOM. The reason you would build the HTML outside of the HTML-files (like we used to back in the day) is mostly due to that virtual DOM, which enables reactivity and splitting up the code into re-usable components,\n\nIt's far more complex than that, but that's the quick version.\n\nYou can use React in different way, like \"mounting\" a react app / component or simply building the whole website as a React app.\n\nYour questions cover many long topics, and to answer your SEO question; yes it has implications, but you have different ways of \"rendering\" the React code these days:\n\nSSR (Server-Side Rendered): Renders the React code to HTML server-side, much like PHP.\n\nSSG (Server-Side Generated): Pre-renders the React code to HTML server-side, often referred as static.\n\nClient-side only: Only render the React code in the client, I guess it's the SPA (Single-Page App) approach.\n\nI'd say the first ones are most common these days, using frameworks like Next.js for React.",
        "points": "4 points",
        "children": [
          {
            "comment": "Awesome, thx! Would you say the first 2 'rendering' methods are a way to overcome the SEO limitations? Any advice on learning this workflow or potentially going another way as I'm updating skills?",
            "points": "0 points",
            "children": [
              {
                "comment": "SEO is mostly what the search engine bots can read while browsing your website, and they don't typically have JavaScript enabled.\n\nSo when I think SEO-friendly, I typically think that the most vital elements (source code) should possible to see without JavaScript enabled, which is why CSR (client-side rendering) is really bad.\n\nI don't know enough to say I'm an expert in everything SEO, but since both SSR and SSG render the markup server-side before presenting it to the client, it should be rather SEO friendly.\n\nIf you want to dig into the rendering methods, think of SSR as a dynamic website and SSG as a static website.\n\nSSG is probably the most solid in terms of SEO-friendliness as you pre-render the whole website which is basically like going back to serving pure HTML / CSS files, but with better developer experience.\n\nMind you that most of the popular fullstack frameworks like Next, SvelteKit, Nuxt and Astro enables you do mix SSR and SSG, which is normally explained as Hybrid Rendering.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Incredible, thx again. Good stuff here, also make me say 'damn, I'm old' haha. But this helps me make a better plan for what I need to focus on learning here and a possible workflow.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I know how it feels! I myself started with web development back in 2005-2006, when JavaScript wasn't that big of a deal and kept ignoring it for YEARS (I even managed to dodge all of jQuery and Bootstrap, that long)\n\nOnly really picked up JavaScript a few years ago because I felt like I wanted to start moving towards working as a professional developer, but React put me off so I started my new journey with frameworks that were closer to vanilla JavaScript, which in my case was Svelte initially, but then moved over to Vue.\n\nIf you happen to have worked with jQuery before, have the mindset that vanilla JS basically have everything now that jQuery was necessary for back in the day.\n\nAlso don't ignore learning vanilla JS as a whole, it will really help you moving over to other frameworks in the future as well.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "Sounds familiar, avoided it as long myself. Appreciate the advice, will definitely look into vanilla as well",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "As a sidenote; I'm a frontend developer that prefer to work in any framework that is not React, so if my view of React is outdated, sorry in advance :D",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I'd say the first ones (SSR and SSG) are most common these days\n\nJust as there's an invisible population of Angular devs that people on this subreddit get surprised exist when some industry relevance metric reveals their existence, there's also a large number of projects using the plain CSR SPA architecture. It's the best way to make task-oriented, browser-based applications. They don't need SSR and can't use SSG.",
            "points": "0 points",
            "children": [
              {
                "comment": "I've only ever encountered Angular in a SaaS app environment and I agree, CSR definitely have it's use cases.\n\nWe do a lot of enterprise websites where I work, where parts of a page use a mounted CSR approach. We usually pair that with a non-JavaScript backend though.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Appreciate this response, cleared things up for me too",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "There are some advanced setups that can allow you to use React in piecemeal in a static HTML/CSS, but for where you're at you should avoid those to start. This is not a common use case.\n\nFor all intents and purposes, React should be considered your full framework that handles all your page and component creation. JSX, React's preferred syntax, involves colocating and writing your JavaScript and HTML together in the file. Thats the way web frameworks have moved to in the modern web, there's usually some version of a virtual DOM and your framework of choice handles all the rendering of markup instead of just adding specific reactivity to a button by querying the ID or something.\n\nIf the React experience with JSX templating is not your cup of tea, you want a framework where there are more distinct separations for markup, styles, and logic, I'd suggest looking at Angular or Vue as they both approach component/page creation with some more clear separations. You could also just use plain old JavaScript or Jquery inside script tags, still totally valid!\n\nAs far as that tutorial goes, the index.js stuff is fine--like I mentioned React components and pages are full on JavaScript files that render out to HTML in the broswer. However, if it's not clicking with you then there's plenty others out there. I've been a huge fan of Wes Bos as an instructor, and he has an up to date React for a Beginners course that is on sale. If you want something free I'd honestly start with the [react.dev official docs](react.dev) or try this started project from Web Dev Simplified where he runs through a tutorial in the official React docs.\n\nIf you're worried about SEO, React docs officially recommends using Next.JS . It's a \"meta frameworks\" that bootstraps and extends a React project with routing, file directories, and most importantly an easy way to server render your website like a static HTML or PHP website. There are some more things that NextJS can handle on top of that, but you can explore those in the docs as need be. You're already learning a ton and don't need to overwhelm yourself more than intended!\n\nAnd lastly, on that note, feel free to narrow your scope a bit too if it helps. Just focus on a few basic tutorials, make the standard Todo list app, then add in tailwind and page structure and all that fun stuff, haha.\n\nI know this was a huge info dump, hope it helps, and feel free to ask more questions if you have em!",
        "points": "1 point",
        "children": [
          {
            "comment": "Incredible, thx... along with the previous 2 comments, yours really finally helped it make sense in my mind haha. That's why I always see that next.js file on sites I peep. Good stuff, thx so much!",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "code the site in JS via React\n\nReact bros will love to tell you: \"It's just a lib, you can use it as much or as little as you want!\". But in practice react really wants to be in charge of everything.\n\n​\n\nindex.js\n\nThis is the thing that instantiates your react app. Depending on your local build tool, you may also get an index.html file that is just a <head> <body> and an empty <div>. React squirts the entire app into that empty div and makes changes to the DOM dynamically based on the changes that happen in react's virtual dom.\n\n​\n\nif this is the way to use React/Tailwind\n\nTechnically no, but realistically, yes. You can load all of Tailwind via a single huge (and I mean huge, it's like 2MB) css file, but if you let js run the show via a build tool like vite/webpack/turbopack/etc, Tailwind provides utilities to remove all the tailwind classes you don't use in your app.\n\n​\n\nwhat are the implications of not having HTML for SEO, etc.\n\nThey're bad. CSR (client-side rendered) apps have notoriously bad seo. The react community historically has not cared that much about semantics or seo. That's changing a little bit nowadays but I still bump into \"lulz <div onClick={} /> go brrrr\" devs and their awful code all the time.",
        "points": "2 points",
        "children": [
          {
            "comment": "Great info, thx! Personally, would you recommend going this route and learning to code the site in JS, or some other workflow (I see what you mean about the CSS file) for using Tailwind with React... or should I look into another method altogether of utilizing mew frameworks to build somethijg via HTML/CSS/JS?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1as909l",
    "subreddit": "r/webdev",
    "dataType": "link",
    "dataUrl": "/r/webdev/comments/1as909l/what_to_do_next/",
    "title": "What to do next?",
    "points": null,
    "comments": [
      {
        "comment": "I still thinking if is a good option to switch from Django to other web frameworks\n\nThe grass is always greener on the other side!\n\nPutting aside the talk about job opportunities, I would recommend the switch only if you are not satisfied with Django.",
        "points": "1 point",
        "children": [
          {
            "comment": "I really like Django, but sometimes it seems like I get in some problems with it",
            "points": "0 points",
            "children": [
              {
                "comment": "I get in some problems with it\n\nDo you think they are only due to Django or also due to Python? I saw that you also mentioned programming languages.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "I really don't know, but I think the problems are with Django",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  }
]