[
  {
    "id": "t3_1b8qgiq",
    "subreddit": "r/tech",
    "dataType": "link",
    "dataUrl": "https://www.theverge.com/2024/3/2/24088867/hp-all-in-plan-printer-rental-instant-ink",
    "title": "HP is in the rent-a-printer business now",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1b8gqzp",
    "subreddit": "u/SaladChefs",
    "dataType": "link",
    "dataUrl": "https://salad.com/download?utm_source=reddit&utm_medium=promoted-posts&utm_campaign=reddit-crypto-1&utm_content=golden-ad-suite-2",
    "title": "Earnings down? Keep your fancy GPU from gathering dust. Download Salad, start chopping, and earn up to $200 per month.",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1b7zi7o",
    "subreddit": "r/tech",
    "dataType": "link",
    "dataUrl": "https://cen.acs.org/materials/biomaterials/Barnacle-proteins-protect-metals-corrosion/102/web/2024/03",
    "title": "Barnacle proteins protect metals from corrosion in salt water The adhesive proteins stick to steel and form a complex with iron ions in the alloy, creating a protective coating",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1b837jh",
    "subreddit": "r/tech",
    "dataType": "link",
    "dataUrl": "https://newatlas.com/architecture/wave-house-3d-print-europe-largest/",
    "title": "Europe's largest 3D-printed building rises in just 140 hours",
    "points": null,
    "comments": [
      {
        "comment": "Loving the photoshopped landscaping and children playing outside.",
        "points": "80 points",
        "children": [
          {
            "comment": "The guy is holding his jacket behind his back",
            "points": "9 points",
            "children": [
              {
                "comment": "It’s a good neighborhood lmao",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "“The Wave House’s interior is utilitarian and windowless”\n\nAh yes, much like a dank cave",
        "points": "13 points",
        "children": [
          {
            "comment": "It is a data center, so they didn't want windows because of security concerns.",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It will be really interesting if this or assembly line methods using semi traditional materials will help bring affordable homes to people.\n\nUnfortunately I assume regulations will be the largest hurdle.",
        "points": "25 points",
        "children": [
          {
            "comment": "https://amp.theguardian.com/society/2014/feb/23/europe-11m-empty-properties-enough-house-homeless-continent-twice\n\nThis isn’t going to help bring affordable homes to people. The homes already exist and sit vacant. Homeless people can go to them instead of needing to build new shit like this which (surprise) will also be sitting as vacant homes",
            "points": "23 points",
            "children": [
              {
                "comment": "Vacant homes has something to do with the housing shortage but the reality is also that not enough homes are produced to drive down cost. At least in the US where home builders slow down well before they need to to keep prices high and qty of homes for sale lower.\n\nIf you can drive down cost through simplifying the building process then it wouldn’t hurt. I’m talking mass building 900 square foot starter homes for people in their 20s. Current construction companies have little incentive to build small due to it being a better investment for them to use their resources (labor/knowledge) to go big.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Vacant homes literally means there’s an over abundance of homes per person\n\nWhat are you talking about",
                    "points": "14 points",
                    "children": [
                      {
                        "comment": "Both of you are wrong. Vacant homes can mean a lot of things - unsafe/condemned buildings, problems with the land, being out in the middle of nowhere, and yes, existing real estate in an area being owned by corporate landlords. Similarly, 3D printing doesn’t practically solve any of the major costs of construction - this “building” is basically just concrete without rebar reinforcing it, and I would doubt it has electrical or plumbing unless a traditional construction crew went in afterwards. It’s basically just an art project, not something that can solve the housing crisis in any meaningful way.",
                        "points": "5 points",
                        "children": [
                          {
                            "comment": "No I’m talking about vacant homes that are owned by occupied by no one because they own a second or more homes.\n\nThere’s enough vacant homes to house the homeless and not have issues with running into them all magically being condemned or something else that’s trying to act like the solution isn’t as easy as “a person needs a place to live, so give them one”. And nots even touching apartment spaces, these are just houses",
                            "points": "3 points",
                            "children": [
                              {
                                "comment": "That specific scenario is VERY rare - there’s not actually enough rich people owning unused property in multiple cities that that’s enough to cause a housing crisis on its own. The bulk of second homes are currently being rented out. There are absolutely issues with rentals that can cause housing crises - ie, landlords scooping up property in tourist towns and using it as short-term rentals that residents can no longer use - but that’s an entirely different scenario than what you’re describing.",
                                "points": "-3 points",
                                "children": [
                                  {
                                    "comment": "Lmao there 100% is. You do not realize we live in a country where homeless people exists but vacant homes are double than the population unhoused.\n\nThis is literally shown to you in WHY we have this problem",
                                    "points": "3 points",
                                    "children": [
                                      {
                                        "comment": "Driving down home prices by mass producing homes WILL fix that problem by making homes places to live instead of invest in. Fixing it by forcing people to sell second homes or corporations to not invest in single family homes is a much bigger road block then simply finding ways to mass produce affordable homes.\n\nThat is my point in all this. While today this type of printing is for art tomorrow you can overlay other equipment to lay wiring, plumbing via similar automated equipment to the printer that made this structure. Hence my interest of where this goes in the future.",
                                        "points": "2 points",
                                        "children": [
                                          {
                                            "comment": "I wouldn’t support that. Maybe cap the ownership limit on two. If I could afford a beach house somewhere I should be able to buy it.",
                                            "points": "0 points",
                                            "children": [],
                                            "isDeleted": false
                                          },
                                          {
                                            "comment": "I don’t think that option is a “much bigger roadblock” when you have to consider urban development and urban sprawl. Places like Texas, that’s completely okay since they have lots of land and are willing to build roads and infrastructure.\n\nOther cities that are short on land mass are not so lucky. You have to find empty acreage to build the homes, build roads to connect those communities, run utility lines like power, water, and internet, and then create some sort of draw for businesses like gas stations or grocery stores. Otherwise people will still be spending $250k-$350k to live 30 minutes away from the nearest place to buy a jug of milk and rely on satellite internet.\n\nI really wish I had your optimistic outlook for the future of automation and utility lines, but I just don’t see how robots are gonna help weld pipes and lay them faster than a human is. That technology will be beyond our lifetime, that’s for sure.",
                                            "points": "0 points",
                                            "children": [],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      },
                                      {
                                        "comment": "What source are you citing for this information?",
                                        "points": "0 points",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "Condemned homes and unlivable homes are not counted as part of the vacant homes statistic in the United states.",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "Yeah like Detroit's $1 homes. Sounds like a steal but you're gonna be spending hundreds of thousands renovating or demolishing/rebuilding. Crack dwellers come free.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "3D printed homes have two walls, inside and outside with a space between for plumbing and electrical, etc…. I looked into these; however, not an engineer or construction worker, so I’m not sure what effect the lack of rebar reinforcement is on these buildings. There were small metal plates spread throughout, though.\n\nThey’re kind of ugly, but they’re cheap to build and require far less labor. There are still definitely various trades needed on the site. They mostly have standard roofs as well, so there’s that also.",
                            "points": "-1 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "There are over 16 million vacant homes in the United States right now. Many of those are second homes or vacation rentals, that are not occupied. In desirable locations as well.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I'm almost curious why homeless people don't look for vacant homes and just squat in them?",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "There's 40 million vacant, livable, unowned homes in America. There's more than enough to lower the price",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Sadly this isn’t the part that takes a ton of time. Finishing up all the electrical, plumbing , hvac, drywall, and finishes is what takes forever.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Any old matter will do!",
            "points": "0 points",
            "children": [
              {
                "comment": "What about a log from a hole in the bottom of the sea?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The cost of building the property and materials is essentially irrelevant.\n\nThe main issue is property speculation.\n\nIf you banned any person or company from owning more than one domestic home, the price would normalise instantly (likely crashing the entire economy.)",
            "points": "0 points",
            "children": [
              {
                "comment": "This country was actually built on a property rights and laws protecting the ownership of and rights to property- be it real property, personal property, etc. Limiting ownership of real property to one unit per entity is highly unrealistic and easily worked around. In the real estate industry, properties are typically owned as single purpose LLCs, in effect separate entities owning each property. Not possible to limit or police the ability to create single purpose entities that purchase and own property.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Banning a person from owning more than one home is a bit too far, there are legitimate use cases for rentals.\n\nThat said, a residential home should be required to be owned by a person and not a corporation or LLC. Foreign Nationals/non citizens should not be able to own property unless they live in it full time (7 or more consecutive months out of the year). Property that does not have a full-time resident as defined above should also incur a 10x property tax penalty If the median housing cost is greater than 5x median individual income (~40k/200k for 2023 in the US. Actual median house prices are over 400k).\n\nEdit: looking at it financial advice says you should aim for a house three to five times your income, so I would maybe actually set it to 3x instead of 5x. That also exemplifies how bad the housing situation is though, because right now the 50th percentile price of a house is 10 times the income of the 50th percentile earner.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "It’s an unrealistic imo.\n\nI’d rather advocate for something realistic like mass producing affordable homes.\n\nNo part of the United States govement will ban property speculation unfortunately so no real sense in spending time on it.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "But you literally can't mass produce affordable homes because the price floor is set by the speculative market.\n\nYou could build a house out of paper mache for $15 and the moment it went to auction it would be going at the astronomical market rate.\n\nFor homes to be affordable you would need to build an entire parallel housing stock allocated by lottery and sold at a massive loss, because whatever land you build them on would be sold to you at the market rate. Unless the government is going to just claim eminent domain on a huge swath of our cities that's just not happening.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "But you can limit it to first time home buyers through government programs.\n\nYou can force it to be primary homes only.\n\nBut overall any amount of homes help. You’re acting like a higher supply does nothing to aid buyers coming into the market.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Because housing isn't a transferable good. You need it to be close to other things like jobs and amenities. Building a million cheap houses in the desert is completely useless, but you can't build a cheap house when the block of land is $500,000 alone.\n\nThe main way to build affordable housing is density. You buy less dense buildings in desirable locations and you double or triple the density so more people can live in the same space. It literally doesn't matter how you build it because the materials - again - are essentially irrelevant to the cost of the dwellings compared to their location and market value.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "500k buys a lot more than land in a lot of places.\n\nAgain do you really thing the government will EVER force the sale of secondary homes and ban investment groups from mass buying housing to drive up the market?\n\nAt least if you use government programs to help incentive starter communities people would have a shot.\n\nGovernment spends trillions on all sorts of crap. They cant give hud a few extra billion to come up with materials and building processes to mass build affordable housing and force localities to make them legal?",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I am 100% positive that here in the U.S. we will not have affordable housing, regardless of the materials used in the units.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "140h is the benchy in draft mode on my Ender 3.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can I have a house now please?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can they print me a house? Australian homes are insanely expensive",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Neat. Now do the seismic test.",
        "points": "1 point",
        "children": [
          {
            "comment": "Because there’s a lot of earthquakes in mainland Europe right? 🙄🙄",
            "points": "8 points",
            "children": [
              {
                "comment": "Okay, fine, there’s no need to check, you’re certainly the expert. 🤨\n\n3D printed stuff is not ideal in layer-to-layer strength. Is it pretty? Sure, kind of. Is it a great safety plan? Probably not.",
                "points": "-3 points",
                "children": [
                  {
                    "comment": "Is there any reason to suspect that this building did not meet the building code for that area?",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Are there reasons to think that a process designed for aesthetics and speed isn’t a process designed for structural strength and safety?\n\nYes.\n\n(I understand that this isn’t an occupied structure, I do.)",
                        "points": "-3 points",
                        "children": [
                          {
                            "comment": "That is not what I asked.\n\nAlso, can you provide a source that says what they used here is not as strong as other building methods?",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "You mean other than that it’s new, it’s novel, and it’s never been done before?\n\nEvery time someone talks about European buildings, it’s that they’re intended to last forever because their building methods are significantly stronger than others.\n\nAll the references to this are “cement-like” material and “look how fast”.\n\nNo, I don’t have a reference to its strength, and neither do you.",
                                "points": "-2 points",
                                "children": [
                                  {
                                    "comment": "So, you have no reason to believe this building is inferior, yet you keep going on about how it isn't good.\n\nBuilding codes are there for a reason.",
                                    "points": "1 point",
                                    "children": [],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "bro operating purely off vibes",
                                    "points": "4 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "We didn’t have any codes except state plumbing code in county 30 years ago. Just cause it meets the codes, consent means it’s safe. We need more info to make a decision.",
                        "points": "-2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Printed with what?",
        "points": "1 point",
        "children": [
          {
            "comment": "its usually concrete with some mesh ever few layers I believe, could be wrong though",
            "points": "6 points",
            "children": [
              {
                "comment": "That’s pretty cool then. Wonder what program they use.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "\"a recyclable cement-like material\"\n\nhttps://bnnbreaking.com/world/germany/wave-house-unveiled-europes-largest-3d-printed-building-revolutionizes-data-center-design-in-heidelberg",
            "points": "3 points",
            "children": [
              {
                "comment": "Cement-like? Reminds of pleather. Lol.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Pcement",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This feels like it should be used for building Universal Basic Housing but will end up being used for billionaires or something. No I didn’t read the article.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Worlds largest spool of printer filament still missing",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Zordon?!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Looks like cake",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Cool but also looks like shit",
        "points": "0 points",
        "children": [
          {
            "comment": "It is a data center, which they didn't want to have windows for security. (I think there is a MS joke in there).",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Looks better as a warehouse than a home.",
        "points": "-3 points",
        "children": [
          {
            "comment": "Probably because it’s a data center and purposefully doesn’t have windows",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This Texas Company3d prints houses AND more interesting projects like melting the dust on the moon to make stable landing pads and shelters.\n\nI do believe the home structure we watched on the video had rebar reinforcing and cutouts for plumbing, electrical etc.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I wonder what the acoustics are like",
        "points": "-1 points",
        "children": [
          {
            "comment": "It is a data center, so I don't think the humming computers care.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1b7zugy",
    "subreddit": "r/tech",
    "dataType": "link",
    "dataUrl": "https://newsroom.ucla.edu/releases/ucla-equatic-to-build-largest-ocean-based-plant-for-carbon-removal",
    "title": "UCLA and Equatic to build world’s largest ocean-based plant for carbon removal. The $20 million system in Singapore will be capable of removing 3,650 metric tons of CO2 per year.",
    "points": null,
    "comments": [
      {
        "comment": "What is 3kt of CO2 equivalent to? How many mature trees are needed to do the same removal? How many typical US households does that 3kt equate to?\n\nArticle doesn’t contextualise the amount well enough.",
        "points": "60 points",
        "children": [
          {
            "comment": "US average is 14.4 t / capita. World average is 4.8 t / capita. So roughly 250 Americans worth, or 760 people worldwide.",
            "points": "56 points",
            "children": [
              {
                "comment": "So to make the equivalent US population CO2 neutral you’d need roughly 1,332,000 of these stations. At a cost of $20,000,000 per station that’s only… $26,640,000,000,000. Twenty six trillion dollars. Pocket change I tells ya!",
                "points": "37 points",
                "children": [
                  {
                    "comment": "Presumably at that scale their would be some considerable economies of scale, but yes the reality is that to build an infrastructure of any type to cover the entire USA population requires crazy money.\n\nWhat we need not do is let perfection prevent progress. Just because this one project or technology is currently expensive, doesn’t mean it will always be expensive. Over time they will become both more efficient and less expensive.\n\nIf we looked at the cost of telephone lines, railroads, or roads, and extrapolated the cost of a small project across an entire population, I’m pretty sure most people would have said those ideas were crazy too",
                    "points": "33 points",
                    "children": [
                      {
                        "comment": "There is no path where removing carbon from the atmosphere makes any sense. Any renewable energy you use to do it is renewable energy that isn't replacing fossil fuel capacity. \n\nWe need to stop adding carbon to the atmosphere first, and quickly. Simultaneously, we need to find the geoengineering solution with the fewest consequences and roll it out as soon as possible. \n\nThen, once both of those are accomplished, and we have so much renewable energy we don't know what to do with it, then maybe we can start sucking carbon out of the air.\n\nAs it is, all this technology accomplishes is the ability for fossil fuel companies to pretend they don't need to wind down.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "If we stopped emitting any carbon today, we would still need negative emissions to get back to normal. Projects like this and ClineWorks etc are setting us up to be able to do that in the future.\n\nSo in the US we invest hundreds of billions of dollars in renewable energy: https://about.bnef.com/blog/renewable-energy-investment-hits-record-breaking-358-billion-in-1h-2023/\n\nBut only about a billion in negative emissions: https://www.reuters.com/business/energy/us-awards-12-bln-oxy-climeworks-led-carbon-air-capture-hubs-2023-08-11/",
                            "points": "11 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "We still need to start developing carbon sink tech while we stop putting it into the atmosphere, otherwise we’ll just lose 20 years of development",
                            "points": "8 points",
                            "children": [
                              {
                                "comment": "The most effective carbon sinks are life. We've been burning millions of years of life and putting it into the atmosphere over the course of a few decades.\n\nThere is no way to put that genie back in the bottle because we don't have a way to make plants/fungi/algae grow at 1000x speed.\n\nIf we're not using life to do carbon capture then we have to use machines, but those machines will use power, and it's going to take oodles more energy to compress and store the carbon than we have.\n\nWe're fucked, dude.",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "There is a path where this makes sense. Assuming we have overcome climate change in the future, this technology could have enormous implications.\n\nPerhaps we have reached a carbon neutral energy production, this would essentially allow us to use excess renewable energy to reverse climate change.\n\nEven further still, stabilizing the carbon environment within non-earth systems is essential in any large scale biome.\n\nI understand that this seems like an insignificant and rather counterintuitive technology.\n\n“Why would I buy and learn to drive a Model T when only two cities can handle cars. I’ll stick to my horse.”\n\nSaid the American at a car dealership 100 years ago.\n\nThis won’t fix climate change. But this how we start to change the climate.",
                            "points": "3 points",
                            "children": [
                              {
                                "comment": "Yes, and we can work on it when we've solved the carbon being emitted problem. Until then the singular purpose of this technology is to convince people we don't need to stop using fossil fuels.",
                                "points": "-3 points",
                                "children": [
                                  {
                                    "comment": "Yes, and we can work on it when we've solved\n\nWrong. Parallel development is required so that when we can take advantage of it, we can take advantage of it immediately. There is a ton of money going into renewable development, there is plenty to go around to invest in this technology.\n\nUntil then the singular purpose of this technology is to convince people we don't need to stop using fossil fuels.\n\nBullshit. That is how you are interpreting it. Anyone sane realizes we need to reverse climate change, not slow it. Pretty sure UCLA and Singapore have a better grasp on it than you, and they aren't funded by fossil fuel companies. Try again.",
                                    "points": "3 points",
                                    "children": [
                                      {
                                        "comment": "Pretty sure UCLA and Singapore have a better grasp on it than you, and they aren't funded by fossil fuel companies.\n\nThat would make them unique, because literally every other carbon capture company was either founded by or funded by fossil fuel companies, and they are the only ones pushing this technology.\n\nYes, we need to reverse climate change. But that gets exponentially harder the longer it takes to decarbonise our energy, and every watt used for this boondoggle and others like it is a watt that isn't replacing a fossil fuel.",
                                        "points": "-3 points",
                                        "children": [
                                          {
                                            "comment": "Yes, we need to reverse climate change. But that gets exponentially harder the longer it takes to decarbonise our energy, and every watt used for this boondoggle and others like it is a watt that isn't replacing a fossil fuel.\n\nThere is more than enough money to do both. It is not a one or the other case. Carbon removal tech is going to take a long time to develop. I look at it as a comparison to solar panels in the 70s when Carter put them on the White House. Everyone decried it for whatever reason, and now it's becoming the primary green method of energy generation, 50 years later after decades of consistent development.\n\nThe research has to start somewhere, and it isn't going to be an immediate solution. Right now, they are investing in the tech so it gets better in the future.\n\nAnd regardless of who is funding it and completely ignoring whether they're doing so altruistically, I'll support any of those companies pushing the tech(in this specific instance, fuck fossil fuel companies, they're the reason we're in this mess), purely because it's a necessity. A broken clock is right once every century in this case. The more money pumped into it the better.\n\nMarket realities are already driving a reduction in fossil fuel usage. The war in Ukraine, the rapid adoption of electric vehicles, the widespread growth of solar, wind and other renewables, etc. Development of carbon removal tech doesn't happen in a vacuum, everything else you would like to see accomplished is already being accomplished as we write these comments. The process is already in motion.\n\nI'm glad we're getting started on this research now. To make it practical to utilize, it's probably going to take another 10-15 years of development minimum. We don't have the time to kick the can down the road to start that 10-15 year development window.",
                                            "points": "1 point",
                                            "children": [],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "We needed to start doing this around 40 years ago. 🥺",
                            "points": "4 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "I feel like the first statement is a bit overreaching. Perhaps it applies in most instances, but certainly the solar power being consumed in these stations in the ocean aren't very easily supplied to the rest of the mainland. So to argue it's energy that could have gone to fossil fuel replacement is mildly disingenuous.",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "Where do you think we build offshore windfarms and tidal power",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "To be fair, they are removing the CO2 from ocean water. The concentration is about 200 times higher. However, this is still fairly low.\n\nAlso, if they produce a limestone-like solid material, how is this different than simply harvesting seashells and sequestering them?",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "fewest consequences and roll it out as soon as possible.\n\nThats not how science works though.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "The science is largely done, what is needed is risk assessment. We can't wait for absolute metaphysical certitude before we act, just the best option to our best understanding.",
                                "points": "0 points",
                                "children": [
                                  {
                                    "comment": "Science is an ongoing thing. R&D is decided by ruling bodies for the most part. They provide the means, and people, to work on making that “thing” a reliable product or application for their intended purpose, proof of concept.\n\nThen there are various other stages in which new boundaries are being broken and fields tested, like how we only have vaccines because of a century or more of data gathered or how we went from needing a 20x20ft room for one singular computer that ran off mbs of ram to 1tb thumb drives and 32gb ram cards.\n\nSo something might sound as simple as least consequences roll it out but the efficiency and lifespan of the product needs to improve 1000x to be something that is truly viable.",
                                    "points": "0 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "This kind of post just highlights how out of touch people are. You have zero idea what it would take to get to that point. Not only that but you completely gloss over the fact that places like India and people like Elon Musk won't just stop until it is cheaper for them to do so. I can choose to have a carbon negative footprint for the rest of my life and idiots like that will keep fucking us in the ass. Until legislation is passed and countries are held accountable nothing will change.",
                            "points": "-1 points",
                            "children": [
                              {
                                "comment": "What does that have to do with carbon sequestration being a sham",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Is the goal (1) to go to zero carbon per person nation/worldwide or simply (2) to reduce it to a level that Earth's carbon cycle can process without cumulative effects?\n\nIf (2), there is a whole different set of numbers to crunch with a lower price tag at the end result.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Would growing trees be better? Singapore is limited by landmass… if they think this system can scale up and overpower trees in cost and size… let them try!!! Read the entire article… it would be more engaging if they mention the green hydrogen can then be used for something like fuel or farming which can feed back and lower more greenhouse gasses being used…",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "No problem, let’s print it, won’t even double the national debt",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Another way of looking at it is this: for approximately 20x the cost of the war in Afghanistan the world can offset the carbon output of the worlds second largest polluter. Given that this is an existential threat to all life on earth it actually seems like it’s doable if we can focus on the problem globally. This is a war for survival.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Plus once implemented even on a small scale, it would start influencing new research focus for more efficient methods that might scale up the amount one facility can sink. It’s worth trying along with other ideas too.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "Yes, exactly. It’s like it might actually be doable and a smart decision to save life on earth… or something along those lines.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I believe the idea is to invest $25 trillion into renewables so we aren’t emitting more, then invest $1.64 trillion into negative emissions loke this project or ClimeWorks. Money spent on renewables today returns greater carbon reductions, but when the time comes to go from zero emissions to negative emissions, the technology needs to exist. $20 million for this Singapore project is essentially nothing compsred to the $3.7 billion decarbonising fund Singapore has set up: https://www.bloomberg.com/news/articles/2024-02-16/singapore-plans-3-7-billion-fund-for-clean-energy-transition",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I mean Sam Altman is out there asking for $7 trilly like it's nothing so who knows",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Is that per lifetime?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Or about the yearly emissions from the Murdoch families private jets.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Or a 10th of a Taylor swift",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Wow this is a gross waste of everything",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "A drop in the bucket :/",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "Rounding error.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I installed rooftop solar and it estimates the equivalent CO2 I’ve saved from not using fossil fuels to power my house. In 1.5mo I’ve saved 1 metric ton, and I’m not in peak generation season. Let’s say I saved 8 metric tons this year just from having solar on my roof. This proposed system will offset the equivalent of 456 single family homes of moderately high energy usage over the course of a year.\n\nMy system cost me $35k because I’m in the US and solar panel costs are high. But even at that price, if 456 homes installed similar solar systems, total cost would be ~$16M. Realistically in Asia this would cost closer to $5-8M if they can use Chinese panels. And, they get the added benefit of power production, rather than the presumable constant power consumption this money pit would require.\n\nDivest from fossil fuels, stop putting bandaids on a cancer.",
            "points": "6 points",
            "children": [
              {
                "comment": "So 18 tons a year, 200 installations to give you the same as $20 million plant, so we’re talking a home solar system for 200K.\n\nWhat’s that?\n\nTen times more expensive than solar?\n\nTell you what, how about we install 200 solar systems for $19 million?\n\n8 million for you, 8 million for me, and we spend 3 million on the solar!\n\nActually let’s keep the solar, too. We can buy some roof space, and get regular payments from the sale of the electricity.\n\nWe might have to spend money on puff pieces like this article!",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "This context was included in the full article from the UCLA Samueli website, as referenced in this article. The following is a direct quote from the article used as the basis for this one.\n\nThe link is here\n\n“According to the World Bank, the average global annual carbon emissions per capita in 2020 are about 4.3 metric tons. At full scale, Equatic-1 can remove as much carbon dioxide as what nearly 850 people emit annually. Once the plant meets its projected carbon-removal goal, Equatic plans to launch a commercial plant designed to capture nearly 110,000 metric tons of carbon dioxide per year — equivalent to the annual carbon emissions of more than 25,000 individuals.”",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "In 2022, Americans averaged 14.4 tons per person per year. So this works out to eliminating about 253 American's carbon per year.\n\nThat's a bit overly simplistic though.... Our annual consumption has been going down per capita year over year, and that's before the juicy tax rebates on EVs and home energy efficiency etc. So by the time this thing is online, it'll be eliminating more people's carbon than it would today.",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "For a true equivalent comparison between this system and trees, the durability of the sequestered carbon must be taken into account over time. Most trees rot and release much of their carbon back to atmosphere as they decompose so unless that biological process is engineered out of the equation, many more trees will be needed.",
            "points": "0 points",
            "children": [
              {
                "comment": "Yup. Trees are carbon neutral.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "I’d think negligibly negative but it depends on environmental conditions averaged out across all the trees",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "So how is the carbon stored in this context?",
                "points": "0 points",
                "children": [
                  {
                    "comment": "The article doesn’t give specifics but mentions durable calcium and magnesium mineral solids. I’m assuming the system is forming calcium and magnesium carbonates.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "You would need 5 of these plants to offset Taylor Swifts private jets flight time every year.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "My math shows about 800 cars worth of CO2 per year. Conservation is so much easier than pricey solutions. Sadly easier to sell the future than tell people to fly/drive/use less and hammer the big polluters.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This was going to be my exact comment. Bad science reporting.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This is equivalent to planting about two hectares of tropical rainforest, per year, in the forest’s peak growth years. But a mature tropical forest doesn’t sequester additional carbon- each tree pull’s carbon out of the air to build cellulose and lignin, then dies and termites and fungi burn those molecules for energy.\n\nNo one who invests in a carbon capture system thinks it is a practical solution at this stage, but they believe that investing is necessary to drive learning that will reduce costs. This has happened in many industries. I don’t have a strong opinion on whether it will work or not, but I’m glad people are out there working on it.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "For every kg of cement that is made, the process generates the same weight in CO2. So in the scale of how much cement and concrete we use every year in roads and buildings it does not seem too much. But a great start.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "A drop in the ocean? 💧🤔",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Just over a 3rd of a Taylor Swift (8.3kt)",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Probably not many US households since this is in Singapore /s",
            "points": "-2 points",
            "children": [
              {
                "comment": "Atmospheric carbon is a global problem. You remove it anywhere, it helps everywhere.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "/s",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Well. This is a little different. It will remove co2 from water. Yah it’s still not enough to do anything right now but this is more a proof of concept. The more that get online the more it they will remove and the more the ocean will be able to repair itself.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Every commenter with the obligatory “bUt It’S nOt EnOuGh” comment that follows every post like this need to realize that the purpose is research. They’re learning how to improve scaling of carbon removal, and at 3.6 kt that’s already an improvement over previous plants.\n\nThe idea that you would trash a university’s research because that’s not you would spend the money is ridiculous. They can spend the money researching dildos, and all of you can fuck off",
        "points": "35 points",
        "children": [
          {
            "comment": "“What’s the point if the Wright brothers wasting their time with that stupid airplane, they can only stay in air for like 10 seconds. They should be focusing on real issues.”",
            "points": "17 points",
            "children": [
              {
                "comment": "That's a great analogy",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yup. First iPhone wasn’t great. But it started a trend.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "These stupid projects are a waste of time, there's a 100 of these things out there and each one can barely fix 1 or 2% of the problem\n\n/s",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This is owned by a private for profit company. They are partnered with a university. It’s not simply a university doing research.",
            "points": "0 points",
            "children": [
              {
                "comment": "Yeah but his point still stands. It’s a step but a step in a right direction. This is objectively better than doing literally nothing",
                "points": "3 points",
                "children": [
                  {
                    "comment": "You either don’t understand the conversation around carbon capture or you don’t understand the word objectively.\n\nhttps://www.scientificamerican.com/article/dont-fall-for-big-oils-carbon-capture-deceptions/#:~:text=Industrial%20carbon%20capture%20also%20does,to%20die%20prematurely%20each%20year.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Carbon capture will not save us and is just another form of greenwashing/wishful thinking. It IS fruitless and is exactly what fossil fuel corps want.",
            "points": "-2 points",
            "children": [
              {
                "comment": "That’s not a logical argument, you’re only reasoning for why it’s fruitless or wishful thinking is because fossil fuel corporations want it. Maybe they do, so should the rest of us. That’s not in itself a decent reason to think this is scientifically infeasible",
                "points": "1 point",
                "children": [
                  {
                    "comment": "There are physical arguments for why this won’t work. Thermodynamics puts a floor on how much energy is needed to remove CO2 from air or water.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Yeah, all those UCLA professors just trying to avoid carbon reduction /s\n\nSeriously, at this point carbon capture to reverse some of impacts already felt is needed. All the complaints against it that it’s not efficient enough to keep up with our current output, but we’re forgetting that even if we reduced our carbon footprint it doesn’t do anything for past emissions",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I’m with you up to a point. Yes we should be researching ways to carbon capture however if the process is not nor ever will be carbon negative we should not waste resources. I reserve judgement on this one until I can find the paper. But our research dollars are extremely limited and much goes to waste on partnerships with for profit companies that have other motives.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "[deleted]",
        "points": "3 points",
        "children": [
          {
            "comment": "I think you missed a decimal place. It will have cost around $79,000 per American, just in construction costs. That’s not to mention the operating costs, which over 10 years could double (or more) the costs.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I imagine this is intended to have a localized effect to minimize effects of things like ocean acidification. I don’t think anyone thought this one plant could remove all or even a high percentage of CO2 from the World Ocean",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "What else can we do? I don’t really expect people to change and there seems to still be a large amount of money dedicated to saying climate change isn’t manmade. Not to mention the political and judicial push in America to deregulate and erase environmental protections.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "How many Taylor Swifts is that equivalent to?",
        "points": "7 points",
        "children": [
          {
            "comment": "Her emissions divided by that of Travis Kelce’s",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This annual removal covers only half of her daily farts. We'll need well over 700 of these stations just to remove Taylor's farts from the atmosphere.\n\nShe farts so much. ( ._.)",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I for one hope things goes well for this tech. Every avenue we can explore to get the CO2 out of the ocean and atmosphere is worth a look.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So we need to run that thing for 547945 years to remove one part per million. We are currently 61 ppm over the 350 ppm threshold. so that means we need to run that thing ultimately for 33424645 years to get back to normal. Assuming we don’t release anymore carbon dioxide into the atmosphere.",
        "points": "4 points",
        "children": [
          {
            "comment": "Yeah nature will have fixed it by then",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "So 793 cars worth of CO2",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "$20 million only? That's chump change compared to the extinction of us.. wtf are we even doing? There should be 100s of these.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm doing my part! I've planted some 40 trees and shrubs in my yard. Most of them live.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Cool only 365000000000000000000000000000000000000 more tons to go",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Make all “carbon offset” monies go towards funding these",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": ".04% is now. What exactly is the goal???",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "At this rate they would need 9,250,000 of these facilities to deal with the CO2 produced in 2022 which based on their figures would cost $185,000,000,000,000 my math may be wrong please correct me if possible. This is a grift/feel good story and I believe they know this",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "For context a small flare destroying methane from landfill gas can reduce about 3,600 tons in 3months and the cost is closer to $200k.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Do they recycle the co2 into other products or industry’s that use it?",
        "points": "0 points",
        "children": [
          {
            "comment": "The process induces a series of chemical reactions that break water into its hydrogen and oxygen constituents while securely storing both dissolved and atmospheric carbon dioxide in the form of solid calcium and magnesium-based materials for at least 10,000 years.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "15 TRILLION tons of co2 per year goes into the atmosphere",
        "points": "0 points",
        "children": [
          {
            "comment": "You sure about that?",
            "points": "0 points",
            "children": [
              {
                "comment": "Yup with Africa and Asia producing 80+ %",
                "points": "0 points",
                "children": [
                  {
                    "comment": "15 tonnes is nothing. Check again.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why Singapore? Why not right here? Is there something about the geographical location or just cuz?",
        "points": "0 points",
        "children": [
          {
            "comment": "It sounds like this is a partnership or even a consortium. Research plants like this go where the $ is - if Singapore is giving huge incentives, or if their partners are in Singapore that might be the reason.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "While using how much power from what sources? How long of a carbon return on the materials and processes needed to construct the plant? These are the questions I never see...",
        "points": "0 points",
        "children": [
          {
            "comment": "The article up top has many links to many of those answers. You wont find them by just reading the title.",
            "points": "0 points",
            "children": [
              {
                "comment": "Ya, but how else can they pretend to be an expert on the topic if you point out there are answers?",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Wow I thought with all the oil and gas propaganda claiming they are building such projects that it had already been done . ( by oil and gas of course)",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Is that a lot?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This article doesn't really say very much. For example what happens to the CO2 that gets captured?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They are trying to suffocate the trees!!!! Jk, but you know someone will buy into it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Once again we see scientists doing a dance around the fact that carbon capture makes absolutely no economic or energetic sense. How is process any different from sequestering seashells, eg oysters or clams? This work is already being done by legions of animals, why not simply harness a natural process?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Sorry T stands for trillions I’ll make that clear",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "To be completely honest, I’ve grown less excited about decarbonization technology that isn’t a solution to the real problem - which is scale.\n\nThe tech is cool, but it’s ultimately a paper napkin idea until you can prove you can offset truly significant numbers at truly meager cost.\n\nI want to see a decarbonization technology that solves the problem of scale - that will be the one that gets adopted, and the one that deserves hype",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Absolute waste of time, money and effort.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s amazing to me. This plant is 20 million, I understand it’s not doing a lot of c02 removal, but compared to the trillions of dollars already spent fighting increasingly radical weather why hasn’t any government looked at investing in more of these? Why haven’t these been considered as an approach to fighting climate change at scale?",
        "points": "-1 points",
        "children": [
          {
            "comment": "Because direct capture technologies have not been shown to be effective at scale. The technology needs to be developed before it is implemented.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Because for $20 million it removes the annual CO2 output of 250 Americans.\n\nIt's basically a research project.",
            "points": "1 point",
            "children": [
              {
                "comment": "Forests do more for free",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Nothing is free mate. It costs money to reforest an area.\n\nBut as I said, the idea behind this project is research.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Right but my point was that 20 million could be used to reforest as opposed to spending it on one plant Edit: I mentioned free and in the previous statement and I apologize, it’s not what I meant",
                        "points": "-1 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Sadly, planting trees by itself will never be enough. We need to find tech solutions, so every possibility is a positive step.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I agree, but 20 million worth of planting projects compared to one plant would take a higher net of carbon out I assume",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "I mean, you need people doing both. Here’s a company experimenting with tech. Others are trying to plant trees. It’s a good thing, and it’s going to cost a lot of money to solve this problem, if we ever do.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "The harsh and sad truth, well said",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yo, trees?!",
        "points": "-1 points",
        "children": [
          {
            "comment": "How you gonna sequester carbon with trees for longer than 200 years?",
            "points": "0 points",
            "children": [
              {
                "comment": "More trees",
                "points": "2 points",
                "children": [
                  {
                    "comment": "We need carbon negative solutions in addition to ecological restoration",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Of course but it’s going to take a lot more than just carbon capture systems to reach that goal. We have to alter things that have become basic and necessary in modern society. A good start would be to reduce reliance on cars, roads, and planes. Asphalt roads themselves produce a ridiculous amount of co2. More than any car ever could.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "MORE. TREES. 🎄",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Call me a pessimist it I’m willing to bet this isn’t even close to carbon negative. The article and site don’t go into the numbers. I bet this experiment produces atmospheric carbon. Do t get me wrong, we should keep trying but we need to recognize scaling up experiments that are not net negative are doing harm.",
        "points": "-2 points",
        "children": [
          {
            "comment": "I’m trying to understand what they are doing and this article is not actually helpful in that regard,\n\nSo here’s what I think they are doing…\n\nNormally when you produce green hydrogen through electrolysis you need very pure water to get hydrogen and O2 the equation H20+ (liquid) electricity -> to H+ OH- (gaseous) this process requires a renewable source of electricity and clean water.\n\nThe process in the article says what if we use seawater or specifically the waste stream of a desalination plant. So when they electrolyze the water to produce H+ gas the left over OH- (dissolved) causes the CO2 in the seawater to be solidify (drop out of solution) as CaCO3 and MgCO3. So they are left with solid calcite or calcium carbonate. The article didn’t say what they are going to do with the calcium carbonate and seemed to indicate it was just washed out with the wastewater, which seems to be a bit too magic hand wavey way of saying they made the seawater able to hold more carbon dioxide…\n\nAm I understanding this correctly?",
            "points": "1 point",
            "children": [
              {
                "comment": "That sounds about right. My concern however is the balance of the whole carbon equation. It takes X watts to perform the electrolysis to produce Y tons of solid carbon. In a perfect world this will always take energy to run the chemistry. Only if the source of those watts produces less carbon than this process produces will this ever be carbon negative.\n\nThe important point I’m failing to make (thank you downvoters) is that there is no amount of optimization to be had if you can’t produce more than you use FUNDAMENTALLY. Fusion is often used to counter this argument. If we can just contain it for x amount of time it will produce more than it consumes. That is correct because it is fundamentally possible. These energetic chemistry scrubbers are often hopelessly, fundamentally carbon positive.\n\nAGAIN, I am not claiming that about THIS system because there just isn’t enough publicly available data. (Another drawback of partnering with for profit companies instead of pure research).\n\nThank you for giving a reasonable response Black_bjack instead of the reflex downvote.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "CO2 is not a pollutant. It is literally PLANT FOOD.\n\nThe NetZero scheme is a crime against humanity.",
        "points": "-5 points",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]