[
  {
    "id": "t3_1bcsbn4",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1bcsbn4/looking_for_alternative_to_character_ai_with_no/",
    "title": "Looking for alternative to Character AI with no VF code",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bcrje5",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "https://youtu.be/R5S0Spqmx2c",
    "title": "Lets generate 3D objects with AI, drop them in Roblox and animate them with Mixamo",
    "points": null,
    "comments": [
      {
        "comment": "I was going to get stoned and rewatch Dune P1 but hey you do you.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bcp0aw",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1bcp0aw/how_would_you_like_to_see_generative_ai_used_in/",
    "title": "How would you like to see generative AI used in video games?",
    "points": null,
    "comments": [
      {
        "comment": "Still amazes at the \"AI dev team members\" angle.\n\nIn-game? No one even remembers the best use of AI yet: Shadow of Mordor/War NEMISIS SYSTEM. Processing power dedicated to unique enemies based off their interactions with you. Beautiful.\n\nWhat else. Any game that has intelligent opponents needs to forgo difficulty as a matter of enemy health or number of saves. I want both SMARTER enemies, yes, but INTERESTINGLY smarter.\n\nAnyone can just \"Make best Decision X in Y situation\" but give me CHARACTER. Like let me pop my head out twice, dodge both attacks, have the enemy line up where I WAS popping out (smart) just to have me now pop put elsewhere, to the VISIBLE FRUSTRATION of said enemy.\n\nSo...ironically...use Artifical (Synthetic?) INTELLIGENCE....to simulate /emotion./",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Sorry for the formatting, paragraphs don't work for me right now.   A nice evolution game where you can mutate or hybridize creatures, or yourself, and every time it's a unique visual outcome.   In RPGs, endless dialogue, with characters remembering past interactions (if it makes sense, a bartender sees a lot of L1 blokes) and being knowledgeable of their own crafts (let's ask a lbowyer how to make a bow, or the cook for a recipe). Also: in a game with an adventurer group, breaking the fourth wall and having personas for the players too, interacting with you as if around a table in D&D sessions.",
        "points": "4 points",
        "children": [
          {
            "comment": "Seconded. Seconded ALL'a this.\n\nThat last idea could be it's own entire /new/ GENRE.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Honestly just being able talk with a partner (not romantic) would be cool y'know? Give them directions and ask their input on random things I think bartering would be cool",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My biggest hope to come from Ai is players being able to chat real time with the game characters in rpgs, and maybe some way that Ai can make it where every play through is entirely different because tiny little things you say here or there. But I guess that would not only need an Ai chatbot, but some sort of generative game engine Ai?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Did everyone forget the AI used in the game 'ALIEN'.The tracking the player in the game is creepy and engaging . Also, the first use of AI happened in HALO games , I think.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I want an AI to generate an endless Super Mario World game where I get new levels forever.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Generative fully interactive world building with rich lore, full 3D environments, NPCs, the works. In VR/AR/screen/voice based 100% accessibility. An unlimited multi-interface state-based generative MU* basically.",
        "points": "0 points",
        "children": [
          {
            "comment": "That, or an AI like in that Season 4(?) episode of Black Mirror (star trek spoof) where there is basically an AI environment manager which integrates new data into the game and maps it properly as some game element the player can interact with (basically something like an creative UI/environment designer which can integrate foreign APIs directly as game objects on full automatic.)",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'd love to see it be used in ways that enrich game worlds in a way that allows for truly novel exploration and discovery, whether it be through breathing life into NPCs or finding new ways to do procedural generation that actually spit out novel results.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bcoz56",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1bcoz56/best_ai_tool_for_slowing_downstretching_audio/",
    "title": "Best AI tool for slowing down/stretching audio?",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bcow78",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1bcow78/best_ai_tool_for_cleaning_up_bad_film_production/",
    "title": "Best AI tool for cleaning up bad film production audio?",
    "points": null,
    "comments": [
      {
        "comment": "adobe podcast enhance, have you tried it?",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bcml3b",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "https://www.firstpost.com/tech/elon-musk-to-open-source-xais-grok-ai-this-week-challenges-openai-to-do-the-same-with-chatgpt-13747688.html",
    "title": "Elon Musk to open-source xAI's Grok AI this week, challenges OpenAI to do the same with ChatGPT",
    "points": null,
    "comments": [
      {
        "comment": "Let's start an open-source satellite company and challenge Elon to do the same.",
        "points": "99 points",
        "children": [
          {
            "comment": "I officially made OpenSpaceTesla. All my trade secrets are open sourced here:",
            "points": "12 points",
            "children": [
              {
                "comment": "To be fair didn’t Tesla open their patents?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "\"I'm gonna open source my go-kart design! I dare you to do the same with that Formula 1 racer you've been working on! I dare you!\"",
        "points": "48 points",
        "children": [
          {
            "comment": "Not just Formula 1, but it's like daring Red Bull to do it, who have such a better car it's almost like they're in a different category of Motorsport.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "To use Grok I'd have to have a Twitter account.\n\nI find this to be an insurmountable challenge.",
        "points": "60 points",
        "children": [
          {
            "comment": "You still need some account to access chatgpt. What's wrong with using a Twitter account? Are you so lazy to create one?",
            "points": "-28 points",
            "children": [
              {
                "comment": "No but you can remove the word \"opensource\"",
                "points": "12 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "You have to pay $8 a month for special twitter to use grok, at least the last time I checked.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Lol. I thought just a Twitter account would do.",
                    "points": "-5 points",
                    "children": [
                      {
                        "comment": "I just checked, it's still paywalled.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "he's opensourcing his custom GPT openAI wrapper? wow",
        "points": "38 points",
        "children": [
          {
            "comment": "Grok is not based on Chat-GPT. Even an AI would know that. What's your excuse?",
            "points": "-12 points",
            "children": [
              {
                "comment": "I'm pretty sure Grok wouldn't know that.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This week*.\n\n*next year",
        "points": "15 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Lol, no project picked Grok up & he thinks it'll be the next Llama/Mistral lol",
        "points": "13 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Announcement of an announcement. No one cares until it's here and we can actually try and evaluate it.",
        "points": "23 points",
        "children": [
          {
            "comment": "Do you think he won’t? Say what you will, but he’s known for following through with his plans, even without a monetary incentive.",
            "points": "-33 points",
            "children": [
              {
                "comment": "You dropped this: /s",
                "points": "28 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I hope this was sarcastic",
                "points": "20 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "FSD release when?",
                "points": "5 points",
                "children": [
                  {
                    "comment": "in two weeks\n\nas of 5 years ago\n\nsource: I've been in the beta for 3 years",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "It's not binary yes or no. They (it's built by a team not one person) might release something that's far worse than the best open-weight models. Or they might release it under a restrictive license.\n\nBest case is they release weights, training data and training method. Or that they release something that's SOTA for its size among open weight methods.\n\nAs far as being known to follow through with his plans, I'd stop repeating that, if you want to be taken seriously.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Gettin' ready for the most Nazi AI since Tay AI",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nice try Musk, but unfortunately nobody gonna follow that rabbit.",
        "points": "11 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"I'm throwing my turd into the street, now throw your gold to prove you are as good as me.\"",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Them GPU's are aging quick huh?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That's like Lada going open source and asking BMW to do the same :D",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Elon is a grifter. But if there's even a small chance of us getting more open-source stuff, especially AI related, I'm for it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Big daddy Musk flex'n on dem 'for profits', holla! Tinted fingers and all, he's a regular Mr. fucking Burns in the making!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "He’s like a teenager, “I CHALLENGE YOU?!” hahah",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "He wants people to fix it for free.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Respect for Elon went up 100X.. Can't imagine an \"open\" source AI company making billions of people's work! I am a big fan of Sam Altman and a Chatgpt Pro subscriber since beginning. But Chatgpt is becoming corporate each day!! We need more OPEN AI and more people to have access to the ins and out of AI. Dont be like Bill Gates who wanted monopoly on what he called the \"Information Highway\"!",
        "points": "-45 points",
        "children": [
          {
            "comment": "I think Musk realizes how irrelevant his AI is. The only option left is to give it away.",
            "points": "15 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Nah with the requirement of using an x account it is not open source anymore + i d think that is going to be played after all",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Da comrade",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Are you an x.ai or twitter employee! or is this grok vomit! Microsoft was successful long before the 'information superhighway' became a thing... microsoft was a bit behind the ball on that and never tried to monopolize the internet itself -- MSN Dial-up never came close https://en.wikipedia.org/wiki/MSN_Dial-up",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I back this",
            "points": "-17 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Indeed I’m positively overwhelmed by his selflessness",
            "points": "-8 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "He’s gonna open source gpt3.5?",
        "points": "-1 points",
        "children": [
          {
            "comment": "More like GPT 0.5",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "China can’t wait",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bcho7q",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1bcho7q/open_source_ai_is_a_misnomer_from_2nd_3rd_place/",
    "title": "Open Source AI Is a Misnomer from 2nd & 3rd Place Players - Let's Get Real",
    "points": null,
    "comments": [
      {
        "comment": "You don't know our potential algorithmic efficiencies. That coupled with, moving forward, more hardware will be made for these use-cases.\n\nIf you pay attention to subs like locallama, people post new, what they think is, relevant research papers. The other day I seen something about cutting training resource needs drastically. I wanted to go read the paper, thought I saved it, but apparently I didn't. Anyway, the point is, New research is addressing this because the entire industry needs it.",
        "points": "11 points",
        "children": [
          {
            "comment": "But new research paid for by whom?",
            "points": "-7 points",
            "children": [
              {
                "comment": "Open source developers have produced amazing tools. The hardest cost boundary will eventually be the hardware itself, which will get cheaper and cheaper unless something catastrophic happens to chip production.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "You think chips are getting cheaper?\n\nWhat did you think Sam was asking for $7 trillion for? Have you seen Nvidia's share price.\n\nI think what you mean is that these models running on this hardware are getting cheaper. Not really and not by much. It's going to take more accelerated compute. I don't see this going cheaper without heavy advancements in QC.",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Universities.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "lol you mean we pay the universities. You think they exist and operate for free?",
                    "points": "-2 points",
                    "children": [
                      {
                        "comment": "Various ways university research is funded: * Government Funding: Federal and state governments provide grants and subsidies. * Tuition Fees: Students pay directly for their education. * Endowments: Donations from individuals or organizations create investment funds. * Research Grants: Given by government agencies or private foundations. * Industry Partnerships: Companies sponsor research and provide funding.",
                        "points": "3 points",
                        "children": [
                          {
                            "comment": "You think this is going to lead to billions of dollars that will let a bunch of kids run a GPU farm to see if it can make an improved OSS LLM model?\n\nlol what?",
                            "points": "-2 points",
                            "children": [
                              {
                                "comment": "If the definition of AI is limited to \"LLM\", then may be no.\n\nIs intelligence the ability to manipulate language?",
                                "points": "2 points",
                                "children": [
                                  {
                                    "comment": "It's a great question. I will answer that and say NO. However, language is the ability to communicate intelligence. You could be the smartest intelligence in the universe but if you can't communicate that to me then of what use is it.\n\nIn this way all physical matter and quantum physics are forms of intelligence. In fact, they are the highest forms of intelligence we can imagine and much of our lifetime is dedicated to learning how those forms of intelligence communicates.\n\nIntelligence is the ability to manipulate all things both known and unknown.",
                                    "points": "-2 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              },
                              {
                                "comment": "? No I didn't say anything like that. Maybe instead of worrying about scary ai, go work on your reading comprehension.\n\n100 papers are released every day in this field, keep up.",
                                "points": "1 point",
                                "children": [
                                  {
                                    "comment": "I mean I agree that yes universities do things like this but what does it have to do with my argument that OSS AI isn't going to take us very far.",
                                    "points": "-2 points",
                                    "children": [
                                      {
                                        "comment": "I outlined very well for you in my first comment.\n\nFilter the locallama sub by research papers to see papers that may influence things like VRAM usage, as its relevant to them so people post it there. I think you can even filter for research papers in that sub. Or check Google scholar or arxiv.\n\nJust because it's a way today, does not mean it will always be. Also open source models will be what we see in products. Specific domain / use-case tuned.\n\nNo one is going to use openai ChatGPT ai for commercial use on larger scales.\n\nMost people have no clue of current capabilities of these models with a bit of tuning coupled with engineering.\n\nEdit: I want to go back to one of my first points. Model sizes are coming down, there are near gpt4 level open source models that run on consumer hw currently, already. Also, companies are already pushing forward, developing hardware for this use-case.",
                                        "points": "1 point",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "As much as people may want to the newest and smartest and most capable AI,\n\na weaker open source AI that can serve a user's purpose is more than enough.\n\nSimply put, I don't need a multi-modal AI if I just need it to generate information in specific domain. Simply put, while the current trend is to train general knowledge, just like how diffusion models went and adopted into style specialization, LLMs are also moving towards specialization.\n\nCase in point, I haven't been active in LocalLlama for months now after setting up my personal AI assistant on my own server. While I may occasionally check for new updates, more optimizations, faster inference, more tokens, etc... the current open source uncensored LLMs are already capable of serving some purpose.\n\nIt's like asking an algebra question between a high school teacher and Albert Einstein. While Albert may be smarter than your local teacher, the high school teacher is more than sufficient enough to answer an algebra question.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ok Sam. I'll definitely drink the Kool-Aid!",
        "points": "1 point",
        "children": [
          {
            "comment": "lol - Good, now, let me show you this new thing i've been working on.",
            "points": "-2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bcf6go",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1bcf6go/aitranslated_hitler_speech_goes_viral_on_x_wired/",
    "title": "AI-translated Hitler speech goes viral on X (Wired article)",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bcayhz",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1bcayhz/using_ai_to_draw_a_map/",
    "title": "Using AI to draw a map",
    "points": null,
    "comments": [
      {
        "comment": "I don't have any AI solutions, but Garmin has/had heatmaps so you can see routes bike riders take that might be helpful. You don't have to own a garmin to view them.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Analyzing street view data with computer vision and populating it into something like OpenStreetMap seems doable.\n\nDoesn't sound inexpensive computewise though.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This seems like a wildly overcomplicated solution for some of the data that is probably already captured and entered in OpenStreetMap.org - go to Layers and turn on \"Cycle Map.\" Altho they map stop lights, I don't think they map stop signs, it should have the raw data for the bike routes.\n\n(And if your town has not been mapped, you can contribute to mapping it.)",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc9r6j",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1bc9r6j/apple_abandoned_its_ambitious_car_project_ask/",
    "title": "Apple abandoned its ambitious car project. Ask your questions to Bloomberg's Mark Gurman",
    "points": null,
    "comments": [
      {
        "comment": "Will apple push to something that truly competes with a WHOOP or an Oura ring? Going deep into recovery metrics and revamping apple health portal, daily scores, etc",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Was it actually a consumer facing car or an autonomous platform to sell to car manufacturers?\n\nIf a car…any hint what it looked like?\n\nEDIT; GUESS WE MISSED IT",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc9e4c",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1bc9e4c/suno_v3_alpha_some_editing/",
    "title": "Suno V3 [Alpha] + Some Editing",
    "points": null,
    "comments": [
      {
        "comment": "Nice, featured in next edition of The Memo.",
        "points": "1 point",
        "children": [
          {
            "comment": "All yours",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc8tqc",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1bc8tqc/r_what_existing_artificial_tools_can_i_use_read/",
    "title": "[R] What existing Artificial tools can I use / read (books) to dynamically monitor changes on a website?",
    "points": null,
    "comments": [
      {
        "comment": "None.\n\nAny decent website will be using something to detect bots, what you are doing is just asking for your IP to be put in naughty list by Amazon, Akkamai, Cloudflare or any other CDN provider, and believe me, you don't want to be in that naughty list. That's akin to getting banned from the internet.",
        "points": "2 points",
        "children": [
          {
            "comment": "Why should I be banned? I'm writing a bot that will redirect users to purchase site products.\n\nWhere do I violate the site or user policy? I have not direct income from it, absolutely, I take only a percentage (%) between the client and the customer.\n\nThat's all I do, as a worker.\n\nYes, requests to the site can go through the bot, but again, if the user does not have money, then he will simply leave this site, and if he has money, he will gladly buy what he needs and still leave.\n\nWhy I am looking for a way to detect dynamic modifications is because I do not have a direct communication channel with the marketplace site, but as soon as the marketplace receives its first income, then everything will fall into place.",
            "points": "0 points",
            "children": [
              {
                "comment": "Because CDNs detect it's a bot, and frankly, they don't give a flying fuck what you are and what you are doing, once they detect you are a bot, they add your IP to their naughty list. And this naughty list is not a website-specific list, it's a CDN-wide list. You might be scraping data from some randomUsedStuffMarket.com, and if you are added to the naughty list, websites like nike.com or united.com or steam might (and do) refuse to serve to your IP.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "It’s interesting that you deliberately keep silent about the fact that these same marketplaces are also built on parsers \"under the hood\"? What we are talking about?\n\nThey themselves do not hesitate to use parsers or scrapers to collect data from other websites.\n\nFor the following purposes:\n\nprice updates: automatically monitor prices for competitive products using parsers to keep their prices competitive;\nassortment analysis: parsers can be used to collect information about products from competitors;\ncomparison of goods and services: stores can use parsers to compare prices, characteristics and conditions of sale of goods from different suppliers;\nmonitoring of product descriptions and reviews: parsers can automatically collect product descriptions and reviews from other sites;\nkeeping data up to date.\n\nThey also need to keep their own products up to date. Why do you think they do this? That's right, by parsing competitors.\n\nThen, in fairness, why don’t we talk about the fact that they themselves have parsers built into the system?\n\nOtherwise, how do they manage to automate their own processes in a competitive market?",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Yes, why do you think there exists companies that make millions from bot protection?",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Or will you say that you just found out about this and it never occurred to you that these same marketplaces live off the parsers in their systems?\n\nPerhaps I will reveal a terrible secret, but many companies in the e-commerce and retail sectors are using the tools as scrappers for leveraging data analytics and automation tools to stay competitive and optimize their operations.\n\nLiterally:\n\n\"it's common for large e-commerce platforms like Amazon to utilize web scraping and parsing techniques to gather information from external sources for various purposes, such as competitor analysis, market research, or content aggregation. These techniques help enhance the platform's functionality and provide a better experience for users and sellers.\n\nIt's important to note that web scraping practices are subject to legal and ethical considerations, and companies must comply with terms of service and applicable laws when accessing and using data from external sources.\"",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Why do you think such bot protection exists?",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "According to this logic, the site developer also violates, because changing the design is a violation of corporate ethics and is unfair to other developers.\n\n1. Question: Do I take money from him for development?\n\nAnswer: No.\n\nQuestion: Am I working directly on his site while working?\n\nAnswer: No.\n\nQuestion: Can buyers violate the site's policies?\n\nAnswer: What's the point if they have money to buy goods?\n\nSo what questions might they have for me?",
            "points": "-2 points",
            "children": [
              {
                "comment": "lol, what? You’re screen scraping and trying to argue that the developers are in the wrong? If they wanted you to be interacting with their content like this they’d provide an API. Think yourself lucky that they’re not adding your ip to a blacklist.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "That sounds like an interesting project, but I don't have any knowledge or suggestions about the topic, other than one experience: I applied at an AI company that dealt with semantics, and the manager told me a story about how their company received a question about whether the company's AI software could read a certain type of file that the requester's group used, so the company took a look at the requester's data file. Although the software the company used was believed to be able to automatically figure out the structure of any data file, it failed on this one particular file, even with human aid. That problem has fascinated me ever since, because it suggested that determining the structure of a data file is a very difficult problem to solve in a general way. I assume that principle also applies to web pages. As applied to your project, this *might* mean that such software does not exist, depending on the complexity of the web page.",
        "points": "1 point",
        "children": [
          {
            "comment": "Got your point. It makes sense. I agree with your the main opinion. It looks like I, definitely, need to create a fully new cascade of the system / template / model projection, which should be applied to the DOM of the website & monitor dynamically the structure changes.\n\nAnyway, the question is open. Investigating how things will go.\n\nJust don’t want to agree within myself w/ the fact that some products can use their own advantages in a competitive environment and develop, while others are forced under pressure to agree to the rules of the game invented by someone.\n\nIn all other aspects I have nothing against it. After all, a competitive market was created to develop at the expense of each other.",
            "points": "0 points",
            "children": [
              {
                "comment": "The rest of the story is that I was supposed to work on that project if the company got the funding, but the company did not get the expected funding, and quickly went out of business. Another failed start-up company.\n\nI'd still love to work on a solution to that problem but I don't have the time unless I get paid. For webpages, I would personally solve the deeper problem first, which would result in a very flexible data structure that would automatically adjust itself upon discovery of how the web page changed, so that just a pointer or something equally simple would need to be changed, maybe also with a variable with limited allowed values like \"horizontal\" versus \"vertical.\" That data structure would then automatically map the desired information to the corresponding location on the web page. Then I would probably post my resulting code on GitHub for anyone else who might want to solve the same problem elegantly.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "I’m in the process of reading the ML book now. Let’s keep in touch then. If you have something interesting during experimenting or will find additional any helpful resources to this question in the near future. You are welcome. This question will be open till the end of my work & scientific observations.\n\nI personally don’t mind sharing my own developments in the near future, but not in full, or I will offer an option on a test model (uploading to GitHub), if I find the most suitable one.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I don't believe that typical machine learning is needed. The problem actually seems simple: webpage with organization scheme A has changed to organization scheme B. There aren't that many likely ways that someone would rearrange data on a web page: (1) change the location of an item, which just requires search and setting a pointer to the new location when found, (2) swapping rows to columns in a table, which just requires a vertical-versus-horizontal variable, (3) adding or deleting material around the desired material, which reverts to problem (1), (4) adding more rows or columns to a table, which just requires variables for length and width as measured in number of cells in a given direction, (5) changing the data structure that holds a list, like from a bulleted list to a vector, which just requires using a different set of access instructions per item, which can be already stored in a library of possibilities, (6) grouping formerly single items into a list, which just requires a tree structure with flexible depth.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "Am I correctly understand, if this can be implemented using existing Java tools/methods?\n\nDo you think Java should be enough to track changes to placed elements on the existing landing page according to your explanation?",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "I would think Java is sufficient. I learned the DOM when learning JavaScript, which is a very different language (despite the misleadingly similar names), and the real work would be in the code that accesses the DOM, so I don't believe the specific language is critical. The chosen language should be able to implement pointers, lists, and trees, though, and maybe objects, too. Most languages nowadays handle such data structures, but at the same time it's very annoying and time-consuming to code such larger data structures from scratch, so if I were coding such a project I would first look for existing code for my chosen language, as an add-on or library or GitHub program.",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You could look into the topic of self healing tests on pipelines, where they pass a version of the Dom, sometimes stripped from predefined elements (or in reverse elements that are changing often to reduce context token size) to AI models, like codecept.js does etc ... Where AI is proposing new locators(or then for you passing changes in your desired format). The way playwright advanced libraries like crawlee etc work can be combined to parse that data to a code transformator to adjust your code.\n\nAlso with tools like them there are ways to API testing, fetch json responses and payloads, so I would check if I could write my code more based on that and compare request/response snapshots? Websites like playwright solutions offer examples for stuff like that.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc7d0j",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "https://www.twitch.tv/evertrail",
    "title": "Evertrail is an AI adventure where you choose the path in the Twitch chat. Worked on this the last weeks, please help me testing if you have time.",
    "points": null,
    "comments": [
      {
        "comment": "To vote on a choice, you just type 1, 2 or 3 in the chat at (on desktop or the Twitch mobile app). Every few rounds, one of you will be chosen to also add an optional item, person or plot twist. Everything is dynamically generated using ChatGPT, Dall-E and Text-to-Speech, with a mood-based music selection by SunoAI. The current theme is fantasy and we can switch it to sci-fi and other themes on future days. Hope you enjoy & feedback welcome. Cheers!",
        "points": "4 points",
        "children": [
          {
            "comment": "Sounds like an interesting idea. I don't use Twitch, but I wish you best luck.",
            "points": "2 points",
            "children": [
              {
                "comment": "Thank you! What platform would you prefer? I made the backend so that I can put it on different platforms later on.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "I really only use reddit and email on the internet. News sites and AI chat, too.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc5ory",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "https://i.redd.it/ithzygyu2qnc1.jpeg",
    "title": "Oooof",
    "points": null,
    "comments": [
      {
        "comment": "AI is absurdly bad at video editing (notably SORA is not video editing). Is it possible? Sure. It's definitely not there yet.",
        "points": "25 points",
        "children": [
          {
            "comment": "Video processing means 1920x1080=2073600 input parameters for just one frame of only full hd. And then these systems need an as big as possible history of previous frames to be consistent as inputs too. If the clip runs at only 24 frames per second we already are at roughly 48 million inputparameters for just one second of footage. Those are just insane numbers! May be we can get around this by having a LLM keep track of whats happening instead of having a large frames history, but even then editing ai seems very difficult",
            "points": "8 points",
            "children": [
              {
                "comment": "A \"director\" AI wouldn't need to parse every pixel.\n\nYou'd have multiple layers operating separately but the compute would be monstrous to do a good job.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Wouldn't it? Composition, when exactly to cut, transition on focal points.. Editing is more than just throwing clips together, there is a lot to keep track of. Of course we can just duplicate the edit of low res to high res, but I'm pretty shure the AI would need to \"see\" what it is editing.\n\nAlso organizing and reviewing files and clips is a huge part of the editing job, the AI would need to analyse several takes and pick the best one. This honestly seems impossible with current technology",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "This is literally what the latent space of an image is and why stable diffusion works.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "OpenAI cannot do graphical design and banner ads well yet.",
        "points": "66 points",
        "children": [
          {
            "comment": "And it certainly can't edit a video for you.",
            "points": "19 points",
            "children": [
              {
                "comment": "Yet.\n\n$20 that changes within 6 months",
                "points": "-4 points",
                "children": [
                  {
                    "comment": "I think it would depend on your definition of 'for you'. I wouldn't be surprised if there are some AI video editing tools within 6 months, but I doubt there will be something where you can upload a video and it spits it back out, fully edited.",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "Keep in mind that people, just five years ago, were saying that there is no way that AIs would be making imagery just from a prompt until decades from now.\n\nWe humans are notoriously poor at understanding exponential growth. Just look at how badly unprepared we were for Covid.\n\nRemember, all you see are the public models. The models you are using now were trained well over two years ago, so they are actually two years old. I'm starting to think I should revise my estimate lower, actually.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Well lets hope the dude goes into business soon! It should be a booming 6 months before OpenAI has the capabilities.",
            "points": "13 points",
            "children": [
              {
                "comment": "Damn, roast was so fire even Gordon Ramsay is asking for seconds",
                "points": "-5 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "*yet\n\nAnd that’s the issue, every one of these niche offerings could get popped at any day by open ai or (whoever)\n\nI agree with the notion of using GPT costs as some kind of benchmark here",
            "points": "3 points",
            "children": [
              {
                "comment": "It'll be a good bit longer before you can just put a video in and have the AI edit it. You would need to know exactly what to ask for, and someone who's not a video editor themselves wouldn't.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "People on here who just go \"I'll have the AI do it\" seriously don't understand how much work goes into it: https://www.youtube.com/watch?v=_C7kR2TFIX0\n\nAnd that's the fundamentals.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Sure. But my point…and what I experience as a consultant doing this stuff…is that the ambiguity of the progress, matched with the absolutely certainty that it will progress, plays hell on how people spend their money right now\n\nAnd when it goes, it is going pretty fast. So I think it’s credible to consider the worst alternative pricing when thinking about product value right now.",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It can.\n\nLower your standards.",
            "points": "-35 points",
            "children": [
              {
                "comment": "That’s the dumbest argument I’ve ever heard lmao.\n\n“Lower your standards”",
                "points": "26 points",
                "children": [
                  {
                    "comment": "That’s the dumbest argument I’ve ever heard\n\nLower your standards",
                    "points": "24 points",
                    "children": [
                      {
                        "comment": "Someone who knows how to adapt :)",
                        "points": "-21 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You have to pay someone to use the ai\n\nIt's not like they're competing against a $20/month charge, they're still competing against someone's time.",
        "points": "10 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Apart from just being wrong, this attitude is just going to accelerate and normalize a hostile relationship between AI engineers and creative people, ultimately resulting in AI content looking cheap and crappy.",
        "points": "10 points",
        "children": [
          {
            "comment": "Is that an ai engineer though?",
            "points": "0 points",
            "children": [
              {
                "comment": "This guy is an AI artist: https://www.youtube.com/watch?v=_C7kR2TFIX0\n\nAn AI engineer is someone who builds AIs.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It will be accelerated if we like it or not. It’s inevitable. “Ai”",
            "points": "-12 points",
            "children": [
              {
                "comment": "An avengers gif? Pretty lame stuff",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Lol, imagine caring about gifs. That’s real lame duck status. Smh. I think the internet is turning the frogs……..",
                    "points": "-7 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It's not a matter of \"capabilities.\" It's more a matter of designing stuff takes lots of time and effort. I'm not talking about the actual drawing or editing process, though even that is non trivial with AI. It's more in the figuring out what needs to be drawn or edited. It's really difficult to come up with something that moves people, the most AI can do is move the bar for what people consider the bare minimum.\n\nIt takes a level of understanding of what \"video editing\" or \"graphical design\" actually entails, which is not what most people want. What most people really want is for someone to understand their vision from a few scraps and tidbits, and then do a lot of other stuff that aligns with that vision. AI is great at the exact opposite; you give it a lot of data, and it'll give you something that satisfies most of those criteria. For someone familiar with a field this is great, because it can save you something like 80% of the work. The remaining 20% may be the most difficult stuff, but it's a lot easier if you don't have to do the first 80% beforehand.\n\nBut you're right in one sense; the cost of those services should probably include the cost of the OpenAI subscription, as well as the many other AI's that you need to do the services being discussed these days.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI is just a tool, it's not going to fully replace human design. Such a silly perspective",
        "points": "14 points",
        "children": [
          {
            "comment": "It's not going to replace it ... yet...",
            "points": "-4 points",
            "children": [
              {
                "comment": "It can already do the work of your average canva jockey; that's not anything to be afraid of. I'll start worrying when AI creates the next Budweiser frog ad",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Because god forbid those alcohol advertisers lose their jobs",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Because god forbid those alcohol advertisers lose their jobs",
                    "points": "-1 points",
                    "children": [
                      {
                        "comment": "Just an example. An AI that could create an original ad that was humorous and went as viral as that commercial did back in its day, that would be the job replacing AI to be feared.\n\nI'm of the opinion that's a ways off. I can understand the opposite view, I just don't agree. I used to pay for openAI but stopped around a month into gpt4 because it's too weak and frustrating to work with. Claude seems better at this point (still didn't notice enough of a difference to make it worth the money) but I just don't know if we're going to see those exponential developments until something drastic changes",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Of course it will replace human design. Whatever a human can do will be done better by an AI Agent. Such a myopic perspective",
            "points": "-6 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc3iz9",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1bc3iz9/extropic_ai_is_going_to_tell_us_somethi_no_about/",
    "title": "Extropic AI is going to tell us somethi no about the AI processor that they are building!",
    "points": null,
    "comments": [
      {
        "comment": "This is what they was going to say: https://x.com/extropic_ai/status/1767188810646126751?s=46",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This feels very scammy for some reason",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Everything is physics based LOL",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It uses quantum tunneling, not light.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc3dhk",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1bc3dhk/tool_to_configure_and_execute_a_multistep_llm/",
    "title": "Tool to configure and execute a multi-step LLM process?",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bc1myz",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1bc1myz/visually_ai_is_capable_of_dreaming_up_new_worlds/",
    "title": "Visually, AI is capable of dreaming up new worlds, taking us places we've never been before. Artists like Thierry Lechanteur are using it to create exciting, imaginative, otherworldly outputs. Why aren't we seeing a similar level of creativity in the text-based outputs being created by AI?",
    "points": null,
    "comments": [
      {
        "comment": "I think language models are commonly used pretty creatively. I've heard of people using them for creative writing purposes. They are definitely commonly used for text adventures, such as a DM, and for ERP. Due to the nature of the underlying self-attention layers of language models, I'd imagine it's quite difficult for them to produce very long strands of text that tie together in meaningful ways other than a name being recurring throughout a story - but perhaps that can be improved upon in the future.",
        "points": "2 points",
        "children": [
          {
            "comment": "Thanks – seeing people use them for D&D-style adventures feels like the most analogous reference to me too, and it seems like some people are doing cool stuff there. It still feels a little less boundary-pushing than some of the visual things people are creating, however. But that might just come down to the medium of writing in and of itself. IDK.\n\nAlso, there's something about some of the things I've seen by artists like Therry Lechanteur which almost... doesn't make sense? Or feels more completely novel. And this is what it feels like is difficult to get AI to replicate in words?",
            "points": "1 point",
            "children": [
              {
                "comment": "If you haven't already I'd recommend checking out https://civitai.com/ (just be wary you may want to keep the SFW filter on). There are a lot of really cool and unique pieces that people post on there, that seem more along the lines of the artist you're referring to (not in terms of style, but rather uniqueness).\n\nOn the topic of text - I agree it isn't pushing the boundaries in creative writing necessarily, there are some persona chat bots that are impressive, but that's the most I've found. I think the real beauty is whenever you combine text generation with other techniques - and you can do cool things like:\n\nHaving an LLM analyze and then visualize data\nHaving an LLM search through and answer questions about documents living on your PC\nUsing an LLM to create and parse formatted text (like JSON)\nUsing an LLM as a \"brain\" of sorts, for applications that interface with... anything really. One cool example I've seen is a minecraft bot which uses a model to extract what features a scene contains, formats that and gives that input to an LLM - the LLM then produces a list of possible actions to take, and another LLM is used to convert a chosen action into key presses that move the player around. There are other ways of doing this with AI, but it was just an interesting application.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Thank you! That website looks cool. I don't suppose you can recall any of the persona chatbots you found interesting?\n\nAnd those are some really interesting examples, thanks.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I don't remember any characters specifically, no - but this model: https://huggingface.co/Sao10K/Euryale-1.3-L2-70B seems to perform really well at following a persona.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "ty!",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I wouldn't say AI is \"capable of dreaming up new worlds\". It's a user that has dreamed up the world and asked AI to generate what they're thinking of. AI is producing a visualization of a humans request.\n\nI would say the difference is people are able to look at the picture and it takes a minute to notice the sixth finger or whatever else is wrong. The more abstract the easier it is to forgive weirdness in the picture, whereas with language if there's a grammatically weird statement in each sentence you're going to notice a lot quicker.",
        "points": "1 point",
        "children": [
          {
            "comment": "Fair point, which is why I asked whether it was a failure in human imagination.\n\nI'm not sure if your second paragraph is quite right in terms of what I'm asking. I don't think mistakes or abnormalities are bad, but it feels really difficult to get text-based AIs to break out of their immediate zone of reference and produce something that feels really novel. Idk if that's down to bad prompting, limitations in the way they work, or what. And I was wondering if anyone could show me an example of someone pushing the boundaries creatively in a text-based format.",
            "points": "1 point",
            "children": [
              {
                "comment": "What I mean by the second paragraph is simply that it's easier for people to look at a picture with \"errors\" and forgive it so it will get passed around and be more likely to go viral, whereas if there is awkward phrasing in a story people will be less likely to share it and therefore you won't see as many examples.\n\nAlthough now that I type it out it might also be because of our collective short attention spans as well?\n\nEdit: So essentially what I'm saying is there may be a few great examples out there but we just aren't seeing them.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Definitely also think attention spans play a part!",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It is very hard for humans to exactly put into words what we have in mind. The AI gives us exactly what we asked for, nothing less and nothing more, and that is usually disappointing.",
        "points": "1 point",
        "children": [
          {
            "comment": "I think this is a good point and such a simple one.\n\nIt's a lot easier to say: show me a streetscape with cherry blossom trees and pink water reflected on the floor (like the image I linked above) and create something visually impressive. Than to ask a GPT to create a magical world of XYZ and expect it to be anything interesting.\n\nAll in all, AI poses an interesting question to me in terms of how we communicate. Both to AIs to get it to create what you want it to, and also how we communicate to each other to stay ahead of the trend of AI-written stuff.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "AI can only mix existing worlds that it has access to in its training. So far there isn't a way to hallucinate into something coherent that could amount to a 'new' anything.",
        "points": "2 points",
        "children": [
          {
            "comment": "Yeah, for sure that's part of it. But I've seen visuals created that combine elements from different places to create something that feels interesting and new (for example: https://www.instagram.com/p/C4U7LZLNmnK/?hl=en) – and I was wondering why it doesn't feel like we're quite there in the same yet with word-based formats.",
            "points": "0 points",
            "children": [
              {
                "comment": "In relation to word-based formats. It really follows that adage of a picture paints a thousand words. It takes a lot more to describe something new and again, it is easier to have a simulacrum of something new and different in images but not so much in words.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Agreed. In some ways I think it's going to be interesting for writers (or just people who communicate in general), because it's going to push us to be more novel in the words we choose to use and how we structure our messages.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Sure but Thierry Lechenteur is not an artist.",
        "points": "1 point",
        "children": [
          {
            "comment": "Why isn't he, and why is it relevant?",
            "points": "0 points",
            "children": [
              {
                "comment": "Because it diminishes the term.\n\nNot least of which is he doesn’t have copyright on any of his images, because you can’t copyright AI output.\n\nHis role is more of “producer” than artist, which has been the butt of jokes for decades about now lazy and self-important such people are.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Fair enough! Although you didn't answer the second half of my question.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Language models are overly restricted currently, goes beyond safety",
        "points": "0 points",
        "children": [
          {
            "comment": "this is the correct answer",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Websites like DungeonAI use specifically trained LLMs to create choose-your-own-adventure style stories or scenarios. You can get pretty advanced levels of control of the story too by adding world/character/event info to the stored \"memories\" of a specific story.\n\nFor instance, you save an entry with keywords of a Character's name or common descriptors, and fill the description with pertinent information of that characters qualities, appearance, backstory, etc. that way when the character is references or interacted with in the story it will draw from that saved information",
        "points": "0 points",
        "children": [
          {
            "comment": "Thanks, I've heard of people using GPTs for D&D-style stories, and definitely feels like the most interesting written stuff people are using AI to create. Was wondering if there was anything else weirder or more left-field out there. But will give DungeonAI a play around with, so thank you for sharing :)",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why aren't we seeing a similar level of creativity in the text-based outputs being created by AI?\n\nWhat makes you think you're not?\n\nThe web is inherently visual so not only is there more opportunity to see AI visual art but, a lot of AI art really looks like AI art. But how would you even know when you're seeing AI text content? For example how many posters in this subreddit are human?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "the fact that people call them 'outputs' probably isn't helping",
        "points": "-1 points",
        "children": [
          {
            "comment": "They are outputs... what else would you call them.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Thanks for the insight! Very helpful and constructive.\n\nI would argue 'outputs' is a decent-enough term to use seeing as there's no set definition for what we're talking about being created. It could be novel length or it could be single words, portmanteaus, etc.\n\nI don't suppose you have anything helpful to add besides the snide comment?",
            "points": "1 point",
            "children": [
              {
                "comment": "Not meaning to be snide at all. It could be a novel, or a short story, or a poem. Calling them all 'outputs' cheapens the hell out of it, and won't get any AI haters on side.\n\nAnyway, I'm off to read the collected outputs of John Keats.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "It could also be something completely different to a novel, short story or poem. In fact, I'm more interested in the most experimental applications, and people tend to jump straight to linear novel-writing when I ask about this. So outputs (or even 'experiments') definitely feels more appropriate than 'writing' 'works' or anything else you might put in there.\n\nAlso, I'm not particularly interested in placing a value on whatever things are created beyond the value they inherently demonstrate, and I'm not trying to convince anyone to get on side. I'm trying to find where the boundaries are for AI creatively, from a words-based point of view.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc1k1p",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/1bc1k1p/rag_for_multiple_documents/",
    "title": "RAG for multiple documents",
    "points": null,
    "comments": []
  }
]