[
  {
    "id": "t3_1bh32w5",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bh32w5/myth/",
    "title": "myth?",
    "points": null,
    "comments": [
      {
        "comment": "wut?\n\nNo. Lol. Every action creates some sort of artifact somewhere",
        "points": "5 points",
        "children": [
          {
            "comment": "Just buy a new laptop with cash and use it to do one thing...what artifacts? Lol.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Not all artifacts can be correlated.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Depends on what you mean by myth.\n\nOther than immutable laws of physics is anything 100% in this world.\n\nCan one take steps to reduce their online signature? Yes.\n\nCan someone do that 100%? No.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bh1rk9",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bh1rk9/would_access_to_a_secure_platform_for_data/",
    "title": "Would access to a secure platform for data exchange benefit your cybersecurity solutions?",
    "points": null,
    "comments": [
      {
        "comment": "Sounds like you're using this post as a lead gen.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "oh look an ad",
        "points": "1 point",
        "children": [
          {
            "comment": "All the people that answer yes to the shitpoll are going to get replies of, have you heard of X, can I put time on your calendar for Monday to discuss more?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bgw52y",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://www.standard.co.uk/news/world/russia-election-vote-cyber-attack-vladimir-putin-presidential-b1145729.html",
    "title": "Russia's ruling party 'hit by cyberattack' during presidential election",
    "points": null,
    "comments": [
      {
        "comment": "Hello, everyone. Please keep all discussions focused on cybersecurity. We are implementing a zero tolerance policy on any political discussions or anything that even looks like baiting. This subreddit also does not support hacktivism of any kind. Any political discussions, any baiting, any conversations getting out of hand will be met by a swift ban. This is a trying time for many people all over the world, so please try to be civil. Remember, attack the argument, not the person.\n\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The election is rigged anyway, so what difference would I tv make?",
        "points": "15 points",
        "children": [
          {
            "comment": "Putin wins by only 98% instead of 138% ?",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This is great news",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And the winner is...Anatoly Cherdenko?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I am shocked! I’m sure it has nothing to do with Ukraine’s call for volunteer hackers …",
        "points": "-23 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bgvdae",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bgvdae/concerns_about_cyberwar_and_outdated_systems/",
    "title": "Concerns about cyberwar and outdated systems?",
    "points": null,
    "comments": [
      {
        "comment": "I hate to ask this, but are you a student? This post is about a decade late.",
        "points": "32 points",
        "children": [
          {
            "comment": "Go have a look at OP’s post history. Just all posts specifically designed to get people pissed off. There’s one about OP finding 9/11 annoying.",
            "points": "9 points",
            "children": [
              {
                "comment": "Nice you went a year back to find something and misrepresented my entire point by taking that out of context.\n\nCompletely unprompted by the way.\n\nReddit is about discussion and discussion is meant to communicate ideas and reflect on your own. Half the things I've said on reddit I no longer believe or think a little differently about.\n\nAnd if I said something you don't agree with it doesn't mean I said it to piss people off.",
                "points": "-11 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Hobbyist",
            "points": "-19 points",
            "children": [
              {
                "comment": "Once you actually get into the finance meetings you understand why all these systems have been kept running so long. A lot of times it's not just the initial capital for the hardware but added budget for new/upgraded software licensing.\n\nYes everyone wishes they could get the money to put in new equipment but a lot of times you're not in the position to make those decisions.\n\nOne talk at a conference I went to last week was pretty blunt that unless there was enforceable legislation, most companies will do the bare minimum.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It is because of questions like yours that we have an entire field of practice referred to as Risk Management.",
        "points": "9 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We've been fighting that cyber war for a while now. Feel free to up your skill set and join us.",
        "points": "10 points",
        "children": [
          {
            "comment": "What path would you recommend outside college? I know enough that I could easily brush up on and/or expand my knowledge easily in order to get certs. My main problem is access to hardware to practice with so I just use linux, raspberry pis and my laptop.",
            "points": "-9 points",
            "children": [
              {
                "comment": "I see this question asked a lot and I understand why but it's hard to answer. Someone's path is usually going to be dictated by their access to resources and passion. You've already touched on the challenges so you have a direction. Do you work in IT or is this purely hobby at the moment?",
                "points": "7 points",
                "children": [
                  {
                    "comment": "Say it louder for the \"Can you teach me\" people in the back.",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "Unrelated note, can I DM you about how to get into cybersec? Thanks. /s",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "Hello. It appears as though you are requesting someone to DM you, or asking if you can DM someone. Please consider just asking/answering questions in the public forum so that other people can find the information if they ever search and find this thread.\n\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
                            "points": "2 points",
                            "children": [
                              {
                                "comment": "Just a joke automod.\n\nGood bot.",
                                "points": "5 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "Wait, wait, wait, I have a CISSP, how come I cannot find a job?!",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "Yes, you can. We can discuss the \"terms\" of you getting \"hired\" that way. nudge nudge wink wink\n\n(is joke)",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Hobby. I currently work in a factory and I have 36 hours a week to listen to YouTube while working. The rest of my time is kids and free time after the kids go to bed. I've messed around with linux, discord bots, web servers and gaming servers, etc. since highschool as well as a short glimpse at things like kali, wireshark, tor, etc. I took C++ and A+ in highschool but only paid enough attention to pass for my graduation credit.\n\nI'd like to get into IT but ideally something that's not filling a quota or doing the same thing all day. A little variation would be ideal. The only reason I can survive factory work is because I can listen to YouTube. I'd be willing to sacrifice that a bit though if there was legitimate prospect of advancing beyond it.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "So you've identified some challenges. You have a stable job, family to support, and not a lot of room for risk. The pay decrease you would likely see moving into a help desk type role could be an issue along with the potential of the 'mundane' setting in.\n\nThe downside is that for someone in your position that would be the quickest way to gain access to hardware and brush up those fundamentals. Personally I don't see anyone being truly successful in cybersecurity without those fundamentals. Are there any entry level IT roles where you are now?",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "Indeed shows two positions under \"IT\" and neither are entry level.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "Keep your eye out for any available help desk roles in your area. Check out any MSPs around you. Keep focusing on solidifying your skill set and learning. Don't expect anything to come quickly and be prepared to put in the work. You can learn any and every skill you need for free on YouTube.",
                                "points": "1 point",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "I hate to say this to you but we still have quotas. They just come in the form of puzzles where half the pieces are missing and the other half is on fire while under the immense pressure of saving a company, reputation and all of its employees.\n\nOh yeah and you already prepped them for these scenario twice a year for the last 5 years with the limited resources of what management thought was needed.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Do the free ISC2 cert and see if it interests you. If you are talking about Linux and technically minded SOC work will suite you I guess.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I’m genuinely surprised by the downvotes. Anyone has a good guess to share?\n\nMy only one is in short: ah this one is also lazy to do a google search (?)",
                "points": "0 points",
                "children": [
                  {
                    "comment": "I also got downvoted to hell because someone asked if I was a student and I said I was a hobbyist lmao. Just reddit things I guess.\n\nA lot of times people ask questions like this because the answers found when searching are a bunch of videos or articles telling you how to do something but ultimately leaving you with \"do it however you want\", which isn't wrong but is also unhelpful in some ways. It's helpful to hear directly from people what their approach was, objectively.",
                    "points": "-1 points",
                    "children": [
                      {
                        "comment": "That's not why you're getting negbanged.\n\nlmao indeed.",
                        "points": "-1 points",
                        "children": [
                          {
                            "comment": "Why then?",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "Because you asked a question that really just contributes to online noise and then you doubled down on being obnoxious about it.",
                                "points": "-1 points",
                                "children": [
                                  {
                                    "comment": "I thought it was a good question and I was hoping for useful answers (which I got from other commenters).\n\nI thought outdated software was really bad but learned that cyber security negates a lot of its problems.",
                                    "points": "0 points",
                                    "children": [
                                      {
                                        "comment": "I thought outdated software was really bad\n\nBut you haven't articulated why you think that -- so no, it's not a good question in the least.\n\nFor example, you mentioned elsewhere your plasma table runs XP.\n\nDoes the table work?\n\nWhat is the risk of it running XP?\n\nWhat's your actual problem with it?\n\n​\n\nbut learned that cyber security negates a lot of its problems.\n\nAt the most atomic level security is a field of risk management. If someone grinds on something running older software just because it's running older software, well, they're likely not very good at security. You learned wrong.\n\n100% it would be great if there wasn't any obsolete software in the wild.\n\nThat's NOT reality though.",
                                        "points": "0 points",
                                        "children": [
                                          {
                                            "comment": "Does the table work? What is the risk of it running XP? What's your actual problem with it?\n\nThat's why I'm asking how it isn't a problem. I'm not an expert so I'm asking. If you find it obnoxious you can not engage with it and if it's against the subs rules then the mods can delete it. I don't understand the aggression. I'm not making any claims. I'm asking.",
                                            "points": "-1 points",
                                            "children": [
                                              {
                                                "comment": "",
                                                "points": "",
                                                "children": [],
                                                "isDeleted": false
                                              }
                                            ],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "One of the things that no one talks about is the cost of compliance at scale of a country. In the US we tend to legislate major changes into the future or after it’s clear most can meet the requirements.",
        "points": "3 points",
        "children": [
          {
            "comment": "Oh buddy, most businesses can meet compliance already. They would just rather lie on the cyber liability insurance questionnaire than actual spend the money on getting in alignment with compliance. Insurance companies need to mandate audits before accepting ppl for insurance is what needs to happen.",
            "points": "0 points",
            "children": [
              {
                "comment": "Business, government, public works, small business, private companies, etc.\n\nAnd I’m not saying they can’t, but they aren’t doing it today which represents new costs which drives new staff, purchases, etc.\n\nDo the resources it takes to enact broad sweeping changes exist? How long should be given for some laws to go into effect? What laws should be universal and which should be industry specific?\n\nMy opinion tends to be those who think we can just flip a switch tend to have never operated at high levels of large or diverse organizations and don’t tryout recognize how slow change is and how much inertia there is.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Cyber insurance is the biggest scam in this industry. People shouldn't buy it unless regulations or agreements require it. And even then only buy the minimum.\n\nRather than insurance, folks should be investing that saving into a rigorous BC/DR program.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "I respectfully disagree. I believe there needs to be both a standard level of compliance and a good insurance policy. IMO you cannot have one without the other and if you do you're asking for it.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "When was the last time you have read the complete terms and conditions of such a policy?",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It's not that we have a lack of compliance laws. We have a lack of enforcement, at a catastrophic level.\n\nUntil that changes we will not see businesses caring about security, customer data or GRC.\n\nSteep fines and a wall of shame for negligence should be the normal so the general public knows who to avoid doing business with.\n\nAdditionally, insurance companies need to audit anyone applying for cyber liability insurance. I literally have the, \"I don't need security / compliance is too expensive\" conversation all the time.\n\nBusiness owners and stake holders do not see and will not see the value as long as insurance bails them out when they lie on their insurance questionnaire.",
        "points": "2 points",
        "children": [
          {
            "comment": "Where would you recommend a wall of shame? HIPAA has OCR.\n\nI’d guess things like a PCI equivalent but I’d assume you’d want something for industries in unregulated areas as well as score cards for government and others that are essential?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "As is usually the case with American government, changes won't be mandated until something absolutely catastrophic happens, then they will overreact with their legislation.",
        "points": "2 points",
        "children": [
          {
            "comment": "And even then, even with the overreaction, who will be there and possesses the necessary skillset to ensure the catastrophe doesn't happen again?\n\nFor a good laugh, follow Jen Easterly on social.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "While many systems are legacy systems, it's important to note that several of them have not been updated due to their superior reliability compared to their modern counterparts, or the cost of these upgrades (not just in terms of money, but also downtime) would far outweigh the benefits (a vulnerability of the outdated system may have been highly unlikely to be exploited prior to the upgrade).While we need to be resilient against threats, any plan you have must align with the organization's objectives.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Speaking from the manufacturing side, the biggest problems arise from the PLCs and CNC machines that cost hundreds of thousands of dollars. There is no reasonable way to update or replace those gigantic machines without the company going under, so you build security around them instead.",
        "points": "0 points",
        "children": [
          {
            "comment": "I work on a plasma table that runs xp. I don't think it's had a single update since it was shipped.",
            "points": "0 points",
            "children": [
              {
                "comment": "Are you dunking on it for no other fact than it runs Windows XP?\n\nSo what's the actual risk?\n\n​\n\nplasma table\n\nSince we're talking industrial applications:\n\nI worked on a spectrum analyzer that runs Windows CE.\n\nI worked on a frequency generator that runs RHEL 5.\n\nI worked on avionics that run RHEL 5.\n\nI worked on a RF transmitter and servos that use telnet to communicate.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Wait till you find out all that same critical infra is also vulnerable to high explosives we know many hostile states possess!",
        "points": "0 points",
        "children": [
          {
            "comment": "Isn't everything?",
            "points": "-1 points",
            "children": [
              {
                "comment": "That’s the point I’m guessing. It’s about reasonable risk management. Not managing every risk possible.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Yes. The primary defense against vulnerabilities in critical infrastructure isn't achieved by making them unhackable, explosive proof, nuke hardened. It's about making it clear to other countries that if they mess around they'll get a punch in the face.\n\nThe reason I don't get burgled each night isn't because I have doors that are invulnerable to sledgehammers and axes or unbreakable windows, it's because there are well armed trigger happy folks on speed dial 911.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "I see, that makes sense.",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "There are ways to mitigate security risks such as out of date OS's. The big thing about cybersecurity is that there is this ideal, then there is reality, a system being \"out of date\" or even the software already passing \"end of life\" doesn't mean that the battle is lost. The reality is some systems simply can't be updated, or updated very easily, and that is ok if we can put in other mitigating factors. Take an MRI machine, so what if its running on windows XP, the cost to buy a new MRI that is using more modern software might simply be not possible (they aren't cheap), so you will deploy other security tools and features to help mitigate that risk.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "How is the fact that government, banking, healthcare and other critical infrastructures are still run operating systems and programs that have reached EOL not a catastrophic, epic, infinitely urgent and dire problem?\n\nIt is absolutely an urgent and dire problem.\n\nBecause government, banking, healthcare represent the unholy trinity of IT buffoonery and those places either are:\n\n1, run by morons (especially gov't)\n\n2, conflate compliance for security (especially banks and hospitals)\n\n3, haven't learned how to operate using security as a business enabler...\n\n... or a combination of the above.\n\nCompounding the problem is that security as an industry has a shortage of:\n\n1, people who actually have security-related skills\n\n2, people who know how to run a business.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "still run operating systems and programs\n\nYou'd be surprised.\n\nI've seen test equipment still running Windows CE, ATMS and other types of kiosks still running Windows XP, there's still a ton of RHEL 5 and 6 on the backend globally, and a lot of telnet still exists in the wild -- especially in industrial applications.\n\n... and I don't see a forecast for the apocalypse within the next 24 hours.\n\nWhile it would be nice if we could get folks off of that old tech, the reality is there are still a lot of valid business reasons for why it exsits.\n\nWith that said, what security professionals should do is not ask why, shame, or look for fucking incompetent governments to make even more laws that it cannot enforce (go read CRA, DORA, and NIS-2 sometime) but rather the security professional should look at how one can harden that existing tech to make it is secure as possible until the tech debt can be paid off.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "this post just reminded me of my first course in college. damn those were good times. I was much more naive far more optimistic back then.\n\nthanks OP I appreciate this glimpse into previous emotions.",
        "points": "0 points",
        "children": [
          {
            "comment": "I might have sounded like I was suggesting proactive legislation. I doubt they'd do anything until the dollar value of losses is high enough. As for cyber security itself though yeah, I'm pretty naive.",
            "points": "0 points",
            "children": [
              {
                "comment": "it’s alright, genuinely! I kinda forgot how I used to chill on campus reading with excitement thinking I’ll be able to fix it.\n\nnow I’m 10 years into my career having had very little changed lol.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "The governments lack of motivation is job reassurance.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "lolol my coworker said that the other day. We were frustrated how the devs didn’t work on sec and he said that exact thing! literally the exact thing!!! did you say that this week?",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Risk acknowledgement/risk approval. Systems are deemed critical to the organization to continue operating on a daily basis - the AO doesn't want to shut them down - time is a flat circle.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bgttdk",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://github.com/Geeoon/DNS-Tunnel-Keylogger",
    "title": "DNS Exfiltration and Tunneling Keylogger",
    "points": null,
    "comments": [
      {
        "comment": "DNS tunneling is always interesting! A lot of Threat actors are very creative when it comes to utilizing the different type of records. An example is like in this tools where the A record response is an IP but not a place where you connect but rather to give further instruction or assign a certain bot-ID to the \"infected\" client.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bgslx0",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bgslx0/testing_on_websites_created_by_myself/",
    "title": "Testing on websites created by myself",
    "points": null,
    "comments": [
      {
        "comment": "If you want to get more experience in web pentesting, you should to do portswigger labs.It will help your future pentesting career.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Did you already check your network adapter settings of your kali vm? If you run your web application on your windows host you should be able to access the website from your browser in your kali vm by just typing the IP of your windows pc in the search bar (assuming the webapp runs on standard http port 80). If it runs on another port like 4000 you can specify that by appending :4000 on the IP in your search bar.\n\nIf you still can't access the webapp you might have wrong network adapter settings configured for your vm. In this case try to use the bridged mode.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I would assume this has to do with your networking.\n\nESXi?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bgr1en",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bgr1en/windows_11_laptop_with_password_but_not_bitlocker/",
    "title": "Windows 11 laptop with password but not Bitlocker... how secure?",
    "points": null,
    "comments": [
      {
        "comment": "Not secure at all. Someone can either a) boot to a different os via USB and access all the data or b) take out the drive and put it in another computer and access all the data.\n\nWhy would you not use BitLocker? If it’s running Windows 11 it should have a TPM and you should be able to enable BitLocker.",
        "points": "57 points",
        "children": [
          {
            "comment": "you could use tools like KON-BOOT (kon-boot.com) to access the Windows system without any password at all , matter of seconds really",
            "points": "8 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Without understanding why (yet), we have found that some machines will ask for the Bitlocker key on every boot, which is very inconvenient. Otherwise we use Bitlocker.",
            "points": "-18 points",
            "children": [
              {
                "comment": "There are different deployment settings for bitlocker based on group policy/policies assigned through intune. That scenario sounds like boot time password has been enabled. You can use bitlocker without this, where access is restricted based on the TPM and windows password. Boot time is better from a security perspective really, but even without it you'd be in a better place than you are now.",
                "points": "11 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "You need to enable TPM in the bios.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "The full Bitlocker recovery key, or a pre-boot bitlocker pin?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yes\n\nPotentially, yes\n\nAfter cracking your password hash, yes\n\nThat depends on the version of office and the strength of the passwords but potentially ok\n\nOther than just about everything? :)",
        "points": "11 points",
        "children": [
          {
            "comment": "Hashes are not cracked, they are guessed. Basically impossible with the computational power available to humanity today. Furthermore, password algorithms use hashes but are not just hashes. I don’t which algorithm is used by every password manager, but there may be vulnerabilities. Furthermore, password reuse is also a thing, so the same password used by that manager could be found elsewhere. The worst thing is that many users use the password managers embedded in browsers. They are generally much less secure than standalone password managers, and a session may be enabled and easily accessible on the browser. Therefore, the correct answer is “it depends” - hashes are the least of the worries here.\n\nThey are not secure, in any way. Even the latest Office files protected with “passwords” are easily crackable (it is often enough to import them in Google Sheets to unlock them).\n\nIf you open an Office file you will find it is a ZIP and what is protected by encryption is just the capability to access certain information, not really the information itself.",
            "points": "-7 points",
            "children": [
              {
                "comment": "You had me questioning myself for a minute. The beginning of your statement is just not true. They are indeed cracked not guessed. I knew at least from common phrasing it was considered cracking, but seems it is definitely the correct term too.\n\nhttps://www.sciencedirect.com/topics/computer-science/password-guessing",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "password manager in the browser\n\nTo clarify, I mean the password manager in Google Chrome. When you are logged into Windows and using Chrome sync, the password autofill will work without asking for a different password. My question is whether someone with access to just the disk (no Windows login, no Chrome sync) can access the contents of the password manager?",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "They are easily decrypted. They are stored in an encrypted format, but the decryption key is stored in a local config file, that can be accessed easily. Check this repo: https://github.com/ohyicong/decrypt-chrome-passwords and you can see how its done",
                    "points": "6 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Theres a few ways of doing this but from memory chrome doesn't store passwords very securely so they are fairly easy to obtain. One of the easier ways could be just resetting or removing the local user account password for Windows, then booting back into windows and the user account which is pretty trivial to do if windows is not protected by bitlocker. You'd then have access to all the apps, including Chrome to view passwords.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It's hell on Earth. Thanks for the free LSASS dump and entry point to your company network.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As everyone has already said this is not secure at all.\n\nLook up ultimate boot cd. There are more modern tools, but any amateur can use a tool like that and effectively own the machine in this scenario.\n\nAs for accessing the drive and or the contents, that is even more trivial with physical access. You just pop the drive out and plug it into a USB to SATA/SAS adapter and browse the contents at will. Depending on the machine and how far they buried the drive you might have 5 min worth of work with a small screwdriver.\n\nOr just carry a livecd version of Ubuntu on a USB key. Boot the laptop up with it and mount the volume. Assuming the laptop has more than one USB port on it copy anything of interest off to the other USB and walk away.\n\nIf you are considering such due to the admin cost / skillsets behind bitlocker etc. Why not look at self-encrypting drives? They are much more readily available and far less of a learning curve for your org. And you would be far better off than this.\n\nAlso, a note about the passwords on office docs. A copy of John the Ripper or PyCrack and a CUDA based GPU and a lot of office document passwords fall in minutes.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not secure. I have tools for unlocking that. Microsoft DART.\n\nOr I can just remove the hard drive and put it in a USB enclosure",
        "points": "1 point",
        "children": [
          {
            "comment": "This is mostly (possibly entirely) for laptops with soldered SSDs, so it sounds like the machine itself would still be needed.",
            "points": "-2 points",
            "children": [
              {
                "comment": "True, it depends on the laptop. But it seems to me that mostly only the low-end manufacturers solder things into the machine.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "TL; DR if the risk of physical theft is large, I.e. with a laptop, you need full disk encryption like Bitlocker.\n\nAlso please consider using a real password manager like Bitwarden. Browser password managers are not very good—not even Chrome or Firefox. Be sure to create an “emergency sheet” with your master password and other recovery material, and store it securely, preferably with extra copies in multiple physical locations.\n\nPut your Bitlocker encryption key in your vault.\n\nAs far as confidential documents, even with FDE, you should consider another layer of encryption. It could be as simple as 7zip. I like VeraCrypt. In any event, store the encryption key in your password manager.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "regarding security of the bitlocker:\n\nhttps://hackaday.com/2024/02/06/beating-bitlocker-in-43-seconds/",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Unencrypted",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not having an encrypted hard drive is like leaving your car unlocked.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I made a post about this recently. My friend forgot their password to their windows 11 laptop and I broke them back in. I plugged in a Kali USB, located the SAM file, and then used the chntpw command to remove the password. When we booted back into windows, it logged right into his account. If it’s a domain account, I can’t remove the password, but I could still see the contents of all unencrypted drives.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All those things are trivial to acomplish with bitlocker disabled. Any moderately competent fresh out of high school nerd could do it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Bitlocker encrypts the filesystem so it cannot be accessed outside of the system (IE, cant access it on another system, cant Boot to something like ntoffline). However....https://www.tomshardware.com/pc-components/cpus/youtuber-breaks-bitlocker-encryption-in-less-than-43-seconds-with-sub-dollar10-raspberry-pi-pico\n\nSo TPM + PIN on boot is required if you are looking for full end to end security.\n\nCookies can be abused, yes. You should sandbox your browser between sessions if this is a concern.\n\nPasswords should be kept in a password vault like bitwarden, Keepass...etc and not in the browser..ever.\n\nMS office documents can be decrypted using many different password brute force tools available. I had someone at work lock them selves out of an XLS and we got it unlocked in 30mins with such a tooling.\n\nCommon stuff like \"dont use the same password in other areas of the system\" and \"MFA all the things\" apply here. You can even add Windows Hello to your start up so you have to pass MFA on logon. There are free credential providers out there like DUO that make it simple to add MFA to local windows accounts through the logon screen boot strap.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yes\n\nYes\n\nYes\n\nDepending on the password\n\nYes, everything",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yes. They can pull the drive and connect it to another computer or boot into a portable OS on that computer and access the files that way.\n\nYes, they can steal session tokens, allowing authentication to websites you're logged into (this is how MFA is bypassed in many cases).\n\nAbsolutely. Browser-native password managers are notoriously bad for this. Chrome stores all of their passwords in the %LocalAppData% folder.\n\nNo. They can easily be cracked.\n\nEverything stored on the hard drive can be accessed. So yes.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Say I wanted to boot Linux from a USB drive. I changed the boot order in BIOS and had to disable secure boot to do this. Now it wants me to either disable EFS or manually type in a code from my Microsoft account on every windows startup. Any way to get both file encryption and easily boot Linux from USB?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Konboot go Brrrrr\n\nSo to answer your question, nothing is safe.",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bghw6h",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bghw6h/licenses_as_part_of_your_threat_model/",
    "title": "Licenses as part of your threat model?",
    "points": null,
    "comments": [
      {
        "comment": "I pull together our IT incident response team, (who are different to our CIRT) explain to them what is going on, what risks are associated with either and let them escalate it up and decide.\n\nIn the lessons Identified I'd be asking why nobody knew about these license changes sooner as enterprise customers are typically warned 90 days in advance of these sorts of things.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Call IT and tell them to deal with it.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is a business decision, not a security decision.\n\nFirst off, I DON'T have admin access to these systems or licensing logins, because I'm not the admin for the IT systems.\n\nI would offer my support, but clearly indicate that this is not a security issue, I don't have access, and how would they like me to help.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bghsvp",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bghsvp/root_cause_of_solarwinds_hack/",
    "title": "Root cause of SolarWinds hack?",
    "points": null,
    "comments": [
      {
        "comment": "The answer to your question is the subject of an SEC lawsuit against Solarwinds at the moment. Solarwinds stated to customers and shareholders that they had certain security processes in place, but it appears that this was not the case. At this point, reliable determination of the root cause of initial entry will probably never be known but several solid theories will come out of it.",
        "points": "38 points",
        "children": [
          {
            "comment": "Which is funny, because I wouldn't thought they'd have really good telemetry in their network",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Ooh I wonder if some audit firm is swearing bullets too",
            "points": "1 point",
            "children": [
              {
                "comment": "Probably not? Audit doesn’t usually go into the areas where the questions lie. The real heat land on the officers of a company in cases like this.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You haven't found anything because even Solarwind doesn't know for sure how they were initially breach. There was 14 months btw initial breach and their incident response. Most companies keep security logs up to a year. At this point, only the APT team knows how they got in. But considering how poor their security was, it was probably run of the mill phishing credentials harvest campaign and I doubt they had MFA everywhere.",
        "points": "9 points",
        "children": [
          {
            "comment": "That's what I thought...\n\nCrazy to think that one of the biggest hacks in modern history may have been caused by some hapless John from Accounting clicking a phishing email",
            "points": "4 points",
            "children": [
              {
                "comment": "a lot of the biggest hack came from exactly that to be fair",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Most still do. Easiest way win.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "There is considerable circumstantial evidence it was initially social engineering.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Literally the most common vector for attacks",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "You haven't found anything because even Solarwind [sic] doesn't know for sure how they were initially breach.\n\nYes they do.",
            "points": "-1 points",
            "children": [
              {
                "comment": "They have theories at best.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "I don't recall you being there.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I don't recall you being there either.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "You weren't there so you cannot say that in the first place.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The CEO stated they likely gained access through a compromised O365 account. From there they gained access to specific accounts that granted them access to the dev environment.\n\nhttps://www.crn.com/news/security/solarwinds-ceo-confirms-office-365-email-compromise-played-role-in-broad-based-attack#:~:text=SolarWinds%20CEO%20Sudhakar%20Ramakrishna%20has,in%20business%20and%20technical%20roles.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's been a minute but IIRC, Solarwinds claimed on Twitter that an intern's Solarwinds github access was compromised due to a reused password. The APT actors leveraged that into access to the upcoming build commits which were later digitally signed and deployed as the next update. They had already been watching internal Solarwinds CI/CD workflows long enough to know potential targets, repo locations, update and deployment schedules, and on what cadence final commits were to be digitally signed. From a tradecraft perspective, it was truly swoon worthy. Wait until you research how they tracked their compromised victims (custom encoded domain generation algorithm subdomains). And they were so patient...literally one or two actions on objective and then wait two months before the next actions on objective.\n\nBecause \"blame the intern\" was so poorly received, especially in light of FireEye's \"take full responsibility\" approach when they made their announcement they'd been compromised, Solarwinds quietly removed this claim.\n\nI will say one thing having worked with some highly sophisticated red teams/pentesters, it's not uncommon to find useful logins, secret tokens, and API keys buried in git archives because the repo owner didn't properly scrub old code.",
        "points": "6 points",
        "children": [
          {
            "comment": "It’s often said that top level hackers learn more about your infrastructure than any of your team know.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "All of the articles I've read about SUNBURST do not reference solarwinds123, and SolarWinds currently denies that that password had anything to do with the hack. SolarWinds also claims that their source code was never touched, and that the hack occurred right before the compilation process instead. There was malware called SUNSPOT which injected tainted code into their compiler. Here is CrowdStrike's analysis of SUNSPOT: https://www.crowdstrike.com/blog/sunspot-malware-technical-analysis/ . It is highly sophisticated, and clearly this hack went far beyond the APT pushing new code to Github.\n\nSolarWinds currently claims that solarwinds123 was the password to an unrelated FTP server serving specific files, and was not an attack vector here. I also did not see anything online about them 'blaming' this intern for the hack, they just confirmed that an intern accidentally released that password and that that specific issue has been rectified.\n\nIf they had previously blamed the intern for the entire hack and then scrubbed that claim I would really appreciate it if you had any source?",
            "points": "1 point",
            "children": [
              {
                "comment": "so one thing we have to be mindful of here is \"the fog of war\" effect. Many details which have come to light now were greatly different than they were at the time, additionally, cynicism hat on for a minute, we have to be mindful of Solarwinds' efforts to damage-control their reputation, and this may include carefully worded statements to gaslight or doublespeak, not saying that is happening, just that it may be.\n\nIn this case, the solarwinds123 password was believed to have been to an update sever (not an unrelated FTP server) in around 2021, which would've allowed for the delivery of compromised updates of the Solarwinds Orion network monitoring software:https://web.archive.org/web/20210301225243/https://thehackernews.com/2021/03/solarwinds-blame-intern-for-weak.html\n\nThey categorically blamed this password fail on the intern at the time and many correlated this with blaming the whole attack on the intern. Technical reports and news reports of the SUNSPOT malware actually used during the build process was less circulated than this story (anger drives click rates, after all).",
                "points": "3 points",
                "children": [
                  {
                    "comment": "Thanks for the advice, and the link.\n\nI am trying to understand if access to that already publicly reachable update server, presumably without direct access to the rest of the network, could have enabled the hackers to penetrate the SolarWinds network and to then plant SUNSPOT into the build process. If that update server was in a screened subnet it should not have mattered if hackers got access to it, and it should not have led to SUNSPOT being planted.\n\nI guess it's impossible to know for sure. Someone else here mentioned that the initial attack vector could have been SolarWinds' Office 365 as well, and that SolarWinds found evidence of an O365 hack",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "So remember to consider the trustworthiness and bias of your sources.\n\nWhat would Solarwinds stand to gain by continuing their initial honesty in the face of lawsuits? What could they stand to lose?\n\nI'm sure there are archives of accounts like this and screenshots. You'd only get alleged evidence, but they have no skin in the game to make stuff up... Unlike Solarwinds, whose lawyers have instructed them to deny everything unless proven in a court of law. 😅",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Entirely possible my memory is foggy after so many revelations and changes in the case. I'll see what I can find based on recollections and get back to you if I find anything concrete.\n\nFWIW, solarwinds continuously obfuscated the truth to minimize the culpability of its security practices, which further clouds the real fact finding efforts here. Thankfully this was the hack of the century so there are a lot of facts from different sources.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Is this real life? They seriously scrubbed it all? I despise companies who think they can rewrite history. solarwinds123 is absolutely the hack. Proof? I'll probably have to hack them to get proof. You should remind me in a month.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "OP, take note... this is closer to the truth than most of the other comments in here.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "State sponsored intelligence gathering operations are still classified. We might only know 10% of the story.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It is my understanding that a Jenkins machine was exposed to the internet using the password \"solarwinds123\". They were then able to move laterally from there.",
        "points": "1 point",
        "children": [
          {
            "comment": "Thats what I remember. My company a solarwinds server up and running and we were tracking this issue closely. That was a publicly disclosed detail that immediately cause the decision to shit down that server and never trust them again.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Their development was outsourced, and there was very little control over the safety of their pipeline. For all anyone knows, they were running some unpatched version of Jenkins and someone was able to contaminate the build environment. I look forward to seeing what the lawsuit comes up with, this is the example I use when I tell my clients that DevOps is not a “set it and forget it” thing. You have to watch that pipeline and everything it builds like a hawk.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Do they really still not know what happened?\n\nNo.\n\nThey absolutely know what happened.\n\nThat's why I cringe that people in this industry parrot now that a SBOM for example, secures the supply chain. A SBOM would not have prevented SolarWinds.\n\nBut for a number of reasons, the whole story is not going to be disclosed.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I remember this one pretty well; not long after it was reported someone referenced a github issue where a security issue was raised for the infamous solarwinds123 password. The issue appeared to not be actioned.\n\nBlame was then shifted to the Intern, saying it was their fault for changing it, and no one noticed for a number of years afterwards.\n\nhttps://www.itpro.com/security/cyber-attacks/358738/intern-blamed-for-weak-password-that-may-have-sparked-solarwinds\n\nMy understand was downloads.solarwinds.com FTP service was using said credential, and allowed access to a directory which synced with their code repositories.\n\nhttps://twitter.com/vinodsparrow/status/1365547782782689281\n\nFrom there, someone or some groups, managed to get access and added a small change (presumably to validate the change goes to prod) in October 2019.\n\nPresumably once that change (a dummy function) went to prod it appears the threat actor then made a more significant contribution which resulted in the mass compromises - Feb 2020.\n\nhttps://www.techtarget.com/whatis/feature/SolarWinds-hack-explained-Everything-you-need-to-know\n\nThose two modifications have SHA values which are detected by vuln scanners. Even though the October 2019 edit didn't introduce anything malicious, it still gets flagged as malicious - this is why two versions have been flagged as affected.\n\nHope that helps somewhat... root cause, though, always comes down to an organisational process failure.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "An intern was granted over permissions to their update server and used the password solarwinds123 to that account.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "[deleted]",
        "points": "3 points",
        "children": [
          {
            "comment": "This doesn't really answer the question, but thank you anyways! I am aware that this was a supply chain attack, but something like that does not just 'happen'.\n\nClearly the hackers accessed the Orion build servers in order to insert the code, but how did they get that initial access? Did they phish credentials? Was SolarWinds not using MFA on their build servers? Why were the build servers not sufficiently protected? Did SolarWinds not have proper network security, or did they have a lot of accounts with privilege creep?\n\nI am looking for the initial attack vectors that the hackers used to insert code into Orion, and so far I have not found much.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "OP is asking how they compromised SolarWinds. It's much more important than the victim organizations and how they moved through and attacked those networks. If people can't trust proprietary software that is signed and validated from major vendors, everyone is screwed.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bgdgth",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bgdgth/new_quasarrat_campaign_by_lazyscripter/",
    "title": "New #QuasarRAT campaign by #LazyScripter!",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bghhre",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bghhre/communicating_security_to_cfoceos/",
    "title": "Communicating security to CFO/CEOs",
    "points": null,
    "comments": [
      {
        "comment": "I also noticed that they use a lot of common place analogies when explaining these.\n\nThere's a reason why they require colorful reports with graphics.",
        "points": "45 points",
        "children": [
          {
            "comment": "\"Children love stories\"",
            "points": "29 points",
            "children": [
              {
                "comment": "Best comment.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Also why the CxO/Board level version of a PenTest Report is normally only one page long.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Big pictures. Small words.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I spend most of my time talking to boards and their committees.\n\nCISOs in my business report into me but I am effectively a CISO in all but title.\n\nI skimmed the article and TBH I’m not completely aligned.\n\nI would be pretty annoyed if someone labelled me, my team, my peers as soothsayers.\n\nSecurity is an operational risk, like many others. It benefits from being integrated into enterprise risk frameworks and having documented, repeatable and transparent process for identifying and assessing risk in the context of the framework.\n\nUnlike other areas of operational risk, such as finance, boards tend to have less experience of InfoSec. They do (usually) have good understanding of risk management principles. As with many of the other teams we interact with, we have to speak their language and make it easy for them to make decisions. Quantifying risk from a financial perspective, and articulating in terms of risk appetite etc. is the most successful way of approaching it, in my experience.",
        "points": "24 points",
        "children": [
          {
            "comment": "You work for an sector that has established risk framework. Most of the ppl here don't.",
            "points": "9 points",
            "children": [
              {
                "comment": "Then work out common language. Boards and C level still operate on financials and risk, so it's still the same approach. The only way to get sustained support and funding will be to represent the technical/operational risk in terms they're familiar with.  Build a risk based approach that aligns to their priorities, or that could impact their priorities.",
                "points": "7 points",
                "children": [
                  {
                    "comment": "Okay sure buddy. Lol",
                    "points": "-4 points",
                    "children": [
                      {
                        "comment": "Responder is correct. If you aren’t willing to do that or aren’t empowered to make that type of change then either you aren’t a CISO or the role is CISO in title rather than responsibility.",
                        "points": "4 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I do currently, but that’s not always been the case. It is a tool of our trade, if it’s missing then I’ll work with who I need to create one.\n\nBoards understand risk, albeit in different terms than we use. A board that doesn’t understand risk is unlikely to be needing a CISO IMO, they have bigger problems",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "This is correct. It is very frustrating to see the technical teams put down their executives because they aren't technical experts. They hire technical experts.\n\nI have been in meetings where a board needs to understand geopolitical risks, financial market risk, regulatory risk on top of the regular competitive risks. They shouldn't be expected to understand how ransomware works. A CISO needs to articulate cybersecurity risks in a vocabulary and context that can be compared with the other risks they need to address.",
            "points": "2 points",
            "children": [
              {
                "comment": "There are executives that understand what you’ve outlined (edit: all risks fluidly, not technical aspects) and executives that don’t.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "There's a reason why a lot of technically-minded people don't make great executives. To convince the higher-up staff, you have to use their language: dollars and risk. They don't care about Lockbit, they care about how much money they lose when Lockbits messes their stuff up, and the hit to their reputation.\n\nPeople hate building KPIs and measuring performance, but this is what it's for. Translating your work into $$$ so that the CFO who doesn't understand why it takes more than 1 person to monitor alerts for a Fortune 50 company can see the effect you have when Lockbit hits every other org but yours.",
        "points": "16 points",
        "children": [
          {
            "comment": "Exactly. The number of times I’ve seen a technical wizard try to explain tech to senior management. They don’t CARE, and they don’t UNDERSTAND, and if you try to explain it to them, they will just get angry if they don’t get it because they will feel dumb, and they are not.\n\nUse their language. What is the effect on the business, not the technology that it uses. “We’ve been hit by ransomware. This has meant our email is down and we cannot process new orders. We can restore from backups but the services will be down for at least 3 more days.”",
            "points": "3 points",
            "children": [
              {
                "comment": "Agreed, but so many people cannot even comprehend the idea that you need to speak a different language to a different audience, and are physically unable to do it it seems.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The method I have found the most useful is showing examples of other companies and how much it cost them. If you want to get your building to install sprinkles, burn down the neighbor",
        "points": "1 point",
        "children": [
          {
            "comment": "Excellent point! I missed this when posting... Gartner, ISF etc have tools which you can use benchmark against peers.. i think they also offer estimated budget spend on security for each industry",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I was having this conversation at a round table with infosec leaders and besically said this. Woogy boogy doesn't work. Quantify the risk. You need to do that while evaluating the cost of controls or compensating controls anyways. Speak their language. Your leadership skills are directly correlated with how well you can float between the technical and the business sides of the house and direct a clear vision.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Thanks for sharing 👍🏽",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "honestly our board pushes them more than I can - they tend to be in the risk mngt business and have a broader perspective",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think most of the responses here hit the right points.\n\nI'll just add this: align security expenditures and budget requests to the business goals.\n\nPutting a dollar value on preventing bad things is very difficult. It resonates more to say \"here's how we'll enable you make money while reducing risk.\"",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bggr81",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bggr81/dfir_career_tips/",
    "title": "Dfir career tips.",
    "points": null,
    "comments": [
      {
        "comment": "I'd check FRA tbh, they're hiring and it doesn't require going abroad.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bgg7dk",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://www.consumerreports.org/home-garden/home-security-cameras/video-doorbells-sold-by-major-retailers-have-security-flaws-a2579288796/",
    "title": "These Video Doorbells Have Terrible Security. Amazon Sells Them Anyway.",
    "points": null,
    "comments": [
      {
        "comment": "Amazon will sell your dead grandma’s ashes if you listed it.",
        "points": "159 points",
        "children": [
          {
            "comment": "At least Gran's ashes have more TCP/UDP Ports blocked than Amazon Products",
            "points": "35 points",
            "children": [
              {
                "comment": "Grandma's smart-ashes 2.0 now with ssh, rdp, ftp, DNS, and of course a print spooler.",
                "points": "10 points",
                "children": [
                  {
                    "comment": "Plot twist: Print spooler is a Trojan",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Grandma ashes are air-gapped, you’re good.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Breaking: Giant retail company sells product that isnt theirs to make profits despite product being poor quality",
        "points": "224 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Because it's Amazon, not AmazonSecurity.\n\nAmazon just sells products and they don't really do any formal evaluation. So expecting them not to carry products that might have security flaws is like expecting the thrift store to sell brand new BMWs\n\nThere will always be people who don't use their brain when shopping. Our job is to spread reviews that explain these concepts",
        "points": "88 points",
        "children": [
          {
            "comment": "Did you read the article? It explains why they need to care.",
            "points": "-76 points",
            "children": [
              {
                "comment": "Oh I understand and security is incredibly important. I'm just pointing out that Amazon honestly doesn't have the time for that and they wouldn't do it anyway. It's up to us to educate the masses",
                "points": "9 points",
                "children": [
                  {
                    "comment": "OP clearly hasn’t ever done a security assessment of hardware and/or doesn’t realize how many hundreds of thousands of different products they sell which have security requirements.\n\nIt’s particularly noteworthy that Consumer Reports has only tested a handful of devices in a specific category; they haven’t even taken a representative sample of IoT devices that have cameras and/or microphones which are sold by Amazon. There’s a reason for that…nobody could do it without massive amounts of funding.",
                    "points": "11 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Did you read the article? Someone’s opinion in an article isn’t going to make Amazon care? Is selling a product without evaluation making them money? Yes? Then it’s a done deal. They don’t care otherwise regardless of whether they should or should not.",
                "points": "37 points",
                "children": [
                  {
                    "comment": "https://docs.fcc.gov/public/attachments/DOC-401038A2.pdf k",
                    "points": "-44 points",
                    "children": [
                      {
                        "comment": "You keep posting that like it means something. It’s a letter asking questions. Where do you see “Amazon will be fined”? It’s theater and neither side will do anything.",
                        "points": "23 points",
                        "children": [
                          {
                            "comment": "Agree to disagree.",
                            "points": "-48 points",
                            "children": [
                              {
                                "comment": "You're way off bud. Unless its an actual law its merely a suggestion...",
                                "points": "11 points",
                                "children": [
                                  {
                                    "comment": "That's the thing, it IS a law!",
                                    "points": "-7 points",
                                    "children": [
                                      {
                                        "comment": "Except its not, there IS a law, you're just trying to apply it where it doesn't. Your issue is you're unwilling to admit when you're wrong and learn from it. I have no idea who you are. Don't be embarrassed. Just take the L and try to figure out where you went wrong.",
                                        "points": "8 points",
                                        "children": [
                                          {
                                            "comment": "The FCC references the law in their letter to amazon i linked elsewhere. I’m not sure why you’re so resistant to reading it.",
                                            "points": "-7 points",
                                            "children": [
                                              {
                                                "comment": "",
                                                "points": "",
                                                "children": [],
                                                "isDeleted": false
                                              }
                                            ],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              },
                              {
                                "comment": "That the government saying we believe video door bell security is bad and we sent an inquiry for further questioning in hope that you respond. There no fines. That document prob went into Jeff trash can as he not going to care until it has enforceable legislation.",
                                "points": "4 points",
                                "children": [
                                  {
                                    "comment": "I do agree that cybersecurity needs help at every level. From Consumer to the developer to the company to the government. Cybersecurity is a forever world war.",
                                    "points": "1 point",
                                    "children": [],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "FCC previously fined Ring (Amazon) over $5 million.",
                                    "points": "0 points",
                                    "children": [
                                      {
                                        "comment": "They fined a company owned by Amazon. Not the same. Amazon just sells these not makes them.\n\nRing was for sale in Targets and Best Buy’s, did they get fined too?",
                                        "points": "0 points",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "There is enforceable legislation. Section 302(b) of the Communications Act",
                                    "points": "-6 points",
                                    "children": [
                                      {
                                        "comment": "Section 302(b) of the Communications Act\n\nOh no.... You sound like a rookie cop with ego trying to bend a rule to suit their argument...",
                                        "points": "2 points",
                                        "children": [
                                          {
                                            "comment": "It's from the article lol",
                                            "points": "-2 points",
                                            "children": [
                                              {
                                                "comment": "",
                                                "points": "",
                                                "children": [],
                                                "isDeleted": false
                                              }
                                            ],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "BEST BUY SELLS DEVICES THAT HAVE TERRIBLE SECURITY. WALMART SELLS DEVICES THAT HAVE HORRIBLE SECURITY. yada. yada. What’s the point besides a few post karma?\n\nEdit: Looking at the little engine that could… OP didn’t go down without a fight lol. Found themselves in a hole, we offered a ladder and they instead grab a shovel.",
        "points": "39 points",
        "children": [
          {
            "comment": "This was literally in the article as\n\n\"Thousands of these video doorbells are sold each month on Amazon and other online marketplaces, including Walmart, Sears, and the globally popular marketplaces Shein and Temu. Experts say they’re just a drop in the flood of cheap, insecure electronics from Chinese manufacturers being sold in the U.S.\"\n\nHowever, the writer of this article says is \"Amazon bad\".\n\nAside from the China spyware junk stuff, people should be putting all of their smart devices on a VLAN/ guest network.",
            "points": "11 points",
            "children": [
              {
                "comment": "Wait Sears still exists?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "FCC violations. In this article caused the FCC to reach out to those companies.",
            "points": "-5 points",
            "children": [
              {
                "comment": "So ban their sale… and there’s no way a Chinese brand will rebrand them under yet another name. How in the F is this an amazon, walmart, or any retailer problem? Are you saying you endorse inquisition and punitive measures for any retail company selling a product with vulns? Let’s point the fcc towards cisco, ibm, oracle, microsoft, etc. This is just a silly story.",
                "points": "9 points",
                "children": [
                  {
                    "comment": "It is their problem because:\n\n\"Section 302(b) of the Communications Act provides that “[n]o person shall manufacture, import, sell, offer for sale, or ship devices or home electronic equipment and systems, or use devices, which fail to comply with regulations promulgated pursuant to this section.”\n\nhttps://docs.fcc.gov/public/attachments/DOC-401038A2.pdf",
                    "points": "-2 points",
                    "children": [
                      {
                        "comment": "Yeah, that doesn't mean what you think it does. Otherwise fedex would be liable for the Chinese shit I buy that doesn't have an FCC ID, or any company that is part of a logistics network.\n\nWhat you need to do is find out if third-party marketplaces are responsible for for those as well.",
                        "points": "11 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why should Amazon care? They just want to make money? Most people buy Alexas and imo that poses a huge security risk.",
        "points": "34 points",
        "children": [
          {
            "comment": "https://docs.fcc.gov/public/attachments/DOC-401038A2.pdf",
            "points": "-12 points",
            "children": [
              {
                "comment": "lol ur acting like a few fines is going to deter Amazon/Amzn Marketplace Sellers to continue to sell. They’ll put the minimal amount of controls in place to satisfy regulations and then wait till another notice comes in if anything\n\nThis doc you attached mentions nothing about fines either",
                "points": "13 points",
                "children": [
                  {
                    "comment": "https://www.fcc.gov/document/fcc-issues-record-225-million-fine-spoofed-robocalls FCC determines the fine amount after, depending on a bunch of factors. I don't think they'll get a $225 million fine, but it is certainly in Amazon's best interest to do the minimum, like you said.",
                    "points": "-5 points",
                    "children": [
                      {
                        "comment": "Still a slap on the wrist to a company like Amazon\n\nAnd that’s if the gov has the balls to go after them. Most of the time the gov goes head over heels for the MAANG companies",
                        "points": "7 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Fines",
            "points": "-20 points",
            "children": [
              {
                "comment": "At what level .01%…. They just make it back in a couple hours of online sales. A fine only works if it hurts. US Government does not do a good job there.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Help me understand how this is Amazon's problem",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why is it Amazons responsibility to perform risk assessments on every product they sell? At what point did we decide to ditch buyer beware?\n\nThe FCC doesn't have a lot of control over the cybersecurity of the devices.\n\nThe article is really about the products not having the FCC ID on the packaging. The manufacturer is says they are putting it on them.\n\nEither way, the manufacturer and the third party resale are responsible for checking to make sure the fcc ID is listed.\n\nI can't find any case law that says Amazons or Walmart has responsibility for it.",
        "points": "6 points",
        "children": [
          {
            "comment": "They don't need to perform a risk assessment, they DO need to make sure they have a:\n\nvisible ID issued by the Federal Communications Commission (FCC) that’s required by the agency’s regulations, making them illegal to distribute in the U.S.",
            "points": "-1 points",
            "children": [
              {
                "comment": "The retailer and the manufacturer are required to do so. The article said that these are being sold by 3rd parties. Not even the fcc is saying Amazon is responsible. The only person saying they are is the consumer reports writer.",
                "points": "8 points",
                "children": [
                  {
                    "comment": "https://docs.fcc.gov/public/attachments/DOC-401038A2.pdf k",
                    "points": "-5 points",
                    "children": [
                      {
                        "comment": "oooh a letter asking questions. CLEARLY THIS IS A REGULATION.",
                        "points": "6 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The \"S\" in \"IOT\" stands for Security",
        "points": "8 points",
        "children": [
          {
            "comment": "Wait, there's no... ooooh!",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Not their problem to ensure security of products….\n\nPut all IOT on a VLAN and you’ll be alright.",
        "points": "11 points",
        "children": [
          {
            "comment": "according to FCC it is their problem",
            "points": "-3 points",
            "children": [
              {
                "comment": "Sorry, which FCC ruling exactly?",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Section 302(b) of the Communications Act from the article",
                    "points": "-2 points",
                    "children": [
                      {
                        "comment": "Um, no…. That applies to the vendor that makes it. As for a seller, almost every product out there has vulnerabilities. Do they pull those to?\n\nIf they ban the product and Amazon continues to sell it, then you have an argument.",
                        "points": "7 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If I want to buy products with shitty security Amazon shouldn't stop me. I might be repurposing the technology, I could be using IoT devices in an environment where I implemented compensatory controls to mitigate their security risk. I might be using them for testing and research. Or maybe I'm being an idiot using them in a way that exposes my data. Either way it's not up to Amazon to tell the consumer they can't do that. They are not a regulating body and saying it is Amazon's responsibility to attest to the security of their technology products is absurd and anti-consumer.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’ve stayed away from pretty much all iot/edge/ connected home things due to data security/ privacy concerns. What is considered the most secure connected home camera when it comes to encryption/policy etc?",
        "points": "2 points",
        "children": [
          {
            "comment": "It says so in the article, but Amazon’s ring is pretty good",
            "points": "-7 points",
            "children": [
              {
                "comment": "Didn’t the fcc come out and say privacy with ring is terrible. Look where we are now.\n\nhttps://www.ftc.gov/news-events/news/press-releases/2023/05/ftc-says-ring-employees-illegally-surveilled-customers-failed-stop-hackers-taking-control-users",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Correct, in 2017-2019. They've done a lot to improve because the FCC is on their shit about it.",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Amazon also sells crappy pad locks in case you need more evidence for the lawsuit you're putting together... Or whatever the point of this post is.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What would you guys say is a good doorbell camera company?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "OP has a fundamental misunderstanding on these things based on comments. Even if Amazon should care (and yes, they should), guess what? Every major Top 10 company bullshit is doing literal crimes against humanity as we speak.\n\nAaand guess what? The government and and the governments policies and the law and law enforcers and judges and anyone that could potentially be affected... Do. Not. Give. A. Fuck.\n\nYou're right. But nothing will happen. Just better your own knowledge to avoid these items for purchase.",
        "points": "2 points",
        "children": [
          {
            "comment": "ok https://docs.fcc.gov/public/attachments/DOC-401038A2.pdf",
            "points": "-2 points",
            "children": [
              {
                "comment": "You're missing the point. Even IF this goes to any extent that could cause Amazon to act, max, it would get this very specific item off their sales page, and they would get a slap on the wrist.\n\nAaand the entire rest of the site and the company would continue as if nothing happened and the world would forget overnight.\n\nHell, a item being sold on Amazon that needs to be taken down is at best a tech support ticket or similar to raise awareness. It's not nearly as crazy or XYZ as you think.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Amazon cares about money not customer security",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What are some best practices for these things? Everyone keeps saying put everything on a guest network but why? ANd what other tips?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Bro look up how much Amazon makes a minute…. You think they care about a fine?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "this is a post for r/privacy, not here.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Is it me or is amazons selection getting worse?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's not Amazon's job to vet the security of digital devices sold on their marketplace. Just like any B&M.",
        "points": "0 points",
        "children": [
          {
            "comment": "They don’t need to vet their security. They need to make sure they have a FCC identification.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "lol attempted amazon hit piece?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why should Amazon care about this? there are probably plenty of insecure devices sold on Amazon... if it makes them money...",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The organizers of a farmers market should be liable if somebody bought bad eggs at one if the stands?",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bgdabj",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bgdabj/properly_separate_your_securitybmsiot_staff_pcs/",
    "title": "Properly separate your Security/BMS/IoT Staff PC's, Guest PC's?",
    "points": null,
    "comments": [
      {
        "comment": "Who have access to these guest PC and why are they even on the domain? What's the use case for the guest PC?",
        "points": "0 points",
        "children": [
          {
            "comment": "They're usually guest from other companies that stop by and some of our community lab's that we setup that we invite other orgs to come to do some classes.\n\nwe were thinking of building a completely separate AD, DNS for them but that seems a bit crazy to manage two sets. So I was trying to find other ways to do this. currently looking into intune joined instead.\n\nwhats your recommendation regarding staff pc's for security staff that sits on 2 vlans (staff,security).",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Manage them with intune and logical or physical segregation from the the rest of the network.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is the whole use case for Nac solutions.\n\nThis more in depth here to write out but in a gest solutions such as Cisco ise or Aruba clearpass are what I'd look into to solving this. \n\nI use both products and have used them since their inceptions\n\nI'm more inclined to recommend Cisco ise vs Aruba clearpass overall but both products need to be backed my management and have dedicated support team that isn't one person who learns and understands the concepts of these. \n\nThere's some great design guides and ciscolive videos. \n\nAruba has some good design guides. \n\nI'd recommend you look into those to solve your needs.",
        "points": "0 points",
        "children": [
          {
            "comment": "thanks! our networking team is leaning towards more of CISCO ISE.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  }
]