[
  {
    "id": "t3_1bct0d9",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://www.claimdepot.com/data-breach/roku",
    "title": "Roku Data Breach: Over 15,000 Accounts Affected",
    "points": null,
    "comments": [
      {
        "comment": "So, all of the accounts.",
        "points": "0 points",
        "children": [
          {
            "comment": "most of them",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bcrpcf",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://www.mobile-hacker.com/2024/03/11/analyze-installed-android-applications-for-security-risks-in-termux/",
    "title": "How to analyze installed or downloaded Android app for security risks directly on device",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bc4o2b",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bc4o2b/red_team_gear_for_cv_projects/",
    "title": "Red Team gear for CV projects",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bc28ef",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bc28ef/burnout/",
    "title": "Burnout",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bcfvnu",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bcfvnu/genuine_feedback/",
    "title": "Genuine feedback",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bcorny",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bcorny/is_maninthemiddle_white_box_and_black_box_testing/",
    "title": "Is Man-in-the-Middle, white box, and black box testing *actually* being changed? If so, is it really just for \"political correctness,\" or is there more to it?",
    "points": null,
    "comments": [
      {
        "comment": "CAPEC now calls ot Adversary in the Middle. Whitelist is Allowlist and Blacklist is Denylist. This is a very US thing, though.",
        "points": "23 points",
        "children": [
          {
            "comment": "Adversary in the Middle makes SO much more sense than On-Path. Whitelist and blacklist are also being changed though? That's crazy. Is there really any other purpose behind it? Especially seeing you say it's a very US thing",
            "points": "2 points",
            "children": [
              {
                "comment": "I dont care, it will always be man in the middle for me, because its \"the man\" that is normally in the middle and on purpose (Think SSL-I/D), and it fits still. But I guess it could be AI in the middle now?\n\nBlack/White to block/allow or deny/allow is about being not racist by today's PC. If you think about that one, it makes sense. Why is Black preventative and white is permissive? when Black is the absence of color where white is all color? IMHO, This has always had a racist nature to it.",
                "points": "-2 points",
                "children": [
                  {
                    "comment": "“Always been racist”, it might be worth checking that, the etymology. Historically “black x” has meant the X is forbidden. Ref blackmarket, blackmail, blackmagic.\n\nThe same doesn’t go for “black man”; there’s no implied illegitimacy there, just a description of skin color.\n\nThe intention to remove such uses of the word black, based on an assumption it associates people with black skin to such forbidden or undesirable objects, is an invention of the identity politics mob, because for them everything is about identity politics, when in reality it’s not.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "\"Machine in the middle\" is what I tend to use, as it's more precise and keeps the MITM acronym so it's highly recognizable. I haven't heard On-Path, but eh, it's reasonably clear from context clues. I doubt professionals would have trouble with black-box/white-box vs closed-box/open-box or similar.\n\nFor context, I also teach, and I would differ from your professor in that I'm not going to tell you that a specific term is \"phased out\" because that's not how language works. Language is a tool for communication, there is no standardization body for \"how people communicate,\" and language around the world is constantly evolving. Case in point, I have no idea what a \"rizzler\" or \"gyatt\" (sp?) is and I don't really care to find out, but both are likely new terms for existing concepts that are preferred by a specific social group.\n\nAs long as we're both understanding each other & comfortable within our dialogue, then we're cool. If your professor is requesting to use specific terminology, then you should likely use it in your class to ensure clear communication between yourself, professor, and other students - but don't be surprised if you hear other terms around whether \"phased out\" or new phrases or what-have-you.\n\nPersonally, I use non-gendered/non-colored terms by default when I teach, but I describe what people might recognize - ex. my slides are titled \"machine in the middle\" but I'll include other recognized terms like \"man in the middle\" or \"packet sniffing\" to ensure anyone who's heard other terms ties their existing knowledge to the course material. It takes no effort on my end, and I've yet to hear any complaints or notice any drop in exam scores, so it seems like everyone's communicating just fine.",
        "points": "13 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "How long did it take for developers to get over the master branch in git being renamed to main? That was a riot for like, a week.\n\nIs it over the top? Yes. Will anyone get hurt by this? No. Will it make more sense to future generations than it does to us old timers as we yell at the kids to get off our lawn? Maybe.",
        "points": "17 points",
        "children": [
          {
            "comment": "I cant wait until it hits firewall ordering \"Top\" vs \"Bottom\" :) (lmao)",
            "points": "1 point",
            "children": [
              {
                "comment": "Why is that even a choice? Top is the only correct answer.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "Sounds like someone isn't brave enough to try new things lol",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "lol exactly!",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I honestly didn't even realize the master branch was also renamed, cause so many places still call it that or name their stuff based on that, to where it wasn't obvious to me. Then again, though, I'm also a college student, so I don't come across it as much as an active security professional currently.\n\nUgh maybe it will, it's just very frustrating and I don't understand why we can't fight back on this. Is it really going to not affect anyone if all these longer-term security professionals now have to not only relearn things with everyone else as new technologies develop, but also completely change their existing terminology for this to be able to understand what's on their certification exams? That really seems like a bit much...",
            "points": "-8 points",
            "children": [
              {
                "comment": "We can and do fight back. It looks to me like you are fighting back right now. But does it honestly matter? These terms are offensive to a very small portion of people, but renaming them doesn't really hurt anyone either. So why not err on the side of inclusivity rather than \"that is the way it has always been done\".\n\nTo better understand this you should seek out someone that is negatively impacted by the current phrasing and hear out their opinions on it. And you know the security exam people are going to love these changes, because that means they can release new books and new versions of the tests with the new terms to get even more money out of the industry. Everything always changes, all of the time. The reason why changes every once in a while, but everything will change.\n\nAs for me, I'm a software engineer, so I'm about to get paid to rename all these things in systems or replace systems that can't be updated. Same thing happened in Y2K and even when same sex marriage became legal across the US. That caused a nightmare for people using inflexible software where the forms literally won't let you state two people as married if they are the same sex.",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "They’re also changing master bedroom to primary bedroom.\n\nLanguage has evolved since the invention of language. We have somehow still managed to survive. As long as we replace the terms with something self explanatory, there should be no issue. That should just be something we strive for. Like naming your variables in code. Give it something actually meaningful and self explanatory and you save everyone a headache. x or var1 is bad and tells me nothing. Just like white list and black list or master doesn’t really tell me anything except to reinforce an unconscious bias that white is positive and black is negative. Or worse, refer to the awful practice of slavery.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It’s really not that big of a deal. Whatever the next batch of words will become industry standard and then that’ll just be the default. Long as the replacements make sense it’s fine really. Only reason we might be hesitant is because its been the default for a while. And we, if anyone, should not suffer from “well its always been this way” mentality that plagues every industry from making good changes.\n\nTheres lots of good changes like whitelist/blacklist being replaced with allowlist/blocklist which for me just makes more sense anyway. I remember being puzzled over what a whitelist was when I first ever messed with a games server like 13 years ago but if it had been called an allowlist I would have gotten it.\n\nThings change fast these days anyway. Might as well get comfortable being flexible.",
        "points": "6 points",
        "children": [
          {
            "comment": "If it’s really not that big of a deal, then why are they being changed.",
            "points": "2 points",
            "children": [
              {
                "comment": "Because that’s how language is. We don’t speak the same language as others did 1000 years ago. We don’t use the same terms or slang even used 20 years ago. Language is a living thing that evolves.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Are we thishelpless as current professionals in the field or upcoming security professionals that we can't stand up for these basic terms\n\nWhy do you feel these terms need protecting? They are not special important things, they are terms which are subject to change. I feel no need to “protect” terms used in professional parlance, per sé.\n\nAllow and block list makes it pretty clear what we’re talking about, no need for white/black.",
        "points": "6 points",
        "children": [
          {
            "comment": "Yeah, the only rebuttal is that these are industry standard terms that have meaning. So you do have to educate some people on what the fuck your talking about, which is a waste of time.. but I guess not that big a deal.",
            "points": "0 points",
            "children": [
              {
                "comment": "Not if you actually rename them to something that is self explanatory unlike white/black. Allow listing and deny or block listing are much better terms. Man in the middle could be renamed something else without losing the self explanatory part. But the example given above is not it. Adversary in the middle would be better than “on path”.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "It doesn’t matter if it makes sense. Regardless it still requires rerouting standard terms. It’s fine, but it’s still kinda dumb.\n\nAlso, why would we need to rename man-in-the-middle? What is the problem with a gendered term?",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Whitelist and blacklist are as intuitive and self explanatory as allowlist and denylist if you grasp the cultural context of words “white” and “black”.\n\nBlack represents bad things like a black god “czarnybóg”, Satan being portrayed as black, darkness and stuff.\n\nWhite represents the opposite, like sanctity, divinity, pureness, innocence…\n\nIt doesn’t have anything to do with racism in the US, those terms come from natural dread of the night that comes to every kind of humans.\n\nBeing ignorant of the most common themes in cultures all over the world is not progressive, and replacing them “because racism” is a sign of massive ignorance.\n\nFinally they sounds better, less mouthful than “allowlist” and “denylist”.\n\nMan in English language refers to any human. Statements like “all man are born free” don’t imply no gender. Same with words such as “mankind”. Unless you would like to change it to “mankind, womankind and childrenkind too” those changes are just some peoples’ silliness and I think they should not be respected.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don’t really care, do you?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I never heard about MITM being called On Path, but if they are doing this it's indeed because of political correctness. Same with whitelist - blacklist being renamed to allowlist - blocklist.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AitM is fine, at first I wasn’t sure why we needed a new one, but we got female adversaries, too, probably, so that works. It explains the concept more concisely. Black/whitebox become what?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’ve been in the field 3 years and this is the first i’m hearing about any of this",
        "points": "0 points",
        "children": [
          {
            "comment": "Welcome to the culture wars bullshit which the majority of normal people wish they weren’t a part of lol",
            "points": "-2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bcnv2u",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bcnv2u/are_you_cloud_security_material/",
    "title": "Are you Cloud Security material?",
    "points": null,
    "comments": [
      {
        "comment": "Good group, highly recommend joining",
        "points": "10 points",
        "children": [
          {
            "comment": "Thank you!",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Please, God, take me back to on-prem.",
        "points": "4 points",
        "children": [
          {
            "comment": "Honestly. I work cloud security right now and don't enjoy it.",
            "points": "1 point",
            "children": [
              {
                "comment": "what dont you enjoy about it? do you miss the social aspect of seeing your coworkers?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I think people take the word \"Cloud\" too seriously as its own thing. On-prem security skills will always translate to the cloud. The mindset of securing a machine/server/an entire infrastructure doesn't change whether it's cloud or not. Cloud is just another word for \"your data on someone else's machine\". You could have differences in tools on how to manage different security baselines. Authentication, Auditing, Vulnerability Management, Security testing itself, those all still follow the same principles from before, just using different tools. Once people get over the buzzword factor, they should quickly find themselves understanding Cloud easily.",
        "points": "4 points",
        "children": [
          {
            "comment": "I agree there are transferable skills, but cloud security has plenty of new concepts too. Eg hardening/auditing/testing PaaS services are pretty different skillsets to servers\n\nOr maybe I'm just burnt out from one too many misguided Nessus reports...",
            "points": "1 point",
            "children": [
              {
                "comment": "\"Eg hardening/auditing/testing PaaS services are pretty different skillsets to servers\" how would you differentiate them here then?\n\nPaaS services on paper transfers some of the security risks and baseline requirements from your side to the vendor's side. You may not need to conduct your own security checks and risk acceptance for the servers being used on PaaS but anything above it is still deployed and managed in the traditional sense. How would you manage the portion of the security risk that falls under you? The same security principles or something vastly revolutionary than what you considered before?",
                "points": "0 points",
                "children": [
                  {
                    "comment": "it is still deployed and managed in the traditional sense\n\nyeah when this is true, I find the usual shared responsibility model applies. like hosted Postgres etc, it's still Postgres but with shifted responsibilties.\n\nthese models break down for more abstract services like functions/lambdas or distributed datastores though, that didn't really exist in non-hyperscale deployments. imo they come with very different threat models (eg Azure's JWT signing certs) that are rarely evaluated. I saw an interesting example this morning: AWS S3 Denial of Wallet amplification attack",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I’m with you. Understand the fundamentals and you’re probably good. Only some additional terms and acronyms to pick up",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This is a very reductive take and it's clear you don't understand very basic and fundamental technologies behind cloud infrastructure providers like abstraction from bare metal and sharding.\n\nIt's not just \"different tools\"\n\nFor anyone reading, that's a bad take",
            "points": "0 points",
            "children": [
              {
                "comment": "Please go ahead and explain what abstraction from bare metal and sharding mean for people that read your comment and have no idea what they mean. Maybe you'll enlighten yourself in the process and apologize for being overly aggressive and ignorant.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "namedropping concepts isn't a counterargument... and neither hardware abstraction nor sharding are cloud-specific concepts",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "How long do these typically run for?",
        "points": "0 points",
        "children": [
          {
            "comment": "It's scheduled for 1 hour, but sometimes we have people on for almost 2 hours.\n\nWe also have a Telegram channel, Mastodon instance, and a web site. Plus some funded resources for the community to use. We are fiercely non-competitive, meaning that this community is built with leaders from commercial competitors but we put all of that aside for this, every week.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Look, nobody STARTS in cloud security\n\n99% of new grad security engineers in tech start in cloud security, because, well, it's all cloud.\n\nJust because you didn't doesn't mean others can't.\n\nDo you think Cloud Security is unapproachable?\n\nIt's not, it's the bare minimum standard to be considered a competent security engineer today.",
        "points": "-1 points",
        "children": [
          {
            "comment": "Thank you. I would add also that \"cloud security\" it's ineherently less complex that on prem security, since it lacks the phisical layer of the problem.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bclo4k",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bclo4k/how_does_ai_impact_cybersecurity_today_and_in_the/",
    "title": "How does AI impact cybersecurity today and in the future?",
    "points": null,
    "comments": [
      {
        "comment": "Automated attacking and defending. Probably soon you’ll need AI tools on defense as humans would react too slowly.\n\nPatching windows will shrink even more.",
        "points": "12 points",
        "children": [
          {
            "comment": "They already exist but people are far too focused on EDR being the second coming to understand it's not going to save them.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "AI is both a tool and a threat, but not in the way most companies leverage it. I see so many companies saying \"we use AI to keep you safe\" but it's the same crap from 12 years ago that didn't keep anyone safe then and sure as hell does not keep them safe now.\n\nSome companies have started to use more advanced forms of AI in hopes to stave off the AI vs AI battlefield which I see CISOs saying \"it's coming!\" when in reality, it's already here but they are so removed from the day to day of the threat landscape they are basically clueless.\n\nMany think AI is going to replace everyone, in fact it's going to create opportunities as someone needs to validate the automation isn't being fed incorrect data and thus piping out hot garbage that people think is gospel.\n\nMy past 8 years or so working with the most advanced forms of endpoints security leveraging true next-gen AI (not machine learning) has shown me there is definitely hope but far too many are fearful of adopting or just plain cannot understand it and therefore steer away from it.\n\n​\n\nTL;DR\n\nAI is both good and bad and will require humans to validate what the AI is being \"fed\" during it's training. The AI vs AI war is thoroughly fun to be a part of though and it's the best part of my day throwing AI generated variants against programs to see how they handle these threats!",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I can have it create a very effective and damaging worm and not write a single line of code.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's actually surprisingly bad at cybersecurity so far.\n\nThe literature shows a less than human ability to identify and explain secure code failures in particular, and penetration testing efforts have been less than impressive in arbitrary environment. Sorry, I don't have the reference, but there are some out there to be found.\n\nMy take is, legal side will be replaced most quickly, some areas of lower level RM, and eventually SecOps - starting with Prevention - self-optimising NFW, WAF, traffic inspection, informing and automatically updating, or scheduling updates, for solo human operators to prod.\n\nThen Detection after, of outliers, anomolies, SIEM initial triage, etc. Feeding into the same cycle. Finally Response - taking outlier and live data to perform Identification, Containment steps, and with generalised AI it could go much further.\n\nSo, if you want to be \"AI safe\" in your career, focus on those aspects which it is not showing much of a talent for, and ensure you can talk about ML such that you get put into the \"can help us make ML work for us\" category and not the \"Can be replaced by ML\" category at work.\n\nIts going to be good at DF (but not excellent, further pushing DF toward an expert only market), bad at GRC beyond scoping and gap analysis perhaps. Other areas, remains to be well tested.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's going to replace people YOLOing AMC and other meme stocks.\n\nBut that's just an opinion. 👌",
        "points": "1 point",
        "children": [
          {
            "comment": "I made a lot of money on $GME.\n\nBought at $15; sold at $420.69.",
            "points": "-2 points",
            "children": [
              {
                "comment": "Just. Stop.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Im at the HIMSS conference this week, and this is a major topic of conversation. A couple of initial thoughts: 1) AI’s deepfake video technology is already causing problems. Google “$25 million Hong Kong CFO” for a wild new example of someone getting tricked into sending a huge wire transfer to a bad actor. 2) Quantum computing is on the way, and once we have quantum powered-AIs, things are going to get very interesting. 3). Continuing on the quantum front, quantum computing will render all of our existing encryption algorithms obsolete. New algorithms that are “post-quantum” are in review and should be approved for widespread use later this year. 4). AI offers both security threats and benefits. On the benefit front, AI will enable us to identify threats faster and automate responses to common threats, allowing us to reposition security talent to higher value activities. 5) on the same note, AI is also going to empower bad actors. So the arms race is on.",
        "points": "1 point",
        "children": [
          {
            "comment": "No, quantum computing will not render all of our existing encryption algos obsolete :)",
            "points": "1 point",
            "children": [
              {
                "comment": "Probably meant ECC, RSA, AES, DES which is pretty much all what is widely used these days. Lattice based algos are there and proven to be PQ safe, but being broken regularly as much. IMO PQ won’t happen anytime soon, even if TLS1.4 will integrate PQ safe cryptography.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Well, that's just asymmetric. We 'only' have to double the keysize in most symmetric (AES etc) and it's quantum resistant.\n\nAs for asymmetric promise, code based, multivariate polynomial, isogeny.\n\nAlso worth not forgetting that hash based is used within many systems",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "There's probably many posts discussing this question but I want to know how people in the field see AI.\n\nProbably feel the same way as the last time this was posted.",
        "points": "0 points",
        "children": [
          {
            "comment": "I am in the field and have been for a while. See above for my thoughts on it and I am regularly asked about this.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "AI is severely overhyped, it will MAYBE be useful. It is good at creating crap that doesn't need consistency, but if you ask it to repeat a thing twice, the results will be different, and that is not acceptable in any field that needs consistency like cyber security. Some things are not up for interpretation.\n\nI have yet to see an \"AI\" stop a cyber attack, all i hear are PR bullshit from vendors. The \"AI\" we have today is not the AI we are looking for.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In a sense we're using a coarse AI in endpoint protection tools and log analytics. Coarse in the sense of a smaller set of rules and probabilities.\n\nI suspect AI proper isn't going to add much in the way of additional value other than monitoring and alerting type stuff that will go to a human agent to validate and act on.\n\nFrom the offensive side, it will be a godsend for phishing campaigns.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Basically the major impact area is blue teaming, The talks on the internet suggest SOC L1 will be completely replaced",
        "points": "-4 points",
        "children": [
          {
            "comment": "IMO maybe for companies that can afford it/have the infrastructure that can easily integrate it. The problem with a lot of “AI” tools that try to take on the role of an analyst is that they can be expensive as fuck and in the majority of cases, they require someone to tune them because there are false positives. Some of the tools aren’t even really AI, vendors just use ML and AI interchangeably. Maybe it will restructure the role and responsibilities of L1s but I don’t see the role going completely extinct in the near future. AI still has some growing to do.\n\nWe also have no clue what regulations are going to be created, will AI require manual review still? What can it be trusted to do? etc…",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bclexc",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://www.cisa.gov/news-events/bulletins/sb24-071",
    "title": "Vulnerability Summary for the Week of March 4, 2024 | CISA",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bcl7wd",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bcl7wd/tenablesc_users/",
    "title": "Tenable.sc users?",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bcl30q",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bcl30q/phishing_campaign/",
    "title": "Phishing campaign",
    "points": null,
    "comments": [
      {
        "comment": "Without more info its hard to say, but if you think you are being targeted I would start going through them to see if you can identify patterns in the phishing emails, there are probably emails you are missing that have gotten through (and hopefully your users haven't clicked on anything).",
        "points": "2 points",
        "children": [
          {
            "comment": "They are mostly under our employees name asking to contact them personally on WhatsApp and then lead to scamming money if possible using gift cards another type of phishing email we get are DD once like requesting for change in salary account or something along those line. Our employees report them to us so block those Email sender and Domin is the standard thing also report them to Microsoft cloud as well..",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yep, we use Microsoft defender for which you can enable impersonation protection for some users. This results in a warning banner in outlook if an email is received with a from name that matches something in our list of names that is outside of our domain. We use this mostly for execs who tend to be spoofed the most.\n\nThis banner will appear in emails with senders like \"Mr Ceo evil@gmail.com\" where emails should be from \"Mr Ceo mrceo@mydomain.com\". Assuming you use defender you can find impersonation protection in your phishing protection policies\n\nEDIT: I've used other mail gateways that have similar policy options. If you're using something else and don't know where to find this option I recommend reaching out to support or your csr contact for the vendor",
        "points": "1 point",
        "children": [
          {
            "comment": "There may be an option in the policy for blocking these outright however I haven't looked into it. I also believe impersonation protection can only be enabled for a few hundred users",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "What is your email setup? The most effective answer is awareness, followed by awareness, but you ought to have spam filters, virus scanning in place to the extent its possible",
        "points": "-1 points",
        "children": [
          {
            "comment": "God this sub sucks. He's searching for a way to prevent these emails from coming in, which can be done and even acknowledges that security awareness is an effective method however is asking for other solutions. If OP is reading just ask r/sysadmin next time.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "There are special records in the DNS for your domain to restrict spoofing. DKIM records limit which mail servers can send mail for your domain name. The google mail help pages explain how to configure your mail server to do this. If you don’t manage your own mail server you will have to talk to your service provider.\n\nIf mail is being sent with the correct personal name but the domain names behind them are different from the company name you can set up some filters so that mail from employee names which don’t come from internal servers is placed into spam.\n\nMany email clients like to show the friendly name rather than the email address so you could configure the mail server to strip the from name and to use the hidden email address instead. Tim Smith then becomes something like qqeezz5686@freemail.spamhaven. Staff can also be trained to examine the friendly name for every incoming mail but this is time consuming so configuring the client software or the mail server can be a great time saver for staff that have busy mailboxes.\n\nSpam filters are an important part of any defence strategy. One of the most common and effective is spamhaus.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "1) Training. Ensure that your employees can recognize a phishing email and provide training on how to test links for malware, negative reports, etc.\n\n2) Malware scanners. Deploy good malware detection tools (there are numerous vendors to choose from now, and many do a heck of a job when it comes to real-time detection of threats like this.\n\n3) Email security. Make sure your admins know about DKIM, DMARC, SPF. https://www.howtogeek.com/devops/dkim-dmarc-and-spf-setting-up-email-security/#:~:text=The%20DKIM%20system%20offers%20a%20way%20to%20verify,spam%20folder%20but%20it%20could%20be%20dropped%20entirely.",
        "points": "-1 points",
        "children": [
          {
            "comment": "Maybe, but any mature large company has this\nNope, if anything a good mail gateway or change the policy on what exists to improve phishing emails getting through. User spoofing (from my experience) involves mostly attempts at getting sensitive company data or gift card scams, not some word doc with a weird macro or super_important.doc.exe.\nEmployee impersonation almost always comes from consumer email services. If not configuring dmarc for phishing domains is easy and common. This doesn't help",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'd recommend getting some Anti Phishing software, like \n\nIt is highly efficient, especially when dealing with a lot of emails.\nBesides, it is super cheap.",
        "points": "-2 points",
        "children": [
          {
            "comment": "You're the developer of this tool, yet your comment seems to suggest that you just \"tried it out\"\n\nThe reviews are obviously fake and bullshit, and I would never allow this product to touch any of my data based on the way you promote it.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bckwxu",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://k8slanparty.com/?1",
    "title": "K8s LAN Party - a Kubernetes Network Security CTF",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bckilb",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://www.nicholashairs.com/posts/musings-on-auth-how-do-we-authenticate/",
    "title": "Musing on Auth: How we Authenticate",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bcg691",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://www.france24.com/en/europe/20240311-french-state-services-hit-intense-cyberattacks-hacking-france",
    "title": "French state services hit by cyberattacks of 'unprecedented intensity'",
    "points": null,
    "comments": [
      {
        "comment": "Logic result of recent foreign policy of the french state",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bcg19u",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bcg19u/bug_bounty_payouts/",
    "title": "Bug Bounty Payouts",
    "points": null,
    "comments": [
      {
        "comment": "In the US the vast majority of government programs are unpaid, but a few pay. And I’ve been in some private programs and contests for gov orgs that paid.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bce82e",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://youtu.be/nlLXkgwzZw4?si=737Q9jGCoVmmRUqb",
    "title": "Labyrinth Deception, extending ways of response: Fortinet",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bccoou",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bccoou/companies_with_larger_security_budgets_are_more/",
    "title": "Companies with larger security budgets are more secure than those with smaller ones - YES or NO?",
    "points": null,
    "comments": [
      {
        "comment": "Maybe.",
        "points": "114 points",
        "children": [
          {
            "comment": "This is the correct answer",
            "points": "21 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Perhaps… mayhaps?",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Larger org -> more complicated environment -> more things to secure -> more budget required",
        "points": "54 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Premise is overly reductive.",
        "points": "18 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not necessarily. Usually a bigger company has a bigger attack surface, and may have a lot more bad technical debt consuming both their budget and their manpower.",
        "points": "6 points",
        "children": [
          {
            "comment": "Yeah, I’m thinking of the Twitter july 2020 hack",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Companies that know what their threat model is and consistently assess where their gaps are in addressing that threat model and then empower professionals to close those gaps in the best way possible? Then yes, larger budgets will generally lead to better security outcomes.\n\nChange any one of those qualifiers, though, and the answer is \"maybe but it's largely up to chance.\"",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "At larger places where I worked I’ve seen other teams toss money at various overlapping tooling and never operationalize them.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "NO",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No, one clik on a malicious email and your done. No amount of money fixes the user.",
        "points": "2 points",
        "children": [
          {
            "comment": "One person picking up a rogue flash drive in the parking lot and plugging in thinking \"hey, free flash drive\".\n\nIt's amazing how with all our technical advancements some of the most basic attack methods still work...",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Money CAN buy attachment detonation sandbox and a few other toys to prevent that. Not 100% effective but reduces the risk considerably.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I work in threat intelligence at enterprise level. When you're dealing with huge global brands, risk is directly proportional to the size of an organization's public DNS presence, especially in retail and financial services verticals, but tooling and expertise are leagues ahead of mid range companies.\n\nThe SOC teams and threat hunters I deal with have vastly more resources at their disposal than SMB outsourced security teams, and a better understanding of their attack surface, but risk comes with the sheer number of subdomains, third party services, and DNS records they manage on a daily basis. They often need to defend (enumeration) and attack (phishing detection) within the same workflows. It's a minefield.\n\nAll-in-all, I'd say yes, because the security teams are more talented and better trained, but there's secondary challenges too.",
        "points": "8 points",
        "children": [
          {
            "comment": "This sums it up nicely, I'd also say larger companies have decades of old inhouse software that is woefully out of date in terms of standards and from my expertise now getting inventoried for the first time.\n\nA lot of companies are skating by with that \"one internal server that is only safe because it's behind the VPN\"",
            "points": "4 points",
            "children": [
              {
                "comment": "There is a COBOL joke in here somewhere.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "There's also WAY too much of a reliance on OSINT data sources within high risk environments.\n\nWhy do some companies rely on month-old IOCs to feed into their security stack? Or VirusTotal data that's not aggregated in any meaningful way?\n\nIOCs rely on a single point in time. Attackers are recycling their infrastructure every 48 hours or so. The whole industry needs a change of approach.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "The same could be asked for why most AV vendors still rely on hash lists for the bulk of their protection. When I was working at a vendor who was tailored toward large enterprise it was a running joke that anything we put out \"content\" to protect against would be seen 4-5 months later when it was dropped from the content lists for \"not being as relevant in environments\".\n\nSeeing how woefully unprepared they were and how utterly reactive the processes were changed my mindset on how security, specifically endpoint, should be handled.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Not necessarily. There's much more to being secure than spending money. But it helps.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Mostly, most secure is likely a small place with a lone neurotic sysadmin where the employees all listen to him somehow. 😂",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "More money does not automatically mean more secure.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "More money, more problems. Anyways, same like in football (soccer). „Money don’t play”.It is all about right strategy. With more money you have less limitations, but still high budget will not do the job ;) so NO, budget level does indicated security level.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not necessarily.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It depends.\n\nWhy yes I am a professional, why do you ask?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Vague AF question, no bulletproof answer for it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No budget != Security",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If there any departments other than IT/SOC then no. People get social engineered far too often.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No. How secure a company is depends how good the good the leadership is and if they are serious about being secure or only serious about SAYING they are secure. Budget has little to do with it. If they are serious they will find the money.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I would say no amount of budget can counteract the insider threat of careless/ignorant end users. Some companies(mine included) throw money at tools, but have done little to curtail the end user from falling for obvious phishing attacks. I had a user actually fall for the CEO giftcard text a few months ago.\n\nEdit: Let me not put it all on the end users. IT professionals often have bad habits as well that render security tools worthless.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Multiple factors to consider outside of budget.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You can throw all the money you want at cyber products but unless they are implemented, configured AND monitored, they are worthless.\n\nIt depends on the people, the leadership, and the culture.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not necessarily. Can they be? Absolutely, but if they aren't spending the money in the right places or more importantly they aren't listening to the security team, then no. A company with a smaller budget that implements from the top down, works in a methodical manner, and has higher ups that listen to the experts, is going to be way more secure than a company that just throws money around and doesn't listen to their SMEs.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Depends on who is leading the security department.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Did bigger work for the Titanic?\n\nIf whoever is steering the ship isn't laser focused and LEADING their respective crew in the right manner then the size of the ship is just as likely to be a detriment to their security goals as to be an advantage.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Most likely, if they have access to better detect and prevent products there is less chance of malicious code being ran.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Too much info is missing. You can have a large security budget and choose the wrong stack and still get screwed.\n\nYou can have all the best programs and have an employee weaponized against you and still get screwed.\n\nJust in 2023 we saw massive companies with more than enough money for a massive cyber budget get completely bent over by groups, and they were not using advanced tactics in their attacks at all.\n\nIt's a crap shoot and really comes down to what you have but more importantly how well those leveraging the products can implement and update them.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It depends on how the budget is applied, as others have said. Just having more money doesn’t correlate with having better security. It’s a false equivalence.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The have the financial freedom to be more secure",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The Federal government has one of the biggest budgets around and is one of the biggest employers in the country.\n\nYet they get breached over and over again.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"more secure\" is a large subject, it depends how you want to take it and how do you evaluate the risks: on which references would you base your opinion? ISO27001, NIST or any similar? But, what if they are good in doing documented procedures, but bad in execution? It also depends on who they are, if they are more exposed to state threat actors, organized groups, etc Another example, an company can be very large, but built on a lot of legacy and irreplaceable but obsolete and vulerable systems. Same for large companies that do a lot of mergers and acquisitions: they have the money and the workforce to grow, but they inherit obsolete systems that would take a lot of resources to migrate, so they leave everything as is and end up with a very heterogeneous information system. One last example, a big organization that invest a lot of money into security solutions, with state-of-art EDR, XDR, and whatever they can buy, but without any cybersecurity culture and no knowledge of in-depth security. Would you consider they are \"more secure\" because the probability of an external attacker compromising their information system from an exposed asset would be very low, but any threat already inside (e.g. phishing, physical intrusion) would be able to fully compromise everything in less than an hour? In conclusion, it depends, mostly of the strategy of the organization regarding cybersecurity, there are no general rule that applies here.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No. And as long as top leaders think that simply throwing money at “security” means they are more secure the answer will continue to be “no.”",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Budget is a probabilistic factor in maintaining cybersecurity posture.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You can spend all the money you have, doesn’t mean anything is being properly configured or managed",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"yes\"",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’ll take “false dichotomy” for 500, Alex.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Depends on how efficiently the money is spent.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Sometimes",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not always, it’s all in the implementation!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No! It doesn’t take millions to be secure, it takes knowledge, planning, consistency, and cooperation.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Larger company, larger budget, more users = less secure.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's not the budget it's the users",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No. Large companies will buy every security product available by lack the manpower to implement them or update them. They are more willing to expend budget on tools than hire appropriate staff.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ohhh and the recent Microsoft breach says No.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Depends on the Vulnerability management standpoint and making sure they're patching. This can be a lot more challenging in a bigger company.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bcb18o",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bcb18o/bc_security_will_be_offering_their_ironpython/",
    "title": "BC Security will be offering their Ironpython DEFCON workshop for free March 19th",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bcav0r",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bcav0r/small_business_security_overhaul/",
    "title": "Small business security overhaul",
    "points": null,
    "comments": [
      {
        "comment": "Find an external party to run your security if your clients are demanding higher security. Otherwise consider switching to Microsoft e5 as it is very complete and it can grow with your company.\n\nIf you want good security you will want to reduce your attack service aka standardize on servers and endpoints",
        "points": "11 points",
        "children": [
          {
            "comment": "Clients are demanding higher security, I do think we'll need some external help, but I'll need to convince my boss.",
            "points": "4 points",
            "children": [
              {
                "comment": "What kinds of controls/capabilities are your clients demanding? They'll usually tell you in their contracts and security questionnaires.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I use Huntress EDR and MDR. It is co-managed with an external MSP, but I am going to deploy it solo for an expansion we are doing. Works great, is cost-efficient, and it comes with the Huntress team that monitors and reacts 24/7.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "MSSP providers exist and it's a very competitive landscape. This is 100% something to outsource. You don't have the bandwidth to monitor everything yourself 24/7.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wazuh might be an option for you. It’s an open source SIEM & XDR tool, John Hammond has a great YouTube demonstration video on it. I don’t have any experience with the tool myself but I plan on implementing it into my home environment for some fun experience.",
        "points": "4 points",
        "children": [
          {
            "comment": "Thanks for the suggestion",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It’s a pretty neat tool. I enjoyed the vulnerability management/compliance feature that outlined any risky configs on endpoints and compared it against CIS benchmarks",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Your best bet is to hire an outside consultant, possibly a vCISO, to help guide you. They can advise where you should start with protecting your business by prioritizing the threats (fraud, ransomware, attacks on your servers, etc.) and what defenses you should set up first. Security tooling is not \"set and forget\", it is \"set and watch closely to see attacks against your stuff\".\n\nIt is common to see early-stage startups like yours not do much security at all, even if customers ask for it. Once you have some revenue and can make one of your devs responsible for security monitoring and alerting, then you can have more focus on it.\n\nBut if you're really fixated on the OSS tools? OSSEC, Security Onion, or Wazuh. OpenEDR from Comodo comes recommended (I haven't used it). Velociraptor for Incident Response artifact collection (not prevention).",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Would you ask an automobile engineer to work with city gov't and develop laws about driving cars? That's what you've been tasked with.\nThe problem is we've allowed the equivalent of used car salesmen to call themselves security practicioners for the last 20 yrs, looking at you CISSPs.\n\nHire a staff security pro, even a part-time position, or hire a consultant.\n\nIT pros transitioning to security have a hard time understanding the role and dev's are no different. Most overspend by hundreds of thousands of dollars because they don't understand how GRC and tools work together.",
        "points": "4 points",
        "children": [
          {
            "comment": "That's what I think we need too, I'll reiterate this with my boss, thanks for confirming what I thought.\n\nAs a dev I can implement application security, but I can't implement Network and business security with the same knowledge.\n\nWill come back here for more help if I can't convince them tho...",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Great resource to hit the basics: https://www.ftc.gov/business-guidance/small-businesses/cybersecurity",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My best advice is to do the least customization as possible since misconfiguration is where a lot of vulnerablities show up. Also since the company is small there may be off the shelf solutions that are relatively cheap that you can adjust your process to fit so I'd Find paid solutions and price them out. When compared to the learning curve and your salary with the risk of misconfiguration it might actually be much cheaper to pay for off the shelf solution",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is a XDR solution from Trend that meets the criteria you've listed. I'm a SME on this product. Feel free to dm if you have questions.\n\nThere are a lot of vendors out there, highly recommend doing your own research.\n\nhttps://www.trendmicro.com/en_us/business/products/one-platform.html",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wazuh is your answer, gotta build it out though",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc983d",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bc983d/associate_of_applied_science_cyber_security/",
    "title": "Associate of applied science cyber security",
    "points": null,
    "comments": [
      {
        "comment": "The jobs you should be looking for with a 2 year degree are going to be entry-level help desk jobs in IT.\n\nThere, you will start to build experience and you can move into security as you grow in your career.",
        "points": "82 points",
        "children": [
          {
            "comment": "Thank you! Is this a good start though? I’m stressed lol.",
            "points": "15 points",
            "children": [
              {
                "comment": "That’s how a lot of us start, help desk/tech support/junior sys admin",
                "points": "20 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "They also recommend me a cert program, I declined and chose the degree.",
            "points": "6 points",
            "children": [
              {
                "comment": "Grabbing an entry level certification along with the degree is also a good idea.",
                "points": "35 points",
                "children": [
                  {
                    "comment": "thank you so much!!!",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "Definitely grab certifications along your degree, they are just as important for securing a job IMO. A degree means you can pass classes, but certifications from accredited institutions (CompTIA, Cisco, AWS, Microsoft, etc.) shows that you can actually remember and apply that knowledge. It doesn’t hurt to do them along the way either while all that knowledge is fresh.\n\nI took my A+ right after most of the intro classes. Your college might also have classes that have their whole curriculum around a certain certification (like A+, Network+, CySA, Cisco, etc.). That would also be a good time to take them.\n\nHope this helps.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "The cert program was most likely a cert for completing certain classes, not an industry certification.\n\nThere is no harm adding the cert and your degree.\n\nI literally just got my official certification in the mail today from my college for a Linux admin cert, I graduate in 2 weeks with an AAS in cyber security.\n\nYou will also want to look at industry certifications when you get closer to graduating.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I finished my BS at age like 24/25 so I wouldn't worry about age. I do worry about the promises by your advisor. At best the only thing available directly out of an associates would be help desk or tier 1 tech. I would be shocked if a security position would swing your way not trying to deter you just trying to be real.",
        "points": "13 points",
        "children": [
          {
            "comment": "Thank you so much! I had a feeling it was too good to be true, that’s why I asked here! I really appreciate your comment. 😊 I think I’m going to stick with it and throw some certificates in there too, maybe that’ll help out some.",
            "points": "7 points",
            "children": [
              {
                "comment": "For sure I just try to keep it real. I would ask your schools IT department if you can intern or be a student worker that did wonders for me.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Look at you overachieving! I was in my 30s when I finished my BS",
            "points": "1 point",
            "children": [
              {
                "comment": "That would have been me if my wife didn't keep me on track!",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Can confirm, 6 months post grad with associates. Think I finally landed a help desk job, you'd be surprised how many say it's entry level then want 2 years of experience lol.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Dont listen to any negativity. I got an associate's in cybersecurity and a few certificates, got hired a few months later as a junior cybersecurity analyst. I'm older and other factors on my resume helped, but there's no reason not to. Look into local or online colleges that will take an many transfer credits from your community college as possible. Get that associates and roll it into a bachelors. My school took 82 transfer credits between my community college and the first time I went to college a few years ago. I'll have my bachelors soon. 21 isnt old. I changed careers at 37. Spent about a year and a half working on comptia certs and my associates. I'm dumb, if I can do it so can you. Look into free community college, check if your school uses Grant's to pay for your comptia or az certs. If you really wanna go for it, join the reserves and go to school for free while uncle sam covers all your benefits. Theres lots of options for a 21 year old out there. Dont be afraid to make big changes to your life. Get focused, be hardcore, believe you can do it!💪",
        "points": "30 points",
        "children": [
          {
            "comment": "Your comment is getting screenshotted and saved. Your response is the best response for what I was asking. Thank you so much. Words cannot explain how thankful I am!",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "what certs?",
            "points": "1 point",
            "children": [
              {
                "comment": "I had Net+, Sec+, and Google Project Manager when I started. Now I also have Cysa+. I think you'll need sec+ to get looked at for anything in cybersecurity.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "How many certificates do you have? How long did it take for you to snag that junior position?",
            "points": "1 point",
            "children": [
              {
                "comment": "3, sec+, net+, google PM. About 2.5 months before I got hired. I applied to probably 200-300 jobs. I did a lot of networking, asking professors for leads on jobs, reaching out to people I knew in the industry, anything I could do. I scored the interview because a professor gave me a good recommendation. Use your contacts, dont be afraid to ask people for help.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Is the CompTia A+ necessary? Or is that only required for technicians / help desk roles?\n\nI'm a UI Designer that just got laid off. Been thinking of switching to cyber security...",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "So many \"entry level\" cybersecurity jobs are not actually entry level. They require a moderate level of understanding of the environment at least. I believe you can start with a help desk job even now, depending on your curriculum and it would help you both financially now, and for your career. I would prefer someone with a help desk and/or sysadmins background in cybersecurity over a  \"CTF warrior\".\n\nAlso, the associate degree is as useful as what you make of it. Would you rather learn stuff so you can utilize later? Or do you just want the degree? Though, questioning these shows that you are someone who wants to understand and plan ahead. Or at least, you are trying to minimize the ambiguity. That's something I admire. I have seen so many people, even after graduation, they don't know why they studied and what do they want next.\n\nEdit: syntax and typos",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I was 30 when I went back for my degree, so you should have no problems there.\n\nI have an associate's and I never put it on my resume. It really doesn't gain you anything. The jobs you will qualify for won't care about college degrees and those that do care will want a bachelor's at least. Keep an eye out for programs to help you transfer to a 4 year program. You'll be better off in the long run.",
        "points": "9 points",
        "children": [
          {
            "comment": "Thank you so much. 🫶🏽 If you don’t mind me asking what did you pursue?",
            "points": "2 points",
            "children": [
              {
                "comment": "My associate's is Computer Networking Systems and my bachelor's is Information Systems and Cybersecurity.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Don’t feel old. I’m 27 working on my sec+ cert",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We just hired a new IT Branch Tech at the branch I work at. He is 29 and just graduated with a 2 year degree in cybersecurity at the local community college. He worked for several years and realized he wanted more in life. So in his late 20’s he wanted to back to school. He also has a security+ certification. He may not be working in cybersecurity yet, but now he has his foot in the door.\n\nAlso Im 50 and im going back to school for my masters. I just finally finish my BS degree 2 years ago. Never too old to go to school.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "While a degree is better than not having one to get started, certificates are usually better. While you are in school and have access to a .edu email account, try to work with your counselors and professors to get certificates in the courses that you are taking.\n\nAlso, I agree with the other comments about experience. Think of Cybersecurity is a specialization of IT in general. Learn IT and how to build systems with a \"Security POV\". I always say \"you can not build a lock for a door if you do not know how a door works\".",
        "points": "5 points",
        "children": [
          {
            "comment": "Thank you! 🙏🏽",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Look for some GRC roles.\n\nThey are not as technical heavy but still allow tons of exposure to lots of technology, business processes and security tools/processes.\n\nYou get you observer a lot of “how things work” and see lots of broad areas in security without being siloed into one area at first.\n\nI did the same thing starting out. Same degree no Certs. It was still relatively entry level and paid decent.\n\nBut it’s better than help desk, it’s in the Cyber world, and nice hours haha. I’m using this time to find my focus and continue training",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As someone finishing a A.S. In Cybersecurity at 25, you are not too old, but I wish I just went general IT\n\nI tried CompSci and was bad at it so I switched to Cyber\n\nLook at the curriculum of your schools Cyber degree and compare it to the IT one. At my community college the stuff taught in the IT degree would’ve been much more beneficial to learn for a beginner\n\nI have 4 years IT experience already so I figured I’d go Cyber but it still feels like a mistake\n\nI feel like a better path for someone who really wants to get into cyber and can’t do CompSci for whatever reason would be Associates in IT, Bachelors in IT, and then if you really wanted you could do a Masters of Cyber\n\nCyber is just MUCH harder to get into as a beginner than IT is. Cybersecurity degrees aren’t BAD per se just don’t feel right as your first degree",
        "points": "1 point",
        "children": [
          {
            "comment": "I did one semester of CS and quit college for 8 years lol... I wish cyber was a path back then. I think the skills you learn easily translate to other areas like networking, firewalls, AD, cloud, etc. Even sales if you want to sell your soul.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I went back the same age as you. I did my associates and now I'm months away from getting my bachelor's in IT(concentration in network and security) and I have 4 certifications already(my focus is cloud and cyber).\n\nIf you continue to pursue your education for your bachelor's, make sure your classes that you will be taking are transferrable directly to the major you'll want.\n\nFor example, in NJ, there is njtransfer.org and you would input the course code and see if the credit transfers over. A had 5 different advisors from my community college telling me different things before I finally found out that this is how the system works. Plan ahead so you don't waste your time.\n\nI highly recommend you get some certifications before you graduate. It will really set your resume apart. Note that I said certifications and not certificates (looking at you Coursera). Also consider doing some projects to demonstrate that foundationational knowledge. It's a never ending learning curve in cyber",
        "points": "0 points",
        "children": [
          {
            "comment": "Thank you for taking the time to comment this. Lots of great information and advice. I appreciate you so much for this! I don’t have much guidance so I’m trying to figure out everything on my own. Do you think I should do the certification program instead of the AAS degree?",
            "points": "0 points",
            "children": [
              {
                "comment": "Going to be honest with you, I'm going to push you towards a bachelor's instead and hear me out. Your age literally primed you for success.\n\nDo not go certification route and go bachelor's all the way and this is why:\n\nIm first gen to go back to college and I wish someone had told me this. At age 23, you get a massive boost to financial aid since it legally counts you as an independent regardless of where you live(with parents).\n\nThat boost paired with Pell grant and guaranteed federal loans can give you a somewhat of a full ride for your bachelor's after you transfer in with a complete associates.\n\nWhy complete the associates? Because when you transfer with a complete associates, it will reset your gpa no matter how bad you did in community college AND you will be 23 by the time you transfer in to a 4 yr college.\n\nI managed to get my financial aid to pay for my single apt housing while pursuing my bachelor's. Depending on the university to go to, it might be possible as well.\n\nIf you have anymore questions, please feel free to ask!",
                "points": "0 points",
                "children": [
                  {
                    "comment": "I agree, a bachelors will be needed in the future for the higher paying jobs. I have 29 years IT experience with 17 as a IT manager and 5 years as a director in healthcare. When I graduated high school in 1991 the only IT degrees in college were compsci and it was software development and I wasn't interested in that so I dropped out. I am currently looking for work and getting rejected because I don't have a degree. Even with all my experience and track record with huge successes and I am a CISSP and a PMP. Seems degree are just so important these days. Also 21 you are basically still a kid :) Good luck!",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I would say for jobs - foot in the door and pivot to whatever comes your way.\n\nIt's harder to get in from the outside for many organizations. College and certs are the icing, but who you know and experience is the cake. I have CISSP, CCNA, Sec+ and a B.S. in Cyber.\n\nYet - I found it hard to get my name in through to HR. Maybe I was how I wrote my resume? idk. But I got a job offer real quick once they started seeing my face around the building (got an internship) with pretty good pay. Also - labbing is really big in Cyber, if you can set up a lab, document it via youtube or whatever (it's not for others really - it's just nice to see progression) - you can really get some heads turning.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I went to a community college then a 4 year college, only difference was I did part time at the community college.\n\nI would first look at which university's you can get to for your 4 year degree, and pick which degree you should get at the community college based on what bests transfers to those college's. An associates in cybersecurity particularity really makes no sense as nothing you can learn in 1/2 classes would give you enough depth for anything solid, at most basically equal to a sec+. Also, an associates really will only help you get into the most basic entry level jobs like helpdesk or desktop support, as they generally don't carry enough weight without experience for system admin's or network admin type of work.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "most companies want to see a bachelors these days, especially if you don’t have experience. I have the same degree and it took me like 2 years to land my first cybersecurity job but my friends who did their bachelors got hired right after they finished",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You should be able to get an IT job while you're in college, especially if you're attending school part time.\n\nWhile you're in college, leverage all the resources that your school makes available to you: computer labs, professional contacts & networks, student discounts from vendors, and more.\n\nJust whatever you do, don't go into school expecting that the degree will land you a job. Hiring managers will want someone who can practice their skills and learn quickly, and it's best to find a way to develop a portfolio of sorts to show that you can do the work.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You are young!!!! I’m an immigrant and I’m going back to college in US, almost 25yo 🤯",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Get all the certs you can that go with the class you are taking for instance. CompTIA A+ would go with your IT fundamentals and basic computer troubleshooting class. Cybersecurity is not an entry level job.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Too old?! You're literally college age. You are decades ahead of some people getting into this field.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Don't limit yourself to GRC, or tech support. Depending on your goals a software engineering/ ops gig could be hugely beneficial.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I got my AAS in Information Assurance and Cybersecurity from a local community college in Maryland. Spoke to my advisor and found out they had a 2+2 program with a local university in IT. So I was able to transfer 64 credits to that university and get my BS in IT. I was 24 when I graduated because I started college right around 20.\n\nKeep in mind, I did not finish highschool. I had a below 1.0 gpa basically the entire time I was in highschool. Just never went or cared, so I legitimately had to teach myself how to learn and take notes during the entire first year or two of college. Had to learn math from scratch. Had to learn how to write papers from scratch. All that stuff. It was challenging as fuck but I put the hours and effort in and learned a ton in my time at college. Sat in the front of every class and went to office hours and study sessions whenever I could. I am by no means the smartest guy in every room.\n\nI bartended on weekends while in school and had a regular patron who worked in the hosting industry (lots of web servers and databases). We became friends over a 2 year period, and I eventually asked him to mentor me; which he accepted. He had me work on some projects, and we would hangout and have beers and play guitar and shit from time to time.\n\nI was in my last year of school so he eventually asked me if I was interested in an internship (of course I was). I worked as an IT intern for about 6 months before they hired me on as a full time sysadmin. Worked as a sysadmin for a year and legit just kept asking if I could help with more advanced stuff. Eventually I shifted into a systems / linux engineering role where I was migrating, securing, patching, and automating system and network infrastructure for all kinds of clients.\n\nEnded up getting the go-ahead to work as a 'digital nomad' for about 6 months before getting laid off from that job (best thing to ever happen to me). Then worked varying contracts while traveling around eastern europe for about 4 months. Mostly Ansible and Linux related work. Some quick contracts to keep me from day drinking too often lol\n\nRecently moved back to the states and found a sick Security Engineering job for an MSSP and I'm loving it. Love the work I'm doing here and the people I work with. Most stress free I've ever been and since it's a small company, my opinions are definitely taken seriously by management. Nobody is breathing down my neck all day or anything like that. It's great.\n\nAnyway...\n\nI would say college is what you make of it. Your degree doesn't mean shit if you do the bare minimum and are just going to get a piece of paper and leave. I loved college and took advantage of all the opportunities that were presented to me there. Made lots of friends as well.\n\nIf you are persistent and ambitious when setting and achieving your goals, you can get into the cybersecurity field without a degree. In my opinion, I would go the help desk / sysadmin or junior dev route to get your foot in the door though. It's unlikely you'll get security role without some foundational work experience these days.\n\nAlso, ignore all this \"wahhh it's so hard to find a job\" nonsense going around the tech community right now... there is opportunity everywhere. If you can solve problems, are personable, and can sell yourself well, you will find work. Basically, what makes you stand out from the other 100+ candidates? Nobody wants to pay a guy good money who's just like everybody else.",
        "points": "0 points",
        "children": [
          {
            "comment": "I’m in Maryland right now! Going to CSM.",
            "points": "0 points",
            "children": [
              {
                "comment": "Oh that's great! I went to Harford CC and Towson.\n\nI would speak with your advisor. I wouldn't doubt they have a similar 2+2 structure where you can transfer all your credits to a local university",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I got an associates for support tech at 26, did that for a few years and moved in to entry level soc, you'll be fine. As others are stating, get certs. Have continued passion for learning and learn on your own. I'm now a threat intelligence and incident response analyst III.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I am in the same boat. I am getting my associates in IT. I don't know where to go from there. I want to get my foot in the door i'm 22 years old.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m getting a AAS in cyber security. I have a couple certs but applied to 4 internships and everyone called me to set an interview up. Took the first offer which was the lowest paid at $22 but I believe in the company the most. You have to find ways to stand out though. A bunch of my classmates aren’t getting anything and only do bare minimum to get by.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I got out of the Army at 22 and started school. I started with an AAS in Informatics. From there I got a part time help desk job at a school. I bounced to another school for full time sysadmin and now a security engineer.\n\nThe AAS is great to start, but understand this field isn’t the type where you get a degree and you’re off. I worked hard for certs, built my resume/linkedin, did independent study and labbing etc. You will be studying forever so long as you wish to progress.",
        "points": "0 points",
        "children": [
          {
            "comment": "I’d like to also point out that I am not smart whatsoever. I was an infantryman as well, so it’s not like I had any carryover knowledge or experience. The hardest part for me was realizing that I can teach myself literally anything, it just takes commitment and time.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I started CC at age 21. I did not feel old at all and you shouldn't either. Plenty of students were around my age or older.\n\nI would say start looking for some entry level help desk jobs or internships asap, don't wait until you finish. Also, start working towards certifications asap as well. Just don't wait until you finish your two year degree to start doing everything.\n\nGood luck!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Also in a GRC role. Transitioned into that on the power of my AS in IT and a Security and Administration background, and a Security Clearance. A lot of the 20-somethings I work with have maybe a Bachelors in a relevant field. A Sec+ (or one of a set of other less common certs) is needed to advance, but not to start. Having the Sec+ would give a leg up. A few years ago, anything computer related wanted you to to talk about what you were doing with your \"home lab\". If you can, maybe spin up a small domain of virtual machines to putz around with.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Too old? Lmao!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Community college or an applied associate's is a great way to start. Expect an entry level position, but that coupled with some relevant certs over time is going to help you quickly climb.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Don’t sell yourself short, everyone in tech is crying… i got a job in tech without a cert, been in helpdesk for 6-7 months and already am interviewing for information security admin at a bank. The field is intimidating cause how massive it is but if you’re willing to go back to college at 21, youre more motivated than 80% of people in the field.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You're 21, you're not too old for anything.",
        "points": "0 points",
        "children": [
          {
            "comment": "Man that's the truth! I miss 21. 42 hurts...physical pain. They didn't tell me it would be like this haha",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If you go to the website cyberseek.org, it’ll show that the security+ certificate is desired on close to 80% of cyber roles. So I’d try to get that certificate if possible. “Security+ from CompTia” . There’s lots of resources online and especially on YouTube to help you prep for the exam which would be cheaper than getting the training from CompTIA directly, but the call is yours to make. That cert should help a lot! Then you should be solid imo without the work experience",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "9 years exp here, started in 2015 as a Sys Admin. 28 years old now. Associates in IT at 19 years old. Just jump in and get it done, you won’t regret it",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Great that you are going back to school. There are many paths to work in the field with some working the help desk and moving up. However, since you are in school, I highly highly recommend getting a cyber internship. This is big as you can get experience and work with different teams for exposure. Also, with enough time, you will most likely get a full time offer. Also, do not just do your school work. Aim and get certifications. By the end of two years, you can get experience with an internship in the field and certifications along with it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Too old... I started IT professionally when I was 26. Started college for the first time at 28.\n\nI'm making 115k today\n\nThere are people that started older.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If it's at CCC just DON'T!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "These are solid questions. You can absolutely get a help desk job and maybe even a social analyst job. Intern also is solid. Depending on where you are the govt has some amazing internships.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Lol. I was doing this exact thing in 2019, and I was 27. You're not too old. However, don't let anyone fool you. You will only be qualified for low-end help desk jobs and aren't going to get an entry-level cybersec job because there isn't really such a thing. I had an AAS in IT with an emphasis in info systems and cybersec. I got hired to be a desktop support tech and do help desk stuff, too. Six months later, our company was bought by a bigger one, and I got more than a 20k pay bump to do just help desk work and got a mid tier position because of my desktop experience. I settled in, and with another 8ish months of working my ass off, I was top 3 in the help desk in most statistical categories my company cares about. I got a promotion after another 6ish months and a good pay bump. Now I'm the highest position on help desk that isn't a supervisor. I'm paid well and specialized in an area that allows me some freedom to help other IT departments within the company. Here's the kicker. I've been in IT for almost 3 years, and I realized I don't really even want to be in information security anymore. IT is such a diverse field, it's very likely that after spending a few years in it, you'll find something you'd rather be doing. Good luck, man, don't stress. It'll work out eventually.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I started my associates as soon as i turned 21 as well, and literally my first semester i was able to get a helpdesk internship which led me into a permanent part time employee at the company and now I am able to cross train and learn some things from our cyber security team and also learned a couple things from our network admins , i think helpdesk is a really good place to start and most dont require any certs they just need you to be motivated and also able to have good people skills",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I went to college. Ive seen ALOT of folks around 25yo in the same class when I was only 21. No one will care about your age, nor its never too late :)",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I started college at 26 and graduated at 30. I had an easy time because I got along with my advisor and professors, because we were closer in age. I even dated one of them! You can't do that at 18 lol.. I worked at my college too. They give you more lienency when you are older. I didn't have any issues getting along with my classmates either. I'm still friends with some of the people from my degree program. Mostly it was a good experience.\n\nI did one semester at 18 and said it's not for me. I'm glad I went back. I actually don't use the degrees I got at all either. I majored in computer graphics and English, and I do small business IT consulting. I made the mistake of telling one of my clients my college background. Now she calls me \"the artist.\"",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I wouldn’t feel worried about starting at 21, I started about the same age when I started my degree. I found internships to be a great way to get a foot in the door, maybe ask your advisor about any cybersecurity internship opportunities.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc8l50",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bc8l50/how_do_you_guys_handle_smishing_campaigns/",
    "title": "How do you guys handle smishing campaigns?",
    "points": null,
    "comments": [
      {
        "comment": "Security awareness training for staff",
        "points": "29 points",
        "children": [
          {
            "comment": "That's right. There's not much you can do for BYOD.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This is the way.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Ask them to forward the text to 7726\n\nhttps://consumer.ftc.gov/articles/how-recognize-and-report-spam-text-messages",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "you can use a free url scanner like checkphish",
        "points": "2 points",
        "children": [
          {
            "comment": "Or VirusTotal. Or Hybrid Analysis.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If more than 5 users report receiving the same kind of smishing messages you can may be send a security advisory or a notification to the users mentioning about an ongoing campaign (include small details about the message) to increase vigilance.\n\nIn your case having low employee count plays in your favour.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Mobile device management with BYOD capability",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Blocking the numbers is useless. They are random numbers pulled from spreadsheets. But make sure everyone is marking the numbers as SPAM.There is SPAM protection on Android phones too. But that's not a viable way to stop.\n\nCheck if these inbound messages are using the RCS Encryption protocol. Maybe you can block by the protocol or origin country used. The older SMS protocol is soon to be depreciated.\n\nhttps://fortune.com/2019/12/16/androids-what-is-rcs-messaging/\n\nThis is the phone carriers responsibility. But they haven't done shit to protect customers.\n\nEDIT: sorry didn't mean to reply to the comment.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You can keep yourself safe by doing nothing at all or block the sender.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Get everyone off of SIM based MFA for one thing (looking at you, Apple). Include notification storming in your targeted attacks training, and perform your own smishing campaigns like phishing, to raise awareness. Note; some jurisdictions are in the process of changing how insecure SS7 is, and the law is evolving, so take legal advice on smishing campaigns you want to run",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc78qo",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bc78qo/is_cva_from_mile2_any_good/",
    "title": "Is CVA from mile2 any good?",
    "points": null,
    "comments": [
      {
        "comment": "I'd recommend checking out https://www.sans.org/cyber-security-courses/build-lead-vulnerability-management-programs/\n\nmile2 although having been around a while, is still almost unheard of in private sector. The question might be, why didnt you go for E Council or GIAC, etc. In practice, although the materials when I last reviewed them with a team member some few years back seemed not very different to anything else, the presentation was not great at that time.",
        "points": "1 point",
        "children": [
          {
            "comment": "Thanks! Will check it out.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc6kq3",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bc6kq3/ai_security_presentation_help/",
    "title": "AI Security Presentation help",
    "points": null,
    "comments": [
      {
        "comment": "I do this presentation a lot:\n\nElevenLabs to clone someone's voice\nChatWithGPT to interact with ChatGPT using the cloned voice (https://github.com/cogentapps/chat-with-gpt)\n\nI edit the ChatGPT system message with facts relevant to the person who's voice I cloned, and even provide it with a fake bank account number, etc.\n\nI've been working on incorporating a live face-changer app, but the lipsyncing isn't great.",
        "points": "6 points",
        "children": [
          {
            "comment": "this is awesome man, thanks for sharing!",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Check brightalk. You can find several presentations regarding AI and security. You can find more than you estimated. And you'll see that current AI tools help offenders more than defenders.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The main threats are still:\n\nhigher quality soceng at scale\nfuzzing/static code analysis\nunique malware creation (though it isn't good yet)\n\nNot a lot of new or novel threats are emerging just yet.\n\nI also tend to mention things like WormGPT: https://flowgpt.com/p/wormgpt-6",
        "points": "2 points",
        "children": [
          {
            "comment": "unique malware creation (though it isn't good yet)\n\nawesome I remember hearing of wormgpt when chatgpt2 was becoming a thing. Will play around with it, thanks for sharing!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Don't forget to add that it's been in use for years for pattern recognition and behavioral analytics",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My engineering team uses ML jobs/detection rules (in our SIEM) to identify anomalous activity..... (i.e Impossible Travel, Rare User Authentications, etc.)",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc5ta7",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bc5ta7/password_sharing/",
    "title": "Password sharing",
    "points": null,
    "comments": [
      {
        "comment": "Take a look into a password management tool that offers password sharing. (See 1password I think supports it?). You can have IT centrally manage it and add/revoke teachers. You can even set it up where teachers can’t even see the passwords, only have it autofilled for them.\n\nEdit: literally says “tired of sharing sticky notes?” On their page for corporate solutions.\n\nhttps://1password.com/features/secure-password-sharing/",
        "points": "1 point",
        "children": [
          {
            "comment": "Agreed that 1Password, Bitwarden, or most other Password managers will do this. I have also used an onsite product called Password Manager Pro from ManageEngine (Zoho).\n\nI might go one step further and place the password manager on the user' phone. As long as they have their phone, they can log in and retrieve the password for that device school or even classroom. At that point, you could have the password reset as an automated process every night or weekend.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc5hiw",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bc5hiw/shellfeck_a_brainfck_inspired_shell_obfuscation/",
    "title": "ShellFeck: A BrainF*ck Inspired Shell Obfuscation Proof-of-Concept",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bc5cwd",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bc5cwd/is_sans_gcih_worth_it_if_i_already_have_the/",
    "title": "Is SANS GCIH worth it if I already have the CISM/been in the field for 5+ years?",
    "points": null,
    "comments": [
      {
        "comment": "If you've already taken the training, then yes get the cert.",
        "points": "21 points",
        "children": [
          {
            "comment": "Thats kind of how I am leaning but wanted to get a gut check out there. They sent a certification of completion but thats not the same as having the actual Certification.",
            "points": "2 points",
            "children": [
              {
                "comment": "It's never a bad thing to have an extra cert. The company I used to work for didn't care at all about certs, and I was planning to stay there forever... so there are like 3 SANS classes I took and never bothered to get the certs. Fast forward and I'm with a different company and regret not getting the certs. Take the test!",
                "points": "7 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If your org will value it for future promotions, or if you think you might be job hunting again someday in the future, it's probably worth. The most expensive part is already paid for, after all",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "GCIH reads very well for relevant roles, the exam is $900.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yes get the exam attempt and add it to your resume, definitely a very in demand certification.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you got the training, I'd do it.\n\nAlso, if you have DoD 8570 requirements to hit the CISM doesn't apply to all the same roles GCIH does.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You've done all The work doing the training, so do the certification.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Certification has value. However, consider maintenance /renewal fee as well. The certification maintenance fee is a non-refundable $479 payment, due once every four years at the time of registration",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "TAKE THE EXAM!\n\nIf your company paid for the course, why not take the exam\n\nHow is this even a question?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's so easy, just take the test. I don't add weight to it, but it doesn't hurt. Source: have one myself",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No, not out of pocket. SANS + Cert programs can cost 8k per class and test. That's 80 percent of a Uni of Texas and Georgia Tech masters degree. Get a masters degree instead and never worry about certs every again.",
        "points": "-6 points",
        "children": [
          {
            "comment": "Well I already took the course and my organization paid for it. They arent forcing me to take the GCIH and its not required for my current role but was trying to make the decision to sit for the exam or not",
            "points": "0 points",
            "children": [
              {
                "comment": "I would just list the course as professional development. If no one is requiring the cert don't waste your money.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc4okq",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bc4okq/advice_for_writing_secure_code_for_a/",
    "title": "Advice for writing secure code for a non-cybersecurity engineer/student?",
    "points": null,
    "comments": [
      {
        "comment": "OWASP’s secure programming guide would be a solid place to start\n\nhttps://owasp.org/www-project-secure-coding-practices-quick-reference-guide/stable-en/01-introduction/05-introduction.html",
        "points": "9 points",
        "children": [
          {
            "comment": "It looks interesting. I'll read it. Thanks!",
            "points": "0 points",
            "children": [
              {
                "comment": "They have good local meetups as well. I used to attend their meetings when I lived in FL. Good opportunity for networking as well.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "I just went to the SNOWFROC (front range colorado) meetup and found it to be a great use of my time. I look forward to actually going to the local chapter meetup whenever they schedule it.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "And the standard ASVS/MAS is part of the OWASP ecosystem too",
                "points": "0 points",
                "children": [
                  {
                    "comment": "I tried to take a look at this. If I understood, it's a series of tests for web apps?\n\nAlso, is the OWASP important somehow? It looks like they have tons of ressources.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Its a secure code standard. When you're designing a product, feature, or some code for a specific purpose, you can ask yourself which of the domains/categories it touches upon, and how high the risk of this feature is to your goals, thereby selecting how deep to go into the recommendations (in ASVS case, I think its levels 1, 2, 3), then it can give you a checklist of items to ensure you have considered/done/assessed/treated in order to be able to claim the feature/product is compliant to the ASVS (level X) secure code standard. Other people can then, optionally, come in and \"audit\" your work to validate this claim, should you wish, or colleagues can keep one another honest, and we can all track and measure our security efforts over time.\n\nOWASP is a network of groups doing all sorts of stuff, and many of it is very important, with high engagement and activity and collaboration. For many orgs/people it is a valuable resource in maturing any security effort, but it is one of many such routes to that end. Which is appropriate for your project depends, but if in doubt, its a great choice.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Got it, thanks!",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Basics of CyberSecurity come down to reviewing settings, options; Cut out the fat.\n\nDo you need it hosted on the WWW or can it be hosted locally?\n\nYou're using Python... How many libraries / modules and what's not used / not needed? Better yet, could you get by with Django or Deno?",
        "points": "2 points",
        "children": [
          {
            "comment": "So start by only keeping the strictly necessary functionalities?\n\nI run the server locally and basically only use the standard library Asyncio to manage communications.",
            "points": "3 points",
            "children": [
              {
                "comment": "Are you writing the application for the sake of learning Python or to solve a problem? If the latter, you can try using other tools like NATS for messaging, etc. That'd minimize the load on your side and you can make use of their security capabilities.\n\nThis would solve the problem but would teach you how to write secure code.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "I needed to solve a problem and kinda used the obvious way for me which was using the tools I already knew about and didn't make more searches. That's why I want to do better now.\n\nAlso, I'm sorry if it sounds really dumb but wouldn't it be more risky for me to use complex tools that I don't fully understand than basic functionalities of standard libraries?\n\nEDIT: I do scientific computing and the rest of my code is in Python, that's why I did that in the first place.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "No. You're totally right. Using minimal code and applying the fundamentals would suffice. \n\nBut at one point, you may need more complex requirements such as reliability. If the server is down, the clients should be able to retry, but eventually you may DoS yourself due to retries, so you must use known reliability patterns. The client may need persistent cache or queue so that you don't lose data when network or server is not available. These are complex issues you may face in the future. Currently, stick to KISS and YAGNI. And when things go complex, use a well-known but the simplest tool that would solve your problem. You'll be fine.\n\nEdit: syntax",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "Thanks a lot!",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Try Snyk Code. It’s free for individuals and has an IDE plugin for Pycharm/VSCode and runs in a few seconds for small projects. You can also check out some free Secure Coding lessons in Snyk Learn.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Get trained.\n\nCSC410 from CertNexus is decent. Linux Foundation also have a secure development course. Both make a good, structured start to your learning.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc4jh4",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bc4jh4/server_network_security_management_software/",
    "title": "Server network security management software?",
    "points": null,
    "comments": [
      {
        "comment": "Sounds like Cisco Tetration, or whatever they're calling it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc3svk",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bc3svk/how_do_you_feel_about_the_future_of_cybersecurity/",
    "title": "How do you feel about the future of Cybersecurity?",
    "points": null,
    "comments": [
      {
        "comment": "Saturation sharply falls off as you move up the experience demand curve. Two things can be true at once. \n\nAnecdotally:  Everybody and their niece was telling me they were thinking about getting into cybersecurity just a few years ago. As Ive advanced Im finding less and less peers that are even in my age bracket. I suspect theres an inverted bell curve representing the quantity of qualified candidates at certain skill levels. I meet “old guard” type individuals frequently. The kind of guys who grew up hacking/phishing etc in the wild west 90s and early 2Ks who went legit and are now leaders or wizard technicians. The amount of mid career people like young security architects or deeply technical skilled labor seem to be much more rare. And then there is a massive saturation of entry level candidates. Recent grads, L1 - L2 SOC analysts, people who fantasize about going from retail to pentester, bootcampers, etc. all gold rushers.\n\nThere’s massive saturation up front, then a level of attrition that gets higher as you progress. I tell people seeking advice or expressing interest that this isnt “easy money” or a fast way to a high salary. Theres no free lunch. But if you stick with it, the reward IS there.",
        "points": "281 points",
        "children": [
          {
            "comment": "But how do the fantasizing ‘retail to pentesters’ make that a reality? Is there no point to try?\n\nFor the people who do want to change their careers, how else do they go about it?",
            "points": "31 points",
            "children": [
              {
                "comment": "You do the work. That's the only way. Most consistently a degree will help. Along the way get certs geared towards your desired career path. You'll start doing the easy stuff. If you're learning, as you should be, you'll advance proportionally to your dedication.",
                "points": "54 points",
                "children": [
                  {
                    "comment": "Super underrated comment.\n\nIf they want to be more than a button pusher, they need to develop at least one of the core engineering skills.\n\nProgramming / software development\n\nOps (old school Pc/Linux admin; and now cloud)\n\ngood old fashion Networking\n\nData (Lucene, SPL, SQL)\n\nI manage a purple team and for us to hire you as a junior you need to be able to demonstrate some sort of basic skills in one of these domains on top of your security knowledge.\n\nI don’t care about your certs.",
                    "points": "42 points",
                    "children": [
                      {
                        "comment": "Preach it, brother! Especially the \"I don't care about your certs\" part; But everything you said aligns with my reality. This forum seems to have a lot of posters who think they can skip doing the work to really learn and understand how IT systems work. It appears there are jobs out there for people like that, but not in any organization I've been part of.",
                        "points": "3 points",
                        "children": [
                          {
                            "comment": "The best cybersecurity professionals used to be developers or network admins.",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "In general I agree, although there's also a stream of great people coming into the field from QA and other non-traditional paths. The differentiator isn't about your job description, it's about the mindset. But I agree that devs and network admins are a richer vein of ore for finding those folks than any certification program or cybersec degree.",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "I let all my certs, including CISSP, expire. If I look for another position and my lack of certs is why I get turned down, that tells me everything I need to know about your team priorities.",
                        "points": "3 points",
                        "children": [
                          {
                            "comment": "All these certs are essentially a money grab by those associations. Yearly membership fees plus licensing fees plus CPEs, conferences, seminars just to keep the status “active”. At some point, work experience outweighs all that.",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "This.... a thousand times this. Adi Dassler, Bezos, Jobs/Woz, Dejouria, Koum and so so many more. There are no shortage of stories of people that just stopped finding excuses to not put in the work and pushed themselves to succeed. If all you see are the negatives and potential pitfalls then you aren't focused on the finish line. YES YOU ARE GOING TO STUMBLE... those names I just mentioned are all people that stumbled, more than once, learned from it and kept going. Don't let the fear of potential failure prevent you from running the race, you can't win if you never start.",
                    "points": "12 points",
                    "children": [
                      {
                        "comment": "This is where I am struggling. I come from not degree and no technical background so I overthink and start feeling like theres no point. I lose motivation quickly and am very negative and lack focus\n\nI do a little then stop. Do a little then stop. I cant get out my own way. I don’t know what is wrong with me\n\nBy the way, I am not pursuing a cybersecurity career but a salesforce one",
                        "points": "6 points",
                        "children": [
                          {
                            "comment": "You will do fine no matter what you choose as long as you fully commit to it. I will share what works for me. I break my large goal down into smaller more achievable ones that will lead to the big win. I then visualize those small goals with a picture or a statement (something I can print) and put copies in various places that force me to see them, mirror where I brush my teeth is a great example, the background on my smartphone and laptop, door of my fridge. When I see the image I ask myself 2 quick questions.\n\nWhat did I do yesterday that got me closer to this goal\nWhat am I going to do today to get closer to this goal\n\nSomedays you may only get yourself an inch or 2 closer, other days you may have a breakthrough marathon that blasts right through the goal... both of those outcomes are wins, puff out your chest and hold your head up high because you are winning the race and your only competitor is that stupid voice in your head telling you that you can't and I promise you THAT guy doesn't know wth he is talking about because that guy has never won a thing ever.",
                            "points": "7 points",
                            "children": [
                              {
                                "comment": "Yea I try not to think too far ahead then I end up fucking myself cause I start saying “wow, I gotta do this, this, and this. All these other people have all these years or experience. I don’t stand a chance”\n\nThen I end up putting myself down and wondering if I even have a chance to make it instead of taking it 1 day at a time\n\nI was a great student up until high school then started falling apart. Now im 27 and soon to be 28 with nothing but retail experience wondering what my purpose is or if I even have one. Its hard to re-wire your mentality when you have been hard on yourself for so long but everything you said is true. I appreciate it. Thank you",
                                "points": "1 point",
                                "children": [
                                  {
                                    "comment": "Don't ever doubt yourself. Be your biggest cheerleader! I am career pivoting at 42 years old. I have gotten to do and see things that amaze people but have never really gone after what I have always wanted until now as my responsibilities kept me pointed in other directions. You are always going to be bombarded with the negative stuff.... and yeah you might just not make it... but the journey itself is what builds who you become.",
                                    "points": "4 points",
                                    "children": [],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "I'm still finding myself after not getting much.",
                                    "points": "0 points",
                                    "children": [
                                      {
                                        "comment": "What do you mean?",
                                        "points": "0 points",
                                        "children": [],
                                        "isDeleted": false
                                      },
                                      {
                                        "comment": "What do you mean?",
                                        "points": "0 points",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "I'm right there with you. I mean I'm older but I have had the same feelings from my life and am going through the same mental thought processes. I've recently put a lot of thought into my overthinking issue that I have myself and came to the conclusion that it certainly isn't a good thing to have in retail. But in IT and cyber? You absolutely are going to need to deeply process content to find the best paths forward!\n\nIt's most definitely a skill and not a curse! But try to stay focused on the day to day and steer yourself properly towards those goals.\n\nAlso, follow what u/External_Chip5713 is saying. They are spot on!",
                                    "points": "0 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "If you're learning, as you should be, you'll advance proportionally to your dedication.\n\nThis is the only part that I think needs a caveat - you won't advance just because you're dedicated or learning. Advancing your career requires that you advocate for yourself, learn to talk about your achievements in a business setting, and actively look for opportunities to jump ship even if you're comfortable in your current role.\n\nIn fairness with today's economy that applies to any role, but it's still worth pointing out.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I’m 50 and going back to school this fall. Cybersecurity has intrigued me for awhile and I’m going for my Associates in it. Would that be enough to get rolling or should I go for Bachelor’s?\n\nThis is all new territory for me.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Unless you've got adjacent experience in IT or some other skill/body of knowledge that'll translate (think law degree or CPA or something) I'd recommend it. If you've already got a degree you may be able to swing it but that's unlikely.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Military worked for me",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I think a lot of cases is people wanting to get in because tv and movies made it feel cool and sexy. And the allure of high salaries. Like the whole craze in the 2010’s when everybody wanted to go to culinary school and be a chef. I was, ironically, a chef back then but I had been doing kitchen work since 2003 and saw all the fad ppl come and go. It’s not like the tv shows in real kitchens.\n\nThe fantasizing is thinking it seems awesome and not realizing that a lot of hard work, long days/nights working/studying and desire go into it. I was lucky and was hired by a private MSP when switching career paths, to do help desk. Made my way to cyber with a lucky offer and learned independently as well as at work. They aren’t just necessarily handing out big salaries for easy, fun jobs.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "I come from a retail background. I am 27 with no degree. I am not looking for a career in cybersecurity but more so a career in salesforce\n\nI am a realist. I don’t expect nor do I even really want a 6 figure position. I just want to have a chance to change my life and career\n\nJust feeling lost and like it’s too late for me",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I'm nearing 40, but I'm only 5 years in. Took me a long time to get here but here I am. Then suddenly everyone I knew who ever touched it was going into security. None of them finished any programs, they all fizzled out",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I get what you’re saying, but it’s all compounded by the entry level salaries. No one wants to study for 4 years and pay 20-30k to get a bachelors in cyber security then try to support their family for 40k a year. And it take a LONG time to get beyond that pay grade if you don’t suck the toes of your seniors.\n\nThe impression of unfairness comes from that. I’m pretty good with cyber knowledge, I understand the concepts and have even practiced them in both cyber and non cyber roles. Still couldn’t get a call back for more than 40k, despite years of experience and all the requisite certs.",
            "points": "9 points",
            "children": [
              {
                "comment": "That's very strange. That's an unusually low salary for a cybersecurity position. Where are you located? My company doesn't even start lower than 95k. That sounds like some awful MSSP nonsense.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "“MSSP nonsense” is the norm brother. If your company is hiring lemme know 😂",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Avoid MSSPs. They're a career dead end. Join a small high growth company with an immature security program and watch your career to vroom.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "I’ll take that into account when I start looking again (right now) thanks",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "then try to support their family for 40k a year.\n\nThat's the neat thing, it's $40k x2 if you're average like that\n\nThe impression of unfairness comes from that. I’m pretty good with cyber knowledge, I understand the concepts and have even practiced them in both cyber and non cyber roles. Still couldn’t get a call back for more than 40k, despite years of experience and all the requisite certs.\n\nIt's not unfairness, it's your coping with your noncompetitive profile.|\n\nThere are security ICs with no certs making 7 figures and security people in management making 8 figures.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "You are correct that it is top heavy but incorrect that it is bottom heavy- the volume of applicants does not necessarily indicate a saturation of talent, ability or skill.",
            "points": "9 points",
            "children": [
              {
                "comment": "I think his point was that there’s an over abundance of people with 0-1 years of experience — those who got cyber security degrees and no internships, went to cyber bootcamps, only got the Sec+, etc.\n\nThose things don’t mean that someone is skilled or talented, but it saturates the early career applicant pool. If you have 100-200+ people applying for entry level SOC positions (especially remote), it makes getting an interview more difficult, even if you are far and above the most talented of applicants.",
                "points": "21 points",
                "children": [
                  {
                    "comment": "Yeah, as somebody who's in their first cyber job with no college degree and just a sec+, it aint easy.",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "Hey, the first one is the hardest, so congrats! Stick with that job until you have a few years of experience and/or until you find another role to pivot to and you’ll be well on your way.",
                        "points": "6 points",
                        "children": [
                          {
                            "comment": "Oh definitely. I'm trying to leave a good impression so I get converted to salary. Right now I'm trying to get used to the tools my org uses, chiefly crowdstrike",
                            "points": "3 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Yes, what we look for is differentiation. When you have a large pool of applicants, it actually becomes slightly easier to stand out if you know what they are all saying. I've given advice on this in other posts, but bottom line is; build your personal security \"brand\" (not as an expert, but as a student) using github, blog, youtube, events, twitter, whatever. It can anonymous or not, the point is I want to see engagement with the subject matter. Demonstrate its a passion for you, because most candidates are rejected because they seem to be \"tool operators\" rather than cybersec passionate juniors, eager to get their career going. Have an honest discussion with yourself, if you are not spending free time learning about your career trade only 1 year into it, maybe its not for you and you should not expect much success.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Dude, how are you finding these old guard folks? Im dying to meet them old heads and get their knowledge. Im coming in as staff but i also work mostly SMB and startup. Are you in the big corporation side?",
            "points": "0 points",
            "children": [
              {
                "comment": "They burn out after a decade of industry experience and GTFO.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Not all of us.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Huh, the FAANG CISOs sticking around for $10M+ paychecks seem do be doing ok",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Absolutely as someone that’s never held a job in IT other than doing favors for people and getting underpaid. There is rewards if you’re willing to put in the effort. I’ve spoken at a couple of conferences. Helped start a infosec student origination nearly a decade ago. Been to defcon twice. Met every hacker I ever wanted to. And am still so disgruntled with the state of the industry it’s easier to just watch the shit show.",
            "points": "-7 points",
            "children": [
              {
                "comment": "The reason I'm downvoting you is because you didn't succeed despite following a set formula.\n\nYou need to understand that the world has no rules and that those of us who DID succeed didn't succeed by sheer will or talent, but by luck.\n\nYou didn't get lucky. & instead of me acknowledging my own luck, I'd rather feel better about myself and downvote you.\n\nSo EAT THIS, pissant!\n\n- everyone on reddit in 2024",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Ok. Enjoy taking out your shit on me. I enjoy ranting. I’m not mad at infosec it’s always been a passion of mine. I just get wrapped up in shit and burn out quick.\n\nI do have to say I like you have an explanation for being an asshole that’s new. Still not sure what formula you are talking about but it’s ok. I don’t care enough about your opinion.",
                    "points": "-5 points",
                    "children": [
                      {
                        "comment": "The person you are replying to isn't shitting on you, they are agreeing with you and sarcastically explaining the though process behind the people who ARE downvoting you.",
                        "points": "5 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Made some edits for you you can use this comment for another downvote. Also it takes balls to speak on behalf of every user. I’ll commend you for that. The most baffling thing is why you would see me as a failure. I’m enjoying my life.",
                    "points": "-6 points",
                    "children": [
                      {
                        "comment": "whoa bud, I'm just like you, have you seen my account history? Everyone hates me on this website. My comment was intended to make you see the ludicrousness of how you're being treated. I hope you can see it that way if you re-read it. Let's be friends.",
                        "points": "-2 points",
                        "children": [
                          {
                            "comment": "I try to be friends with everyone but sometimes I get angry. Did I mention my only hobby this year is yelling at strangers on the internet?",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "A notable challenge is that some businesses don't prioritize security, affecting both hiring and compensation in the field.\n\nThis is and will always remain the biggest hurdles.\n\nWe have to look at it from the business owner/CEO perspective, does cybersecurity improve the profit margins, and shareholder value?\n\nNo, not directly. Because if we do our jobs properly nothing happens and they feel like they're wasting their money. We're a 'cost center' in the budget. So cost centers are always underfunded and under prioritized.\n\nThat is until the day, you get breached or ransomed. A lot of these folks don't see the value in dropping a couple hundred grand on hardware, software and services, plus personnel to prevent that until they can't process invoices and get paid.\n\nEven then they don't get it.\n\nWhat ever org needs is an executive level evangelist to promote how cybersecurity actually improves the bottom line, as well as the value of the organization.\n\nI work in the M&A world and every single due diligence I go through there's a section on cyber where they pick apart the posture of the orgs and the history and these things have a direct correlation as to the value of the org being acquired.",
        "points": "47 points",
        "children": [
          {
            "comment": "I think this is changing over the last 5-ish years. I would argue at this point the blame is not on the companies not prioritizing it, but the security departments not articulating the business risk efficiently. Its not that boards and business owners dont care about security, almost any of them that you ask will tell you they do. Its that they have no way of conceptualizing how it impacts their business other than some tech nerd saying \"If shit hits the fan we're all going under\". While that may be true, thats not at all helpful to an any exec trying to allocate funds. Security risk needs to be quantified just as any other business risk. Once it is, you will find the funding is there. If the risk is never quantified, then the department will be constantly underfunded, and imho, will be inefficient at the use of funds that they do receive.",
            "points": "12 points",
            "children": [
              {
                "comment": "Good points. You also need to do a qualitative analysis too, because security impacts how people work and we need to address that as well. Like when I had to explain to my CFO that the DLP in MS365 forcing a 2 factor response for EINs being sent out and SSNs was a good thing and he wanted it lifted for him, to which I said absolutely not and I don't care how much of a PITA it is. lol",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "This is so interesting to me as a UX designer who is curious about cybersecurity and the, well, security it may or may not offer.. I am tired of being in a field that companies don’t see the value in. Constantly explaining the value of UX to businesses is draining, and in the end when it comes to layoffs designers are quick to the chopping block.\n\nI thought cybersecurity would be a much more stable field because of the risk involved in not investing in some kind of security measures. But then again, nothing surprises me anymore. I suppose CEOs/shareholders might view most teams as disposable if they aren’t bringing in more $$$.",
            "points": "1 point",
            "children": [
              {
                "comment": "In my experience being an 'expert' in cybersecurity will provide you a lot of job security, however you will be constantly underfunded, undermined and under resourced because of the perceived lack of value to the org.",
                "points": "6 points",
                "children": [
                  {
                    "comment": "Thank you for your insight!",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "UX and Cybersecurity are both great skills to have, and if you can navigate both worlds, it would probably give you a unique value proposition the more innovative types of companies. I wouldn't say that your traditional huge corporations are going to go for it, but one of these hotshot new (relatively speaking) companies sure might. Security can also be a hard sell to the C-suite, though. That's another so-called soft skill that would set you apart, being able to translate technical jargon into corporat-ese (the kind of things they learn in an MBA program at Penn or something). If nothing goes wrong, and the security mechanisms all work, then you don't get a pat on the back. It's kind of a thankless field in that regard, so be ready for that. Still, if you can speak to senior executives (or entrepreneurs who are starting something new), then you could make a decent path for yourself.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "What you're seeing in the UX world is a natural correction from pandemic ZIRP free money world. UX value is finally correcting to what it's actually worth, not what big tech can pay when 5 year corporate loans are virtually 0%.\n\nNobody is undervaluing your labor now, it's just come down from the delusions of 2020-22.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The average infosec person's salary in this country is $110k while the medial individual income is around $50k. On average you are paid more than double normal people, so it seems like companies value your labor enough to pay you more than double.\n\nWhy do you think you deserve even more, while being a cost center? The profit centers (the warehouse laborers on the floor moving heavy packages by hand for 8 hours a day) make the company money, not you",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Been in the game for over 25 years. There will always be work for talented people. The people that get into it just for the paycheque are the ones who tend to get disgruntled or frustrated.\n\nI remember the IT crunches in the late 90s. Talented people generally didn't stay unemployed for too long, it was the quick-buck-people that left the field.\n\nWe get people applying who have installed Kali in a VM and think that's their meal ticket. They're in for a rude awakening.",
        "points": "118 points",
        "children": [
          {
            "comment": "The people that get into it just for the paycheque are the ones who tend to get disgruntled or frustrated\n\nThis is the issue. Market looks saturated but as you said its people that go on like TryHackMe and get in the 1% after a month or install a VM and think psshh this isn't shit. Then realize they have to constantly take classes (Certs), learn other stuff and expand their skills and they just don't have that kind of investment in it. They just want a hefty paycheck. And they end up dropping out after a while that's why there's a lot of \"im burnt out what are my other options\" post on this subreddit.",
            "points": "33 points",
            "children": [
              {
                "comment": "Nailed it! I’m in my late 50s. IT and security is pretty much all I’ve ever done since the 80s. Learning in this field is non-stop. Tried my hand at management for about 3 years and realized meetings, budgets, Powerpoint, Excel, etc. was terrible for me. \n\nDid a lateral hop back to a senior pure tech role and love every moment of it again.",
                "points": "22 points",
                "children": [
                  {
                    "comment": "You've seen it change a bit more than me (mid 40s here, been in the industry since the mid 90s). The philosophies change, but the basic need is always the same. Bad guys want to steal stuff, and someone has to prevent that. We've come a long way from the barrier reef model in the 90s, and whatever you were working with in the 80s, and now AI is going to saturate everything from authentication and authorization to policy writing.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Same. Except I thought project management was the direction for me. Now I have an engineering role and feel like I’m where I need to be. I still make mistakes, forget ports and cringe when I see ancient legacy solutions still operating. My advice is to understand the basics of networking and programming. And ride the wave of whatever initiative/project/solution comes from ELT.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Continuous learning is part of most IT jobs.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Valid but I feel the people who do not even a bare minimum is more present in cyber. Also its easier to get on the job training or experience in general IT. The starting point are things like help desk where knowledge isnt expected. Even in SOC roles you should know networking principles, common attacks, etc. Its not really entry.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I was taking classes and giving talks at conferences and still have never held an actual job in cybersecurity. It was always a hobby to me. I’m now 41 and have enough knowledge to be dangerous. Wish I had stuck with this passion as kid instead of letting the police scare me away from computers. But it is what it is. People just need better OpSec in general. It should be taught at an early age and reinforced.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Yea the problem is with kids it starts with teachers. I worked at a school district basically by myself and managed 3 schools as a sys admin for a while (my manager was caught on camera smoking weed with a friend in front of the school many times, why I say basically by myself).\n\nI tried to teach them, make educational content, etc. The teachers were like fuck it this kid is bad here is the password for the teachers wi-fi and they would do whatever they wanted. Or the teachers would just be like my job isn't IT i refuse to participate in your security courses (I was required to teach these multiple times a year and had a turn out of less than 20% each time but had means to enforce a larger turn out).\n\nSo yea I agree especially in todays world we should be teaching good fundamentals early on but it wont happen until the teachers and administration get on board which is difficult.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Every single new graduate I’ve talked to has absolutely no clue how to actually work in cyber. They may know some buzzwords, can install Kali and do some metasploit and shit but as soon as an incident happens they’re lost. Don’t know what to search for, don’t know how the operating system works so they can’t find forensic evidence, don’t know powershell, don’t know basic encodings, they’re just skript kiddies looking for 6 figure jobs.",
            "points": "20 points",
            "children": [
              {
                "comment": "It’s because Cyber is very difficult to just jump into and a ton of people are trying to do just that. It’s like trying to be a restaurant pastry chef without knowing the basics of being a line cook.",
                "points": "12 points",
                "children": [
                  {
                    "comment": "That's a clever way to put it.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Do you have any advice on getting out of that category? I’m not employed in cyber but I am trying to learn and I don’t want to fall into this category.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Self host fucking everything. You have to understand how to administer a system and understand it before you can secure it. That is, to be a security engineer or analyst. I started by just self hosting some simple apps like Vaultwarden, nextcloud, gitea, Minecraft etc and read all the docs. This will get you experience with web apps and how to secure them such as security headers and access control. Then I stood up splunk and began ingesting my logs into Splunk, extract fields and build out alerts and dashboards for my own environment. This let me understand syslog and SIEMs. Nextcloud gave me an intro into database administration and SQL to understand risks associated with these services. Once you understand the app, you can begin to picture the risks associated with the apps and begin building solutions to patch or alleviate the risk.\n\nBuilt some Minecraft plugins utilizing SQLite databases, performed sql injection testing and found it vulnerable so I went back and fixed my code. The key to cyber is you really need to understand a large amount of things to be successful otherwise you can pigeon hole yourself into a certain role. Another HUGE thing starting your career is don’t be afraid to be wrong. If you are thinking something say it and ask questions to those that have more experience. This is how you learn, I’d rather be wrong and know why then not say something and never know if/why I’m wrong.\n\nCyber is really designed to be a mid-level career step for those that stated in IT, if you don’t understand how servers interact, how transport and application protocols work, or don’t know where to find logs for a device you’re never going to be able to secure it",
                    "points": "28 points",
                    "children": [
                      {
                        "comment": "This is the best advice, and I just want to add my opinion of one of the fastest paths as to what to self host.\n\nSet up pfsense, preferably as your edge router.\nInstall splunk with the pfsense TA so that you can skip parsing logs manually for now, but ingest the pfsense logs.\nStart building queries that could be used as alerts by trying to find nmap activity and recreating queries other people have made.\nTake a step back once you're into this process, and restart by learning to use a type 1 hypervisor like xcp-ng or proxmox that you can install on some old hardware if you didn't already start that way, so that you can self-host more seamlessly.\nset up elastic and install the agent on the endpoints, dig through the alerts(they will almost surely be false positives) and ask yourself 5a. Why does this query think there could be something malicious happening? 5b. Why did the activity happen that triggered the alert? 5c. Why is the activity that triggered the alert not malicious despite fitting the criteria for the query?\n\nIf you can answer those 3 questions for network and EDR contexts, you're already ahead of most people with a cyber security degree IMO.\n\nEDIT: Autocorrect is trolling me hard today.",
                        "points": "9 points",
                        "children": [
                          {
                            "comment": "The problem with using SIEMs and EDRs and other enterprise tools for your own self-hosted environment is there is really nothing interesting to monitor. You have to almost purposefully set up your homelab wrong, or just host any crap you find on the internet, to get any alerts that you can really dig into. There's such a huge difference in a giant enterprise spaghetti network with dumb users, and a network designed from the ground up by someone interested in cyber security. Most of these enterprise security tools are just sadly not relevant for a homelab - which makes transitioning into a security role (where 99% of positions ask for experience with these tools) so hard.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Are the new grads you're talking to computer science majors that went to a good school? Or are they \"cyber security\" majors",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "because when you started, you knew it all...",
                "points": "2 points",
                "children": [
                  {
                    "comment": "No but what they stated is how you learn. You can get plenty of free equivalents and teach yourself whatever. Even niche stuff like caldera for purple teaming is free.\n\nBut you have to be willing to learn.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "By talented do you mean naturally gifted or people who are good at cybersecurity in general?",
            "points": "2 points",
            "children": [
              {
                "comment": "People who are natural problem solvers or like digging into things to see how they work. That curiosity is something you’ll find in most of the good people. \n\n At my work someone who can read some disassembled code is much more useful than someone who can only run nmap in a GUI on Kali. That requires a certain level of knowledge and inquisitiveness that most don’t have.",
                "points": "13 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "There's no such thing as naturally gifted in the capacity this comment is taking about",
                "points": "12 points",
                "children": [
                  {
                    "comment": "Nope no one is born with magical abilities. What the general public perceives as talent, nack or natural ability is just a human brain that has already consumed the necessary stimulus prior to measurement and is therefore more prepared.\n\nUsing words like talent etc is just lazy and causes significant damage to people who think they can't do something or be as good. The only real point that can be made is individuals who learn something at a younger age (this includes development of skills like critical thinking, continuity of thought and creativity) have the benefit of increased brain elasticity and social freedoms (kids are free to just learn and don't have to make logistical decisions like completing tasks most conducive to paying rent as apposed to developing capability)\n\nBasically stop saying I can't do it because I don't have magical talent and start learning.",
                    "points": "8 points",
                    "children": [
                      {
                        "comment": "The whole talent thing is actually what made me depressed for some time. I'm over it now, but this post along with completing my first box in htb helped. So thank you.",
                        "points": "5 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "You can't seriously deny that some people are just born smarter and more capable than others.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Oh.Thank you.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Been in the game for over 25 years. There will always be work for talented people. The people that get into it just for the paycheque are the ones who tend to get disgruntled or frustrated.\n\nI would challenge the last statement, this has shifted now. 30 years ago the best and brightest talent went into finance or consulting. 20 to 10 years ago it shifted to tech, whether it be software engineer or product. Now it's security engineering.\n\nMeaning the best of the best in the field would have been vanilla SWEs or PMs at top companies in 2015, but are now choosing to go the security engineering route because of the market demand.\n\nThe 2024 security engineer new grads at top tech companies and HFTs would've been quants or pure SWEs a decade ago",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "[deleted]",
            "points": "2 points",
            "children": [
              {
                "comment": "Thats got nothing to do with actual cyber and security.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Define cyber and security in your own words please.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It's not saturated. In my opinion, the qualified talent isn't there yet.\n\nMany businesses still don't care about cyber other than the bare minimum. Lots of education to do.\n\nCyber leaders need to speak the language of risk and business alignment, not just shiny whiz-bang new tool with AI/ML. Justify the expense.\n\nCyber governance is woe-fully lacking in nearly any/all orgs that I work with. Cyber and IT governance is a huge overlap.\n\nSecurity, unless you're in AWS or a service provider, doesn't move the needle like gaining customers and improving margin. It's a margin drag -- Security needs to show value and operate as lean as they can be while being effective. Speaking that language is critical.\n\nSOURCE: Cybersecurity consultant.",
        "points": "25 points",
        "children": [
          {
            "comment": "Do you mind going into lack of cyber governance in a little more detail? \n\nI think it's about to be a deciding factor for a lot of organizations given supply chain requirements and broad reaching FAR clauses.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Security, unless you're in AWS or a service provider, doesn't move the needle like gaining customers and improving margin. It's a margin drag -- Security needs to show value and operate as lean as they can be while being effective. Speaking that language is critical.\n\nTop tech companies that aren't IaaS prioritize and pay very well their security engineers. This just isn't true.\n\nMeta, Snapchat, and Netflix are some very, very high payers to security talent.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "cybersecurity will continue to be a growing, in demand field as long as cybersecurity regulation continues to expand.\n\nI don't see regulation slowing down any time soon, the EU is a harbinger of things to come.",
        "points": "68 points",
        "children": [
          {
            "comment": "I don't think even regulations has to grow for demand to remain, simply speaking the criminals will regulate and drain the company's of money if they don't have security. Its kind of funny if people couldn't get impacted, but that simply as criminal cost company's money at some point it becomes cheaper to hire security to save money. Same concept with security at a casino, you don't want none, but you don't need an army either, you want the minimum amount to stop people from robbing you, so only the company's that spend the least or are the least effective with their money will get hit (as there is really not much to gain from hitting up common users).",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The SEC reporting requirements will a significant impact on security budgets and spending. The first company to have a material financial penalty for failing to report to the SEC will snap a lot ELT & Board heads.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Regulation? What did the UN decide in their ad-hoc committee this year? From what I watched on YouTube and read it looks like they just spent a lot of time and money to say cyber crime is real we really don’t know what to do about it.",
            "points": "-28 points",
            "children": [
              {
                "comment": "The UN isn’t a regulatory body but the EU is and they have pretty extensive regulations. GDPR is huge even if you aren’t located in europe too",
                "points": "24 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This is like asking if they are still going to have door locks in the next decade.",
        "points": "20 points",
        "children": [
          {
            "comment": "A lot of door locks now are like, IoT nonsense you can unlock with your phone so even those are cyber security related.",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Never heard of them. What’s a door lock. ;)",
            "points": "-2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Up until last year, I would have said that Cybersecurity jobs were only worth the work if the organization was serious about cybersecurity. Otherwise, you were a scapegoat when a breach happened. Organizations were not serious and did not spend the money to build or maintain a cybersecurity posture that was worth a crap. The fact that news reporting cared if a company got hacked or not did not help.\n\nNow, I think that is changing. I think Cybersecurity is getting more and more serious view from a national and global view. More and more government organizations are creating privacy and reporting laws. The United States Federal Government has changed it's view (Executive Order on Privacy and SEC requirement for reporting breaches). If the United States were to pass something like the EU's GDPR, you will see many new cybersecurity positions be opened and a lot more money spent in the cybersecurity realm.",
        "points": "18 points",
        "children": [
          {
            "comment": "I see this happening",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Also, since public companies now have to report whether or not they have cyber expertise at senior management positions (c-suite, board, etc), the ones without them (such as the ones without a CISO, etc) are going to look weaker to discerning investors. Of course, half the CISOs I've known were underqualified, wide-eyed with panic, and just trying to keep their heads down into the realm of a department IT manager or something where they could get their hands dirty in a comms closet from time to time. They were like lambs being fattened up for a slaughter.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I agree with you and raise with the SEC reporting requirements.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It's saturated in people who want to work in cyber security. Dry as bone in people with the capability to work in cyber security",
        "points": "32 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think IT in general has a massive amount of saturation\\abundance of people at the bottom, and this is also true for cybersecurity. I do think though that both IT and cybersecurity in general will be in great demand, and there is gonna be no end to the work load. In terms of right now, I think we are just seeing the contraction that we saw in 2001 (I wasn't in the field back then, heck I was in grade school) but I think that is what is occurring right now. For the future in terms of IT in general it will be booming, as I have noticed that new users (meaning younger) aren't as skilled with computers of when I was their age (cause technology has gotten easier to use), and cybersecurity will always be in demand cause there will always be criminals and no true endgame to this field.",
        "points": "9 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"the reality is that fewer individuals successfully obtained certifications, stuck with it, and secured cybersecurity positions.\"\n\nIs it more difficult than becoming a competent full stack software dev?",
        "points": "8 points",
        "children": [
          {
            "comment": "Is it more difficult than becoming a competent full stack software dev?\n\nIt's infinitely easier. Being a true, competent SWE is many orders of magnitude more difficult.",
            "points": "1 point",
            "children": [
              {
                "comment": "Thanks for responding. Can you elaborate further?\n\nDo you have experience with both careers or skill sets?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Certifications are just a pain in the ass to me. I don’t bother getting them because I don’t have a job that requires them. I no longer really want to work in IT as getting an actual job that isn’t underpaid helpdesk and would hire someone without a security clearance and a criminal record just wasn’t worth it. I turned down some offers because I just didn’t think ethically I could defend companies that I disagree with their business practices. (Ie Raytheon and booz Allen Hamilton). Both companies that still try to hire people at cybersecurity conferences.",
            "points": "0 points",
            "children": [
              {
                "comment": "You are based WTF is happening with these people downvoting, you are in infosec and you so conformist with this shit system. Now about the certs. Its more important networking to get your first job Tbh.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Yeah I’m old I’m still not sure if based is meant to be offensive or good. I hate being a conformist. I consider myself a crypto anarchist and have very strong feelings on things I guess.",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "They are capable to sell their own asses in order to get a jr position in shitty companies. I see this very often in infosec related subreddits. Pretty ironic.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "Exactly. It’s a bunch of skids that talk not real players. I’ve been out of actual infosec work long enough I couldn’t care less I just like to stir the pot sometimes.",
                            "points": "3 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Ive seen a few things, there’s always jobs, but not always jobs people want to do. I graduated during the summer of 2020 and the lockdowns and I took the first job I could get, which was nights weekends in a SOC. When I graduated, you were required to take two levels of networking classes(CCNA, and CCNP Security). Now the most recent graduates from my university didn’t take any networking classes, and were told you don’t need to get any certifications, except for the CEH, and go directly to become an ethical hacker. I understand from the universities perspective that this is more flashy and can get more people into the program, but it feels like I get rich quick scheme. None of these kids come out of college with any practical knowledge and all of them are told to expect to be paid north of 100k for being a pentester. There arnt near as many pentester jobs, and those that do exist don’t want people who have a CEH.",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think it’s hard for those with no experience to start working and lots of people want to get into the industry! However, I don’t think that necessarily means it’s saturated because most employers would love to grow their SoCs and security operations. In my current job and in the places I’ve interviewed with there are definitely a need for competent and experienced security engineers!\n\nI’m very optimistic about the future of cyber security because many companies are getting popped all the time and there will always be a need for good, security-minded engineers.",
        "points": "6 points",
        "children": [
          {
            "comment": "My morals and ethics make it hard for me to work for companies that I disagree with. And since most companies willing to fork out decent salaries are government contractors in some shape or form I can’t bring myself to pursue those jobs. It’s like when “ethical” hacking became a buzzword. A malicious actor is technically still operating ethically. He just has different ethics.",
            "points": "-3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The next stage of war will be cyber attacking critical infrastructure. We haven't even scratched the surface.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "How do you feel about the future of Cybersecurity?\n\nHard to tell, things change so quickly\n\nIs the cybersecurity field genuinely oversaturated?\n\nIn certain areas, yes. In others, no. It depends what part of the field. Definitely oversaturated for the early career roles. Mid level seems to be undersaturated. Senior level seems to be a little oversaturated as well.\n\nWhile there was a trend of quick six-figure promises in IT, the reality is that fewer individuals successfully obtained certifications, stuck with it, and secured cybersecurity positions.\n\nWho sold you that? Was is the cert companies, bootcamps, and others who seem to benefit from selling you this vision? I've been in the field for ~4 years, haven't broken 6 digits yet 🥲",
        "points": "5 points",
        "children": [
          {
            "comment": "US or UK? I know GRC consultants on 70k+ GBP with 2 years experience. I broke 6 figures GBP working GRC in a specific highly regulated sector in 4 years~.",
            "points": "2 points",
            "children": [
              {
                "comment": "US",
                "points": "0 points",
                "children": [
                  {
                    "comment": "That’s interesting, what role? See a lot about big wages in the US.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Security engineer at a MSSP. I know I could make more money if I made a move but my work life balance is hard to beat. WFH, set schedule. Very little stress",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Senior level seems to be a little oversaturated as well.\n\nYep, I'm seeing that also. I think part of the issue is since the senior level salaries are so high, they probably get many unqualified people applying who embellish their resumes which makes it harder to screen and hire the qualified applicants.\n\nI've been applying to director/manager positions for months and it's been nothing but a waste of time. I am qualified and educated with advanced degrees in Information Security, 2 decades of experience, and multiple well-respected certifications.\n\nMy prediction for the industry at large is that cybersecurity salaries will be trending downward and AI will begin replacing humans in large sections of Cybersecurity field over the next 5 years. Entry to mid-level GRC and SOC roles will be hit the hardest, technical skill sets will still be in demand.\n\nLuckily I have a good reputation and some connections so I've had no trouble staying employed with a healthy salary. Trying to get a senior position that pays well without someone on the inside who knows my value hasn't gotten me any offers and only 2 interviews in the past 6 months. Good luck out there folks.",
            "points": "1 point",
            "children": [
              {
                "comment": "God speed and good luck! I've definitely found the best success with landing roles through my network, bc I most definitely don't have the best experience - I'm pretty avg if I'm being honest lol",
                "points": "2 points",
                "children": [
                  {
                    "comment": "ALWAYS. BE. NETWORKING.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Who sold you that? Was is the cert companies, bootcamps, and others who seem to benefit from selling you this vision? I've been in the field for ~4 years, haven't broken 6 digits yet 🥲\n\nNew grad security engineers at any real tech company. Up to $250k base salary starting at Jane Street.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "there's no way top cyber talent is over saturated. threats are everyday. (i'm not in technical cyber, in the grc side) and i recognize the baseline talent you need to be in top cyber. It's essentially computer science and as far as electrical engineering, and more.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Entry level roles are over saturated(which you can see by the hundreds approaching on thousands of applicants to those roles) but the second you start narrowing down to mid/senior level with a specific niche, most of those positions have under a hundred applicants.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I feel very good about the future of information security! I am hopeful that soon the people who entered the field for a paycheck without having any passion for the mission will depart towards whatever new shiny thing they can find, like AI or somesuch. And I am hopeful that we can continue to marginalize the whiners who don't understand that the real world involves tradeoffs and make simplistic rants about business leaders not caring about security or how security would be solved if only everyone listened to their shallow and impractical ideas.\n\nThen the rest of us can focus on the real work of making companies and organizations safer in the face of significantly increasing threats. There will continue to be a good payday and an intellectually interesting job available for folks willing to contribute to that.",
        "points": "4 points",
        "children": [
          {
            "comment": "Well said keep pushing that security :)",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This is asked every day. Stop asking it. It's getting annoying now.",
        "points": "7 points",
        "children": [
          {
            "comment": "Same with \"but aren't you worried about AI taking your job?!\"\n\nI've left + muted a few subreddits due to how often that question comes up.",
            "points": "3 points",
            "children": [
              {
                "comment": "But really i don't want to annoy or offend anyone but what about jobs in future will ai take all jobs as they advance rapidly especially cybersecurity jobs?",
                "points": "0 points",
                "children": [
                  {
                    "comment": "I don't care? At this point, what am I supposed to do, become a plumber?\n\nI'll deal with it if it happens.",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "You are right we can't help it:(",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "The people who bang the \"AI will put everyone, especially technical people, out of a job within a few years\" drum the hardest, in my limited experience, tend to either not be technical people themselves (and are just regurgitating what they've read on the internet) or have a profit incentive to make AI sound more capable than it is, or will be within the near future (like NVIDIA's CEO, who thinks kids shouldn't bother learning to code anymore).\n\nEither way, if it happens, it happens. Best you can do is try to get in \"while you still can,\" however long that window is, and make as much money as you can.\n\nIf you're still super worried about job security, try to get a role that will sponsor a security clearance.",
                            "points": "3 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Who protects that data the LLMs are trained on? Who sets up the infrastructure or compliance when a random dev team uses an AI tool? Who implements the compliance that the AI tools are checking?\n\nIt’ll automate a lot of things, but the beginning and ending points with AI like need humans to check for quality and context for now. We are likely more than a decade away from being able to trust AI with important infrastructure or key calculations imo.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "But my takeaway is that cybersecurity can't be trusted with AI because malicious actors use social engineering to confuse and bypass security and they can easily fool AI",
                        "points": "-1 points",
                        "children": [
                          {
                            "comment": "Security teams are testing prompt engineering as much as they are any other production code. Security has a strong say in this at good orgs.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I mean, if cybersecurity analysts are screwed everybody is screwed. In my opinion, cyber is probably a relatively safe role. Why? If organizations are going to use AI to protect their assets in this magical world, what will bad guys do? Use AI.\n\nThe first dominoes that will fall if you ask me will probably be coding. We already see some automation for mundane scripts. It is not unlikely that in 20 years, you can tell an AI with a few parameters to write code for a program. The more a human has to ineract with something, the less successful AI will be. IT and cyber is where I'd hide if I was scared for AI consolidation. Im not that scared though, because if I was I'd be doing construction.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Yeah coding is gone in my opinion because nobody cares about your code if it works fine with minimum bugs.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "Yeah. I think we are a long ways off from AI taking over, and it should be a gradual process. AI should be no worse a problem then our jobs being shipped overseas",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Saturated? For the best part of a decade theres been a skills shortage (well, imo a training shortage). I've not been as close to that recently but I know in the UK at least hiring for some roles has been a challenge.\n\nNot prioritising security isn't a new problem either, you'll find many firms don't do so until they've been hit. (See NHS UK, Talk Talk and a plethora of other businesses that took a hit, then suddenly started hiring Security Staff). The biggest issue then, and is now, is Security is a cost centre & a cost prevention centre. We don't generate profit, we prevent loss. So trying to demonstrate that to those with the purse strings is invaluable, if you've got directors/heads of that can't articulate that effectively youre gonna have a bad time driving security as a focus in that business.\n\nAs for certs, I dunno, I've worked in IT for 20 years, 10 of that in Security and I hold a grand old total of fuck all certifications. I know they are a requirement for some roles (Such as Government ones) but things like CISSP, CEH, etc have lost their value over the years with the exception of maybe something like OSCP. At least in the UK and in my sphere anyway.\n\nQuick google of 'cybersecurity skills shortage' and there are a plethora of articles, including \"4 million shortfall\" which is pretty significant. https://www.csoonline.com/article/657598/cybersecurity-workforce-shortage-reaches-4-million-despite-significant-recruitment-drive.html",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "From current view of cybersecurity, it seems that the number of job positions are increasingly available since many professionals are quitting the industry day-to-day from stress issues. The workload will be very heavy since there will be many more technologies to be studied for ensuring security of information. Still cybersecurity will be in demand regardless of the downsides of being in cybersecurity.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just like many fields, cybersecurity will ebb and flow when it comes to \"saturation.\" Future-forward aspects of this field will relate to OT and AI. Security concerns with OT are HOT right now; especially within manufacturing and utilities. Their goal is to keep operations safely uninterrupted, and the challenges abound there. Utilities, for example, need expertise with legacy systems, as well as digital transformation to update networks. Adversaries are constantly hammering away at critical infrastructure. AI is causing its own plethora of security issues, and it's moving at blinding speeds. \"Cyber,\" as a broad field, is not yet saturated, and the more targeted you are in your own certifications and career searches, the more valuable you are to an organization.",
        "points": "2 points",
        "children": [
          {
            "comment": "Well said",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "My hope is the rush to AI will create more jobs and help the entry level folks in the door.\n\nAI will have its own risk, infrastructure, maybe even regulating bodies to dictate how it and the data it uses should be secured.\n\nWhere I live there is a TON so senior pentesting jobs with no one to fill them so the skill gap is still present but only in the experienced side of the coin.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wanting to get into cybersecurity and actually acquiring the knowledge and skills to be able to do so are two very different things. Many people are sold a pipe dream of “if you just get these certs you’ll be on the gravy train of working remotely and making six figure income without having to do a whole lot of actual work.”\n\nI’ve been working and studying for career change over the last 2+ years. Preparing for GPEN certification over the next couple of months and despite exponential increase of knowledge and skills that I have gained I realize that I have only began to scratch the surface and see myself continuously learning and gaining new knowledge and skills until I decide to retire.\n\nThe future of cybersecurity means that many who are in cybersecurity need to continue to learn and adapt and that all these “cybersecurity training” and bootcamps scams will cease to exist in 10 years once people realize you can’t learn cybersecurity in 6 to 12 months enough to actually land a remote job that pays 6 figures.",
        "points": "2 points",
        "children": [
          {
            "comment": "I'm in the same boat.. Except I'm focusing on pentesting. The more your learn the more you realize you don't know anything. I'm definitely aiming towards remote but I'm realistic. We are moving to a rural state in 5 years which is why I'm focusing on something I can do remote. I am not going to do a boot camp but I think they do hold value.. You just have to manage your expectations. You're right, most people won't finish and land a 6 figure job the next day. But they might! I know people who have done it. Confidence, passion... They come into play too. I don't see this industry drying up anytime soon, but I do think cyber has a high burnout rate.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I didn’t make six figures until my first cyber security role about 9 years in. And even then I’d argue I got that much because they saw value in my development and DevOps background. It was less than DevOps positions would’ve paid (I was at a non profit previously) but with no on call outside of emergencies",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Really excited for quantum computing to destroy everything",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think a bunch of people in tech are getting layed off, that know a lot of deep dark secrets.\n\nThere was an article here what two days ago about security guys turning to crime.\n\nPoint - things don't get better because you let a bunch of people go. There will be a consequence. The need for security will only increase.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s filled to the brim with people without experience wanting jobs that require a lot of experience.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Microsoft source code vulnerabilities exposed by nation states are exploited in the largest 3rd party risk management nightmare ever, disabling western economies and governments.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Q: Is the cybersecurity field genuinely oversaturated? \n\nA: Absolutely! The entry-level positions tend to be quite saturated, but after gaining around 5-6 years of experience, you'll find the competition starts to thin out significantly. Just my $0.02.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have to break it down to help show where it’s saturated.\n\nCredentialed no experience Experience in tech, no credentials. Experienced in tech and security Credentialed experience in tech Credentialed experienced in tech and security\n\nExperience in tech mean you were like a dev, IT sysadmin, or something in those veins. Security experience is information security experience.\n\nThe over saturation is in credentialed no experience. Those folks need to go work as help desk, sys admins, entry level devs, or QA. Generally anything entry level where you get exposure to standards and tech.\n\nThe reason is school and boot camps are being pushed hard. Generating folks with high expectations and no experience.\n\nI’d say three years ago those folks got hired asap because most people didn’t have proper credentials pre pandemic. So getting a cissp was a big thing even with folks with experience.\n\nNow that things are cooling off and people are being laid off, where there is an opening- organizations are looking for certain things to further qualify candidates. So no, it’s not fully over saturated. It’s just over saturated with folks with no experience.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Was a contractor at BT and slowly becoming deskilled, could not get a gig with any of the big names.\n\nTook a huge paycut to work for a tiny pentesting company to get back in the game (80ish > 26k). Got back up to speed.\n\nNever really been one for certs, just relied on experience, but did put the graft in to get GXPN.\n\nNow director of a small cyber sec startup outfit. Earnings are tiny again, all my savings gone. Slowly starting to make a bit of headway. Hopefully will turn out ok!",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Maybe it’s time for us to switch to cyber offensive.\n\n(I’m kidding before anyone loses it)",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just a quick reminder to everyone reading this.\n\nYou absolutely do not need a degree to work in this field. Do not let others, recruiters, and or HR people gatekeep this field.\n\nI do not have a degree and I was able to get a job as a Security Analyst, went into Incident Response, and now have a cushy high paying Security Engineering job.\n\nIt is definitely not an easy gold rush field where you come in and get a shit ton of money and end up in a cushy job fast. You will have to give it 110%, earn certs and fill out a whole lot of applications in an insane job market, but it is possible.\n\nAs others say a degree can help or maybe put you up higher in the hiring pool but it comes down to your skillset, not JUST getting and or having a degree.",
        "points": "1 point",
        "children": [
          {
            "comment": "Thank you for sharing I guess my question is, how would you showcase your skill said and a CV or interview?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Job security is better than a nun's",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Don’t focus on cyber security. Focus on digital forensics as a whole then cyber. Easier to get into a firm or company when you can do both. Most forensic examiners can do both cyber and deadbox. Ask a cyber guy to do forensics on a cell phone they will probably forget a chain of custody and all the very basic things. That will get them hemmed up in a litigation case.",
        "points": "1 point",
        "children": [
          {
            "comment": "I do forensics now for a PI and a law firm. I actually applied for a PI license recently. I'm starting to lean into cyber though. The two fields intertwine well.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "No. The answer to your \"Is the cybersecurity field genuinely oversaturated\" is NO.\n\nToo many people applying for a job is not a thing I care about. Too many \"GOOD-FITS\" applying for a job is something I'd care about and call oversaturation. There are FAR too many not good fits. People who just don't know enough, have enough experience, or just don't fit well enough into the current team to warrant further pursuit.\n\nIt's exactly like dating. It fucking sucks.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I was back in school (nearly a decade ago) and studying again because I enjoy cybersecurity. My criminal record made finding a job I felt was worth the stress and the payment nearly impossible. I had a bunch of life events come up and then moved and didn’t finish school for the umpteenth time. I personally have always been super into infosec since I was a kid. I see it all the time the people that are there for the money never stay they burn out and grow to hate it. The people that actually have a passion and a love for it have a hard time because of stupid barriers to entry. I was considering finishing my degree but honestly it looks more profitable to just become a cyber criminal and my freedom is more important to me than money. So for now I’ll stick to farming and taking it easy as much as I’d love to work in the cybersecurity field it seems to be misunderstood and always has been. Companies don’t understand the importance until everyone learns that OpSec is their job too these large corporations will always be playing catch up.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Lol I’m literally sitting here setting up a VM to do an active directory lab trying to learn and remain hopeful someone will take a chance on a newbie. One of the things that drew me to IT from education was that fact that learning new things and developing new skills can put you in a position to earn more money. As a teacher I would research and research best practice and implement what I learned in the classroom, and get good results but my salary has barely went up the last 10 years. I think two things can be true at once. People can want to get into the field for the earning potential primarily and have a desire/will to learn. I’m a year into studying 4-8 hours a day while teaching full time with a wife and kids and actually loving the journey (haven’t started applying yet). Yet if there was no earning potential I would have definitely chose something different as I followed pure passion for almost 15 years in education and see that is not always the way. It’s funny what I hear from a lot of the cyber veterans is “don’t do this if money is the driving factor” is what I would hear in education for so long and now you have a bunch of burnt out teachers waiting on a pay day that will never come no matter how well you master your job. I think it’s always a balance between doing it for the money and the love of the craft, in education I see a lot of teachers who have degrees in art or music and they can’t really do anything else but teach and they regret it. With that being said I do understand that in order for me to get a job I have to learn and out in time because I’m competing with the 20 year old kid who has spent 10 hours a day building computers since he was 5 years old Lol. So I don’t take days off of studying but it’s not just the love of learning that driving it’s definitely the thought that eventually my hard work will pay off.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Personally, I believe that while there is a growing demand for professionals in this field due to the increase in cyber threats, there are also challenges such as competition in the job market and the need to keep up to date with the latest security technologies and techniques. I think the key is to keep constantly updated.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think AI will play a critical role as humans can't do it all at the same time and mid size companies doent have the budget",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m pretty fed up with it. I moved onto non-cyber pastures after 3 years of education and months and months trying to get into the industry at any level higher than entry level. I even did an internships where I got certified in Fortinet and became very familiar with Fortigate. Did anyone give a shit? No.\n\nScrew my education. Screw my 7 years of IT experience. Screw my leadership experience. Fuck my Net+, Sec+, and CASP+ certifications. They don’t want you, and if they do, they want you for 40k a year. Bullshit, all of it. Infuriating.\n\nI wasted a lot of money and effort on that degree. And all I got for it was a middle management position paying me too little for the job thanks to my age. And I’m one of the lucky ones.",
        "points": "0 points",
        "children": [
          {
            "comment": "Sounds like you need to work on selling yourself I have about 6-7 years of IT experience and a masters.\n\nI am getting offers in the six figures with 4 of that being in cybersecurity.\n\nIf you aren't getting the pay you want often times people are spraying and praying with their resume or just not good communicating their skills / education to get more pay.\n\nAlso its taken me 3 months after getting laid off to start getting interviews / offers. Its a process its not immediate.",
            "points": "2 points",
            "children": [
              {
                "comment": "I’ll keep working on it - like I said I have a job. I know that the longer I stay in management, though, the more difficult it’ll be to get the position and pay that I want in cyber. Thanks for the advice though.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Just wondering what position are you interested in.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I’d be fine with SOC Analyst 2, but I was 3 when I left my internship. Right now I’m an operations manager for a team of system administrators. Kinda wanna go that route in cyber. I hear SOC work can really burn you out. At my internship I did a lot of alert monitoring and firewall tuning (fixing it when it broke). In my job I’ve been doing a lot of policy writing and implementation. My god, were things bad when I got here. Still are pretty bad but getting better.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Won’t artificial intelligent computers be able to brew into systems better than any human can stop them. I see an arms race between AIs hacking and AIs protecting. But serious, will AI have the ability to become the best hacker ever? Will nothing be safe anymore?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My two cents is that if you have skills that are transferable, you'll be useful as long as you're not replaceable by AI.\n\nIf you can do dev and understand security concepts, you can fit into any number of roles. If you just know web app pen testing, you might find that when security funding gets squeezed, you find it hard to get employment",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I've not read the other 91 comments, but generally I feel very optimistic. It's an exciting time to work in cybersecurity.\n\nContext: every large organisation has a cyber security security capability (whether it's an individual or a team of 100). The interesting thing about this industry, is that organisations across industries massively vary in maturity. You can work on cutting edge tech, researching the application of LLMs to security defense, or you can work for a massive global organisation that is living in the past and needs to undergo huge transformations - you'll be able to do everything from scratch. There's lots of opportunity and the industry isn't going anywhere.\n\nSix figure promises: this really bothers me and has gotten out of hand. But, that's not to say it's not attainable if you focus on skills development, getting the right experience, you'll certainly be on the path (location dependent). I wrote an in depth article on this via my newsletter - link in bio.\n\nMarket conditions: 2023/24 has been really tough for security. Layoffs, budget cuts, hiring freezes etc. I hope we see a reversal towards the end of the year and teams get the resources they need.\n\nSkills shortage: there is demand, it's just not for entry level people that need a lot of time and energy to train and get them up to speed. Companies want experienced, battle ready pros that will hit the ground running (catch-22 - if we don't get more people in the space, this shortage isn't going anywhere!)\n\nOpportunity: this space is there for the taking. You're absolutely right when you reference different methods - 50% of jobs don't make it to job boards, it's through referrals and recruiters. How do you get these opps? Build an online presence/personal brand around your area of expertise - that's your differentiator in the market place.",
        "points": "0 points",
        "children": [
          {
            "comment": "this really bothers me and has gotten out of hand. But, that's not to say it's not attainable if you focus on skills development, getting the right experience, you'll certainly be on the path (location dependent). I wrote an in depth article on this via my newsletter - link in bio.\n\nFor the new grad landscape right now, the goal isn't 6 figures, it's $200k - straight out of school\n\nFor those who wonder why they can't break 6 figures while someone on day 1 out of school can make $200k, it's not an industry or job market problem, it's probably a you problem",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I honestly think it’s going to get broader in terms of the types of jobs you can get in the industry. Anything from Law to Policy to Psychology to Traditional positions.\n\nBasically the stereotype of the SOC analyst or a Bug Hunter is just the start.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Lots of so-called security experts, but a massive lack of talent and vision.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Bleak. Very very bleak. Everyone wants into Cybersecurity because it sounds sexy and movies and tv shows make it sound all cool and sexy but when you get into people realize what a shitshowingly boring it can be (or should). And then you begin to realize that corporations truly don't care, they put up a good face and say the right things, and do what is mandated. But as soon as you start making changes to protect the organization as soon as you start trying to spend the money that needs to be spent, you find out how \"important\" cybersecurity really is.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Its a field like any other IT. Some companies have more need for dev than server and networking, some have more need for cybersecurity and sales.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If it’s so saturated why do they keep leaking our shit!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m exhausted. So I’m moving on. But I’ve been in the game a while. Moving to engineering. Yeah, I know, no peace there either, but I have a thick skin during reasonable business hours.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I feel really good about it. I'm so fortunate I'm in at 23. I feel good about my future.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The entry / intermediate level roles are completely saturated.\n\nThere is demand for senior roles.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Bleak",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I hope it has a future, because I've landed in it by accident and want to stay.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "A notable challenge is that some businesses don't prioritize security, affecting both hiring and compensation in the field.\n\nThis is only a problem for mediocre and bad talent. Good talent in this field is paid exceptionally well. New grad straight out of undergrad are paid more than the average doctor. I make more than the vast majority of doctors and I work from anywhere, including out of the country when I want to. All with a BS and no half million dollar medical school debt.\n\nThe short answer is if you want good comp you have to be good talent, that's about it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think there are lots of CS professionals looking for jobs atm, and while there are plenty of companies that need them, hardly any of them realize this yet.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc1ldg",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://ost2.fyi/TC1101",
    "title": "New OpenSecurityTraining2 class: \"Trusted Computing 1101: Introductory Trusted Platform Module (TPM) usage\" by Dimi Tomov of TPM.dev (~8 hours)",
    "points": null,
    "comments": [
      {
        "comment": "Topics include:\n\n* Use of TPM for digital signing and sealing secrets\n\n* Use of TPM for HMAC and hashing\n\n* Use of TPM as a secure storage\n\n* How to enable the TPM's protection against physical-bus Machine-in-the-middle (MITM) attacks\n\n* Protecting external data using a TPM\n\n* Understanding TPM internals and capabilities\n\nThis class takes students 8h21m on average to complete.",
        "points": "9 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "sweet. love you and your team's work :)",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc0g6n",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bc0g6n/cyber_security_architecture/",
    "title": "cyber Security architecture",
    "points": null,
    "comments": [
      {
        "comment": "There is no such correct answer. There is only what is most appropriate for the specific combination of your goals, threat model and resources.",
        "points": "18 points",
        "children": [
          {
            "comment": "yes you are correct brother but i wanna see what is the most aproriet tool in these category for every one to see\n\ni know that there are many but i wanna see the most used and why .",
            "points": "-9 points",
            "children": [
              {
                "comment": "You have good intentions no doubt but your assumption is faulty; there is no most appropriate generally for a whole category. The right question to consider is \"How come?\". Good luck",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Wazuh. /thread",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Listen dude, I’m being nice. If you’ve never had a teacher treat you like I’m treating you then your education is fucked.\n\nPut some effort into it, and I will be your best resource I promise. So far you put precisely 10 minutes of effort into this.\n\nTake the time. Write out the context of why you want this is it for a school project? That’s fine! Do you want to start a business? That’s awesome! But write it out. Take one hour and write it out.\n\nSee what you get.",
        "points": "11 points",
        "children": [
          {
            "comment": "Man, your second sentence is 100% spot on. So many people are just spoonfed shit nowadays without having to put forth any sort of effort they do only what is asked and nothing more. I think if more people gave some of the young kids still in school a “come to Jesus moment “it would benefit them so that when they’re out of school, they’re better equipped to be able to handle the real world slapping them in the face.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Ten Seconds in Gemini.google.com\n\nPrompt: \"I'm currently focusing on cybersecurity solutions utilizing open-source tools. I'm seeking recommendations for the most effective tools in several areas, including SIEM, SOAR, IDS/IPS, incident management systems, and security monitoring. Could you please suggest your preferred tools in these categories and explain why you consider them to be the best solution? Your insights would be greatly appreciated.\"\n\nAnswer:\n\nIt's important to remember there's no single \"best\" tool for every situation. However, here are some highly regarded open-source options in each category you mentioned, along with their strengths:\n\nSIEM (Security Information and Event Management):\nWazuh: This free and open-source XDR (Extended Detection and Response) platform goes beyond traditional SIEM. It offers log collection, analysis, threat detection, incident response, and vulnerability management, making it a powerful all-in-one solution for security teams [1].\nSOAR (Security Orchestration, Automation, and Response):\nOpen XDR: While not solely focused on SOAR functionalities, Open XDR provides a strong foundation for security automation. It allows you to build custom playbooks to automate incident response workflows, improving efficiency [2].\nIDS/IPS (Intrusion Detection/Prevention System):\nSuricata: This popular IDS/IPS offers a powerful engine for real-time network traffic analysis. It's known for its flexibility, extensive rule sets, and ability to integrate with other security tools [3].\nIncident Management Systems:\nOpenTicket: This open-source ticketing system is specifically designed for IT security incident management. It streamlines collaboration, tracks incidents, and offers reporting functionalities [4].\nSecurity Monitoring:\nSecurity Onion: This Linux distribution combines multiple open-source security tools like Snort (IDS), Suricata, and Wireshark (packet analyzer) into a pre-configured environment for comprehensive security monitoring [5].\n\nThese are just a few examples, and the best choice for you will depend on your specific needs and environment. Here are some additional resources to help you decide:\n\nFree Cybersecurity Services & Tools: This CISA resource page provides a curated list of free and open-source cybersecurity tools categorized by function [6]. https://www.cisa.gov/resources-tools/resources/free-cybersecurity-services-and-tools\n25 Free and Open Source Cybersecurity Tools for Businesses: This article offers a broader range of open-source tools beyond the categories you mentioned [7]. https://heimdalsecurity.com/blog/25-free-open-source-cybersecurity-tools-for-businesses/\n\nRemember, with open-source tools, you'll often need to invest more time in setup and configuration compared to commercial solutions. However, the benefits of cost-effectiveness, customization, and a vibrant community can be significant.Could you please suggest your preferred tools in these categories and explain why you consider them to be the best solution? Your insights would be greatly appreciated.",
        "points": "13 points",
        "children": [
          {
            "comment": "good bro good",
            "points": "-17 points",
            "children": [
              {
                "comment": "Dude the majority of them I did them in college as projects, that was 5 years ago, not good, there are other tools and products much more efficient , fi wished college 5 years ago",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Nope. Couldn’t give less of a shit about you. You simply present a demand, without context, without reason, just “tell me about all the time you’ve put into open source projects so I don’t have to bother! And I’m not going to give you anything either!”\n\nTry telling me you’re a student and looking to have other people do research for you so you can be lazy.\n\nGo try a half dozen projects. And if you can’t find any, try the magic go-ogle. Tell us why you like this one and not that one. Tell us what you need to do! Tell us what it’s for!\n\nPut some fucking effort in. Ok?",
        "points": "20 points",
        "children": [
          {
            "comment": "Then we will help",
            "points": "12 points",
            "children": [
              {
                "comment": "hahahaha hey bro you know i'm not seeking for u help or something , in fact i'm trying to find reasons . and other thing for you caus your unprofisional behavior here’s the list in on apparent order (note that I’ve listed only defensive tools, offensive ones like metasploit, nmap, wireshark, etc):\n\nSecurity monitoring, intrusion detection/prevention\n\nSuricata, Snort, Zeek, OSSEC, Wazuh, Velociraptor, OSSIM, SecurityOnion, Elastic SIEM, Mozdef, Sagan, Apache Metron, Arkime, PRADAS, BloodHound\n\nThreat intelligence\n\nMISP, SpiderFoot, OpenCTI, OpenDXL, Sigma\n\nIncident response\n\nStackStorm, CimSweep, GRR, TheHive, TheHive Cortex, Shuffle, osquery, Kansa\n\nVulnerability assessment\n\nOpenVAS, ZAProxy, WebScarab, w3af, Loki, CVE Search\n\nFirewall\n\npfsense, OPNSense, Smoothwall\n\nAntivirus / endpoint protection\n\nClamAV, Armadito AV, YARA\n\nEmail security\n\nHermes Secure Email Gateway, Proxmox, MailScanner, SpamAssassin, OrangeAssassin\n\nnow go to sleep byby",
                "points": "-24 points",
                "children": [
                  {
                    "comment": "Hey! Congratulations! You learned to google! Look how much I’ve helped you already! Now lay out what you need this for? Are you starting an msp? Want to build a security business based on open source tools?\n\nContext helps a lot.",
                    "points": "14 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "this take much time to write this for unprofisionnal some one\nplease don't share any thing any more cause you are selfish",
                "points": "-23 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Wazuh, UTM Stack, OSSIM (alienvault)! but as Mangy said, no such correct answer.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "ClamAV for literally everything!!!! Just full stop right there and don’t worry about the rest of that junk. If you can’t do research you aren’t going to be able to configure and monitor any of that junk anyways. Why hire analysts when you can pocket that cash in a bonus? I recommend you open all ports on your firewall too because then the money flows better. /s",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "God this sub is so toxic and hostile to a guy just asking for your personal recommendations/opinions.",
        "points": "-5 points",
        "children": [
          {
            "comment": "No. This sub asks for effort. That’s all. Just make an effort.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bbzs4c",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://9to5mac.com/2024/03/10/security-bite-hackers-breach-cisa-forcing-the-agency-to-take-some-systems-offline/",
    "title": "Security Bite: Hackers breach CISA, forcing the agency to take some systems offline",
    "points": null,
    "comments": [
      {
        "comment": "Two CISA systems breached\n\nA CISA spokesperson confirmed the breach in a statement, saying hackers gained access by exploiting vulnerabilities in internal Ivanti tools. The Utah-based firm provides IT security and systems management software to some 40,000 customers, from large organizations to government agencies worldwide, per its website.\n\n“The impact was limited to two systems, which we immediately took offline,” CISA stated. “We continue to upgrade and modernize our systems, and there is no operational impact at this time.” The agency didn’t specify whether data had been accessed or stolen.\n\nThe Record, which first reported on the incident, cited a source with knowledge of the situation as saying the hackers compromised two systems that were part of the Infrastructure Protection (IP) Gateway, which houses critical data and tools used to assess critical U.S. infrastructure, and the Chemical Security Assessment Tool (CSAT). The latter houses some of the United States’ most sensitive industrial information, including which chemical facilities are designated high-risk, Site Security Plans, and Security Vulnerability Assessments.",
        "points": "71 points",
        "children": [
          {
            "comment": "Props to CISA for adhering to their own guidance on this",
            "points": "67 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "\"two systems that were part of the Infrastructure Protection (IP) Gateway\", it sound like a firewall cluster was the entry point",
            "points": "22 points",
            "children": [
              {
                "comment": "Leaves you wondering if CSAT was targeted or just what they found behind gateway. It's a fairly disturbing thing to have targeted specifically",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Everybody gets got.",
        "points": "37 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Show me an org running Ivanti that didn't get a bit of heat over those CVEs...",
        "points": "26 points",
        "children": [
          {
            "comment": "If your agency has Invanti, it’s your agency, too.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If only CISA had known that a vulnerability existed in Ivanti.",
        "points": "14 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well better CISA than our agency",
        "points": "16 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "https://xkcd.com/932/",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The Infrastructure Protection (IP) Gateway comprised of two systems, and it appears that a firewall cluster served as the point of entry.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Be careful commenting about this, the CIS@ Simps are strong.",
        "points": "-28 points",
        "children": [
          {
            "comment": "Where? Who?",
            "points": "5 points",
            "children": [
              {
                "comment": "Just look at all my down votes.",
                "points": "-2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Just came here to comment: hahaha hahaha US cybersecurity is terrible, please do something.",
        "points": "-21 points",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]