[
  {
    "id": "t3_1bj2fxw",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://theconversation.com/smart-rings-ultra-precise-movement-tracking-take-wearable-technology-to-the-next-level-225604",
    "title": "Smart rings’ ultra-precise movement tracking take wearable technology to the next level",
    "points": null,
    "comments": [
      {
        "comment": "I'm getting tired of making sure everything is charged.",
        "points": "142 points",
        "children": [
          {
            "comment": "Can’t wait for Ai powered smart socks to complete the collection.",
            "points": "13 points",
            "children": [
              {
                "comment": "Remember to get SmartCloud Wireless Foldable Electric IronGPT first, you wouldn't want to have those babies wrinkled, would you? ;D",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Well yes indeed it makes me feel a bit bad about my use of resources for something as benign as a smartphone etc. Yeah i knooooow i am typing this on my smartphone.🥱",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Watches, then rings, then earrings and finally butt plugs. Outta sight!",
        "points": "68 points",
        "children": [
          {
            "comment": "Smart butt plug. The future is coming.",
            "points": "19 points",
            "children": [
              {
                "comment": "There's already smart, app-controlled butt plugs. I know this because the name of that industry is my favorite word ever created: teledildonics",
                "points": "32 points",
                "children": [
                  {
                    "comment": "",
                    "points": "9 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Then the chess community will go up in arms again",
                "points": "18 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I see what you did there",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The chess world is way ahead of us regular folk on some of these.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You get a tingling feeling that gathers your attention, it's your smart tooth vibrating to let you know something is up, but what? To find out you look at your smart ring to see incoming phone call icon, but who is calling? Luckily your smart watch is here to show you the number, but you don't recognise it, it might be important, you reach for your smart drone pad in your pocket so it would fetch you your smartphone with its new AI-powered-smartphone-fetching capabilities\n\n-hello?\n\n-hello sir, I'd like to talk to you about your extended warranty",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Oh baby. Now we’re talkin",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It's a load of crap nonsense. Noone is saying anything about finger movement tracking.",
        "points": "17 points",
        "children": [
          {
            "comment": "The usurping of Reddit post by 3D chess ads begins lol.",
            "points": "8 points",
            "children": [
              {
                "comment": "It’s gonna be the comments that kill the ads. And it’s guaranteed that there will be inorganic comments that align with the ads.\n\nIt’s gonna be us training AI with actual conversations and us reading bullshit, as we’re being fed ads.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Yeah it’s not gonna end well once people realize a post is an ad as opposed to just being transparent a out it.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "VR trackers exist though.",
            "points": "-1 points",
            "children": [
              {
                "comment": "The article implied that the ring device could do just that and I'm pointing out none of the ring products does that.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "please stop inventing more e-waste for the sole purpose of harvesting private data. what do i need a smart ring for?",
        "points": "15 points",
        "children": [
          {
            "comment": "For more granular activity tracking. For example with a ring they can tell if you're using a keyboard or beating off, and better deliver targeted ads.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "",
        "points": "12 points",
        "children": [
          {
            "comment": "Right, after the Samsung debacle I don't want a battery powered device around my finger.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I've seen him eat",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Party pooper",
            "points": "-4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Whatever these rings end up doing please let them passively charge. Idc if it's solar or thermal or mechanically somehow but please don't make me take it off to charge more than once a month. Preferably I'll never have to.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Any editor who allows the phrase, “to the next level” deserves to be fired.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Noone wants these things. Ad posts here wont help.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Put it in a different box, without the manual and give it to you girl on Valentines day. If you have any suspicion about the embroidery workshop she goes to every friday evening.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Garbage.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What kinda dystopian nonsense is this?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I much prefer meta's wrist mounted finger tracking solution",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Perfect for trusting couples",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I was thinking more like gps enabled, like an air tag.",
        "points": "-3 points",
        "children": [
          {
            "comment": "Air tags do not have gps, they use iphones to get location",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Airtags don't have GPS only low power Bluetooth.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Perfect fit for the modern cheating household",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1binr82",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://m.dpreview.com/news/8586290419/mevo-core-micro-four-thirds-4k-webcam",
    "title": "Logitech's Mevo Core is a Micro Four Thirds live-streaming camera",
    "points": null,
    "comments": [
      {
        "comment": "Kinda neat\n\nat $1k just for the base unit though.... nah.",
        "points": "121 points",
        "children": [
          {
            "comment": "Not bad for robotics and interactive installations that need special optics. I was looking for something just like this months ago for a $50k project I was working on.",
            "points": "40 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yes and without the lens. High quality and high price.",
            "points": "-22 points",
            "children": [
              {
                "comment": "Can I get it cheaper if I just want Three Thirds?",
                "points": "21 points",
                "children": [
                  {
                    "comment": "You’d probably pay more per third it depends if you’re planning on topping the thirds up later down the line",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "I think their joke may have been based on the misperception of how fractions work, specifically how Americans in the 1900s flocked to businesses selling the 1/4lb cheeseburger instead of ones selling the 1/3lb cheeseburger thinking the 1/4 was bigger.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "But isn’t this worse than just a regular DSLR camera that has more uses as well",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Depends what your use case is.",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "I may be missing the point but this seems like a DSLR that costs quadruple a regular DSLR camera but I see no inherent benefits other than being smaller\n\nI don’t see why you couldn’t just mount a regular DSLR for streaming and then you save a grand and you can use it as an actual camera when you go somewhere",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Blackmagic Micro Studio Camera 4K G2 is much better at $995 with true broadcast features like 12G-SDI in and out.",
        "points": "60 points",
        "children": [
          {
            "comment": "All hail blackmagic design. The only company that actually cares about its customers.",
            "points": "25 points",
            "children": [
              {
                "comment": "Until you need customer service. Source… I own a lot of their equipment",
                "points": "23 points",
                "children": [
                  {
                    "comment": "That’s what you’re not paying for.\n\nSeriously. There’s only so many ways companies like BlackMagic are able to undercut their competitors so much, and cutting things like customer service it one of those ways. Ubiquiti is kinda the same deal.",
                    "points": "21 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I have the original pocket and the pocket 4K. They’ve been working great. Haven’t had a need for customer service so far but touch wood, hope it stays that way.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Only if you stay in their ecosystem.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "i hate you and love you right now. thats a beautiful piece of kit.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Can someone ELI5 what a four thirds sensor is?",
        "points": "15 points",
        "children": [
          {
            "comment": "Micro 4/3 describes the size of the sensor and the lens mount. It is a fairly common format for mirrorless (DSLR-style) cameras.\n\nThe big deal here is that it is a big sensor for a webcam that you can put nice lenses on.",
            "points": "26 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Technically it's the sensor size - its diagonal is 1 1/3 (or 4/3) inches.\n\nBut colloquially it also refers to the camera system and also includes a specific lens mount so you can attach any lens developed for this system (and there are quite a few).",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Bit on that:\n\nhttps://en.m.wikipedia.org/wiki/Four_Thirds_system",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'm not sure why you would buy this when you can get a Panasonic LUMIX G100 with a basic lens that's about 3/4 of the cost of just this body, while likely offering better quality.",
        "points": "20 points",
        "children": [
          {
            "comment": "It is hard to say. Camera as a webcam sometimes comes with many restrictions. My Sony A7R3 can only output 720p video as a webcam. It consumes more electricity than the USB-C cable can supply and the battery only lasts 2-3 hours. Depends on what the use case end user wants this webcam may have a market.",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The Mevo line is for streaming direct from the unit itself. I don’t know about full specs on this item, but other Mevo’s could do RTMP directly, or NDI (a network video protocol that a lot of people bring into video mixers on a LAN like OBS or vMix). Previous Mevos have been PoE powered too.\n\nIt’s a toy meant for streamers looking to up their game from standard webcams, or who want to be able to swap lenses.",
            "points": "5 points",
            "children": [
              {
                "comment": "That actually does seem like a useful feature. I'm not sure if it's worth the premium - especially because I have no faith in 4K livestreaming - but I'm sure at least some people will buy it.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "My guess would be non-techy people or some sort of gimmick filled software to go with the unit that makes the needs of most easy to achieve.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Convenience.\n\nIts for people who\n\ndont want to find a compatible camera\ndont want to figure out how to make it work\n\nOverall, this is a positive as quality and easy to use “webcams” are starting to find their way into the market.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "with less features, and for the same price, as the Blackmagic Micro Studio Camera 4K G2, who would honestly buy this?",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I worked on a promo for these and they we're pretty cool. Anyone comparing them to other cameras need to understand this is not marketed to you, it's a plug and play system to easily stream/record multicam content. Think small sports, music performances, where you're not hiring someone to capture it but doing it yourself.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "These micro43rds-in-a-small-box cameras can be popular with astrophotographers, just get a telescope eyepiece adaptor and then you can control the scope motor drive and take photos automatically from your computer.\n\nMind you, I'd want to know more about this camera's spectral response and noise performance before buying one.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "wow a grand for each sensor? naw no thx.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Looks like my 8 year old GoPro 5.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Did GoPro make similar camera? Size wise.",
        "points": "-1 points",
        "children": [
          {
            "comment": "GoPros are terrible in low light and indoors.",
            "points": "1 point",
            "children": [
              {
                "comment": ":o",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Right on time to fleece Air B&B hosts",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What are the lens mount options?",
        "points": "-3 points",
        "children": [
          {
            "comment": "Jusf read the article\n\nWith its Micro Four Thirds lens mount, it's compatible with any MFT lens but has been officially tested with four:\n\nOlympus 14-42mm EZ\n\nLumix 14-42mm PZ\n\nLumix 45-175mm PZ\n\nSigma 16mm",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bijskm",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.ibtimes.co.uk/uk-scientists-develop-bra-integrated-breast-cancer-monitoring-system-1723973",
    "title": "UK Scientists Develop Bra-Integrated Breast Cancer Monitoring System | The device tracks breast changes, boosting survival odds",
    "points": null,
    "comments": [
      {
        "comment": "<image>",
        "points": "95 points",
        "children": [
          {
            "comment": "I love this man",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Let me guess, they go on Dragons Den and the bra spontaneously catches fire during the presentation.",
        "points": "124 points",
        "children": [
          {
            "comment": "My tits are hot!!",
            "points": "34 points",
            "children": [
              {
                "comment": "Calm your tits down!",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "its amazing was $2000 US willl buy on the back streets of Sao Paulo.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The middle bald guy still makes a predatory bid on it.",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "“Who am I, Roy? I’m a ghost, I’m a shadow, I’m GONE! PFFFF!!!”",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I've solved the overheating problem. Or I might have made it much worse.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Too bad nobody wears bras anymore.\n\nWell not too bad but bad for this article",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Nah even though the premise is good but I don't want IoT on my bra",
        "points": "41 points",
        "children": [
          {
            "comment": "Women can and do get breast cancer in the location where they had been stuffing their phone in their bra. I would not want anything even remotely like this near my breasts.\n\nedit: this happened to a friend of mine, and yes it was the exact location where she had stored her phone for years. She had other women express the same had happened with them. (cancer support groups and such)\n\nhere is the official no everyone is downvoting me over https://www.nationalbreastcancer.org/breast-cancer-myths/carrying-a-phone-in-your-bra-can-cause-breast-cancer/\n\nSo yes women have experienced anecdotal correlations, but evidently there is no scientific causation.\n\nI still would not want electronics in my bra. The underwire is troublesome enough. My luddite wire-free bra world has no need for this item.",
            "points": "-30 points",
            "children": [
              {
                "comment": "There would be an epidemic of upper thigh cancer that dwarfs all other cancers. Billions of people keep phones in their pockets for many hours of the day.",
                "points": "29 points",
                "children": [
                  {
                    "comment": "Upper thigh is muscle. The breast is a complex system interwoven with endocrine function.",
                    "points": "-9 points",
                    "children": [
                      {
                        "comment": "You can have cancer in muscle, it happens all the time. There's also fat at your thigh, and you can have cancer there too. You can have cancer in blood vessels.\n\nCome on, absolutely ridiculous claim.",
                        "points": "17 points",
                        "children": [
                          {
                            "comment": "Is it possible that a more complicated organ system would be more susceptible to cancer than a muscle or bone? I don’t even think that there is necessarily a causation between breast cancer and boob phone storage but you seem to be oversimplifying this as well. I would imagine that a more intricate organ system could have increased sensitivity to potential carcinogens than other parts of the body, but I’m also not a doctor.",
                            "points": "4 points",
                            "children": [
                              {
                                "comment": "There are approaching 10 different kinds of breast cancer that affect everything from the milk ducts to the fat cells to the organ lining to the blood vessels and everything in between. They are all breast cancer.\n\nMaking the claim of \"x causes cancer\" without being even remotely specific in this kind of context is only borne from ignorance. By what mechanism does a cell phone cause cancer in the breast? Which part of phone technology? Is it the radio antenna? Is it the fast charging tech? Is it the contactless transmitter that enables you to touch to pay? Is it the electromagnetic field from the battery? Which mechanism?\n\nWhich part of the breast does it affect? The milk ducts themselves? The adjacent lymph nodes? The fat cells? The underlying muscle of the breast? The blood vessels? Which part specifically and by what technical aspect of a cell phone?\n\nThese claims are pure, unadulterated ignorance that could be dispelled with an actual 10 seconds of basic research. These claims are intentionally ambiguous and attractive to conspiracy theories because they are so ambiguous. They are ambiguous because specific claims can easily be factually dispelled, so the only way they can make a claim at all is if they don't understand the mechanisms involved and say something that takes way more time to factually dispel every conceivable aspect of what they claimed.\n\nThe most reasonable resolution to ambiguous claims is to wholesale dismiss them until the claimant is more specific, which they won't be because they don't even know what they are talking about. They don't even know the underlying mechanisms involved, but they weaponize their ignorance anyway because they think they havebeen awarded special knowledge.",
                                "points": "7 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "This. Common sense is not so common, it seems.",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Have also heard of people getting lumps right where they store it fwiw",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Source?",
                "points": "4 points",
                "children": [
                  {
                    "comment": "lol, like they can provide a reputable source?",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Source: the location where they stuff their phone into their bra is where the breast is, and it’s the breast that gets breast cancer. Coincidence? /s",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "I’m dumber after reading their comment",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "They added one, but it contradicts their statement lol.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "You source directly contradicts you and calls it a myth ( directly in the url even). I assume that is why you are being downvoted lol",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Doubt.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Do you get cancer in your hand or head from using your phone? No? Weird that. Must only work on breasts.\n\nJoking aside, testing is done on this and shows the correlation drawn in your anecdotal story is mistaken.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "As a man with a family history of prostate cancer - does it come in a butt plug?",
        "points": "22 points",
        "children": [
          {
            "comment": "No but it might cup your balls",
            "points": "1 point",
            "children": [
              {
                "comment": "A win is a win",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Let me guess, it’s WiFi/Bluetooth enabled and there’s an app with poorly implemented security and a data breach that’s just waiting to happen. There are enough breasts on the internet, we really don’t need statistics of more.",
        "points": "24 points",
        "children": [
          {
            "comment": "What possible market is there for the data collected by this device...? I have a suspicion on what you're implying but it's insane.",
            "points": "5 points",
            "children": [
              {
                "comment": "The value is not in a single datapoint. The value is in amalgamation of data points. A pre-detection, along with expectation for leave from work for treatment for example could be used to drop someone from their medical insurance, or affect their credit score.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Entirely depends on what specific info is collected, who it is collected from, who it is collected by, what it was collected from, as well as to what extent it was collected. Prospective buyers are directly influenced by this, so that could be criminals, rival companies, even foreign nations. This kinda thing may seem mundane by your standards but Theres always a market.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "The data collected is the capacitance of your breast tissue. If neerdowells harvested this information, they would know the distribution of chest capacitance for the population of women wearing this product. You can argue I'm a simpleton if you like, but there is absolutely no commercial use for this data.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I am aware, but Like i already said, it depends on WHO the info is collected from, WHAT the info is, WHO it is collected by, WHAT the info is collected from, and HOW MUCH info was collected. Consider that maybe the content of the info itself isnt of much value, but how it was collected and by what device is of value.\n\nAnd I never said you were a “simpleton”, i said this info seems mundane to you. What seems mundane to you is extremely interesting to someone else.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "How much does that cost?",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Boob science leading the way!",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Does it have a built in radiation unit for making clear pictures? Ooh, and for the USA: does it detect swelling normally related to pregnancies, so we can incarcerate mothers to make sure they give live birth?",
        "points": "41 points",
        "children": [
          {
            "comment": "“Convenient home monitoring for peace of mind”",
            "points": "16 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The brief description I read from the article said they take electrical measurements across the breast since normal breast tissue would be less dense and have more water content than the more dense tissues seen in tumors. Ostensibly, it can detect variations caused by a mass as small as 2mm across, which is pretty cool if true. I didn't see anything about imaging, though.\n\nSpeaking specifically to the question about swelling, I'm guessing normal swelling from pregnancies or menstrual cycle wouldn't be detectable/reportable as the added mass wouldn't be the denser tissues associated with tumors. The red hats and theocrats will have to find some other way to Big Brother their way into women's bodily autonomy.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "US version does not have additional functions, but it is made of Kevlar",
            "points": "1 point",
            "children": [
              {
                "comment": "Useful!",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "\"Bra company explained the 36gb data uploaded was individual case, normal users usually range from 12kb to 24mb of data usage\"",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That would be amazing for me because every other day when my breasts hurt I’m panicking that I’ve got breast cancer",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There is no way it boosts survival odds. Early detection of breast cancer is a myth. If it were true, death rates would have plummeted when the mammogram was invented. We have a slight decline in breast cancer deaths due to survival rates increasing because of drugs. In 2016, I was told I had 30 months. I’m not dead yet.\n\nOnly stage 4 is fatal. No one dies from stages 1-3. A full 30% of people with breast cancer are stage 4. That number has not moved at all. If early detection worked to prevent deaths, that number would decline.\n\nStepping off my soap box.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Are we trying to sell breast data now?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hey, I’m here to see the doctor, my bra won’t quit beeping",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Dildo version coming soon for male user",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They have my support 🤫",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "when are we getting prostrate briefs?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can we men get the same thing for the balls and ring of fire ? thanks.",
        "points": "0 points",
        "children": [
          {
            "comment": "No because the world is moving to think men are lesser",
            "points": "-3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I’m most curious about the accelerometer applications of boob data, personally. DOA Beach Volleyball hasn’t had an entry in a bit.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "But it’s Bluetooth which actually causes cancer",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This great news! I took the same genetic test Olivia Munn did and like her I was told I don’t carry the gene, but after seeing what happened to her I prefer stay cautions, this sounds like a great alternative.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This sounds more like a research proof of concept than something that makes sense for mass use",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "will it work on my moobs?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I can't wait to never hear about this again",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This should be able to detect unwanted grabbing too. Put a creep alarm in it!",
        "points": "1 point",
        "children": [
          {
            "comment": "Women are perfectly capable of detecting unwanted grabbing of breasts all on our own, we don’t need to spend money on it, thanks.",
            "points": "4 points",
            "children": [
              {
                "comment": "No one said you weren’t. It’s just that sadly, testimonies of those assaulted are often not enough to prosecute or win in court though. So when it comes to pressing charges for assault, the sensor data would be indisputable proof of said assault. You’d get more convictions. This would just be in addition to the headline tech - bonus feature, if you will.",
                "points": "-6 points",
                "children": [
                  {
                    "comment": "\"Your honor, she groped her own breasts to frame me.\"",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "Luckily we have juries for this kind of buffoonerey.",
                        "points": "-2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "So stupid",
        "points": "0 points",
        "children": [
          {
            "comment": "Right? I’ll gladly administer a check for free on any woman all they have to do is ask",
            "points": "-15 points",
            "children": [
              {
                "comment": "We’re taught to self-exam quite extensively. You’re out of a job, buddy :(",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "[deleted]",
        "points": "1 point",
        "children": [
          {
            "comment": "Hear that everyone!? If the body can sense it on its own, we don't need tech. We just have to listen to our bodies and all will be solved!",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Given the cost of a well built bra, I can't imagine this would ever be in any way affordable or practical. Even as a medical device there are much better ways of going about this.\n\nPlus imagine the anxiety. It's bad enough out here without getting a titty alert, go to the doc, and oh, you're ovulating so yeah. Or having to cancel an alert cause you took a nap wearing the bra and your boob crept out of it.\n\nPerhaps this could be a step to a different, more practical tech, but this ain't it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Next up: period tracking panties.\n\nThis is beyond creepy",
        "points": "-5 points",
        "children": [
          {
            "comment": "Wtf how is this creepy. Analysing an electric current traveling through breast tissu in order to save lives taken by the leading cause of cancer death in women is \"beyond creepy\" ?",
            "points": "5 points",
            "children": [
              {
                "comment": "It’s not about the cancer detection. Products like this can monitor menstrual cycles from changes in breast tissue.\n\nIn states like Texas or Alabama this could absolutely be a way for women to be tracked and potentially incarcerated if they get pregnant and don’t want to keep the child. This is not a joke or some paranoid conspiracy theory. These places are extremely dangerous for women already, and the more ways there are to monitor them, the more dangerous it is.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "Products like this can monitor menstrual cycles from changes in breast tissue.\n\nForgive my lack of first-hand knowledge, but what changes in breast tissue would be detected by this kind of product? Does breast tissue become more or less conductive as a response to the hormone cycle? Because that's what this product appears to measure: since tumors have different density and conductivity than normal breast tissue, a change in conductivity would/could indicate the presence of a tumor.\n\nIt just seems like it'd take one heck of a modification to the device to make it go from measuring conductivity to...whatever you seem to think it'd do. I'll gladly read your explanation if you have particular insight, here.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Look maybe you're right that it could technically be used for that but you're talking like they're designed for that purpose and that's just fucking mental, obviously they're not",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "That’s what you think",
                        "points": "-6 points",
                        "children": [
                          {
                            "comment": "that statement funnily enough reeks of paranoid conspiracy theory",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "So that's Texas and Alabam being creepy. The product in itself (if it proves itself) is a good idea, it's all about why and how it is used. But right now the motives behind its invention are not creepy at all.",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "I’d rather just give myself exams without big brother watching but thanks",
                        "points": "-2 points",
                        "children": [
                          {
                            "comment": "Well that's you but not everyone is into going through regular x rays. And if you're talking about self exams then yeah they're great but I don't get people complaining about more ways to diagnose pathologies.\n\nAnd here we're talking about tumors as small as 2 mm.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "Best get rid of that smartphone and your computers if that's the reason!",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "iPhone also tracks and detects a woman’s cycles, should they also stop using those?",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Yes, this has been said since they became a thing.\n\nNever use those apps",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Then the ladies will need to invent boner tracking undies to hunt down all the sex offending congresscritters",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Surely there's now way adding one of these to your daily life is good for your mental health",
        "points": "-2 points",
        "children": [
          {
            "comment": "I dunno. I thought the same thing about having a heart monitor and single-channel ECG in my smart watch, but once I decided to start recording data from the ECG, I found having the record useful.",
            "points": "3 points",
            "children": [
              {
                "comment": "Yeah but this isn't that. It's just an alarm that goes off if you get cancer",
                "points": "-3 points",
                "children": [
                  {
                    "comment": "No..?\n\nI know my reading of the article was brief, but it clearly discussed taking electrical conductivity measurements to test for the presence of the kind of dense tissue associated with tumors.\n\n...and in the context of \"I wear this device to track my status over time,\" there's not a whole lot of difference in concept.",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "That's literally what I just said. The only different statuses that are relevant are \"no cancer\" and \"you've got cancer\".\n\nI would not want that question running through my head every day that would be totally debilitating",
                        "points": "-3 points",
                        "children": [
                          {
                            "comment": "The only different statuses that are relevant are \"no cancer\" and \"you've got cancer\"\n\nIncorrect, and I'll use a hypothetical to explain why:\n\nLet's say you discover a lump. That's normal. Disconcerting, but normal. You go to a doctor to get a look at it, she performs a mammogram to get a look at it, then takes a biopsy for analysis. It usually takes labs a while to come back with biopsy results, which then have to be interpreted by a pathologist and/or your GP. So in the mean time, you wait. While you're waiting, you have nothing but self-checks and maybe subsequent mammogram imaging to monitor potential progress.\n\nConsider alternative 1 - You're given the device to monitor your breast for changes while you await biopsy results. Now you have something which can tell you if the lump is growing or staying the same. If it's staying the same size (as determined by no change in conductivity), you at least have that going for you while waiting on results. If it's getting bigger, you have a problem and you really want to know about that as soon as possible.\n\nAlternative 2 - You get the device for yourself as a doctor-guided alternative to traditional mammograms. I have no first-hand knowledge of this, but every woman I know who's had one does not describe the experience as enjoyable. I'm pretty sure occasionally wearing an electric bra insert for the day would be preferable to \"putting your tits in a vice\" every two years. Plus, you'd have more frequent monitoring and don't have to wait for a lump to be big enough to be felt between mammograms. And you have collected data you can hand off to your GP.\n\nI would not want that question running through my head every day\n\nSee, again, I thought something similar about having a watch that could record information about my heart. At first, yeah, there was a bit of nervousness when I'd take an ECG reading (since you have to have a finger on one side of the watch and sit still while watching the readout record), but it didn't take long before it just became routine, like checking engine oil: you don't check it because you think something is wrong, you check it to verify things are still good.",
                            "points": "3 points",
                            "children": [
                              {
                                "comment": "You make a bunch of good points 👍",
                                "points": "4 points",
                                "children": [
                                  {
                                    "comment": "Oh shit, a reasonable exchange on reddit! Thanks for both being champions of decency!",
                                    "points": "2 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This is not a recognized method for detecting cancer, I'm not saying it's a sham but it is far away from properly approved methods, I also imagine it's gonna be expensive, so I have a hard time understanding the use case for this. Is every woman expected to buy a boob scanner that hopefully works and use it regularly? Is that better than a visit to the doctor once a year? There's gonna be a lot of people that won't use it correctly, what do you do about that? Are you going to just trust that everything was done correctly? There's a reason why Doctors and techs perform this tests.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bijd4s",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://spectrum.ieee.org/stretchable-electronics",
    "title": "Stretchy Circuits Break Records for Flexible Electronics",
    "points": null,
    "comments": [
      {
        "comment": "I read circus three times.",
        "points": "14 points",
        "children": [
          {
            "comment": "At least you didn’t read it as “Sketchy Circuits” like I did.",
            "points": "8 points",
            "children": [
              {
                "comment": "I did the same, maybe because 'break' follows it. I was like, yes it makes sense sketchy circuitry is breaking electronics.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "this is going to be a leap in compact technology. big leap.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“A new sensor array can read Braille faster than a human fingertip”\n\nOkay why didn’t anyone tell me my fingers can read.",
        "points": "7 points",
        "children": [
          {
            "comment": "First time learning about braille?",
            "points": "13 points",
            "children": [
              {
                "comment": "Kind of a bumpy road",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Hahaha no. But my brain does my readin’",
                "points": "0 points",
                "children": [
                  {
                    "comment": "🤦",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  }
]