[
  {
    "id": "t3_1bcivk0",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.cnn.com/2024/03/11/tech/airbnb-bans-the-use-of-indoor-security-cameras/index.html",
    "title": "Airbnb bans the use of indoor security cameras",
    "points": null,
    "comments": [
      {
        "comment": "Next, hopefully ban the $500 'cleaning fee'",
        "points": "768 points",
        "children": [
          {
            "comment": "And they expect you to clean the whole house regardless",
            "points": "218 points",
            "children": [
              {
                "comment": "Not the whole house, just please follow this 36 page binder on a few small things we need you to do before you check out. /eyeroll /s",
                "points": "92 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "the cleaning fee should cover cleaning",
                "points": "26 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "How to AirBnB in easy steps:\n\nBuy a property with 5% down using a HELOC from your existing home. Pay over asking.\nFurnish it with literally the cheapest shit you can find from secondhand or the dollar store. Make sure the cutlery is the thinnest aluminum possible and nothing matches.\nList it for the average hotel suite price plus $100 per night. Make sure at least half of the photos on your listing are of tourist sites instead of the property.\nHire a management agency to handle booking and checking guests in and out.\nPay a Filipino cleaning agency to clean and do laundry every checkout for $50. Charge the guest $300.\nProfit.",
            "points": "167 points",
            "children": [
              {
                "comment": "Ruin local housing economy",
                "points": "100 points",
                "children": [
                  {
                    "comment": "Yeah, but that's everyone else's problem /s",
                    "points": "42 points",
                    "children": [
                      {
                        "comment": "But we just want to share our wonderful town with others! [/s]",
                        "points": "14 points",
                        "children": [
                          {
                            "comment": "I can smell the smugness through my phone",
                            "points": "9 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I also forgot \"Make sure you cancel on your guests at the last possible moment. Ideally while they are in-flight and unreachable.\"",
                    "points": "10 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Make sure at least half of the photos on your listing are of tourist sites instead of the property.\n\ni hate this with my whole heart",
                "points": "25 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "from your existing home\n\nDamnit",
                "points": "8 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Remember that the property must be in a shitty but central part of town and must say „heart of the city“.",
                "points": "12 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Don’t forget a close up of the hair dryer",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Easy, Preston.",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "More like 20% minimum down payment for an investment property based on my recent research.",
                "points": "6 points",
                "children": [
                  {
                    "comment": "15% with my CU. But I don’t doubt there are programs out there to help people doing that. The main problem I see is most people don’t lend more than property is worth so the HELOC part is confusing if you’re paying over asking.\n\nEdit: Missed the part where they are borrowing from an existing home.",
                    "points": "7 points",
                    "children": [
                      {
                        "comment": "They are saying take a HELOC from your own home or another rental property (if they already own any).\n\nI also don't understand why you'd want to pay over asking for anything.\n\nIf you offer over asking you just have to come up with the cash over the appraised value + the down payment.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Ok I see that now. And with an FHA loan or some credit unions you can do as little as 0-5% down if it was a primary home.",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "USDA, and a lot of conventional loans, require you to live in the home for at least 2 years before renting it out.\n\nThe best way to get started with rentals and have a great interest rate: buy as primary and live in it for 2 years, then buy a new primary home. Rinse, repeat.",
                                "points": "3 points",
                                "children": [
                                  {
                                    "comment": "One year for all the loans I’ve gotten, but yes, there is always some stipulation. But yes, that’s the way to do it.",
                                    "points": "1 point",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "You also have to pay the difference between appraised value and asking if there is a difference there, even if you offer asking price.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Dude…for #2, you don’t need the “cheapest” shit when people literally throw them away…\n\nAnd as for stuffs in the kitchen: BYOU",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Well, if it works...\n\nIf you find a sucker who will pay those 100-300 dollar fees. Why not?\n\nLike, nobody forces them to travel and use the airbnb which is overpriced.",
                "points": "-2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I doubt it. I bet they get a 20% cut of those fees for providing the platform. But then again I really have no idea if they really do.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I've only rented a handful but have never come across this cleaning fee.\n\nMost they asked is to leave bedding on the floor and any towels used as well.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "[deleted]",
            "points": "9 points",
            "children": [
              {
                "comment": "Cleaning fees aren’t the issue. The issue is having one but then also making the guest responsible for cleaning the place before they check out.",
                "points": "9 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "$500 is a lot.\n\nBut, you totally should have to pay to have it cleaned. If it's not a fee it will just be wrapped up in the cost of it.",
            "points": "-93 points",
            "children": [
              {
                "comment": "It should be wrapped into the cost, that’s what you’re paying for. Hosts won’t like that though because they won’t be able to bait people into a house at $300/night before they see the additional $470 cleaning fee.\n\nAlso, if I’m paying for cleaning then the chore list needs to be done away with.",
                "points": "96 points",
                "children": [
                  {
                    "comment": "Seriously. I stopped even looking on there because damn near everything is bait pricing.",
                    "points": "32 points",
                    "children": [
                      {
                        "comment": "I quit the entire concept of airbnb the day I booked a “child friendly” house and when I got there I immediately found an unsecurable door that illegally swung out over the landingless 70 degree retrofitted staircase and when I tried to get my money back as obviously I couldn’t stay there with a one year old given the unsecurable door….and all airbnb would do for me is “ask the host to issue a refund” which shockingly the host would not do. I even ended up having to pay the cleaning fee. They told me\n\n“Well really a 1 year old can get hurt anywhere so it’s on you to watch them” as if I don’t watch my child and childproof is not an entire concept.\n\nAnyways I reported the house to the city bylaw enforcement along with the relevant bylaws they were violating and made sure to let the permit people know about the illegal stairs so I may have lost but I also won.",
                        "points": "13 points",
                        "children": [
                          {
                            "comment": "child friendly doesn't mean baby proof, it just means they allow children to stay there. Not saying their setup was OK, but nowhere is gonna actually be baby proof except your own home",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "chargeback my man",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Oh, I forgot about chore lists. Yah, those are stupid and should go.\n\nWell beyond stuff like \"Please don't leave wet towels on the floor. At least put them in the tub or hang them up\"\n\nAnd yah, $470 or more for cleaning is A LOT. I'm a professional house cleaner. For $400+ I'd do a super deep clean of a 4 bedroom house. And ya know they don't do even a deep clean.",
                    "points": "9 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Try using the Australian Airbnb site to look for places. Aus laws means Airbnb listings for your search show total cost up front",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "i don't remember paying to have the last hotel room i rented cleaned",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I think as a general business model it’d probably piss off less people if it’s just included. It’s the cost of business and it’s pretty shady to artificially lower the rent cost by not including it in the search base price when looking for a place.\n\nNo clue why everyone downvoted ya though.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I switched back to hotels long ago. There was a golden age of AirBNB.....and it was lovely. But that time has passed.\n\nI can stay in a hotel in most cases.....and I prefer a hotel like Embassy Suites.... get decent space, good service, great location, and not have to worry about stupid fucking disproportionate cleaning fees.....after they have already asked you to sweep, take the trash out, and put linens in the wash.",
        "points": "201 points",
        "children": [
          {
            "comment": "This, prefer hotel these days. The golden age was like the early to mid 2010s.",
            "points": "56 points",
            "children": [
              {
                "comment": "I used AirBnB with a few friends in 2018 and it was still great. Entire townhouse to ourselves, low rate, flexibility etc. But now it's much more expensive than 3 hotel rooms with none of the benefits.",
                "points": "16 points",
                "children": [
                  {
                    "comment": "Yep, I stayed in a room one night in 2018 while visiting Houston and paid like $40 with the cleaning fee. The good old days. minus the camera aimed at the bed",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "yeah it sucks now. it was cheaper but now hotels are cheaper and easier.\n\ni watched a documentary about a hotel and how the ceo said they were not worried about airbnb at all. it was not even a concern because he knew customers will eventually come back to hotels for the consistent service and prices. i didnt believe him at the time during like 2018 at air bnb peak. boy i was wrong.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "There's so many 'tech innovations' that seem to have peaked in the mid 2010s and are now simply deteriorating for the users as capitalism squeezes out every penny.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "In most cases you simply benefitted from loss leaders. Or more correctly, market dumping.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I agree but my friends don't seem to have realized this so they still want to stay in them so we can all stay together.\n\nOk but like I snore so are you sure you realy want to share a room with me?",
            "points": "10 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "They rate you, give you ‘suggestions for future stays’. Now ‘superhosts’ will ‘assist’ you when you actually want to speak to a staff",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The only useful part for me is where we are staying as a family and it's handy to have separate rooms. The kids are young (1 and 4) so keep each other awake - plus the living room means my wife & I can actually wind down somewhere separately to the sleeping kids in the evenings. To do all that in a hotel would be, well, pretty impossible unless you went for super high end",
            "points": "1 point",
            "children": [
              {
                "comment": "Plus being able to prepare your own meals and snacks is a godsend with kids.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Hotels beat average AirBnBs usually, but if you take your time a well selected AirBnB will crush a hotel on price and quality, especially if you have a bunch of family/friends to split the cost.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Not all airbnbs ask you to clean. Just stay at the ones that don’t. The prices are listed up front",
            "points": "-14 points",
            "children": [
              {
                "comment": "The prices are listed up front\n\nAnd the prices usually suck. The prices are listed up front for hotels too and you know that it means people will cater to you the entire time.",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Ones that don’t ask you to clean are definitely in the minority and likely charge higher cleaner fees.\n\nAirBNB has lost its value proposition it had in its golden days",
                "points": "17 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "This sounds like an ad lol",
            "points": "-23 points",
            "children": [
              {
                "comment": "No it doesn't. Do you have any idea how shit these services are? It's just like Uber costing far more than a normal taxi would expect they are mostly out of business. Airbnbs cost a fortune, require more work than hotels, are far less secure, and you tend to get stuck with bullshit fees. Not to mention they've totally destroyed housing markets in areas because everyone just buys properties to turn into passive income, and boy do they gouge the fuck out of you to do it. If you're in a large group like a family get together sure but otherwise Airbnbs and vrbos have become insanely uncompetitive.\n\nThey time of them being subsidized to disrupt the market is over. They are squeezing you for share value.",
                "points": "15 points",
                "children": [
                  {
                    "comment": "Airbnb charges high service fees when they do little to nothing to assist. They put filthy flats up minutes after they gave me a full refund",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I don't like airbnb either, but come on, naming one specific hotel brand? Who does that?\n\nYes I'm aware it's more than likely not an ad.",
                    "points": "-13 points",
                    "children": [
                      {
                        "comment": "God forbid anyone have a preferred hotel without being an ad.",
                        "points": "14 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "If you travel a lot you'd understand why someone would say they prefer Embassy. I had a few years of frequent work travel and totally get why they prefer a specific chain. I had my preferences for each city I went to.",
                        "points": "5 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Hotels don’t and can’t rate guests. I can find hotel rooms with kitchen pretty easily. I have been avoiding airbnb",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The $300-500 fees are to discourage short stays that are less profitable. When you book 7 days instead of 3 it is less upkeep/traffic of suitcases in and out that damage the floor, walls and furniture. There’s a lot of calculus to Airbnb management that are annoying and don’t make sense to the end user but make sense to the investor.",
            "points": "-23 points",
            "children": [
              {
                "comment": "Yeah.... Those suitcases damaging the floors, WALLS, and furniture. Yeah, that's how humans use suitcases.",
                "points": "7 points",
                "children": [
                  {
                    "comment": "Guess you've never been around clumsy people. I've had friends staying over at my place pick up their 40lb extra large suitcase and gash 3 feet of my wall with the wheel. It happens all the time.\n\nLuckily, I have kids and have been repairing drywall for ages so it wasn't a big deal, but I can imagine damage adding up if you have groups of people coming and going every week.\n\nI've also completely fucked up a section of my hardwood because one of my suitcase wheels were stuck and not spinning at all, I dragged it out of the closet and the wheel left a huge scratch on the floor that will only get removed whenever I decide to buff and sand the floor. One bad wheel and a resident that dgaf can seriously destroy a floor.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "That will definitely stop cameras from being used.",
        "points": "115 points",
        "children": [
          {
            "comment": "Back to the old peep holes and listening cups against the walls.",
            "points": "6 points",
            "children": [
              {
                "comment": "One way mirror action.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Mission accomplished",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "More like \"Better ban cameras so people can't sue us for it when they inevitably find one\"",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The fact that this wasn't already banned is disgusting. \n\nStolen from aflyingsquanch from this article on r/news",
        "points": "347 points",
        "children": [
          {
            "comment": "It's still a wise idea to bring one of those camera locator devices with you to look for hidden cameras. They can be in alarm clocks, charging bricks, etc.",
            "points": "69 points",
            "children": [
              {
                "comment": "They don’t work. Often bark at solid concrete walls with zero holes on them",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "They don't do much",
                "points": "9 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I think you can just use your phone camera. Something like you turn out the lights and then scan the room with your camera",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Any free iPhone suggestions?",
                "points": "-18 points",
                "children": [
                  {
                    "comment": "Try Fing",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "If i recall, they mostly got around it by having it be a company policy that cameras were banned, rather then having it in writing for the host agreements.\n\nTurns out company policy isn't worth the paper its written on lol",
            "points": "10 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I mean there's a huge difference between having one in the entry way and having one in the bathroom.",
            "points": "27 points",
            "children": [
              {
                "comment": "Look, I only have one pointed at the bed to be sure no guests introduce bed bugs.",
                "points": "17 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "i understand this perspective but still strongly disagree with it. I have no qualms with exterior cameras, but passing the threshold of the door. any cameras installed, are in my opinion an invasion of privacy and disgusting. Camera up your private residence all you want. But if you rent that space out to people and still have cameras up, my personal belief is that you are disgusting.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "yea thats the idea but with all the languages its better to be super clear",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Given Airbnb still claim to be only renting our spare rooms when pulled before authorities, a policy that seems to admit most places are not shared with the host is a bold move.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Until you realize a good quality camera could be out there and zoom in on a bugs ass with no loss of quality. Don’t trust any of them period.\n\nEasier to just write them off as the illegal trash they are and rent hotels/motels only",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "\"AirBNB ''bans'' indoor security cameras to remove liability from the company in the event one is discovered\"\n\nCalling it now, nobody from AirBNB is going to do inspections of the rooms they have on their website.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "So you just... steal comments? Why?? Wtf man, I mean at least you're transparent about it unlike bots but, why would you even do that?? Are you paid for karma?",
            "points": "4 points",
            "children": [
              {
                "comment": "nope, just happened to see a crosspost and the original commenter i stole it from echoed my own opinion perfectly. no reason to reinvent the wheel when my opinion on the subject hasn't changed in an hour lol",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It’s been their policy that it must be disclosed in the listing that there are interior cameras. I stayed at one that didn’t disclose it and got a refund and booked a hotel.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You think a blanket ban on security cameras for your private, lent residence is \"disgusting?\"",
            "points": "-6 points",
            "children": [
              {
                "comment": "i think you misunderstand. I believe that cameras inside a domicile that is rented is disgusting and should have always been illegal. The fact that airbnb has not had this as a policy from day 1, is disgusting.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "How do they enforce this? Last I checked they don’t inspect properties…",
        "points": "20 points",
        "children": [
          {
            "comment": "The guest will have to report it and money will be refunded + Airbnb will likely ban the host from listing.",
            "points": "25 points",
            "children": [
              {
                "comment": "they'll just bring a camera with them",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Good way to avoid the cleaning fees!",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "They weren't already??",
        "points": "52 points",
        "children": [
          {
            "comment": "They just had to disclose it in the listing and they were banned from bedroom and bathroom only.",
            "points": "25 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Nope.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "These are the exact problems that arise whenever you let VC-backed 'disruptor' companies wedge their way into a market capture position by repackaging existing solutions in a convenient way that skirts existing regulations. And the dumb dumbs of society fall for it everytime because people are willing to give up a lot of things just for a little bit of convenience and flash.\n\nAwful company along with Uber.",
        "points": "74 points",
        "children": [
          {
            "comment": "Exactly. Also the delivery apps. They have installed themselves and made delivery more expensive and lower quality. Awesome… I can get delivery from 200 restaurants for the price * 4 and itll be delivered by someone who has 5 days on the job, doesnt know the city and cant get inside the gate. Your food is steamed to death by the containers. Dont forget to tip.\n\nOh and did I mention the employee is being paid so little they are actually losing money in same cases on gas and car wear and tear. Just so we can all order delivery from restaurants we should just go and get our fucking selves.",
            "points": "23 points",
            "children": [
              {
                "comment": "Call the restaurant and order pickup or use clover/toast whatever in house system the restaurant uses",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Thats all Ive done for the last 2 years. Swore off that shit after a terrible streak of luck.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "most restaurants simply didn't have delivery before. Basically it was pizza, chinese, or a catering order.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "fuck the gig apps. they are a middleman that fucks both employees and consumer",
                            "points": "4 points",
                            "children": [
                              {
                                "comment": "Oh don’t worry. They fuck the restaurants too!\n\nSomehow you’re paying so many fees yet they still take 30+% of the restaurant’s sale as “commission”",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "from 200 restaurants\n\nAnd half of those restaurants are just the same restaurant with a fake storefront name under a different listing. We have a buffalo wild wings in my small college town and it's hilarious that they have three different storefronts on doordash when there's about 12 total listings in town.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "This is a cynical take.\n\nIn a market where prices are going nuts for literally everything all the time, some type of innovation is welcome. Problems are going to arise, and be fixed. But it's crucial society is not allowed to remain static and without innovation, because that just builds dynasties which benefit the 1%.\n\nThe horrible truth is that designing policy where \"nobody gets hurt\" can actually result in people being hurt.",
            "points": "-8 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Dont blame people for going for a cheap option, politicians are to blame for this",
            "points": "-2 points",
            "children": [
              {
                "comment": "Politicians created this regulations in the first place.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Finally!\n\nI remember seeing people defending the usage of them and I was just creeped out. I've also seen people defending the usage of cameras in long term rentals and am like, \"Uh no.\"",
        "points": "17 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Airbnb sucks anyway. I was duped at one in Vermont. This place was marketed as this zen isolated getaway glamping site on a farm… it was not even 15ft off a well traveled public road on a CURVE. There was a privacy “fence” (which were just tarps), and headlights would still light up the entire campsite. One drunk driver could easily take out the whole fucking site too. Talk about “relaxing” 🙄\n\nAirbnb wouldn’t refund for false advertising either. There was no indication anywhere that it was so close to the road. The host used her disabilities as an excuse (I don’t care) and fought until the end to keep my money even thought we left 10-15 min after we arrived after an 8 hour drive.\n\nEventually, Airbnb did refund me as I was a thorn in their side until they did so. I had already begun the credit card cancel payment process though, so they knew they weren’t keeping it anyway and then just tried to save face.\n\nThey wouldn’t let me leave a review though because we technically “didn’t stay” there. They 100% sided with the false advertising POS host.\n\nFuck Airbnb. Hotels and lodges all the way.",
        "points": "18 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Sure, how will they enforce that?, plus the hidden cameras.\n\nYou will be recorded in many places like that.",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Next ban the use of Airbnb",
        "points": "17 points",
        "children": [
          {
            "comment": "Easily one of the cancer's of our modern society, but idiots still love it cos they \"save a couple of quid\". Obviously ignoring the fact they will spend 100k (£/$/€) more in rent/house prices/mortgage interest over their lifetime by supporting and exasperating this investor for-profit market. But that 'short term £15 saving' though...!! Urghh",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The last time I used airbnb I was very nearly assaulted & kidnapped by the Russian mafia running a weird bait & switch scam in SF.  The cameras were the least sketchy thing about them.",
        "points": "2 points",
        "children": [
          {
            "comment": "Woah, what? Can you explain a little more about the scam because I’d never heard of anything like that. That sounds traumatic.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Ban the sudden cancellations and readvertising when they realise there’s an event in town.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Airbnb cancelled my account for a “party risk” and tried to fuck me out of over $1k when I tried to book a place for family flying in from out of the state for my birthday. Fuck that company.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Fucking good.",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "lol! It took that long?!?!",
        "points": "7 points",
        "children": [
          {
            "comment": "Probably someone from the higher ups kids or relatives ran into indoor surveillance.",
            "points": "12 points",
            "children": [
              {
                "comment": "lol.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Higher up: “Now, it’s mmyy problem 😫”",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Hotels are great. Why people still use airbnb",
        "points": "5 points",
        "children": [
          {
            "comment": "It's great for 5-10 ppl to get a 4 bedroom airbnb compared to hotels",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Wifi",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "More dog friendly options. More private living space.",
            "points": "0 points",
            "children": [
              {
                "comment": "More private living space.\n\nMeanwhile, it's 2024 and they are just now debuting their 'camera free' lodging options...",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This wasn't a thing before? Glad I never used AirBNB",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Only just now? Yikes",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If their history with skirting the law in New York and other cities is any guide, they've probably just been saying its an obligation of the person operating the illegal hotel to comply with all local regulations, and doing their best to avoid any sort of liability.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Fucking finally. The place I stayed in had two in the kitchen/ sitting room, one looking down the stairs and upstairs area, another looking down the hallway leading to exit door. It was like a fucking prison. She even wanted to have another in the sink so it could look up your nose incase you didn't do the dishes.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This won’t stop. If anything it will increase the frequency of customers finding more and more",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "On the airbnb sub I had some heated conversations about these cameras. A lot of airbnb host feel as long as they’re in community areas (kitchen, living room) they are fine. They even tried to compare them to hotels having security cameras in their lobbies.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "About fucking time. Creepy.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "ban airbnb",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Air BNB is effin dumb. Never in a million years would I want to stay at some randos house.\n\nI'm too of that. The house market gets fucked over because rich assholes buy these houses JUST to use as airbnbs. I hate whoever invented that shit and made it mainstream.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You mean they were allowed up to now???\n\nHoly fuck. 😂",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This should have happened a long time ago. It’s the sole reason I stopped using them. That and the ridiculous cleaning fees",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is dumb. The cameras people should be worried about are the ones that the listing wouldn't disclose to begin with and that Airbnb doesn't know about.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m fucking sorry, was this not already banned?!?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Keeping cameras in any form of temporary living space is a violation of privacy. It is the equivalent of a peeping Tom. Personal affairs, business affairs, would all be recorded and kept on record by a third party that otherwise has no business/right being privy to a myriad of private correspondence that could occur during boarding. A legal matter, a business deal, etc.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This presents a fantastic unethical life pro tip.\n\nBring a webcam with you and do your stay. Then set it up on the last day and \"accidentally find it\", snap a photo and then complain to Airbnb.\n\nGet full refund.\n\nTell the people that they're cleaning fee was fucked and that's karma.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Oh kinda like how guns are banned in gun free zones",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "While I agree there’s privacy concerns, the camera movement started because of people trashing airbnbs. I think if many units start getting trashed it will lead to less properties available because people will just decide to rent them conveniently.",
        "points": "-13 points",
        "children": [
          {
            "comment": "hotels get trashed everyday.\n\nThis is a solved problem without needing cameras.\n\nCC and identification on file, lifetime bans and legal action if they don’t pay up.\n\nProblem is that many small business owners are way too emotional and will never actually succeed until they get rid of that bullshit hindering them. Same issue with Turo.",
            "points": "15 points",
            "children": [
              {
                "comment": "Having to take someone to court is a long expensive process. I’m sure not every property owner is super rich that can eat the costs to repair their trashed property if it happens several times in a short period. Comparing a private owner that may own one or two properties to a hotel is a bad comparison.",
                "points": "7 points",
                "children": [
                  {
                    "comment": "that’s why airbnb is general is a shit business model. There’s a reason we didn’t have random people listing properties up for short term rent and it wasn’t that there was no marketing for it like Airbnb would tell their shareholders.\n\nShitty owners who don’t clean, lock the thermostat, lie on the listings, put cameras etc combined with shitty guests who trash the place were one problem that is solved by scale. International property management firms like hotel chains help ensure brand standards at franchises and can carry blacklists of shit guests.\n\nAirbnb, just like Turo, just exists to extract value from where there isn’t any, while enabling emotional and underfunded randos to try and provide professional service.",
                    "points": "9 points",
                    "children": [
                      {
                        "comment": "Well I can’t disagree with anything you said there.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Fucking good they should decide to just rent them to the people who fucking live there.\n\nI feel zero empathy for anyone that this happens to it serves you right and if you can afford to run an Airbnb you can afford to eat the cost of doing business",
            "points": "-3 points",
            "children": [
              {
                "comment": "Oh you must be an “all landlords bad” person",
                "points": "-3 points",
                "children": [
                  {
                    "comment": "Oh no absolutely not I just don’t see it as an investment people are entitled to make with zero risk - any other investment has risk and sometimes you have losses and investing in houses shouldn’t be any different and i think it’s pathetic how people feel that they should never incur any losses only profit I think that’s absurd.\n\nThis doesn’t mean I think people have the right to trash houses by the way it means that people trashing the place is something that a hotel considers to be part of the cost of doing business because people are gonna do things they shouldn’t do and I just don’t feel that anybody who happens to choose housing as the vehicle for their investments should be insulated from that and I don’t feel bad for them any more than I feel bad for the grocery store when someone fucks up and they lose a case of meat or whatever",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Trashed rooms are not a \"cost of doing business\". Hotel chains have armies of lawyers and they WILL get there money back from any guest who causes damage. In many jurisdictions, it's a criminal act and the perp will do jail time or at least have to spring for a lawyer and pay some fines. They will also be blacklisted from the entire chain.\n\nI don't know where this stupid idea came from that all landlords are the evil, idle millionaires. Any idiot with a credit rating in the 700s or better can buy shitty houses all day long, usually for higher than normal interest, but AirBnB can net 3k-5k a month in some markets and if the mortgage payment is a couple of grand, they are making money.\n\nIt's likely that the whole model will collapse soon, at least in high traffic tourist/convention cities like Las Vegas. The real hotel owners are spending a LOT of money clandestinely to get the rug yanked out from under the entire business. They don't like the competition and the neighbors don't like the noise and the party assholes. A lot of cities are going out their way to regulate it out of existence with things like requiring business licenses, imposing extra taxes, and requiring the updating of old places to modern building codes.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "That’s fair. But I think they should be allowed to mitigate some of their risk. If common area cameras are too much of a privacy issue, that’s reasonable, but I don’t see there being much of an argument against cameras at entryways.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "You mitigate the risk by using a platform like airbnb instead of doing it yourself, and if not you do it the same way a hotel does - have them sign a contract when you hand over the keys and leave a deposit. There’s a million ways to go about it. But sometimes it’s going to happen. And that does suck but just like a hotel doesn’t get to film people in their rooms you don’t get to rent out a house as a hotel room and then micromanage the common areas for all guests that’s an unreasonable mitigation and it’s creepy right",
                            "points": "-1 points",
                            "children": [
                              {
                                "comment": "Hotels have cameras in the hallways",
                                "points": "1 point",
                                "children": [
                                  {
                                    "comment": "I would not walk naked through the hallway of a hotel but I might in a house I was renting like a hotel",
                                    "points": "2 points",
                                    "children": [
                                      {
                                        "comment": "That wouldn’t be affected if the camera was only on the entryways to the house, like front door and back door only.",
                                        "points": "0 points",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Good",
            "points": "-3 points",
            "children": [
              {
                "comment": "Okay but don’t people like using Airbnb?",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Sure, but that doesn't excuse them from being a big part of the current housing crisis. Like you said, if they stop being able to charge exorbitant cleaning fees and that means those units reenter the housing market as units for rent or sale, that's a net positive to this country.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "I don’t know how big a part of the housing crisis they are but yeah I’d acknowledge they’re not helping it.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "In some popular areas holiday lets have caused massive issues for local housing, and Airbnb has turbocharged that to another level.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Spoilsports",
        "points": "-13 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Man the Airbnb hate is so massive. I only use Airbnb and I have never felt like I was over charged or taken advantage of in any way. They’re always cheaper than any hotel I can find nearby and I get much more space and bang for the buck. But if there isn’t an airbnb then of course I’ll get a suite type place but for me it’s always airbnb first hotels second.",
        "points": "-4 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc4d54",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.dailymail.co.uk/news/article-13181017/Surgeons-use-Apples-VR-goggles-operation-time-UK-repair-patients-spine.html",
    "title": "Surgeons use Apple's VR goggles in an operation for the first time in the UK as they repair a patient's spine",
    "points": null,
    "comments": [
      {
        "comment": "Misleading headline. “A scrub nurse working alongside the surgeon wore the device to help prepare, keep track of the procedure, and choose the right tools”",
        "points": "1096 points",
        "children": [
          {
            "comment": "It’s a touchless user interface, which is great for a sterile environment. This is a valid use case for the technology.\n\nEven if it’s just a checklist, that’s no pens, keyboards, or touchscreens involved for someone handling sterile tools, and less chance of miscommunication to an assistant.",
            "points": "337 points",
            "children": [
              {
                "comment": "It reminds one of,\n\n“The future is already here, it’s just not evenly distributed.”",
                "points": "135 points",
                "children": [
                  {
                    "comment": "Got people living like it's 2050 and on the other end we have people living in the 1940s...",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Not just sterile environments. There are plenty of places where you don't want to have to use a keyboard such as mechanics working on large and complex equipment like aircraft engines.",
                "points": "19 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Also good way to play videos of Minecraft parkour or subway surfers in case the nurse gets bored",
                "points": "33 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Until you get blood or mucus on it, then it probably has to go in the bin",
                "points": "19 points",
                "children": [
                  {
                    "comment": "I feel like that could be solved by a transparent disposable cover.",
                    "points": "28 points",
                    "children": [
                      {
                        "comment": "a transparent disposable cover.\n\nThat costs a crazy amount of money- because they can charge whatever they want for it.",
                        "points": "8 points",
                        "children": [
                          {
                            "comment": "I can get one for my phone for about 6 bucks.",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Like Rally car drivers",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "They usually use open face helmets. Open cockpit drivers (F1, F2, etc) have tear offs, dirt drivers and riders have more long-lasting(?) systems usually.",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Just replace the glass for only 800$",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "No ads plan for 9.99$",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "It's a touchless user interface that costs thousands and can be replaced by a non-sterile tech with a keyboard, pen/paper, whiteboard or whatever.\n\nA non-sterile tech that needs to be there anyway even if you eliminate that bit of their job.\n\nThe headset also adds issues of reliability, comfort, and points of failure.",
                "points": "-3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Surgeons have been using AR to assist them in surgeries for years. They are using MS HoloLens instead of Apple Vision.\n\nhttps://youtu.be/wb67tATyMWA",
            "points": "9 points",
            "children": [
              {
                "comment": "Or Magic Leap 2, which is specifically UL 60601 Compliant for use by surgeons in procedures.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Lol you would hope a nurse would know which tools to use without the assistance of a $4000 vr device.\n\nEdit: to everyone giving me a real response: it's a cheeky joke. Relax.",
            "points": "258 points",
            "children": [
              {
                "comment": "She definitely knows what she’s doing she’s probably using it as an alternative to a computer she would already be using otherwise. Keeping track of medical equipment is very important during surgery as many surgeons can forget equipment inside the patient.",
                "points": "83 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "It’s probably in testing to see if they can replace nurses with anyone that can wear those goggles and has hands",
                "points": "180 points",
                "children": [
                  {
                    "comment": "Or to record the procedure for other nurses in training to get experience without having to wait for actual procedures. You could record the procedure and have multiple nurses review. The only limiting factor would be how many AVPs they have.",
                    "points": "188 points",
                    "children": [
                      {
                        "comment": "you could do that with a gopro, why would you need a vr headset to record a video?",
                        "points": "11 points",
                        "children": [
                          {
                            "comment": "Probably the spatial video gimmick.",
                            "points": "15 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "I would think that recording the eye tracking could be incredibly useful for training - imagine being able to see exactly what the nurse/surgeon was looking at at any given moment.",
                            "points": "5 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "You can have a floating cheat sheet or checklist to follow. GoPro can’t do that.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "More people care about AAPL than GPRO.",
                            "points": "-2 points",
                            "children": [
                              {
                                "comment": "And welcome wallstreetbets! This is good for investors.\n\nAlso, as with all clunky tech, when this becomes minimized to look less like ski goggles it could help a lot in so many fields.\n\nApple just happens to be the one with boatloads of money and be trendy, so it will catch on faster than Google glass did (which…didn’t)",
                                "points": "7 points",
                                "children": [],
                                "isDeleted": false
                              },
                              {
                                "comment": "Yes. The why matters. And the \"why\" is because vanity. Apple = luxury status symbol.\n\nGlad to know these life saving professions have their priorities in order.",
                                "points": "-6 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Or to make sure they don't leave bananas in the torso.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Fat chance.\n\nSurgeons always say: don't give me what i want, give me what i need.",
                    "points": "26 points",
                    "children": [
                      {
                        "comment": "No, not that one!",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Except that's exactly what the surgeon said if you read the article.\n\nHe added that the technology would 'superpower' his operating team into the equivalent of a Formula One pit crew, saying: 'That's the idea – that it doesn't matter if you've never been in a pitstop in your life. You just put the headset on.'",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "I work with surg techs, circulating nurses and surgeons. It was something the Techs always said. You kind have to know your surgeon and know what they need before they need it.\n\nOf course i work with a few really shit surgeonsc so it's no wonder.",
                            "points": "2 points",
                            "children": [
                              {
                                "comment": "That's fair, I just meant that surgeon in the article wants that.",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "There’s zero chance a layman with hands and VR goggles is replacing a scrub nurse lol",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "You still need training so that you wont contaminate tools, barely worth it",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "“Our goal is to make your job easier”",
                    "points": "7 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "You get a little notification and the goggles highlight the tool the surgeon is asking for. Seems tedious. Most surgeons would rather pay a nurse I think.",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "I wonder if surgeons will have a choice or if it’ll come down as a decision from the board",
                        "points": "-3 points",
                        "children": [
                          {
                            "comment": "If it gets approved for use at all it will be entirely up to the surgeon to use it or not or to what degree. like everything else in the operating room, its up to the lead doc. If they want to listen to Danger Zone on repeat for 9 hours they can. Does not matter what the nurses want/think, though at some point a pissed off team is not a good team. Most surgeons are either controlling/need things a very certain way or are very chill and lax. They may force their staff to use vision pro when applicable, they may leave it up to them entirely.",
                            "points": "10 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "Inside the operating room is about the only place the corporate overlords don’t get to make decisions. They can refuse to buy equipment, fire staff, not allow patients to be treated in the first place, etc. but once the patient is under and in the operating room, the only person making decisions is the lead doctor.",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Most nurses can't stay sterile, let alone most people.\n\nMost of a scrub nurse's job is not handing instruments. It's very complex, but most of all the responsibility involved requires a registered medical professional in case something goes wrong.\n\nAlso, there's no way to sterilise VR glasses so if they move they'd have to have someone adjust them for you.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "That sounds like exactly what the surgeon wants.\n\nHe added that the technology would 'superpower' his operating team into the equivalent of a Formula One pit crew, saying: 'That's the idea – that it doesn't matter if you've never been in a pitstop in your life. You just put the headset on.'",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "It’s coming. Dumb techs wearing smart devices will be in the field. The professionals will be at home on their sofa guiding.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "If that was the reason then it’s absolutely shitty. At one point they’ll try to replace everything no matter how important it is",
                    "points": "-3 points",
                    "children": [
                      {
                        "comment": "While that’s one way to look at it, and I don’t completely disagree, the flip side is that there will be less bottlenecks and more surgeries being done if they can scale this; saving more lives.",
                        "points": "-1 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Apple going to ban this for medical use on TOS, don’t want to be sued later on. Disclaimer disclaimer disclaimer. Same thing with driving.",
                    "points": "-7 points",
                    "children": [
                      {
                        "comment": "I doubt they made it into hospitals without this already being taken into consideration. Because that would be a monumentally dumb move. Apple does a lot of stupid stuff for sure, but this might be a bit of a stretch. I could obviously be wrong though.",
                        "points": "3 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "I doubt it. Apple would LOVE to get further into the healthcare market.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Oy… to think you are smarter than this surgical team after reading the headline…\n\nY’all need to let professionals do their experiments without instantly calling them dumb.",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Everyone makes mistakes at their job sometimes. Reducing errors during surgery seems like a good thing.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Clearly they're not going to have a nurse in the OR that needed this to do her job. The surgical assistant wearing it said this was a test to confirm the tech worked for new staff to immediately assist without specific training for new procedures.",
                "points": "13 points",
                "children": [
                  {
                    "comment": "But do we really want “new staff to immediately assist without specific training”?",
                    "points": "-7 points",
                    "children": [
                      {
                        "comment": "Doesn't matter what \"we\" want. What do the doctors and staff need? As hospitals continue to fight with staffing shortages, having a surgical assistant who knows their job well, but may not be intimately familiar with a particular procedure, can use this tech to eliminate any chance of issues in the OR. If I were undergoing surgery, I'd be all about a tool that helps guarantee a mistake-free operation.",
                        "points": "11 points",
                        "children": [
                          {
                            "comment": "As hospitals continue to fight with staffing shortages\n\nHospitals could like, I dn, give nurses and staff raises and retain them as permanent employees instead of paying traveling contract nurses 3x as much? Seems like a better use of resources than apple vision pro. Seems like paying staff a fair wage and having consistent employees is better for safety than rotating thru a different set of nurses every few months. Maybe.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "Well, when you put it like that I’m all for it! I’m just thinking all members of the surgical team should be trained for whatever it is they’re doing. If it’s not possible - sure, let’s go for the next best thing.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "If the alternative is “new staff immediately assists without specific training AND without assistive technology” then yes.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "Never thought this was an option, to be honest.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "If someone comes in to the ER with a life threatening injury, you can’t wait for the optimal team to arrive, you work with what you have. If a nurse passes out halfway through an 18 hour surgery, you don’t just stop and wait for them to recover, you work with the team you have. If you’re in the middle of a war zone or the aftermath of a natural disaster, you don’t stop and wait for a trained team to arrive, you work with who you have.\n\nIf this ends up being a viable tool to turn amateurs into competent assistants then it’s worth having as an option or backup.",
                                "points": "6 points",
                                "children": [
                                  {
                                    "comment": "Fair enough, better have it and not need it than to need it and not have it.",
                                    "points": "0 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Instead of „no staff at all“? Sure.",
                        "points": "-1 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Yes, I’m sure a doctor never looks at chart notes or references anything during a surgery!",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Surgeries are very long and very difficult; if there’s a means to reduce the possibility of error due to fatigue, we should use it - this is one of them.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "if it can reduce errors...",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "You would hope a professional pilot would know how to get a plane ready for takeoff, but guess what? They still have to follow a paper checklist and read / check every item on it.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "You would hope that, but we also live in a world where surgeons will routinely write words like, \"DO NOT CUT OFF THIS LEG!\" on a person's good leg before an amputation operation. You'd think that the surgeon should know which leg to cut off, but it's happened often enough that this sort of thing is now standard procedure. You'd think these people would be good enough at their jobs that they wouldn't have to resort to a very basic checklist at the beginning of a procedure, but they do, because shit happens in a surgery and you don't want the surgeon saying, \"What do you mean the blood bank closed at two?!\"\n\nSo, when it comes to things like counting clamps, if they spend four or ten or twenty grand per operating room, to make sure that a clamp or other tool is never left in a patient, that's money well spent, because the cost to get that clamp out is way more than the cost of an Apple Vision Pro, and that's before you get to potential litigation over pain and suffering.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Checklists are a failsafe so you don’t go through things on autopilot and skip a step. Pilots also have extensive checklists, and there’s more than a few crashes where one of the causes was the pilots not following the checklist (American Airlines 1420, for one example that I just pulled off of Mayday’s episode list). These aren’t tools of people who aren’t good enough, it’s for the people who can’t risk failure. The more intensive the job, the more you don’t want them to coast, so you put more failsafes in place.",
                    "points": "10 points",
                    "children": [
                      {
                        "comment": "Checklists are way easy to cruise through. You can also fill out a checklist before you do anything, or at the end when you check off all 50 checkboxes at once. Having a second set of eyes verifying that all parts that went into the patient are accounted for at the end isn’t something you can do in advance or after the fact.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "At least with pilots, it’s usually one person reads out the checklist and the other one does the thing, repeating the command as they do it. These aren’t one person jobs, there’s a reason why multiple people handle it.\n\nBut also, I guess you’re not wrong that if you use a checklist incorrectly you’re going to have trouble.",
                            "points": "2 points",
                            "children": [
                              {
                                "comment": "Plus if the headset can recognize surgical instruments and procedures it can fill out the checklist all by itself. One person’s salary saved. Well worth the cost of the headset. Courtesy for-profit health care.",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Now they can hire under qualified people with the assistance of those goggles and pay people even less ✨🎉👏🎊",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "How do all other nurses in the world know that? )))",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "$3500",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "Tax ain't cheap in cali",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Well fuck",
                        "points": "-1 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Journalism is annoying these days. Like, a scrub nurse is far from a surgeon. They assist. Yet the journalist lumps them all together.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "A nurse using it in the theatre is surgeons using it, its the surgeons theatre, its their team helping them do their job.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "the worst idea i have ever heard. i’m glad it’s not the surgeon. but the resolution of this headset would classify you as legally blind. not to mention the 30Hz tracking.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Following the YouTube tutorial.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This article doesn't know what it's talking about. They claim the Vision Pro was designed for computer games...which is the last thing Apple had in mind. Also, they claim that AI tracks how well the surgery goes?? What AI does that? This is a fluff piece with no real information on how it's useful for the industry. They probably just had basic notes and images up to make referencing and notetaking easier as another commenter stated.",
        "points": "60 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wow that’s awesome. Those spine cases can get real long and boring, so being able to toss on some Netflix would be really helpful.",
        "points": "337 points",
        "children": [
          {
            "comment": "some random indian guys how to fix the spine video in 360p with fraps watermark in the corner",
            "points": "178 points",
            "children": [
              {
                "comment": "Wow, fraps. You unlocked a hidden part of my memory files from like 12 years ago lmao",
                "points": "31 points",
                "children": [
                  {
                    "comment": "Fraps, the successor to Unregistered Hypercam 2",
                    "points": "18 points",
                    "children": [
                      {
                        "comment": "Can’t forget a little 009 sound system - dreamscape for the full experience",
                        "points": "7 points",
                        "children": [
                          {
                            "comment": "and just type whatever you want to say into Notepad",
                            "points": "4 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Probs they spoke on TeamSpeak too",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "Teamspeak is still alive and well, especially in gaming communities.\n\nIt's like Discord without the spyware and spam",
                        "points": "8 points",
                        "children": [
                          {
                            "comment": "So glad to hear about this, it was amazing back in the day. Unfortunately I don’t have the time to play as much and to use it.",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "009 Soundsystem",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Hidden memory unlocked",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Performing spine surgery with subway surfers gameplay and family guy clips on the side",
            "points": "8 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Or watch a “How to perform spinal surgery” Youtube video. Real convenient",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This is great, but also it's not the first AR/VR/XR device to be used this way.\n\nMicrosoft Hololens: How Microsoft HoloLens is helping surgeons work together across thousands of miles | Windows Central and this is just the first article I pulled up on search.\n\n​\n\nHTC Vive, Sony VR, Oculus (maybe others) have all been used in surgery as well.",
        "points": "58 points",
        "children": [
          {
            "comment": "Magic Leap 1 and 2 as well.\n\nThere is a specific ML2 SKU for use by surgeons in operating rooms.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "using a VR headset would ruin your reaction times and eye sight. you would have 20/60 vision.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Right, and a Model T was driven before a Lamborghini",
            "points": "-7 points",
            "children": [
              {
                "comment": "Cmon man it’s not even like that at all.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Ok. Those are comparable devices then?",
                    "points": "-5 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "aha!, but when you use a Logitech joystick to drive a submarine....",
        "points": "33 points",
        "children": [
          {
            "comment": "The image of the victims rapidly pinching and scrolling in the air as they try to gain control of the sub is a horrifying vision of what the future may hold.",
            "points": "10 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Thats not the surgeon….",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can the goggles survive the autoclave if they get covered with infected bodily fluids?",
        "points": "2 points",
        "children": [
          {
            "comment": "You just pop open a new one each operation.\n\nEdit: googling there seems to be other ways to clean medical equipment. Autoclaves are used when possible otherwise some sort of chemical method is used instead.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You don’t autoclave your safety goggles. Why would this be any different? Autoclave is for instruments",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "theres no way the passthrough is good enough to perform surgery with it on lol",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Fluff pieces won't work",
        "points": "23 points",
        "children": [
          {
            "comment": "Won’t work what? They made hundreds of millions in the first day just off of those orders. Reddit is such a bubble.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Unless YOU are a surgical nurse, you are clueless. Stop bashing progress",
        "points": "8 points",
        "children": [
          {
            "comment": "I can easily see why this would be useful for a nurse in an OR.\n\nYou have access to tablet features without having to carry and sanitize a tablet device in addition to being able to read and manipulate information without losing the ability to use your hands.\n\nThat isn't even touching all of the possible AR applications.",
            "points": "2 points",
            "children": [
              {
                "comment": "Tons of applications! People are hating but it’s progress in the right direction if you ask me. When it comes down to it, I want me medical team to have every technical advantage that’s available when providing my care🤷‍♂️",
                "points": "2 points",
                "children": [
                  {
                    "comment": "You’d think for a subreddit of supposed gadget enthusiasts, these commenters would be a little bit more imaginative about the potential applications of a new tool. “These nurses are probably just using it for the spacial video gimmick” 😂 lol sure buddy.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Well, Reddit’s certainly not gonna pass up an opportunity to do some easy Apple bashing.",
                        "points": "4 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "For real😂 no what they probably used it for was quick access to patient charts, keeping track of equipment coming in and out, and just staying more organized. Does it sound slightly trivial right now? Ya sure, but it’s just the start!",
                        "points": "3 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "You don’t need to be a surgical nurse. You just need to know the limitations of current VR hardware to know this is a bad idea.",
            "points": "1 point",
            "children": [
              {
                "comment": "Blah, blah, blah. Said the car mechanics when EVs appeared",
                "points": "-5 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "are you one? you seem like just a tech illiterate person that frequents Futurology.",
            "points": "-2 points",
            "children": [
              {
                "comment": "No, but I built hospitals, and many OR’s.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It wasn't the surgeon, it was a scrub nurse who was recording the procedure - no way remotely suggesting an ER scrub nurse isn't essential but this headline is typical media over-hyped drivel.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Apple ad",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ah the Daily Heil, top primary source for medical news.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I may get downvoted for bucking the Reddit tradition of shitting on anything Apple that is priced above a Big Mac, but this is pretty cool and should help reduce error in the OR.\n\nSome of y’all need to wash the salt off",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Probably YouTubing what to do in real time",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Did they get high score?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Awesome. So there’s hope I can play poker while working…./reads article/….oh well.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As someone who has had a spinal surgery, I like it when the surgeon uses their own eyeballs.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Of course this happened.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'd be super worried about keeping it clean.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“The underlying AI software also keeps a note of each stage of the operation – and in future will measure how well it went against similar procedures performed by other surgeons.”\n\n“How the fuck does Steve in Alabama keep getting the high score on these surgeries? Is he using the Konami code?”",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Really cool stuff for the future. I’m friends with the owner of Exex (who created the software used here) and not even 10 years ago he was just doing movie production and photography. Eventually he pushed into AR because he saw a lot of potential, though I never expected he’d end up taking it to the medical industry.\n\nFwiw, these glasses are currently used to track the materials and tools used during surgeries, not necessarily “assist” with surgeries in a medical way. At least not yet — who knows what capabilities AR will have in the future.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It would help less experienced individuals work together, i.e those who do not know the names of the surgical tools, tissue or organs to be retracted. I think this eliminates the guesswork. I do not see a formula 1 pit there😂",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No bill you still look like a dork",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm sure the patients end up paying for goofy shit like this.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m going to pass on that assisted surgery.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Imagine your doc is about to replace a hear valve with these on and he gets a pop up notification saying he has a new friend request on Facebook …..",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The OR lights often have a camera built in the handles pointing at the action to be viewed on monitors. Usually for teaching purposes. The goggles add no value. If anything, if they shift, it would be a nuisance to adjust them while maintaining aseptic technique.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They are watching a how-to video on YouTube while doing the surgery",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hang on, sending noods now",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "why do they want me to buy one so bad?",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I bet he was looking at porn",
        "points": "-4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Imagine if the surgeon was wearing it and had a 24 hr surgery. They would need to stop the surgery many many times over or they would be tripping over wires. What's next? \"NFL quarterback is using apples VR to help read the defense\" lol",
        "points": "-2 points",
        "children": [
          {
            "comment": "Do you think a 24hr surgeries are done with no breaks? They probably take a break every couple hours. Humans unfortunately have limits my guy.",
            "points": "1 point",
            "children": [
              {
                "comment": "Here comes the apple dick sucker ready to suck it lol every surgery is different of course dummie. In this line of work it needs to be close to perfect and you can't have a device that has so many flaws. There seems to be no limit of how much apple dick you can suck, that's for sure 😊",
                "points": "-3 points",
                "children": [
                  {
                    "comment": "Seek help.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Bro I'm just saying that charging and swapping batteries are likely of no concern.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Are you serious right now? You can't even do a fast battery swAp on this overpriced VR. There's also lowlight limitations with the camera that can't be happening with something as serious as surgeries. Batteries suck so the two things you point out are some of the bigger problems with the AVP. Do you even read anything besides from what apple feeds it's cult members?",
                        "points": "-2 points",
                        "children": [
                          {
                            "comment": "As I said I don't care about anything but the claim that doctors would be tripping over wires. If you want to rage against apple you can do so else where my guy. There are tons of solutions to the battery problem. For example someone could make a device that enables hot swapping of batteries. Basically you would put a small battery between the headset and the main battery pack.",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Apple dick lol",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Incoming malpractice lawsuit in ...",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ah, that's why it costs so much to go see a doctor.....",
        "points": "-4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why, why, why, why, why2, lehy...\n\n-Billy Gnosis",
        "points": "-7 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc3tbl",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://9to5mac.com/2024/03/10/ios-18-airpods-pro-hearing-aid-mode/",
    "title": "iOS 18 to include new 'hearing aid mode' for AirPods Pro, report says",
    "points": null,
    "comments": [
      {
        "comment": "I'm a hearing aid wearer and have been waiting for this forever. The sound that comes out of hearing aids is terrible. I stream music to them and it sounds like a AM radio.\n\nHearing aids with real speakers? I'm in.",
        "points": "45 points",
        "children": [
          {
            "comment": "I'm convinced that apple, sony and co have been selling tech solid enough to completely destroy the low to high-mid range hearing aid business for a while and it's just an few lines of code that a competent engineer can plop in a month.\n\nThe problem was always legislation. It's good they are doing it and I hope it comes to Europe as well. I'm honestly fed up with people being ripped of 3k for very average devices by today's standard.",
            "points": "5 points",
            "children": [
              {
                "comment": "Might this come to Canada too? fingers crossed",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Is this all Pros or just Pro 2s?",
        "points": "9 points",
        "children": [
          {
            "comment": "That's the right question. Unfortunately, we know the answer. Apple doesn't do anything out of good will.",
            "points": "-28 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'm 100% deaf in my right ear. Never getting it back. I can get hearing aids that play sound from my right side in my left ear, but they all suck at filtering out human speech, or are expensive. I've tried various ear pods but the lag has been noticeable enough to annoy me. If they can fix that it would be a dream for me",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can’t wait to try these out at 21",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "this is amazing! hearing aids comfort and quality can be much lower than airpods",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Might this come to Canada too? Dunno what the laws are like here vs. US around this stuff.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Gonna guess these will make it easier to listen in on other’s private conversations?",
        "points": "-20 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We can’t even change the volume of a video independently while on a call and they’re adding a hearing aid. I get it’s helpful for people in need but wtf bro",
        "points": "-8 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc2uc8",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.techspot.com/news/102211-nvidia-rtx-50-series-blackwell-gpus-tipped-use.html",
    "title": "Nvidia RTX 50-series Blackwell GPUs tipped to use 28Gbps GDDR7 memory with 512-bit interface",
    "points": null,
    "comments": [
      {
        "comment": "Can't wait for the 5000 series to arrive, so the prices of the 4000 series will drop enough for me to be able to afford a 3000 series.",
        "points": "810 points",
        "children": [
          {
            "comment": "And ultimately pull the trigger on 2000 series",
            "points": "179 points",
            "children": [
              {
                "comment": "Ha, I wish! I'm stuck with an almost 6-year-old GTX1080ti, and will probably stay that way for some more time.",
                "points": "70 points",
                "children": [
                  {
                    "comment": "I'm still rocking the GTX 760 😎",
                    "points": "23 points",
                    "children": [
                      {
                        "comment": "I have an original Titan lol",
                        "points": "4 points",
                        "children": [
                          {
                            "comment": "I have a nice Titan black sitting on my shelf. If it supported FSR it would still be a decent gpu still. Before a certain update it played cyberpunk fine at native 900p 30-40fps high/medium settings",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Aw man I remember putting an aio on my 760. That thing still got hot lmao",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "High five brothers!\n\n(Help us T.T)",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Boy do I remember my 760 (mobile, not desktop, lol) days...",
                        "points": "3 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "My Gtx 1080 is now struggling to play Fortnite.",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "You should try taking it apart and cleaning it out. It’s probably caked with dust at this point.",
                        "points": "3 points",
                        "children": [
                          {
                            "comment": "I did. I’ve reapplied thermal paste and everything.",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "Damn, that sucks. The 1080 was such a great card.",
                                "points": "1 point",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Gtx 1060",
                    "points": "9 points",
                    "children": [
                      {
                        "comment": "It’s like the Toyota Camry or 4runner of the world. Everything you need, nothing that you don’t and keeps going.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "1050Ti here and I see no reason to upgrade",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I ran mine for ages and finally went for a 3090ti\n\nStill kicks ass but I'm probably good to go until 6 series this time around.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "I have a 3090 and I think I'll rock it until it literally breaks. I mean it's still plenty powerful and 24 gigs of vram is a very comfortable amount. The day it becomes \"obsolete\" will be a sad one.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "Yea there hasn't been a game i can't crank at 4k yet",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "TBF That card is a little demon and a mistake Nvidia will never make again.\nI'd still be rocking one if it hadn't of died...\nYou've skipped enough generations that I think you deserve a little 50-series action though, ;)",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "I have one and it runs EVERYTHING. I’ll upgrade in a few years lol",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "I could run 4k on it at like 30-60 fps depending on the game. Was such a good card... Nvidia had to take away some of that VRAM to make sure lightning didn't strike twice",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Same boat man. I literally can't justify upgrading. Especially when you compare price to performance thing. I play mostly indie games and esports titles. And what AAA games I do play I'm usually fine on high/med at 1440p at 144hz. Sure it's a slog on games like cyberpunk or starfield. But I don't play those games.\n\nPalworld ran smooth as butter. And the wife is playing helldivers just fine right now. The other thing that makes it hard is i basically paid $550 for my 1080ti back in the day. Bought it right before the cryptoboom. So it's really hard to justify paying the money for a new card.\n\nIt's so hard to believe the 1080ti was the BEST card you buy back then. And the msrp was $700. And could be had for less. Meanwhile the second best card now is the 4080 super at $1000. The 4090 is the best card to buy and is $1600. That's almost 3 times the cost of what i paid for my 1080ti",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Just went from a 1060 to 4070 ti super. Life is good.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "1060 MASTER RACE",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Hi brother",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Hello 1080 brother! Mine is not even ti.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I have a 1060 3gb still….. lucky",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Jokes aside, as a 2080 owner since '18, don't do this unless you absolutely can't afford anything better.\n\nThe 20 series is the black sheep of the Nvidia family as far as performance goes. They were developed and marketed around ray tracing, and while it's fun to mess with, it means they didn't get the same performance improvements typical of a new Nvidia series (somewhere around 20% vs. the 30 series' 50%+). They're really starting to show their age now on newer titles, especially at 1440p.\n\nJust way better bang for your buck on the 30s if you're buying used.",
                "points": "14 points",
                "children": [
                  {
                    "comment": "Just said similar about my 2070S. Still a good card, but the 30xx cards got a better performance bump over the 20xx series than the 20xx cards did over the 10xx series and ray tracing was more consistent/better all around. The 40xx cards are even better on both fronts of course but the jump is smaller again except on the 4090 and the prices jumped by so much more the cost:benefit is atrocious.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "But the 4070 is built to essentially negate most new 30' series card buyers decision to buy the 30' series except for the true mid range bargain buyer.\n\n4070 pretty much outperforms the 3090 and is priced competitively with the 3070",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "My buddy sold me his 2080 super for $150 about 6 months ago.\n\nNow I just need to upgrade my CPU/mobo/ram to something relatively modern.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I'm on a 2070 Super I got back when they were fairly new and it was actually still a reasonable ask to get a GOU for not down payment on a home costs. I'm already starting to feel a little pinched on some of the newest stuff. Hardly \"my card is bad now\" or anything, and it's Ray tracing was kinda meh on launch in titles contemporary to it, but lowering settings to play the newest stuff even when well optimized* has started to be a thing for me.\n\nCame to this one from a 970, skipping a generation. Skipped a generation to get to the 970 as well, though from a Radeon card. I might be skipping three or more generations this time, just because it will take at least that long for something else to fail and warrant a complete rebuild.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "I went from a 770 to 970 to 2070S, where I'm still at. The newest game I've played on my PC is the Mass Effect Legendary Edition. I honestly feel it's another 2 years, minimum, before I decide to upgrade my rig, because between having a more established career and not playing many games (and even then, I'm happy with 4K 30FPS - I'm not a big fan of how 60fps looks), there's not much point upgrading. Similarly, it'll be a while before something else fails to warrant a rebuild.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "No, no one should buy those. Terrible cards.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "You mean, The Plug?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "You mean, The Plug?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Ha, good luck with that.",
            "points": "77 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "My 1080 still going strong\n\nAlthough I am slow building a new pc. Old one is black and purple. New one going to be white. Buy the case, power, cooler, hard drive, and wait for discounts on the processor and graphics card and ram while saving up to buy them. So it sits empty for a while but it also allows you to push back buying the parts that get changed and upgraded the fastest",
            "points": "11 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I’ve got a 3 and 4 series I’ll sell you when the 5 comes out. 😂😂😂",
            "points": "6 points",
            "children": [
              {
                "comment": "I'm currently accepting donations :)",
                "points": "6 points",
                "children": [
                  {
                    "comment": "I’ve got some boxes to donate to get you started?",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "😁",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "where I live OG gtx titans sell for the same prices a 1080/1080ti. R9 gpu sell for the same prices as 1070/1070tis. Age doesn’t really mean anything where I live. Everything is priced stupidly high for older cards. I bought an R9 280 for $40 CAD and compared to every other r9 280 I got it for about $60-$100 cheaper than other ones. Sucks because I really want another XFX DD r9 280 to build a crossfire system",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "3060 OC 12gb is 300 at best buy. And a 4060 is the same price.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I don't think you understand what the word 'drop' means.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yep.\n\nTo be fair, I haven't found a reason to upgrade from my 1070 as yet. It can run every game at 1440p with usually Max settings. So I'm quite happy with that.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Will still ship cards with 8gb or less",
        "points": "135 points",
        "children": [
          {
            "comment": "5080, 12gb vram take it or leave it",
            "points": "33 points",
            "children": [
              {
                "comment": "12gb? You trying to lose that 2tril valuation? Gddr7 is faster, so you can clearly do more work with less of it!",
                "points": "21 points",
                "children": [
                  {
                    "comment": "apple's 8gb ram imac mentality",
                    "points": "11 points",
                    "children": [
                      {
                        "comment": "Exactly. Think different, or something",
                        "points": "6 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Slightly better than the 4080. Worse than the 4090. $500 extra.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Selling Kidney to buy Apple is old news, Selling soul to buy Nvidia is new",
        "points": "120 points",
        "children": [
          {
            "comment": "Two kidneys means you can have both",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Two kidneys means you can have both",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "My current souls doesn’t have DLSS 4.0. Imagine what 50 series will do. Those tensor cores maybe able to render a real life woman for me to touch!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Glad to hear they'll set aside some damaged wafer scraps for the gaming plebs to sell for 3000$ while making the real money with AI devices.",
        "points": "112 points",
        "children": [
          {
            "comment": "With any luck, the AI hype will have gone down by 2025. I can’t imagine companies continuing making crazy capex every year on AI chips. And hopefully other competitors will be able to compete with NVIDIA.",
            "points": "-4 points",
            "children": [
              {
                "comment": "lol, AI aint going anywhere",
                "points": "63 points",
                "children": [
                  {
                    "comment": "All those AI companies making sooo much money. Wait, it’s just NVDA selling the shovels to the gold panners? 💥",
                    "points": "13 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Yeah but I think companies won’t be using GPUs to do AI tasks much longer. Dedicated AI machines will be much more efficient",
                    "points": "9 points",
                    "children": [
                      {
                        "comment": "What dedicated AI machines?...lol no such thing exists.",
                        "points": "4 points",
                        "children": [
                          {
                            "comment": "Yes they do. I think linus even has a video on one.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "Yet, do you really think companies aren’t working on them right now? Kind of like how ASIC miners replaced GPUs for crypto",
                            "points": "-3 points",
                            "children": [
                              {
                                "comment": "…who do you think is making those? It’s all nvidia lol.",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "AI isn’t going anywhere, but hype will die down. People will start investing less in it and nvidia will circle back to gamers again",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Did you see NVIDIAs earnings report and how much money they make on AI chips? I’m surprised they are even still making gaming cards at this point. If NVIDIA gets a full stranglehold on the AI business, I don’t see them caring about gaming cards in a few years. Could be an over reaction but they literally are selling a game-changing product in the world.",
                        "points": "6 points",
                        "children": [
                          {
                            "comment": "AI business will fall down in a couple of years once hype dies down and when most people get disappointed by the technology since current AI isn’t a real AI and we are decades from it.\n\nThese current AI in reality are automated algorithms trained on different data. They aren’t sentient and rely too much on input and settings. They have limited usage in real world, we will keep using them of course but excitement and investments will dry down a lot.\n\nGPU market is decades old at this point and not going anywhere, as long as Nvidia will keep working in this sector, they could always pick up back and scale manufacturing.\n\nUnlike AI business that is as risky as Bitcoin was a few years back and backed then Nvidia made great money on it",
                            "points": "-2 points",
                            "children": [
                              {
                                "comment": "",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Lol Nvidia doesn’t give a flying fuck about gamers and will never make them a core business again. They make their money in the data center, and it was like this well before the AI boom",
                        "points": "5 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "You wish but they've been making more and more of their money with datacenter stuff in recent years, AI or not.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "Yeah but as far as I know not AI related solutions for Datacenters use different Dies so it doesn’t directly affect GPU part of their business.\n\nAnd since Nvidia isn’t going to leave GPU market, prices for GPUs should drop eventually when AI hype dies down. It will take a year or two however and in the meantime we will keep hearing Nvidia CEO preaching how AI will take over all jobs and programmers won’t be needed lol",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "It's a different die but it'll take up a greater amount of their available chip fabrication capacity, and that's a difficult thing to grow as demand for high-end chips is very high at the moment.",
                                "points": "0 points",
                                "children": [
                                  {
                                    "comment": "I didn’t look how close their architectures are so I will take your words for it and in this case you’re right. Who knows what they will decide to do. People are still buying 4090 non stop, so I won’t be surprised if price for 5090 would be even higher.\n\nActually I think it’s basically guaranteed lol",
                                    "points": "0 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "AI is the new ass, and ass ain’t going anywhere.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "That's here to stay, I'm afraid. Big Corp can't stop fapping over it.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Well of course, that's the main thing AI is good for",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "“Remember” the blockchain?",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Remember when the processor used to be the most expensive part of the computer? Pepperidge Farm remembers.",
        "points": "100 points",
        "children": [
          {
            "comment": "Remember buying sound cards?",
            "points": "54 points",
            "children": [
              {
                "comment": "And a network card",
                "points": "15 points",
                "children": [
                  {
                    "comment": "I remember putting a dialup phone card in a computer.",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Wild times.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I remember calculator co-processor cards... but TBF that's when the CPUs where cards...",
                "points": "2 points",
                "children": [
                  {
                    "comment": "But do you recall when your program was a deck of cards?\n\nhttps://en.wikipedia.org/wiki/Computer_programming_in_the_punched_card_era",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "No. Do you? lol",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "I don’t remember back that far. I’m 40 and have been messing with computers since I was 4. I remember some of my first games being played on what looked like 8 track tapes though. And some even used cassette tapes. Teddy Ruxpin did not like that.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "it still can be if you go high end enough",
            "points": "24 points",
            "children": [
              {
                "comment": "You can but you don’t need to if you all do is game.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Goal posts moved.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "An old FX-8350 can still game, barely.\n\nI'd imagine a modern high end chip is gonna have some insane longevity.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "I used to have that CPU and it was nice with my GTX 970 almost 10 years ago lmao.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I remember back in the 90s buying 2 3DFx Graphics Voodoo II cards to run in SLI mode for about $170 ($321 in today’s dollars). And I felt bad about spending that much.",
            "points": "7 points",
            "children": [
              {
                "comment": "Hell yeah",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Remember when the CD Rom drive was the most expensive part of a computer?",
            "points": "5 points",
            "children": [
              {
                "comment": "Yes.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Meanwhile back in the real world.\n\nhttps://www.scan.co.uk/products/amd-ryzen-threadripper-pro-7995wx-tr5-zen-4-96-core-192-thread-25ghz-51ghz-480mb-cache-pcie-50-350w\n\n£9,899.99",
            "points": "-2 points",
            "children": [
              {
                "comment": "Well when I think of a processor the threadripper does not come to mind. Lol. That is a major one off.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "That will be a cool $4,000 drop.",
        "points": "76 points",
        "children": [
          {
            "comment": "I wonder if the bank will start offering GPU loans like they do auto loans.",
            "points": "27 points",
            "children": [
              {
                "comment": "I’m sure all of these little loan companies are just waiting.",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Microcenter card ftw. Can choose from either 6month interest free payment plan or 5% off",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "What’s that be for the introductory model 5060",
            "points": "16 points",
            "children": [
              {
                "comment": "You know it. The Ti version will be $4500. The 5090 will require you to cut off a leg of your choice and big toe of the other foot.",
                "points": "10 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "But it comes with amazing features like power connectors that melt and smell like burnt plastic! Some even provide internal case decorative lighting by igniting on fire!",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "A dollar per watt",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Costs are up please understand",
            "points": "-3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I can't wait to play OSRS on this beast.",
        "points": "13 points",
        "children": [
          {
            "comment": "So true. 16x MSAA shaders 240hz VRR runescape 😎",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Sitting here playing osrs on a 3090. Worth it to have above average fps in 1 particular area",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "People keep complaining about Nvidia’s prices (rightfully so), but yet Nvidia can keep charging that much because obviously people are willing to pay those prices. I wish people had more of a backbone and just waited.",
        "points": "35 points",
        "children": [
          {
            "comment": "The bitcoin shitstains fucked the market for everyone forever .",
            "points": "35 points",
            "children": [
              {
                "comment": "AI is the new mining. People buy high end cards for AI work tasks. More gamers are picking a tier of one lower than before, so even those models are more expensive. But the one thing that fucked the most, was inflation. Even my semi new summer 2019 card RTX 2070 Super was 589€ (just checked). With Euro inflation calculator that is equal to 714€ in 2024.",
                "points": "22 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "How? They're not even viable anymore and haven't been for a long time. blame the shitty companies for price gouging.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "It's arguable that they're not price gouging, there's not a ton of excess manufacturing capacity and they're selling all the GPUs that they're making. Issue now is that AI is blowing up and greatly benefits from GPU processing power.",
                    "points": "10 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "It’s an obviousism that they’re price gouging and they’re ***** in this as well. The bitcoiners made the environment to “make it acceptable” for them to price gouge and still sell. Doesn’t matter what’s happened since, prices won’t go down (imo) and ppl are now accepting of those prices (or not and don’t buy).",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Clearly it’s working look at their stock prices",
            "points": "2 points",
            "children": [
              {
                "comment": "It's the same story with Tesla, where share prices are substantially higher than the 15 year ROI would suggest. People are jumping on the hype train and driving up those share prices to ridiculous levels.\n\nIf I owned NVidia stock right now, I'd be selling all of it, and then waiting for the crash to buy my stock back at a substantially lower price.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "$970s the other day was definitely when to sell, absolutely insane considering it was around 250 a year earlier",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Right now Nvidia is keeping their margins mostly because of the business division and the IA craze. Gaming isn't doing record sales anymore, the 4080 had very bad sales compared to previous generations and making amd 7900 xt's series selling much better than usual compared to Nvidia, 4090 sales over time slowed down enough that Nvidia chose to basically limit supply heavily and shift production of the chips away from gaming in order to avoid having to lower prices.\nIf the IA bubble ever pops, they will be humbled fast, as the great majority of gamers will never spend over 1000$ on a gpu.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Trade my Nvidia 1070 for the Steam Deck you bought.",
            "points": "0 points",
            "children": [
              {
                "comment": "You’ll have to pry my Steam Deck from my cold dead hands.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Will still come with 8GB VRAM.",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "reminder that you can find used 6700xt's for around ~$250 USD that can basically play any modern game in 1440p 60fps\n\ndon't let nvidia fuck up the gpu market again pls :)",
        "points": "6 points",
        "children": [
          {
            "comment": "Ick, anything under 4K, may as well rub Vaseline on my screen.\n\n^s",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "But will they finally start using DP2.0 like AMD and Intel?",
        "points": "13 points",
        "children": [
          {
            "comment": "DP 2.1",
            "points": "1 point",
            "children": [
              {
                "comment": "Hey, lets not get ahead of ourselves. I think a 4 year old standard is a more reasonable expectation.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Every leaker has confirmed it. Only thing in limbo is if the cards will utilize a 512-bit or 384-bit memory bus",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yesterday I read they weren’t using 512.",
        "points": "3 points",
        "children": [
          {
            "comment": "Who knows what tomorrow will bring",
            "points": "14 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "but will it run crysis?",
        "points": "3 points",
        "children": [
          {
            "comment": "Sure, but first your wallet must go through a crysis for you to own it.",
            "points": "3 points",
            "children": [
              {
                "comment": "eh… gotta pay to play. 🤷🏼‍♂️",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Can’t wait until the first variant of 5080 comes out and it’s still only got like 8gb of vram, so they can release a super or ti variant like a year later for 50% more with 16gb of vram",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I fix graphic cards as a hobby. The 90s series have so many memory chips they have to put it in the back and there's no heatsink to cool them off. Those chips are only cooled by thermal pad touching a backplate and prone to be overheat/die. Not to mention the super heavy heatsink in the front sagging the pcb and causes broken solder joint.\n\nI cannot even imagine cramming more hotter rams into the card. Somebody will have a heart attack that their $4000 card dies so quickly.",
        "points": "5 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Better have DisplayPort 2.1",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Gave up and just signed up for GeForce Now. I can keep the sub forever and it’ll still be cheaper than buying their flagship GPU.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wow so they can have an amazing 6GB of RAM.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Intel Arc a770 crew 💪",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This would be a massive upgrade for 1000 series users and great for 2000 owners. But for the current 3000 series owners needs to see more detail to figure out benefit and cost.",
        "points": "2 points",
        "children": [
          {
            "comment": "4000 is already a massive upgrade from 1000 series which is almost obsolete",
            "points": "2 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Running Minecraft with RT.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Still rocking an RTX 3090 FE. Looking forward to the 7xxx series 🫤😊",
        "points": "0 points",
        "children": [
          {
            "comment": "Last year I was still rocking a GTX970. :D",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I just bought a 4K QD-OLED monitor. I really hope my 3090 is up to the task for a few more years. I've been spoiled by 200+ FPS at 1440 so the huge drop to sub 100's is gonna be a shock.",
            "points": "0 points",
            "children": [
              {
                "comment": "I’ve a 32” 4K and I have no problems really. 24 GB’s of vram is OTT for games. I used mine back in the day for gpu rendering cgi stuff.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Starting at the low low price of $15,000",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wondering what kind of exclusive feature they will bring this time,like dlss3.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "People talking about the price but forgets the size. This will be a size of a small car.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm so out of the loop these days. Which one has the most Vram?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Bro I feel like I’m still breaking in my 2070 leave me alone",
        "points": "0 points",
        "children": [
          {
            "comment": "Fureal! I’m still rocking the 1070 and it’s doing just fine.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "so what, they going to charge 2 grand for a mid grade card now? nvidia is fucked in the head.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "only 16gbs worth of VRAM though",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yeah well you see...my 3060 will still taste like 12 years so ... Don't care",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Consumers are like sheep storming after the hype shepart. They will sell like hotcakes and PCMasterrace will be full of \"my first setup\" or \"finally made the purchase\" posts with thousands of upvotes.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have a 4090 now so that should last through the 5000 series and into the 6000? series.",
        "points": "-1 points",
        "children": [
          {
            "comment": "Yeah you're good unless you absolutely must have cutting edge graphics and maximum fps without giving up quality\n\nhard to think of more than like less than a handful of games that would require that much horsepower unless you want uncomprimised 400+ hz refresh rate at 4k/8k",
            "points": "7 points",
            "children": [
              {
                "comment": "VR is still hungry for more, especially with the recent UEVR… the only games I play that could do with (sometimes significantly) more power than the 4090 gives me are the more demanding VR ones.\n\nFor flatscreen games, I don’t feel a need for any more power (at the moment at least!).",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Cyberpunk at 4k/120 can make use of more performance. I think any game with decent raytracing options probably can.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "My only concern right now is will it be good for GTA6",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Very very few people need to replace their graphics card with something more powerful every generation.\n\nIf you have the latest top-end card, you almost certainly do not need to upgrade.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Luckily ich bought a 1080ti a long time ago And don't have to buy a new GPU in the foreseeable future, I really don't like what Nvidia is doing and their prices.\n\nInstead I got an upgraded cooler for my old GPU, so I could overclock it and went from 8200point in superposition benchmark to 9500 points. :)\n\nRepair your stuff and don't throw money at it.",
        "points": "1 point",
        "children": [
          {
            "comment": "Typical German mindset of being happy with what you have.",
            "points": "6 points",
            "children": [
              {
                "comment": "After all I took my time to choose and decided what to buy then.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Like being happy with Europe’s shittiest internet speeds.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "I did not chose and buy slow Internet speed, so you are missing the point. Also, I got fibre.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Will it be worth it? Might finally build a pc and might as well start with the upcoming gen",
        "points": "-1 points",
        "children": [
          {
            "comment": "Literally no one knows until we have cards and prices",
            "points": "15 points",
            "children": [
              {
                "comment": "Good to know. I have a lot to learn.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The concept of “worth it” is very subjective, based on disposable income and how often you play gpu intensive games.",
            "points": "9 points",
            "children": [
              {
                "comment": "I’ll want to make a high end pc for best vr capabilities in addition to making regular games as competitive as possible at ultra settings.\n\nAlso cyber punk doesn’t run too well on my current laptop lol",
                "points": "1 point",
                "children": [
                  {
                    "comment": "It all comes down to budget. Unlimited budget? Buy the highest end shit and max everything out at 4k. Don't have a super high budget? You could buy mid to high range cards and get a much better price to performance at 1440p.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Well then you will probably want the top of the line card if you want the best.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "And a 1200W PSU, and a bigger case to house the GPU.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "But not too much space so there’s too much empty space. But also need leggos or something to prevent gpu lag.\n\nMan this seems overwhelming lol",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I wonder if it will be a good investment to heat my appartement next winter?\n\nMaybe if I add any CPU release from Intel?",
        "points": "0 points",
        "children": [
          {
            "comment": "good investment\n\nPC parts are never an investment.",
            "points": "0 points",
            "children": [
              {
                "comment": "Unless you use them for work lol. Then they're absolutely necessary.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Hmm, I'm not sure if \"investment\" is the right term though?\n\nThey're a necessity if they're for work, and they'll allow you to do your job and make money.\n\nBut the parts themselves won't increase in value, like a good investment does.",
                    "points": "-1 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Oh... I though I was on r/AyyMD and I think people missed the point that I was joking...",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Which company makes the DDR or do nvidia do it themselves?",
        "points": "0 points",
        "children": [
          {
            "comment": "We don't use DDR for graphics cards, we use faster GDDR memory.\n\nMemory chips commonly come from Micron, Hynix or Samsung.\n\nThe faster GDDR6X was developed by Micron in collaboration with Nvidia.\n\nIn 2022 Samsung developed GDDR6W, although I am not aware of this being used in any consumer graphics cards.\n\nMore info here: https://en.wikipedia.org/wiki/GDDR6_SDRAM",
            "points": "2 points",
            "children": [
              {
                "comment": "Thank you for the genuine reply",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Back in the days: The Soviet union.",
            "points": "-2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "https://en.m.wikipedia.org/wiki/Dance_Dance_Revolution",
            "points": "-2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Wouldn’t it be amazing if it was 28gbps with 8gb on board?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They can roll it and shove it into their buttocks with current prices",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Do people realize you don't have to upgrade a gpu often at all? I have a 3080 and game 4k at 120 fps and don't have an issue. It would be a waste for me to upgrade to the 5000 series unless something changes significantly in the next year.",
        "points": "-5 points",
        "children": [
          {
            "comment": "You have a 3080 though",
            "points": "21 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yeah, but some of us are using old cards and have been waiting literally years for something with good price to performance so that we can finally upgrade.\n\nI haven't bought a new graphics card since I bought a GTX970 in December 2015.\n\nI've since had a couple of cheap upgrades with an old second hand 980Ti and in 2022 I grabbed a 1080Ti that I found going cheap; I had been waiting for something new, but the prices were so fucked that I was forced to go for something older/second hand instead.",
            "points": "3 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "New 5090: 1 Arm, 2 Children and your car.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Looking to upgrade my 3090. Was holding off to the 5000 series. I imagine the specs will be pretty impressive.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]