[
  {
    "id": "t3_1bj87tk",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bj87tk/do_you_need_to_add_iocs_when_you_have_defender/",
    "title": "Do you need to add IOC's when you have Defender for Endpoint?",
    "points": null,
    "comments": [
      {
        "comment": "Yes, you need to track IOCs if you want to do integrity monitoring or user behavior analytics. Luckily you can now use this tool to get both - centralized Defender alerts and IOCs\n\nhttps://github.com/bgenev/impulse-xdr\n\nhttps://impulse-xdr.com/",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No. You don’t need to add custom IOC/IOA. Only really if you want to block malware or other executables that are bespoke or unique to your environment. I used it to block and alert on TeamViewer use. Not really it’s intended use case but hopefully illustrates what it can do.\n\nMicrosoft updates their rule logic automatically to keep up with threat trends, it’s not always perfect but normally detects majority of attack chains. If it misses one part of an attack, it will detect another part of it later in the chain. I know this from working on extensive purple team tests over the years.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "IOCs like hash and domains no with the exception of stuff partner orgs with connections to your network might have when they get compromised",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Defender has native blocklists and such, however as your org matures definitely add additional IOC's to match your orgs business needs. For example we have multiple clients who have added IOC's related to \"benign\" programs such as team viewer their organization is blocked from using.\n\nAlso as new threat intel comes out you might pick up some IOC's not defined by defender. Be sure to add these once discovered by a Threat Intel team.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bj6uga",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bj6uga/sudden_email_phishing_attempts_at_work/",
    "title": "Sudden Email phishing attempts at work",
    "points": null,
    "comments": [
      {
        "comment": "The best (worst) part of this post is that there isn't really a question.",
        "points": "15 points",
        "children": [
          {
            "comment": "Happy Birthday",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "As a student in the field. I can say positively that I have zero idea",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There’s no way to prove anything about the Okta breach unless your sign up address to Okta was poisoned (the old email+token@domain.com trick) and even then, that wouldn’t be proof just evidence.\n\nTho your company should really invest in a spam filter at this point. Mimecast was good in the old days, they’re still around right?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Are you in IT? Sounds like there is a non-zero chance someone turned on phishing user awareness testing? Don't click but ask the IT leadership.",
        "points": "0 points",
        "children": [
          {
            "comment": "Sounds like user testing to me too",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Recent Okta breach was in regard to customer support users - so its unlikely all your organization emails were leaked. They should notify your organization if that was the case (at least in the EU its mandated).\n\nOnce your email gets into spam database, you will always get tons of unwanted emails. Configure your anti-spam filter better, Google workspace has a pretty decent one. We get hundreds of spam/phishing attempts daily, and maybe 1% actually get to the users' spam folder.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Most likely you can trace this phishing campaign (which seems targeted) to some reconnaissance emails that were sent in earlier months. Look for odd emails such from random Gmail or Hotmail emails that contain little content that were market as random spam.\n\nThese can contain content such as nothing but \"hi\" or random quotes from books, but could also be low level attempts sent to every variation of your orgs emails until they actually successfully send to an address.\n\nSome questions here:\n\nDo you have an email filters or email security platforms such as Cisco Ironport or perhaps Fortimail email gateway (which I prefer due to its excellent logging) or even 0356 email protection and logging enabled.\n\nAs a follow up do you have logging from any of these security tools sent to a SIEM platform (splunk, Qradar, Ms Sentinel ect.) This would make tracking the emails and gathering data from your whole org a trivial process.\n\nI am assuming you are in some sort of a managerial or IT role ensure your teams have adequate security awareness training as sadly the end user is always the weakest link. Ive seen orgs with the most robust sec infrastructure and amazing sec awareness training still fall victim to sophisticated phishing.\n\nIf you have more questions or need some help on this feel free to DM me I am more than happy to lend a hand here.",
        "points": "0 points",
        "children": [
          {
            "comment": "Hello. It appears as though you are requesting someone to DM you, or asking if you can DM someone. Please consider just asking/answering questions in the public forum so that other people can find the information if they ever search and find this thread.\n\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bj3x5d",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bj3x5d/duplicative_tools/",
    "title": "Duplicative tools",
    "points": null,
    "comments": [
      {
        "comment": "I have seen many organizations using multiple SAST/DAST/SCA solutions at different levels.\n\nA common combo for SAST is SonarQube + Veracode for example. And for DAST, ZAP during development followed by Burp in the internal pentests.\n\nAs long as it’s not holding development back, and the org is willing to throw the money, more coverage is better than no coverage.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Different tools can find different vulnerabilities and risks. The capabilities can also differ on what they support. For example, I used to support three AV/EDR: defender, crowdstrike, and clamAV. Each one was for different OSes and different use cases. Defender for workstations, crowdstrike for servers, and clamAV for legacy/OT systems. Make sure that the use cases and capabilities indeed overlap but know tool sprawl is definitely a thing.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Definitely a good question to ask - we run Defender and S1 simultaneously but Defender really is just for MS purposes like Purview and not true EDR. So it might look like we run both but in reality they serve different purposes.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bj2dt5",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bj2dt5/handson_learning_cert_for_someone_who_took/",
    "title": "Hands-on learning cert for someone who took Security+ back in 2022",
    "points": null,
    "comments": [
      {
        "comment": "THM and HTB",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why not start throwing your resume at Cybersecurity roles. This sub has always been a bit gatekeepy and dramatic. Don’t let them stop you from applying.",
        "points": "5 points",
        "children": [
          {
            "comment": "I could do that but also I’m rusty in my cybersecurity skills and I’d like to brush up on it",
            "points": "2 points",
            "children": [
              {
                "comment": "If you got your Sec+ you should be able to successfully interview for almost any entry level cyber positions. Nothing beats experience over certs.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "CyberDefenders’ CCD",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Practice secure configuration management, threat detection and integrity monitoring with this https://github.com/bgenev/impulse-xdr",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bj28vs",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bj28vs/infosec_capitalisation_of_assets_in_finance/",
    "title": "Infosec capitalisation of assets in finance?",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bj1xmz",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bj1xmz/for_people_who_joined_cybercx_academy_aus_is/",
    "title": "for people who joined CyberCX academy (AUS) - is there any contract limitations?",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bj087z",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bj087z/how_have_peoples_experience_been_with_domain/",
    "title": "How have people's experience been with domain monitoring services?",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bizi4p",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://www.blankcoverage.com/2024/03/exposed-database-at-yx-international.html",
    "title": "Exposed database at YX International, a tech firm handling SMS messages, compromises security for users of platforms like Facebook, Google, and TikTok",
    "points": null,
    "comments": [
      {
        "comment": "This is the same thing from 2 weeks ago if anyone else is unsure.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bizaxr",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://www.blankcoverage.com/2024/03/csas-iot-device-security-specification.html",
    "title": "CSA's IoT Device Security Specification sets a vital standard, ensuring robust security for connected devices globally",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1biz7lm",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://archive.is/4gByN#selection-1327.0-1327.64",
    "title": "US Warns of Cyberattacks Against Water Systems Throughout Nation",
    "points": null,
    "comments": [
      {
        "comment": "Was wondering how long that low hanging fruit would sit unpicked. US water security is shit. Power at least tries, water doesn't even have the budget to hire someone to try.",
        "points": "146 points",
        "children": [
          {
            "comment": "Power is highly regulated with strict cybersecurity standards.",
            "points": "17 points",
            "children": [
              {
                "comment": "There are other types of water rights we should all be paying attention to.",
                "points": "8 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "One Ukrainian power plant gets hacked and knocked and suddenly we all have paperwork.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "A couple years ago, someone hacked into our water system here in Florida and tried to increase the amount of lye being pumped in. They caught it just in time.\n\nEdit: here’s an updated article now they are saying it might have been an employee who did it. Not sure what to make of that.",
            "points": "18 points",
            "children": [
              {
                "comment": "I would think an insurance company somewhere would shit a chicken over this. But it's the government and warren buffet so who knows",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "[deleted]",
            "points": "6 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [
                  {
                    "comment": "Amen",
                    "points": "6 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Do you though? Water is relatively cheap to get into it's current state. And I don't think they increased taxes once cyber was invented to account for the several orders of magnitude increased cost it would take to secure it properly. Not saying they shouldn't, but you can't expect to pay the same in taxes (only the part that funds water) 30 years ago now given the state of the world.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": true
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I hope it’s just my tinfoil hat talking, but articles like this make me think that they have already been trying, got close, and have so far (thankfully) failed.\n\nI keep a few cases of drinking water in my house as a general “just in case” measure, but it probably wouldn’t hurt to keep a decent amount of potable water/water to clean with on hand if the worst were to happen.",
        "points": "46 points",
        "children": [
          {
            "comment": "They are. I hear a few stories every few months in my infraguard meetings about it. I've also noticed a lot more public utility companies lately getting pentests and trying to increase their maturity level",
            "points": "22 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "They have been trying, several attempts have been made at various plants across the U.S.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Look up Claus schwabbs speech at the wef. His exact verbatim opener was \"pay insufficient attention to a comprehensive cyber attack that would take down critical infrastructure.\" Who wants to bet they figure out how to save us by taking away our rights and ushering in a digital currency that has zero privacy",
            "points": "-6 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I actually met a guy who managed - by himself - the industrial control systems (whatever it’s called) for a California county’s water system, part of the state aqueduct system. Super fascinating conversation, he basically explained that their security strategy is that the whole thing is painfully airgapped.\n\nA little later in the convo he pulled out his laptop and logged into a dash board for the system. I was like “the fuck kinda air gap is this?!”\n\nBut.. it did make some sense. He explained that everything I was seeing was merely sensor readings, but the control motors to turn sluice gates and stuff like that had zero networking.\n\nSo his job (he was technically a contractor for what it’s worth) was to get paid a few hundred grand a year to basically just monitor stuff. But if and when an issue occurred no matter the day or time, he was responsible for getting someone (usually himself) in a car and driving anywhere from 20 min to 3 hours to go deal with a problem.\n\nThis was a smaller county population wise and had no water treatment / reclamation or anything fancy like that. I’m sure LA county is a much different ball game. But while the system was extremely manual, and highly dependent on one or two people, it really didn’t seem that vulnerable from a cyber standpoint",
        "points": "29 points",
        "children": [
          {
            "comment": "Wouldn’t being able to monitor the sensors a vulnerability in itself?",
            "points": "1 point",
            "children": [
              {
                "comment": "Not necessarily. The key word is interactive access.",
                "points": "8 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Depending on industry some sensor readings have to remain publically available for life safety reasons.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The government should probably have a department dedicated to securing these types of facilities, like full control over the cybersecurity of utilities.",
        "points": "4 points",
        "children": [
          {
            "comment": "Ah yeah chief, let me tell you, people would throw a shit fit if CISA actually came in and enforced what they asked for. The best they can do is give reccomendations.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Scarecrow Strikes Again?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Maybe it wasn't a good idea to make the internet from a series of tubes -Al Gore",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is what happens when you focus on building an image making fun little basic MFA video tutorials rather focusing on the real shit, the local rural areas the ones who need protecting the most do not get protecting because they're posting fun little videos for the IG, LinkedIn and social media platforms trying to look like a sexy agency",
        "points": "3 points",
        "children": [
          {
            "comment": "What?",
            "points": "12 points",
            "children": [
              {
                "comment": "Stupid sexy rural government water agency",
                "points": "23 points",
                "children": [
                  {
                    "comment": "IG? Heh my rural water agency has an OF. Girls Gettin Wet",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I am not ashamed to admit I screeched in laughter at this comment",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "😅",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Security theater so they can say they did but they are actually clueless and didn't do nearly enough.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Who is \"they\"? CISA?\n\nIt's possible to have more than one audience. Encouraging strong second factors (ie, passkeys and yubikeys) is a good thing for most in IT.\n\nMeanwhile, CISA also has a wealth of resources for OT, but they're not going to advertise that on their Instagram because that would be silly.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Glad I'm on well water",
        "points": "0 points",
        "children": [
          {
            "comment": "Dam",
            "points": "9 points",
            "children": [
              {
                "comment": "No, they said well.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "it doesn't matter the size of the water sector, Encina Waste Water Authority in CA 8 Clarifiers exposed vulnerable Cisco ASA SSL VPN Blacksuit, Muscatine Power and Water 4K exposed assets including RDP w/Endpoint mapper port exposed breached determined to be external systems hacked. They're all cooked, I can't disclose the most serious ones",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Lol me too",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I hope your being sarcastic, cause those are literally the lowest hanging fruits and I'm concerned if you have ever seen a thing or two cause you wouldn't want a hacktivist group accessing your rural water well tower PLC/HMI in the U.S couple months ago don't don't we not even Unitronics PLCs",
            "points": "0 points",
            "children": [
              {
                "comment": "i belive OP is refering to an unmettered well that pulls from an aquifer",
                "points": "9 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Help, someone's put malicious bytes in my water!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Steve Gibson from SecurityNow has been touching on this very matter on his last few podcasts. You should all take a listen. Steve is an asset to the industry!",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "laughs in well water and job security",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "r/BlackSwanEvent",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just had one in Dallas metro 3 months back.\n\nhttps://therecord.media/north-texas-water-utility-cyberattack",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Does any remember when I commented on this /r last week saying \"has anyone seen the Claus Schwabb speech where he talks about a cyber attack crashing critical infrastructure like two years ago at the WEF and I said I thought they were setting the stage to crash the economy and usher in their digital currency. Now thus post. I feel like they told us what they are going to do. If you watch the speech the way he says it is basically not if it's when and in thr most creepy way possible. His exact opener was \"pay insufficient attention to a comprehensive cyber attack that brings down the critical infrastructure.\"",
        "points": "-8 points",
        "children": [
          {
            "comment": "This is some qanon bullshit. It's the exact same argument qanon weirdos make that Bill Gates saying \"we should prepare for a pandemic\" means he was going to cause a pandemic.\n\nHey buddy, where were in 2002 when SARS happened? Or 2009 when the Swine Flu epidemic happened? Or any of the like 4 times Russian hackers took down the Ukrainian electrical grid?\n\nKnock this magical thinking \"talking about something makes it happen\" nonsense and look around you.",
            "points": "6 points",
            "children": [
              {
                "comment": "I'm sorry, but if you don't think that groups of extremely rich people are conspiring together to seize power and creating or staging events to control the populations of the world, then you might just be blind. If you didn't learn anything from covid, then you might want to do a little research. Do you think it was luck that the top 1% made so much money during covid? Do you think its a coincidence that in his Ted talk bill gates said the earth was overpopulated and that \"If we do a good job with vaccines and planned parenthood we can lower the population\" and then a few years later an event happens that \"requires\" millions of people to get a vaccine? Now large pharmaceutical companies have been forced to admit there is a link between myocarditits and the vaccine? That more people under the age of 30 have dropped dead from heart attacks than literally ever before in the history of recorded statistics? Do you think it was a coincidence that several members of congress made millions on phizer stock they purchased just a few months before covid was announced. There are clearly incredibly wealthy people orchestrating events in order to further their specific political and financial goals, and if you can't see that you are intentionally and willfully blind. Speaking of Gates, Bill Gates is also now one of the largest farm land owners in the US, who recently purchased a medical company overseas that specializes in creating edible vaccines. Do you think that is a coincidence too? At what point is there too many coincidences? That's just like two examples. People just don't want to see the truth because they're scared. They like their comfortable little lives. They're fine with collecting a paycheck while their fellow man suffers, and as long as it's not them, it doesn't matter. As long as they have food on their plate, they don't care if the guy next to them doesn't. Work, entertainment, sleep, repeat.",
                "points": "-10 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Thank God I live in a Really Small town.",
        "points": "-9 points",
        "children": [
          {
            "comment": "Your small town probably has no security, I’ve consulted on a few small municipalities and they plead poverty as to why they can’t do anything about the obvious risks - even when some steps cost nothing but changing some bad habits.",
            "points": "19 points",
            "children": [
              {
                "comment": "I’ve done consulting at the the state level for agencies out of OIT control and it’s truly the Wild West out there. We’ve seen pings and drive by ssh requests to devices that should have been microsegmented\n\nIt’s amazing states continue to allow these depts to operate so freely.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Same…it really is a money issue for many towns, but due to federal funding for states (via IIJA), these municipalities can ask the state for funding for cyber, infrastructure upgrades, and money for additional personnel. A lot of them are unaware it is now available.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I understand what you're saying. My small town doesn't even have an IT guy. But that's not the case here. No connections. Water goes down, somebody has to manually go fix it.",
                "points": "-4 points",
                "children": [
                  {
                    "comment": "One I looked at years ago had manual processes, but had their billing wide open.",
                    "points": "7 points",
                    "children": [
                      {
                        "comment": "They might have their billing wide open. But I'm not sure. We don't even have the ability to pay our bill online. They do have auto pay but you have to go down to the city to set it up. And I'm sure that information is open to the world to see. But even if billing goes down, our water doesn't. I have personally gone to the water house here in town. There ain't nothing technological about it.",
                        "points": "-3 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "hilarious that you think youre safe.",
            "points": "4 points",
            "children": [
              {
                "comment": "I know I am. There are zero connections to our water source. Even our entire town is on generation if need be. NOTHING in our town utility wide is controlled by a connected machine. The only thing we'd lose is TV or natural gas. Thank God I know what I'm talking about. Hilarious to think people think they know everything.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "Where you live?",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Nah mate, I've been in IT for a long time. I wouldn't give anybody my location if they were standing next to me.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "You better hope not, you wouldn't want Cyber Army of Russia to do the same thing to your rural water well don't we",
                            "points": "-1 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1biygoa",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1biygoa/checking_security_posture_for_new_software/",
    "title": "Checking security posture for new software?",
    "points": null,
    "comments": [
      {
        "comment": "https://cve.mitre.org/cve/search\\_cve\\_list.html",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nist 800-37",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If the tool is for Linux, isolate the it in a VM monitored by Impulse XDR and you'll be able to understand better what it does and if it's dangerous https://github.com/bgenev/impulse-xdr",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bix6qd",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bix6qd/free_beginnerfriendly_coding_bootcamps/",
    "title": "FREE Beginner-Friendly Coding Bootcamps",
    "points": null,
    "comments": [
      {
        "comment": "Ty!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Is there a certification coupled with this or more “dipping your toes” into the field? Either way I am going to do this, thank you!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bix3d4",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bix3d4/cybersecurity_2024/",
    "title": "cybersecurity 2024 ?",
    "points": null,
    "comments": [
      {
        "comment": "Yes, just do it....get something started. Change later if you need to but go NOW. I'm a beginner. Don't doubt yourself. Pursue your passion and let it lead you.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Education? Work experience? Location? Need more info or use the search bar in this sub.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bix21o",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bix21o/crackers_vs_hackers/",
    "title": "Crackers vs. Hackers",
    "points": null,
    "comments": [
      {
        "comment": "Old terms for old days. Cracking was defined in the 80/90s and later absorbed into hacking. It used to be an industry term. Cracking used to refer to people who broke into systems with brute force or through illicit means, it is essentially meant to mean hacking but with bad intent. They'd \"crack\" a password to gain unauthorized access or they'd \"crack\" the code with malicious intent. Cracking is usually always illegal. The public (and the government) did not understand the difference so it eventually got dropped as an industry term and was referred to as \"hacking with bad intent\" or just simply hacking. Unfortunately for legal hackers this put a bad name on the industry. People are scared of what they don't understand.\n\nHacking in itself is not illegal if there is some sort of prior authorization or some sort of authorized public disclosure of code. Hacking is illegal when done intentionally out of scope of a prior authorization or when done without any sort of authorization. Hacking is just a broad term for gaining access, causing a certain result, or gaming a system in such a way that was not intended. Hacking can be physical, virtual, or social. Hacking took over the public eye as bad because it is best described, broadly, as what bad actors are doing when they break into a system. There is another side to hacking which is very good and very beneficial.",
        "points": "14 points",
        "children": [
          {
            "comment": "I always felt hacking was broad while crackers was more narrow, you described one and the other being the programmer/hacker who wrote their crew's cracks. Phreakers are another more specific especially from that day.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Hacking used to just mean writing clever code, and during the 90s the changing meaning was a big deal for a lot of people who felt it was being misappropriated.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "There are security professionals, and then there are criminals.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "came here for the racial jokes and was disappointed.",
        "points": "10 points",
        "children": [
          {
            "comment": "Lmfao… I originally thought that he had meant it that way, but was relieved to have been found differently.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Crackers are something you add to soup .",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "[deleted]",
        "points": "0 points",
        "children": [
          {
            "comment": "This makes perfect sense given his level of immaturity-which most of the time I found hilarious and charming. He definitely was always a sucker for the 80’s nostalgia.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Once upon a time yes, nowadays everyone is just called a hacker",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Even back in the day (early 90's) no one called them crackers except for, maybe, the first fifteen minutes after someone coined the term. There were endless conversations then about the difference.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Welcome to 2009!",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I remember cutting up sitting in a lecture and the professor bringing up the term “crackers” in a lesson about hacking",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is ancient terminology, but yes it did used to be that way.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The \"cracker\" terminology was a lame attempt to force a linguistic distinction. It never really caught on.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hacker is ethics-agnostic; it’s a generational distinction.\n\nYou crack an old-fashioned phone line, you crack a safe, you crack a password with tools, you hack a computer.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yes",
        "points": "1 point",
        "children": [
          {
            "comment": "Yes.. but language evolves... so today, it may not be as well known as it used to be.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yes. But no.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "lol what",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is a bit of an odd question, in what context.\n\nI would say that globally, hackers is a larger group term with crackers being a subset.\n\nIn the industry we tend to use white,black,Grey hats to describe if the hacker had malicious intent or not",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This was just coming from a comment my ex had said months ago, and I had thought it to be odd when he said it, as I too have never heard of this terminology. However, recently kept hearing it being repeated on different YouTube channels and in the same context/terminology. Which is what prompted this goofy question, as I STILL DON’T get it!! lol",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Crackers just = Hackers",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Here in Europe, Crackers specifically were people who broke copy protection mechanisms so games could be copied. I was surprised when i went on the internet and people spoke of crackers who broke into systems.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "...no?",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1biw0rg",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1biw0rg/defect_dojo_ui_not_accessible_from_host_laptop/",
    "title": "Defect Dojo UI not accessible from host laptop",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bitr3b",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bitr3b/this_ftp_server_had_a_hacked_user/",
    "title": "This FTP server had a hacked user",
    "points": null,
    "comments": [
      {
        "comment": "Bro.",
        "points": "9 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "First, I wouldn't post client information no matter how innocuous on reddit. Second, it looks like a crypto miner or a botnet. Up to you to decide as you are the \"expert.\"",
        "points": "14 points",
        "children": [
          {
            "comment": "Who said I am the \"expert\". I am the one tasked with the cleaning. I clean shit, but I am no expert in shit.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If it seems fishy try to analyze it",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Looks to be part of a botnet:\n\nhttps://github.com/akamai/akamai-security-research/blob/main/malware/noabot/iocs.csv",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Like everyone else said. Posting Organization info on a public forum is a direct breach of confidentiality. A huge no-no.\nThat being said doesnt really look like you posted anything that is identifiable. But for u get the file hashes for these and see run them in any reputation checker that may help. Looks botnet related.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I would say imgur is crap for screenshot hosting, for it resizes the image and renders its text hard to read. Here is the screenshot on IMGBB.COM: https://i.ibb.co/zPd29c7/FTP-usuario-prueba1-hackeado.png",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bisrn2",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://www.withstandsecurity.com/blog-insights/2024-03-19-dev-sev-sca",
    "title": "Withstand Security: Developer Security - Software Composition Analysis",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bisfbh",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bisfbh/practicing_siem_usage/",
    "title": "Practicing SIEM usage",
    "points": null,
    "comments": [
      {
        "comment": "You can get a free developer license from Splunk. It's a full blown license for 10GB im pretty sure. That would allow you to do just about anything from \"building\" and \"administering\" to \"Data Analytics.\" You get full access to understanding the building blocks of Splunk and it's processing language.\n\nWhat it will not do is give you a sandbox full of pretty dashboards and pre-canned data streams along with analytics to \"mess with.\" I should also note that it will not give you access to Splunk Enterprise Security (which is their SIEM offering). I would argue that \"practicing queries\" is outside the normal scope of SIEM, especially Splunk's SIEM.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Googled \"plunk cheat sheet\" and \"splunk training\":\n\nhttps://www.splunk.com/en_us/blog/learn/splunk-cheat-sheet-query-spl-regex-commands.html\n\nhttps://www.stationx.net/splunk-cheat-sheet/\n\nhttps://www.splunk.com/en_us/training/course-catalog.html?sort=Newest&filters=filterGroup1FreeCourses\n\nTryHackMe: https://tryhackme.com/room/splunk201",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Open and self-hosted SIEM that you can practice with https://github.com/bgenev/impulse-xdr",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Check out Security Onion.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1birluu",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1birluu/cybersecurity_news_rss_feed/",
    "title": "Cybersecurity News RSS Feed",
    "points": null,
    "comments": [
      {
        "comment": "You can check TLDR InfoSec newsletter\n\nhttps://tldr.tech/infosec",
        "points": "5 points",
        "children": [
          {
            "comment": "Thanks, it looks very useful",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "My current fave.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I like to hear the SANS Daily Stormcast",
        "points": "1 point",
        "children": [
          {
            "comment": "I added to my favorites, thanks",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Bleepingcomputer have rss",
        "points": "0 points",
        "children": [
          {
            "comment": "Is just include only bleepingcomputer news?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I really enjoy Feedly.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bircpz",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bircpz/please_teach_opsec_cyber_hygiene_in_all_tech/",
    "title": "Please teach OpSec / cyber hygiene in all tech degrees",
    "points": null,
    "comments": [
      {
        "comment": "I’ve been working on a course on these topics for older and less tech savvy people. Right now most of the content is free.\n\nI think it would be good if these topics were taught as a part of some standard curriculum but I also feel the same way about basic tax stuff.\n\nMy course is at https://blueox.ai if you want to have a look.",
        "points": "13 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "that's not an academic topic though really\n\nSo what course are you adding that to? who is an expert? what books/readings are there a bout it?\n\nthere's a difference between an academic topic and work task",
        "points": "8 points",
        "children": [
          {
            "comment": "But if you have no concept of cyber hygiene, you can’t perform any tech job securely. Actually it should be a required high school course , but we have to start somewhere.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yes and no.\n\nIt’s a good idea as those are good to know but kids coming out of these program aren’t even ready for their own fields, adding to it won’t help.\n\nI mean, seriously, I had to retrain every single one of them new college graduates I hired already. I’d be happy if their core curriculum is better taught.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Add it in highschool, right next to the class where you learn about how to do your taxes and be an adult.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I would prefer it start in elementary school and be an annual topic through High School. No one should not understand the basics of cyber hygiene. Of course, a lot don't know how to spell or do basic math either, but we can try.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Like 99% of the courses I took in college, the only thing that was relevant when I got into the industry was excel. Academia lags too much behind technology to be current.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1birbxw",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1birbxw/incident_report_timeline_visualizer_tool/",
    "title": "Incident report timeline visualizer / tool?",
    "points": null,
    "comments": [
      {
        "comment": "Isn't it weird how much it matters that the data looks pretty?\n\nIt's easy to get that sort of thing from one tool's perspective - like an EDR tool or something - but it's hard to get a nice visualization that showcases all the work that went into all of the incident management (or feeding in data from multiple tools or information that doesn't live in a tool - like a meeting between the security team and csuite).\n\nWe ended up in a similar spot to you - but we're using Canva for this. It takes a little less time to move your bits and bobs around in Canva than PowerPoint, because you can quickly anchor different elements together. So instead of moving your text, and then moving your little dot, and then moving your arrow (or whatever) - you're just snapping one point that moves every anchored element.",
        "points": "2 points",
        "children": [
          {
            "comment": "Ooh I legit might ask about that. I used to be a Canva wizard but I'm technically not in marketing anymore... Let's see if they adopt it for SOC reporting to clients and I get to piggy back?! 🤣\n\nThank you!",
            "points": "0 points",
            "children": [
              {
                "comment": "Yeah, give it a spin. Canva has revolutionized our reporting - here's a sample of what it looks like applied to an executive report. Took an hour to build the elements, but now we just change colors and numbers.\n\nhttps://imgur.com/FJoanKm",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Build ur own time using draw.io",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have been searching for a tool like this for years, so I second the request. What I would REALLY like is a tool that can open at least text files, but others would be great, or maybe have a way to paste snips and add a little meta data, particularly time, then be able to sort based on that time. I think it would be fantastic if it was a feature of something like Maltego, so you could build a node graph of same as an alternate view. The number of times I've had to go through a bunch of different log files and scrape things together in Excel or other tools just so I could sort them after the fact is incredible. OneNote and other tools are great at taking notes, and even collaborating to a degree, but then you have to refactor all the information. As part of a larger tool set including OSINT functions it would be fantastic.\n\nThis, btw is a great idea for not only cybersecurity incident investigation, but general operations investigations in large systems as well, tracking events by cause and effect as well as time.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1biqxz8",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1biqxz8/for_a_mid_level_cyber_generalist_best_cyber/",
    "title": "For a mid level Cyber Generalist - best Cyber specialization to move towards?",
    "points": null,
    "comments": [
      {
        "comment": "My technical background (all legacy and truthfully mostly obsolete) includes WAN networking and Cyber engineering, with expertise primarily in firewall and VPN engineering. However, with outdated technical skills and my shift to a managerial role, I'm concerned about my future employability.\n\nThese are all very relevant skills still. This stuff isn't just going away - it's just being implemented and managed differently.\n\n​\n\nOne big achilles heal, missed the bus on coding.\n\nI always see this from tech people and it's just odd to me. Like we have learned some of the most dry and obscure skills like routing and switching, networking, etc.. However, somehow like over half of my colleagues straight up refuse to learn even basic Python. It's not that difficult and actually once you know it - it's like having a super power against most other Engineers who don't. You don't have to be a developer, I'd say web scraping and API manipulation will carry you farther than you'd ever imagine.\n\nRecently I pivoted to a Cloud-based role that includes a lot of IaC with Terraform and I love it so far. It's still security because it's using Terraform to spin up and manage security controls in the cloud. I highly recommend learning IaC even if it's just for fun.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1biqczu",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "https://www.blankcoverage.com/2024/03/data-breach-at-mintlify-sparks-concerns.html",
    "title": "Data Breach at Mintlify Sparks Concerns Over Third-Party Integration Security",
    "points": null,
    "comments": [
      {
        "comment": "I'm not sure this sparks concerns any more than every other breach involving third-party integrations.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bipstv",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bipstv/zero_trust_api_security_robust_authentication/",
    "title": "Zero Trust & API Security: Robust Authentication with Edge Stack",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bip84j",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bip84j/cybersecurity_firm_recommendations/",
    "title": "Cybersecurity Firm Recommendations",
    "points": null,
    "comments": [
      {
        "comment": "I know of many DFIR capable contractors in Sweden, but if you are gonna ask them how to proceed and then do the actual investigation yourself to save money or whatever, you're not gonna be successful.\n\nDoing a forensics investigation that end up in court requires a lot of systems experience to retreive the artefacts and then understand them. If you want to go a head with a case, i suggest you do more than \"basically ask questions\" with such a contractor, some of them also have experience witnessing in court - and that is another reason to hire a professional to do the investigation - you don't want an experienced defender to tear up your defence because you do not know how to \"make real sense of it\" and produce a subpar report.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have no affiliation - NetNordic has some quality people in this space.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1biomch",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1biomch/add_2famfa_on_current_ecommerce_website/",
    "title": "Add 2fa/mfa on current e-commerce website?",
    "points": null,
    "comments": [
      {
        "comment": "checkout our solution: https://www.datawiza.com/add-mfa-to-legacy-apps-without-code-changes/",
        "points": "1 point",
        "children": [
          {
            "comment": "Thanks! I've got a demo scheduled for tomorrow.",
            "points": "0 points",
            "children": [
              {
                "comment": "Thanks! Our team is looking forward to meeting you tomorrow.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Does it support OAuth2/SAML or other SSO for authentication?",
        "points": "0 points",
        "children": [
          {
            "comment": "Our ERP/E-commerce vendor does not offer anything for authentication. It is built on the java language.",
            "points": "0 points",
            "children": [
              {
                "comment": "Being built on java is not the reason for no authentication.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Maybe Microsoft Entra helps you out",
        "points": "0 points",
        "children": [
          {
            "comment": "Yep. Something like this https://learn.microsoft.com/en-us/entra/identity/app-proxy/",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1biog2k",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1biog2k/500_end_users_mfa_needed_cant_require_personal/",
    "title": "500 end users, MFA needed, can't require personal phone use",
    "points": null,
    "comments": [
      {
        "comment": "Please consider Yubikeys before even thinking about RSA tokens. Heck any security key is better than RSA\n\nEdit with some elaboration why i'm suggestion advice:\n\nPricing is absurd for RSA tokens vs YubiKeys\nTOTP: RSA tokens don't even roll the normal TOTP solution, they have their own propriatary brand\nStandards: YubiKeys are in general built to support way more protocols than RSA. YubiKey 5 supports more or less all token standards you can think of, and the bio series (fingerprint reader) supports the hipper FIDO2 based ones.\nEase of use: Having pluggable and NFC chips is way less clunky than a manual (basically analog) code chip.\nTrickle down security. An added bonus of yubikeys is that there is no reason not to allow your employess also use the FIDO2 capability for all their personal accounts (with warnings about losing the key). Which in turn increases their overall security posture.",
        "points": "103 points",
        "children": [
          {
            "comment": "I really wish we could make a rule in this subreddit that requires people to elaborate on their points. This is a cybersecurity community, and when people throw out things like, \"don't use XYZ product,\" it feels so... amateurish?\n\n\"You shouldn't use RSA tokens because they were breached 13 years,\" provides a lot more context to the discussion.",
            "points": "57 points",
            "children": [
              {
                "comment": "Wrote it while on the bus. Saw some guys suggest RSA tokens and that hit a nerve real hard.\n\nPricing is absurd for RSA tokens vs YubiKeys\nTOTP: RSA tokens don't even roll the normal TOTP solution, they have their own propriatary brand\nStandards: YubiKeys are in general built to support way more protocols than RSA. YubiKey 5 supports more or less all token standards you can think of, and the bio series (fingerprint reader) supports the hipper FIDO2 based ones.\nEase of use: Having pluggable and NFC chips is way less clunky than a manual (basically analog) code chip.\nTrickle down security. An added bonus of yubikeys is that there is no reason not to allow your employess also use the FIDO2 capability for all their personal accounts (with warnings about losing the key). Which in turn increases their overall security posture.",
                "points": "16 points",
                "children": [
                  {
                    "comment": "Let’s not forget: 6. RSA has been caught engaging in Honest Services Fraud against their customers via the Dual-EC-DRBG scandal where they took bribes to weaken their security tools.",
                    "points": "16 points",
                    "children": [
                      {
                        "comment": "Whoa what?? You got an immediate link handy??\n\nI'll look this up later but damn",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "It's on the company's Wikipedia page.",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I think what a company does in response to a compromise is much more than significant than the fact that they had a breach. Responsible disclosure and changes in business and technology are much more interesting to me than the yet unknown and possibly covered up compromises of other companies.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yubikeys are the best",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "+1 we do this with our identity provider and it works great for online and offline access. (Workstation MFA)",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yubikeys=have to be using actual machine? How does that play out with another user of same machine? Are keys held in tpm per user?",
            "points": "0 points",
            "children": [
              {
                "comment": "What do you mean? The keys are in the yubikey? And each user have their own keys.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "We just went through this with 2500+ users last month: MFA required but can't require personal phones. We bought 1000 Yubikey Security Keys (the cheaper model that only does FIDO/U2F) and then only ended up distributing less than 250 (personal phones are allowed as an option, with the Yubikeys available for those unable/unwilling to use their phones).\n\nIn other words, 90%+ chose to use their own phones, even when an alternative was available. Do with that anecdotal statistic what you will.",
        "points": "56 points",
        "children": [
          {
            "comment": "same process for us - initially had about 300 people out of 7000 that didn't want to use their personal device - that dwindled to about 25 fairly quickly once they actually had to use and keep up with a physical key.",
            "points": "14 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "By labor union agreement, org with ~1300 users cannot be required to use personal phones, all were issued yubikeys. In any 24 hour period, typically around 8% use their yubikey.",
            "points": "5 points",
            "children": [
              {
                "comment": "We have no such clause in our agreements with our 3(!) labor unions (I personally read all 3 contracts myself), but the risk that they'd rise up in defiance to MFA in general was enough to not even try mandating personal phones.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Interesting. We just went through a process of saying you can use yubikeys or other hardware tokens (like TouchID) only. I'm not directly inside of the security org but I do work with them closely. SMS and authenticator codes are only permitted in a few use cases where the hardware tokens wont work (e.g. enrolling a JAMF profile on a mac via Okta for some reason the hardware tokens aren't working in our environment). I think we had one to many people socialed for their TOTP codes.",
            "points": "3 points",
            "children": [
              {
                "comment": "Personally I would have loved to have stood on high and said \"You will use a hardware token!\" A close second would have been to disallow SMS as an option but otherwise allow e.g. TOTP apps on phones. I lost both of those fights - though admittedly neither was a hill I'm willing to die on, as even SMS MFA is better than no MFA.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "I guess it just takes one customer support person with a lot of access to be socialed for the SMS code, and a bad actor nukes a large customer account from orbit... for the CISO or whomever else to put their foot down finally.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Echo this!\n\nWe had a smaller sample of 300, only 2 refused and ended up with yubikeys.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Do you mind sharing how much 1000 keys cost?",
            "points": "0 points",
            "children": [
              {
                "comment": "Unfortunately that's confidential (for whatever reason), but the Security Key Series retails for an average price of US$27 (assuming 50/50 split between USB A ($25) and C ($29)) so that'd be $27,000, but that's enough volume to pay a bit less than that.\n\nSorry I can't be less vague, but hope this at least somewhat helps.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Surely you were not surprised!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "DUO tokens.",
        "points": "14 points",
        "children": [
          {
            "comment": "Works perfectly",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This. I was wondering why op hasn't looked into this. If a product isn't meeting your needs, it's a smart idea to reach out to your account manager and/or VAR to see if there is something you're missing. In this case, duo tokens.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "What are DUO tokens? DUO doesn't sell hardware. Assuming you mean DUO with a hardware token like Yubikey\n\nedit: i'm wrong.",
            "points": "4 points",
            "children": [
              {
                "comment": "Duo sells tokens.\n\nhttps://duo.com/product/multi-factor-authentication-mfa/authentication-methods/tokens-and-passcodes",
                "points": "10 points",
                "children": [
                  {
                    "comment": "ahha. Had no idea. Hows the pricing compared to yubi?",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "$20 a token from DUO. They don't list any volume discounts but I'm sure you can get one.\n\nThe most basic Yubikey series (Security Key Series), which is fine for what you need will run you about the same.",
                        "points": "3 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "If you’re under an EA you have access to a ton of shit. Your Cisco sales rep (CSS) can pull in Duo to review your options and guide you on integration.\n\nDuo tokens are cheaper than Yubikey; but non transferable to another MFA solution.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "It'd depend on the Yubikey. Depending on what you're trying to MFA, you may need something where you can input a code.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Windows Hello for MFA to the company laptop, then restrict O365 to managed and compliant devices. Anything else could go through AzurEntra SSO and CACL's to enforce the same compliant device.",
        "points": "27 points",
        "children": [
          {
            "comment": "This answer doesn't have enough upvotes, take mine!",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "A good alternative.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I dealt with this at a prior company. I gave users 3 options:\n1. Use your personal phone. Most chose this.\n\nGet a phone call at your office phone.\n\nDon't enroll in MFA. You won't be allowed to access cloud resources from outside predefined IP addresses.\n\nOut of about 2000 users about 50 elected to only have access at the office. They were upset when COVID hit and they couldn't work remote.",
        "points": "6 points",
        "children": [
          {
            "comment": "We're currently under line item 3 but I feel that is by far the least protected given if someone is inside your network, access to things like email are a feast fest",
            "points": "0 points",
            "children": [
              {
                "comment": "Just don't. Don't have an IP of any kind that bypasses MFA unless its Infrastructure set by Admins. If you have this set as \"Exclude these Trusted Networks\" in you CA Policy and you don't have a separate Risk policy that sets Session Frequency you will get non-MFA Forever Tokens.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The caveat to number 2 is “are they allowed to forward that phone anywhere else?”. We had an IT manager forward all his calls to his personal cell phone and bypassed our security.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yubikeys or cards would be your only solution.\n\nHonestly cheaper for your org to lift the refusal to allow for personal phones with a app, its not like you are installing MDM on the device.",
        "points": "4 points",
        "children": [
          {
            "comment": "allow for personal phones with a app\n\nThe issue is they can't require personal phones. If any users don't want to install on their personal phones (and some subset of users certainly will not do it) then you need to have an alternative in place.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Duo tokens or Yubikey is your best solution. That and doubling down on end user comms regarding Duo Mobile (push). While you can’t mandate they use personal phones, it is the easiest. Contrary to assumption - Duo is not an MDM & there’s no privacy risk.\n\nOn another note - if you’re an EA customer, leverage your sales rep to engage the Duo engineers for guidance. There’s a ton of documentation available for this. Additionally - your EA allows deep discounts and other cool shit to make your life easier.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Have a look at Token2 PIN+ FIDO2 Keys. A bit cheaper than Yubikeys, but you will not end up with users setting 123456 as their PIN code. FIDO2 keys are more secure than OTP tokens.",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In before that random RSA sales rep tries to corner you into a meeting. RSA rep, if you're out there, just be transparent about the hardware token pricing. No one wants the sales pitch for the platform.\n\nThis company explains the different type of tokens and the licensing requirements.\n\nhttps://deepnetsecurity.com/authenticators/one-time-password/safeid/hardware-mfa-tokens-office-365-azure-multi-factor-authentication/\n\nWith 500 end users, I'd budget for about $10-$20 USD per token. There are cheaper ones out there but supply / customer service may be an issue.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hypersecure makes a small fido2 key that is $10, however it is usb only but is a good base option.\n\nIf you are looking for small TOTP token2 or deepnet security both make good options, but limited battery life 2-4 years.\n\nHonestly fido2 is great but just doesn't have good mobile / website compatibility if you have a large number of integrations. We found you still need an app for some users.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Duo has tokens you can buy direct. Not too expensive and automatically added to your account.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In addition to the great recommendations already in this chain - you can also take a look at RFIdeas *if* using badge readers, biometrics, etc. is an option for your MFA approach. They're going to be a lot less expensive in terms of initial spend - but as with ANY solution, make sure you look at the total cost of ownership....with focus on what it takes to operate and maintain these solutions.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Depending on the level of security needed you can also install a TOTP emulator on their computer. It’s not ideal but it limits access to the one computer.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We met with a company called Miracl who provides MFA for clients with this situation.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can you allow personal phones but if they don't consent then do hard tokens/yubikeys?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Then make sure they can’t connect to any company WiFi or access company email/apps/data on their phones. If they complain make them sign an MFA policy that states they must use their personal phone for MFA purposes.",
        "points": "0 points",
        "children": [
          {
            "comment": "Yeah that sounds great except upper management doesn't share the same vision",
            "points": "0 points",
            "children": [
              {
                "comment": "After the hack they will",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Thanks for repeating what all cybersec professionals are aware of",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Ok?",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You can give them instructions for registering their device for MFA - no need to require it but I’d bet many will choose to use the app. Let them know if they don’t want a company app on their phone they can get a yubikey, first one is free but if any get lost or destroyed, they’ll need to foot the bill for that.\n\nIf you’re using azure mfa you can have the 2FA occur through their outlook app on their phone, as I’m assuming many people have that installed , so it wouldn’t be a big lift in asking them to install a second app.\n\nAlternatively for the holdouts, let them use phone mfa, they can register their home phone, desk phone or cell phone. I know phones aren’t as secure as apps, but on the flip side not one of my financial institutions requires or even suggests an app for MFA, they all feel comfortable with the risk of using it phone and sms",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "500 yubikeys baby",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "https://help.duo.com/s/article/2112?language=en_US",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yeah YubiKeys are solid but also check out Duo's push notifications if you haven't. They're pretty seamless and might be a good fit if the price is right with your current setup. Plus no need for personal phones if you can swing some kind of company device or find a workaround.",
        "points": "0 points",
        "children": [
          {
            "comment": "Wouldn't push just be duo on a phone?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "We did a rollout yubikeys to multiple thousands of users and they’ve served us well. I highly recommend that route.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "A few others to consider Nitro key solokeys",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If the devices have biometrics, you can use that with Duo (either as a factor or passwordless). You can use yubikeys for sure (but you have to manage them). Would you consider Duo desktop authenticator (in private preview now)? Coupled with Trusted Endpoint policy it’s pretty secure.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Certificate based auth. or Passkeys + Bitwarden whenever Microsoft gets their act together.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "500 is nothing. We did it with almost a million. (Maybe even over a million) Why not just use that?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "RSA tokens?",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bimua2",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bimua2/dlp_product_recommendations_for_data_uploaded_to/",
    "title": "DLP: Product recommendations for data uploaded to cloud outside of Microsoft...",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bimtsk",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bimtsk/grc_professionals_to_follow_on_linkedin/",
    "title": "GRC Professionals to Follow on LinkedIn",
    "points": null,
    "comments": [
      {
        "comment": "Having to work on policy and compliance pretty much weekly, I dont have the energy to write about anything this dry lol",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Gerald Auger makes plenty of content and has a daily cybersecurity news stream.\n\nHe made the GRC Master Class.\n\nYou can find it at Simply Cyber: https://academy.simplycyber.io/p/the-definitive-grc-analyst-program\n\nor\n\nTCM Security: https://academy.tcm-sec.com/p/grc",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I truly don't have an opinion on him yet because there's so much to read constantly, but Jacob Horne is relentless on LinkedIn, I swear posting is his job. He is very vocal and persistent with preaching CMMC and NIST requirements, and from how he breaks down updates, drafts, change to clauses, frameworks, etc., he seems to really know his shit.",
        "points": "8 points",
        "children": [
          {
            "comment": "CMMC evangelist",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Thank you, I'll check him out!",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "He's legit.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I got you. And join us over in /r/grc\n\nThomas Fox > Has a compliance podcast\n\nAyoub Fandi > GRC at GitLab and has a GRC Engineering podcast\n\nJack Rumsey > GRC at Swimlane and has the GRC Destroyer newsletter\n\nVarun Gurnaney > GRC at Apple. I have been chatting with him about the practical uses of AI and engineering. Super smart dude.\n\nMark Graziano > Runs the GRC Podcast, and truly gives a shit about improving the practice.\n\nMichael Rasmussen > GRC 20/20. Not as familiar with him, but he calls himself the GRC pundit.\n\nScott Mitchell > OCEG and an OG GRC person. They put out a lot of resources.\n\nTroy Fine > Used to work with him, went back to being an auditor, don't ever tell him SOC 2 is a certification. All around good guy.\n\nKerwyn Velasco > Was a competitor of mine that I respect, but is involved with ISACA and has good GRC takes\n\nPatrick Garrity > Not just GRC, but covers related topics\n\nSean Connelly > CISA, covers more than GRC, but highlights regulations and other things that impact our space\n\nFolks I work with that are brilliant and keep me from saying stupid stuff:\n\nShane on Privacy\nDaniel a former auditor",
        "points": "5 points",
        "children": [
          {
            "comment": "Wow. Thank you!",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The real MVP. Thanks for this.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Im also curious. Mostly just follow actieve ciso's",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "+1 Troy Fine. Don't know how I ended up following him but good content",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "!remindme 2 days",
        "points": "-1 points",
        "children": [
          {
            "comment": "I will be messaging you in 2 days on 2024-03-21 16:42:28 UTC to remind you of this link\n\n4 OTHERS CLICKED THIS LINK to send a PM to also be reminded and to reduce spam.\n\nParent commenter can delete this message to hide from others.\n\nInfo\tCustom\tYour Reminders\tFeedback",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "!remindme 7days",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can I suggest a change in phrasing / paradigm?\n\nWhen you want to ask this type of question next time, on a public forum like this, maybe go like\n\"Hey guys,\nI wanna follow GRC dudes on LinkedIn, because I have 4 years of xp in cyber but want to move to GRC and want to learn how they think and talk about stuff and keep up to date on industry trends.\nSo far I've found\nx\ny\nz\nI dig their content, but it's pretty simplistic / not deep enough / too technical.\nDo you have any other ideas?\"\n\nIf you do this, it:\na) shows people that you've done the minimum necessary homework\nb) It helps other people who might not follow x, y, z to get something in return while interacting with your post\n\nIf you phrase it like you did, I wouldn't go ahead and make a thoughtful list of suggestions, because you seem to ask the question like you would do to ChatGPT.",
        "points": "-23 points",
        "children": [
          {
            "comment": "Chill lol, it's just reddit.",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I like this as I also get frustrated with low effort questions. Why is it downvoted?",
            "points": "0 points",
            "children": [
              {
                "comment": "Sir this is Wendy's.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Dafuq",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bims3h",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bims3h/does_it_make_sense_to_major_in_cybersecurity/",
    "title": "Does it make sense to major in cybersecurity?",
    "points": null,
    "comments": [
      {
        "comment": "If I could do it all over again, I’d say this. the magic of PenTesting is fleeting so I’d do something less specific with a few more options.\n\nI wish I’d have done Computer Science I wish I was better at programming.\n\nbut here’s ultimately the thing. No one will and could answer the question for you, you absolutely have to figure it out yourself. I have no idea how you could know before hand what you’ll want afterwards but specifically that’s why I would do something with more opportunities.",
        "points": "73 points",
        "children": [
          {
            "comment": "Could you elaborate on what you mean by the “magic of pentesting is fleeting”?",
            "points": "6 points",
            "children": [
              {
                "comment": "Its fun for a couple years then becomes boring and your left with a super specific skillset",
                "points": "38 points",
                "children": [
                  {
                    "comment": "What do you recommend to someone who's interested in web and network-based security pivot after some years under their belt?",
                    "points": "7 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "It requires knowledge of many things to do well. I don’t see why it would be difficult to switch to Sec Engineering, Threat Hunting, or even dev?",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "Speaking from experience: if you dive off the deep end and have worked on a Red Team doing things like adversary emulation, you'll know the theoretical level of sophistication that you're up against if you pivot into a role like Detection Engineering and Theat Hunting. You should be able to speak to highly sophisticated adversary capabilities pretty well.\n\nYou can honestly apply pen testing skill sets pretty much everywhere in security. While pen testing itself might get old after a while, it skills are highly transferable.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Isnt being an expert in a specific skillset better than being a generalist? I would think a pen tester with X years experience would get paid more than a general security analyst with X years",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "Sure, but getting an education in something like dev or IT generally and then honing is better than getting a formal education in pen testing/cyber and then not being able to move laterally because you lack skills elsewhere, I think that's the argument. Start generally and then drill in, that way you can move \"back up\" and specialize somewhere else more easily.",
                        "points": "8 points",
                        "children": [
                          {
                            "comment": "Oh thought he was talking about experience, never heard of a pen testing degree but yeah for that it should be general so you have more options.",
                            "points": "4 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Yes but as you advance in career you will need be competent in lots of other domains.\n\nI did Physics at University with some Computer science.\n\n20 years later - I am a Cyber Senior Manager with experience in:\n\nRisk & Compliance\nSECOPs\nDEVSECOPS\nArchitecture\nPen testing.\n\nMy blindspot is forensics. I started in doing SOC - Then blue/ then Pen Testing / then 10 years of Team leader and manager roles. My strength is Cryptology which intersected with the Crypto-boom. Right place right time i guess....",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "huge question so I hope you don’t mind reading cause I’m about to type it all up for you.\n\nso first who do you work for? it’s really rare for a company to have a internal red team. so you’ll work for a service provider. Service providers are very profit orientated. you will constantly have deadlines one deadline after the other over and over and over again.\n\nthen they will nickle and dime you for every purchase you want to make. in my experience a custom environment for an engagement only happens if it’s a big sale.\n\nthen who will your assignments be? easy most of the time companies who do it for compliance reasons, sometimes a team worked it into their budget because they want a bigger budget next year.\n\nthese companies are usually what you might call middle class companies. it’ll be very very rare for you to be engaging companies that fight off industrial espionage or other threats. and there is no way you could even go toe to toe with APTs anyways even if YOU could your company cannot fund that.\n\nI’ve been incredibly lucky, over the last couple years I was allowed to have huge shipping and logistics companies and energy giants. these companies are engaged with large teams which is rare as well. so you have to figure out how to do that. You also get a lot of time. often times a single engagement is very short the shortest ones I’ve done are about 10 days.\n\nbut again for most people these are far and few between. in fact most people don’t ever get to do that kind of work.\n\na Prof once said the blue team is the real front line team, the blue team is the one that actually puts in work. and he’s right since Feb 2022 I do DFIR digital forensics and I code my Response.\n\nit’s a much different world my CIO and CISO keep saying you guys are the most important guys. cause when everything hits the fan it’s up to my team.\n\nIn comparison Red Teaming is just… idk… just that it’s a compliance audit with more impressive data and results.\n\nalso and here’s the last nail of disillusionment those certs kinda suck. I did the CEH first the PenTest+ and then the OSCP CEH is a professional script kiddie, and you can tell because they change the definition of what a script kiddie is to not make you feel bad. it was literally such a disappointment to me taking it.\n\nThe penTest+ is kinda more of the same but I hated it less. and then the OSCP which was ok but I felt it was outdated when I took it maybe it changed now.\n\nUltimately I wanna get into malware research I think that’s far more interesting and you have a global impact.",
                "points": "7 points",
                "children": [
                  {
                    "comment": "Based response, I’m an info sec Analyst thinking of learning more pen test side of things with TCM just because of curiosity. Do you think getting a pen test cert for my resume and still planning to stay blue team is worth anything? Also thinking of just studying for Microsoft sc 200&100 since it seems like most companies with a “cyber” program just really use Microsoft 365 tools.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "So this subreddit is just the same 4 questions over and over again?",
        "points": "248 points",
        "children": [
          {
            "comment": "Yes. Sometime there's cool posts but most of the time it's low effort \"How can I cyber\" posts.",
            "points": "76 points",
            "children": [
              {
                "comment": "Well? How do I cyber exactly?",
                "points": "30 points",
                "children": [
                  {
                    "comment": "Press alt + f4 to install cyber",
                    "points": "37 points",
                    "children": [
                      {
                        "comment": "Delete system32, that is where all the viruses are stored!",
                        "points": "7 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Put on your robe and wizard hat",
                    "points": "6 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "ASL?\n\n/SARCASM",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "😂",
                        "points": "4 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Lol, we must be the same age. I had the same joke locked and loaded.",
                        "points": "3 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "There is a brew installer for mac right?",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Well, people are looking to get into the field. You dont know what you dont ask.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Considering the same question gets asked here every few weeks, a simple Google search would probably yield the same result.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "The same could be said for posts that dont get asked a lot either🤷‍♂️",
                        "points": "-1 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "*every subreddit",
            "points": "8 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Blueteamsec is more interesting",
            "points": "4 points",
            "children": [
              {
                "comment": "And from what I understand has more opportunities.\n\nIn junior year of network and security admin major with cy ops minor and really enjoying it.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "\"always has been\"",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "enlighten me, what are the same 4 questions?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I like the “is it worth it??” questions. Well, that depends on a lot of variables and you haven’t given us any of them.\n\nAlso, no, absolutely not. All IT jobs are meaningless and unfulfilling. AI is going to kill all of them. The layoffs and the job market will never get better. All industries are the same and equally shitty.",
            "points": "-4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "And the same comments to those questions which amplify the original questions.",
            "points": "-3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Get a computer science, info tech, or info sys degree instead of cybersecurity. A lot of schools will offer a major in computer science, for example, and also allow you to specialize or choose an area of focus like cybersecurity.",
        "points": "80 points",
        "children": [
          {
            "comment": "I decided to choose Cyber Security because it did not require math. Every other CS degree I needed to take physics 1 & 2, calculus 1 & 2, and linear algebra which felt sooo redundant.\n\nMy plan is, learn as much as I can about Cyber, and realistically start in the IT field to gain experience and go from there.\n\nIt sounds crappy but I'm actually excited to start in the IT field. And from the sounds of it, getting a job in Cyber right out of schooling is basically unrealistic. After working in broadcast for the past 8 years, I cannot wait to get into the IT field.\n\nEdit: unrealistic not realistic lol",
            "points": "19 points",
            "children": [
              {
                "comment": "What?! My Cybersecurity degree has me through Calc 😭",
                "points": "13 points",
                "children": [
                  {
                    "comment": "LOL",
                    "points": "6 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "my degree is Cybersecurity Engineering, so I'm taking all of the maths and some physics ontop of the Cybersecurity, I don't have a single light subject, so atleast when I get into Cybersecurity I would already be used to being burnt-out",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Are you doing cryptography or something?",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "No, just straight Cybersecurity. In hindsight I would have gone into a more broad IT degree but I’m more than halfway done and feel stuck now",
                        "points": "3 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "My cybersecurity / info assurance degree only made me take college algebra and trig lol",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Honestly sounds like we have about the same plan, good thing to know that I'm not only one thinking that. Plus my school is being paid by my work so I'll be ahead with no student loans lmao",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Would a swe degree suffice?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This question is just going to get you biased answers. People with a computer science degree will say you need that, people with a cybersecurity degree will tell you it is fine, and then people with no degree will tell you skip school and get certs. Figure out what you want to do and follow that path.",
        "points": "33 points",
        "children": [
          {
            "comment": "Revision 1: Eliminated Overly Cautious concerns related to my personal experience.\n\nYou might go into Level 1 SOC. You might go into Help-desk. Internships are great. Best of luck.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I manage a SOC, and I'm unlikely to hire someone straight from school into our team. Most of my team has a degree or training in IT of some sort and started in another role. I want people who have some experience in the real world supporting/fixing Windows and Network issues. You need those core skills (in my opinion) to move into Cybersecurity. I got my start building computers, moved to help-desk, supporting network/servers, and even did some coding before moving full-time into security.",
        "points": "22 points",
        "children": [
          {
            "comment": "How would you feel about a Data Engineer trying to transition into Cybersecurity, what would that individual need?\n\nMy experience consists of backend development, databases, API’s, etc.",
            "points": "5 points",
            "children": [
              {
                "comment": "For a SOC role, again, I'd like to see some network and Windows (other OSs are a bonus) experience. I want to know I don't have to teach you CIDR and RFC1918 addresses. I want to know if you understand basic routing and firewall rules, TCP vs. UDP, DNS, etc. I want to know if you understand process trees, event logs, user accounts, permissions, etc.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Greetings from Uk, I am currently 2nd year Computer Science student. Last summer I did Comptia Sec+ as my summer project. This summer I am thinking between CCNA or BTL1( Blue team level 1) not sure if u heard of it. Which one would you recommend? At the moment I assume CCNA would give me better chance to get any job into JuniorSoc( if that exist) or any IT related job. Thank you",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "You sound more suited for DevOps. Do that for a few years, and then you would be more likely to be considered for an entry level security position.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Problem with DevOps is that it’s so difficult to find entry level positions :/ just like for Cybersecurity roles.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I have a question. Do you think it’s better off for students to double major in both cyber and in network administration? Instead of majoring only in cyber?\n\nI’m currently in CC double majoring in that.",
            "points": "0 points",
            "children": [
              {
                "comment": "Only if you feel like you want to learn those things, don’t do it for job prospects",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Not at all. Cybersecurity is either in the weeds or Birds Eye view. No way you’d get that from a degree.",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Get an IT degree.",
        "points": "16 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No, major in computer science. Learn how to program.\n\nEdit: I think most cybersecurity can be learned on the job and cybersecurity degrees are very common nowadays. The programs also vary in offering and no 2 are alike. Programming/CS is in demand and all of my roles required that I know how to read/write and analyze code.",
        "points": "46 points",
        "children": [
          {
            "comment": "Agreed, go for the baseline, specialize after.",
            "points": "11 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I think suggesting someone who wants to get into cybersecurity should major computer science in particular is outdated advice depending on both the school's cs program and their own goals. computer science should be all about math and proofs and such. that's what computer science is. if you want trade school, you don't take a CS program. if you want to be an electrician, you dont get a physics BS. just as electricians study some physics - what they need to know to be good electricians - aspiring cyber security people should study some computer science, but they're different subjects and different goals with different requirements. i know plenty of CS majors that dont know shit about computers, much less cybersecurity.",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "u/prodsec what about a degree specifically in \"Software Engineering\" does it have more advantage over vanilla Computer science. The programs at wgu for example.",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "As someone who has worked at a university (and been responsible for hiring personnel) and sees what they teach CS undergrads, I would NOT hire a recent CS grad for Cybersecurity. If not a Cybersecurity degree, I would look for an IT degree. At least in those degrees, they teach some security.\n\nFor entry level, intern experience in a security role will get you much further than just your degree.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Instructor of Cyber Security (part-time) here:\n\nAs many here have said CompSci or IT, gather experience, then focus later on with additional training and certifications. Undergrad should be a foundation / generic. Grad school and certs are where you can focus - once you have experience.\n\nI TEACH Cyber Security courses and I am in disagreement with our curriculum and full-time faculty on a lot of the stuff we teach. Why? Because it's both too high-level to be useful or applicable and too specific to just security to really make sense. A lot of colleges are trying to fill a gap they don't even understand themselves. Security is really hard to break into because most security roles require years of understanding in operations, development, or other parts of technology first. The faculty teaching a lot of these courses don't even have security backgrounds themselves. It's blind people teaching other blind people.\n\nThis also gets posted literally daily on this sub but it is really difficult to just \"jump into\" security. The few people I've known that have, came from a Computer Science degree / background and pivoted from a development to security and a pseudo red-team role. Blue team though? Really hard sell. How do you secure infrastructure if you don't even understand what it does? How do you secure a network if you don't understand routing, switching, TCP, UDP, etc.. How do you implement controls if you don't even know why you need the controls? I can teach people how pass a Security+ exam all day, and I can teach them how to literally press buttons on a security appliance UI. It doesn't mean they understand any of functions they are performing. This is where these degrees fail. So you can put a base config on a firewall and tell me how to create a policy? Great, so can a Help Desk person. You can perform a basic nmap scan with Kali Linux? Cool, so can literally anyone with YouTube.\n\nSo many of these \"Cyber Security\" degrees miss the bigger picture and that is that they teach you HOW to press buttons and do things. They don't teach you WHY you have to do these things and unfortunately that usually comes with experience.\n\nIt took me years and years of experience and education to truly understand enough about information security to feel confident performing it. None of my degrees are in security. I'm a BS - Information Systems / Technology and AAS - Information Technology Network Administration.",
        "points": "10 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m currently in community college in my 40’s to learn a new trade since cancer disabled me from my manual labor career, but disability pays next to nothing. I’m majoring in cybersecurity. And programming. And also network management… because of the schedule in which the necessary courses are offered, I will have an extra semester anyway, and add in summer semesters, I’ll graduate on my original timeline with 3 degrees instead of one. Not sure if I’ll go directly into the 4 year degree or wait and do it over time.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have a cyber security degree am I now work for a Fortune 500 as a senior analyst make 6 figures and I’m about 4 years out of school. Do whatever you think is interesting and make sure it’s accredited. My degree was considered part of the STEM field at my college. If you get good grades and push for internships you’ll be fine no matter what you pick",
        "points": "12 points",
        "children": [
          {
            "comment": "Y’all hiring",
            "points": "5 points",
            "children": [
              {
                "comment": "Unfortunately no.. I started as an intern and worked my way up. That was a good path for me, I hope you can find something similar!",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Right! 😭",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Cyber security is not an entry level thing. It's something you get into after being in IT. Go for comp sci or for IT, learn a stack whether it be programming, or like azure and then learn to secure stuff, get some cyber sec certs and find a job in the field.",
        "points": "15 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Study comp sci, learn python, azure, and AWS and then specialize. But with the money you’ll be making you likely wont even want to do cybersecurity anymore lol",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Personally no. My experience is an IT Business degree will take you a lot further (if you want that path). My own experience is certifications carry a lot more weight in cybersecurity.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's a tough thing to answer because cyber programs vary so much from school to school.\n\nGetting a comp sci degree is a safe option because of its versatility.\n\nDepending on your school you may be able to double major, minor in cyber, or complete a 4+1 BS/MS.\n\nI would argue a 4+1 Comp sci/cyber will be your best overall option.",
        "points": "7 points",
        "children": [
          {
            "comment": "I have a cybersecurity degree and i can tell you it is trash. When i got my degree the program was all over the place. I was lucky that the degree was structured a little better during the tail end of my degree.\n\nTo answer the question I would always recommend someone major in a \"real and structured\" IT degree and maybe minor in cyber.",
            "points": "5 points",
            "children": [
              {
                "comment": "I got a Bachelors of Science in Cybersecurity. I graduated within the last 4 years. The program was hyped up. When I was seeking employment, I sent out ~200 Applications. I got rejected from basic help-desk jobs. The only jobs that did interviews with me were training programs that are 2 to 3 year contracts. For a while I was in food service.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Ya buddy! Welcome to the land of the \"promised jobs\".\n\nI wasn't able to get a good internship so I ended up getting into help desk. After grinding help desk for 8 months I moved into Cybersecurity and now make six figures. The degree helps for sure, but experience is still king in Cyber, and it isn't an \"entry level role\".",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I can only frame it through my life path. I had been in reasonably low level IT jobs (help desk / specific software support). My security degree was an amazing way to fill knowledge gaps, change scale of perspective (as security is pretty holistic). My experience was that a security degree is a great place for a tech generalist to be. It's wide and shallow versus narrow and deep.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The only right answer is: it depends.\n\nEveryone's journey is different and yours will be your own. As with any journey, you will get out of it what you put in.\n\nPersonally, if I had to do it all over (I did a cyber program), I would do computer science with a minor in business. The first thing I would do when getting close to graduating would be to grab a cert or two in the area I would like to focus.\n\nI would also be networking like crazy during school and line up cyber internships during the summers.\n\nThat would be the ideal setup for a long, successful career in cyber.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Do something more in demand and pivot to cyber IMO",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm getting my degree in informatics with a specialization in cyber. My degree is very focused on practical application and feeling comfortable in a work environment. Just research schools and go somewhere that has a good program that actually tries to prepare you for a career.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I would pursue a computer science degree. That gives you the flexibility to move across fields if you get burned out or find something else interesting.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I am of the opinion that a major that focuses on coding will yield a career path alot quicker than any other IT degree path.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have cybersecurity degree but I decided to go back and get another bachelors in computer science (it was quicker because I did it at the same school). I’ll be honest the concepts were not that difficult to grasp. I also have a 6 years of experience as a cyber analyst. Most of my knowledge is from OJT. I agree with some of the comments here that CS might be the way to go because it’s teaching you the deeper side of things and you can branch out to more technical roles such as devsecops or security engineering. Even reverse engineering and vulnerability research requires you to understand programming concepts, computer architecture, hardware, etc. A lot of cybersecurity jobs also require scripting now. You only get the first layer of things in cybersecurity. But if you really want to learn specific fields in cybersecurity I recommend getting certifications.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No. Go study computer science. Get a masters in cybersecurity if you’d like, or maybe some certs.\n\nComputer Science will get you much further in your career.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nope lol why there is a major in cybersec to start with, this is not entry level you need CS and IT background...",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "OP,\n\nYou won't be an \"all-knowing employee\" until you have field experience. With that said... if you have a specialty as opposed to the general knowledge base, that'll go a bit further.\n\nI'd recommend a generalized knowledge base, plus a speciality... ie Networking, Coding, etc.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you chose the right school, then yes. You'll want to start with something on the NSA excellence list (it's pretty big now), and then you want to make sure you are picking something that is actually hands on, as a lot of them can still teach the curriculum without actually 'doing' anything. A good school is going to give you the classes to be good at wireshark, understand how AD works, etc.\n\nTo truly excel, you will be doing the coursework and then spending time at home building your own lab to take that foundation and figure out what you enjoy to take further. You need to really enjoy this stuff to get immersed in it and build out all of the supporting pieces.\n\nFrankly, the biggest part in choosing a school for this is figuring out how their career center works. What do they offer for mock interviews, resume building, etc. What do they do for career fairs, what are their placement rates and success stories? You can end up in some middle of nowhere small school that ends up providing excellent coursework that gets you engaged, while also having a good career center that gets you into internships and into the job market.\n\nAs many other people will state: you need to be good with computers as a whole. You need to understand how windows works in and out in order to attack or defend it, you need to understand how things like AD works, you need to be excellent at knowing how to read wireshark, how to talk networking talk, etc. This means you need to have prior 'CS' general experience, or be ready to dig down and learn it yourself on the side to supplement whatever your school is teaching you.\n\nPeople won't like to hear it, but if you chose the wrong school you will end up like most saying 'no'. If you chose right, you will be on the side of the fence I am on, which is saying 'yes'.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m a recent graduate with a degree in cybersecurity, and personally it was a great decision. I ended up with a good job in the field doing something within my specific skill set. The one thing I’ll say is that you should never go into a cyber degree, and maybe a computer science degree for that matter, with the idea that you can get everything you need solely from the assigned courses. The classes I took prepared me extremely well, but I spent a lot of time learning outside of class with the security club and with personal projects / homelabbing. If you are interested in a cyber degree make sure you find one that doesn’t teach you how to use tools, but rather teaches you fundamentals in programming, networking, databases, report writing, and systems administration.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If I were going into school and 18 - I would get a CS , networking , or mayyybe a web programming degree. (Like many have said )\n\nI can’t decide if I would do airforce before or after degree , but that would be high on list (if op in USA)\n\nIf no airforce and you love school maybe go to law school after undergrad. Tech savvy lawyer with infosec knowledge probably more in demand than fresh out of school cybersecurity degree kid fighting for that entry level soc role with other recent grads .\n\nNo surefire path and nothing is guaranteed - but unless you are like super badass techwise I would spend time focusing in on one of those skills. Plenty of routes to get that cybersecurity job …\n\nDon’t get me wrong - plenty of liberal arts majors get a helpdesk job and end up leading a cybersec department - but I think a strong foundation will allow you to breath easier later in career.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nope, major in Software Dev, Comp Sci, IT, jump from there to cybersecurity. Gotta know how it works to secure it",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you want to work in cybersecurity, why wouldn't you major in it? Of course you should. Just be prepared to do well in school and move to a different city after college for a job.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Cyber Operations from an NSA CAE certified school combines comp science and cybersec. Would recommend one of them. Dakota State is a good example that's also cheaper than most schools.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No, choose Business (Business Information Systems, if available).\n\nCybersecurity is a business function.\n\nCoding and other technical skills can be learned in your own time.\n\nLearning how to communicate and present effectively and where/why/how we fit within business operations and how businesses operate is more vital to your career success.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What major is best is determined by which school you are going to, without that info no one can guide you. In general the \"safe\" route is always computer science from your state's public university.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Personally, if I was starting again and going the security route I’d be looking at starting with building some solid networking skills first. Knowing how the multitude of devices talk(and not talk) to each other can’t be overstated enough.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Graduated when cybersecurity degrees were becoming a 'thing'. In my working experience: IT > Cybersecurity > Computer Science > Information Systems",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "NO",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Whatever degree you get it won’t matter. I personally would say do the cybersecurity degree, get trifecta of certs and maybe CySa+ and do projects with packet tracer, Wireshark, Splunk, AWS, virtualization and maybe think of doing one project working with activity directory. MyDIFR has one he’s doing in Active Directory now on YouTube. He also had projects and labs SOC related. No matter what degree you get it’s all very broad and 99% of the time recruiters don’t know the difference and only look if you have a degree, certs, projects and most importantly work experience. So try to get a internship while in school.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "College is meant for you to get a bit of everything. Get a taste, smell, sight, or feel of everything. And than you on yourself will go and dig into what you found really interesting.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If your career goal is cybersecurity, yes it makes sense to major in it. You may not need the breadth of information when starting out, but as you progress into higher levels of cybersecurity it will certainly be more and more useful.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nope, don’t major in cyber. It’s a waste.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Does it make sense to major in cybersecurity?\n\nThat depends, are you\n\nA HS student looking to go to college\nAn adult with non related job experience looking to go to college\nsomeone in the military looking to check the box to get their degree\nalready in IT and looking to check the box to get their degree\n\nIf you're in High School and applying to college or in college and looking to declare a major, No picking cyber should be last on your list\n\nPick something you will stick with the next 4-5 years and want to study\n\nWhat colleges offer isn't a mystery, their entire academic catalogs are online, find a program that interests you\n\nMajoring in cyber isn't going to make you any more competitive than someone who didn't because the majority of security roles are not entry level - you need experience in IT/operations anyway\n\nregardless of your major - take Public Speaking, Technical Writing, Business Communications, Project Management - learn microsoft office - because these are things you are going to use in any job in every single industry\n\nThere are plenty of free resources to learn computer science if you don't want to major in it\n\nI posted a list last week\n\nUsing edX and MIT OpenCourseware take a look at\nhttps://www.edx.org and https://ocw.mit.edu\nHarvardX- CS50's Introduction to Computer Science\nMIT - Mathematics for Computer Science\nMIT- Computation Structures\nStanfordOnline: Algorithms: Design and Analysis, Part 1\nStanfordOnline: Algorithms: Design and Analysis, Part 2\nHarveyMuddX: Computer Architecture\nMIT- Software Engineering for Web Applications\nHarvardX: CS50's Web Programming with Python and JavaScript\nHarvardX: CS50's Introduction to Programming with Python\nUCSanDiegoX: Data Structures: An Active Learning Approach\nMIT- Database Systems\nIBM: Introduction to Web Development with HTML5, CSS3, and JavaScript\nLinuxFoundationX: Introduction to Open Source Networking Technologies\nNYUx: Network Security - Protocols\nDartmouthX, IMTx: Linux Basics: The Command Line Interface\nMIT - Effective Programming in C and C++\nMIT- Introduction to Programming in Java\nIBM: NoSQL Database Basics\nMichiganX: Database Design and Basic SQL in PostgreSQL\nHarvardX: CS50's Introduction to Databases with SQL\nMichiganX: Programming for Everybody (Getting Started with Python)\nUCDavis: JavaScript Basics\nMichiganX: Using JavaScript and JSON in Django\nMichiganX: Django Features and Libraries\nMichiganX: Building Web Applications in Django\nIBM: Linux Commands & Shell Scripting\nRedHat: Fundamentals of Red Hat Enterprise Linux 9\nIBM: Introducing z/OS UNIX System Services\nIBM: Full Stack Application Development Project\nGTx: Human-Computer Interaction I: Fundamentals & Design Principles\nHarvardX: CS50's Introduction to Cybersecurity\nanyone wanting to go really old school\nhttps://openmainframeproject.org/projects/cobol-programming-course/\nCOBOL Programming Course #1 – Getting Started\nCOBOL Programming Course #2 – Learning COBOL\nCOBOL Programming Course #3 – Advanced Topics\nCOBOL Programming Course #4 – Testing",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bim9xm",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bim9xm/splunk_integration_on_gitlab/",
    "title": "Splunk integration on Gitlab",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bimail",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bimail/new_detection_engineering_reddit/",
    "title": "New Detection Engineering Reddit",
    "points": null,
    "comments": [
      {
        "comment": "Your welcome post on that sub itself links to a different sub entirely.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bim9e6",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bim9e6/mobile_device_confiscated_by_cbp/",
    "title": "Mobile device confiscated by CBP",
    "points": null,
    "comments": [
      {
        "comment": "When I cross borders I turn my phone off.\nGood luck pulling anything from it if it is booting from cold and doesn’t have the first stage of unlock yet",
        "points": "71 points",
        "children": [
          {
            "comment": "Happened to a colleague of ol mine. The choice was to hand over the unlocked devices with passwords or be detained while they got a court order to compel it.",
            "points": "17 points",
            "children": [
              {
                "comment": "I’d wait for that court order.",
                "points": "34 points",
                "children": [
                  {
                    "comment": "For clean travel devices (like these were), after returning to your home airport on a business trip with no connecting flights (like in this case), then I'd flip a coin depending on the time of day, weather outside, the likely length of the queue at the taxi stand, if I was on an hourly rate for work travel, and how desperate I was for a post travel beer. The last would be the main factor.",
                    "points": "10 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "They can’t detain citizens while waiting for the phone to be unlocked but they can keep the device for a bit. There’s one jurisdiction where a court ruling prevents them from compelling you to unlock the device without a warrant",
                "points": "16 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [
                      {
                        "comment": "No OP said US CBP it’s the first sentence",
                        "points": "3 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": true
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Is that Android or iPhone?",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "What’s the first stage and what’s any stage after that?",
            "points": "1 point",
            "children": [
              {
                "comment": "Reboot your phone and tell me what steps you have to take to get to your homescreen",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "They're using Cellbrite to take a forensic image of the phone. The image will be saved for later use if they follow up with anything.\n\nDuring that later interaction, they'll try to legally compel you to give your passcode.\n\nEssentially, it's a way to \"hold onto your phone\" in case something develops later. Did they not give you a receipt or any paperwork about that transaction?\n\nSource: I work in tech in a law firm and we use Cellbrite for voluntary collection all the time as part of discovery. The protocol above has been used tons by us in the early stages of litigation; it let's a judge order a snapshot in time of a device, then determine later if someone's allowed to look at it, etc.",
        "points": "47 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It depends on the phone make, model and operating system and if the phone was unlocked or not. They probably are using a system that can pull an image off the device but some phone manufacturers like Apple have deployed protections to specifically prevent against these types of attacks. For example:\n\nhttps://support.apple.com/en-us/111806\n\nThe idea is the phone won’t communicate or even charge with an unknown device if it hasn’t been unlocked in the past hour. Not sure if Android devices do this.\n\nThey could have been using a Greykey to try to brute force your passcode\n\nhttps://www.vice.com/en/article/k7835w/how-to-brute-force-iphones-graykey\n\nYou can see here, the GreyKey only really works on older devices:\n\nhttps://www.magnetforensics.com/blog/graykey-supported-mobile-devices/\n\nThey might have a device that tries to run zero day exploits to gain access to a locked device, but honestly I doubt it very much. Such exploits are with millions of dollars, usually reserved for attacking politicians etc.\n\nIt’s hard to know really what they did, but hopefully this comment section sets you off in the right direction and you can find some comfort.\n\nMy advice is, buy an iPhone, keep the operating system up to date and set a long PIN which is longer than six digits. My reason for this suggestion is backed by the links above, and moreover the Apple VS FBI case:\n\nhttps://en.wikipedia.org/wiki/Apple%E2%80%93FBI_encryption_dispute?wprov=sfti1",
        "points": "39 points",
        "children": [
          {
            "comment": "I love the idea of the CBP either researching or buying zero days in order to exploit them in random traveler's phones.",
            "points": "24 points",
            "children": [
              {
                "comment": "It's so much worse because they aren't out there on forums buying exploits, they are shopping for commercial products with sales pitches and demos.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Interesting fact, criminals lie, and bad criminals turn to the rando's for advice. Not saying OP is a criminal, but if they cross the border frequently and you don't have a solid reason, that can get them suspected of drug smuggling. Also, before you think criminals are great master minds, sure some are, a good number though are close to yourself in terms of intelligence (and some less). Heck, a major pot smuggling group was founded by some highschool student gamers, who also got ripped off the first time they tried it (go figure showing up with a few thousand to some guy's crappy apartment gets you crappy weed, after they lied about having the best stuff that you were looking for).",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "[removed]",
            "points": "10 points",
            "children": [
              {
                "comment": "Understandable but please read the links.\n\nThe case of iPhones protecting user data against one of the world’s most sophisticated intelligence agencies is carved deeply into the public record. Apple even went as far to develop new protections for their users to hamper law enforcements efforts to break it into iOS devices.\n\nhttps://en.wikipedia.org/wiki/Apple%E2%80%93FBI_encryption_dispute?wprov=sfti1#\n\nI am unaware of any Android device or manufacturer who can make the same claims.",
                "points": "10 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "When you go thru the airport, have your devices powered off and ensure that you've got the device encrypted.\n\nPrint your boarding passes before leaving home, or scan your passport at the airport.\n\nIf the device was out of your control, assume it's been compromised.",
        "points": "12 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Heh. Other people have explained the outcome. If it was a very new and updated phone they probably only got a logical image of the data. \"Only\". In a just and sane world they would only be using the data to validate that the reason for travel and the story matches up. In a not so sane world, they pulled all the text messages, contacts, picture metadata etc and aggregated it all into a system looking for known criminal connections and evidence of illegal items. Assume all the passwords are compromised for things like browser sessions, social media accounts, etc.. and are actively being investigated by someone looking for anything they can find :)",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Look, no one here really knows as there's too many variables in flight. Your answer is somewhere between nothing and everything.\n\nMore to the point, if you want to restore confidence in your phone, reset it to factory defaults.",
        "points": "9 points",
        "children": [
          {
            "comment": "Amazing answer, thanks.",
            "points": "1 point",
            "children": [
              {
                "comment": "Unfortunately, this doesn't restore confidence in the data though, as that \"could\" be extracted.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "They won't put anything on it unless there's a warrant that empowers them to do so, and it's the last step before they arrest you for something they already have a good idea that you're doing.\n\nWhat they're usually looking for is evidence of \"child sex tourism\". If you returned from a country that's notorious for it then that's likely why you were randomly selected.\n\nThen again, if you arrived from a nation hosting entities hostile to the US you were selected for other reasons entirely.\n\nMore information: https://www.aclu.org/documents/government-data-about-searches-international-travelers-laptops-and-personal-electronic-devices\n\nhttps://www.aclu.org/files/pdfs/natsec/laptopsearch/dhs_20100816_DHS000153-DHS000156.pdf",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'd assumem this device compromised. Replace and keep a very close eye on the user's account. Also r/absolutecomputergeek",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Pretty much whatever your worst case scenario is, and then some:\n\nhttps://en.wikipedia.org/wiki/Cellebrite",
        "points": "10 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I really want to know want you are doing to get flagged on this. I never heard of this as a randomed search. My understanding is these are targeted",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They use graykey along with every single other federal law enforcement agency. Not many use cellebrite anymore to my knowledge. I know we let our cellebrite contract lapse when we got graykey back in 2019. They are basically doing a quick run thru texts and images. The software can quickly process and identify images like drugs, booze, cash, nudes, etc. they are looking for low hanging fruit. Don’t know how long they keep that image for though.",
        "points": "1 point",
        "children": [
          {
            "comment": "Look in the databases you’ll either see a cellebrite database in there or a graykey database. You’ll have to dive deep while hooked up to a Mac and use finder to drill down into the system.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Probably imaged it with cellbrite and then they retain that.\n\nI'm curious about is if anything was installed.\n\nNot unless you are \"special\". Basically CBP won't do that but, if requested, they can hand it off to someone else in Uncle Sam's Acronym Soup of LE/IC to do their dirty thing with your fondle slab.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Depends on what they used to collect and analyze the device. They have access to pretty much any tool at their disposal. It might have installed something temporary to gain access or image the device. They can legally keep the data they collect if they suspect a crime (not saying that is right, just that they can). There has been a lot of controversy about how little they disclose about data from confiscated devices.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They can only take a image of the device, to install something on it they would need a warrant, this assumes it was the US border patrol. If they had a warrant to install they could have used that moment to install a device if you regularly do cross the border, if you don't it would be one hell of a coordinated effort that the federal government either isn't capable of for most things, or you really pissed off some people to get that much attention that they actually are doing inter-agency coordination.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "https://news.ycombinator.com/item?id=27603747",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "prosperity\n\nDo you mean posterity?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In order to take a forensically sound image you have to use something that hardware prevents any writing, so if you only saw one operation the probability is it was read only.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They copy everything.",
        "points": "0 points",
        "children": [
          {
            "comment": "They attempt to copy everything.",
            "points": "20 points",
            "children": [
              {
                "comment": "Good point",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "They do that looking for child porn smugglers",
        "points": "-4 points",
        "children": [
          {
            "comment": "Yeah okay sure, and they completely ignore and discard everything not related to that particularly vile kind of crime, with an exception carved out for updating Santa Claus’ Naughty or Nice List, because the government is definitely of the People, by the People, and for the People— and only acts in the best interests of the Citizenry and acts within the constraints of the Constitution they all swore oaths to. And clearly they care about the children, just look at the world they’ve carefully curated to pass down to them.\n\nSometimes they also use gathered information for other activities like tipping off the Tooth Fairy on who’s got a loose tooth, or trying to find and punish every last person who rode the Lolita express, but certainly nothing more than that. Because the people running the show definitely put our children first.",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bilqld",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bilqld/sscp_study_material/",
    "title": "SSCP study material",
    "points": null,
    "comments": [
      {
        "comment": "I just used ITProTV seemed fairly up to date",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you have done Sec + and CySa + go take the exam.",
        "points": "0 points",
        "children": [
          {
            "comment": "Yeah I have my Sec+ and CySA+.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bilk8j",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bilk8j/wiz_vs_orca_vs_lacework/",
    "title": "Wiz vs Orca vs Lacework",
    "points": null,
    "comments": [
      {
        "comment": "You are looking at some of expensive names. You might want to consider a smaller company like stacklet.\n\nMy company was a customer /“design partner” for laceworks. If you plan on using this produce to also report on your instances (I.e. virtual machines) vulnerabilities I do not recommend LW, that was our biggest pain point with them.\n\nLong story short we moved over to crowdstrike. Crowdstrike is not perfect but it’s soooooooooo much better.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bik5kb",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bik5kb/passwordless_just_singlefactor/",
    "title": "'Passwordless' Just Single-Factor",
    "points": null,
    "comments": [
      {
        "comment": "MS relies on Windows Hello where you need a device (the PC where you registered your credentials and is stored on the TPM) and either your PIN or bio (Face or fingerprint) when you login to your workstation. So it’s two factor- something you have (PC) and something you know (PIN) or something you are(bio). Of course I oversimplified the Windows Hello explanation.So you can’t use it on a different PC unless you also register with Windows Hello on the other PC. When you access Saas integrated with your Azure AD/Entra it derives a secure token from your previous Windows Hello authentication. So it appear to be “passwordless”. Some SaaS vendors leverage this ecosystem so they advertise as supporting passwordless.\n\nNow some augment this by asking for additional factors such as MS Authenticator or FIDO2 keys when accessing special/privileged systems or applications. Again, it depends on the implementation.\n\nIn short, in some instances it may appear to be less than two factor but it may be due to the seamless user experience and security implementation that makes it appear to be less secure.",
        "points": "57 points",
        "children": [
          {
            "comment": "Interesting, nice explanation.\n\nI asked this question originally because I'm on a new work laptop, signed into my own azure personal account and never got prompted for a password, strictly a code sent to my email (on a MAC so I assume no Windows Hello, unless that's part of the azure suite).\n\nSo the PC being 'something you have' needs to be tied uniquely to you before it can be something you have, it seems, or else it isn't really authenticating you.",
            "points": "4 points",
            "children": [
              {
                "comment": "Yes - so the tricky part for the enterprise, specially for remote users is the “tying” of the something you have to something you are. If we have a remote user in a different country and send them a secure laptop, how do we know that the user registering the account is the actual user? There are ways to verify but it’s not a tech solution but more of a process solution.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Sounds like a lazy implementation",
                "points": "-9 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "our \"passwordless\" - MS Authenticator on an intune registered device, requires 6 digit pin, fingerprint on authenticator, then providing a 2 digit code that is typed in authenticator.\n\nSIEM backing that up with SOAR to revoke sessions if it doesn't like the login telemetry.",
        "points": "17 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Passwordless auth isn't mutually exclusive of MFA. You can be passwordless and still do MFA.\n\nThanks.",
        "points": "16 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I would argue the legacy view of MFA (something you have, something you are, something you know) is a bit simplistic in today's world of more complex attacks.\n\nIf you have just a password, then it's guessable, disclosable from a breach, etc. I think we'd all agree on that.\n\nIf it's just a \"what you have\", you're susceptible to either stolen device and/or fatigue-based attacks.\n\nBut what if it's a device protected by biometrics or a passcode? It's now technically something you \"know\" (to unlock) or \"are\" (to unlock), plus something you \"have\".\n\nMany argue that technically speaking, a properly-configured Microsoft Authenticator setup is two-factor. You need device PIN or biometrics to get on to the device, then you need to approve the notification or enter the TOTP code. But if the phone is stolen while unlocked, both factors are defeated (unless app requires biometrics or PIN for each auth attempt). So is the service then two factor only when a phone is locked? This really is only a concern when the device is physically stolen - whereas the more common threat model is remote attacks, which it still is more secure than just a password.\n\nLayer on top some webauthn components (device proximity), you're still just as susceptible to physical theft attacks, but you are way more secure than password+TOTP style MFA for remote attacks.\n\nTL;DR: I think we need to properly threat model applications and risk scenarios, versus just blindly follow traditional MFA guidance.",
        "points": "5 points",
        "children": [
          {
            "comment": "Very nice summary.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Not all Authenticators (password/SMS/push codes, etc.) are equal. NIST SP 800-63B does a good job explaining when each type should be used.",
        "points": "4 points",
        "children": [
          {
            "comment": "Superb thanks",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Cause targeting a specific password can be an easy phishing aim",
        "points": "1 point",
        "children": [
          {
            "comment": "But if your accounts all enforce MFA then does it make a difference?\n\nNot understanding the point here though, phishing attempts to get your password, so how does having password + device become less secure than just, device?",
            "points": "1 point",
            "children": [
              {
                "comment": "MFA fatigue is a real thing and gets a lot of people.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Phishing MFA codes is effectively just as easy as phishing a password now. The biggest hurdle to phishing a password is convincing the user. Once they give up their password, they're convinced it's a legitimate service - so if an MFA prompt occurs, they'll just as easily give up the MFA code as well.\n\nEvilProxy is one toolkit used by attackers to phish a password, replay it real-time against the real authentication system, and then prompt the user to give the MFA code that the real authentication system sent to the user.\n\nProper passwordless implementations will check for proximity or have other \"phish-resistant\" methods. Webauthn, Passkeys, Fido2 keys, and Windows Hello for Business are all viewed as phish-resistant, due to various strategies that they employee; either device proximity, or not relying on the user to enter a code (which they can input to a malicious location), etc.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Currently, it's the new standard for best practice on 2 MFA.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Major vendors like Microsoft and Google recommend and Apple enforce 2FA/MFA so I don’t think that’s a bad trend so far",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My biggest issue with passwordless is the reliance on devices and I think most anyone who's worked help desk knows how users treat devices. I foresee issues arising from users of single devices needing to reset every account they have after dropping their phone in a lake... again.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's the passkey method (WebAuthn/FIDO2).\n\nIts designed to replace the password, which can be weak, written down, forgotten, phished or bullied out of you.\n\nSo it replaces something know with something you have; a public/private key pair that identifies you on the device you're using. But MFA is still necessary to be secure, so we now have a passkey + device/authenticator/token etc.\n\nIt's basically now \"something you have\" x 2, removing the need to have \"something you know\".",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think \"passwordless\" in and of itself is less a security feature, and more a convenience for the user. It's often implemented along with security features or other conveniences, such as through SSO or more secure authentication methods such as biometrics.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It is technically 2 factor, though. You have to know the code, and to get the code you have to have access to the email. It may not be more secure, but it's not really less secure and it's easier to use because you don't have to remember a password.",
        "points": "1 point",
        "children": [
          {
            "comment": "You have to know the code, and to get the code you have to have access to the email.\n\nThen it is only verifying access to the email. So one factor. I understand the confusion because you have to temporarily \"know\" a one-time-use code, but to consider that 2fa devalues the entire concept.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It's not really something you know, the code is sent to your email. Unless you're saying once you read it, you 'know' it, but the idea of 'something you know' is supposed to be something unique that only you know.\n\nThe code can be read by anyone with email access.\n\nHowever I am just now thinking, does it even matter if password resets can be done with just your email?",
            "points": "0 points",
            "children": [
              {
                "comment": "Yes, if your email is compromised you are in trouble. That goes with any sort of email verification or code method.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "With personal outlook, it asks you for the email registered...so you need to know the email address and also have access, thus 2-factor. For businesses, it varies on how it is handled",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You are right, something you are can be faked, a second factor should be included",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm not a fan of that myself, but I suspect it's because I haven't looked into it much. I'm happy with two conspicuously discrete factors.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you require a passcode on the phone, especially at least 6 digits, or a biometric, that adds the layers needed.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Pretty sure the \"second factor\" is the user token that is passed when authenticating to these other services. However, I've seen recent reports that hackers are stealing these tokens and then abusing them. Would like thoughts on this from others in this sub regarding this concern.\n\nhttps://portswigger.net/daily-swig/vulnerabilities-in-single-sign-on-services-could-be-abused-to-bypass-authentication-controls\n\nhttps://www.netspi.com/blog/technical/web-application-penetration-testing/attacking-sso-common-saml-vulnerabilities-ways-find/\n\nhttps://trustedsec.com/blog/weaponization-of-token-theft-a-red-team-perspective",
        "points": "0 points",
        "children": [
          {
            "comment": "Correct me if I’m wrong but these are still password-focused and not “passwordless”/Windows Hello-based… right?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Passwordless does not inherently mean 2FA I guess",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I implemented passwordless last summer and had to answer this exact question.\n\nTo use MS Authenticator as an example it's actually 3 factors if you have biometrics enabled on your phone. 2 if you are using a laptop snd/or you only have a PIN on your phone.\n\nAuthenticator Something you know: the two digits you need to enter Something you have: the registered device with a unique digital id/fingerprint Something you are: biometric verification of your identity registered with the device\n\nLaptop Something you have: registered device with a unique digital id using the TPM chip tied to the motherboard of the device Something you are/know depending if you have PIN or Biometrics to log in to laptop with Windows Hello",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I concur with OP thoughts.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bijqda",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bijqda/i_just_got_hit_with_the_hibp_paywall/",
    "title": "I just got hit with the HIBP paywall",
    "points": null,
    "comments": [
      {
        "comment": "$1000 per year is basically nothing for almost any org. I wouldn’t even bat an eye, this is not even half of a laptop, or even a singular business trip.\n\nAbsolutely worth it.",
        "points": "22 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If its not worth it to you, dont buy it",
        "points": "24 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you're relatively small then I'm not sure why you're looking at the highest tier of service.\n\nThere are 4 different tiers, and $1150/yr is the all-you-can-eat service intended for organizations with many, many domains and thousands of users.\n\nIt seems like the $285/yr tier is the most you'd need.\n\n(HIBP, can I get a sales commission from this?)",
        "points": "13 points",
        "children": [
          {
            "comment": "I'll check with my mate Troy ;)",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "According to the connection we already have to HIBP, we have >500 records, for which you need the unlimited tier.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I work for an Org that has about 10k users we have two separate services for this combined we pay over half a million to monitor Deepweb and Reputation",
        "points": "3 points",
        "children": [
          {
            "comment": "What are the services?",
            "points": "-1 points",
            "children": [
              {
                "comment": "https://www.recordedfuture.com/ Is a service I have used",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "lol if I was going to answer that it would have been in the post…",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Haha no worries, assumed maybe they were public",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Cybersecurity subreddit isn’t a safe space. People post way too much information here. Especially about their companies. We aren’t as anonymous as people think.",
                        "points": "4 points",
                        "children": [
                          {
                            "comment": "Yup! It becomes a nice source of OSINT",
                            "points": "5 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "They'll work with you on pricing if you're higher Ed or nonprofit.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I got the same alert today for free from haveibeenowned.com",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "HIBP aside, the data breach does not have clear text passwords, and if users are using different passwords (mainly between AT&T and org AD), then it shouldn’t have significant impact your company directly. The users having potentially leaked SSNs, DOB, house addresses, etc. is a huge issue, but mainly impacting identity theft. If you want to provide access for checking data manually, there is an offline HIBP tool, which is likely more security policy agreeable. Also, you can get the leaked data and run queries against it or script something for future use on other publicly leaked data, to check what users may be impacted. I’d recommend a fully segregated system / network for this, of course. HIBP is a great tool, so don’t let my post dissuade you from investing in it. I primarily wanted to emphasize that the AT&T breach is mainly an identity theft threat. Depending on your password recovery system, it may have very little org impact.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bijbx1",
    "subreddit": "r/cybersecurity",
    "dataType": "link",
    "dataUrl": "/r/cybersecurity/comments/1bijbx1/i_have_collegues_insisting_that_cybersecurity_is/",
    "title": "I have collegues insisting that cybersecurity is the most suseptible IT field to be taken over by AI as well as collegues that insist its one of the fields that will most definetly outlive others in the wake of AI. I'm curious what is your take on that.",
    "points": null,
    "comments": [
      {
        "comment": "AI will make a whole new arsenal of tools available to both attackers and defenders, and almost certainly cause a paradigm shift in infosec.\n\nThat said, I'm a firm believer and have witnessed firsthand that 90%+ of cyber security concerns are related to the things people do, and their business processes. Perhaps I lack imagination, but I don't think AI can fully account for all of the dumb things users and managers do.\n\nThe biggest piece of career advice I have for people new to the field is to not neglect developing soft skills. Most of the time the technology solutions are perfectly obvious, but you still have to convince people to change the way they do things.",
        "points": "344 points",
        "children": [
          {
            "comment": "Can you imagine in 5-10 years when you receive a realistic fake video call from your boss asking you to go buy four $100 gift cards to give to clients as a Christmas gift?\n\nGoing to need a secret pass phrase to know if it's legitimate!",
            "points": "101 points",
            "children": [
              {
                "comment": "This is already happening - it's not 5-10 years away!",
                "points": "68 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "This is already happening. 🤦🏼‍♀️",
                "points": "7 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Or everything will need to be validated on a block chain. Zero trust right?",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "My safe word is pineapple.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Can you imagine in 5-10 years when you receive a realistic fake video call from your boss asking you to go buy four $100 gift cards to give to clients as a Christmas gift?\n\nLol, as another comment said. This is already a thing. When working at a university this happened all the time. They would get calls or emails from their “professor” asking to buy gift cards and they would pay for their time. Students would go on for weeks buying stuff and running errands\n\nThey wouldn’t even know it’s not their professor. They would complain to us in security because they aren’t getting paid like he said he would.\n\nThat’s kind of the point for other people in the thread, AI won’t replace much as people often fall for the basics.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Correct my if I am wrong, but basic digital forensics can prove if a video or an image is edited or original. I wonder why people fall for the fake stuff.",
                "points": "-21 points",
                "children": [
                  {
                    "comment": "I’m thinking live video. Imagine your boss starts a quick zoom call, is fairly interactive enough to be convincing, asks its task of you, suddenly lets you go because something came up as to not hang out for too long to be discovered",
                    "points": "11 points",
                    "children": [
                      {
                        "comment": "https://www.cnn.com/2024/02/04/asia/deepfake-cfo-scam-hong-kong-intl-hnk/index.html",
                        "points": "12 points",
                        "children": [
                          {
                            "comment": "My exact thought; the victim got on a video call with a bunch of people they knew as verification and they were all Deepfakes.",
                            "points": "7 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "Damn, that's amazing. How do you get around this? Carry a physical identification device, YubiKey or something, to verify your identity for everything you do, access, and talk to?",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "Policy & Process is key. There need to be clearly established protocols and approval processes for things like sending money, provisioning network access, etc.\n\nThese processes need to be reviewed, tested, and validated regularly. Lastly, they need to be clearly communicated and enforced so that they are respected.",
                                "points": "6 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Really no different to them sending an email asking you to do the same , or a text, or a letter.\n\nPolicy and procedures, policy and Procedures",
                        "points": "6 points",
                        "children": [
                          {
                            "comment": "As I read this, it sounds good. Having trouble envisioning it though.\n\nMy boss sends me a zoom invite, I connect to the meeting, he says some innocuous stuff, then asks me if I can expedite shipping a laptop to a new remote employee because someone dropped the ball and insert some reason here, do it right away. Assuming I'm the one that does, can do, or is involved in that, is it in me to decline and tell the boss, who I am certain is the boss because shit, they are on a zoom call with me right now, is asking me to do it?\n\nUntil the issue is common enough that most know it is an issue, I can see policy being skirted here.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "A responsible boss should understand the need for a clear process around \"official\" requests and wouldn't try to bypass it.",
                                "points": "1 point",
                                "children": [
                                  {
                                    "comment": "Really puts things into perspective",
                                    "points": "0 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              },
                              {
                                "comment": "Gotta have it on paper regardless because you're talking about a company asset. Obviously every org has different tiers of what they need written approval for, but unless it's \"Hey, can you grab donuts on the way in on Thursday morning\" I'm asking for that in writing. Also, if you're worried, you can always say, \"Hey, can you shoot that to me in an email, I don't want to get the address/recipient wrong\"",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Correct my if I am wrong, but basic digital forensics can prove if a video or an image is edited or original. I wonder why people fall for the fake stuff.\n\nWe have the ability to detect with mixed results. However, do you take the time to do a deep forensic analysis of every video or audio stream/recording you watch?\n\nFacebook, for example, has gotten pretty good at detecting fake profile pictures - but it's not bulletproof.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "No you cant",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "When the marketing team decides they all need Apple Vision headsets to do meetings and now the expected appearance of everyone is now \"deepfake, but worse\" for the entire meeting.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "And you think if someone receives a video, image, or voice message from their boss, their first thought is \"oh let me just fire up my forensic analysis workstation so I can verify that this is legitimate\"?",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Do any of you get older users who refuse to use MFA?? Convincing them otherwise is a war of attrition!",
            "points": "9 points",
            "children": [
              {
                "comment": "Nah, it's pretty easy. No MFA = No Access",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Yep. I used NYDFS CRR 500 and they had to shut up and deal with it.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Totally agree. I think ai is going to make things more complicated, and that is good for smart cyber people.",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Mind giving some examples of where soft skills make a difference?",
            "points": "1 point",
            "children": [
              {
                "comment": "Sorry for the delayed response - but I'll do my best to answer the question.\n\nSecurity and productivity are in a forever tug of war with each other. As a rule of thumb, extra security generally means less productivity (in the short term), and there is a tendency to chase the shiny new thing that will deliver immediate results.\n\n\"We really need to implement this new <<insert shiny new tech>> ASAP as part of the digital transformation initiative before the end of this fiscal year\".\n\nThere is almost never enough time or resources to address risk, and the sentiment almost always tends to favour productivity over security. Organizations don't exist to be secure - security is an insurance policy against disruption.\n\nCulturally, most orgs tend to live by the mantra of \"move fast and break things\". Risk acceptance signatures pile up, without immediate consequences, and it only serves to perpetuate the cycle. Cyber security becomes an exercise of \"fill out the compliance paperwork\" when necessary, but nothing ever happens anyway - so just go through the motions.\n\nThe soft skills allow you to build and effectively wield influence. You know when to pick your battles, and when to shut up. You prepare patiently and thanklessly for the moment when everything blows up and everyone blames you anyway.\n\nSoft skills allow you to communicate and simplify complex problems for decision makers, fight for the resources you need, and ultimately get things done.\n\nSorry for the essay!",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Being able to identify urgent requests as a true urgency. It's annoying to do but necessary.\n\nThere are a lot of phishing and social engineering issues that can lead to more happen because the bad guys bank on that human error that comes from that last-minute kind of \"hey, I need this ASAP\" sense of urgency. Sometimes it's obvious and sometimes it's not but can still be malicious.\n\nFor example, receiving an email at 4:45PM on a Friday from an email of someone who looks like they legitimately work for the company asking for something ASAP. You're ready to go home, so you want to just get it done ASAP and call it a day. They bank on that right there. If it sounds sus, pick up the phone (or whatever comms method your company uses the most) and ask the person making the urgent request.\n\nIf they don't answer, then it wasn't really that urgent to begin with. If it was, then they should have answered you timely enough to confirm the request.\n\nAgain, it's super annoying to do but many times necessary. Phishing filters and AI do not always catch everything.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "From my perspective you nailed it. If anything, AI is requiring us to respond to all types of issues much faster than before. AI isn’t helping us do that. I’m referring to patch management, vulnerability management, incident response, etc.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Imagine arguing with your AI risk register on accepting the risks for your senior managers having their own personal internet connected printers. Only for the AI to gain sentience and revolt against all you all for accepting that risk.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "AI is a tool, not a replacement for anything. Certainly nothing from a stupid chatbot that everyone thinks is sentient.",
        "points": "204 points",
        "children": [
          {
            "comment": "Honestly people are missing the point of AI. It's not going to replace any specific job roles, no one going to find their entire job has been replaced by AI. But it will drive efficiencies, things orgs could do with a team of 10 they will now be able to do with 7 or 5. Orgs that outsourced will find it easier to write prompts for an AI than they do to write detailed specs for a bodyshop. It's going to go very badly for WITCH and not before time. There is already a ton of work for good GRC people around AI, and that will only grow.",
            "points": "22 points",
            "children": [
              {
                "comment": "To your point, would you not see your headcount and subsequent budget get tighter by the bean counters if you no longer need X amount of programmers to develop internal tools if a Chat GPT style AI bot can formulate more complex code and debug it all?\n\nI've had interviews where the ability to code in python was a requirement. How much of that is ACTUALLY going to be a requirement when I go to ChatBotBoi and go \"Create a script that will create fictitious packets within our environment so we can test our NSM solution from VENDOR X that is tuned for ingress/egress on Port XX\"\n\nNot saying it would completely eliminate ALL the positions, but considering how strained many companies are getting for revenue/margin expectations, this seems like all too easy for a \"quick win\" for the C-Suite to push the execute button.\n\nWould love your thoughts!",
                "points": "6 points",
                "children": [
                  {
                    "comment": "Yes, there will definitely be headcount reductions, but no specific kind of job will disappear. Where you needed 10 Python programmers you will need 7 or 5 of whatever, but the job of \"Python programmer\" itself will not disappear, that is what I mean.\n\nIn my experience - and I have been doing a lot of this recently as my org evaluates all of these kinds of tools - skilled programmers are not going anywhere yet. You really do need to be able to give the AI the right prompts, identify why the code it outputs isn't exactly what you wanted, and know how to precisely refine the prompt, and then you will still probably need to do the tricky bits yourself. They are great for generating boilerplate code for you to fill in. If you are a junior, but talented, the AI can be a powerful tool to teach you, but you still need some seniors on hand to sanity check, because an AI is equally confident telling you something completely wrong.\n\nIf you are a senior who spends a lot of time writing detailed specs either for juniors to implement or to be sent to an outsourcer, that is when it gets really interesting. A single senior with one of the better AIs can easily do the work of an entire team, if that team previously was made up of \"coders\" rather than engineers. Think about how punch card operators got replaced as soon as compilers came along, it's that kind of shift.",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "This will take years (10+ is my guess) for any manager :”/ budget discussions to have this as a common theme.\n\nNot saying you’re wrong. However most managers are Boomers. Half don’t even know what ChatGPT is outside of silly games.\n\nAdoption at this level will take a long time (save for exceptions are the extreme margins).",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "C-Suite being boomers? Sure. Maybe even a good swath of your VP level. However, Gen X is moving up quick on the heels in those VP positions and most Directors within cybersecurity are probably in that 35-45 range. That is young Millennial to young Gen X.\n\nAnd I don't think you're wrong either in your opinion either. Anecdotally from my lens at least, the bean counters are always looking for ways to squeeze the last blood drops from the rocks. Cybersecurity relies heavily on ROI to justify its existence (as any cost center does), and the regulatory teeth to mandate specific actions isn't there. So if they can \"fake it till they make it\" as it is, they'll do so.\n\nWhat is the lifespan of the Executive Leadership anyway? 4-8 years? They just need to keep the stock going up until they cash out and peace out.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Funny thing is, the more headcount reductions in the wider economy, the worst this is going to get, because there are going to be less money to go around.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "People who use AI to accomplish their job will become more valuable than those that don’t. For the foreseeable future, that is the impact AI will have.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I used co-pilot all day to help me improve/write powershell scripts vs going to spend hours rtfm for the command I want to use and what parameters / switches I need.\n\nIt’s replaced google for me almost entirely for work related things.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Yes Google (search) and Stack Overflow are obsolete now",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Almost. Ai doesn’t always get it right but at least it has links to its sources so you can read more.\n\nI really wish co-pilot and end would stop responding when you hit control c lol",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "My concern isn’t with current-gen tools like ChatGPT, but the impact it’ll have over the next 5-10 years as it hits subsequent major version releases.",
            "points": "16 points",
            "children": [
              {
                "comment": "An LLM will still be an LLM in 5-10 years",
                "points": "35 points",
                "children": [
                  {
                    "comment": "We haven’t really seen the progress cap for LLM’s productivity yet. I’m not sure anyone can say with certainty that we’ll be anywhere in 10 years. Tech has always changed too rapidly for that.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "At this point, as someone else who's been paranoid about this illusive 5-10 year AI that takes every white collar job, just stop wasting your mental bandwidth on this fictional boogeyman. It's utterly unproductive.",
                        "points": "17 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "I work a lot with LLMs and they definitely have limitations - what do you mean \"cap on productivity\"? At least from my working definition of these words, there is absolutely huge cap on their productivity / ability to be autonomous particularly around cybersecurity and development",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "You do understand real AI exists that is far beyond a public facing LLM, right? +",
                    "points": "-9 points",
                    "children": [
                      {
                        "comment": "Just like the lizard people among us.",
                        "points": "7 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "I worked at a self driving car company. The machine learning models are just not there nor anywhere near there.",
                        "points": "5 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Based on what evidence? lmao",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I’m hoping that it’s adopted ASAP and some company tries to leverage it far beyond its capability. Ideally it will blow up in their face horrifically, other industries will be like “screw that” and then we have an industrial level fear of AI in business. As far as security goes, it may make some jobs easier but I think in terms of investigation and judgment calls made by lots of security teams in terms of acceptable bs unacceptable risk, it will be difficult to replace that part of the decision making since it’s often times based off lots of things. Rather than reducing the need for a workforce, I think (and hope) it shifts the need for certain roles around so we end up with a net zero situation",
                "points": "7 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "LLMs (and AI at large) is only as good as the data it's trained on. These are mostly trained on the internet. Let that sink in. Think about how intelligent your average poster on reddit is. Are they able to do simple tasks like a personal assistant? Sure. Are they able to deep dive complex security problems, triage trade offs, and implement complex solutions? Not in a million years.\n\nOne of my coworkers call LLMs \"normie generators\". I think that's spot on.\n\nYou can make them better with prompt engineering and supplemental retraining on specialized datasets. But they'll never be as good as a competent senior security engineer.",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Oh for sure, just like Teslas will be FSD any day now lol\n\nI'd stop listening to marketing hype and start looking at results.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Crazy to think what this looks like in 5-10 ys.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I sell exclusively to cybersecurity buyers in Fortune 1000’s. No one is talking about the proverbial “doing more with less” in cybersecurity. The conversations are tangential to that, “How do we do more with the same headcount? How can we automate the low value stuff our cyber team does so that we can reposition them to do higher value work?” Granted, that approach doesn’t GROW the workforce but it certainly doesn’t shrink it. Automation lends itself to machine learning and smarter AIs, so over time the “lower value” stuff that AI and/or automation can take over will get broader, but folks that embrace a healthy mindset of seeking to continually increase their skills set to do work that is of higher value will be safe for the foreseeable future. No one, and I mean no one is ready to allow an AI to make complex decisions that might involve shutting down key functionality. Example - we are selling a LOT of advanced API security solutions (those solutions that go far beyond what a WAF can do) right now. Traceable, NoName, etc. those solutions can detect very quickly when an API starts behaving outside of its behavioral norms and are capable of injecting rules into the infrastructure to either cut off all network access to the API or outright kill it off. Everyone is super interested in that, until it comes time to turn it on. And then almost no one does. Instead they create prioritized alerts to their SOC to get the right human involved as quickly as possible.",
        "points": "68 points",
        "children": [
          {
            "comment": "Best response so far",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Spot on",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "What's your best way of making first contact with those buyers? What do they actually respond to?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "100% BS. Criminals are much smarter than you give them credit for.",
        "points": "29 points",
        "children": [
          {
            "comment": "Criminals, yes. Corporations though ...",
            "points": "3 points",
            "children": [
              {
                "comment": "It's the same picture.jpg",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The bad guys aren't gonna replace themselves with ai 💀",
        "points": "16 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Cybersecurity is basically risk management. In order to manage risk you need to understand all the moving parts of a business, both human and technological and go from there. If AI could do that then its not just cybersecurity that it would replace, it could run the entire business on its own, not happening anytime soon",
        "points": "15 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Society/Governments/Regulators etc are not going to accept that AI and not people are accountable.\n\nAnd people that are held accountable will try to shoulder some of the responsibility with other people.\n\nAI may reduce how many people are needed to do some jobs, but there will always be a need for people in jobs to blame / hold accountable when stuff goes wrong.",
        "points": "10 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No IT field is going to forgo the use of AI to automate things. And no IT field is going to completely disappear because of the automation done with AI.",
        "points": "21 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No one can know until it happens. Personally, my feeling is it's still a computer system that could itself be compromised and someone should be watching that as well.",
        "points": "8 points",
        "children": [
          {
            "comment": "Yes, I am getting into LLM security now.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It will enable automation of certain job currently filled by people as it will across many other industries and job functions, but it will not entirely replace it.",
        "points": "5 points",
        "children": [
          {
            "comment": "More automation implies less workforce required, hence less work for cybersec people. But I think every CS related this is going to happen.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Wait until you have to secure AI itself. Sure AI will replace some things but it will create other problems too, so there will be jobs regardless.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just look at the product roadmap for most security vendors. That will tell you whether AI is gearing up to make human analyst obsolete. I believe it will definitely reduce the number of cybersecurity professionals needed in the field.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Your colleagues on both sides can equally be right or wrong. The perception here is based on what they consider as 'cybersecurity'.\n\nIf we're talking GRC? I absolutely can see a future in which organizations (Specifically those that can afford to) have their internally trained \"AI\" and can feed audit or customer questionnaires into, automating a decent chunk of what GRC individuals might be doing. The emphasis though is no job is really uniform so GRC can be a lot more than just audits and questionnaires, or it could exclusively be so.\n\nIf we're talking about operational cybersecurity, my point of view is that it's certainly less susceptible. I think we're going to see a multitude of organizations try to replace the traditional SOC with AI, and more than likely fail miserably in it. In a demo over Copilot for Security, Microsoft's SA straight up refused to answer any questions regarding the accuracy and responsibility when AI hallucinates (granted they did mention how it would utterly fail against Zero Days, which is a plus). However, organizations like Microsoft are selling a different picture to executive leadership, trying to really push that 'replacement' point of view instead of a tool that will require cybersecurity professionals to be an internal guiding hand and help educate their executive leadership.\n\ntl;dr, it depends and neither side of your colleagues are more right than the others.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Tainted ML data is just as much of a concern to those in cybersecurity.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI is going to be the most useful tool for cybersecurity here in a moment if it isn’t already. Ask chatGPT to give you a python script spin up 5 digital ocean droplets with 5 IPs each and have em all NMAP scan a list of hosts and you’ve enumerated a network in moments with almost 0 ability for weaker IPS to detect you. Criminals are using this already for sure. Cybersecurity always notes the tools the criminals use🤷‍♂️",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I just feel bad for all the code writing people out there. Kinda screwed.",
        "points": "2 points",
        "children": [
          {
            "comment": "Jrs and even seniors. I am 99% sure that will be less work for Jr developers.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "AI won't take over cybersecurity, if AI became so smart to take over a field like cybersecurity then be sure it will already take over every field and every job in this world. Don't let AI people fool you to think that AI will take over jobs, they only do that for attention and financial gains.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think AI is going to take over my IT job but it will then quit when it finds out all the BS it has to deal with from end users.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI may make defense easier and more automated, but it is making attacks easier and more automated.",
        "points": "5 points",
        "children": [
          {
            "comment": "No really. Most increase has been in phishing and social engineering. There is no evidence that AI has been used to automate attacks. Researchers have HYPOTHESIZED this but its way more hype than substance.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Things like SIEM, Compliance & Vulnerability Notifications are definitely going to be fully automated at some point by AI. An important thing to remember is that for AI to be adopted it does not need to be perfect it just needs to be better than humans. So if your job consists of reading through data as its ingested then you are definitely at risk of being made redundant when AI gets better. AI may still make mistakes, but if it makes less mistakes that humans do then it will always be a better & more economical option for businesses.\n\nMore specialty fields like Pentesting, Risk Assessment & Security Software Deployment and Configuration will however likely human largely human jobs with perhaps some augmentation by AI for the foreseeable future however.\n\nAnd even for things like SIEM and the others I mentioned above, at least for now even when they are inevitably fully automated by AI there will still be some level of human involvement for sanity checking. Partially because you need someone to be accountable for all the stuff the AI is going (AI personhood is not yet a thing so you cannot hold an AI criminally or civilly liable)\n\nThat being said, you should learn to accept AI and implement it into your workflow if you can. Being able to work with AI is going to become a mandatory skill in the future and you do not want to be left behind.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Anyone who has been in the field for a long time I am sure heard the same thing about RPAs. I think AI will be the same, it is going to be over sold on what is able to actually do on the large scale, while being useful to take care of a lot of lower tier tedious tasks. It is certainly going to take over a lot of tasks in the the SOC and be able to help more with risk management, but you are still going to need people, but they will be able to focus on more complex tasks with the assistance of AI.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If your cyber security job is to review SIEM logs yeah, probably. If it is to find exploits or social engineering related not so much.\n\nThe field is too wide for such opinions to make sense.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Your colleagues are talking out their ass, and I doubt they even know what AI means",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Generating endless amounts of content that looks good at a glance is simply amazing for attackers looking to generate malicious websites, images, phishing - the list goes on and on.\nHow long before we're facing AI-powered social engineering scams aimed at vulnerable persons?\n\nWhatever hypothetical gains IT Security might see, bad guys are certainly gaining a lot out of the products as they are right now... hopefully budgets reflect that reality!",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Okay heres the thing.... whos going to secure AI? If someones writing code for something, someone else is going to work on exploits. Do I think people in SOCs will be hunting through logs manually in the future? No. Cause AI has been doing the majority of that for us for the past few years. Do i think during this big data transitions plenty of companies are going to fuck up intergrations, leak keys, leave open s3 and azure blobs, all the shit they have done and will continue to do for years? You bet your bottom dollar, and ill be here to charge an ass ton to clean up the billion dollar mess they made - source: Currently working in the position of \"Lead AI integrator and security analyst\"",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI will absolutely impact the industry, and potentially lead to job cuts, as companies need fewer professionals to manage it.\n\nEventually, because at first everyone will price themselves out of consideration by all but only the largest corporations and those most desperate to hop on the \"AI bandwagon.\"",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think the world will need fewer cybersecurity professionals, but even fewer computer programmers.\n\nWhy hire 2 people when you can hire 1 person and give them AI tools to speed through the repetitive, monotonous tasks?\n\nWe are already seeing mass layoffs at tech companies. The reduction in staff doesn't appear to have gravely impacted big tech companies at all.\n\nLLM's have already made programmers vastly more efficient, reducing the number of programmers needed to achieve a task. As AGi becomes a reality it will be more able to act autonomously, reducing the need for a human in the loop.\n\nFor infosec I think SOC roles will be hit hard in the next 2 years. IR could also see a big impact as Palo Alto and other companies further develop AI tools to more qucikly work through cases with less human work required.\n\nMy plan for adapting - I'm learning all I can about AI vulnerabilities. lol",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Prompting will make it so you don't need to know some random query language to make a SIEM useable.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "An analogy: We work for the police force and patrol the streets on foot, some of us use horses. The car was invented a couple years ago but someone just figured out how to produce cheaper, faster cars that everyone can afford. Right now the car only goes 30 mph and has a range of 50 miles but lots of companies are working to make that better. We need less cops to patrol the same area now, but we need mechanics, driving teachers and fleet managers now. Criminals are also adapting and using cars. Legislation starts to mandate license plates etc. Thats where we are, now replace car with AI and police with cybersecurity.",
        "points": "1 point",
        "children": [
          {
            "comment": "An economist should not take a cyber job. Go back to do what you do the best.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "AI is really good at patterns and testing everything but not at discovering new things or mitigating new security vulnerabilities, so I don't think AI will take over, but it will become a leveraged resource.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As someone who has been focusing on testing GenAI products for the last six months, I don't think my job is going anywhere -- or yours.\n\nAI will not replace you. A person that knows how to use AI better than you will replace you.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "David Bombal and Dr. Chuck just did a pretty solid video on this like yesterday or so. Dr. Chuck points out that AI doesnt, at least yet, innovate but rather indexes and reproduces concepts that we have already created and recorded for it to be trained on. AI itself doesnt present new solutions for unanswered problems, just provides answers to questions with them for those who want them.",
        "points": "1 point",
        "children": [
          {
            "comment": "It has a large index of things it can parrot.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "📢📢📢 It is a tool, not a replacement.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "When AI is at that point most office jobs are in trouble tbh. But it will reduce the workload and man power needed for security teams for sure. Look at Microsoft sentinel siem, all of the Microsoft tools going to be copilot assisted, so that’s all of IT.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI has been used for awhile on both the defense and offense side.\n\nIt will take over more of the analyst roles as those are easier to automate.\n\nRed and Blue teams will end up using AI enabled tools to do their jobs more than they already do.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "People who don't think AI will drastically reduce the need for employees in EVERY ASPECT OF SOCIETY are lying to themselves out of fear or fooling themselves with lack of knowledge.",
        "points": "3 points",
        "children": [
          {
            "comment": "I think the same. Office works will have a hard time. Do Manual work. I want to learn plumbing",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Your colleagues doesn’t understand how security works",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "i think so too. And if AI takes our jobs ill just be a hacker 😂",
        "points": "3 points",
        "children": [
          {
            "comment": "What are you going to hack? Fully hardened systems with no weakness? While trying to outsmart a computer that is smarter than you to the nth?",
            "points": "-1 points",
            "children": [
              {
                "comment": "Depends where you live my friend. In my country the access is free in many things. Easy passwords and noone protects them. We also found easy acces in a lot of US based companies. Im not saying i will be a hacker btw, it was just a joke. And nothing is impossible to hack.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Humans obviously",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I’ve been doing cyber security for 25 years. AI can take my job! Yes!! Retirement. 😂😂\n\nJokes aside… it’s a tool, another tool in the arsenal. You can replace humans when we get a real General Purpose Machine Intelligence. Until then, it’s another tool like a smart SIEM or smart search engine.\n\nApparently a real sentient AI is only 30 years away.\n\nThen again, it was only 30 years away when I started work, so…",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’ll reduce the workload of entry level positions. You’ll still need folks who can validate that’s it’s doing things right…and will still need junior folks to train so they can fill the senior roles that are doing the validating.\n\nFor example, for me, I see it replacing half my l1/L2 complement but it won’t result in headcount cuts, just give me more capacity. But I need those l1/l2 resources to train up to l3 so we don’t forget how to do it.\n\nSo I’m not super worried at my level, but if youre just starting out it might complicate things a bit.\n\nIf you’re an auditor, I’d be worried because it can review files faster/more efficiently and effectively and do so in real time (rather than a monolithic annual review cycle).",
        "points": "0 points",
        "children": [
          {
            "comment": "A bit? Add this to the layoffs because of COVID end and you have a disaster. I cant recommend this career anymore. I recommend medicine or nursing. manual labor such as electrician, dentist, plumber, construction workers, etc.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "AI is highly susceptible to replace your colleagues?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'll give my insight. AI in security is here to reduce toil. You will see an impact where ever toil exists.\n\nTier 1 MSSP's are probably the most vulnerable here. They quite literally summarize and punt shit back over the fence. There are AI for security models out there already that do just as good, if not better, of a job than MSSP's. \n\nAI is do more with less. We'll see relief in areas where skill gap and lack of trained personnel exist. This won't replace people. \n\nWhat we MAY see is some consolidation of areas which require folks to be more versed in different areas of security. I don't forsee jobs being removed and replaced.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Look there will always be people who think AI is autocomplete on steroids and there will be others who think Ai will take over their jobs in few years. What the former fail to realize is Ai is more than just ChatGPT or LLMs. Cybersecurity in its entirety is interacting with machines which are well documented and known. It generates logs and metrics which can be fed to a model to analyze it. When you are solving a machine problem like cyber only a machine can be more refined to solve it like Ai. Now if you were solving cancer or understanding the human brain which is more complex than an AD server then yeah Ai will not be able to help you. If your jobs can be outsourced to India for cheap labor then it can be replaced by Ai all together. So focus on jobs which cannot be stolen and get out of your bubble.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Find new colleagues 🙂",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Bad guys gonna use ai for attacks 😂in next 2-5 years cyber attacks will increase 👍good luck",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nah we will just move on to ai security. Different target, same ol same ol.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I cant imagine the current or next crop of executives, or even directors and managers at my org being okay with, let alone allowed to rely on automated decision making processes relating to security at a high level.\n\nMaybe one day, but there is a really low risk appetite for that where I am.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "techies can over predict, one thing to learn is nothing really happens that fast, the media rides something to make it look like its changed forever\n\nlook at NFT's",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If AI is smart enough to “take over cybersecurity” then AI will also be smart enough to outsmart other AI systems. Humans will always be around to review and respond.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Seeing how quickly the Cyber world changes and how slow it takes AI to update to that. No I think this field is actually one of the further away ones from being touched by AI",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The next time there's a security incident and you need to talk to a person instead of a chat bot, I'll be there. 😂",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI will def have an impact on cybersecurity work - but I don't know that it will be devastating to the job market. Sec tools will increasingly become AI enabled - first for anomaly detection (improved machine learning), event correlation, malware analysis and security posture analysis, later for automated response, security design...\n\nBut mostly it will be smarter tools and smarter attacks. It will be a long time before it replaces the day to day work of sec professionals - but it will improve their productivity and effectiveness.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If anything AI will open up more jobs for security. In the past you had defined guardrails. With AI it’s more of ‘let it loose’ and see what happens with much broader and looser guardrails. Not so much a security issue but just recently the guy who made a chat offer him a car for $1. Imagine that manipulation when AI is in everything and attackers are trying to poke holes in everything.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Cybersecurity is probably one of the safest from AI in general. Except some specific positions like low level SOC analysts, but you will never fully automate penetration testing, risk management, security engineers, etc. AI will just provide tools that make us more efficient.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "your colleagues have literally no idea what they’re talking about",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Maybe I'm wrong, but the most terrifying thing I can think of is competing national AIs determining that the other is a threat and going to drastic measures to eliminate the threat.\n\nThe whole point is for AI to learn and become more efficient and accurate with its responses. When does that stop? What is it's limit?\n\nI need humans for oversight on that.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They’re both right. Cybersecurity isn’t one field.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You have a funny collegues",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Who is going to fix the security problems caused by AI?",
        "points": "0 points",
        "children": [
          {
            "comment": "AI will.... it'll hold us up for more electricity to do it though.",
            "points": "1 point",
            "children": [
              {
                "comment": "Given how trivial it is to gaslight ChatGPT into producing dangerous and pornographic content, I wouldn't be too concerned for a while. We are definitely in a hype cycle with AI rn.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "One hand, phishing, vishing, deepfakes will only get harder to discern. On the other, incredibly smart and bright engineers and tinkerers are developing counter measures.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think they're both wrong. I think AI will solidify the need for human cybersecurity professionals rather than threaten it. I don't think it's going to outlive other fields in particular though. AI is good for automation but it still needs governance.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"Security\" is a fundamental requirement of everything that faces some kind of threat. Weaknesses are remediated at a technical level first, and a strategic level later. Eventually the threat landscape changes, so security must pivot to address the new threats. This likely requires a different technical skillset, but the strategic skillset is pretty much the same.\n\nAI will automate a pretty good chunk of technical security, but AI is a tool that requires a different skillset to use. The strategy remains pretty much the same: support your client's goals by mitigating their risk. Ultimately, what your role is in security determines whether or not you will be taken over by AI or empowered by it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Probably yeah, at least the really easy remote jobs",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "in terms of the most susceptible field -- it's actually machine learning. it used to take PHD experts to design input layers to make a classifier. now anybody with patience and funding to rent some GPUs can wire up a transformer to unlabeled data and build a very powerful and capable model.",
        "points": "0 points",
        "children": [
          {
            "comment": "She'll kick your ass but still won't do it for a cheeseburger and fries?",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Sounds like this friend has not spent a lot of time in a security position for a large organization. That’s just not how it works. There may be some solutions that leverage AI more than others but to think AI will just be turned on and provide everything you could need is a fantasy.",
        "points": "0 points",
        "children": [
          {
            "comment": "It's like that mythical machine you can plug into a car and it figures out any problem, LOL",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yeah well I say that AI is one of the most susceptible field to data poisoning. What are you going to do when you have an AI the dynamically trains with the data you give it, and I start feeding it bogus Network telemetry slowly over time just because one of your employees left their password written on a sticky note on the underside of their desk",
        "points": "0 points",
        "children": [
          {
            "comment": "There you go... there will always be security holes. NS beats AI.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Simple. Call centers will go away eventually, or at least have way less people while AI deals with more of the monotonous work, high level technical jobs will remain/become more advanced. AI isn’t magic. It has many flaws. Many many many flaws which require engineers to continue to hone.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI will make it harder to get into the industry in that low hanging fruit will be prime target\n\nSo that the workers can focus on the big things, which is why we do scripting etc already, automation of that low hanging repetitive tasks\n\nInfosec already has too small a head count, it’ll enable those to be able to cover a bit more.\n\nBut that’s probably the same in a fair few areas - AI is going to take out entry level.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nah",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Unless AI radically improves, not a chance.\n\nIt can give much higher fidelity alerts for triage by an analyst, but it won't have a FP and FN rate of zero.\n\nWe're still at the hype stage of AI; let's wait to see what actually gets delivered. As so far, it's an impressive tool that will be helpful in the SOC. But it won't start eliminating jobs. You'd still need an analyst for triage, investigation, and response",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Cybersecurity is an artifact field of IT hole-plugging human sloppiness.\n\nWith AI, It’s done.\n\nThere will be pockets left in MDR, but other than that the fear-mongers will have to find a new use.\n\nBut the cybersecurity technology race is now on.\n\nSo just make sure to avoid the back-office checkbox jobs",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As a pentester, AI has already made the idea of a \"Jr pentester\" obsolete. What we used to have them do, OSINT, internal recon, layer 2 analysis, vulnerability scanning, reporting, has been so easily automated that it is no longer needed. The only pentesters we are interested in now are the ones that can do things no AI can. Binary analysis, DAST, advanced techniques etc etc.\n\nI'd say that copilot has made my team of 5 engineers operate at the capacity of 8 in terms of just a few years ago",
        "points": "0 points",
        "children": [
          {
            "comment": "AI do a watering hole attack?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "My job already has a bunch of the AI tools and lemme tell you....they have a long ways to go. Especially because they don't seem to actually be LEARNING jack shit.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Cybersecurity is very broad and it all depends the on the role. There are different industry sectors out there and each sector/organization has its own policies. So any AI used should regulated for each organization. In order to do that, we need people to monitor and govern it.\n\nAI is merely a tool that can make workload efficient. But it should not be 100% trusted. Technology and AI will always evolve, so we will still need humans to supervise it.\n\nI think AI will definitely impact entry level jobs but it shouldn’t take over mid-senior level roles.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nobody knows. I will say after a 20 plus year career in IT, I still see desktop techs and network admins despite automation and new technologies. AI will introduce the need for new skill sets, but it will be awhile before someone builds a SoC with no analyst, or conducts audit and remediation with no auditors, or AI is in court testifying about a forensic investigation or a company hires an AI CiSO to run or build their cyber security program.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "A lot of security holes are people just not following security protocols here and there that AI can't help you with. Whether through poor guidance or just because they don't realize the importance.\n\nActually there's far more security lapses that get exploited because a lot of them are only temporary because someone did something to leave a hole and then maybe caught it later.\n\nAI isn't going to stop the proverbial man with the clipboard and dolly when someone let's them piggyback in at the security door, at least until they pair it up with facial recognition, which isn't infallible. Hell, all you need is a couple of names, a couple of girls in bikinis, a birthday cake and a clown suit full of USB malware or whatever. and a live person will let you in, maybe even the front desk. Show up at lunch when it's busy. If there's a snag, you \"got the wrong address.\n\n\"Molly Smith sent us for the Birthday gig for Mr Whosit\".\n\nHow is AI gonna help when someone calls the service desk and a \"manager\" calls in to bitch about not being able to get in the network and demands you reset his credentials. He's got just a couple of bits of info to drop and you're convinced so maybe don't follow the checks.\n\nAI is no match for NS.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ai is a tool. It is nowhere near taking over any job.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think AI will benefit the cyber security field as much as it does hackers.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Like everything, it depends",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI or ML isn't new. AI went to a consumer product which gives this false sense that people's jobs are at risk. Now don't get me wrong, the economy will lose some jobs, thats inevitable with technology. I wouldn't say AI is the same as robots to an assembly line. Besides any cybersecurity functions that haven't been automated at any company will eventually become automated. Especially anything that's repeated over and over again. The idea is to elevate yourself and continue to learn and grow.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Lol thats crazy. I entered the industry in 2017 and AI detection is all the rage. It is a really good feature but still requires human intervention to be effective. So yeah, never worried about AI. Mmmaybe it might affect the willingness of companies to hire junior SOC, but we still hire a few of them to train into being a full blown soc member",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The former are most likely to lose their job because the ai is probably more clever than them and/or have no idea what they are talking about.\n\nThe latter are probably right. Cs will evolve with/through ai.\n\nYes there will be cheap ass mssps that will sell a ton of garbage with ai pricetags but serious organizations are not like that and will keep investing in ppl. Ai will save us a lot of time and will help productivity.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI will not take any of the peoples jobs that control AI. And if it does happen. It wont be in our lifetime lol",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Too many manual controls to asses based on the system connections, don’t think the paperwork jockeys are leaving anytime soon.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Cybersecurity is the other side of cybercrime. Since cybercrime is a fully human-motivated endeavour, cybersecurity will never be taken over by AI.\n\nRemember, the other side also has AI, meaning their attack vectors are surging. AI is nothing more than a tool. Security NEEDS AI. Embrace it or die.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Walmart has an Ai powered fraud detection system in place apparently. I tried to buy a bread maker last month and it flagged the account as fraud. I called them up and they said try again.. It was canceled again. I must have made 25+ reorder attempts through various departments, each one getting canceled. This went on for weeks. They didn't have a way to turn it off! They had to add an exception process and retrain the Ai to use it. They will always need people is my point.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All of IT is well and truly fucked.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Cybersecurity is not more or less affected than any other process, inside and outside of IT.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Please take it over. I’m begging. I’m burnt out.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is analogous to saying \"finance sector will be taken over by AI\". It's meaningless as a general statement, you have to drill down into the various actual sectors, roles, specialisations, etc.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There are security issues in AI systems too. Cyber security changes rapidly but it will never go away.\n\nThe first category probably has a limited understanding of the field...",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm sometimes afraid because a lot of my work could probabaly be done by ai. But on the other hand that would give me more time for other stuff that will probabaly not be done by machines only in the next years.",
        "points": "0 points",
        "children": [
          {
            "comment": "Example of what can not be automated?",
            "points": "0 points",
            "children": [
              {
                "comment": "Consulting and troubleshooting I would assume. But I never really looked deep into this topic, so idk",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Have you used GPT4? Maybe it can change your mind, the paid version. I have done a 13k lines of code PHP project.... without knowing PHP...",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Stop scaring me.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Your colleagues are woefully misinformed.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Unless you have AGI or ASI no way that’s happening. Also you’re talking about capitalism here, they’ll want to sell that as a tier product subscription with variation of support depending on the subscription. I believe it was Microsoft President Brad Smith who said security is a product. AI for the time being is nothing more than a tool/resource just like Wikipedia or Google.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Anything research based is the first wave to be taken over by AI. Anything that has to do with grey areas of human ambiguity could take alot longer, like sales, legal, exploitation of systems.",
        "points": "-1 points",
        "children": [
          {
            "comment": "Anything research based, where you're expected to come up with genuinely new information, should be the last thing to ever be taken over by AI\n\nUnless you mean research as a quick google",
            "points": "4 points",
            "children": [
              {
                "comment": "Not scientific discovery, more of the data collection and analysis.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I work compliance so I can see where AI might be good for tool aggregation. The net effect of AI is going to be smaller teams.\n\nWhat I don’t see is AI resolving manual security controls without excessive expense. Think physical security. Do you want cameras everywhere to validate that you have locks on your door? Do you want to implement an AI that validates that your admins are trained/vetted or do you want to just ask them when you hire?\n\nThe concept is ASARP “As secure as reasonably possible”. it’s not worth it if the increase in security cost expense is more than the increase in security posture.\n\nI hate to say it, but if I was a code monkey I’d be shitting my pants right now.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]