[
  {
    "id": "t3_1bcr7tf",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.nytimes.com/2024/03/10/science/ai-learning-biology.html",
    "title": "A.I. Is Learning What It Means to Be Alive",
    "points": null,
    "comments": [
      {
        "comment": "Great , it seems to be ahead of us humans in that aspect then",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "After that, it stretches, burns, and breaks things to achieve more, GREAT!\n\nAmerInds, almost all, had ways to teach the young'uns how to just take what they need, leave more for everyone/everything else and later...\n\nThese AI dipshitz seem to, ALL of them, have never learned that lesson.\n\nNow, we will soon ALL of us be subject to that lack of self control- EVEN IF the US shuts down this dangerous tech, the cat's out of the bag, it's too late to stop it...\n\nThere's a scifi short story from a decade or two back... The protagonist is the UN cleanup guy that has to deal with all the \"Third World\" countries that have been experimenting with homemade singularities (black holes) for power production...\n\nThe rest of the world has already figured out that down this path lay destruction for all- once a black hole created on Earth goes out of control (and nope, so-called \"third world\" countries learned the hard way that making one and CONTROLLING one are two totally different things), it would then sink to the center of our planet and begin consuming it. Us. All.\n\nBut the nature of a singularity is that nobody outside the Event Horizon can know what's going on INSIDE that Event Horizon... So once someone loses control of one, ALL of our fates are now sealed, sucking down into that implacable maw, and nobody will know until somebody outside our planet notices that it's, that we're gone...\n\nThis UN operative had to explain to various members of small African governments, reps or leaders of their respective energy ministries, about how this happened, the limits of human science and control. And it all ended up the same- he had to clean out the inside of his vehicle and replace passenger-side windows, again and again, as his passengers each finally figured out the gravity (ohh, I'm so sorry for that!!) of what their country had done and then capped themselves soon after.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bcr5b5",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.wired.com/story/google-deepfake-porn-dmca-takedowns/",
    "title": "Google Is Getting Thousands of Deepfake Porn Complaints",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bcoixz",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://9to5google.com/2024/03/09/google-wallet-movie-tickets-boarding-passes-gmail/",
    "title": "Google Wallet can now show movie tickets and boarding passes from Gmail",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bcoi3c",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://9to5google.com/2024/03/11/samsung-galaxy-a55-a35-announcement/",
    "title": "Samsung Galaxy A55 and Galaxy A35 launch with four years of Android updates",
    "points": null,
    "comments": [
      {
        "comment": "Cool beans.\n\n– sent from my five year old iPhone",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bcofq2",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://9to5google.com/2024/03/11/google-pixel-8-mirror-external-display-beta/",
    "title": "Pixel 8 series adds display output support with Android QPR3 beta",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bcof0x",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://9to5mac.com/2024/03/11/apple-tv-plus-with-ads/",
    "title": "Apple ramps up work on ad-supported Apple TV+ plan",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bcoeel",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://9to5mac.com/2024/03/11/tim-cook-porsche-event-vision-pro/",
    "title": "Tim Cook makes surprise appearance during Porsche event to talk Vision Pro",
    "points": null,
    "comments": [
      {
        "comment": "Wow how cool, two companies who have made it well past their glory days working together to milk every last drop of relevancy out of their wildly fervent clientele.",
        "points": "3 points",
        "children": [
          {
            "comment": "If he is making appearances at events it sounds like the Vision Pro isn't doing so well. Seems like he is still trying to sell it as a worthwhile product.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bcne33",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.reuters.com/technology/bitcoin-hits-new-record-high-above-70400-2024-03-11/",
    "title": "Bitcoin hits record above $72,000 as demand frenzy intensifies",
    "points": null,
    "comments": [
      {
        "comment": "Imagine the stupid money you could have made off nvidia and bitcoin…",
        "points": "9 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Extraordinary popular delusions and the madness of crowds",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Bitcoin hit a record high above $72,000, as the biggest cryptocurrency's surge showed no signs of slowing down.\n\n Bitcoin was last up 4.4% at $72,649 after reaching as high as $72,739.\n\nThe world's most valuable cryptocurrency has been boosted by a flood of cash into new spot bitcoin exchange-traded funds and hopes that the Federal Reserve will soon cut interest rates.\n\n \"The recent surge in Bitcoin's value ... underscores the remarkable strength and resilience of the leading cryptocurrency,” Bitfinex analysts said in a research note.\n\n \n\nRead the full story for more.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Pump it Bogdan!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yawn.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bcm4xm",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.ghacks.net/2024/03/07/microsofts-sneaky-kb5001716-windows-10-update-pushes-windows-11/",
    "title": "Microsoft's sneaky KB5001716 Windows 10 update pushes Windows 11",
    "points": null,
    "comments": [
      {
        "comment": "I want to go Linux so bad but sadly some anti cheat’s for games still don’t work under Linux.",
        "points": "6 points",
        "children": [
          {
            "comment": "it really depends on the title nowadays. I have Steam Deck with dual-boot setup. Some games works better on Windows. But, some games works better on SteamOS",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This update fails to install on my old laptop which is way out of support for Windows 11, but sticks in Windows Update so it continues to attempt to install. I had to use the Windows 10 Show Or Hide Windows Tool to hide it.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Strange but ok",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If I already didn’t hate Apple so much for pulling all the same crap, I’d give up Windows. Why can’t M$FT just stop acting like complete assh0les?",
        "points": "-4 points",
        "children": [
          {
            "comment": "hey, break your chains pal.\n\nI was a windows user since eternity. 5-6 months ago, bought myself a macbook pro for university. Took a while to learn, and control-option- command and ctrl-win-alt muscle memory kicks you in the butt (but you can assign keyboard buttons in windows layout)...\n\nGaming is important for me, probably one of the two downsides of macos against windows, and I still got the windows desktop at home but I'm not playing anything in semester. But hey, new m chips are really powerful. And for one day usage you won't need a brick to charge. For the OS, you'll see the downsides and upsides by using more.\n\nApple is greedy shit, you are right. But arm64 and new macos 11 is one of the best things they made in 10 years.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bckwov",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://venturebeat.com/gaming-business/open-is-a-metaverse-experience-coming-from-ready-player-one-creators-readyverse/",
    "title": "A Ready Player One metaverse experience from Open coming soon!",
    "points": null,
    "comments": [
      {
        "comment": "What we are really missing at this point is the 360 degree treadmill that has you strapped in. I played some vr games where I had to push on the controller to move and it totally kills immersion.",
        "points": "1 point",
        "children": [
          {
            "comment": "What about the Disney holotile floors?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bcgyjo",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.bbc.com/news/business-68534703",
    "title": "Boeing whistleblower found dead in US",
    "points": null,
    "comments": [
      {
        "comment": "Excerpts:\n\nJohn Barnett had worked for Boeing for 32 years, until his retirement in 2017.\n\nIn the days before his death, he had been giving evidence in a whistleblower lawsuit against the company.\n\nLast week, he gave a formal deposition in which he was questioned by Boeing's lawyers, before being cross-examined by his own counsel.\n\nHe had been due to undergo further questioning on Saturday. When he did not appear, enquiries were made at his hotel.\n\nHe was subsequently found dead in his truck in the hotel car park.\n\nThe Charleston County coroner confirmed his death to the BBC on Monday.\n\nIt said the 62-year-old had died from a \"self-inflicted\" wound on 9 March and police were investigating.",
        "points": "133 points",
        "children": [
          {
            "comment": "I guess we'll have to wait for a movie somewhere in future to know what happened.",
            "points": "109 points",
            "children": [
              {
                "comment": "Seriously right? We only ever find out about how fucked the real story is like 10 years later in a movie. Thinking of that Tom cruise/CIA flick specifically.",
                "points": "43 points",
                "children": [
                  {
                    "comment": "The one where he was forced to accept a mission that is basically impossible to complete?",
                    "points": "24 points",
                    "children": [
                      {
                        "comment": "This gave me a good laugh",
                        "points": "5 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "A Few Good Men?",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Saving Private Ryan? That was Tom Hanks not Tom Cruise",
                    "points": "-1 points",
                    "children": [
                      {
                        "comment": "Maybe the one about the coke smuggling. American made",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "THIS was the one stargarnet was referring to- \"American Made\".",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "That was Johnny depp right? The movie was like “cocaine” or whatever",
                            "points": "-1 points",
                            "children": [
                              {
                                "comment": "The name of the movie is BLOW. The one with Johnny Depp",
                                "points": "4 points",
                                "children": [],
                                "isDeleted": false
                              },
                              {
                                "comment": "Nah this one’s about a pilot who does work for the cartels and CIA",
                                "points": "1 point",
                                "children": [
                                  {
                                    "comment": "Pixar or Dreamworks?",
                                    "points": "0 points",
                                    "children": [
                                      {
                                        "comment": "You’re welcome",
                                        "points": "0 points",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "Air America is the movie you’re looking for.",
                                    "points": "0 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Dateline Saturday. Lol",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "He had a call with Killary!",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I highly doubt it was self-inflicted",
            "points": "43 points",
            "children": [
              {
                "comment": "Oh, come on, what reason would boe- never mind.",
                "points": "19 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "In a hotel parking lot so there should be plenty of footage",
                "points": "16 points",
                "children": [
                  {
                    "comment": "That footage may come up mysteriously missing",
                    "points": "9 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "It always is if this happens in Tokyo.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "What people don’t see with these things, is the employee isn’t treated like a hero. They become a pariah. There’s a movie that kinda shows it; The Informant. Was this guys background squeaky clean? Was the deposition going to be ugly/brutal?\n\nMaybe he was CIA’ed, but another view is he was depressed and he was driven to suicide under immense pressure. Or at least that sounds more likely in this day and age of cameras everywhere.",
            "points": "11 points",
            "children": [
              {
                "comment": "So you’re saying he would just kill himself before doing as much damage to Boeing as possible? Seems very convenient for Boeing.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Sounds like something a Boeing employee would say…\n\n/s",
                "points": "",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Exactly, while it's suspicious timing, it's not hard to believe the lawyers and company of boeing and/or the trial put enough pressure on the guy to make him crack, I can't imagine the pressure of fighting a legal battle against a company of that size\n\nEveryone's so prone to jumping to conspiracy these days, and while it does happen, it doesn't happen nearly as frequently as the popular narratives would lead one to believe, I have no love for boeing, and they've clearly been shitbags in the past but making a conclusion before all available facts are present is all too common an issue that I see repeatedly driving false narratives",
                "points": "3 points",
                "children": [
                  {
                    "comment": "But if that was the case, there would be a suicide note and would someone go to a hotel to testify only to be found dead? It is simply too suspicious.",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "Not all ppl who off themselves leave a note, and I do agree it's suspicious but it's simply too early to make any conclusions, why wasn't he killed sooner if they're powerful enough to get away with, apparently he's already talked a good deal\n\nI'm just saying wait for all the facts before making your mind up about what happened here",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Sometimes it’s a moment of weakness and it’s not thought out. I dono man. Why would you write it all out then shoot yourself. That seems counterintuitive to someone that depressed. Lemme just pen out all my problems and lay them all nice and neat in a note. No. It’s to escape reality.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Their first article said self inflected gunshot wound.\n\nhttps://www.reddit.com/r/news/s/5RlPMCuQFs",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "What people don’t see with these things, is the employee isn’t treated like a hero. They become a pariah. There’s a movie that kinda shows it; The Informant. Was this guys background squeaky clean? Was the deposition going to be ugly/brutal?\n\nMaybe he was CIA’ed, but another view is he was depressed and he was driven to suicide under immense pressure. Or at least that sounds more likely in this day and age of cameras everywhere.",
            "points": "-3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Being at Boeing for that long, he must have seen some shit, most notably it turning into the giant steaming pile of shit it is today.",
        "points": "67 points",
        "children": [
          {
            "comment": "Not to mention the John Oliver episode a couple of weeks ago",
            "points": "9 points",
            "children": [
              {
                "comment": "Please send link. Thx",
                "points": "-12 points",
                "children": [
                  {
                    "comment": "Search it on youtube. Thx",
                    "points": "9 points",
                    "children": [
                      {
                        "comment": "The number of redditors that can't Google shit is staggering",
                        "points": "8 points",
                        "children": [
                          {
                            "comment": "“Software devs shouldn’t be paid so much to just Google things.”\n\nIt’s a surprisingly rare skill",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "The excessive phone use has cauterised the brain noodle.",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "damn they don't give a shit anymore, hope what he said is enough to proceed with the lawsuit",
        "points": "43 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Boeing recently had a bad flight with dozens injured. This is a not looking like a good year for them",
        "points": "56 points",
        "children": [
          {
            "comment": "Maybe if they fired higher ups and fixed their quality control instead of killing informants they’d be in a better position",
            "points": "8 points",
            "children": [
              {
                "comment": "But think about those poor shareholders! They just want more money (and have a private jet anyway so they don't go down with the plebs...).",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I bet they got one more plane grounding for this year.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Holy fucking shit",
        "points": "23 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Proof This happens ,not just in movies.",
        "points": "19 points",
        "children": [
          {
            "comment": "Where do you think movies get this idea? Art imitates life, and vice versa",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You think Boeing had him killed?",
        "points": "22 points",
        "children": [
          {
            "comment": "Do you understand how much money Boeing lost because of him (really because of themselves but beside the point) and how much they stood to lose? This is nothing new.",
            "points": "9 points",
            "children": [
              {
                "comment": "It isn't just money. Some of the top brass faced risk of prison sentences. If you know something can kill people and you intentionally cover it up and continue doing it. You can face criminal charges.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Absolutely",
            "points": "23 points",
            "children": [
              {
                "comment": "Allegedly Absolutely.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "He got Epstein'd, 110%",
            "points": "12 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Boeing: Playing with my money is like playing with my emotions, man!",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Come one man, do you really have to ask that question? It’s so obvious. If you don’t think he was killed, I already know who you are voting for.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yes",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Wtf this is an insane move. If you think Boeing wouldn’t do something, remember they’re a defense contractor. This is some cyberpunk level dystopian shit if it was them.",
        "points": "15 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“Self inflicted wound.” Right",
        "points": "10 points",
        "children": [
          {
            "comment": "Three shots in back of the head?",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This world is so fucked",
        "points": "9 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "this should be the biggest news story in aviation this year. but it won’t",
        "points": "15 points",
        "children": [
          {
            "comment": "Reddit shills are out in force! They’ll deny, be like “informants are often depressed” etc. Thing is a person that is depressed and hates their old employer would be more motivated by revenge than anything else. They’d at least wait for the second hearing to do as much damage as possible.",
            "points": "1 point",
            "children": [
              {
                "comment": "I don’t think it’s even just shills. I swear about 45 minutes to an hour ago there were 4 stories at the top of the popular tab on this within the top 15-20 posts. There are none right now",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "So when’s the Netflix Doc coming out?",
        "points": "5 points",
        "children": [
          {
            "comment": "There already is one.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Boeing implementing ruZZian tactics of dealing with individuals who are inconvenient to them.",
        "points": "10 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well, Boeing is screwed",
        "points": "21 points",
        "children": [
          {
            "comment": "I might be severely limited in choice but I might want to avoid all Boeing airplanes when I travel if people are getting mafia hit to keep things quiet",
            "points": "13 points",
            "children": [
              {
                "comment": "Good luck in trying to avoid flying by Boeing, if you are traveling in US. At one point I couldn’t even try avoid flying by Max at the time they were dropping off the sky. Luckily they were grounded soon after. All airlines are deeply entwined with Boeing planes. They were great in the past, except in the recent years they’re just not transparent with this horrendous management style. And now this news is just getting worse.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "They went for making money instead of quality. If they listen to Steve Jobs, the product will sell itself the quality is good.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Delta and jet blue use a lot of airbus planes",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Delta has more Boeing planes than airbus.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Doubtful, its too big to lose. There'll be a few jobs lost as tokenism in this sort of thing but nothing will really change.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Definitely not suspicious at all 🤔",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So this guy got Epstiened for sure. What a story. Hopefully they catch the killer.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well. That’s a bad look.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "From the article:\n\nBoeing said it was saddened to hear of Mr Barnett's passing.\n\nBullshit!",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "USA is turning into Russia",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“Self-inflicted” my ass 🙄",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“Self inflicted” - aye right!",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don’t see why he would take his life, while in the process of defending his name. Seems fishy to me, and the I’m sure police will find “No evidence of foul play.”",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Something like this can happen in US just blows my mind.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"Self inflicted.\"",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“Suicide”",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Boeing prob just had him killed. Corps do have that much power now so it wouldn’t be THAT surprising.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And seems like every other day, a a boing is loosing altitude, sliding on it side, losing a tire 🛞… etc…",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Basically Boeing was making insurance plays because a DoD contract is essentially a blank check if you're good at manipulating numbers. I think it's only going to get spicier from here.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m mean how much blacker can this movie be?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Maxxed-out.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Damn Putin",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If I was a pilot flying Boeing, I would want to switch to fly an aircraft built by different maker - just saying…",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wonder who Boeing is in bed with on this one",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "How do you end up IN THE TRUNK with a self inflicted gunshot wound…",
        "points": "-2 points",
        "children": [
          {
            "comment": "I thought it said Trunk too but it says Truck",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bceq7h",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://techcrunch.com/2024/03/11/sip-verrus-data-center/",
    "title": "Alphabet spin-off SIP launches Verrus, a data center concept built around battery 'microgrids'",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1bcenpo",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://techcrunch.com/2024/03/11/airbnb-is-banning-indoor-security-cameras-inside-its-listings/",
    "title": "Airbnb is banning indoor security cameras inside its listings",
    "points": null,
    "comments": [
      {
        "comment": "Good, when you go into a hotel would it be ok for cameras to be all over the place? People who are ok with this are weird",
        "points": "385 points",
        "children": [
          {
            "comment": "You'd be surprised what AirBnB and VRBO are okay with. When I worked at VRBO I'd see rebooking claims denied all the time for solid reasons. Bed Bugs, violent property owners, illegal subletting, not to mention condition of property from last renter or false advertising.",
            "points": "48 points",
            "children": [
              {
                "comment": "Nice, you might get subpoena'd!",
                "points": "11 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I feel like a large hotel and private residence being leased out by a third party have very different perspectives on property damage and how to remediate it",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "But hotels do have cameras everywhere like hallways, common areas",
            "points": "21 points",
            "children": [
              {
                "comment": "There really are no “common areas” in an air BNB though….\n\nLike yeah they could be designed like that but the idea is that it’s a home, and you should be able (within reason) use it like that. And I don’t think it’s unreasonable to not want to be recorded going from the bedroom to the kitchen without worrying about a camera if you aren’t sharing the home with anyone",
                "points": "80 points",
                "children": [
                  {
                    "comment": "I would argue that the driveway and front entry to be “common areas”. I suspect we agree.\n\nBut no, not inside the dwelling. Never",
                    "points": "23 points",
                    "children": [
                      {
                        "comment": "Agree, I do think that there should be some sort of access to viewing the cameras on the property you are staying on though just to ensure you know what’s being recorded.\n\nI know there is risk to having the guest abusing that knowledge to do something outside of the cameras visibility, but that’s the point of post visit charges like cleaning/destruction or property",
                        "points": "8 points",
                        "children": [
                          {
                            "comment": "I suspect the reason for interior cameras (other than voyeurism) is to prevent renters from holding illegal parties by keeping track of who is in the house. But that could be done with outside cameras that cover the entrances to a rental unit. https://news.airbnb.com/airbnb-announces-global-party-ban/",
                            "points": "5 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "I’m sorry, you want access to an airbnbs cameras lol? You can see what they’re recording when you look at the camera.\n\nPlus it’s boring to just watch yourself all day on the cameras. Unless you lost your keys or something.\n\nThat’d be a security concern and an onerous ask of a host. It’s not something you’d request at any other business.\n\nEdit: there can definitely be common areas in an Airbnb. You’re thinking whole house rentals, not room shares.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "I’ve heard of Airbnbs where they lock off a certain room to keep their personal belongings in. I can see having cameras in there, but not in the rest of the house.",
                        "points": "6 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "You're not arguing against anyone, even the article.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "But i “would argue” if I was in that situation.\n\nI know reading is hard. You may catch on someday.",
                            "points": "-4 points",
                            "children": [
                              {
                                "comment": "I would argue that by saying \"I would argue\" implies thats your personal standpoint. \"An argument can be made\" or \"people may argue\" would be a much better way of playing devil's advocate.",
                                "points": "2 points",
                                "children": [
                                  {
                                    "comment": "would has meaning. It means I am not; but I would…\n\nI dont need advise from someone that does not see this.",
                                    "points": "-2 points",
                                    "children": [
                                      {
                                        "comment": "Understanding how others world interpret you're words based on commen usage AND CONTXT is impotant when your trying to conveigh you're ideas.\n\nAlso thanks for the downvote just because I disagree with you. Not that I care, or whatever. It may seem like I care, given the context, but I'm telling you I dont",
                                        "points": "1 point",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              },
                              {
                                "comment": "Apparently articulate writing and civility are even harder.",
                                "points": "0 points",
                                "children": [
                                  {
                                    "comment": "Civility left the station before i replied. I replied in kind.",
                                    "points": "-2 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I stayed at a cabin last year and they had an arcade with thousands of dollars in cabinets and a great sound system and a pool table. It was an excellent room and probably the only type of room I would understand having a camera in. The person who owned this cabin was a private owner who invested a lot in making it an \"experience\". I couldn't imagine needing surveillance in any other type of room though, even a living room is a private space.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Yes, there are common areas in an Airbnb. Some listings are for a room only with shared common spaces such as the living room and kitchen.",
                    "points": "-3 points",
                    "children": [
                      {
                        "comment": "those aren't common spaces they're shared spaces",
                        "points": "10 points",
                        "children": [
                          {
                            "comment": "Those phrases mean the same thing. Define common space and shared space.",
                            "points": "-2 points",
                            "children": [
                              {
                                "comment": "Shared Space: Any space that you can expect to see other guests / a host in a shared Airbnb. Can include pretty much anything, even a bedroom (if the host rents by bed).\n\nCommon Space: Pretty much any area that’s not a bedroom or bathroom. Can refer to the living room, kitchen, etc. in a private Airbnb (where you rent the whole house / apartment)",
                                "points": "0 points",
                                "children": [
                                  {
                                    "comment": "no, common spaces are hallways, lobby's, outside garden.\n\nshared spaces are private spaces like living rooms, bedrooms, etc.",
                                    "points": "0 points",
                                    "children": [
                                      {
                                        "comment": "this is incorrect. i’m giving the actually airbnb definition of the two, not what they “should” be defined as",
                                        "points": "3 points",
                                        "children": [
                                          {
                                            "comment": "happy for you",
                                            "points": "-5 points",
                                            "children": [
                                              {
                                                "comment": "",
                                                "points": "",
                                                "children": [],
                                                "isDeleted": false
                                              }
                                            ],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "What if you are sharing the home with someone?",
                    "points": "-2 points",
                    "children": [
                      {
                        "comment": "Some air bnbs rent out each room/space separately, in which case you would have common areas that should probably be treated as such and guests probably shouldn’t be gallivanting around in whatever without thinking of that.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Yeah but when I rent a multi room hotel room, there’s no cameras in the living room portion.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Not the penthouse or suites though",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Right. You absolutely won't get recorded past the point where there's a locked door to the space you rented.\n\nAirbnbs that's the entire house.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Have you been to a hotel? There are cameras everywhere but your room… pool area, lobby, hallways…",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This was a blanket ban on indoor cameras unless you’re in an apartment building that you don’t control the exterior of.\n\nDo you think hotels have cameras in common area indoor spaces? Of course they do.\n\nI don’t think many people will take issue with banning them from private spaces, but banning them entirely from common area indoor spaces is absurd.",
            "points": "-41 points",
            "children": [
              {
                "comment": "Common area indoor spaces? Like if you’re renting a room and a stranger might be in the kitchen? I might agree. However, if I’m renting a space, I want private access to that space. I should be able to go nude from the bathroom to the kitchen, if I’m renting the entire unit.",
                "points": "40 points",
                "children": [
                  {
                    "comment": "You should get that mole looked at, by the way.",
                    "points": "11 points",
                    "children": [
                      {
                        "comment": "It’s not a mole, it’s a raisin, and they’re saving it for later",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Common area indoor spaces like hallways and common area kitchens. If you have a private space, that should 100% be private.",
                    "points": "-3 points",
                    "children": [
                      {
                        "comment": "Yeah as an AirBnB 100% is.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Hotel suites don’t have cameras in their kitchenettes or living rooms.",
                "points": "14 points",
                "children": [
                  {
                    "comment": "Those aren’t common areas. Hotels do have cameras in all common areas, which airbnb has effectively banned.",
                    "points": "-4 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Which common area would you walk naked in, a hotel hallway/lobby or a private residence hallway/living room? Have you ever had sex in a living room? When does the inside camera go too far? If you shouldn't be having sex or any privacy, the bedroom could have camera's. Is the only place you'd expect a camera to NOT be is a bathroom? Are you okay with being on a reality show? If someone can watch you digitally, they can broadcast you just as easily.\n\nA hotel and private residence are not the same. You have the expectation of privacy when inside the walls of a residential home.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "When you rent a hotel room with say a lounge area and kitchen you won’t have camera’s in there. Abnbs want to have the cake and eat it too. Like a hotel room, only the renter has access to the unit and whatever happens is their responsibility, don’t need a camera for that. If the neighborhood/condominium dynamic is complex and would require the property to have cameras ANYWHERE INSIDE then it shouldn’t be rented to random ass people. Bottom line… Hotels have public spaces, ofc it makes sense to have cameras… ABNBs don’t.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "When will it ban exorbitant cleaning fees?",
        "points": "219 points",
        "children": [
          {
            "comment": "When people stop using the product.",
            "points": "118 points",
            "children": [
              {
                "comment": "Way ahead of you",
                "points": "36 points",
                "children": [
                  {
                    "comment": "Same here. I’m done with it. Hotels are better and residential neighborhoods don’t want de facto hotels funneling a constant stream of drunken vacationers through the area.",
                    "points": "20 points",
                    "children": [
                      {
                        "comment": "Airbnb is nice when you're somewhere remote that doesn't have a hotel.\n\nLike a cabin on the lake, but that's about it. Hotels 100% the rest of the time for me. Way cheaper and nicer.",
                        "points": "13 points",
                        "children": [
                          {
                            "comment": "Really nice across Europe!",
                            "points": "2 points",
                            "children": [
                              {
                                "comment": "We did get to stay in some pretty sweet places in Europe. Stayed in a swanky apartment in Venice that had furniture from the 14th century. Definitely an experience we wouldn’t get in a hotel, but I think the cost of Air B&B to society is too great to continue to use it.\n\nI’ve personally witnessed it hollow neighborhoods out and raise the cost of rent.",
                                "points": "4 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "i already have.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I’ve switched to Booking. No more stress of leaving a place nice enough to get a positive review as a renter.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I think the insult to the injury is that even with cleaning fees they'll leave you a list of housekeeping chores to do .",
            "points": "16 points",
            "children": [
              {
                "comment": "Enjoy a luxury getaway. Also make sure to scrub the shower. Cleaning fee: $500 per night.",
                "points": "8 points",
                "children": [
                  {
                    "comment": "There was a post on another board where the cleaning fee was $350 and it was for a one night stay for one person. The host had the audacity to have a list of chores like starting the laundry with all the towels, strip the bed, take out the garbage, and load and start the dishwasher. Checkout was something like 10 a.m. too.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Would love for someone to start a webpage for Airbnb hosts with crazy fees. Good old shaming can do a lot. Give us some power back since Airbnb clearly doesn’t give a shit.",
                        "points": "3 points",
                        "children": [
                          {
                            "comment": "True. I love the scam some do where they have a decent price per night but then add on cleaning fees and \"property fees\" (another bs fee) that triple the price.",
                            "points": "3 points",
                            "children": [
                              {
                                "comment": "Exactly. It’s scammy and gross. Fine. If you want to charge more charge more. But don’t trick people and then put the cleaning fee on top of it as if it makes sense.",
                                "points": "3 points",
                                "children": [],
                                "isDeleted": false
                              },
                              {
                                "comment": "The ol Ticketmaster technique",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "What’s to stop renter from just not doing the chore list left? (I’ve never used abnb)",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Technically nothing, but it can result in two things IF the list was presented in the house rules section of the listing before you booked:\n\nThe first is unlikely but possible in that the host can request through Airbnb any costs associated with their cleaning crew (or themselves) having to complete the chore list you agreed to when you booked. This one is usually not the chosen path as the hosts have to prove those costs to airbnb first and the costs are often minimal\n\nThe second one which is very likely is the host will give a bad rating and review to the guest which other hosts can review before deciding to allow you to book. Though even in this case they have to be factually accurate and say that you didn't follow some rules and usually have to be specific which ones. If they are vague, the guest can challenge the review and Airbnb may delete. The host also can't say things like you were messy as a generalization if you don't strip the beds, or if you leave all the towels on the floor by washer.\n\nIf the list of chores is not presented before booking, they can do squat. Any review that mentions cleanliness can berequested to be taken down successfully by airbnb as long as you let airbnb know the list of chores was presented after the booking. Airbnb can tell when a host edits their listing so if the host tries to add it afterwards they can get in trouble.\n\nJust keep in mind that a guest can rate a host as well and expectations and demands work both ways.. If you arrive at a location that has a cleaning fee and a list of chores be sure to be expect a spotless place to stay. A stain on any linen, towels, furniture, dishes, glasses, stove is worth complaining about and a hit on the rating. Dust on surfaces or mildew anywhere in bathrooms? Hit on the rating. Just make sure you document with pics and use the Airbnb app to communicate these issues with the host so you have documentation.",
                            "points": "2 points",
                            "children": [
                              {
                                "comment": "Yeah, I'll just stay at a hotel.",
                                "points": "4 points",
                                "children": [
                                  {
                                    "comment": "I read that informative comment and the whole time was asking “why?”. Get a night at a Marriott and you’re great.",
                                    "points": "1 point",
                                    "children": [
                                      {
                                        "comment": "That works fine if you're single or just 2 people on a short stay. If you're a larger group, have kids, or are staying more than a few days being able to book an entire residence with an actual kitchen usually works out better and cheaper.",
                                        "points": "1 point",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "The cleaning fee is per stay not per day.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Who cares you can see the total price upfront which is all that matters",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The fees are set by the host, hosts can choose to not add them, just like any short term rental, Airbnb is just the channel, you don’t have to book with a host that has cleaning fees. They’ll just show up in the rate, generally.\n\nEDIT: within a search ranking set Airbnb does prioritize hosts with simpler pricing, so they do encourage no cleaning fees.",
            "points": "5 points",
            "children": [
              {
                "comment": "Completely bull shit. Airbnb can control what is acceptable. Such absolute crap. If they say to hosts you will not be allowed to post if you charge exorbitant cleaning fees then I guarantee things will change.",
                "points": "6 points",
                "children": [
                  {
                    "comment": "As a host they essentially do. They have new ranking rules and it incentivizes us to roll fees into our rate or eliminate them or we get relegated to the bottom of search rankings which hits our business.\n\nWhile I empathize with your feelings on the fees, the market corrects its self when needed. Some places have moved to direct bookings, some have eliminated the fees, and others have maintained the fees because it fits their business model.\n\nYou as a consumer have many choices, and aren’t required to book a place that has these fees if it doesn’t fit your needs or principles, but for many it still does. This is why you still see many hosts still include them as part of their model.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Saying “they essentially do” is complete bullshit. They could make it technically impossible to add cleaning fees. There is a whole culture that gets built up around their existence on what is acceptable or common practice. Mandatory charges should always be included in advertised pricing by law.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "The free market is self correcting!",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Let's not get ahead of ourselves here",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "My friend just unplugs the Wi-Fi when he stays at airbnb’s for this reason",
        "points": "88 points",
        "children": [
          {
            "comment": "I login to the router admin page and look at connected devices. I've never found a router than didn't have the default password written on it.",
            "points": "59 points",
            "children": [
              {
                "comment": "Hackerman™",
                "points": "23 points",
                "children": [
                  {
                    "comment": "You kid, but stuff like this got me labeled as a hacker back in the day. Got in trouble at work because I changed the number in a url and saw stuff I wasn’t supposed to see. It’s black magic to some people.",
                    "points": "15 points",
                    "children": [
                      {
                        "comment": "I was accused by a customer and kicked out of a coffee shop for “hacking” when i was just using terminal on my mac to ssh into a Linux work server…. People are dumb.",
                        "points": "9 points",
                        "children": [
                          {
                            "comment": "Putty has been the bane of my existence. \"Are you hacking?!\"",
                            "points": "7 points",
                            "children": [
                              {
                                "comment": "“No, i’m moving this one sh file and setting up a cron job that restarts this server once a week cause we are too lazy to fix the memory leak”",
                                "points": "5 points",
                                "children": [
                                  {
                                    "comment": "Fuck you joe",
                                    "points": "1 point",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "Im a software engineer and I have been asked by managers at starbucks to \"not use their wifi when I do that stuff\" using a cmd terminal\n\nTook me a while to figure out why they asked me to do that",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "adminman",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Hackerman™",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I do this too! I thought I was the only one lol",
            "points": "23 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Well I’ve had ones full of cameras but I’m one of like 8 unrelated guests",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I feel silly for not thinking of this",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "A lot of hosts have rules against this, as unplugging wifi can disconnect things unrelated to cameras. eg. some pool heating systems allow the host to change the temperature remotely through the house wifi. Outdoor security cameras that face the driveway also connect to wifi, so if someone unplugs the router it can be seen as them trying to have a party without the host’s knowledge",
            "points": "1 point",
            "children": [
              {
                "comment": "Plug it in when or if they come by",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "So what, maybe their internet went down 🤷‍♂️🤷‍♂️🤷‍♂️🤷‍♂️",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Aren't most cameras on cable?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Might be wired/POE, might be recording to an internal SD card, might be connected to an inaccessible WiFi AP. A bit of electricians tape would be a better idea.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I never understood why my friends happily get AirBNB over a hotel. Pay more, do chores, no professional support (calling AirBNB is a nightmare), and no privacy. OK you get a living room, but who cares. I'm not in Vegas to cosplay as a homeowner.",
        "points": "125 points",
        "children": [
          {
            "comment": "We travel in South and Central America and Europe.\n\nAlways Air B&B for us. I want a kitchen. I want to cook local food. I don’t want to have to eat in a restaurant for every meal. I don’t want to stay in the hotel district either. I want to see how locals live.\n\nWe try to get remote places. We stayed in a cool house in Dominican Republic that had a caretaker/security guy living in the back. He’d walk the property with a machete at night. Our only neighbors were cows. The house came with a cat.\n\nWe had a place in Costa Rica that had iguanas in the rafters and monkeys and sloths in the yard. It was near the beach but you had to hike through the jungle to get there. I never wanted to leave.\n\nWe had another place in Costa Rica near Arenal Volcano where the owner would move into a treehouse when he had a rental. The only neighbors were horses and macaws.\n\nWe had a goat farm in Spain near an olive orchard. It was way up in the hills down a bunch of dusty roads. The only sounds were the bells on the goats. It was amazing. There were the most beautiful and delicious tomatoes growing in the yard.\n\nWe had a place in Quintana Roo, Mexico that was a bunch of houses originally built for resort workers but the resort never opened. Out of about fifty houses, only maybe three were occupied. There was one policeman in a little hut at the corner. We would walk to a little house where the lady and her daughter would sell fresh tortillas every morning. There was a cafe down the road they made us chicken on a grill. Fresh chicken like it was walking around when we got there. Amazing.\n\nWe had another place on the West Coast of Mexico. It’s was maybe eight or ten turns down dusty roads. Really in the middle of nowhere.\n\nAnd there have been so many fun experiences like that. Once in a while we’ll stay in a hotel but only if we’re traveling and it’s all that’s available.",
            "points": "30 points",
            "children": [
              {
                "comment": "What you described is what airbnb is supposed to be, not the rental home arbitrage business that’s going on now",
                "points": "28 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "It’s better outside of the US but not inside of the us, got it.",
                "points": "11 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "How much did you pay per night for these stays? Err pick a random stay and say how many days you stayed and total cost. Just curious.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Way less than a hotel. We did the same in San Diego and Page, AZ. Why bother with a vacation if the bed you sleep on or the couch you sit on is a piece of shit? We also picked somewhere off the main tourist path. We had a quiet neighborhood! We slept SO good.\n\nBoth times we rented a hotel for $60:\n\nThe first had the cooler on and blowing right at our feet which was horror for our small room. It was either freezing or off. Wow so great. /s\nThe second, we had to fight with some other tourists who didn't speak English about whose Waffle was in which Wafflemaker for our \"free breakfast\" (it was free for all and our group didn't have time to wait for another waffle). It was truly the dumbest moment I've ever witnessed. Yes, I ate the slightly overcooked waffle.\n\nThe time that someone paid for our hotel because we were almost homeless, the hotel denied the charge because we weren't the named person on the card. Security? Sure. A pain in the ass compared to AirBnB? Like the other two stories, it checks all the boxes.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Couldn’t have said it better! This is why we go Airbnb when we travel. Especially the part about the kitchen! Eating out 3 meals a day leads me to feel like shit and is also somewhat to extremely inconvenient depending on the location!",
                "points": "1 point",
                "children": [
                  {
                    "comment": "The last thing I want to do on vacation is be stuck in the kitchen cooking and cleaning. And there’s no way in trusting the last person to have cleaned things well, so now I’m scrubbing dishes before and after.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "lmfao\n\n\"Who uses these things?\"\n\n\"Us, a couple of folks who are the epitome of statistical outliers.\"",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Airbnb is a multibillion dollar company, evidently it’s not just a few outliers that use it",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Why was there a security guy living behind the house, and why did he have to walk the property each night with a machete? Wildlife?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I would take cheap hotel breakfast over a rando walking around at night with a machete any day lmfao",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Full kitchen, laundry, multiple rooms. It's like being at home without any of your stuff. It would be a big advantage over a hotel if you go with family or friends. The chore part is just cleaning up after yourself and taking the trash out.",
            "points": "14 points",
            "children": [
              {
                "comment": "There's no shortage of AirBNBs with actual chores like needing to use a swiffer and washing the sheets, all while charging you a cleaning fee. Allegedly they've started getting tougher on those hosts but there's still too much BS for me to go with it.\n\nhttps://www.newsweek.com/airbnb-host-extensive-checkout-instructions-chores-cleaning-fee-viral-reddit-1840372",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "Aside from loading the washer and starting it that all sounds like l leave it like you found it.",
                    "points": "-2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Honestly doing the cleaning was worth it when the pricing was more competitive. Now it really is more money and more responsibility with no upside.",
            "points": "2 points",
            "children": [
              {
                "comment": "Because a bunch of greedy “property managers” got in solely to make money. Now a bunch of them are soulless and lamely decorated while providing just barely the essentials like scratchy towels and a Keurig where you have to bring your own pods.\n\nYou find a place where the owners live on site (usually a flat/duplex where the owners live in one unit and rent the other or have a private mother-in-law suite) or are just renting out their vacation home while they aren’t using it, it can still be a sweet deal.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Cuz I wanna make my own food 1-3 meals per day and save $500/week",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Because you can rent a really nice house for dirt cheap traveling in a group, but just my wife and I have found nice spots for cheaper than a crappy hotel. It’s especially nice if you plan on just cooking on vacation and not going out, which is what I almost always do to save money.\n\nMe and 4 of my friends rented a house in the Adirondacks for $300 total a person for 3 nights, with an unreal Mountain View, games, a sauna, a master suite with a jacuzzi tub all while being super close to hiking and skiing. The closet hotel was would have been more expensive with none of the amenities. On top of that you can have the whole property to ourselves, which I personally want on vacation.\n\nIMO airbnb is a game changer for close groups who want to stay in the same spot. You just can’t get the same feeling staying in a hotel with separate rooms.",
            "points": "10 points",
            "children": [
              {
                "comment": "I guess it's fine if you want to use it as a party house but even still they have a lot of rules (cameras) and I don't want to be recorded taking shots. For what it's worth, a lot of my friends still get AirBNB even if it's just one or two people.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "We definitely don’t use them as a “party” house. Don’t get me wrong, we drink and enjoy the devils lettuce outside but we don’t have anyone over that’s not in the group. Done this countless times without an issue.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "There are some situations where an AirBNB is better but not as much anymore",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "AirBNB is usually cheaper from my experience, at least in the locations I’ve used it in. It does vary by city.\n\nI also like having access to a kitchen where I can cook meals when I stay somewhere for more than a couple days. I also like having easy access to laundry. Hotels don’t always offer laundry for guests.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "We use it when we travel with our kids. Having extra rooms/beds is ideal since they go to bed much earlier than us and we can have our own space to enjoy each other’s company. Not being stuck in a single room is worth it.",
            "points": "1 point",
            "children": [
              {
                "comment": "Same for us. We aren’t out and about every waking minute with the kids while on vacation, and having a full house during downtime versus keeping active kids confined to one room with shared walls is much better.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Because it's often cheaper and not all listings have chores. I just stayed in Tucson for two months for $2100 total, which comes out to $35/day. Place was a 10 minute walk from a park and the city's main paved trail. Find me a hotel that offers that and isn't a dump and I'll gladly book it, but it doesn't exist.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "uninformed take honestly.\n\ntraveling abroad you can get AirBnBs for like $30 a night directly on the beach with none of the bs like having to do chores or anything.\n\nReally only in the US does it make sense to get a hotel",
            "points": "5 points",
            "children": [
              {
                "comment": "Or Europe, with social movements pushing airbnb regulation and overall more expensive fees.\n\nAirbnb was good when travelled in south east Asia and in some areas of the Middle East, just easier with a partner or a friend of the opposite sex.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Why no privacy?",
            "points": "0 points",
            "children": [
              {
                "comment": "click the link",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It’s great to have options. B&bs, private homes, motels, hotels, campsites, RV-parking. Competition is good. For me it’s price, and that I don’t value luxury.\n\nI want to experience without having to work more.",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It’s for the stove. Stove = cheap food bill when you stay somewhere. Takeout is horrifically priced these days.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Bullshit, you're choosing the wrong ones then. I've went on some real cheepo vacations with airbnb, always found great cheap places.",
            "points": "-2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "What's it like being so stupid?",
            "points": "-2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "How are they gonna enforce this one?",
        "points": "22 points",
        "children": [
          {
            "comment": "By having guests report them?",
            "points": "18 points",
            "children": [
              {
                "comment": "And then what? I mean there isn’t Airbnb police in each city.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "You can get delisted from even a single report around privacy, Airbnb doesn’t mess around.",
                    "points": "12 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "It won't be an instant thing, but they will eventually get in trouble, fined, etc",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "They’ll delist your home with a single report.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "I suspect it will fall somewhere in between unenforceable and delist from single report.",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "I take it you run an airbnb",
                                "points": "1 point",
                                "children": [
                                  {
                                    "comment": "Just a regular person. Each extreme is a bit silly and seems pretty unlikely to me.",
                                    "points": "1 point",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              },
                              {
                                "comment": "If Airbnb receives a credible complaint concerning safety, they will immediately delist the home and ask questions later. I work with a company that has thousands of listings on Airbnb. I'm telling you all it takes is one.",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "What if they are hidden?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Pervert cam is no longer wanted? Colour me shocked.",
        "points": "21 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Oh snap",
        "points": "4 points",
        "children": [
          {
            "comment": "What",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Surprised it took this long.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And here I thought that such a thing was already banned and illegal.",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AirBnB is a fucking cancer.",
        "points": "23 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Prices are gonna go up now when they can’t sell the footage of you in the shower anymore",
        "points": "6 points",
        "children": [
          {
            "comment": "If they get a kick outof seeing my hairy old man ass, more power to ‘em",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "More common than people think. I break them every time. Never suffered any consequences for that...",
        "points": "11 points",
        "children": [
          {
            "comment": "You… break the cameras in air bnb’s?",
            "points": "6 points",
            "children": [
              {
                "comment": "Yes if they are inside the flat. Especially if hidden.\n\nIf you report it instead, you have to deal with the hassle of moving again. This is a much easier solution. Had some hosts threaten me but I simply ignored it. What are they going to do? Tell Airbnb that they're secretely recording guests and risk getting delisted?\n\nSome of them were in bloody bedrooms. Creepy shit.\n\nYou can use your phone's flashlight to find them ;)",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Unfair!!! want to watch you clean my place whilst paying me 🤤 /s",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wait, that wasn’t always a thing?? Fuuuuuuuh",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "First thing I do at an AirBnb is unplug the router. Then J.O. all over their stuff",
        "points": "4 points",
        "children": [
          {
            "comment": "Me too",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I would think making this is a good move for guests who don't want to be watched while they stay in their room. People would freak out if they found out their hotel room had cameras.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "now ban fees and charges that double the rental fee and telling the guests to take out the garbage out AND pay an extortionate cleaning fee",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Do other countries have the housing issues that the US faces with everyone turning homes into AirBnBs? Vermont is facing this.",
        "points": "3 points",
        "children": [
          {
            "comment": "Yeah-some countries in Europe are considering banning them",
            "points": "2 points",
            "children": [
              {
                "comment": "It's disgusting how they complain \"they just don't want to work\" about folks with lower income statuses. Yet there are AirBnB owners that just party their ass off day and night because they own properties and don't lift a finger to do anything else.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "That’s not what this article is about",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Wait they’ve been using cameras? So they watch people naked? How’s that legal",
        "points": "1 point",
        "children": [
          {
            "comment": "The places I’ve seen that had cameras, were big group houses with tons of travelers. The cameras were in group spaces, so hallways, kitchen, stuff like that. Not in bathrooms or rooms.\n\nThe cameras in that context didn’t terribly bother me, though maybe I’d prefer to not have them. If I was a host though that had tons of people coming through, if someone trashed the place, committed violence, or other insane before I’d definitely want to be able to get it on camera so I don’t completely blame them.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Prediction: hosts will put microphones instead and use AI to convert a sound stream into a rendering of what is going on",
        "points": "0 points",
        "children": [
          {
            "comment": "The new policy covers that too. I’m a host (live downstairs and rent out my upstairs MIL suite) and got the email this morning. You can only have “noise level monitors” in shared spaces like living rooms and kitchens, not in bedrooms or bathrooms. The only I could see having them is to make sure nobody is throwing a rager in your home while you’re away. Cameras can now only cover the exterior of the unit.\n\nI don’t have any cameras covering outside the house, seems like a pain in the ass to set them up and we’re home all the time anyway so what’s the point.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Took its sweet time",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The places I’ve seen that had cameras, were big group houses with tons of travelers. The cameras were in group spaces, so hallways, kitchen, stuff like that. Not in bathrooms or rooms.\n\nThe cameras in that context didn’t terribly bother me, though maybe I’d prefer to not have them. If I was a host though that had tons of people coming through, if someone trashed the place, committed violence, or other insane before I’d definitely want to be able to get it on camera so I don’t completely blame them.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don’t ever remember any hotel I’ve stayed in leaving me a bad review for being a GUEST . For not making the bed when they charge you for the cleaning fee",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wait, this was allowed in AirBnBs?!?!?!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What? Was this not banned before?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Great, so now the cameras will be extra hidden",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There were cameras???",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Airbnb is a lost cause. This is one of 20 things they should have done years ago.\n\nDid their IPO and got lazy. New-rich f’s flushed that company down the drain.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "An important signal as AirBNB is global and influential business.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As if it will Make one bit of difference",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "How were they not banned to start with?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Airbnb feels like our generations of hitch hiking with strangers. Matter of time before people realize not all stranger home owners care about them or their own well-being",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Omg where’s the BORU about this?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This will have literally 0 effect on the cameras that are the problem.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Has there logo always looked like a ball sack?",
        "points": "0 points",
        "children": [
          {
            "comment": "here you go",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You mean this whole time when I’m doing all those freeky shit at the airbnbs, they are all recorded??",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Good on them, still never going to use an AirBNB.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Oh no won’t someone think of the property owners? 🤷‍♂️",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just stop using it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Weird to me that they ever allowed them",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Now it becomes hidden security camera I suppose?",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wow",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hopefully the last one I stayed in didn't have them because they would have seen a whole lot of me if they did.\n\nI bypasses the airbnb fees on the only one I've ever booked because the host was a run by a vacation rental company and I went to their website and booked through them. I saved $180ish by doing that.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s not already banned? It’s a clear constitutional violation.",
        "points": "-2 points",
        "children": [
          {
            "comment": "AirBNB operates worldwide, this is not a “constitutional violation” globally",
            "points": "4 points",
            "children": [
              {
                "comment": "In respect to American Airbnb. Laws vary from country to country and companies must honor the local laws in which they operate. You can’t have a camera in a hotel or a rental property.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Which amendment?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "About fucking time. I like to walk around after a shower and air off and I don't appreciate anyone other than my so watching me as a do it.",
        "points": "-1 points",
        "children": [
          {
            "comment": "Especially if I'm paying to stay there, might be different if they were paying me but they aren't",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I’m a host. Release location data, please. I don’t want locals. They aren’t “coming to town to see a sporting event or zoo. Locals have parties. Dumb ass Airbnb won’t support hosts only profits.",
        "points": "-7 points",
        "children": [
          {
            "comment": "Just turn off Instant Booking. You can deny a booking that way by just checking the guests’ area code and city they live in.\n\nI set mine to only allow Instant Book for people that have already completed some stays and have a good guest rating. I only allow 2+ night stays as well, this weeds out the jerks who trash the place pregaming for a concert or football game.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "If you don’t want people using their Airbnb rental to host guests, enjoy the space and have a good time on their vacation, maybe don’t rent it out as an Airbnb in the first place.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bcemsf",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://techcrunch.com/2024/03/11/ready-player-one-creator-debuts-open-a-metaverse-battle-royale-experience-readyverse/",
    "title": "Ready Player One creator debuts 'Open,' a metaverse battle royale experience",
    "points": null,
    "comments": [
      {
        "comment": "get skins inspired by the novel\n\nSigh. How is that even possible since basically the entire novel was basically references to other people’s IP?",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Unless it’s in VR, meh",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc5ez9",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://gizmodo.com/unplug-your-laptop-now-it-will-stay-plugged-in-forever-1851320725",
    "title": "Unplug Your Laptop Now, or It Will Stay Plugged in Forever",
    "points": null,
    "comments": [
      {
        "comment": "Most PC’s, Dell, Mac, etc either have battery management for this on by default, or can be enabled.",
        "points": "51 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It seems like perhaps manufacturers should have in place systems that can tell when a laptop is plugged in and run off the incoming power rather than the battery. And maybe a program that monitors the battery for optimal usage. But what do I know. 🤷‍♂️",
        "points": "22 points",
        "children": [
          {
            "comment": "But then peoples laptops would last year's and they wouldn't be pointlessly upgrading something they mostly watch youtube on.",
            "points": "9 points",
            "children": [
              {
                "comment": "The worst part is all the companies are going to internal batteries so you have to send it in the replace the battery",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Well unless you're ok voiding your warranty and prying the glued together plastic apart. Which is a pain but honestly I'd rather break it than pay for that.",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "I’ve had it happen on two occasions. It was under warranty both times so I sent it in for a free repair rather than buy a battery and void the warranty. Next time though…",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "I've been lucky with things only needing it outside warranty so far. I've had good luck with a couple of laptops and even an older iPad.",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "Mine were both Toshibas and because they were the only thing I could find a reasonable price with and i7 processor. They were mainly desktop replacements but need to go between home and school/work. The main issue was the processors were technically desktop grade so they had high power consumption, so the battery would drain fast.",
                                "points": "1 point",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "PC execs: \"The hell you say!!\"",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "They do. It's ironic that the article is talking about something that is a myth, while simultaneously starting a new myth.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Worse is cycling your battery, depending on the model it is made to sustain 300 to 100 cycles. No modern laptop stays at 100% when plugged in for a long period but they discharge to 95% to have a slightly lower battery charge voltage. The higher the internal battery voltage the faster it degrades.\n\nAlso laptops when being used for demanding tasks (video editing, gaming, compiling code etc) discharge batteries much faster and thus also stresses batteries.\n\nIf possible turn battery charge limit on and limit it to 80 and charge it montly to 100% once to calibrate the battery controller is recommended.\n\nBasically a poorly researched clickbaity article.",
        "points": "13 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "At least on Macs that can run recent versions of MacOS this is not a concern.\n\nhttp://yo.com/article/2217188/macos-optimized-battery-charging-system-settings.html",
        "points": "24 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The real problem here is laptops not having removable batteries.\n\nThere are a few things that kill your laptop battery, obviously constantly keeping it at 100% is not good. But the most damage comes from the heat your laptop gives off. When used as a desktop, the best thing was to remove the battery altogether and only put it in when you plan to take it on the go.\n\nWith a removable battery, my laptop battery easily lasted 10 years. But then they started to make removing batteries harder where I have to open the entire thing, the even worse they started gluing them\n\nHopefully with the new EU requirements, we will get removable batteries laptops again",
        "points": "11 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "OK dad",
        "points": "2 points",
        "children": [
          {
            "comment": "Wait, is he back???",
            "points": "4 points",
            "children": [
              {
                "comment": "Nope he left again for the Cigarettes/Milk/Beer/Soda store on the left.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The optimal state for your battery, according to Griffith, is somewhere between 20% and 80%. He recommends charging your laptop fully and then unplugging it to run down throughout the day. You should let your battery sit in this “mid-range” zone for most of its life to prolong your battery’s performance.",
        "points": "0 points",
        "children": [
          {
            "comment": "Was this article written by big battery? I'm not going to be putting all those cycles on my battery.",
            "points": "13 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Ehh I dont care, I dont use my laptop outside of gaming so I need the power.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And in this one statement ones sees the fraud being played on everyone; all these must be connected to work energy vampyre systems and energy has to come from somewhere and something and that something is gas, oil and coal, all of which become limited in supply as they are used and wasted on things that don't need to be always on of course that does not stop anyone from orchestrating the conditions for them so the NEED of some of them to be always on exist.\n\nN. S",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Worse is cycling your battery, depending on the model it is made to sustain 300 to 100 cycles. No modern laptop stays at 100% when plugged in for a long period but they discharge to 95% to have a slightly lower battery charge voltage. The higher the internal battery voltage the faster it degrades.\n\nAlso laptops when being used for demanding tasks (video editing, gaming, compiling code etc) discharge batteries much faster and thus also stresses batteries.\n\nIf possible turn battery charge limit on and limit it to 80 and charge it montly to 100% once to calibrate the battery controller is recommended.\n\nBasically a poorly researched clickbaity article.",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc2twl",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://arstechnica.com/tech-policy/2024/03/florida-middle-schoolers-charged-with-making-deepfake-nudes-of-classmates/",
    "title": "Florida middle-schoolers charged with making deepfake nudes of classmates",
    "points": null,
    "comments": [
      {
        "comment": "This is going to be a HUGE headache for school administrators.",
        "points": "293 points",
        "children": [
          {
            "comment": "No it won't.\n\nAs a former educator I'm certain they will just ignore this issue like they have been ignoring the cell phone problems for the past decade.\n\nSchool administrators will do the bare minimum to disciple the students so they don't lose any tax money for their school and will pass the buck to anyone else. Hell, they'll probably find a way to blame the teachers.",
            "points": "217 points",
            "children": [
              {
                "comment": "Right but how can this be used to slander the University of Florida, Miami, or Jimbo Fisher? These are the real questions that matter",
                "points": "20 points",
                "children": [
                  {
                    "comment": "Lol always love to see some fingerbanging in the wild",
                    "points": "7 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Ask Chat GPT.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Libel and slander are both types of defamation. Libel is an untrue defamatory statement that is made in writing. Slander is an untrue defamatory statement that is spoken orally. The difference between defamation and slander is that a defamatory statement can be made in any medium.\n\nPersonally, I expect these incidents to escalate due to our expanding technology, lack of the education system’s involvement, and what is deemed to be protection of personal privacy laws.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "In you average secondary education setting the day to day is just keeping the asylum running.... stuff like this is something that only matters if it hits the papers or the lawyers desk.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "can confirm. My boyfriend is a teacher. Nowadays, students just spend most class on their phones. Paying attention is a thing of the past. He told me he asked their principal to come in and instead, the principal sent in the assistant principal who walked out after 5 minutes.\n\nAmerica’s future is a dark and grim one and while everyone is fighting about “indoctrinating kids” and CRT not one person sees that the kids aren’t learning shit. Parents included.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "This doesn’t happen in the school district where I teach. Phones are NOT allowed to be out during class, violators get ISS and their phone taken away until the end of the day. This is for all grade levels. The administrators and teachers are serious and made it happen.",
                    "points": "7 points",
                    "children": [
                      {
                        "comment": "That’s truly amazing. Our local school district is a massively disappointing place. For the teachers especially. It doesn’t seem like the admin care at all.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "You're very fortunate that you have a district that actually enforces this.\n\nI've taught at 3 different high schools; phones weren't allowed in any of them, but the admin did nothing to help teachers enforce it so nothing happened.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Giving the student suspension is appropriate. Taking their phones or any property is liable to become a very big issue.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Are they passing exams etc?\n\nIs the school system more poor inner city school?\n\nI know that a lot more slides by the less of a magnet school it tends to be.\n\nIm just curious if this is widespread or more selective.\n\nIt is hard to imagine that kids totally ignoring everything would fly for long. They woukd flunk in mass and tax dollars would disappear",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Just left an AI committee meeting for my district.\n\nWe’re not, and my division is looking to get counseling involved for cases like this",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "What?\n\nWhy would teachers ignore such huge sexual abuses??",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I’m surprised schools are painted in paint doped with flecks of copper wire as to block phone signal.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I was sexually assaulted by a gym teacher, it was an ass slap but with a grope and fingers that happened to go between the cheeks and the school did nothing about it, even after my dad went in and let into them, they said there's nothing they could do cause the teacher denied it happened, I was also stabbed in the back with a fork, same response no evidence it happened",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Saying school administrators is dumb. Any policy like this is a district policy and comes straight from the board.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Oof! Right in the reality.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "School administrators generally have no control over online behavior unless it is filmed/performed on school property. It’s really frustrating to have to tell parents to contact the police for online bullying, because everyone wants something to be done but the jurisdictional issues are complicated. Different state and local statutes define if schools can even obtain information from a child’s phone because it’s considered either personal property or an extension of a person in different circumstances. When it comes to CP, the police are who handles it at a minimum so the administrators can’t do much outside of notifying parents of the laws and the policies are most likely communicated by the district anyway.",
            "points": "11 points",
            "children": [
              {
                "comment": "A high school in the Bay Area expelled students for posting racist and violent bullshit on social media. They tried to sue, claiming what they did was protected under 1A, but it failed.\n\nhttps://www.kron4.com/news/bay-area/instagram-account-that-shared-racist-content-not-protected-by-1st-amendment-court-rules/",
                "points": "4 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "If they distribute it at school, it’s a school issue.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "That is correct if there’s proof that it was shared on school property during school hours, but you tend to see a lot more content being shared outside of school. Depending on the jurisdiction/statutes, the administration may only be able to give consequences for the use of the phone if it breaks the technology policy. CP is a criminal issue, and schools actually fall under public property designations in most circumstances.\n\nI’m getting my doctorate in education and my dissertation is on policy. There are very few absolutes, but criminal law usually supersedes anything at the school or district level. A principal has very little power outside of public statements, it’s the district or school board (or their legal counsel) that holds the real power.\n\nThe reason cyberbullying is different is because harassment isn’t as black and white as CP legally.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Even if it was done outside of school. The school should have some involvement.\n\nIt seems like the option for the victims to transfer to a different school should be available",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Only if/when any parents cause a public stink.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "So? They should do their damn job",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It’s FL, nothing will come of this",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "What would happen if, suddenly, everyone was VERY skilled at drawing?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The fact that it’s middle schoolers says a lot about where the future of this is going",
        "points": "254 points",
        "children": [
          {
            "comment": "This has been going on for decades, if not much longer.\n\nBefore AI deepfakes, it was photoshop and computer photo editing. Before computer editing, it was cutting out photos and pasting them on playboys.\n\nI don’t think this behaviour is substantially different, if at all, from prior generations. This doesn’t make it right. I by no means am condoning this. But this isn’t new.",
            "points": "183 points",
            "children": [
              {
                "comment": "Right, the only part of this that is new is the ease of use and the lack of skill needed. It’s literally just a “select picture” app.",
                "points": "74 points",
                "children": [
                  {
                    "comment": "Ease for achieving “high quality”, yes. AI poses the new threat of making very believable fake images, which is prob why this behaviour has come to light just now.\n\nEase for creation at all? Every prior “method” was also just selecting a picture.",
                    "points": "29 points",
                    "children": [
                      {
                        "comment": "Digitization is also part of the problem. In your example with the playboys, there would have been one copy kept under some kids bed that maybe only his friends knew about. In the photoshop era, these kids weren't necessarily walking around with smartphones in their pocket in school. Now this video can likely be distributed not only all over the student body but also viewed at school which is likely very damaging to the reputation and mental health of the victim.",
                        "points": "24 points",
                        "children": [
                          {
                            "comment": "It's also the effect of having high speed internet on cell phones now. In the early days you would struggle to send a link of even a couple MBs because no sites would hold a file like that, or it would disappear after so many hours.\n\nNow you can put it on your own google drive and share it, and with AirDrop being so seamless and phones having more storage, you can send and receive bigger and bigger files.",
                            "points": "6 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "You don’t get it until you’ve seen or used one of these. It’s RIDICULOUSLY easy to take a random photo of someone on Facebook and upload it to one of these services, then click the area and viola. It looks INSANELY realistic.",
                        "points": "14 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "No it was not that easy. And it was not as convincing. The amount of details that can be achieved with a prompt is really terrifying.\n\nAnd the AI momentum is there to add more access to those tools.",
                        "points": "18 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Yeah but its SO easy and does such a good job now. It'll be an app on your phone before you know it.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Pretty sure there’s already phone apps for it, on android at least.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "There are hundreds. Most just svtively try to prevent the pornographic aspect. Same tech though",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "What a weird take to have so many upvotes. It’s wildly different than any previous generation. Who the fuck had regular access to photoshop in middle school? And who in the fuck ever cut out photos and pasted them on playboys? I’m pretty plugged into the average American experience growing up in the 80s and 90s, and this ain’t it. At all.",
                "points": "17 points",
                "children": [
                  {
                    "comment": "Yeah I never heard of this. Also what’s happening now looks much more realistic than what that person described. No one is fooled by a literal photo cut out versus AI generation, it just can’t be compared with a straight face.\n\nThese are seriously weird and concerning times for young people. As if mental health wasn’t bad enough with constant phone/social media access.\n\nI’ll gladly take my dial up childhood over this shit 🤷‍♂️",
                    "points": "13 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "In the mid 90s we had digital art labs with Photoshop and scanners in middle school with minimal supervision. Most of the porn I downloaded was images of fake nude celebrities. My friend used to take pictures of girls from school in bikinis and remove the bikini in a surprisingly life-like way. He's now a digital artist.\n\nThe cut and paste on Playboy probably happened in the 80s, but we were more digital.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "The weird take is that we should be prosecuting people for creating purely fictional images. I don’t care how real it may look. It is a work of fiction. Prosecuting people for creating specific types of fiction is thoughtcrime. Expel the kids, sure, but prosecute them? Fuck that.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I saw a documentary about this back in the 80’s. Teenagers would wear bras on their head and feed magazine cutouts of women’s body parts into a computer. Some sort of science movie. But really weird…",
                "points": "6 points",
                "children": [
                  {
                    "comment": "One of my favorite documentaries. The end result of their work was phenomenal!",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Phenomenal, yes, but my vision ain’t the been the same since I looked at the science behind it. I mean, it all checks out, but it blinded me!",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Accept it looks more real, is easier to create, and can spread much further, faster.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "When I was in early high school a classmate took a picture of me from MySpace and photoshopped dicks in my hands and on my face. That was almost 20 years ago.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Just it looks real now with very little effort or skill. In practice it’s much worse as others will believe it.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Someone says it. Only difference between now and any other time in history is that you can see it because of mass media. World is as crazy as it has always been. Just most people are sheltered from how crazy life can be and then view it though media and think it somehow different. And then u like your history book you don’t have the power of hindsight.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Yeah, I am much more worried about the thoughtcrime angle of prosecuting people for using new tools to generate fictional images of real people than I am about people actually using those tools. Expel the kids, sure, but prosecute them? For what?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Because the victims are middle-schoolers (ages 10-13ish), could this also be considered creating child pornography and the students be charged with that crime? Even if those images aren’t “really” the victims because it’s a deepfake?",
        "points": "46 points",
        "children": [
          {
            "comment": "could this also be considered creating child pornography\n\nliterally what happened.",
            "points": "32 points",
            "children": [
              {
                "comment": "Based on the article, the charge is from a 2022 law where you can’t create photos of someone without their consent. It does not mention age at all.\n\nNothing I see in the article states, specifically, about child pornography.\n\nEdit - there is a mention of CSAM, but that it doesnt seem like the individuals will be charged.",
                "points": "13 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yes. It doesn’t ever have to be real people. But it’s a bit much to charge middle schoolers with CSAM crimes.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Glad I'm not a lawyer because this whole thing seems like a cluster fuck with far reaching implications.\n\nLike if I draw a Pic of my teacher sicking dick I would just get detention. But this is a felony. I wonder if the wording of the law will be used by Disney to kill rule 34 pics",
        "points": "27 points",
        "children": [
          {
            "comment": "There's a huge difference between a crude illustration and deepfakes, deepfakes are presented as real and the intent is to create as realistic of a rendition of the \"victim\" as possible. Rule 34 isn't the same thing at all because we're talking fictional depictions of fictional characters vs realistic depictions of real people.",
            "points": "22 points",
            "children": [
              {
                "comment": "A talented artist can make a realistic depiction as well. It seems like the crime here is distribution. What is rule 34?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Similar but somewhat less severe, a senior in my high school created a virtual valentine's day card of 3 teachers with their ID picture and sexual innuendos like one had back issues so it read \"I can't go down but you can go down on me\" and other dumb high school jokes. The pictures where shared and when a teacher of one of the cards found out she, along with the school, threatened to press charges, emailed her future college, and suspended her for a week.\n\nNot trying to say the charges would've stuck just sharing my personal experience also in the Florida school system before this law was even passed. I can't attest if they could actually carry out the consequences but all that for their ID picture with a sexual innuendo next to it not even sucking dick",
            "points": "0 points",
            "children": [
              {
                "comment": "Yes, sexual harassment is a crime.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Felony is crazy for middle schoolers. They’re clearly trying to make an example out of these kids.",
        "points": "45 points",
        "children": [
          {
            "comment": "The problem is that children aren’t intelligent enough or mature enough to understand the repercussions of these actions. You can tell a kid they are getting felonies, you can explain a felony to them, but they won’t fully grasp it.\n\nA child has never tried to get a job, so they won’t know or understand how hard it is to get one with a felony. A child has never had to work so they won’t understand why it’s important.",
            "points": "9 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "So you don't care at all about the ruined lives of the kids whose faces were used in the images that can then follow them for a lifetime. It has a ripple effect far into the future if these images exist and resurface. If the images look real, they'll affect the person as though they are real. Lost opportunities, lost ability to participate in any sport or activity that follows a code of conduct, lost college opportunities, lost jobs, lost relationships. And that's not to mention the psychological damage. It absolutely should be classified a felony.",
            "points": "16 points",
            "children": [
              {
                "comment": "There’s a little bit in between doing nothing and slapping felonies on children.",
                "points": "15 points",
                "children": [
                  {
                    "comment": "Yeah. Obviously this is disgusting and the children should be given severe consequences but perhaps not life ruining consequences at such a young age. They should know this is wrong but they are also just kids. It feels cruel to ruin their lives over this. Now if they were adults then I’d be saying it differently. But these kids aren’t even high schoolers yet.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "We live in a world where any Tom dick and Harry can pull your face from Facebook and put you on a porn stars body with two clicks.\n\nWhile I don’t want to downplay the trauma of the victims, we need to be realistic here. Did we slap felonies on middle schoolers for glueing your face on to a playboy in the 80s?",
                "points": "7 points",
                "children": [
                  {
                    "comment": "Worse, AI can make you act out and vocalize. And this is current gen. In the next five years it will be hard to determine what is and what isn’t",
                    "points": "7 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Did we slap felonies on middle schoolers for glueing your face on to a playboy in the 80s?\n\nmaybe we should have.",
                    "points": "-3 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "He didn't say that he didn't care..",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "As they should, it would set an extremely poor precedent if they didn't. Unfortunately these boys made a very bad decision, and they're going to have to live with it.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Absolutely should be a felony and they should made an example out of em. We need to be pushing for strict AI laws or things will get very bad",
            "points": "3 points",
            "children": [
              {
                "comment": "These are middle schoolers, who realistically don’t understand the weight of what they’ve done. These are not grown ass adults. To try and convict middle schoolers over this is insane to me. You can make an example of CHILDREN without trying them as adults in a court of law. Get fucking real. This is very gross behavior but not how we should be punishing literal children.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "I didn't see anywhere that they are being tried as adults.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Their victims are middle schoolers too.\n\nWhy are the ages and maturity levels of the offenders the only ones being focused on?",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "wow I'm glad you aren't in charge of anything real",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Good, they should be made an example out of. Chances are these are bullies who have gotten away with crap for way too long and have never faced real consequences for their actions and they finally went over the line in their tormenting of other kids.\n\nMake it clear across the country to kids, parents and administrators that if they want to play with this crap they’ll be facing hard consequences.",
            "points": "2 points",
            "children": [
              {
                "comment": "ITT redditors who were bullied in school project their trauma onto other random children who they know nothing about and haven’t met before",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Yeah I’m sure they’re sweet little Boy Scouts who just accidentally made quasi child porn and showed it around their school because they’re just such good lads who did a lil oopsy poopsy.\n\nI get you feel for them because you probably would have done the same thing at their age if you could have (and would have found it hilarious) The rest of us want this nipped in the bud before some kid is driven over the edge from having their “nudes” leaked.",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "Damn, dude. You've got issues. Nobody's saying this situation isn't fucked up, but blind hatred for a bunch of kids too immature to really internalize the implications of their actions?",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "They definitely deserve punishment but it has to be appropriate. They’re in middle school. Misdemeanor and 2 week suspension is fair here, not a felony that will literally follow them for life because they made the stupid mistake of dicking around on AI generators.",
                "points": "-2 points",
                "children": [
                  {
                    "comment": "...2 week suspension? They created child porn and used it as blackmail. You could say they don't deserve a felony charge because they're kids, sure. But they absolutely deserve expulsion and a permanent mark on their school records. I would not want the people responsible to be within even 500 feet of my kid after they got a slap on the wrist like that.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "They’d see it expunged when they’re 18 but yes, it does need to be proportional. I’m not advocating tossing them in a federal jail as adults, or having them dig ditches in the morning and filling them up in the afternoon for the rest of their school years.\n\nBut there MUST be hard legal repercussions, be that community service, required counseling and limited access to internet devices etc.\n\nI will not be told that these boys accidentally came across these images while making AI images. They generated them on purpose and they distributed them on purpose with the intent of humiliating their peers, they may not have known how fucked up it is, but the malice is still present.\n\nThis type of thing cannot be shrugged off with “You’ll be given a misdemeanor (what would that even mean to a kid?) and two weeks suspension (which for some kids is just two weeks vacation)” there need to be hard repercussions now before some kid is driven over the edge because every week a new “nude” of them has been dropped for the student body to laugh over.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I have no doubt the incident merits such a serious response, but is there even any law to charge them with on this?",
        "points": "48 points",
        "children": [
          {
            "comment": "Read the article.\n\nThe boys were charged with third-degree felonies—the same level of crimes as grand theft auto or false imprisonment—under a state law passed in 2022 which makes it a felony to share “any altered sexual depiction” of a person without their consent.",
            "points": "102 points",
            "children": [
              {
                "comment": "Sad that the only response people can come up to this is charging kids with felonies. Wtf. This is more of a societal issue than something that should be handled by a court just giving out felonies and ruining peoples life. But what should one expect from a place where the problem of gun violence is countered with... more guns.",
                "points": "28 points",
                "children": [
                  {
                    "comment": "I'm sorry but do you think that these kids should not experience legal repercussions because it's a \"societal problem?\"\n\nI'm fine with arguing that it should be a misdemeanor or some other specific, lower penalty but this absolutely has to be criminalized or this is going to become extremely normal, which is a nightmare for kids and parents.",
                    "points": "7 points",
                    "children": [
                      {
                        "comment": "The solution for this should not be slapping felonies on those kids and go on about the day.\n\nThey are kids, kids are dumb. There is a reason why they are only allowed to do certain things after reaching 18 years of age. So dropping the legal hammer on them in form of felonies is the easiest way out but won’t do anything to stop these things from happening again.\n\nIf this is the first time they got in trouble like that, have them do community work, have them prepare a speech which they have to read in front of the whole school why it isn’t okay what they did.\n\nthis will get their little minds working and hopefully they are able to recognize how royally they screwed up.\n\nKids act according to the environment they grow up in. The massive lack of sensibilizing them to the dangers of modern technologies is a failure of their parents, the education system and politics.",
                        "points": "20 points",
                        "children": [
                          {
                            "comment": "The massive lack of sensibilizing them to the dangers of modern technologies is a failure of their parents, the education system and politics.\n\nI totally agree. I also do think that this should be criminalized. Again, maybe there's an argument that it should be a lower penalty, fine. But they should be processed by the justice system, they shouldn't have to write a book report about it.",
                            "points": "8 points",
                            "children": [
                              {
                                "comment": "They are arguing against giving them felonies. Not against criminalization.",
                                "points": "7 points",
                                "children": [
                                  {
                                    "comment": "They literally gave an example of punishment as \"make them read a speech in front of the whole school,\" that is an extrajudicial process.",
                                    "points": "2 points",
                                    "children": [
                                      {
                                        "comment": "I guarantee throwing these kids in juvie would be more harmful to the kids.\n\nThe speech and community service would be much more rehabilitative.",
                                        "points": "5 points",
                                        "children": [
                                          {
                                            "comment": "Deterrence and rehabilitation have to be balanced",
                                            "points": "0 points",
                                            "children": [
                                              {
                                                "comment": "",
                                                "points": "",
                                                "children": [],
                                                "isDeleted": false
                                              }
                                            ],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      },
                                      {
                                        "comment": "Look, we are dealing with a novel situation. Where the ease of creating these images is the lowest it’s been in history. This accessibility poses challenges, and many children lack the executive function to understand this.\n\nGiving them felonies in such a case is too far in my opinion. You can believe otherwise, but I do not. They also included community services, which is a common misdemeanor criminal punishment for children.",
                                        "points": "8 points",
                                        "children": [
                                          {
                                            "comment": "I do agree that giving felonies is probably too far, but I also think it does need to be criminalized. I'd have to research how felonies, misdemeanors etc are actually processed by the court system and how they affect juveniles before I took too hard of a stance. But I do think it should be criminalized and the penalty that these kids suffer has to be substantial, albeit not life-ruining.",
                                            "points": "0 points",
                                            "children": [],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              },
                              {
                                "comment": "I would go a step farther and say that psychologists etc should be weighing in.\n\nOften system in the usa puts a lot more emphasis on retribution vs rehabilitation or stopping the action.\n\nFor the same reasons why kids would do something this stupid they wouldnt grasp the consequences of punishment until older.\n\nAlso, it is weird how laws like this come up. I knew people could do this. I thought it was immoral but didnt know it had become illegal.",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              },
                              {
                                "comment": "I would go a step farther and say that psychologists etc should be weighing in.\n\nOften system in the usa puts a lot more emphasis on retribution vs rehabilitation or stopping the action.\n\nFor the same reasons why kids would do something this stupid they wouldnt grasp the consequences of punishment until older.\n\nAlso, it is weird how laws like this come up. I knew people could do this. I thought it was immoral but didnt know it had become illegal.",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "This is going to be the “new normal” during next years even if we put capital sentence on it.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "It definitely needs to be seperated for minors.\n\nThe fact that they were looking to press cp charges is wild. Cp charges when the people involved are of the same age or within a year doesnt make sense (beyond cultural perception on when sexual activity is ok)\n\nWhat is backwards to me is the lack of laws about restricting the programs.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "they were looking to\n\nThe article basically says the opposite, that they did not charge them with CP related charges precisely because they are young. This is good and correct judgment imo. Kids sharing/leaking/deepfaking nudes of other kids is not the same as adults doing the same with content of children, but still it should not be permitted.",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "Good point",
                                "points": "1 point",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Any time this issue has been brought up on Reddit over the past few days, someone inevitably says “so you think these kids shouldn’t be disciplined at all?!?!”\n\nThat’s not what anyone is saying. What people are saying is charging freaking 13 year olds with felonies is a very slippery slope.\n\nThis AI stuff is in its Wild West days. God knows what most of us would have done if we could have made fake nudes with the press of a button at 13 years old.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "idk man there's a really big gap between felonies and \"read an apology to the school.\" There is already a judicial system in place to handle crimes performed by minors. I agree that it shouldn't be a felony but people are responding with whacky shit in this thread in the other direction as well.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Eh, you're talking about a major invasion of privacy, defamation, and distribution of child pornography. I agree that charging children with felonies that will make their life harder is not a good solution to the problem, but these are felonious offenses and they shouldn't get away with a slap on the wrist. We need to be educating kids that this stuff isn't okay and it could lead them to some serious legal trouble, and right now the technology is so new that we really didn't have a contingency plan for this scenario until it was too late. So basically you just have to punish the ones committing the crimes as a scapegoat and to make an example for other kids in the future.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "How many laws do you think a 12 year old knows\n\nHow many are going to watch the news to see the \"example\" being made\n\nIt isnt defamation. In most states it isnt cp\n\nIn florida revenge porn is a misdemeanor\n\nThis tech has been around for over 6+ years",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "If I was his classmate and I found out he was making deep fake porn of me, I'd want him charged too. Fucking menace to society is only gonna get worse. Yall are the type to ignore signs until something worse happens and act like you had no idea it was brewing.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "They ruined the life’s of several other people. That shit never will be erased off the internet.",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "“any altered sexual depiction”\n\nInteresting phrasing. Is it legal to post unaltered sexual depiction without consent then? I sure hope not. Is it covered by a former law then?",
                "points": "0 points",
                "children": [
                  {
                    "comment": "It is not legal to post unaltered sexual depictions without consent, but fun fact, in Florida, it's actually only a misdemeanor to do that.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Yeah but I mean proper laws with charges that will stick",
                "points": "-5 points",
                "children": [
                  {
                    "comment": "Yes, those charges can stick. A kid in a town near mine was on the sex offender registry at 14 years old for circulating cd's with images of nude classmates. They are still on the registry.",
                    "points": "16 points",
                    "children": [
                      {
                        "comment": "Damn, life is over at 14. Thats craaaazy",
                        "points": "10 points",
                        "children": [
                          {
                            "comment": "Yeah, he might only end up as a Supreme Court justice.",
                            "points": "4 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "His life is not over.",
                            "points": "-5 points",
                            "children": [
                              {
                                "comment": "True, the community is wealthy. He will have options because of this.",
                                "points": "2 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Florida be crazy, but that ain’t justice",
                        "points": "8 points",
                        "children": [
                          {
                            "comment": "The kid still spread CSAM and those pictures could still be online somewhere.",
                            "points": "-1 points",
                            "children": [
                              {
                                "comment": "I thought we were still talking about AI stuff. Real CSAM has not changed and neither has my opinion against it.",
                                "points": "3 points",
                                "children": [
                                  {
                                    "comment": "It says in the article that you claim to have read that these images can be considered CSAM, although the kids were not charged with it because of their age, which seems reasonable.\n\nAlso what are you saying about AI vs \"real CSAM,\" are you cool with people manipulating images of children into pornographic content?",
                                    "points": "2 points",
                                    "children": [
                                      {
                                        "comment": "That’s a bigger question than can be handwaved because the article said it, but I accept that it’s your take too. I just wonder where the reality will land on this one, and that really is a good question whether or not you’re willing to engage with it.",
                                        "points": "1 point",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "",
                                    "points": "",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "That is up to the courts to decide. The prosecution, defense, and jury. If the law needs to be amended/changed, the local government can vote on it again.",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "I am certainly not questioning if Florida Law will find a way to flounder for a whole long while",
                        "points": "4 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Oh like the law that makes this behavior a felony?",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "what in the description of the law above makes you think it won’t stick?",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "The article explains some of that, did you read it?",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Would this not count as creation / possession of CP?",
            "points": "8 points",
            "children": [
              {
                "comment": "Shouldn’t, but who know what the law will say",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "[deleted]",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Oh there's consequences, they are just tacked on at the end to get a harsher sentence when someone gets caught with real csam, they will just add the loli hentai on top.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Technically any depiction of a minor character, even a cartoon can be illegal in most of the US. The difference is no one is actively going after you since there is no real victim.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Because there's no real life consequences to sexualizing a fictional character vs an actual child",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "So are deepfakes only bad if it involves nudity? Is it okay to make one of someone doing drugs of torturing a cat or something else heinous.",
        "points": "24 points",
        "children": [
          {
            "comment": "That’s a good question. Far more ways to ruin someone’s reputation than just sexual pics.",
            "points": "11 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Torturing cats with drugs",
            "points": "4 points",
            "children": [
              {
                "comment": "Am I hear to ameowse you?",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Torturing cats by not giving them drugs while they are on a bender",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It’s not the creation of illicit minor deepfakes they’re being charged for, it’s distribution.\n\nMaking the deepfakes is not illegal, as I understand the issue.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I totally agree with you, there are way more repercussions of deepfake technology outside of nudity. I think the outstanding issue here that doesn’t have a great resolution is that if a middle schoolers were making deepfakes of classmates, they were creating child pornography and that’s what is being punished here.",
            "points": "3 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Unless they are saving kittens they are all bad mmkay.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Maybe they could be charged with libel in that case? I dunno, ianal.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I don't think anyone said that at all",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Should I even tell my daughter about this? Would something like this be too much for her to have to worry about?",
        "points": "3 points",
        "children": [
          {
            "comment": "The more info we (and our kids) put online, the easier it is to train an AI to our likness. This is nothing new, deep fakes have been doing this for about a decade. But with neural mesh net \"ai\" becoming more popular, it's getting easier. It's able to correct it's own mistakes if it's given the right reinforcement. The less you put yourself out there, the easier it is to avoid this type of harassment. That being said, there are free tools that can do shockingly \"good\" work with a single well lit photo. It's your call but I would warn my kids that if they are ever going to send explicit images, use a watermark of the receiver's name. 1 for authenticity against ai and 2 you know who leaked the photo.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Jeeze imagine using your brain to do something good for the world instead of just using this stuff to make porn.",
        "points": "3 points",
        "children": [
          {
            "comment": "Middle school boys can’t think straight, lol.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Clear laws are going to have to be defined nationwide for non-consented deepfake porn. The fact that you can pay a few bucks and use a premade model to make porn of anyone, which could potentially ruin their life, is fucking absurd. I especially believe this after seeing SORA.\n\nAnd I say this as somebody who works in AI and has seen tech (experimental and next gen models) that isn’t publicly available yet. It’s gonna get a whole lot weirder.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The boys were charged under a Florida law passed in 2022 that state legislators designed to curb harassment involving deepfake images made using AI-powered tools.\n\nGood.",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm not surprised at all unfortunately. Kids have been doing this kind of stuff for a long time. It's just that ai is so powerful and misuse has larger consequences",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ahhh. Can’t wait for EVERY SCHOOL EVERYWHERE to make rules about taking photos in the hallways of your friends and other random things that don’t relate in order to avoid this problem.\n\nThank god I was saved by ‘gangs’ by my school. Had I worn my hat one extra second backwards I’d totally be related to gangs now.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "His punishment is photo shopping clothes back on the girls, loves it, starts designer clothing line.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is the first time in years that I have seen encouraging news about Florida’s legal system.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In my best Meatball Ron voice:\n\n“Disney!!”",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ofc it was in my state Florida too.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Lol that’s hilarious",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Is there actually laws against this? Google machine says no. (I am against it and hope there is, just wondering)",
        "points": "0 points",
        "children": [
          {
            "comment": "They made pics of middle school kids. What do you think the crime is here?",
            "points": "0 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Maybe if Florida itself, was mature enough to teach human sexuality in the classroom, kids would be more informed and capable of making better decisions.\n\nI won’t need to be told that teenagers don’t have the capacity to support this kind of information. We need to institute reality and understand, they know more than the over the top Christians want to admit.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is cursed.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I feel so lucky to not be a kid in this day and age…",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I graduated high school in 2004. There was a scandal at my school where a couple of guys made a website with images and video of multiple up-skirt or breast shots of teenage girl classmates. The boys were just suspended for a week and had the website taken down. This is going to be really bad.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "A lot of you advocating for csam apparently. If the kids are old enough to use the technology, they’re old enough to deal with the consequences.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I was shocked when I read the court said AI kiddy porn is legal. Seems like this would fall under that?\n\n“The Supreme Court said if an actual child is not involved in the creation of this imagery, then that is protected speech. You can do that.” It's protected speech under the First Amendment to the Constitution.\"\n\nSide note... I'm not pro fake, AII, or real school classmate porn or kiddy porn....just shocked that it wasn't all illegal.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well at least they're learning something. My fear is that the current generation in grade school can hardly read. This is happy news. There talent should be redirected towards more positive pursuits.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Maybe Gov Desanctimonious and Moms for Liberty should start banning computers too. Idiots.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Come on, these are kids doing stupid kid things. Like taking a picture and cutting out the face to stick it on a Playboy model. Yeah it’s gotten more sophisticated but it’s still fake.\n\nPunish them and move on. There’s no need to make them felons.",
        "points": "-7 points",
        "children": [
          {
            "comment": "No, it’s like sticking someone’s face on a playboy model and then handing out copies to a bunch of kids at school. We shouldn’t ever take such incidents lightly",
            "points": "19 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It’s not just doing stupid things. It’s a very serious act of sexual harassment. Events like these have lead to severe bullying which can lead to suicide and self harm of victims and should be handled with a serious and strict response. Doesn’t matter if it’s “fake”. It’s very real to the victims.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yes. Make them felons",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The difference is they're using real minor's faces and disseminating the realistic looking images to their community and thus ruining their reputations and futures.",
            "points": "0 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Kids should just do their damn homework like I did. This is insane.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "FreeDUMB to make nudes. It’s in the Bill of Rights, people.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I use this tech to send my friends pictures of themselves naked. It’s like, hey groupchat, here’s what Josh looks like with a pussy",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I hope we just keep arresting kids instead of just making the service illegal to offer to people to begin with.",
        "points": "0 points",
        "children": [
          {
            "comment": "The cat’s out of the bag with this one unfortunately, you can already do this on software like Stable Diffusion (that is a much more general purpose image generation AI) that can be natively run on pretty much any computer, and can be setup and going in <15 minutes.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "That is Photoshop. It is not AI if a human makes it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Haha stupid kids they deserve that",
        "points": "-6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "These are children being charged with seems like a felony. This is excessive. Kids don’t know better. The parents should monitor online usage but you also can’t hold them accountable for the speed these things are coming around and the ease of access to them even when not home like via cellphones. You can’t block everything.\n\nI think it’s excessive and can ruining kids lives before they even hit highschool.\n\nWe created the technology it’s our job to keep it out of the wrong hands.",
        "points": "-10 points",
        "children": [
          {
            "comment": "I knew better not to create nude images of classmates.",
            "points": "15 points",
            "children": [
              {
                "comment": "Kids I went to high school with got less charges then this for posting real nudes of 17 year olds on anon. So if we are going this far over fake images then we should have went that far back in the day with those instances and we didn’t. No where did. Anon was huge when I was in high school and knot many people were charged.\n\nYou don’t charge kids with felonies unless they kill or really harm someone. It’s just that simple.",
                "points": "-4 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Kids know right from wrong. Saying they don't know better is outlandish. The child victims in these cases don't deserve to have the whole school community, including the adults, passing around nude pictures of them, real or deepfaked. It's gross.",
            "points": "2 points",
            "children": [
              {
                "comment": "How did the kids pay for it? Deepfakes are not free. Please explain how a kid got a credit card. Oh yeah the parents so charge them then. But is that happening? No. Please sit down.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why tf don’t we have laws against AI yet? This should not be a thing the public can just have\n\nEdit: Yall downvoting me are weird lol. Apparently you guys think its ok for fucking schoolchildren to deepfake porn of other children. You guys need a serious hard drive check",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc2rmo",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://arstechnica.com/science/2024/03/shields-up-new-ideas-might-make-active-shielding-viable/",
    "title": "Shields up: New ideas might make active shielding viable. Active shielding was first proposed in the '60s. We’re finally close to making it work.",
    "points": null,
    "comments": [
      {
        "comment": "Some astronaut will finally be able to say “Shields up!”\n\nI’d probably giggle a little at that. XD",
        "points": "44 points",
        "children": [
          {
            "comment": "Red Alert!",
            "points": "4 points",
            "children": [
              {
                "comment": "All hands to battle stations!",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Sir, I'm picking up several ships cumming out of warp!",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "Hmm...",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "“- sir, those arrakis are harboring weapons of ass destruction! - great scott!”",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "You mean wart?",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Captain recommend arm photon torpedoes.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "We unfortunately only have lasers man",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Arm the Jewish space lasers, then!",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Sir, are you absolutely sure? It does mean changing the bulb?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Gonna have to practice my slow blade",
        "points": "34 points",
        "children": [
          {
            "comment": "Harkonen’s be wildin’ out here cuz",
            "points": "10 points",
            "children": [
              {
                "comment": "Muad'Dib will save us",
                "points": "4 points",
                "children": [
                  {
                    "comment": "He’s too humble to admit it, which means he is the mahdi!",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I’ve always wondered what was preventing this tech from being pursued. Huge weight and power requirements would do that…",
        "points": "48 points",
        "children": [
          {
            "comment": "Fusion power, new superconductors, massive improvements to electromagnetic field generation.\n\nStuff like that.",
            "points": "28 points",
            "children": [
              {
                "comment": "You know just a better understanding of the laws of physics nothing big",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "ez pz",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "No weight in space.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "Last I heard of it, SpaceX charged $5,500 per kilogram to get it in space. Making a spaceship with thicker walls increases the launch costs a lot. And there is a max, the article mentions this: \"The solenoid shield got more powerful—the bending power achieved in the most promising configuration grew from 5 Tesla/meter to 11.9 Tesla/meter, but it also grew heavier, hitting 100 tons—over 50 percent above the payload capacity of a Falcon Heavy.\"\n\nAnd then, once in space, it costs more fuel to move around the increased mass.\n\nBTW, there is weight in space. The ISS don't feel weight because they are in orbit around earth. This is similar to how the NASA jet, the vomit comet, doesn't feel weight when it is in a dive.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Build it on the Moon with materials obtained there. Not gonna happen soon though.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "NASA Project Artemis will be building a base on the moon.\n\nhttps://www.nasa.gov/specials/artemis/",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "True there’s a plan, but that’s a long way from building mines, smelters, foundries, machine shops & all the rest of what would be needed. Hmm, considering there’s plenty of water on the Moon, maybe water shielding is not so far-fetched.",
                                "points": "0 points",
                                "children": [
                                  {
                                    "comment": "\"Clive Neal, a geologist at the University of Notre Dame who has studied lunar dust samples, says moon dust or rock may have an especially key role to play in shielding astronauts from radiation from cosmic rays and solar flares. Earth’s atmosphere and magnetic field filter out most of this harmful radiation, but the moon has no atmosphere and no magnetosphere so any humans lingering there need extra protection. Neal says up to six feet of lunar material may be required to provide astronauts sufficient protection from radiation, which at high doses can increase a person’s risk of developing cancer.\"\n\nhttps://www.smithsonianmag.com/science-nature/four-things-weve-learned-about-nasas-planned-base-camp-on-the-moon-180980589/\n\nI don't know the details of the plan at this stage.",
                                    "points": "0 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Already had a working model.\n\nSustainable Energy is the problem not the tech.\n\nN. S",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]