[
  {
    "id": "t3_1bc43dk",
    "subreddit": "r/tech",
    "dataType": "link",
    "dataUrl": "https://www.macrumors.com/2024/03/11/airpods-pro-to-gain-hearing-aid-mode-ios-18/",
    "title": "AirPods Pro to Gain 'Hearing Aid Mode' in iOS 18",
    "points": null,
    "comments": [
      {
        "comment": "cut to: thousands of ios users discovering they needed hearing aids all this time",
        "points": "107 points",
        "children": [
          {
            "comment": "WHAT’D YOU SAY?!",
            "points": "24 points",
            "children": [
              {
                "comment": "HEY SIRI, WHAT DID THEY SAY?",
                "points": "8 points",
                "children": [
                  {
                    "comment": "cut to: thousands of ios users discovering they needed hearing aids all this time",
                    "points": "10 points",
                    "children": [
                      {
                        "comment": "turns off noise cancellation",
                        "points": "3 points",
                        "children": [
                          {
                            "comment": "WHAAAAAAAAAT???",
                            "points": "4 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Stop yelling at us",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "As a hearing aid user, I can’t wait for this. The sound quality on any set of hearing aids is laughable. Hearing life through a megaphone.",
        "points": "183 points",
        "children": [
          {
            "comment": "Think it’s cool too for self conscious kids. This will for sure make some hearing aid users much less self conscious to put them in I’d think. Pretty sweet.",
            "points": "82 points",
            "children": [
              {
                "comment": "I’m 33 and was self conscious of hearing aids until a year ago. I realized my quality of life was severely affected by not wearing them. I rock them now but it’s very hard to use them with the quality of sound. My father has two cochlear implants, I watched people treat him differently his whole life because of it. I wanted to avoid that but not being able to take part is daily conversation or guessing what I just heard got old quick.",
                "points": "32 points",
                "children": [
                  {
                    "comment": "Oh this is exactly me. Also the age fits. The AirPods Pro sound so way better",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "i'm sorry to be ignorant, but why did people treat your father differently because of his implants? Is there something implied?",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "I think generally people who have devices to help them whether it be hearing aids to a walk cane. You get treated differently. Generally speaking from my pov growing up. People would just treat him as if he was slow, unable to comprehend things, etc.",
                        "points": "4 points",
                        "children": [
                          {
                            "comment": "ah, I understand. My father refuses to get hearing aids even though it's extremely obvious he can't hear and makes people misunderstand that he's being rude. I never understood where that came from but this gives me some perspective, thank you.",
                            "points": "2 points",
                            "children": [
                              {
                                "comment": "I’m eagerly awaiting this update, as we’ve purchased my dad AirPod pros. Man can’t hear anything in the upper registers anymore, including most women’s voices. He uses his AirPods, so maybe that’s how we trick the old fart into hearing aids.",
                                "points": "2 points",
                                "children": [
                                  {
                                    "comment": "good luck to the both of us!",
                                    "points": "0 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              },
                              {
                                "comment": "Sounds like my dad! Lol",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Sadly, it honestly can become annoying trying to communicate with someone hard of hearing if you aren't used to it & a lot of people just don't really know how to gracefully handle that. Like others said hearing aids sound really bad so whatever you say still has to be spoken really clear and loud",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "i understand, it's tough hearing people literally shout at my dad while he has no clue. Didn't know hearing aids were that bad though! damn.",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I’m in the same camp as you but only tried otc hearing aids. I heard about the pros getting the features and doing well in tests so this is pretty exciting.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Can't wait for the articles about teachers taking away students' \"hearing aids\", because they're literally AirPods. That's gonna be a fun landmine for teachers to walk into, and kids will definitely abuse it.",
                "points": "11 points",
                "children": [
                  {
                    "comment": "A diagnosis is required for wearing in class.\n\nSimple. I vividly remember doing multiple hearing tests while at school. They have records of it.",
                    "points": "11 points",
                    "children": [
                      {
                        "comment": "I CANT HEAR YOU BURGER KING",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I’m not deaf but have 10% hearing in one ear and 50% in the other. I can barely see mine when they’re in, the electronic compartment is black and the plugs translucent. You’d actually have to look for them to be seen but I don’t like wearing them because the world sounds weird and overly loud with them in, even when on low.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I have some Oticon hearing aids and they work amazingly well. They’re customized for my hearing and have changed my life. The unfortunately part is they’re also crazy expensive. I don’t see Apple being able to compete with higher end hearing aids, but it sure would be nice to see.",
            "points": "5 points",
            "children": [
              {
                "comment": "I have Rextons from Costco. Also tailored to my hearing. Never realized I lost my ability to hear birds chirping until I started wearing mine.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Birds still chirp?",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "I was stunned.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "My Oticons have been life changing as well.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "These have been life-changing for my father too, in that they only last maybe six hours per charge, and they randomly disconnect from his iPhone for no apparent reason and then need some complex reset process to reconnect. After a year of using them he regrets moving away from his old \"dumb\" hearing aids which lasted months per battery and didn't need any sort of connection process.\n\nI think the sweet spot is a hearing aid with at least a week's worth of battery life, with benefits from a phone connection eg being able to treat it as a Bluetooth headset and fine-tune its performance, but not requiring the phone and especially not turning itself off whenever disconnected from the phone.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Love oticon. (Audiologist here)",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I have these as well",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Hey u/craigbeau, I’m also a hearing aid user. I think you might be using bad hearing aids if that’s you’re experience. I’ve had a few kinds, with my favorite being the Costco partnership ones. After getting them custom tuned through an audiologist, it is amazing! Which have you tried?",
            "points": "6 points",
            "children": [
              {
                "comment": "I have Rexton now that we’re tuned at Costco",
                "points": "1 point",
                "children": [
                  {
                    "comment": "My mom does too and she hasn’t had a great experience with them either.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "What brand do you currently use?",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Currently using the Costco x Phonak ones. I love them. I use the ear tips that allow a lot of sound through, so I still hear naturally + have the added effect of the hearing aids. I personally find them very good, as someone who is into sound engineering and music. I prefer listening/producing with them in.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Hmm, those are ones they can prescribe? I had to have ear molds made to block outside noses because everything was getting lost in the mix of natural and unnatural sounds.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Yup! They’re the “Kirkland 10.0” series they have right now. The ear tips are just at any of the Costco hearing centers by request - they’re the rubber tips that you put on the end, and they gave me a bunch for free. It comes down to how well they match the hearing aids to your hearing loss curve. If they are adding back in sounds you already hear fine, then you’re getting it doubled. The ideal settings will only give you sound that you are not hearing without them.\n\nMind you, I don’t know how severe your hearing is and if you use the same type (Bluetooth ear piece/small speaker wire into the ear).",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I think it’s very specific to the user. I currently have Jabras from Costco custom-tuned, and while they do help me hear conversation better in quiet environments, in a restaurant or in the street they almost do more harm than good by amplifying everything I DON’T want to hear. I gave up on using the Bluetooth capabilities as the volume is almost inaudible and sounds like someone is speaking through a very tinny airport PA system. It’s infuriating. For the amount of money these cost, the benefit seems really small.\n\nReally hoping that Apple might bring some improvement to the field- I’d love to try the AirPods, but my ear canals are so small I’ve never been able to make the earbud style headphones stay in my ears even with the smallest tips.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "If you have AirPod Pro, you can use it as a rudimentary hearing aid right now: https://www.techradar.com/how-to/how-to-use-your-apple-airpods-pro-as-hearing-aids\n\nIt also works with any headphones if you use an iPhone, but apparently is the best with the Pro.",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yeah I’ve avoided hearing AIDS for the longest time",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "As a hearing aid dispensing professional for the last 2 decades, I can’t wait for this.",
            "points": "2 points",
            "children": [
              {
                "comment": "Did you always find it weird how the technology isn’t on par for what headphones can do now a days?",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Audiologist here. Just curious what brand you have and how old they are. Always down for feedback (except acoustic feedback of course).\n\nEdit: Jk found it. I agree try Oticon when you are ready.",
            "points": "1 point",
            "children": [
              {
                "comment": "I have Rexton and they are brand new",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Honestly if it’s been within the last 45 days you should exchange for Starkey, Phonak, Resound, Oticon, or Unitron. Those are the good ones. I prefer Oticon or Starkey. They have a unique processing that makes speech sound more natural.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "When referring to music?",
            "points": "0 points",
            "children": [
              {
                "comment": "Everything, every sound you hear. It’s not natural in anyway.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "What makes you think air pods will be better?",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "There was once a time when I was able to uploaded my hearing test results and the AirPods would adjust accordingly. I think just the fact that AirPods have better audio technology is enough for me to be hopeful.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Sorry to see that’s been your experience this far.. What hearing aids do you have experience with? I’ve lived with two brands over the last 8 years, just changing to what I have in December. I am not having the same experience you are at all.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I have Rexton from Costco",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I can hear my father in laws hearing aid chirp. He barely notices it.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This is fantastic … I hope the battery life is improved also",
        "points": "28 points",
        "children": [
          {
            "comment": "I have a conductive hearing loss (sometimes my hearing is bad- sometimes it's not)\n\nI'm interested to see how well this works in that use case-- only having them at meetings - etc",
            "points": "5 points",
            "children": [
              {
                "comment": "Yeah, meetings can be problems for me too. Especially large conference rooms",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Spy mode. As a sociopath I welcome the ability to eavesdrop undetected.",
        "points": "106 points",
        "children": [
          {
            "comment": "From what I read it’s pretty much only people standing directly in front of you within normal conversational range.\n\nSo less “Spy Mode” and more “Standing beside someone and clearly eavesdropping”",
            "points": "47 points",
            "children": [
              {
                "comment": "In a packed bus or metro, that’s still pretty sneaky listening in on conversations",
                "points": "20 points",
                "children": [
                  {
                    "comment": "A packed bus or metro you might get too much and be bombarded by random conversations. Reminds me of the fear of being able to read mines and not control it.",
                    "points": "12 points",
                    "children": [
                      {
                        "comment": "Actually, AFAIK, apple already has spy mode on Airpods already! Look up “Live Listen” under the settings lol if you have airpods, and dont mind losing them you can leave em wherever and listen in if it’s in range of the phone.\n\nYou can even add it as an accessibility shortcut in the control center menu on iphones. 🧐",
                        "points": "10 points",
                        "children": [
                          {
                            "comment": "It’s the other way around. Live the phone wherever and listen on the airpods.",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "You can do that with regular hearing aids and it’s actually legitimately useful.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "mines",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "You can kinda do it with live listen. I have hearing aids that use my phone to control them. Resound Customs. Amazing devices.\n\nWhen I’m in noisy places for meetings and such I just toss my phone in the middle of the table with live listen on and all the iPhone mics pick up sound and transmit it to my hearing aides.\n\nSo one could just hide their phone somewhere with it on and eaves drop from another room as long as the BT signal held.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "You can kinda do it with live listen. I have hearing aids that use my phone to control them. Resound Customs. Amazing devices.\n\nWhen I’m in noisy places for meetings and such I just toss my phone in the middle of the table with live listen on and all the iPhone mics pick up sound and transmit it to my hearing aides.\n\nSo one could just hide their phone somewhere with it on and eaves drop from another room as long as the BT signal held.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "You can already do this with AirPods, it’s called live listen. You can put your phone anywhere within Bluetooth reach and listen in.\n\nHad to use it for a bit while in between hearing aids. Great for those non-sociopath types in large lecture halls.",
            "points": "4 points",
            "children": [
              {
                "comment": "Did you put the phone on the teacher's desk, or how does that work in this particular scenario?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Spy mode is called live listen. You leave your phone where you want to hear and listen through the AirPods. It’s honestly no better than those cheap as seen on tv or hunting hearing aids for hearing leaves drop at 30 yards.",
            "points": "4 points",
            "children": [
              {
                "comment": "I have AirPods Pro and I had no idea they did this. Thanks for the info.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Welcome",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It's of limited use, better to stick to eating tin.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "They already have that feature. You can amplify speech and other sounds",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "And since you could get yourself an iPhone and Airpods Pro starting at about $1000, that makes them marginally cheaper than most \"medical\" hearing aids too.",
        "points": "20 points",
        "children": [
          {
            "comment": "Prescription hearing aids ran me $3700. Nothing marginal about that.",
            "points": "10 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Prescription hearing aids ran me $3700. Nothing marginal about that.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "For about $629 you can get an iPhone SE and AirPods Pro brand new.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "That’s a third of the price of one hearing aid",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Heck, 2/3 already have the iPhone",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You can spend a lot less if you get a used one.",
            "points": "0 points",
            "children": [
              {
                "comment": "I'd feel a bit ghoulish doing that. :p",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Pierce really was streets ahead. Ear-noculars are going mainstream.",
        "points": "28 points",
        "children": [
          {
            "comment": "Nobody says streets ahead.",
            "points": "10 points",
            "children": [
              {
                "comment": "Then they're streets behind!",
                "points": "13 points",
                "children": [
                  {
                    "comment": "🏅",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Streets a-go-go",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This will be nice since as a Vet I’ve had to wear hearing aids since my 20’s so control the sound of freedom ringing. It having to switch out to these back and forth will be nice.",
        "points": "8 points",
        "children": [
          {
            "comment": "EEEEEEEEEEEEEEEEEEEEEEEE 10k hz… it’d help me out for sure.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I hope than can come up with another design as well to allow people to sleep with them in and still be comfortable.",
        "points": "12 points",
        "children": [
          {
            "comment": "So my problem is I keep falling asleep with them in and then I have to search the whole bed the next morning",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Surprisingly to me I would consider a custom IEM made by Apple if they came with all of the features of pros",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It would be great if it just let me use one AirPod without having to toggle it on each night.",
        "points": "5 points",
        "children": [
          {
            "comment": "I have both Signia Styletto ($2500) and AirPod pro 1&2. $200-250. My hot take:\n\nSS- above average all around for hearing the outside world, easy all day battery life. Fit is comfortable and don’t fall out. Listening to music is just average off the shelf $25 ear buds, disgraceful lol.\n\nAPP1- battery life is about 4 hours with noise cancellation, maybe 6 at most on transparency ( hearing aid mode I call it).\n\nI was able to import my Audiogram from the ENT office and that made a difference in how I heard things.\n\nI can adjust how bright or dark I want the sounds and add in backgrounds sounds like ocean or fuzz. That part is ok.\n\n!!!Theres an app by ReSound for tinnitus that I prefer for my fuzz noise, water, wind etc. that really helps with tuning out the tinnitus. !!!\n\nAPP2 - way better than APP1and SS in sound quality. Battery life is about 5 hours max on NC and 7 for adaptive / transparency mode.\n\nTheres a new feature called conversational awareness that I dig. I can use noise cancelling and go about my day and when someone talks to me, my music will pause while I’m in conversation. This is super if you’re a caregiver.\n\nSound quality for music is much better than the others but I’ve also had $120 wired IEM that blow these away. But we are speaking in terms of multi-factor use so those are disqualified.\n\nNow that there are over the counter hearing aids in the USA I think we will see some price drops finally and competition.\n\nCash cost for programming hearing aids is insane and most insurance doesn’t cover it. $600 just to program them.\n\nConsumers can use an app like Mimi and get a decent audiogram that can be applied through iOS and I’m assuming Samsung has this by now too.\n\nTLDR: I’ll take 2 pairs of AirPod pro 2, one in my ears and the other in the charge case. They are more adaptable for my needs. Super cheap compared to $2400 plus $600 programming.\n\nI spent $480 and got a 4 year warranty through Walmart for both pairs.",
            "points": "3 points",
            "children": [
              {
                "comment": "You don’t need to use an additional app for the tinnitus help. If you pull down on right top for that menu and click the ear button then you can play different tones and noises if you weren’t aware.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Yes, I prefer the ReSound app as I can make custom mixes with multiple noises and sounds. It’s definitely worth getting.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I’ll look into it.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Don’t they do this already?\n\nThere are many setting in existing AirPod pros that help as hearing aids. You can even upload to your phone the tests graphs for your hearing from a professional audiologist.\n\nI have a relative using them and he is really happy with it.\n\nFor a fraction of the cost of dedicated hearing aids it works really well.\n\nOnly downside is battery life: it is very limited compared to hearing aids.\n\nI wonder what this update brings to the table.",
        "points": "5 points",
        "children": [
          {
            "comment": "The mode probably just makes it easier to enable whatever settings that need to be changed so you can switch between as needed.\n\nIn the Labs section of Galaxy Wearable there's an option for boosted Ambient Mode which basically makes them hearing aids, so I don't think this is anything new, just wording.",
            "points": "0 points",
            "children": [
              {
                "comment": "You are probably right.\n\nAnd this article talks about FDA approval but quite frankly I think it is badly written I couldn’t really follow it.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I really hope this happens, so much emphasis is placed on augmented reality vision, but augmented reality hearing, can have actual instant benefits. From preventing hearing loss in loud places, to voice clarity enhancing for conversations. Personalized sound stages. Directional hearing. Singing in tune.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As someone who has hearing aids (currently phonak audio L90-R, Oticon opn 1 before that) I’ll be curious just how good this software and feature set will be. It may be very generic, as there is a ton that goes into actual hearing aids, the software and hardware that make them work. Either way, if it helps people in anyway shape or form it will be an absolute win.\n\nPSA, working with an audiologist and getting hearing aids was LIFE CHANGING for me and my family/friends/colleagues who “dealt with” my hearing loss. I encourage anyone who has hearing problems to look into it. You have to set your ego aside, it’s not a weakness and no one will care that you have this issue. If you don’t have the means, there are charities that can help as people donate older models as they update/upgrade.",
        "points": "4 points",
        "children": [
          {
            "comment": "look forward to your review",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Anything on tinnitus",
        "points": "2 points",
        "children": [
          {
            "comment": "iPhone already has this when you connect a hearing aid.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Hearing aids are very rarely covered by insurance, FYI",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What?",
        "points": "6 points",
        "children": [
          {
            "comment": "This comment is so unheard of",
            "points": "9 points",
            "children": [
              {
                "comment": "Ah, you hear me!",
                "points": "3 points",
                "children": [
                  {
                    "comment": "What?!",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "THEY SAID “APPLE IS MAKING AIDS NOW”!!",
            "points": "2 points",
            "children": [
              {
                "comment": "Huh",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Read the fucking article. Do you not have reading comprehension?\n\n-Billy Gnosis",
            "points": "-1 points",
            "children": [
              {
                "comment": "whooooooshhhhhhh",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "WHAT?",
                "points": "3 points",
                "children": [
                  {
                    "comment": "huh?\n\n-Billy Gnosis",
                    "points": "-4 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": true
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Would be great! I imagine its helps me hear people over the tinnitus constantly ringing.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As is usual, Apple reinvents something already on the market but are generally more successful doing so.. it’s why I buy the stock lol",
        "points": "1 point",
        "children": [
          {
            "comment": "If anyone can successfully market hearing aids, it’s Apple.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "As a person with only one ear, I would be happy if they could create single pods, because the micro and stuff don’t work very well on the left side with the right side on the box.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My friend with poor hearing tried my aeropex bone conduction headphones and found them really clear for podcasts. But we tried going direct mic-to-headset and every way we tried just had way too much latency to be useful as a hearing aid.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I can see this causing issues in schools with teachers unaware that they actually can be used as hearing aids. I see lots of stories of kids with diabetes phones being taken away despite using it to track blood sugar levels.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My husband hears better with these than his 3000 hear aids",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "One of my family members already uses them to abate noise so they can hear conversations they are a part of better. That + Clarity Boost should be a game changer.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I use AirPod Pros Bluetooth linked to my Eko stethoscope at work. It’s much clearer than using the traditional stethoscope earpieces with the tubing. I’m kinda looking forward to this new upgrade",
        "points": "1 point",
        "children": [
          {
            "comment": "That’s honestly so cool",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I have zero faith in this. They can't even figure out how to deal with wind noise.",
        "points": "2 points",
        "children": [
          {
            "comment": "Huh",
            "points": "0 points",
            "children": [
              {
                "comment": "Noise cancelation doesn’t work nearly well enough on the AirPod pros. If they can’t figure out how noise cancellation works I doubt t they have the ability to turn their devices into hearing aids.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "I have zero problems with noise cancellation. Have you tried different fits? I did notice before I switched to a different type of tip, it was noisy.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Galaxy Buds have an option for this, it’s just not called Hearing Aid Mode. It works ok.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Will it be a simple software update? Or new hardware?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Looks like they got me. I’ll be purchasing.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I want to hear each and every raindrop.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "WHAAAT?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They should fix audio drifting first",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Will it be medical grade tuned for each ear, etc....it's starting to look like one of those midnight miracle aids commercials I used to see onnTV which basically amplified sound for the people with hearing issues but were not medically tuned to your ranges it was basically set to some basic ranges of hearing...even after this if you still had issues you need medical grade hearing aids...",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m still waiting for real time captioning to glasses. If siri and dictation can generally hear and write out what you say why can’t this be used for hard of hearing?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Surprised it took this long",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Will have to keep an eye on this, my mum has issues with her hearing aid, with its cost and battery, may be worth me buying it for her if it means a majorly improved user experience and quality of life.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why bother? My Jabra hearing aids do fine and they come with a government subsidy",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Cool. This’ll help me hear stuff after seeing the Crucifux back in the mid 90s.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As an HIS… this wont replace hearing aids nor be as good as them as hearing aids are programmed to your hearing loss. Yes costly but worth it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I might finally move back to iPhone.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I misread this as \"hearing God mode\" 🤣 imma go to bed now",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have tinnitus and the transparency mode helps a lot with managing the associated hyperacusis",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Intrigued to know how the software will deal with range isolation, tonal variation and loudness. If Apple have a way to replicate the software in a hearing aid, then this will be great. If they're just amplifying noise, then this is a gimmick and one which will make hearing people think \"oh, that'll help the Deaf, because they're all the same and just need it turned up to 11.\"",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wauw this is amazing",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hard pass. Mine lasted about a year. Just give me the cords. I’ve had the same corded ones for about 5 years.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My plantronics bluetooth from 2011 had that same feature 😑",
        "points": "-19 points",
        "children": [
          {
            "comment": "And cars 60 years ago had doors, and guess what? We still have doors, and they’re better now",
            "points": "16 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "And if my grandmother had wheels, she would have been a bike",
            "points": "15 points",
            "children": [
              {
                "comment": "Oh Gino! Staaaahp!",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Where can I buy one?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "You ride your grandmother?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I could buy device specifically for this out of a shady ice cream truck that also sold fake pokemon cards in 2000. Whats your point?\n\nIt’s an accessibility feature being added into the most popular wireless headphones, which is a good thing.",
            "points": "7 points",
            "children": [
              {
                "comment": "I think his point is that it's nothing new and options already allow AirPods to be configured in such a way. Doubtful that anything new is being added, it's just easier to switch them on and off as them.\n\nGalaxy Buds also have a boosted ambient mode. Won't be surprised when it gets renamed to Hearing Aid Mode after they see Apple doing the same.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Weird since no, they didnt figuring this would be the first to be FDA approved",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "And sounded like ass",
            "points": "-1 points",
            "children": [
              {
                "comment": "r/sounding",
                "points": "-4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Congratulations! do you still use them from 2011?",
            "points": "-2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I have Galaxy Buds and there’s in option in Wearable that boosts surrounding sound. First thing I thought of was how well it would work as a hearing aid. Guess Apple finally caught up?",
        "points": "-2 points",
        "children": [
          {
            "comment": "lol as usual, Apple has had what you’re talking about for years before galaxy buds were even out.\n\nThis is an FDA approved, full hearing aid built into the AirPod. Reading the article you’re commenting on is helpful :)",
            "points": "1 point",
            "children": [
              {
                "comment": "FDA approval? Oh that seals the deal, Apple is the best! /s",
                "points": "0 points",
                "children": [
                  {
                    "comment": "That’s what the article you’re commenting is about….",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Tbh I don’t care, don’t like the way you came off.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The most overrated and overpriced product",
        "points": "-18 points",
        "children": [
          {
            "comment": "I got them since 2016, the best apple \"thing\" they ever invented.\n\nSo yeah, I disagree.",
            "points": "12 points",
            "children": [
              {
                "comment": "Plenty of better sounding earbuds out there.",
                "points": "-6 points",
                "children": [
                  {
                    "comment": "Go piss somewhere else, fool.\n\n-Billy Gnosis",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "Awww did my opinion hurt your feelings?",
                        "points": "-4 points",
                        "children": [
                          {
                            "comment": "The Cure- Apart (1992 live) .mp3\n\n-Billy Gnosis",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The AirPods??",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1bc41sb",
    "subreddit": "r/tech",
    "dataType": "link",
    "dataUrl": "https://interestingengineering.com/science/diamonds-conducting-electricity-china",
    "title": "Chinese researchers turn diamonds into good conductors of electricity | Scientists used graphene, another form of carbon, but a good conductor of electricity to transform their new diamonds into conductors.",
    "points": null,
    "comments": [
      {
        "comment": "Dr. Frieze has had this technology for decades now.",
        "points": "9 points",
        "children": [
          {
            "comment": "Yeah this isn’t new. Cool, but not new.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Soon, it’ll be diamond wires….. make copper thievery look like child’s play by comparison.",
        "points": "1 point",
        "children": [
          {
            "comment": "If diamond manufacturing is at the level we are making cables from it, the jewellery diamond market will be extinct. Diamonds are not rare, I have a $30 saw blade covered with diamond.",
            "points": "4 points",
            "children": [
              {
                "comment": "$30 is a shitty diamond blade though",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Diamonds have always been able to conduct Electricity, they have also been used as timing chips in experiments but were too deemed too expensive to be used in commercial products, artificial diamonds tend to be easier to mass produce with a uniform consistency that nature generally does not provide and in the old days specialized stone cutters and mappings of occlusions was required to get a product consistency in natural diamonds.\n\nMore Stolen Technology?\n\nN. Shadows",
        "points": "3 points",
        "children": [
          {
            "comment": "Natural diamond = blood diamond",
            "points": "5 points",
            "children": [
              {
                "comment": "Diamonds mines in industrial operations are conflict and injury free. Russia, Botswana, South Africa, and Canada produce the vast majority of diamonds.\n\nThe problem is even with Kimberley Process and jewellers telling you they can trace their diamonds, (e.g. Tiffany) diamonds are basically untraceable and conflict diamonds are easily slipped into the clean product stream and mixed in. Which you can do with lab grown diamonds too.\n\nSource: I am a consultant for a diamond mine. I wanted a diamond from the mine I work at. I tried really hard to find a jeweller that traces their diamonds back to that specific mine. There are so many degrees of separation between mine and consumer that really nobody can unless they’re vertically integrated. At best, Tiffany can tell you a country of origin… which doesn’t cut it for me.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "Tbh you sound like a mined diamond shill just saying",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Blood diamonds are real and will continue to exist even if the manufactured diamonds made commercial mines shut down.\n\nI’m not a shill for nothing. Diamonds are fucking stupid. Carbon tetrahedral is carbon tetrahedral whether that’s from a legitimate mine, a sub Saharan warlord, or a factory. I just wanted a token of my handiwork.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Thank you for the beginning of an interesting research journey your comment sent me on lol. I was curious what would diamonds effective timing chips and the rabbithole only widened from there",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "ikr, they’re making it seem like they’re the first one to know about it. typical chinese propaganda. i’m getting tired of their bs.",
            "points": "0 points",
            "children": [
              {
                "comment": "How is this propaganda Wtf ?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I wonder if they can merge the latest graphene battery technology and this and create some real cool stuff",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]