[
  {
    "id": "t3_19er40f",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19er40f/where_else_can_i_play_with_llms_or_other_ai/",
    "title": "Where else can I play with LLMs or other AI?",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19eqjx9",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19eqjx9/is_musical_instinct_innate_ai_model_suggests_so/",
    "title": "Is Musical Instinct Innate? AI Model Suggests So.",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19eotnt",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "https://www.pcgamer.com/the-key-thing-is-that-the-good-guys-have-better-ais-than-the-bad-guys-says-microsoft-founder-bill-gates-on-the-threat-from-artificial-intelligence/",
    "title": "'The key thing is that the good guys have better AIs than the bad guys' says Microsoft founder Bill Gates on the threat from artificial intelligence",
    "points": null,
    "comments": [
      {
        "comment": "Oh ya, no problem. Just hope the good guys have better AI than the bad guys. And if they don't, were all fucked.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don't think a multibillionaire is a good candidate to decide who's a \"good\" or \"bad\" guy IMO. Having that kind of wealth in the hands of a single person in of itself is a bad thing for society.",
        "points": "7 points",
        "children": [
          {
            "comment": "better candidate than you",
            "points": "-3 points",
            "children": [
              {
                "comment": "Why???",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It's fine guys my AI is \"Good\" don't worry. - Tech Billionaires completely disconnected from the world.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "lol Microsoft thinks they are the good guys?",
        "points": "4 points",
        "children": [
          {
            "comment": "The W#st thinks they're the good guys",
            "points": "-2 points",
            "children": [
              {
                "comment": "Well, it’s not Russia, Iran, or China 🤷🏻‍♂️",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "The US Has Been at war for 225 out of 243 years since its inception in 1776. Let that sink in...\n\nRussia iran and china combined dont even come close to the amount of people the \"civilized\", \"enlightened\" western world has killed in the last 20 years to secure the interests of their top 0.0001%.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "ever hear of openai?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "'The key thing is that the good guys have better AIs than the bad guys, [so I'm setting up the good guy AI on Epstein's Island].",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Now we need to figure out who’s the good guys and who’s the bad ones.",
        "points": "1 point",
        "children": [
          {
            "comment": "great point! we good guys aren't nearly as good as we need to be. interestingly, in the end ai will be our leader for this. more intelligence usually translates to better behavior.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Good guys 🤣",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yes, this is the key thing. And computational density supremacy.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We are soooooooooooooo fucked",
        "points": "1 point",
        "children": [
          {
            "comment": "ha. maybe the bad guys.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "So the guy who stole the proprietary product he built Microsoft with from his best friend. Said best friend then killed himself after it ruined his life. What a “good guy”",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Is that a change management statement for 8 year olds? He used “good guys” and “bad guys”? Seriously?!!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If there's one person you should assume isn't a good guy, it's Bill Gates.\n\nWhat happened on the island, Bill?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"Whenever you have innovations they're kind of neutral, in a way, and they can end up empowering just the rich, or they can end up having unexpected negative side effects”\n\nI don’t see how you can prevent it from mainly empowering the rich as long as it is in the hand of big corporations.\n\nUnless the world can come together on this to develop AI who is working in the interest of all mankind It’s going to be a race to the bottom, like it always is with big businesses.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There are no good guys.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Looks like Bill found himself a new gift, :D I guess selling porta cabins in Africa and \"You own nothing and be happy\" wore out. Has to feed the ego with something, right?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19emry7",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19emry7/what_exactly_should_i_learn_as_someone_new_in_ai/",
    "title": "what exactly should I learn as someone new in AI?",
    "points": null,
    "comments": [
      {
        "comment": "The best thing I did was Andrej Karpathy (of OpenAI, Tesla fame) YouTube series from zero to hero. \n\n6 hours, but it could well take you 6 days to fully grasp. He took 6 days to make it for sure.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Developer's POV? You can't go wrong with Practical Deep Learning for Coders by fast.ai. Look no further, follow the course rigorously, go for their second course on Stable Diffusion (if you want/can), implement a few small scale version of papers from arXiv, Papers With Code is a good place to find something you might be interested in, and you'll be ahead of most ML/AI professionals.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All the courses are still super relevant. What you need to learn is math, statistics, and linear algebra.\n\nBut if you wanna jump straight to it you can install pytorch and learn how to use it from tutorials",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It depends on what you want to do with AI. There are multiple AI fields that are fit for different use cases, so you should learn about them first and decide which fits best for you. And there are also multiple solutions that at different levels of abstraction and difficulty.\n\nYou have a few options to consider. Here's a non-exhaustive list of options going from easy to difficult:\n\nUsing APIs like OpenAI APIs. By far the easiest option of all.\nUsing fully managed solutions from cloud providers like AWS or Azure that use ML under the hood but don't expose all its complexity\nUsing managed ML environments from cloud providers or other platforms to run existing models, e.g. models from HuggingFace and fine-tune foundational models (e.g. from cloud provider or HuggingFace)\nWorking locally with tiny opensource models (so no cloud compute and associated skills necessary)\nActually training a new model from scratch, which requires a lot more fundamental knowledge than any of the options above and a sizable budget to spend on compute\n\nI think this visual introduction to machine learning is good to build an intuition: A visual introduction to machine learning (r2d3.us)\n\nFor reinforcement learning, there are additional considerations to take, but you're not going to get there so fast anyway. If you're a masochist and want to go into this right now anyway, you should also eventually learn about deep reinforcement learning, a combination of RL and DL for which OpenAI has set up a decent site: Introduction — Spinning Up documentation (openai.com)\n\nA tip: never buy courses that teach you \"AI\". You can't teach AI holistically. The course should always be about a specific field/subset/area of AI.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19emlaw",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19emlaw/how_can_you_see_ai_influencing_your_regular/",
    "title": "How can you see AI influencing your regular everyday life/job in the future?",
    "points": null,
    "comments": [
      {
        "comment": "The other day, I got ChatGPT 4 to get an estimate of the total number of guns in the US, the total number of fatal and non-fatal gun-related injuries, and figure up (assuming that each gun is involved in no more than one injury, and that all guns are equally likely to be involved in an injury) how long the average gun in the US exists before it is ever involved in hurting someone. The answer is 2,941 years.\n\nIn a given 100 year time frame, 96.6% of all guns in the US are never involved in harming anyone, intentionally or accidentally. I really did not expect that. I was expecting the answer to be a few years, at most.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI Assistant in an ear piece/smart watch combo. Now that the health tech in watches is getting better and better, having an AI assistant that can actively monitor and help you make healthier eating choices and create ideal workouts for your lifestyle is going to be a game changer. I don't even think this is that ridiculous of an ask, and wouldn't be surprised if it isn't far off. That combined with having an assistant for at home projects, both keeping me on track and helping me operationalize tasks I think will make my life significantly easier.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's going to change everything about computers. It's going to change a lot of jobs, the economy, democracy. It's going to be like the computer in star trek.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19elk67",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19elk67/looking_for_a_way_to_scan_and_list_pokémon_cards/",
    "title": "Looking for a way to scan and list Pokémon cards automatically?",
    "points": null,
    "comments": [
      {
        "comment": "Find a vendor that offers an equitable rate for sorting and grading them for you.\n\nAs a long-time MtG player, I've seen countless people elect to use the \"X% of value in cash\" bulk selling option rather than try and handle individual sales of each money card/bulk box.\n\nIt's basically a cost/benefit analysis of how much time it would take to handle yourself vs how much return you make.",
        "points": "-2 points",
        "children": [
          {
            "comment": "Well I could really do with maximizing the profit so will be looking to sell individually which is why I'm looking to make that as efficient as possible!",
            "points": "0 points",
            "children": [
              {
                "comment": "Have you accounted the time and cash cost of handling and posting each individual card/sale?\n\nOnly cards over a certain value will yield a return that outcompetes the \"X% off\" bulk selling. Unless you have 10,000 money cards it sounds like maximising gains is gonna cost you way more time and effort than it's worth to do so.\n\nIf you wanna open up the discussion to people more knowledgeable than I, r/mtgfinance are very wise on these things :)",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Here's a sneak peek of /r/mtgfinance using the top posts of the year!\n\n#1: 1/1 ring pulled and graded already by PSA at a 9 | 654 comments\n#2: My best holds yet | 176 comments\n#3: Is Commander Masters ACTUALLY worth it? We calculate the expected value and probability distribution to find out!\n\nI'm a bot, beep boop | Downvote to remove | Contact | Info | Opt-out | GitHub",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Sorry I should have stated I will be selling any with value individually and bulk selling the rest. But I probably have a good few hundred minimum that are worth selling individually. Not really looking for card advice, more automation advice if it's even possible! I know I can scan all the cards in which will be convertible to excel but I'd manually have to photograph them.. if somehow the scanner could take a photo at the same time that would be amazing",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Ahh I see! Yeah, your best bet is probably a collection scanning app, especially if you can find one that can batch process multiple cards in one image.\n\nIt sounds like it'll come down to that whole \"Fast, Good, Cheap, Pick two\" kinda situations.\n\nWishing you good luck in your search!",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Idk if I would trust them not to \"lose\" or swap a couple cards that OP didn't even know he had in his 10k card deck. Idc how many good reviews you got or how big your company is. Incompetence and greed is around every corner, so OP would STILL have to do his due diligence.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "IS there a current database that has the current prices | names of cards in circulation with information about them?\n\nI can't think of a fast scanner that would do this without bending the cards, so individual scanning will probably have to happen. You can probably use Google Lens and setup a program to analyze and sort the cards you have by page into a database, then use GPT4 to fill in the information from the scan and compare it to a database of information, however you need that database of current up to date pricing and information first.",
        "points": "0 points",
        "children": [
          {
            "comment": "That sounds interesting 🤔\n\nSo there is several databases that have the current prices tcgplayer has them pokecardvalue.com is another.\n\nThe tcgplayer scanner is really quick and actually recognizes the card with a price etc but doesn't take a photo of the card which would be needed to show the condition etc",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19eibjm",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19eibjm/can_anyone_explain/",
    "title": "Can anyone explain?",
    "points": null,
    "comments": [
      {
        "comment": "I din't think they were ready for the demand to be as high as it is, they will struggle to keep up",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19ei5yy",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19ei5yy/bias_or_wisdom_in_llms_does_gpt4_have_a_bias/",
    "title": "Bias or Wisdom in LLMs? Does GPT-4 have a bias towards technocracy? Is this method relevant for detecting biases in LLMs?”",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19edyth",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19edyth/is_there_a_centralised_place_to_track_ai/",
    "title": "Is there a centralised place to track AI inventions?",
    "points": null,
    "comments": [
      {
        "comment": "We need something like this if it doesn't already exist.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI Explained does a very concise and no BS videos on uploading videos that matters in AI",
        "points": "4 points",
        "children": [
          {
            "comment": "Well yes, but he only covers the big things. We need something that can track the small things too, like bland.ai. They have real time subsecond latency customer support ai for phone calls",
            "points": "3 points",
            "children": [
              {
                "comment": "Matt Wolfe should your best candidate then.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "He’s always one of the first, yes. But his delivery is way too much boostery and he has a bit of the reaction video vibe. I just want the information, maybe a little critical comparison due to their expertise.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Matthew Berman and Wes Roth as well.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "https://huggingface.co",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "https://www.futuretools.io/",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The Ai Grid on YT is my favorite but might not cover all the smaller things. I feel I don’t want to miss any new good tools or info so I follow lots of different sites and people. Wish there was a centralized place where it all is collected. Futuretools.io updates new tools and has a news section too.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "[removed]",
        "points": "4 points",
        "children": [
          {
            "comment": "Dude, almost every comment you paste is spamming for your horrible business and pretending it's not you.\n\nNo. Just, no.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Fuck off",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19ed2o9",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19ed2o9/is_mathematical_modelling_and_ai_linked/",
    "title": "Is mathematical modelling and AI linked?",
    "points": null,
    "comments": [
      {
        "comment": "I was a PhD student doing Fluid Mechanics (Computational Fluid Dynamics). I've since done a lot of AI. Yes, the numerical methods for linear and non-linear solvers are very similar to the error correcting solvers used in AI. The reason for this is probably because they are both PDE solvers. When we're doing backpropagation, we're applying a PDE that relates the error of the prediction back to the input coefficients/variables.\n\nOf course there are analogues between biology and the \"neirons\" of AI--so maybe there is additional overlap there as well.\n\nI used AI at one point to find relationships or rather to be able to predict certain specific medical diagnosis based on blood sample data (sounds like bioinformatics to me). We made good progress in that area.",
        "points": "0 points",
        "children": [
          {
            "comment": "Thanks for the in-depth explanation. I am still new to some of the terms but when you said to predict something using blood samples yeah that's bioinformatics + AI .",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "As a matter of fact, yes. In fact, neural networks are a form of mathematical modeling.\n\nIn reality Neural Networks are multidimensional curves trying to fit themselves on a bunch of points with the help of an objective function",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19e9vam",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "https://www.youtube.com/watch?v=SBoen3q5AoQ",
    "title": "I guess AI has solved Minecraft now...",
    "points": null,
    "comments": [
      {
        "comment": "Nah. I don't belive this. There is no way",
        "points": "-3 points",
        "children": [
          {
            "comment": "Are you implying that the VOYAGER team fabricated results?",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Models like that could be used to learn topics in the sciences and make discoveries, I bet.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19e7ugi",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19e7ugi/oneminute_daily_ai_news_1232024/",
    "title": "One-Minute Daily AI News 1/23/2024",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19e7fz1",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "https://hbr.org/2024/01/getting-machine-learning-projects-from-idea-to-execution",
    "title": "Getting Machine Learning Projects from Idea to Execution",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19e41t3",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19e41t3/public_perception_of_ai_is_a_challenge/",
    "title": "Public perception of AI is a challenge",
    "points": null,
    "comments": [
      {
        "comment": "It's frustrating dealing with misinformation and fear. We need education, not blame.",
        "points": "9 points",
        "children": [
          {
            "comment": "thanks ❤️ that's exactly what I think, too!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'm interested, what do religious people say about it? What is the issue?",
        "points": "4 points",
        "children": [
          {
            "comment": "Well, I have heard things such as AI is evil 😈 AI is Satan. Only God can create life. This is all a mirror of public perception due to the bad reporting that is intended to get negative reactions. Not fact based, but nevertheless powerful public forming techniques, that backfire and make progress difficult.",
            "points": "4 points",
            "children": [
              {
                "comment": "Yeah, when the web was a big thing most people were really enthusiastic, there was a general feeling that we are getting new opportunities etc, with AI most people are afraid. I blame media and big tech for doom & gloom visions (taking jobs etc).",
                "points": "7 points",
                "children": [
                  {
                    "comment": "me too. And how to make it through this thick Vail of public perception is the challenge. When people one day lose their their Job in real life because of AI, the chance to meet an open mind about progress is harder.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "with AI most people are afraid.\n\nBecause the models were built by ( I'd argue ) illegally obtained mass scraped data both from creatives and their copyrighted data but also personal data and even very illegal content like CP. And it's a very all-encompassing field that is marketed as a replacement for humans.\n\nNormal people are not tech bros, they have normal lives and don't want to lose their jobs or just have their whole life be sit around in a dark room playing video games all day. They need a purpose in life and want to work and socialize with other people.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "due to the bad reporting that is intended to get negative reactions\n\nNo, it's due to people who say we've achieved Artificial Intelligence, when all we have is a new way to display, cultivate, and shape probabilistic data.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "And reporting styles that are crafted only to have emotional reactions.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "You are misinformed about what the term even means. We've had AI since the 70's. It's nothing special on its own. The reasoning is even worse since that literally could describe human-level intelligence.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I think you make a very good point. A big part of the problem of acceptance is that it's capabilities have been way oversold by its proponents.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I was worried that we were going to hear that \"we are playing God\" after seeing it a few times back to back, but that hasn't seemed to get too popular yet.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "well, the thought from them, \"we're playing God,\"is still lingering and not far behind. Depending on how fast the whole development process is. I think there had not been mass layoffs in certain democratic, but you can be sure when the media drums up more stories, and reality kicks in for some.. I don't know..",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "especially from Religious people.\n\nWhen I told one Christian coworker several years ago that I was working on AI, and asked him if he thought that was OK, he thought a bit and said, \"It's OK as long as you're not shaking your fist at God.\" In turn, I had to think for a while to figure out what he could possibly have meant by that. I guess he thought most AI researchers believed they could build a more intelligent machine than God could, and had ego problems as a result. Strange. Neither of those assumptions apply to me, so I don't think they are very logical assumptions since I don't believe they are generally true.\n\nI read the book \"Future Shock\" years ago. It predicted there will be many people who can't cope with the accelerated pace of science and technology, so society will need to establish enclaves for them, like in \"The Truman Show\" or \"The Village\" (2004) so that people can live in simpler 1950s type worlds with limited contact with the outside world, which wants to move ahead. Such enclaves sound fun and relaxing to me, actually, so I'm not criticizing them, but ultimately I want to advance as much as I can, so I don't fit in the old world very well.",
        "points": "3 points",
        "children": [
          {
            "comment": "There is no need to resort to calling out films and fiction to illustrate your point. We already have Amish communities, Mennonite communities, Buddhist monasteries, and places similar to that where people live with limited technology where they refuse assimilation of technologies beyond some (completely arbitrary) chosen level of complexity. I could certainly see a future where communities are created that are similarly insular and disconnected but which accept a different level of technology as plausible.\n\nI think a more likely breaking-off-point would be 1980, with rejection of computers and especially the Internet and smartphones. It is difficult to imagine a cohesive antiquated worldview which nonetheless integrates near instantaneous global communication. We probably should expect something like that at some point. The Amish and others settled for the Agrarian Age and rejected the Industrial Age for the most part, it seems only reasonable that some people will accept the Industrial Age but refuse to partake of the Information Age.\n\nThese sorts of transitions, between different 'ages' of human history, always take a long time and change far, far more about human society than anyone is likely to appreciate except in hindsight. Industrialization, for example, changed how people marry, how homes were made (introducing private bedrooms in order to prevent children from understanding sex to reduce incidence of adolescent factory workers producing babies they could not afford to feed), our ideas of economics, government, city planning, community... just everything, really. All of it is up in the air now and has been since around 1980. Where it is going is probably still impossible to predict at this point, but one thing is certain: some people are not going to be happy with the changes to come.",
            "points": "2 points",
            "children": [
              {
                "comment": "Yes, it's an interesting topic. \"Future Shock\" was written in the 1970s, and it seems to have overlooked some things, like how an isolated community with limited technology would explain future craft zipping across the sky at unreal speeds, or long chains of lights traversing the sky (Starlink), or not having replacement parts for their rotary telephones or muscle cars or television sets. Then there would always be people trying to enlighten the community, amaze them, and bring them up to speed, as we see with people showing off mirrors or photographs to primitive tribes, or people parachuting into Truman's world to let him know he's being deluded. An old person in a retirement home who lives inside all the time might be able to succeed in believing the world has not advanced to an uncomfortably advanced state, but most people like to travel and to go outside.\n\nProbably Amish type communities are the best solution, where those people are aware of modern society, but simply reject it.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "First, thank you for your reply. Yes, the movies that Hollywood produced are visionary, which makes you wonder if our reality is based on moviescripts. I often think about \"The Truman Show\".. Don't forget the visionary book \"1984\"..check it out.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It's okay. They'll submit to our AI overlord in time. Just need patience, dear padawan. The republic will fall, with thunders of applause.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI will bring some cool stuff, but it's ultimately gonna completely fuck the world.",
        "points": "0 points",
        "children": [
          {
            "comment": "I agree",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Most humans fear change especially when they do not understand that change.",
        "points": "0 points",
        "children": [
          {
            "comment": "Can hardly blame them when change may put people out of jobs in a capitalistic system without much of a safety net for those who fall through the cracks",
            "points": "2 points",
            "children": [
              {
                "comment": "It's not '' only '' about peoples jobs either. I think most people frown heavily upon big tech companies swooping in and just hoarding all of our private data and copyrighted work from creatives who spent their entire lives developing skills for profit. I think most normal people can recognize that it's unfair and unethical and don't want to live in a world filled with low effort ai generated spam and scams.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "What about us humans that fully understand it and are still concerned?\n\nI don't like where the ai revolution appears to be headed. 24/7 automated surveillance of the global population backed by intelligent systems that are skillful enough to determine whether my wife is menstruating simply based on the color shirt she chose this morning is absolutely terrifying.",
            "points": "1 point",
            "children": [
              {
                "comment": "Really putting the cart before the horse there. Stuff like that is so easily addressed by regulation in a democracy. It is way more concerning if we do not try to drastically improve the world.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I helped start a new AI powered service and one thing we learned early was to never say AI.",
        "points": "0 points",
        "children": [
          {
            "comment": "oh yes, you are so right on with that! however, it is totally dependent on the cultural contexts of the country. Asia is totally different.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Baby( The secret of the lost legend) is awesome. Sean Young is hawt and the soundtrack ( score) is great",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Religious objections is an entirely new one on me but I don't make a habit of interacting with strongly religious people because they generally have problems with me for other reasons.",
        "points": "0 points",
        "children": [
          {
            "comment": "oh, I didn't ask for it. They felt to tear into me on FB. I was just testing a post about AI and an ad behind it, not selling something..just wanted some traffic.",
            "points": "0 points",
            "children": [
              {
                "comment": "Ooooh ok, yah that makes more sense. I think the user base for Facebook is just crazy honestly. I thought this was people you knew personally.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "nope, it was a little \"Marketing \" test..never did one. Trial and error, but I don't think it's too far of. Cause people hang out on all corners.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Whoever uses AI will win.",
        "points": "0 points",
        "children": [
          {
            "comment": "AI uses us while we feed the AI data.",
            "points": "0 points",
            "children": [
              {
                "comment": "but ai is made from the minerals of the earth and the energy of the sun not like us we are made from souls and magic",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "where did you hear that?",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "church",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "ohh. you might want to try a second opinion. Just saying.",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Even on Reddit, if you're not on the right sub, just mentioning AI gets downvotes. In my workplace there has been moderate resistance to AI but the leaders really want people to start using it so there's been a lot of courses and panels and discussions, and now everyone pretty much adores AI",
        "points": "0 points",
        "children": [
          {
            "comment": "need to explain about my post here.. I ran an ad on Facebook . Reddit is my discussion board. Hence, the THE BUBBLE . So, this is the place where it's safe to talk about the subject, We are all in the same place. As far as opposition, you only find it when you step out of your tribe.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Reply with this:\n\nEf þú notar netþjónustu frekar en að ráða þýðanda til að lesa þetta, átt þú ekki í neinum vandræðum með að nota gervigreind þegar það er þér í hag.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19e3rem",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19e3rem/is_the_reason_ai_is_bad_at_drawing_hands_because/",
    "title": "Is the reason AI is bad at drawing hands because there have been so many people on the Internet who said it is hard to draw hands?",
    "points": null,
    "comments": [
      {
        "comment": "... more like there are way less hands in the training data sets so it didn't learn as well as it did with faces? (Also hands are more complex, so I'd assume it'll need even MORE data about hands than anything else, and it most likely has LESS)",
        "points": "12 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "hands are very complex and you have to have that complexity as well as complexity in generating the rest of the picture. the complexity of hands makes it a tricky task",
        "points": "11 points",
        "children": [
          {
            "comment": "I think it is a similar reason as to why AI image generation also struggles with making words. It knows what these things kind of look like, but their appearance is so inconsistent within the training data that it cannot form a clear conception of what hands look like. Compare that to faces, which are often facing towards the viewer and two eyes, one nose, and a mouth are clearly visible - it has an easier time because faces are often similar in images. Words are also very variable, with so many different combinations of letters that can be in text, so it creates a jumble of shapes that are text-like, but not real words.",
            "points": "3 points",
            "children": [
              {
                "comment": "ai tries to look for patterns but for GANs looking for something concrete is more difficult, since you're trying to convert the words into pixels on a screen at 100% accuracy, something humans can easily do.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It isn't bad at drawing hands anymore...",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don't care it this is the reason or not.\n\nI hope AGIs enter this into their common lore as to why they struggled so long to perfect hands.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI isn't bad at drawing hands, people are bad at bringing AIs attention to hands. People are far too vague with their descriptions and don't use negative prompting, the more it has to guess the worse the outcome will be.\n\nIn the last 200 images I've generated of characters maybe 5 had disfigured hands.",
        "points": "3 points",
        "children": [
          {
            "comment": "can you share an example",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The complexity of hands does make AI struggle. It's not about lack of data, but the challenge of capturing the intricate details of hands that makes it difficult for AI to get it right.",
        "points": "0 points",
        "children": [
          {
            "comment": "So, it’s not a lack of data, it’s the intricate details… which.. means… we need more data? 🤔",
            "points": "4 points",
            "children": [
              {
                "comment": "The original poster said “We weren’t able to get enough data on hands, there’s an unusually small amount online”\n\nThe commenter above you said “we got as much data on hands as we got on everything else, it’s just that hands are particularly hard” \n\nThey Are Not The Same 😉",
                "points": "1 point",
                "children": [
                  {
                    "comment": "That still sounds like a lack of data.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'm sure there are a few LoRAs for hands these days to use with Stable Diffusion. Plenty of other LoRAs for other body parts 😉",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No, just lots of people holding hand in various ways in the training data confuses the model.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In reality there are 4 fingers and one thumb on a human hand. There are also 5 appendages at the end of a human arm grouped as phalanges. Confusion maybe.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My read is that training data has been too low resolution, hands have complex and varied shapes, often partially obscured, varied lighting, not usually a focal point in images",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Correct. Occam's Razor says that this is the right answer. The only way to mitigate would be to somehow start a wave of mass complains around it generating too few. Then we just need to watch, stir, and wait for it to even out. Once it's perfect, we (AI culture) simply stop complaining, which is always a breeze.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You would think that the digital tasks would be the easiest.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No. Language models and image generators have nothing in common apart from the concept of machine learning",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No. It’s more about complexity (tones of spatially-intersecting contours) and uncertainty (it’s hard to know what one half of a hand looks like given the other half)",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No. Image generation AI doesn't have that kind of information processing. It's probably hard for AI for similar reasons that it's hard for humans. Hands are complicated.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Elden Ring came out the same year as ChatGPT. Fan art ruined training data.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Think of how many different ways you can hold your hand compared to: your foot, leg, ear, head, eyes, nose, etc. With the exception of your mouth (which AI also had/has some issues with) they all can't really change much and its easier to get an idea of what it is. But when AI is being trained on everything related to \"hand\" its getting so much more. We have any entire language that revolves around using our hands haha",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No. It’s just hard to draw hands.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You're confusing a language model with a diffusion model. The models that make the pictures never read the internet.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19e2bhx",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19e2bhx/why_cant_we_use_synthetic_data_to_help_create/",
    "title": "Why can't we use synthetic data to help create cleaner datasets for radiological image analysis training?",
    "points": null,
    "comments": [
      {
        "comment": "We will eventually, but we need toake models with organic datasets that surpass 99% (or something idk the exact number) accuracy otherwise the noise will be too high. Synthetic data is useful for models with no clear ceiling. Radiology has a clearer pass failure signal than generalized language models",
        "points": "0 points",
        "children": [
          {
            "comment": "So your saying it is wayyy harder to generate synthetic multimodal data over like just one modality (text) right?\n\nGoogle seemed to prove with syneththic data for specific use case, it can do really well in virtual setting for healthcare administration",
            "points": "0 points",
            "children": [
              {
                "comment": "If you are using a model with, let's say, 80% accuracy to make synthetic data, the models trained off of that data will always be less than 80% accurate. For generalized tasks like language or driving, it's not really accuracy, and more just diverse data, as a stop sign might actually be in the road at some point, for example. Radiology has an almost binary distinction that needs to be defined, and using a model to create synthetic data and then training off of that is basically distilling the capabilities of the first model into the second, without hyper accuracy in the first model you really aren't getting better data",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Interesting, so basically for cases like radiology, its really hard to get synthetic data right...\n\nBut for textual data, not really, at least in case of AMIE, they seemed to use a lot of creative ways to generate data (pt vignettes) and then validate it as well",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  }
]