[
  {
    "id": "t3_19eqs36",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.engadget.com/ring-is-reportedly-walking-back-its-police-friendly-stance-on-data-sharing-191514423.html",
    "title": "Ring is reportedly walking back its police-friendly stance on data sharing",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19e94st",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.notebookcheck.net/Samsung-chairman-calls-Galaxy-S24-series-more-disappointing-than-iPhone-at-high-level-meeting.796514.0.html",
    "title": "Samsung chairman calls Galaxy S24 series \"more disappointing than iPhone\" at high-level meeting",
    "points": null,
    "comments": [
      {
        "comment": "This article is a bit misleading. Apart from all the needless speculation all over the article about the S25 series and even the S26 series, the actual quote is incomplete and has no context.\n\n\"Galaxy smartphones are more disappointing than iPhone in this regard\". We dont actually know what the topic of discussion was where it was being compared to the iPhone. Could be camera/battery/screen/cpu/RCS/ecosystem/prices/sales or literally anything else.",
        "points": "559 points",
        "children": [
          {
            "comment": "As if anybody will read the actual article",
            "points": "193 points",
            "children": [
              {
                "comment": "I actually went further by looking up the korean source article",
                "points": "44 points",
                "children": [
                  {
                    "comment": "And.... Inform us pls",
                    "points": "20 points",
                    "children": [
                      {
                        "comment": "Theres literally nothing noteworthy. Theres was a big shareholder meeting and they played a big promo video comparing the current phone lineup to its competitors. It doesnt detail what was actually compared, not even info if it was the S24 being compared. For all we know, it could have been the A54 being compared to the iPhone SE.",
                        "points": "65 points",
                        "children": [
                          {
                            "comment": "Or even things we as users don't care about.\n\n(percentage of total platform revenue captured by phone vendor )",
                            "points": "17 points",
                            "children": [
                              {
                                "comment": "Yup. But sensationalism and clickbait titles got us to ramble on in the comments.",
                                "points": "8 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The topic has to be “sales” lol",
            "points": "11 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Why would chairman talk about actual phone? She was probably talking about margin or drop in sales or something like that",
            "points": "8 points",
            "children": [
              {
                "comment": "Thats exactly it. The extrapolation in this article is wild. It goes on to suggest that the chairman was upset that the cameras werent good enough on the S24, and that there should be more focus on Camera sensors on the S25.\n\nLee Jae-yong doesnt give a single shit about the actual product. He isnt a product designer. He hires people to do that stuff for him. He was most definitely talking about sales figures or stock prices. Stuff that actually matter to the chairman of a multi-billion dollar company",
                "points": "12 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Glad he did, hope this leads to some changes in the right direction.",
        "points": "757 points",
        "children": [
          {
            "comment": "But chairman, you allowed it to get to this point.",
            "points": "248 points",
            "children": [
              {
                "comment": "Understood. I will give myself a $50 million bonus, lay off 600 employees, and tell the people with their dicks in their hands to come up with something better that I can take credit for.",
                "points": "113 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Doubt it. The article ends by saying the s25 series could have some bs camera upgrades to look forward to.\n\nI want you to change my world somehow...I'm tired of buying camera upgrades. My camera is fine.",
            "points": "137 points",
            "children": [
              {
                "comment": "Then don't buy the upgrade. Wait for something you want. Companies will create trash disposable products if you keep buying them",
                "points": "30 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Yeah, if only we could have a fingerprint sensor on the back, expandable storage, and a 1440p screen.\n\nOh wait, my S9 already has that with a headphone jack too.",
                "points": "47 points",
                "children": [
                  {
                    "comment": "I miss my S9 can they just give me that with a new chipset?",
                    "points": "9 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Have an s9+ and absolutely love it. It's fast, amazing screen, great camera, absolutely not interested in an upgrade. Only at 65% of original battery capacity though, and a battery replacement would set me back almost as much as I paid for the phone.",
                    "points": "7 points",
                    "children": [
                      {
                        "comment": "In my experience with the regular S9, the battery was not hard to change myself. Only cost around $40 for a replacement from ifixit.",
                        "points": "6 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "As long as you're not all thumbs ebay/amazon have battery kits for like $20-35 for off brand ones. It's not hard to replace.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Whats with the need for high res tiny screens? I just dont get it",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "Because it's really close to your face and you can see the difference. It's a no brainier.",
                        "points": "8 points",
                        "children": [
                          {
                            "comment": "I remember going from a 1080p phone to a 1440p phone being just okay. I picked up the 1080p phone a few months later to fiddle with something and the display looked so horrible. Once you get used to something, you really do see the contrast between it and the old.",
                            "points": "8 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "And here I wish for a good camera in a smartphone, not that mediocre stuff.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "They could innovate by switching to a removable battery.",
            "points": "76 points",
            "children": [
              {
                "comment": "They could \"innovate\" by putting back memory card support and moving the base internal storage option up from 128GB to 256GB.",
                "points": "101 points",
                "children": [
                  {
                    "comment": "Yes this. Still rocking my S9 with removable \"EXPANDABLE\" storage.",
                    "points": "25 points",
                    "children": [
                      {
                        "comment": "That's why I still have mine as well... until they find a way to make it obsolete with some forced update.",
                        "points": "5 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I just want my Note and s-pen back. So sad that phone broke.",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "My S23 Ultra is basically the same as my old notes. Has a really nice Pen with it as well.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "S-Pen still exists, they just merged the Notes and the Ultras because there was a ton of overlap for no real reason",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Galaxy S Ultra series is there for you",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Honestly please don’t. Memory cards are slow and somewhat unreliable. Internal memory is cheap nowadays, they just need to stop trying to squeeze 500% margin out of storage upgrades",
                    "points": "-4 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Fuck yes I second, third and fourth this! Only thing these high end phones are missing is big storage...",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "You will get a lot of upvotes for this, but people won't buy it. Why? Because the phones won't look as nice as the others. And by the way, batteries aren't removable, but replaceable. No one would carry around batteries nowadays. We have power banks for that.\n\nSony phones offer near stock Android, a headphone jack and a SD slot. Are they successful? They aren't.",
                "points": "34 points",
                "children": [
                  {
                    "comment": "Sony had a habit of dropping support for their phones after a year. Bought my first and last flagship from them after only receiving 1 patch. Wonder if they've changed their ways.",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "People don't buy Sony because they're expensive and slow, not because they're ugly (they're not). In fact, I preferred Sony until they went down the drain a while back.",
                    "points": "20 points",
                    "children": [
                      {
                        "comment": "Don't know what you're talking about. My Xperia 1 IV still running all games just fine and scores average results for an 8 gen 1. All of the issues I had were fixed with firmware updates a month after I got it.",
                        "points": "12 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "The only ones behind on hardware were the ones with the prosumer cameras on them. The regular ones were on the same Snapdragon CPUs as everyone else. Also, unless you constantly do high-end mobile gaming, does the CPU even matter anymore? It doesn't take much to run Instagram/Whatsapp/Youtube.",
                        "points": "6 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "People do not buy it because it does not exist.\n\nThere is no way to get an actual answer without an actual comparison of the same phone one with and one without.",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "In exchange for being more prone to water damage? No thanks...",
                "points": "-17 points",
                "children": [
                  {
                    "comment": "It's a BS excuse I heard many times, my fater use a galaxy xcover (I think five) a few years now and this thing has been on a bottom of a water barrel a few times, even in the washing machine for 15 minutes and it's perfectly fine.\n\nAaaaand, the battery and back cover pops-off with a flick.\n\nEdit: Just for clarification, I looked up the newest model in that series (6 pro) and I will be fine carrying that device, and that thing is dirt cheap (under $400). This is the proof that even Samsung itself capapble of making this kind of phones.",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "yeah might have trouble at scuba levels but many phones could go in the water before they locked the battery away. people seem to have never heard of a gasket. You can get a tight seal no problem, where it would take quite a bit of water pressure to get in.\n\npeople seem to forget the past existed.",
                        "points": "3 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Samsung have been trying so hard to be Apple yet they forget that if they are just going to build a phone exactly like Apple with similar pricing then we might as well just buy an Apple phone.",
            "points": "4 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "But what changes?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'm glad the executive board is now aware of a problem that any Samsung phone owner could've told them years ago.\n\nIt's great they've identified this as a serious issue - hopefully we'll see some devices in the future that aren't just the same incremental component upgrades. But also, why did it take this long to realize things need to improve?\n\nApple's last few iPhones haven't been particularly innovative either, so using that as a benchmark and still considering yourself demonstrably behind is a bad place to be.\n\nBut on the other hand, what kind of innovation is going to make a serious improvement? There's no competing with Chinese OEMs on price. iOS users are extremely unlikely to switch to Android. If they continue the path of incremental CPU / camera improvements and tout benchmarks and mostly unimportant efficiency gains each year, no one will care.\n\nDo we want to see novel ways to leverage Samsung's ecosystem of devices? What at the granular, product level can Samsung do to actually \"wow\" consumers? I feel like consumers are right, that Samsung's devices are lacking in innovation, but with the exception of fold/flip phones, which still don't have particularly strong market penetration, consumers don't like changes to these kinds of devices. Phones that try something different never really seem to sell well compared to the big-screen, flagship processor, fancy camera blocks from any OEM that top the sales charts.",
        "points": "197 points",
        "children": [
          {
            "comment": "At this point with how powerful phones are I only see two major selling points, putting out amazing cameras and improving battery life.      Samsung specifically could benefit from less bloat or something closer to stock android. \n\nas someone who uses a Pixel I'd love a pixel with the camera of a Samsung flagship or iPhone.",
            "points": "96 points",
            "children": [
              {
                "comment": "I find it interesting that Samsung is ignoring one of their best features, imo, DeX. If there was more mouse and keyboard support I wouldn't even need a PC anymore. But some of the blame for this is with app developers. For example Genshin Impact. I much prefer to play it on PC with mouse and keyboard and the mobile app doesn't support mouse and keyboard even though they obviously have it figured out.",
                "points": "45 points",
                "children": [
                  {
                    "comment": "Native MnK support and basically beefing up features would essentially kill off most non-gaming laptops for consumers to some extent lol. Cause why buy an entirely new device like a laptop when you can just get a really good dex-enabled phone with a dummy screen and keyboard and save the money if you just want it for basic functions like youtube, browsing, a few mobile games, emails, notepad or basic office functions, etc etc. For those who needs Windows-powered devices of course this doesn't work, but that's a much smaller base than the ultra casual normal consumer.",
                    "points": "14 points",
                    "children": [
                      {
                        "comment": "This would also be suitable for a lot of people who move between docking stations for their job. Instead of carrying around an entire work laptop, they can just carry around their work phone (which they may be carrying already anyhow).\n\nEspecially since a lot of people are fine getting serious work done on a phone, it would probably be preferable to them to have everything on one device and then they can just plug it into a KVM dock when they're at a desk.",
                        "points": "5 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "In general DeX could easily be their ticket to be one of the leaders in the next generation of computing. DeX already works pretty well with the XReal Air type HMDs.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "Yea if dex were to be fully fleshed out it could be catastrophically good, especially with how good phones are getting and may eventually get with even gaming, a task known for having really high horsepower requirements. The latest Apple and snapdragon phones can already do ray tracing....imagine in 10 years...",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "They should pair up with MS and offer Windows support in DeX mode. That would be a real game changer",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "The pixel camera trump's the Samsung and iphone ones though? Only in video the iphone is better.\n\nIt's everywhere else the pixel is lacking, especially if you are outside of the US and the features are missing.",
                "points": "19 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "What I want is a return to smaller phones. I miss my HTC One M7 back in the day. I could hold it with ease, type in one hand, and it fit in my pocket without any fuss. There aren't any \"good\" phones in a 4.7\" form factor though, so I'm stuck buying these 6-7\" phablets.",
                "points": "18 points",
                "children": [
                  {
                    "comment": "The thing is, the market has shown that you're a loud minority unfortunately. Companies - including Apple - have put their toes in the waters of small phones and they never sell anywhere near as well as big phones.\n\nI feel for you, but unfortunately the average person sees bigger as better and want bigger screens. And if that's what the people want, guess what the companies are gonna make?",
                    "points": "26 points",
                    "children": [
                      {
                        "comment": "You are completely right.\n\nRecently I was actually trying to find a phone that's bigger than 6.9 inches. I couldn't find any. So I got the Z Fold 4. The 7.6inch inner screen is absolutely amazing. It's the first phone I've used that makes me feel like I'm living in the future.\n\nThe only thing I dislike about the phone is that the 6.2inch cover screen isn't big enough.",
                        "points": "4 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Talking of HTC I’d like someone to take on front facing speakers they tried with the M8 I believe it was.\n\nWas actually quite a useful feature.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Marques Brownlee just did a video on this and the Pixel was the winner",
                "points": "4 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Samsung doesn't have bloat; their duplicated apps are just duplicates and are easily uninstalled, but many of their apps are on par or better than Google's. The bloat comes from the fact that both are installed from the jump; give users the option of which ones they want on the phone from the setup screen and all is good.\n\nAnything else that would be considered bloat would be the plethora of extra features that Samsung has, and removing those would make no sense. Samsung doesn't need stock Android, OneUI is fine. More RAM, faster charging, Qi2 for Magsafe compatibility, more storage, and giving end users more items to customize in Good Lock are the ways to go.\n\nAnd an official Magic Keyboard clone, preferably one made out of metal (or metal looking plastic) and with a USB hub attached.",
                "points": "6 points",
                "children": [
                  {
                    "comment": "I got a samsung tablet 2 years ago and would love to be able to remove all the samsung apps. Sadly not possibly for many of them it seems.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I prefer one ui to stock Android. So many features are missing in stock Android. This \"bloat\" which used to slow down phones, well, I doubt this is the case anymore. It's just a thing of the past and people cling to it.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Exactly. This whole \"we want stock Android\" bit was relevant maybe 8-10 years ago. OneUI has been great for a while now.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Bro I literally checked the Samsung phone of my dad a few weeks back and they have ads in the apps... Like in My Files and stuff like that, you literally have to stop what you are doing to watch an ad, while you browse your phone files...\n\nThat for me is crazy, that shows how behind they are in the race.",
                "points": "-12 points",
                "children": [
                  {
                    "comment": "Either your dad has installed some wildly shitty 3rd party apps or you're talking out your ass. There is not a single ad in \"My files\" or any of the core function apps.",
                    "points": "8 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "You're being downvoted, but actual advice.\n\nUninstall that app. It's most likely 3rd party and not default and if it's accessing files, your dad has enabled permissions for it access files/photos, etc.\n\nIf it is a default app, the phone has bigger issues like a malware or something.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "My god what if they somehow find a clue and engineer a phone for durability and longevity? Slap a 5 year warranty on it and advertise the hell out of the customer trusting it can last 5 years.\n\nSorry, I apparently decided to start writing some fan fiction there. My bad.",
            "points": "21 points",
            "children": [
              {
                "comment": "They have stated that the S24 will get 7 years of updates.",
                "points": "15 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "My s21 is now three years old and having zero issues. I'm very pleased with it.",
                "points": "13 points",
                "children": [
                  {
                    "comment": "I had to check system settings to see if I was using an s21 or s20. It's an s21 and zero issues here as well.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Give me a phone that's twice as thick, but can take a drop and has a larger, replaceable battery.\n\nSold",
                "points": "10 points",
                "children": [
                  {
                    "comment": "I'd love for them to bring back the Active line. I know they discontinued it for poor sales but it was an AT&T exclusive and it always came out six months after the mainline Galaxy S model it was based on, so yeah no shit it didn't sell well. You massively restricted your customer base to one carrier, and released it off-cycle so that most people who might want it would have just upgraded to the newest mainline Galaxy S a few months prior.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Their XCover Pro line is what you want. I'm using the XCover Pro 6 now and it has all those features, plus dual sim and MicroSD.\n\nI'm one of those weirdos that still likes swappable batteries, offline for one or two minutes, then back on, so it's been great for me.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Why would they do that when battery cases exist?",
                    "points": "-1 points",
                    "children": [
                      {
                        "comment": "Because I want options for cases that don't have a battery in them, I want user replaceable batteries, period, and also the fact that using a battery to charge a battery is just wasteful as hell",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "How about Samsung releases a product line, not a replacement but an additional line, where they went back a bit. Slightly smaller screen and plastic case. Sure, those aluminum-glass cases look better, but they're slippery and prone to damage, so everyone puts them in a protective case anyway. Samsung had great, solid Phones that were water proof and had batteries that could be changed until the S6. This type of model could once again be a unique feature. Sure, everyone will once again complain that it \"looks cheap\" but the only manufacturer that gained \"status symbol\" value is Apple anyway, everyone who doesn't buy apple wants a good smartphone, not one that looks expensive.",
            "points": "4 points",
            "children": [
              {
                "comment": "Wife refuses to get rid of her S10e. Even though I'm getting the S24U she won't take my S21U, so it's getting handed down to the kids.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "I just let go of my s10e.... Begrudgingly for the S23. The s10e was the perfect size... But having eSIM and a new and better battery and 5G made the difference. I do lament the loss of the SD Card and plugged in earphones.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Because nobody would buy that, simple as that, too low about of ppl want it.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I don't see the point on either end. Apple iPhone is in the same exact boat for me. The \"change\" was just a titanium side and programmable button from 5+ years ago. I stopped caring a long time ago since there was nothing that innovative for a while now.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Could give every phone a headphone socket",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Do we want to see novel ways to leverage Samsung's ecosystem of devices?\n\nThis is probably their best shot at this stage. As an iPhone user who recently had to replace my phone, I must admit that Samsung's wide range (relative to the iPhone) made me seriously consider switching. I think the fact that they have new phones in most price ranges is very strong characteristic and actually commendable. Deeper integration of a Samsung ecosystem would make the phones even more desirable, even on the lower end.",
            "points": "1 point",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "A good AI assistant would be amazing",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "iPhones aren’t exactly making breakthroughs either. iPhone 15 is advertising titanium casing as its core new feature which is absolutely laughable. I don’t see myself upgrading my iPhone 12 for another 3 years minimum.",
        "points": "126 points",
        "children": [
          {
            "comment": "the real thing was they kept the price the same with some improvements. it's actually pretty good for the money (assuming you're not weird and thinking of upgrading every year), though nothing exciting.\n\nedit: kept it the same with inflation, aka when everyone else increasing prices.",
            "points": "45 points",
            "children": [
              {
                "comment": "I found a scheme where I upgrade every year and it costs me just the tax but I have to give them my old phone. It's the only way it's worth it. Shout out to all the cheapskates on the slick deals forum who put me on to this.",
                "points": "14 points",
                "children": [
                  {
                    "comment": "Care to expand on this a bit?",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "In the same boat here, to me I don’t need the best and fastest phone. While the 15 with USB C is nice, I’ll just wait for the 17/18 to upgrade because the phone does everything I need it to and at a speed I need. It’s not a huge screen nor do I use it enjoy media so high refresh rate isn’t important to me.",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Well thats really how it should be.\n\nWe have mostly fallen in to the trap of upgrading when the service contract runs out, or the phone is paid off.\n\nWhen really, if the phone does everything you need it do and has no functional problems, it doesnt need upgrading or replacing.",
            "points": "5 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "That's what made me come into the comments.\n\nI switched from Android to iPhone 14 over a year ago. I gave it plenty of time to get used to but I have to say iOS is just vastly inferior to Android in so many ways. They keyboard, horrible text predictions, selecting text, Bluetooth connection options. Shit, you can't even customize snooze length on alarm clocks (so fucking easy to implement it's just bizarre).\n\nSo when this guy says his company has made a worse phone than Apple out of Android, it must be awful.",
            "points": "-8 points",
            "children": [
              {
                "comment": "The article mentions that the guy's disappointed in their lack of innovation. Not that They have necessarily made a bad Android experience. Their their flagship phones are praised for the most part. They're powerful and feature packed.\n\nBut, just like Apple, they've been recycling many of the same ideas repeatedly for the past five generations. The major difference primarily being a newer version of Android and Snapdragon processor. While there have been most definite software improvements, there's nothing that really pushes people to upgrade devices if they already have the previous version.\n\nI mean, all you have to do is go to their website and look at the news for the s24. You'll quickly notice that they're pushing software improvements and AI nonsense more than any other tangible benefit. And all this for new even higher price tag.\n\nHonestly, I had been using oneplus for quite a while. But I had moved to the s22 ultra because they have a much better trade value.\n\nBut when you go and look at the launch page for the OnePlus 12 today and compare it to Samsung, You quickly realize just how much more theyre innovating and bringing tons of functional features to a $800 device. It even has a 100w charger in the box! Lol",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Shit, you can't even customize snooze length on alarm clocks (so fucking easy to implement it's just bizarre).\n\nThat was like... one of the first features of any stand-alone android alarm apps back in 2.x days even, lol.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "You’re just used to the android.\n\nI got an android from my company as a work phone and god damm I hate it.",
                "points": "-3 points",
                "children": [
                  {
                    "comment": "Depends on what you favour. I've switched plenty between iOS and Android over the years.\n\nWhereas iOS looks much better and runs much smoother, the lack of customisable options is sometimes really bizarre. Something that would take a few lines of code is just not implemented sometimes and you have no way to change that. So it really depends on which bullet you're willing to bite.",
                    "points": "8 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "So used to it I forget that you can change a snooze timer to something other than nine minutes? You should hit up /r/iOS sometime and see how frequently even they bring up how useless the keyboards and text selection is.\n\nAlso, I think you missed the irony of your comment.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "And you're welcome to hate it. I personally can't switch to an iPhone because it won't let me do things my way. Only the Apple way\n\nE.g. People want to share photos on an iPhotos shared album? No worries. My photos automatically back up to Google Photos on my S22, I'll just download the photos I want to share on my iPad and put them on.\n\nExcept once they download, they're in my files app, not my photo app. So I have to share them to the photos app. It moves moost of them after a while, without a progress bar.\n\nThen it says about a dozen failed, but won't tell me which. So I have to redo it 10/20 at a time depending on if there's a video in the batch or not.\n\nThen they're finally in the photos app, but craps out at putting them all in the shared album at once, so have to do a few tries at that too.\n\nAll because I want to do it my way and not have an Apple iPhone and transfer everything via Apple's iCloud.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yeah Galaxy AI being the selling point when Samsung is notoriously shit with their software gimmicks is the reddest flag they’ve flown in years.",
        "points": "71 points",
        "children": [
          {
            "comment": "It's fucking ridiculous in Australia the S24 Ultra STARTS at $2199, even the S24+ is $1699.\n\nThese phones were meant to be the Pixel killers but the base Pixel 8 undercuts the base S24 by $200, and the 8 Pro is undercutting the S24+ by $250 at the moment.\n\nIf Samsung wants to beat Google at their own game, these \"AI features\" better be able to do more than make my photos look a bit sharper and take notes for me.",
            "points": "11 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I got so many ads for galaxy ai leading up to that. What even was it? As far as I can tell it was just photo editing shit which I could not give a fuck about.",
            "points": "9 points",
            "children": [
              {
                "comment": "The features they are advertising as \"AI\" are nowhere even close to being AI, they're just jumping on the bandwagon and using it as a marketing term.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "New improved Bixby AI",
            "points": "1 point",
            "children": [
              {
                "comment": "It's there any way to disable this garbage?",
                "points": "3 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I won't buy another Samsung from the sheer bloat of apps and crap on it.\n\nI just want a simple Android OS, what's the OS size up these days?\n\nThey don't advertise that a good % of the phone storage is straight up wasted on useless crap...",
        "points": "241 points",
        "children": [
          {
            "comment": "That is why I use mostly motorola devices. They are not as barebone as they used to be, but damn that they are WAY closer to pure android without bloatware compared to every other major manufacturer.",
            "points": "67 points",
            "children": [
              {
                "comment": "Only real problem with Motorola is the ages it takes for them to come out with security and Android updates. You would think something so close to stock would get the updates quickly.",
                "points": "43 points",
                "children": [
                  {
                    "comment": "Not an excuse, but personally I can deal with that since they generally keep their bootloaders open.",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "Shame so many 3rd party ROM support forums are now \"go to this telegram channel\" and nothing else.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Look up the android one program. Nokia's ship with stock android.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yea but half the useless crap is Google bloat",
            "points": "21 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I won't buy another Samsung from the sheer bloat of apps and crap on it.\n\nWhat bloatware exactly? Theres only two Id consider pointless(samsung free and samsung pass) that I cant remove directly from the phone, at least on my s21fe.\n\nYoure probably talking about carrier bloatware, or some ancient phone.",
            "points": "12 points",
            "children": [
              {
                "comment": "Don’t they have their own browser and bixby?",
                "points": "2 points",
                "children": [
                  {
                    "comment": "You can disable bixby and Samsung browser is the best browser for android.",
                    "points": "-4 points",
                    "children": [
                      {
                        "comment": "Firefox has entered the chat.",
                        "points": "4 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Better than chrome?",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Chrome is the worse on both android and pc. You should avoid it. For pc I use Firefox and smartphone Samsung browsers or brave.",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "If you want simple android grab a Pixel. It's kind of a let down for anyone interested in doing more than the bare minimum though so we like having Samsung's added functionality. Stock Android is silly with modern phones having 12+ gigs of RAM and 512+gb storage.",
            "points": "17 points",
            "children": [
              {
                "comment": "I had an s22 and now a pixel 8.\n\nWhat added functionality did Samsung have?\n\nNot asking in a sarcastic way, I view it backwards. Part of what attracted me back to pixel was the added Google functionality like the call screen and hold stuff.",
                "points": "14 points",
                "children": [
                  {
                    "comment": "This is copy/paste of the answer I gave to someone else. But first gotta admit I really like Pixel's call screening and I do feel a little miffed about Google keeping those features to the Pixel. The camera functionality I get but whenever it comes to assistant it feels like Google is screwing over Android as a whole by withholding core functionality for their own device. My (not so conspiratorial) conspiracy theory is that Google's attempt to make Assistant the it factor for Pixel devices has hurt the overall development of Assistant. There used to be a time it was the clear best smart home assistant but now it feels incredibly neglected. It's actually regressed to a large degree. Then comes Google I/O and you hear all these cool functionality Google is building into the next Pixel and it's like, pick a lane guys. do you want to be a platform or do you want to sell first party hardware? I switched my house from Assistant to Alexa because it just works better now. Still really cool what they can do with Pixel phones and the meager Tensor chips but they need to make that universal. That rant over..\n\nAt this point... anything? Seriously, I've started coming up with random tests to see if One UI/Bixby/GoodLock could do it and it can. I control all my home lighting/automation from a flick of the side nav. I can do basically everything through voice commands with Bixby. I can use the S-pen for note taking, signatures, edits, camera controls, media controls, quick screenshots, color picker, and so much more. Need to grab a color I have advanced actions set up with proximity, sensor, and NFC activations all around the house & office. I use Dex on a semi-weekly basis for real tasks and it's also great for playing emulators with friends. Just dock the phone into my TV, connect controllers, and we're having a blast with some classic games. And that's to say nothing for the deep customizability. Anything i can think of I've been able to do pretty easily. I had an old podcast that was only in mono so it came out of just one ear, asked Bixby to switch audio to mono and it took me right to that setting. I got annoyed shifting between speaker and earbuds through setting up top, Good Lock has a program that allows you to adjust the volume pop up when you click the volume up and down button to also include the ability to change the output device (phone, earbuds, speaker) PER app so I can have music blasting out my Bluetooth speaker while scrolling through reddit videos or YouTube shorts with audio coming from my phone. I've forgotten most of it since it's all set up and I rarely think about it now but I could come up with a much longer list if I sat down and went through all the ways I tailored my phone. I don't think anyone else in the world has the same setup I do and that's so awesome. If my needs were different I'm pretty sure I could make this phone do whatever it is that required. Oh, I was missing OnePlus's awesome warm grayscale reader mode but with a bit of tinkering I was able to recreate it. It launches through button combo or bixby so it's just as convenient too. Just remembering now since I use it around night time lol.",
                    "points": "10 points",
                    "children": [
                      {
                        "comment": "I find this comment interesting because I just switched the whole house from alexa to google assistant these past weeks because alexa is so neglected and google assistant has just blown past it.\n\nIn fact how much better google assistant has gotten in the last 12-24 months is just insane, so my experience definitely doesn't match yours there.",
                        "points": "4 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "goodluck, being able to customize UI and some other stuff, like moving the clock to the right side where it belongs, holding down volume button to skip song etc theres a lot of stuff you can do with it\nSeparate app audio, for example having one app like spotify playing music on bluetooth speaker and having other audio coming from the phone, without interrupting spotify or suddenly blasting the audio from the bluetooth speaker\nbetter quick settings thing(when you pull down the status bar), you can access wifi networks and bluetooth devices directly from it, and samsung kept the old style instead of the super wide one, the oneUI 6 did merge it to some degree but its still better imo\nCopying text from screenshots, idk if others have done that besides iOS\n\nTheres few more but these are my main reasons why I stick with samsung",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I've had a pixel before and will likely go down that path next time.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "the pixel are fantastic but I'm certain they try to force upgrades. both pixel versions I've had had major functional issues on the very first os update after the phone turned 2",
                "points": "2 points",
                "children": [
                  {
                    "comment": "I'm still on a Pixel 4a after three years, only reason I'm considering an upgrade is the battery isn't what it used to be. Phone has been excellent otherwise. Wish the 7a (and upcoming 8a) was still as small as the 4a though.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I was a stock Android fanboy for years until I got a taste for more functionality & flexibility with Oxygen OS back when OnePlus was more independent. I switched to Samsung when the S20 came out and never looked back. I'm sure Pixel experience is good for some people but I miss all the deep functionality Samsung has that no one else can compete with. I'd have One UI running on my iPad and PC if it was possible (and didn't strip away underlying windows functionality lol)",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "What type of deep functionality exactly?",
                        "points": "8 points",
                        "children": [
                          {
                            "comment": "At this point... anything? Seriously, I've started coming up with random tests to see if One UI/Bixby/GoodLock could do it and it can. I control all my home lighting/automation from a flick of the side nav. I can do basically everything through voice commands with Bixby. I can use the S-pen for note taking, signatures, edits, camera controls, media controls, quick screenshots, color picker, and so much more. Need to grab a color I have advanced actions set up with proximity, sensor, and NFC activations all around the house & office. I use Dex on a semi-weekly basis for real tasks and it's also great for playing emulators with friends. Just dock the phone into my TV, connect controllers, and we're having a blast with some classic games. And that's to say nothing for the deep customizability. Anything i can think of I've been able to do pretty easily. I had an old podcast that was only in mono so it came out of just one ear, asked Bixby to switch audio to mono and it took me right to that setting. I got annoyed shifting between speaker and earbuds through setting up top, Good Lock has a program that allows you to adjust the volume pop up when you click the volume up and down button to also include the ability to change the output device (phone, earbuds, speaker) PER app so I can have music blasting out my Bluetooth speaker while scrolling through reddit videos or YouTube shorts with audio coming from my phone. I've forgotten most of it since it's all set up and I rarely think about it now but I could come up with a much longer list if I sat down and went through all the ways I tailored my phone. I don't think anyone else in the world has the same setup I do and that's so awesome. If my needs were different I'm pretty sure I could make this phone do whatever it is that required.\n\nEdit: Oh, I was missing OnePlus's awesome warm grayscale reader mode but with a bit of tinkering I was able to recreate it. It launches through button combo or bixby so it's just as convenient too. Just remembering now since I use it around night time lol.",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Yes, buying a Pixel is opting in to being a beta-tester basically.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I'm a huge fan of my LG Thinq. No bloat but not barebones.",
            "points": "5 points",
            "children": [
              {
                "comment": "Unfortunately LG does not make phones anymore",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Yep I went back to LG v50s after Samsung s21 too much bloatware",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I'm currently using a galaxy and agree. My next phone will be a pixel or iPhone.",
            "points": "4 points",
            "children": [
              {
                "comment": "My only problem with pixel is the battery life is bad. Always been bad",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "I'm moving back to Samsung from Pixel I just miss the little things.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I'll never leave Android, and I really love my Galaxy S22+.\n\nHowever, it sucks that it comes with so much bloatware right out of the box. And when they install/re-install more bloatware during software updates, that's where I draw the line.",
            "points": "7 points",
            "children": [
              {
                "comment": "..Are you sure thats not carrier bloatware? I dont get any bloatware from updates",
                "points": "11 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Yeah I mean you can customize it a ton and remove the majority of bloat. The only things you can't remove are what some people call features.   \n\nBut then every update you get new installed random crap. It's easy enough to delete but really sours the experience of an OS update.  \n\n Used to sell cell phones and when setting up a new phone for a customer I always turned off stuff as soon as the device booted and without even telling them. Turn off Bixby screen, decline the Samsung pay card thing. Yeah that might have dated me a bit I don't even know if that stuff is on new Samsung.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Go for the OnePlus 12",
            "points": "1 point",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Try an Asus Zenfone. Not quite stock but close. They are very nifty phones",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The bloat also makes the phone feel cheap, a premium phone should not have crap like Facebook and Linkedin installed. Stuff like that makes it feel like a bargain bin laptop from Best Buy.",
            "points": "4 points",
            "children": [
              {
                "comment": "But most users use Facebook, so for them it's actually a service to have it at first boot",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I get promotional emails from Samsung that despite unsubscribing from, keep coming. I also had to physically go in and turn off notifications that are pushed from their shopping app.\n\nI'm paying $2000 for a phone. My iPhone 12 didn't pull crap like this. It booted up and worked. After the S22plus, I think this will be my last Samsung. Next phone is a Pixel or another iPhone.",
            "points": "3 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "When I get a new iPhone, all I do is log in…\n\nIt’s.. it’s.. beautiful.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I've never owned a Samsung for that reason. Spent a few years working at a cell phone store, and learned to dislike Samsung.\n\nIve owned a few HTC, Motorola, tlc, Huawei all been great.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I feel like modern phones, the bloatware doesn't really affect day-to-day usage. Phone still run really fast and storage isn't really much of an issue. And if you really don't like you can disable most apps or inactivate features that you don't use.",
            "points": "1 point",
            "children": [
              {
                "comment": "I have zero bloatware on my iPhone. Bloatware is a Microsoft and android problem.",
                "points": "-3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "This is why iPhone",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "TBH I don’t see any reason to buy a Samsung over a Pixel.",
            "points": "-2 points",
            "children": [
              {
                "comment": "Well, let’s start with the fact that you can purchase a Samsung Galaxy device pretty much anywhere…meanwhile Google still seems to believe that the world is only comprised of 12 or so countries for some asinine reason",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "IMO, we've reached a point in phones where they haven't been remarkable for like 5 years or more. It just feels like nothing has really changed since the iPhone X/ S10 came out, other than prices going up.\n\nUntil phones get a dedicated GPU, or real AI assistant integration, I don't really see any new phone as remarkable. Maybe the folding phones are cool or something, but they are far too expensive for me to even consider",
        "points": "67 points",
        "children": [
          {
            "comment": "If you skip a few generations you definitely notice several considerable improvements to both screen, speed and camera.",
            "points": "27 points",
            "children": [
              {
                "comment": "Sort of. After the 13 there isn’t much difference at all. Promotion was a game changer for the pros but even the 12 with 5G is perfectly usable. Last two are iterative and I don’t see many reasons the 16 won’t be as well.\n\nI still daily an xS and honestly it’s passable. The 13 Pro is my upgrade, plenty of great prices for them in mint condition.",
                "points": "11 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "To me, phones have now reached a similar plateau to what cars reached in the last 30 years or so: Sure, you get minor new features here and there (many of them just gimmicks) and maybe some gains in efficiency and power but to the average consumer, who just wants to get to work and back, the machine has stayed largely the same. Drive it for 10+years and replace it when it becomes more trouble than it's worth.\n\nPhones are there now. They're just a tool that can't really be meaningfully improved and you only really need to replace it once it actually gets worn out.",
            "points": "8 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Since the iPhone 8 and iPhone X (same SoC), the biggest change has been in the cpu. The iPhone 11 was a massive jump, but since then, there’s very little reason to upgrade. I have an iPhone 12, I want usbc charging, but it hardly feels like time to buy a new phone over the charge port.",
            "points": "15 points",
            "children": [
              {
                "comment": "I had in iPhone 11 Pro Max for the last 6 months and my boss got an iPhone 15 in that time. We couldn't believe how little changed other than the hole punch and USB-C. literally that iPhone 11 was perfectly fast too, which normally can't be said about a (going on) 5 year old phone",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I'm still using my S10+... going on 7 years now. I dont see any reasons to upgrade, it runs present day apps like a breeze and I play games on it too. Battery still lasts me through my day as well",
            "points": "2 points",
            "children": [
              {
                "comment": "i still use mine as well and i have the same experience, still running strong. but the s10 came out in 2019 so its been 5 years not 7 haha",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "That's why im still running my iphone x from 2017. Everyone called me dumb for blowing so much on a phone, but its been the best phone ive ever owned and its lasted over 6 years",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I critique both Apple and Samsung because even though they’re the best in the business they have many missed opportunities due to complacency.\n\nThe S24 Ultra is actually the first phone in recent years that introduced something that we didn’t know we needed and is immediately noticeable: an extremely good looking anti reflective coating that not only minimizes reflections but saves battery by making the screen readable at lower brightness AND also makes colors pop more with a darker black level for improved contrast.\n\nIt’s such a simple thing that the OLED TV industry has been doing for years with great results, it’s weird how it hasn’t been applied to smartphones extensively.\n\nI’m only pending durability results to see if users complain about uneven colors/coating after months of use but if not it’s something great that I’ll look forward to on my next phone.\n\nOtherwise yeah it’s an overall uninspiring update, but this has become the norm lately.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Good, because he's right.",
        "points": "34 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I hated Android because I'd mostly only seen Samsung phones that other people had. Then I tried a Pixel and realised it wasn't Android, it was Samsung and their software modifications. Wasn't quite enough to pull me away from iOS, but if I wasn't already invested in the Apple ecosystem I probably would have chosen the Pixel.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is kinda a shit take considering what Samsung are doing with flip phones and foldable screens.\n\nWhat are people expecting? The candy bar form factor won, so the camera, screen and battery are only going to see incremental improvement.\n\nIf you want something radical, you're going to introduce it in a new product line, like they did with the Z line-up.",
        "points": "17 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I thought so. I was kind of pissed at first because I got an s23 Ultra about a week before the s24 Ultra came out, but after looking at the changes, it's pretty much the same phone. Not only that, but I heard the AI stuff was going to be behind a pay wall.\n\nIMO, I think it's gotten to the point where phones need to be like gaming consoles. Instead of releasing every year, just release a new model when there is a big enough change to consider the new model as an upgrade.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Have we reached that point where’s there is nothing really new to add to smart phones?",
        "points": "4 points",
        "children": [
          {
            "comment": "they are milking the customers.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Reached that point in 2019",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Maybe aping Apple at every corner a few years late while also mocking Apple is not the best business practice.",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is what happens when your business model is to produce a new model every year regardless of if its actually worth it.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Samsung and Apple are just good at improving their margins on the price. For a $1k+ phone, I would expect an IR blaster as standard. Samsung did away with them several years back and yet I think they provide such a utility to have your phine double as a remote.\n\nJust as well the Chinese brands still pack all their phones with features.",
        "points": "14 points",
        "children": [
          {
            "comment": "Honestly, the IR blaster is a thing of the past only because the push for internet of things in the household has been so aggressive that it worked, and now average consumers have everything connected to wifi which is app-controlled, and now is essentially the standard. Why control your somewhat recently new TV with IR when it connects natively to wifi via app? For the older stuff like older TVs and disc players, the IR is great, but I think they refuse to focus on \"the older stuff\" since everything now is purely digital.\n\nIn 10 to 20 years physical media will not exist. It's gonna be a huge test on whether the user will own what they \"buy\" (which today really means \"license\".). For the EU, consumers will be just fine.\n\nEverywhere else on earth though...",
            "points": "6 points",
            "children": [
              {
                "comment": "I buy my phones for today, not 10 years from now where itself will be an antique.\n\nI have many devices that support IR including air conditioners, TV, fans and a projector and I don't see them being superceded in the next 3 years (and I've been using them in the 10 years since Samsung discontinued implementing IR in their phones).\n\nPhone companies like to sell you the idea that they're forward thinking but in effect they just want to make their phones cheaper to manufacture by removing features.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The companies want innovation so they have a reason to sell new phones to people who already have a phone, but do consumers want innovation? No, I don't think they do. They don't want a phone with a weird pop-up camera instead of a front-facing camera, they don't want a phone that's twice as thick to hold a bigger battery, they don't want a phone with a second display on the back, or a phone with active cooling and ventilation for hardcore gaming, or a phone with completely open-source modular parts and software. These phones all exist and they barely make a splash because although there's someone out there who wants each of them, none of them are what the public as a whole is actually looking for. The public as a whole just want whatever is like what everyone else has. There's so much desire in the large cell phone market to fit in rather than have some weird niche phone that has downsides that people might make fun of you for. Hell, one of the main reasons that the iPhone has finally reached the top of the global market share is because kids literally shame people who have \"green bubbles\".\n\nIf anything, the Galaxy S24 being \"disappointing\" to this Samsung chairman should be taken as a good thing for you, the consumer. It means they're running out of ways to extract more profit from you. Your current phone is so good that they can't figure out how to upsell you. So keep it, and be happy!",
        "points": "5 points",
        "children": [
          {
            "comment": "because kids literally shame people who have \"green bubbles\".\n\nWho cares? No one gives two shits what kids think or say. Kids are idiots.\n\nNo rational adult is buying phones to impress anyone else. They are tools. They do a job. Adults buy the platform that does what they need to do.",
            "points": "2 points",
            "children": [
              {
                "comment": "I'm not necessarily saying adults buy phones to be flashy status symbols; kind of the opposite, really. In my experience, most non-tech-enthusiast adult consumers will simply buy the latest offering from the brand they trust (Apple or Samsung, or maybe Google these days) because they want to depend on their phone being \"good\" and \"normal\". Whether it's fearing being shamed for having green-bubble texts, or fearing that you'll buy some weird off-brand phone that your kid doesn't know how to help you fix or is somehow incompatible with the app that you always use, the common factor is that being part of the crowd is actually a pretty important factor for most phone-buyers, especially non-tech-enthusiasts. Not just to \"fit in\", but also because being part of the crowd - being on a flagship model of a well-known brand - puts you in the best position for your phone to just work how you expect it to, and how everyone else around you expects it to.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "haven't seen an S23 or newer in person, but from what I can tell, Samsung is starting to do the same thing as Apple: release the same phone every year with very minor changes",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Smartphones are powerful enough for the next decade, only thing that still hasn't had major innovation is the battery tech. Quick sharge is one thing, but storage capacity has plateued for years now.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Phone innovation has been stale, apart from more than one rear camera starting with the galaxy s9 or something else way back then, and foldable/flexible tech.\n\nTake a look at laptops instead- 3D (glasses-less) displays, impressive performance with the power of a phone, ARM based devices actually looking to compete against x86 systems in performance, modularity and easily replaceable components+diy solutions... There's even a laptop coming out, where the screen is literally just an android tablet! Phones can learn a thing or two from these larger devices (and in turn laptops can learn for example how to get better webcams installed)",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We finally did it guys! After copying the iPhone for years we finally beat them at their own game!",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I mean, at this point, what's really exciting about mobile phones? Honest question. I haven't seen anything that peaked my interest over the last 10 years or so, besides a slightly better camera.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I use an S10+ currently and need to upgrade after 5 years soon. I don't know what I should upgrade to though... 🥲",
        "points": "2 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "samsung galaxy s25 it is then",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Standard c-level speech lol.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "as someone who picked up a s23 ultra a few months ago and was contemplating waiting for a s24 i agree with that comment, there's really nothing new of interest in this model for me. just ai gimmicks and a slight camera change",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They already have the flip and fold, it’s like the new note line before that caught fire (figuratively and literally)\n\nIf they want risk convincing people to move from a rectangle, lower the price. If still wanting a rectangle they’re probably looking for something to last a couple of year",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Bring back removable battery and minijack port.",
        "points": "3 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "\"Upgrading\" from my S20 at this point would net me an inferior screen and an inability to use a microSD card, and cost me $800 for the privilege. Why would I even consider it?",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There’s 0 hype behind the S24, it’s time to change the design Sammy…",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Thanks, Exynos!\n\nSeriously, Samsung should've just stuck with Qualcomm's Snapdragon chip sets.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I want a phone I can put in my butt - chairman",
        "points": "2 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'm not buying a phone without a headphone jack. Don't know why they thought getting rid of that was a good idea.",
        "points": "1 point",
        "children": [
          {
            "comment": "If it has a USB C port you can buy a usb c to headphone cable for a couple bucks.",
            "points": "-1 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Their phones have become progressively worse each generation. They peaked with S10 series and its been downhill since then.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There only thing worse than an iphone is Samsung bloatware.",
        "points": "3 points",
        "children": [
          {
            "comment": "Main reason I haven’t messed with a Samsung phone in years. The features of the phone might be interesting but they go and screw it all up with all their added baggage",
            "points": "2 points",
            "children": [
              {
                "comment": "It takes some effort to dump the bloat and you can use Nova launcher to use the basic Android style. I recently went back to iphone and have hated every minute of it. Plan on going back next year",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "One thing I would like to see Samsung do I make it easier to cancel Samsung Care. It’s either call them or mailing them a request. It should be online with list of all devices and the care and an option to stop it. I am still getting charged for devices that I don’t have anymore.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Someone deliberately made 24 weak as a filler so 25 would look better in comparison.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm satisfied with my S23 though.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As if iPhone 15 had any shift in innovation . It’s the same as it preceding ones. Only reason why ppl brought them was bc they had old iPhones",
        "points": "1 point",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Samsung chairman calls Galaxy S24 series \"more disappointing than iPhone\" at high-level meeting\n\n￼Samsung's chairman wasn't impressed with the Galaxy S24 series (image via Samsung)\n\nCritics have long pilloried Samsung for its conservative approach to its high-end Galaxy S smartphones. Apart from an upgraded SoC (and a 1440p screen in one instance), the Galaxy S24 and Galaxy S24+ offer virtually no upgrades over their predecessors. Similarly, the Galaxy S24 Ultra ($1,299 on Amazon) has also been mocked as a Galaxy S23 Ultra with AI features sprinkled on top. Samsung's top brass seems to agree with the sentiment.\n\nNaver news reports that Samsung convened an all-hands meeting of its many departments. Department heads of Samsung Electromechanics, Samsung Display, Samsung Device Solutions (DS) and 40 other CEOs were in attendance. Lee Jae-Yong spearheaded the meeting and showed everyone a video highlighting the difference between Samsung and its competitors.\n\nHere, Lee said, \"Galaxy smartphones are more disappointing than iPhone in this regard\", hinting at a lack of innovation and years of incremental upgrades. This could result in a massive shift in Samsung's strategy moving forward. Chinese OEMs have run laps around Samsung flagships for some time by offering high-wattage fast charging, copious amounts of RAM and top-spec cameras, many times for a fraction of the price of a similarly-specced Samsung counterpart.\n\nOnly time will tell if this leads to any meaningful change in Samsung's strategy. A previous leak hinted Samsung could switch things up with the Galaxy S25 and Galaxy S25+ by using a Sony camera sensor. The Galaxy S25 Ultra will come with variable zoom, and the Galaxy S26 Ultra could be the first of its kind to use a 1-inch sensor. The Galaxy Z Fold6 and Galaxy Z Flip6 are also rumoured to shed some weight and come with larger displays.\n\nSource(s)\n\nNaver (in Korean)",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19egejg",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.pcgamer.com/our-long-term-objective-is-to-make-printing-a-subscription-says-hp-ceo-gunning-for-2024s-worst-person-of-the-year-award/",
    "title": "'Our long-term objective is to make printing a subscription' says HP CEO gunning for 2024's Worst Person of the Year award | Not satisfied with merely bricking printers, HP now wants to own them all forever!",
    "points": null,
    "comments": [
      {
        "comment": "🤔\n\nMy long-term goal is to never buy another HP printer.",
        "points": "1593 points",
        "children": [
          {
            "comment": "After all the controversy over the years, I switched to Brother printers. Couldn't be happier and have no issues using 3rd party ink.",
            "points": "588 points",
            "children": [
              {
                "comment": "I’ve heard nothing but good things about Brother. Not to say they’re perfect, and I’ve never had one, but that’s my next printer after my 2004 Samsung printer dies.",
                "points": "199 points",
                "children": [
                  {
                    "comment": "Never had a problem with any Brother printer.",
                    "points": "81 points",
                    "children": [
                      {
                        "comment": "The only problem with a brother printer is the initial price. A brother laser jet will set you back $200+ for black and white without a scanner.\n\nHonestly it’s worth every penny though. I use mine often and have had zero issues with it",
                        "points": "45 points",
                        "children": [
                          {
                            "comment": "$200? Not really. They start at like $120 on Amazon, and sometimes go on sale for less.",
                            "points": "39 points",
                            "children": [
                              {
                                "comment": "And they just. Fucking. Work. You plug in your laser printer, connect it to your WiFi, and bam, you’re printing things from your phone in ten minutes. HP will have you download drivers and shit. Brother products are apple-like in their user friendliness. I thought one ten years ago, have printed thousands of pages, and it’s humming along beautifully.",
                                "points": "58 points",
                                "children": [
                                  {
                                    "comment": "On the flip side, I print like 1 page every year in a very dusty desert environment and the Brother is yet to jam or disappoint. Was a Nokia in a past life...",
                                    "points": "26 points",
                                    "children": [
                                      {
                                        "comment": "years ago I salvaged one with a \"bad drum\" from the trash pile at work, pulled a drum and a few \"empty\" toner carts from some others that were being tossed. It's more than enough to print the few documents I need every year.",
                                        "points": "5 points",
                                        "children": [],
                                        "isDeleted": false
                                      },
                                      {
                                        "comment": "Im glad I work for a company that I can print oersonal crap off of if needed. I barely need a printer these days and when I do, company oays for it without any idea.",
                                        "points": "1 point",
                                        "children": [],
                                        "isDeleted": false
                                      },
                                      {
                                        "comment": "",
                                        "points": "",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "Brother printers aren't Apple-like in any way as they're actually user friendly, will last, don't require you to buy another brother device just to use it, and don't try to stop you from going outside of their \"ecosystem\".",
                                    "points": "1 point",
                                    "children": [
                                      {
                                        "comment": "Ok they are definitely apple-like in the sense that you can unbox them and be using them ten minutes later.",
                                        "points": "3 points",
                                        "children": [
                                          {
                                            "comment": "Apple devices tend to work great with other apple devices. Not so much with anything else since a lot of their stuff is propriotary, and advance users will probably look into getting something else that gives them greater control over their devices.\n\nIt's probably good enough for the average user, but Apple's entire buisness strategy revolves around getting as many people to buy into their ecosystem, as much as possible, and then making it as painful as possible to leave.\n\nFor example: ICloud does make it more convenient to get a new phone, but only an IPhone, if you want to get an Android (or something else) and keep all your data on the new phone then you need to manually download everything and then upload it to the new device (I'm not sure if it's even possible to download stuff on ICloud in bulk).",
                                            "points": "-1 points",
                                            "children": [
                                              {
                                                "comment": "",
                                                "points": "",
                                                "children": [],
                                                "isDeleted": false
                                              }
                                            ],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      },
                                      {
                                        "comment": "seriously. A coworker talked me into getting an Iphone.... what a piece of garbage that thing is. I cannot wait for an excuse to go back to android, everything apple is terrible IMO.",
                                        "points": "-1 points",
                                        "children": [],
                                        "isDeleted": false
                                      },
                                      {
                                        "comment": "",
                                        "points": "",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              },
                              {
                                "comment": "Yeah I just started looking (My HP fucking sucks), and Brother printers seem comparable in price. $200 was for black and white with a scanner.",
                                "points": "5 points",
                                "children": [],
                                "isDeleted": false
                              },
                              {
                                "comment": "",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "??? I got mine for like 79 bucks and it's even the wifi version so I can print off my phone.",
                            "points": "3 points",
                            "children": [
                              {
                                "comment": "",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "hell no, the multi function brothers are easily 150-200 with EVERYTHING",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "Nah. I got mine for 50 bucks. Always shop on the weekends. Best buy in particular always has \"sales\" on weekends between like 8am and 1pm.",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "They don't have type 4 drivers which makes deploying them a pain",
                        "points": "4 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I own a HP color laser printer and a Brother color laser printer. Brother is everything it's hyped-up to be.",
                    "points": "23 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "My brother black and white laser I bought a couple years ago has been great, still on the first toner cartridge and text looks better than any inkjet. If you have no need to print color I'd ditch inkjets immediately.",
                    "points": "16 points",
                    "children": [
                      {
                        "comment": "My Brother color laser has been fantastic also. Two years in with two high schoolers, a middle schooler and two working from home. Cost a little under 500 and would have spent that much on ink for an inkjet.",
                        "points": "5 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Case in point! We could STILL be charging you monthly 🤣",
                    "points": "10 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "The only issue I have with my 10+ year old brother wireless laser printer is now after sitting 30+ days in between prints, it sometimes doesn’t wake up and has to be power cycled. Otherwise I have changed the toner once. I think I have $40 tied up in the thing.",
                    "points": "8 points",
                    "children": [
                      {
                        "comment": "You could put that on a home automation switch and set it up to turn off then on every 30 days.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "If the devil ever offers me that deal, I’ll take it.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I have a Canon also from 2004. I got it for free with a computer I bought back then. The computer isn’t around anymore but the printer is still chugging along. I can use generic ink too. But my husband and I agreed that our next one will be a Brother, if we ever need a next one. Eff HP, we will never get one of theirs.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I have a Brother sewing machine and it so far seems simple and rugged.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "I've owned Brother sewing machines for 15 years and the only reasons I've ever replaced mine was to upgrade.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Been doing Brother for laser and Epson Ecotank for inkjet. Works out great. Epson printers cost about an extra 100 bucks, but that’s made up for when you refill the first time.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I am in exactly the same boat, except my Samsung is newer. Hell, I thought I killed the Samsung a couple of times in the last nine years, but it's always recovered somehow.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I bought a brother laser printer 10 years ago and still running strong. My high end HP printer that I bought last year to print color documents has had a dozen or so issues. HP has sent me 3 replacements so far, each one worse than the previous model. Get a brother and be happy.",
                "points": "9 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I have definitely had issues with the third party toner cartridges, not recognizing cartridges, not dark enough even with printer calibrated to darkest setting, black splotches on the paper so I use genuine only. But with the large cartridges even the genuine is less then $.01 per page. I print 30k sheets a year though so it adds up. If anybody has some good brands for knock off cartridges I would love to hear them. I use the 880.",
                "points": "6 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "+1 on brother and their very affordable color laser printers.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Yep, and love toner no more ink. Also, I can reset the cartridges so they think they are full and squeeze that last bit out before buying a new one.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "This sub when someone mentions printers.\n\nBut really, my Brother printer has been great for over a decade and I'm still on the toner that came with it.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "If they are going to charge me a suscription, they I expect them to rent me the whole system. Priner AND ink.\n\nIf they expect me to pay for a printer that only works with their suscription for ink system, they are delusional.",
            "points": "31 points",
            "children": [
              {
                "comment": "This is how the large scale printing industry works. You buy or lease the $50-100k machine, then pay a monthly fee based on “clicks” which is less than a fraction of a penny per page. That fee includes ink and maintenance. That’s why printshop printing is so much less expensive than home printing.\n\nHP is trying to apply this same model to home users, with none of the user benefits. It’s absolutely absurd.",
                "points": "20 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I just don't buy HP products period. Bought a brother laser printer, will never own another HP product ever after the absolute predatory printer garbage.",
            "points": "23 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "How about a life-long goal? Guarantee they will NEVER get your money? It's only fair.",
            "points": "13 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Ditto. My last one would refuse to print after about 200 b/w pages from an “XL” cartridge. My last straw was when I put in a brand new official cartridge bought over the counter at Office Max and it said it was counterfeit. Immediately went back to the store, returned the cartridge, and bought one of those ecotank printers. As a grad student, I print off maybe 600-1000 sheets every week, and a full tank w/this printer lasts a full semester. I junked the HP; donating it would’ve only put the problem in someone else’s lap.",
            "points": "9 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Coincidentally, also my short-term goal.",
            "points": "8 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "For reals, who's still buying hp?",
            "points": "5 points",
            "children": [
              {
                "comment": "People like my grandmother who don't know any better. Just walk into a store, see a million cheap HP printers, buy one, then never get to use it because the hoops you have to jump through are fucking absurd. Meanwhile HP is laughing as they head to the bank.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Edit: Any HP Product. Their Laptops are shit, the bloatware is borderline malware.",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yeah, do they realize other companies make printers? This sounds like a recipe for going out of business.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I’ve never particularly had an affiliation with one brand or another, when I replace something, say a laptop, it’ll be whatever is well rated at the time for the price/spec I’m after.\n\nThat changed with an HP “Elitebook” laptop I bought a few years ago with a “leaky” battery, and by leaky I mean charge it up, not use it for a week and when you went back to it, the battery was half empty (though it had an expected battery life when in use).\n\nContacted HP support, they said “totally normal” and refused to do anything.\n\nNot planning on buying an HP laptop again.",
            "points": "4 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "HP products in general",
            "points": "2 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I honestly don't know if I'll ever buy another printer period.\n\nI could not even tell you the last time that I printed something, but it was at least 3-4 years ago.",
            "points": "2 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Sign me up for not buying any HP products ever again",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This is the only way to shut these shitty practices down. Vote with your dollar and buy from a company that actually lets you own it out right.",
            "points": "2 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "My short term goal because I already fulfilled it a month ago.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Can't wait to never print again in my life.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You're doing it all wrong, you're supposed to buy several of them then shoot them with your guns! /s",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why people still pick HP over Brother is beyond me",
        "points": "436 points",
        "children": [
          {
            "comment": "“Because it’s the same brand as my computer!!”",
            "points": "128 points",
            "children": [
              {
                "comment": "HP computers are pretty mid as well tbh. Just not dog shit like their printers",
                "points": "93 points",
                "children": [
                  {
                    "comment": "Well, lower mid range...indeed, they were piss-poor to appalling before they acquired COMPAQ.",
                    "points": "37 points",
                    "children": [
                      {
                        "comment": "When acquiring Compaq actually improves the quality of your product...oof.",
                        "points": "19 points",
                        "children": [
                          {
                            "comment": "Hey! My first computer was a compaq.\n\nIt was definitely something.",
                            "points": "9 points",
                            "children": [
                              {
                                "comment": "",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Their data center stuff is pretty decent though.\n\nNever buy HP consumer grade anything",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I did without knowing any of this. I feel HP is playing a dangerous game where they're still seeing numbers as people are not as aware of the printing space but I can personally guarantee I'll never buy a HP printer again. I assume everyone who owns a new HP printes is like this\n\nThe only reason I looked into HP to begin with is because their old printers were good and lasted decades",
            "points": "24 points",
            "children": [
              {
                "comment": "Yeah, HP is coasting on brand recognition and their early 2000s era printer reputation. Nobody should ever buy an HP printer in 2024.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I bought the cheapest HP printer I could back in 2008 for $35 and have not bought a new one since.\n\nI think it may be a response to remote work making more things digital. They know they are going away. They are hoping to lock in customers into forgotten subscriptions much like AOL still has 1.5 million customers as of 2021 for dial-up.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "My dad. Boomer, mid-70’s, lives alone and often refuses ‘help’ or advice from his kids. He has bought a new one almost annually for the last 10 years because he can’t get the current one to work. He has to print everything. I set up his new one a few weekends ago and told him he keeps buying garbage, but, “I got the best one this time!” Closet full of old ones he keeps trying to give to us.\n\nHe’s a cookie cutter, tech-illiterate boomer. I feel bad for him because he recently said, “I used to be on top of the tech-y stuff, I don’t know when I got so lost…” That made me sad. I’m getting him a brother (printer) this year. He’s a good dad.",
            "points": "9 points",
            "children": [
              {
                "comment": "\"no you didn't, you bought what some salesman told you is the best\"",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Worse than that. More expensive = more better…",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Stop buying inkjet printers. They're garbage. Some brands are better than others, but the root problem is the technology, not the company.\n\nMy parents were in the same boat as your dad for a long time until I finally broke down and bought them a color laser printer. I haven't had to touch that thing since I installed it for them a few years ago.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Snagged a brother laser from a thrift store 5 years ago. Most dependable printer I have ever owned.",
            "points": "20 points",
            "children": [
              {
                "comment": "Found mine on FB Marketplace for TWENTY DOLLARS\n\nI was thrilled. Drove an hour to buy it. Lady was like \"Wow, I can't believe you drove so far to get this.\" Umm, yes, I'm buying the last printer I will ever need, for TWENTY DOLLARS. I bet she replaced it with some stupid InkJet so she could print in color.",
                "points": "19 points",
                "children": [
                  {
                    "comment": "Got mine for free of FB marketplace. Color laser printer/scanner/copier/fax. Thing's a tank. Works great. Works with generic toner and I can get the full black and color toner set for like $50. Some lawyer was moving out of state and didn't want to drag it with him. Beat $0 I've ever spent...",
                    "points": "9 points",
                    "children": [
                      {
                        "comment": "Truly ideal",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "not only that, these subscription plans are actually popular and highly rated. I think it is because people dont know any better.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "After a shitty Epson I’ve been using a cheap HP laser without major issues and only just replaced the original toner after like 3-4 years. The ink side seems to be a whole different ball game.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Because nobody has ever heard of Brother. I’ve literally only heard of it in these hp Reddit threads, but I find it odd how much I here about it here. It’s like every comment. Is brother the only other company that makes printers?",
            "points": "3 points",
            "children": [
              {
                "comment": "I love my Canon color laser MFP!\n\nBrother has been doing printers forever.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Right? All of these HP hate/bash threads look like a sponsored Brother ad campaign. 🧐",
                "points": "-3 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I have been into personal computing since 1989. In all that time, the only constant has been that printers were, are, and will forever be the spawn of Satan himself, dooming us all to misery and pain. HP is just being the loyal servant of the dark lord, as he demands.",
        "points": "222 points",
        "children": [
          {
            "comment": "I thought that until I got a brother mono laser ten years ago and printing (and I'm a lawyer who is forced to print a lot) is boringly reliable AF.",
            "points": "51 points",
            "children": [
              {
                "comment": "In the 10 years I’ve been married I’ve owned 3 goddamned HP printers. Every time we’ve decided to replace them my wife just goes online and buys yet another goddamned HP printer. Yet my brother has had the same non-HP laser printer for 15+ years and it’s just chugging along like it’s brand new. My question for you is… is a laser jet cheaper than a divorce?",
                "points": "10 points",
                "children": [
                  {
                    "comment": "yes... just buy it now... and say the hp is broken...",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Seconded! Just for our home, but unless there’s no paper, it prints and it prints fast. And paper is now our biggest printing expense! Last toner cartridge I bought was rated for 5500 pages and it was 20 bucks.",
                "points": "8 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Bizarre how perverse the incentives are for the entire industry. They'll sell you the whiz-bang hardware that is honestly kind of amazing for a couple hundred bucks and then once they've got their teeth sunk in you they'll charge you hundreds again for something that costs literal pennies to produce.\n\nI can't think of anything else like that. Imagine if they sold you cars for a couple thousand dollars but then had to use their gas for $100/L.",
            "points": "4 points",
            "children": [
              {
                "comment": "Medicine",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "24-pin oki on tinfoil",
            "points": "3 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yeah I don't get it. Humans can do remarkable things, but printers are still shit.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I wish a very quick and brutal chapter 11 on HP as a company.",
        "points": "66 points",
        "children": [
          {
            "comment": "which one thou\n\nThe real HP rebranded as Agilent Technologies and it's spinoff, Keysight Technologies, they make test equipment. HPe is the enterprise and software arm. HP, inc. makes dogshit consumer products.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Sick of these greedy asshole companies and their SAS bullshit. Make a product, sell it and get the fuck out of my pockets.",
        "points": "155 points",
        "children": [
          {
            "comment": "This is more Hardware as a Service actually... which is even more fucked.",
            "points": "58 points",
            "children": [
              {
                "comment": "It's like all the hardware subscription features that car manufacturers are trying to sell. Give us $10/mo if you want us to unlock your cruise control! Another $10 if you want heated seats! Just die in the fire, you greedy swine.\n\nI used to have remote start functionality on my car, via an app on my phone, but then after two years it ballooned from $5/mo (which was already too much) to $15/mo, so I had to cancel. Bullshit.",
                "points": "15 points",
                "children": [
                  {
                    "comment": "Back in the day we woulda strung em up like swine",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Maybe they were onto something back in the day.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Not really, it's just leasing and is everywhere already.\n\nNot saying I want to lease a printer, but just pointing out that leasing a physical device is not unusual.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "Would it still be leasing if you paid full price for the car and then it refused to run if you went to a non-approved gas station?",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "HP, the non-partisan cause for cancel culture",
            "points": "-3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I’d rather hand write a document before I pay HP a dime for printing.",
        "points": "39 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We FINALLY got a new printer last year after a few disappointing HP years - and I can honestly say that it's the first time i shopped and chose a product based ENTIRELY on what I've seen discussed on Reddit. Went with Brother and I could not be happier.",
        "points": "25 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I have an old Epson printer and have been using cheap ink from Amazon for a while. I get a warning but that's it.\n\nI fear the day when it dies and I have to research this crap to avoid scummy companies and products.",
        "points": "38 points",
        "children": [
          {
            "comment": "If you dont need the glossy prints from an inkjet printer, just get a Brother laser printer if you can.\nDid that 5 years ago after 20+ years of using HP/Epson/Canon and have not had any issues.\n\nNow, if I need to print something glossy I do it in a print shop.",
            "points": "30 points",
            "children": [
              {
                "comment": "I have a Brother laser printer that I purchased 9 years ago. It still going strong, had to change the cartridge only 4 times in that whole period. Each cartridge goes for $14 on Amazon/ebay. I Couldn’t be happier.",
                "points": "9 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "HP is complete trash. I don’t understand how anyone still buys their products.",
        "points": "18 points",
        "children": [
          {
            "comment": "HP also bought Polytronics and seemed to discontinue the only wireless earbuds that fit in my ears. I need a new pair and can't get them. Screw HP for the dozenth time.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "hp is fine as an enterprise solution\n\nas a consumer, they can eat a bottomless pit of flaming dicks",
        "points": "76 points",
        "children": [
          {
            "comment": "They aren't even an enterprise solution, they make shitty bigger small printers and label them enterprise.\n\nEnterprise printers are Lanier/Ricoh, Konica Minolta, Canon etc, where you get contracts that include all servicing and consumables for a fraction of what HP want to ask, on units that dump all over HP stuff.",
            "points": "54 points",
            "children": [
              {
                "comment": "HP builds the Indigo and Pagewide web press systems.\n\nIndigos are usually the size of several cars and the Pagewide you need a warehouse.\n\nThey use much better tech than their consumer brand and are definitely not just big deskjets.\n\nI know people who work for HP's printer division. They use Brother printers at home and roast their consumer line more than reddit, but they're pretty proud of the enterprise stuff.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Enterprise-size isn't factory sized though. Most people mean ordinary enterprise printing needs. Those are not for that task at all.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Then why tf would people by an HP printer? HP isn’t exactly the brand name it once was with so many other reputable competitors in the space",
                "points": "7 points",
                "children": [
                  {
                    "comment": "Because marketing and stupidity. You would be surprised at the number of companies who have absolutely no bid process, or any checks on their purchasing at all. Some random guy in some random department decided to go with HP and nobody bothered to compare other solutions.",
                    "points": "16 points",
                    "children": [
                      {
                        "comment": "Marketing in the consumer market for people who don't know any better. \n\nLaziness for office managers who can't be bothered to comparison shop because it isn't their own money they are spending anyway.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Because people have no ability to comparison shop",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "A free HP printer with a computer purchase was usually how we got our HP printers in the past...\n\nI remember most recently we declined to even take the printer when purchasing my mom a knew all-in-one desktop.\n\nThe weird part was that we were buying a Dell lol",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Bottomless pit of flaming ducks added to my repertoire.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "But why would you go with them in an enterprise? Ricoh, Brother, Xerox, the list goes on. If I were recommending a printing solution to a business, HP's blatant anti-consumer, selfish actions would strike them from the list pretty quickly.",
            "points": "2 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Do they have to eat the dicks or the pit itself, containing the dicks?",
            "points": "1 point",
            "children": [
              {
                "comment": "both, ideally",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "“Under communism you won’t own anything” - capitalist",
        "points": "22 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "He serves on the board of directors for PayPal and is a member of the World Economic Forum’s International Business Council\n\nSource\n\nWhy am I not surprised. And for those who don't know, this is the future you're looking at, when the WEF said \"You will own nothing and you will be happy\" what they mean is \"You will be too cheap to actually buy anything so everything you will have is going to be rented/leased/loaned\".",
        "points": "7 points",
        "children": [
          {
            "comment": "\"we're not gonna pay you enough to buy anything so you're going to have to lease\"",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Look at what's happened in entertainment. You pay for internet access, then pay for a streaming service, and now they're putting ads in the content. The list of things you have to pay for just goes on and on...then come the commercials.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I actually need to buy a printer today. Guess I know which company I won’t be supporting.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This genius CEO convinced me to never buy HP product",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"in the future you will own nothing and you will love it\" idk about that second part.",
        "points": "4 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If HP ever buys Brother it will be a sad day in the world.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well it has to be a subscription, and they must be allowed to install really aggressive DRM too, but that is due to the hacking news also floating around, and is totally unrelated.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yeah they suck. I will never buy HP again. Back in the 70s they made good calculators.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you work in IT for a company or government agency, please recommend Dell for your fleet because of HP's egregious corporate behaviour.\n\nAnd tell your sales rep why.\n\nThat's how they will listen.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Overpaid clown!",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You will own nothing and be happy",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Reddit loves Brother. I might go with that next. But I print very little, have used a multifunction color laser Lexmark for many years and they still update the firmware from time to time. Talk about product life.",
        "points": "2 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "HP doesn’t make printers, they make ink",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Anyone who buys anything from hp, at this point, is just a sucker.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Brother or bust. Brother is the Toyota of printers.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "HP sucks, but all printer companies pretty much suck. Brother b&w laser printers are fine (I own one) but where is the cheap color option? There isn’t one.",
        "points": "1 point",
        "children": [
          {
            "comment": "I’ve been happy with my color Canon Imageclass from Costco that I picked up at the start of the pandemic. Been using generic toner off amazon.",
            "points": "4 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "If you print semi regularly Epson EcoTank is a very reliable and pretty cheap solution. If you print regularly EcoTank becomes even cheaper since they charge so little for ink. \n\nFor instance right now Costco is selling the Epson ET-2850 on sale for $199, and even comes with an extra bottle of black ink. Which means for $200 the printer comes with enough ink to print 15,000 (7500 x 2) black and 6000 color pages. That's maybe 3 to 5 years of printing for normal households, and afterwards, a pack of CMYK ink which is rated for 7500 black and 6000 color pages costs less than $80.\n\nI've owned a higher end EcoTank for almost 2 years now,  and it really is a great printer. I even wait until Epson sells photo paper on sale and print photos on it. The ink is so cheap you can do that without quickly exhausting the ink. \n\nOnly issue with the lower end 2850 is it due not have a easily replaceable waste ink pad because you would need to use s third party solution to reset the software counter,  but that is not something to worry about until you've printed like 25,000 pages.  You can always buy it from Costco, make sure it is working well for you, and if you want to keep it, disable auto firmware update on the printer to make sure you can still 3rd party reset the waste ink pad counter 5 years doen the road.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I bought a Brother color laser (led) for under $300. It rocks",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "For the life of me I cannot remember the last time I printed something",
        "points": "1 point",
        "children": [
          {
            "comment": "That’s the real solution to the problem. Almost nothing needs to be on paper anymore.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Does it make sense to have a subscription if you actually use the ink and it’s automatically ordered when you’re running low?\n\nGf is a teacher and prints from home a lot for work. At first i was absolutely against it, but its actually worthwhile for us at least.\n\nStill bullshit they don’t allow 3rd party ink tho.",
        "points": "1 point",
        "children": [
          {
            "comment": "I have no clue why people like shopping for ink. I love having it delivered. It was annoying trying to find the correct cartridge for whatever I had.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I would never consider getting anything other than a brother laser printer, and that is what I have suggested to everyone for many years. If you want a color print, go to Kroger and pay for one",
        "points": "1 point",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "They can fuck right off",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Up next, 3D printings will belong to the maker of the those printers.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Isn't printing already a subscription for 99% of its users, i.e. businesses?\n\nNobody owns those giant copier/printer machines, they are all leased and I assume supplies are on a subscription.\n\nPeople actually buying a printer and ink to use at home must account for such a tiny fragment of printing done in the world.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I switched from an HP inkjet to a brother laser printer recently. I’m fairly certain I’ve almost paid for the printer in savings on ink compared to the HP.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don't think the printer business is true competition. Printer company sells hardware at loss due to real competiton. Losses are made back on ink. Ink filler companies that don't manufacture anything, don't have any intellectual property, just recycle cartridges, sue in court that being locked out is monopoly even though they never hired an engineer to make something. Ink fillers don't make anything but money. From a consumer perspective, this might seem good but doesn't seem fair on a competition level and really hurts printer innovation due to low profits.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can’t see why people keep giving them money with a business model like this",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So is it this guy or the you need to get used to not owning your games guy?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As long as there is competition this is the fastest way to bankruptcy.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Printing as a subscription huh? Will they deliver and set up my printer, will they come refill my ink when it’s out, repair it at my place when it breaks down, replace it when the printer dies? If not, then what are the benefits to their “subscription”? If I have to “buy” the printer and its components, set it up myself, troubleshoot it myself when it messes up, replace it at my own cost when it breaks, it’s no benefit. Their subscription is just to be able to use the stuff I have and paid for? It’s going to be great when they get a new CEO and try to get their customers back.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'll happily support local libraries and use their printers. They'll make money off me for their subscription and HP has gained one subscriber, and lost out of hundreds of thousands of printer sales, and our local community library stands to gain a little business. Fuck em",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Isn't it already with the fucking bullshit they do with cartridges.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If he wants us to pay a subscription for the printer, then there is no way I would buy one just to pay a fee to use it.\n\nI bought an Epson eco-tank printer 3+ years ago, have yet to add ink to it, and the ink is cheap. It also dose not take cartridges, you buy bottles of ink. And it has worked great for me so far since I bought it",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ugh. So is there a brand that is NOT going in that direction?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I literally forced my work place into dumping all HP for cannon, spent 5k on printers and close to 8k on laser cartridges. Good job HP! This is why we hate you.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"Our goal is to reduce our stock price and have everyone hate us.\"",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I signed up once for the HP printer cartridge service where they send you cartridges when you're low.\n\nI had it for about 2 years. I ran out of ink a couple of times and bought printer ink cartridges at the store.\n\nIt turns out they don't send you any cartridges if you EVER put a store bought cartridge in.\n\nI checked after paying like $19.00 or something a month for two years and they had sent me only 1 cartridge the entire time i had the service. Just 1.\n\nWhat an incredible rip-off, I will never, ever buy another HP printer (or any other HP product.)",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I will never ever buy anything HP sells",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So never buying crappy HP then.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "He's got no chance of landing that award, but he sure is making a valiant effort.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Gutenberg: \"And the best part is the blocks can only be moved three times, then you have to replace them! It's a self sustaining industry!!\"",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can the people who make the fairphone PLEASE make a damn printer ...\n\nI swear, electronics are getting so bad. If I was Elon wealthy, screw buying Twitter, I'm starting a company that makes bomb proof appliances where you can fix them. Parts are always available, they just work. Then I'm making super efficient and cheap housing. Anyone want to loan me about $2 billion to get going?",
        "points": "1 point",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Way to make sure I never buy another HP product (not just printers) again.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "JFC. We have enough subscription fatigue. Is it really that hard to understand we just want to own a goddamned printer?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My immediate goal is to never print anything again. PDFs all the way.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I pay 60 bucks a year with my HP Officejet printer. I can print 100 pages a month. Most of the time they are full 8.5x11 photo pages.\n\nHands down the cheapest way to print. They send me full hp carts in the mail.\n\nPeople are dumb when they think they can save money doing it their own way. When there is a clear choice right in front of you.\n\nXerox has been doing this for decades and businesses do it today on a managed printer.\n\nHP is just been doing this for residential companies for about 10 years now.",
        "points": "1 point",
        "children": [
          {
            "comment": "I pay £3 a month for 50 pages, it only gets used by my daughter for school, totally worth it for me\n\nNever have to worry about getting ink or if the cartridge has dried up and gone bad,, it just turns up in the mail",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yeah I understand the anger and frustration of others, but I'm in your camp. I lucked out though and fell into the InstantInk program back when they offered a $0/month service for 15 pages per month. I'm don't print often, so this amount was more than enough for me and I've probably payed at most an extra $5 in the nearly 8 years I've had my printer (excluding the initial printer cost of like $45).\n\nIt is cringe that I think you can only use their specific subscription cartridges, but for me it's been an incredibly effective and inexpensive way to print. I think that same plan is now only $1 or something. I've had an experience where my cartridges dried up but I just had to email them and they sent me a new set. Worth looking into IMHO. I swear I'm not a paid HP employee, I'm literally unemployed 😅😭",
            "points": "1 point",
            "children": [
              {
                "comment": "The reason you have to use their carts is so HP to subsidize the cost no middle man can be involved. Yeah I used the 0$ plan and the 500 page plan when I need to print more it’s like 2-5 bucks more.\n\nGlad to hear it. I’m not an HP employee either lol I just do a yearly cost analysis and HP instant ink is always cheaper. Unless you just want a black laser. But Jesus buy the cart from the OEM. If you have brother or epson. If everyone buys the printer and then goes to other company those companies will eventually go out of business lol. When there is no staples and officedepot goodbye brother and epson lol and canon is already gone.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I agree with this.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why the fuck should we pay for things we own. This should be illegal and they need to pass laws on this",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Thank you capitalism for a market where consumers get to chose what succeeds and what fails via their wallet.\n\nThank you capitalism for the mechanism to hold shitty business accountable or put them out of business for not serving their customers… where we don’t have to wait for corrupt, slow, incompetent politicians to attempt to legislate morality. (Where the legislation really just protects the shitty businesses who can afford the red tape.)\n\nThank you capitalism for enabling the flow of resources to companies that serve their customers and earn the reward of profits, which I turn create better services or products.\n\nThank you capitalism for enabling new companies or ventures to start up when there is a demand not getting met in the current market.",
        "points": "0 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I bought an HP printer a year ago, spent a frustrating hour trying to set it up, and returned it for a Canon that has given me no problems. Fuck HP.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Prime example of late stage capitalism here.\n\nHP should be boycotted to send a message to all the other rich jerkoffs in the ruling class.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have no sympathy for anyone stupid enough to buy an inkjet printer in 2024. HP has been finding new ways to make printing more expensive for decades. Only an idiot is buying from HP now.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why print when I can just take a Polaroid of my screen?",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "HP Enterprises or HP Inc?",
        "points": "-1 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I knew it, I've told my siblings and my co-workers that we are heading to a world where everything is a subscription, need to brush your teeth, don't forget to pay your subscription!\n\nNobody believes me.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Stop printing",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Works for Microsoft",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Who in the hell is printing anything in 2024?",
        "points": "-1 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Who fucking prints anything in 2024? Get with the times, stop printing and let HP die.",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Do peple still print? What is everyone printing anyway?",
        "points": "-3 points",
        "children": [
          {
            "comment": "Legal paperwork.\nReceipts and invoices.\nShipping.\nEverything the government regulates.\nCheck systems.\nPictures.\nBooks.\nArt.\nSchool work.\nAdvertising and junk mail.\n\nLots I missed I’m sure.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I’ll just continue paying like $0.11 per page to print at FedEx Kinkos when I need to.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That's why people will start black listing you as a company. I want to quickly print something. I dont want to reinvent the wheel!!! And I want to cost me cheap. otherwise, i would have gone to a printing center, i would have not invested my money on a new ugly machine",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "well if i was an entrepeneur with money, I'd look into making my own printer company right now.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Thats brave considering you don't need hard copies very much these days. I hardly ever need my printer and if I ever have to buy a new one- it won't be an HP.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don't want a printer anyway but at least the decision for which one to get just got easier",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Oh Brother!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Printers are commodities now. If they think consumers won’t just switch companies they are nuts. Then again many consumers are stupid.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Screw you HP",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We really need an open hardware no bullshit printer with a trivial web frontend to print images and pdfs. This would be enough for a lot of people and forcing company like HP to stop their bullshit.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Had an HP Deskjet 7000 series that was nothing but problems. Wouldn’t connect even with a cable, wouldn’t print, would print but came out blurry, would print but a single page of text took two minutes, etc.\n\nTraded it for a Brother DCP-L2510D b&w no frills printer whose toner cartridge is good for 2-3000 pages. It spits pages out like they’re on fire, sharp and clean, prints when I ask it too, zero problems.\n\nBest decision I’ve made as a writer-director and general human about town. One bit of advice if you want one, the toner goes into a (borderline hidden) compartment in the front. Took me ages to figure it out because the damn thing is so cleanly designed.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19ecxgp",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.tomshardware.com/laptops/framework-laptop-16-review",
    "title": "Framework Laptop 16 review: the Franken-notebook",
    "points": null,
    "comments": [
      {
        "comment": "Worst product ever",
        "points": "-71 points",
        "children": [
          {
            "comment": "It's that attitude that has resulted in companies like Apple being so brazenly anti-consumer and anti-repair.",
            "points": "26 points",
            "children": [
              {
                "comment": "Ugh, what does his attitude have to do with Apple?\n\nI like the repairability achievement but for the price, this is a worse laptop in every way compared to a MacBook.",
                "points": "-28 points",
                "children": [
                  {
                    "comment": "The reason it's \"worse in every way\" is because it's built to be fully consumer-focused, with upgradeability and repariability as the core principals.\n\nIt's an expensive laptop up front, but you can at any point during the lifecycle of the laptop purchase a new main board, or a new GPU, or swap out your I/O ports to whatever else you would like.\n\nYou're not paying for the best on the market, you're buying a laptop that when it's no longer the best hardware and you want something better, you don't need to throw the entire laptop away, you can just buy a new main board.\n\nThis aggressive consumerism and lack of regard for ewaste is a major problem, not everything needs to be the absolute best performance you can possibly get for it to be a fantastic product.",
                    "points": "16 points",
                    "children": [
                      {
                        "comment": "In a sense, this is paying closer to the real value of the hardware, because this manufacturer is internalizing costs that most manufacturers externalize.\n\nApple makes a MacBook Air with little regard for what will be done with it towards end of life. This laptop is being designed up front with lots of thought towards what will be done with it towards end of life, and the costs are higher as a result.\n\nThis makes perfect sense, and since we are raping the world in the name of our rampant consumerism, it’s also likely the best way to go.",
                        "points": "6 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "It’s expensive legos for tech enthusiasts, let’s not pretend it’s anything else. A thriving worldwide market for used hardware exists and let’s not ignore the fact that some first gen buyers have already upgraded their mainboards, meanwhile I have owned the same laptop since before this overpriced modular turd even launched.\n\nIt’s great you can swap out parts for new but I’m not spending 2-3x as much money just to achieve that based on a flawed premise of upgradeability of a pigeonholed platform and outright lies like the potential of screen upgrades. They went with a 5:4 13” display and people think there will be better options down the line? From who? You think LG, Samsung or BOE is gonna spin off a couple thousand OLEDs for them? Add in the fact that it will never compete on battery life simply because of the high power draw of each port and this shit is already played out.\n\nNobody gets things 100% right the first time but that’s the issue with their entire premise. Technology changes and this won’t keep up. Would you spend money to upgrade a 10yr old laptop chassis today with all the limitations of the time period it was released? As it is, their 180W PSU already can’t keep up with the GPU and CPU at full blast according to some reviewers.",
                        "points": "-16 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "It’s lazy whataboutisms like that that make Reddit the joy it is. Sure let’s just ignore the entire middle ground between Apple and this along with the fact that OEMs have made earnest attempts at upgradeability or modularity in the past and were stymied by technical progress, cost and lack of demand.",
                "points": "-23 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Lmfao get out of here dude. Revolutionary is a more suitable word to describe this thing.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19dzeav",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.techspot.com/news/101619-minimalist-smartphone-physical-keyboard-promises-four-days-battery.html",
    "title": "Minimalist smartphone with physical keyboard promises four days of battery life | Imagine a BlackBerry with an E-Ink display",
    "points": null,
    "comments": [
      {
        "comment": "Aside from a couple of device renders, a Black Mirror-style trailer, and a landing page with the option to join a waiting list, there's nothing else to go on.\n\nI’d be surprised if this ever sees the light of day.",
        "points": "646 points",
        "children": [
          {
            "comment": "Wooooo more consumer tech vaporware.\n\nEven if this does get released, be prepared for the company to go under in a year and a half and then there goes any hope of software updates or customer support.",
            "points": "207 points",
            "children": [
              {
                "comment": "Someone hoping to collect some sweet sweet sweet seed money from a venture capitalist gambling on the next big thing",
                "points": "52 points",
                "children": [
                  {
                    "comment": "American Dream",
                    "points": "12 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Like the Essential Phone. I’m still mad about that.",
                "points": "13 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "eInk isn’t fast enough to keep up with typing in my experience… I’d be constantly going back to fix things that didn’t display fast enough to correct them while my cursor was in the right place.",
            "points": "44 points",
            "children": [
              {
                "comment": "New eink displays would be fast enough to type on with a physical keyboard IMO.",
                "points": "16 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I have a Boox Ultra Tab-C with a color e-ink display. I assure you, modern e-ink displays can keep up with my 120wpm word vomit. I couldn't find official numbers, but the refresh rate appears to be somewhere between 12 and 19hz. Obviously that would be unacceptable for a traditional oled, lcd, or ips display, but understand there's no flicker with e-ink displays. They're not for everyone, and definitely not great for any sort of gaming or video watching, but for primarily text and line art tasks, it's phenomenal.\n\nExample video: https://www.reddit.com/r/Onyx_Boox/comments/13bwudv/onyx_boox_tab_ultra_c_optimal_refresh_rate/\n\nI'm inclined to agree with others, though, this particular gadget is probably vaporware.",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Good point I never thought of.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Sure but for people that kinda miss being untethered and have a hard time giving up the addicting phone, while still wanting the option of phone features…kinda makes sense. Call me because you know texting is hard for me. But you still could if you really needed to.",
                "points": "7 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Not to mention you could just buy an iphone. wtf is this thing.",
                "points": "-13 points",
                "children": [
                  {
                    "comment": "Talk about missing the entire point of a minimalist phone.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Um, Samsung actually",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "My Boox color Eink tablet types just fine. Can even kinda sorta do video. It’s like what I imagine watching a video on a gameboy color would be like, but it’s passable.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yeah that's a pipe dream.\n\nI too could also create a very simple 3D render using my 3d modeling friend, make a cool little promo video as I'm an editor, and pay for a squarespace site.\n\nBingo bango bongo you got your own Elon Musk",
            "points": "5 points",
            "children": [
              {
                "comment": "The most ridiculous part is the comment about the spelling in the marketing materials at the end of the article.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I’d be surprised if it’s less expensive than the latest iPhone",
            "points": "3 points",
            "children": [
              {
                "comment": "Niche technology is incredibly expensive to manufacture.\n\nIf you're not benefitting from the economics of massive scale, your customers are paying for it.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "There's plenty of alternatives. It's hardly unique",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Like:\n\nhttps://www.thelightphone.com/",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Makes me sad. There is a guge market for people like me who have no interest other than a phone and are able to still communicate effectively with modern phones.",
            "points": "5 points",
            "children": [
              {
                "comment": "I don’t think there is a huge market. If there was companies would be able to capitalize on it, but they’ve tried and failed.\n\nI’ve said this in other subreddits regarding the topic- there are a lot of ways you can take a modern phone and simplify it so you can get the features you need without the mess and distractions you don’t want. Companies like Apple and Samsung are too far ahead in the game for niche products to grab a hold. So learn to use what’s there to your advantage.",
                "points": "11 points",
                "children": [
                  {
                    "comment": "Your missing the whole point of something like this. I want something that is cheaper and can't operate like a normal smartphone. I can brick and unbrick my phone all day. But i hate getting sucked into my phone for hours, and essentially bricking my smartphone makes me silly for paying 1200$ to disable everything i paid 1200$ for.\n\nSo the people paying way too much for dumb phones, bricking smartphones, or generally trying to get away from so much tech is absolutely a large target audience.",
                    "points": "-2 points",
                    "children": [
                      {
                        "comment": "If you want a simple phone then I might suggest not buying the most expensive one on the market.\n\nHeres one that cost $180\n\nThen you can “brick” it as you put it without feeling like you wasted money.",
                        "points": "3 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "What is this take? I got a Xiaomi Reddit 10 for like 100 nzd and it does all the essentials. I'm sure your country has a similarly priced budget option, why not just buy a budget phone instead of a flagship one?",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "My phone is 4ish years old. But i would prefer to give it to one of my kids and get a phone like the one posted. Otherwise im paying for a refurbished phone or a new cheap one for my kid anyway. It may not be worth close to what i paid, but its still probably better than what i could buy.",
                            "points": "-1 points",
                            "children": [
                              {
                                "comment": "??? I don't understand what you're saying? Either way you have to pay. Just give your kid the expensive phone if they care for it's features and get a cheap one for you since you don't.",
                                "points": "0 points",
                                "children": [
                                  {
                                    "comment": "I want my kid to have decent stuff because i love them. I have an old phone that was expensive because that's what i wanted 4 years ago. It's cheaper for me to buy something like the phone posted and give my kids my still okayish phone, than buy my kids an okayish phone and turn my old phone into a brick which i can easily undo and spend too much time on my phone again.",
                                    "points": "0 points",
                                    "children": [
                                      {
                                        "comment": "Right, so what's the problem? Buy this phone that is almost certainly vapourware or buy a cheap phone.",
                                        "points": "0 points",
                                        "children": [
                                          {
                                            "comment": "My guy you are just being obstinant at this point. I DON'T WANT THE EXTRA SHIT I HAVE TO TAKE OFF BECAUSE I WILL REINSTALL IT AND GET SUCKED BACK IN MY PHONE. Like i don't know why I'm still commenting and why you can't seem to grasp i personally do not want a smart phone AT All, but i have to have something that can interface with modern phones effectively. Its not hard, i dont get where the disconnect is at.",
                                            "points": "",
                                            "children": [],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "But, With a e-ink display, it’ll work perfectly fine under the light of day!\n\nlol",
            "points": "-1 points",
            "children": [
              {
                "comment": "I'm really not sure what you're trying to say here...but yes...eInk displays look phenomenal in sunlight.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Even if it does you can guarantee there will never be any software updates/support.",
            "points": "0 points",
            "children": [
              {
                "comment": "That should be the point.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Starting a tech company in 2024: Make a single mockup of a product. Purchase a bunch of stock footage of people using phones and make an amateur announcement video. Profit? That's literally all this is.",
        "points": "230 points",
        "children": [
          {
            "comment": "ah yes, the kickstarter model",
            "points": "39 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "thought the rabbit r1 was bollocks, this is even worse.",
            "points": "21 points",
            "children": [
              {
                "comment": "ok good. I thought I was going crazy with all the hoopla over that bullshit bunny phone ....internet browser?\n\nAt least this phone would provide me the opportunity to disconnect from the internet while also being able to not use T9 texting a la flip phone.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Uh, just so you know the rabbit isn't a phone.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Wait really? Then what’s the fuckin point of it at all?",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "You could just like, take ten minutes and watch a review of it and learn what the point is instead of dismissing it entirely without understanding it.\n\nSeriously, people - dismissing something when you understand it is even better than dismissing it when you don't.\n\nThis is probably the best video I saw about it - but it's a bit long (21:23). I highly recommend the channel in general though! I learned a lot about the product from the video which was interesting because so much of the other coverage about it is lacking any actual detail.\n\nhttps://www.youtube.com/watch?v=Rqh6fhcAqpw",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "haha. I'm an idiot. The thumbnail literally says \"this is not a phone\".\n\nbut no thank you. As soon as I heard \"AI powered\" I dismissed it. That's all I needed to know. IMO AI is becoming a race to the bottom with the end-goal not creating a helpful tool, but to gather and record data. This is the last thing in which I'd personally be interested.\n\nCold Fusion is an YT channel though. Love those guys. Very good coverage for sure.\n\ndismissing something when you understand it is even better than dismissing it when you don't.\n\nVery good point. Note taken and I'll go watch the vid now. Thanks\n\nEDIT\n\nSo I'm going through it now and I have some notes (all just my opinions)\n\nOrdering a pizza seems more annoying than just doing it on the phone/web. There doesn't seem to be any granularity from the examples used. https://youtu.be/Rqh6fhcAqpw?t=317 - it seems like the keynote was being purposefully obtuse and as generic as possible which I find sus\n\nIn fact, the majority of the examples used in the demo video seems wildly useless and solves a problem that no phone has. I also don't see anything preventing phone manufactures wouldn't just hijack all the features of the R1 and implement them themselves with far more powerful specs (as mentioned around 13:00)\n\nI will say I really like the design though.",
                                "points": "0 points",
                                "children": [
                                  {
                                    "comment": "I wouldn't dismiss it on that premise. Remember AI is a lot more than the large language models a lot of consumers see. I work with AI and honestly the press LLMs are getting do a disservice to the practical implementations at Enterprise level.\n\nThat said, I personally have no interest in this product either.",
                                    "points": "0 points",
                                    "children": [
                                      {
                                        "comment": "That's fair. But then it's on the company's promoting their AI to exhibit that and so far I've seen none of that.\n\nI dismiss it on the premise of AI because I have absolutely zero interest in using AI outside of my work. It all stinks too much of Elon Musk vaporware.\n\nIO also jsut finished the video and still only see a phone without the phone part. I'd be interested in seeing how far people are able to push its capabilities.",
                                        "points": "0 points",
                                        "children": [
                                          {
                                            "comment": "Oh totally, you'll start seeing it happen in the next couple years though as advancements are made.\n\nI agree about this gadget though. It looks like a neat toy, but I'm not interested in giving it access to all my accounts and data. I was also surprised at how large it was once I saw it in someones hand.",
                                            "points": "0 points",
                                            "children": [],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "T9 is an excellent way to text and I refuse to hear anything different",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I get that for sure and don't necessarily disagree. Maybe I'm just stuck in 2003 with my move from a flip phone to a sidekick",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Purchased even more cheaply using text prompted AI image generators.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "amateur announcement video\n\nIt even starts with \"in a world\". Can't get worse than that",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yeah this definitely isn't real. The entire trailer video is stock footage of other phones, all the images on their website are of a single mock-up (no extra menus screens camera angles of the device). If that was actually how the device looked, then the keyboard looks like it would be a capacitive touch slab, entirely defeating the purpose. I would be surprised if this went any further than them selling the personal info on the \"waitlist\" and moving on",
        "points": "77 points",
        "children": [
          {
            "comment": "Waitlist is just a way to get investors. If it works, then get investment and never produce anything. If not, then sell your data and keep in touch for the next scam.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Weirdly enough this would not be very hard to build. Most of the tech is off the shelf. By eliminating a big glowy screen and the horsepower to run it, the battery should last for ages. The key is it is not trying to be better, faster, or anything more than an iPhone which is pretty much impossible for any small startup. If the phone is meant to be minimalistic, then cheap and easy will generally rule the design process.\n\nThe iphone CPU uses about 7w of power going full tilt, and 2-3w when doing anything interesting; far less when it is in your pocket.\n\nThe 4G or whatever wireless and bluetooth can be kept fairly low power most of the time. The eInk is nearly power free most of the time.\n\nIf you picked a fairly powerful microprocessor like the STM32H5 series it would use roughly 100th of the power. It would be able to run basic mapping, etc, texting, music, phone, etc. No web browser. If you wanted one with a web browser, the power requirements would jump to around 1/10th of an iphone. It would even be possible to do some cool designs where most features are run by a small processor, and a bigger one kicked in for the harder things like crappy web browsing.\n\nThe cost of the various parts should easily stay under $100. At volume, this might cost less than $50 to build.\n\nI would argue the hardest part in building it would be getting a design which is both usable and distinctive enough that other people ask, \"Cool, what's that?\"\n\nThe time for the first working prototype which can send a text and make a call should be less than a week. The time to make a portable one which is mostly useful should be under a month. And then nailing a design which can be manufactured should be another 2 months.\n\nThe beauty is once the first prototype is done, software dev can begin full steam.\n\nAfter that, iterate iterate iterate.\n\nThen, marketing would be the fun part.\n\nI suspect this company just skipped to the marketing part.",
        "points": "20 points",
        "children": [
          {
            "comment": "Yep. No way will they ever sell for less than $599.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I just want phones with actual keyboards back, and not the Blackberry-style ones but larger slide-out keyboards.\n\nI know I'm in the minority on this, but the MyTouch 4G Slide was the perfect phone for me.\n\nI always have issues typing on on-screen keyboards, which I never had a problem with using QWERTY phones.\n\nThe QWERTY phones are also really nice to use for emulators with a real keyboard.",
        "points": "24 points",
        "children": [
          {
            "comment": "I was just thinking about how much I miss my LG enV before I opened reddit and saw this thread",
            "points": "6 points",
            "children": [
              {
                "comment": "I loved my enV too. Real color games, music, and YouTube made me feel like I was on the cutting edge, lol.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Forget a folding screen. I want a large phone that opens like a laptop. Same size screen inside and out, but it has a keyboard and you can set it like a tiny laptop on a desk.\n\nActually maybe a swivel screen would be better so you don't need two screens.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "ipad mini with a keyboard case?",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "Mind. Blown.\n\n-Op, probably.",
                        "points": "3 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Or … https://www.theverge.com/2024/1/4/24024957/clicks-iphone-keyboard-case-iphone-14-15-lightning-usb-c",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Nokia's old Communicator line of mobile phones was mostly that, except the external side was a conventional phone keypad and LCD. Flip it open, and you had a keyboard with a display. Open it 90° to use laptop style on a desk, or 180° to use it freestyle with two hands.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I would love to have a keyboard again, I'm on phone number 3 without and I still hate every time I have to type something.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Nokia E97 had the best form factor. Would love to have something like that make a comeback",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Tbh I’d kill for a BB Pearl clone. The form factor is prime but the durability of that thing. Went down three flights of stairs and it shrugged it off like no one’s business.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I remember when I got my first iPhone, I had a friend with a slide out keyboard. She preferred it, but admitted it was dying... I've lost touch with her sense, I wonder if she still prefers the physical keyboard, or is fine with screens now?\nI guess this is just to say, you're not alone!",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Just give me back my blackberry please.",
        "points": "16 points",
        "children": [
          {
            "comment": "Same, honestly.\n\nDon't get me wrong; my phones today do a pretty decent job but for work/productivity and sheer text-based comms functionality I don't know if anything beat my Blackberry 9650.\n\nEven just for firing off emails I'd potentially carry one around. Shit- if it could handle Slack and Email and I could just chuck it on my T-Mobile plan that'd be a sick little accompanying device for my workday. I'd keep my iPhone for personal stuff and my Android for software testing but a solid Blackberry with decent battery life and that keyboard I miss so much? She'd be in my pocket every day from 5AM to 9PM and then when I want to ditch work she goes on the desk.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Nothing stopping you from buying one.",
            "points": "-12 points",
            "children": [
              {
                "comment": "There are a few things stopping it from functioning anymore. Pretty sure BlackBerry shuttered their services that the phones depend on and the old phones won’t work on modern networks. It can be difficult to find an edge or 3g signal in places where all the equipment has been upgraded.",
                "points": "9 points",
                "children": [
                  {
                    "comment": "Good point, I never owned one. I didn't realize they were that archaic.",
                    "points": "-4 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Make this fold in half, let’s go full circle backward 🫡",
        "points": "2 points",
        "children": [
          {
            "comment": "Yeah or make it like 2lbs with a 2x4 cross-section, so it can double-up as a self defence brick.\n\nCuz no one is fucking with the dude rocking a Cityman 900 and a fat, metal attaché case.\n\nNot at rush-hour, anyway.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "That's below mid, on a hypothetical product. How is that even news?",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I had an old candy bar style Motorola with an E-Ink display back in highschool. The F3, I believe. That thing was so cool 😎",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They already have e-ink smartphones. HiSense makes great ones. What's so special about this phone?",
        "points": "3 points",
        "children": [
          {
            "comment": "The Light Phone is really cool, wish it wasn’t so expensive but it actually works and is real haha",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This one owned by a Chinese company too?",
            "points": "0 points",
            "children": [
              {
                "comment": "Probably, what's the difference anyway, you're clearly not averse to using platforms owned by Chinese companies. You're here.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The refresh rate and delay on e-ink are pretty awful if you're used to a high end smartphone. The Light Phone looks so cool on paper, but the delay when typing seems like a huge pain in the ass.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The physical keyboard does set it apart (if it were real anyway)",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The article isn't worth reading, there's not much info so the author just shits on the concept because they personally don't like it.\n\nI would absolutely love a ~4-5\" screen (one handable) android phone with an E-Ink display. Make it a reliable tool for my life.",
        "points": "4 points",
        "children": [
          {
            "comment": "Have you ever used an e-ink display?  It’s a nightmare for anything that changes often, like typing, scrolling, etc.  It would not work well as a general purpose handheld computer",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "„Between the trailer and the landing page, I counted no fewer than five different spelling variants of the brand name including Minimal, Mnml, Miniimal, Minml, and Miniml. Perhaps it boils down to a language barrier or low effort marketing, but something is telling me to proceed with caution.“",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you have a phone with an OLED display on dark mode and change the UI to use mostly perfect black, and only use it for SMS and calls, a smartphone will too last for four days.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"The truth of the matter is that you don't need to go out and buy a featureless device to reduce mobile screen time. Modern smartphones have all the controls you need to lessen or even fully disable alerts and notifications from apps and services. If at any time you are feeling overwhelmed, just enable Do Not Disturb or simply put down your phone and go do something else.\"\n\n(Comment sponsored by Apple and Samsung)",
        "points": "1 point",
        "children": [
          {
            "comment": "Personally I got a RAZR hoping it would be less distracting and my screen time is way down. My phone feels like an assistant again.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "E-ink is all fine and well for an e-book, but the screen refresh rate for an e-ink smartphone would you drive you nuts within the first minute of typing on it.\n\nPS - this thing looks exactly like a BlackBerry Passport. Like, identical.",
        "points": "3 points",
        "children": [
          {
            "comment": "It's like you're not getting the point though - eInk smartphones exist already. They're designed to be poor experiences.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If this actually comes out I may have to pickup a new tech stack and port a bunch of apps to it. I’ve been dying for an OK phone with good battery and a keyboard.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I loved my Blackberry. I'd kill for a smartphone with a physical keyboard.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Jesus fuck stop with the e-ink idea. Put a larger battery if there’s reduced features already.",
        "points": "-19 points",
        "children": [
          {
            "comment": "An e-ink smartphone is exactly what I'm looking for. For the screen, the battery is just a nice bonus.",
            "points": "22 points",
            "children": [
              {
                "comment": "I saw a phone case that put an e-ink screen on the back of the phone, was kind of neat concept.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Great buy the overpriced “light phone” then. It already exists.",
                "points": "-3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "E-ink is awesome. These particular people are lying about their product entirely, but E-ink itself works and is nice to use. You're right though, if we're chasing battery life then E-ink only gets you so far",
            "points": "5 points",
            "children": [
              {
                "comment": "Is e-ink what’s in a kindle? I’m trying to figure out exactly what it is.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Yes, e-ink is what's in a Kindle. E-ink is a bit of a misnomer though - a better term would be e-paper. Basically, it's a display device that seeks to replicate \"paper display\", ie. having the device reflect ambient light like paper does instead of how screens emit their own light instead.\n\nThis should make reading more comfortable on e-ink devices than on regular displays, but I have never used e-ink so I have no idea how true that is.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Oh thank you! I have a Kindle and I enjoy reading on it, it doesn’t give me eye fatigue like phone or tablet screens do. My only complaint is a slow refresh rate.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Yea, that's because of how e-ink works. It's never going to be a good high refresh rate. But for readers/notebooks it's amazing because you don't need high refresh rate to read or write.\n\nMy remarkable2 gets so much battery life and the Kindle is the same for reading.",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "They already tried it a while ago with the Energizer smartphone and it didn't work.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Only 4 days, my iPhone does more than that",
        "points": "-48 points",
        "children": [
          {
            "comment": "Yeah, if you don’t use it.",
            "points": "19 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "My iPhone doesn't even last a day the fuck",
            "points": "11 points",
            "children": [
              {
                "comment": "To be fair it really depends on what iPhone, and what settings you’ve got.\n\nI’ve got a 15 pro max (I get massive discounts on contracts through work) and for example, today I started at 90%, have used my phone for a lot of calls, spent about 2 hours of social media time, and about an hour on YouTube.\n\nI’m at 58% and it’s 11pm.\n\nRealistically I’ve done 2-3 days of average/light usage, I could stretch to 4 if I only made a few basic calls and skipped pretty much anything else.\n\nI have turned the AOD live wallpaper off with just some widgets, keep the brightness to a sensible level, and don’t have a ton of apps that consume battery though",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Bullshit",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "🧐",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'm still waiting on someone to release a maximalist phone",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Is there a large enough market to support this?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Psh, next you're gonna tell it flips open and shut",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Dnd",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Legitimately shocked it only gets 4 days.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "looks uncomfortable, if you're going to fit a niche make sure you're using actual buttons and not half assing it with a weird screen size, we like flat stuff to fit in our pockets but not when we have to press buttons on it, nor is it minimalist to make it almost square, you need only half the size of that screen, what would work better is to have the keyboard on the long side, text wraps however you want it after all and then you can hold it like you hold a gameboy advance, comfortable in landscape mode.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "ok but that looks to be a shitty keyboard. blackberries had great keyboards.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This one actually got it right by including Uber. That was always my drawback with any of the other minimal phones, I can’t realistically go out at night with one if I can’t call an Uber to get back home. And if I’m not using a minimal phone when I’m out, what purpose do I have with one? At home I have access to every distraction imaginable so it’s pointless to use it there.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The ad looks like it was made with midjourney.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "iPhones were huge upgrade from Blackberry- couldn’t clean keypad and chunky funky design.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yeah, I haven't seen another vaporvare render inspired from actual products that was eventually displaced by the industry's love for gigantic animated buttons on touch-screens, marginally reduced build-cost, and half a day battery-life thanks to \"performance tweaking\" no one needs -- for at least, let me check my watch, 12 hours.\n\nSo it was about time.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I get two with a normal screen. Nah thanks.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I mean I had 4-6 days battery life on my old Xiamoi phone, so E-Ink only lasting 4 days is kind of poor.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19eiont",
    "subreddit": "u/BbIPOJI3EHb",
    "dataType": "link",
    "dataUrl": "https://store.steampowered.com/app/2402170?utm_source=redditgames&utm_campaign=release",
    "title": "I made a puzzle game where YOU design a puzzle and AI solves it. It turned out incredibly deep, challenging and fun! Check it out!",
    "points": null,
    "comments": []
  }
]