[
  {
    "id": "t3_19ejh96",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://fortune.com/asia/2024/01/24/toyota-chairman-akio-toyoda-ev-skepticism-thirty-percent-battery-electric-cars/",
    "title": "Toyota’s chairman doubles down on his electric car skepticism, forecasting that EV adoption will peak at just 30%",
    "points": null,
    "comments": [
      {
        "comment": "If the manufacturer charges 50k for a car with bad infrastructure because no one is developing it (electric cars) and they also have the same car but with gas engine for 20-30k with a well established infrastructure guess what the customer wilk chose.\n\nAnd even in this scenario, electric cars are still being sold, so that should say a lot about the customer's desires.",
        "points": "42 points",
        "children": [
          {
            "comment": "I had a RAV4 in 2019 and wanted to buy a Toyota EV because their quality is exceptional, but they didn’t have one. I got a Hyundai Kona EV instead and it’s a great car and fun to drive, due to the incredible acceleration and playing with the regen levels. That said, the Hyundai dealer seemed to sell the car grudgingly. The salesperson was uninterested and only the manager could answer certain questions I felt the salesperson should have known. All of the automakers seem to make these cars, maybe because states like mine require them to sell them, as goofy and nerdy looking as possible maybe so people won’t buy them.\n\nI know these automakers, dealers, and supporting industries will be hurt by the lower maintenance and parts needed for EVs. However, sales of EVs or some other alternatives WILL become 100% of sales once climate change begin doing more extreme damage and governments outlaw new sales of ICE cars. So this guy is doing a rear guard action trying to ease the blow of this change for his industry, but change is coming.",
            "points": "13 points",
            "children": [
              {
                "comment": "When climate change becomes more pronounced, we’d have bigger problems than just drive a car. Government outlawing new gas cars sales won’t do anything other than price used vehicles like new and even then parts for used vehicles are plentiful.\n\nWe already passed the point of no return and the only solution would be no fumes whatsoever but that’s not going to happen.",
                "points": "",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I’m in the market for New vehicle now and I’ve had 2 separate big name American car company dealers basically trash talk evs to me after I expressed interest.",
                "points": "",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "same, been driving a hybrid yaris for 10 years- wanted a EV since i like their service and pricepoint. alas, went with something else- i dont know wtf toyota is/was thinking, they have a decade?(or more) of knowledge in ev/battery stuff - why not just use that.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Theyre trying to make hydrogen happen since they wasted so much time and money on it instead of doing EV like everyone else",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "There WILL be a day when an electric car IS the cheapest solution for a given market segment. And when that happens the ICE is technically obsolete. There are just WAY more components and systems required to make an ICE operate. We’ve just been doing it so long we are really really good at it. If the car was JUST being invented today and you had an unproven ICE engine vs an electric propulsion vehicle you bet your ass Toyota would choose the electric car. It’s a much simpler engineering system.",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I’m in this boat, gas or hybrid cost 25-40k EV equivocate are at least 50k. I think Toyota’s aim to hybrid their lineups is a great stop gap but they will need to come up with at least a couple EV in the next decade.",
            "points": "1 point",
            "children": [
              {
                "comment": "I actually think the smart thing is a plugin hybrid.\n\nBecause you have the reliability of gas (in terms of range and ease to refill) but when you are in town in stop and go you go electric .\n\nAlso this has the advantage of putting pressure on the city to make infrastructure so you can charge them but for the regular user if infra sucks you go gas and get to your destination.\n\nThe only but the only usecase i see electric is an option if you have home and work charging and you are ok for the 2 3 long trips you take a year to be a bit incovenienced and plan around charging stations.\n\nIf you have no work and home charging it is a massive no because while you can live with the 2 3 trips a year, making the extra planning and problems a daily occurance it will cause you nervs and a lot of time wasted.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I currently drive a Tesla Model 3 and am seriously considering a RAV4 Prime right now. Totally sold on electrical, despite the absolutely abysmal quality of the Tesla, which is a good electric drivetrain in a crappy quality car.\n\nThe RAV4 is interesting for a few reasons:\n\n- Toyota quality. Our 15 year old Highlander is in better shape than the not-even-four year old Tesla. The Tesla has to be sold before it racks up more maintenance (already out of pocket $4K and I'm just out of warranty, another 4-6K is supposedly on the way.)\n\n- It's an actual SUV (which the model X/Y are not.)\n\n- Full electric range is within my normal envelope. As a Hybrid, I'd be driving electric-only 99% of the time, without hauling around 70-odd KWh of heavy, expensive battery.\n\n- Road tripping will be vastly simpler. A few places that I cannot make work well, maybe at all, with the Tesla are trivial with a Hybrid. Even places that are easy with the Tesla are easier with a Hybrid.\n\n- If I want to tow or carry a canoe on the roof, I can live with the range hit. Easily.\n\n- I just looked: the last time I paid for supercharging was July 6 of last year. I really don't need the supercharger network.\n\nIt's not clear to me that Toyota is going about this wrong. It may well be that consumers are thinking about this wrong. Enough full-electric range is probably around 50 miles. For me, anyway. Even 20 miles would take care of a huge chunk of my driving.",
        "points": "4 points",
        "children": [
          {
            "comment": "Even PHEV is not a good medium to long term solution when considering climate change. Toyota will either get on board or be left behind.\n\nOr the world continues to buy gasoline cars and we f around and find out on climate change. Guess we’ll see!",
            "points": "",
            "children": [
              {
                "comment": "A PHEV that spends most or all of its time operating within its electric-only range is an electric-only car - only more efficient (less weight), more flexible (can use gas if needed), and with less need for batteries, hence, rare earth elements and so on.) Much more efficient than a straight EV, if you are operating mostly within its electric only range.\n\nIt's certainly better than an EV that is made so poorly that it basically falls apart.\n\nAnd you can roll out a whole lot more PHEVs than you can roll out EVs - no need to build out or deal with supercharger networks, no need for 90% of the batteries, etc.\n\nIt's superior from a Climate Change perspective, assuming the PHEV will be operating within its electric range. I'm guessing 50 miles is going to be plenty for most people. Looking at my trips (thanks, Teslamate), it certainly is for us.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "30% is significant. Also, this is a long term thing...not just what will happen in his lifetime. He'll be dead and gone and this won't age well.",
        "points": "14 points",
        "children": [
          {
            "comment": "Depends on the market. Some have already exceeded 30%. So he is already wrong but he is consistently wrong at least.",
            "points": "3 points",
            "children": [
              {
                "comment": "Over 80% of new cars sold in Norway in 2023 were electric. Just a matter of time before their entire fleet is electric.",
                "points": "7 points",
                "children": [
                  {
                    "comment": "Some places like California and British Columbia are already around 30% too, and rising fast.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "The area I live in north west London, must certainly be over that for new car sales. It’s 50/50 for any 23 plate or above now…",
                "points": "",
                "children": [
                  {
                    "comment": "Nice! Go London!",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I think He confident Toyota can Carter to remote / utility / military needs. Those areas are difficult to electrified\n\nAlso every nation has different speed transition to EV",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is going age like milk.",
        "points": "18 points",
        "children": [
          {
            "comment": "It depends, in developed countries, maybe, the rest of the world with crappy decades old electric infrastructure in cities and houses, I don’t see many people spending thousands in upgrading it to support an EV fast charging at said cities and the roads, plus the high prices of EVs (something that will not go down for a long while).\n\nNot saying it will not happen (EV adoption en mass), just not as fast a many people think.",
            "points": "2 points",
            "children": [
              {
                "comment": "Third world countries don't go for cars in the first place because those are largely too expensive and big for the everyday person to get anyways.\n\nThe first thing people in third world are gonna buy are e-scooters and e-bikes as scooters and motorcycles are already the predominant form of transportation besides buses and rail. These e-scooters and e-bikes are also fairly affordable and easier to maintain compared to their gas counterparts",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Nah. This is gonna age like cordyceps in The Last of Us",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Is it already over 30% in Norway?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Toyota; the Kodak of the automotive industry.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If I were a shareholder I'd be looking to remove such an obviously incompetent manager. Of course EVs aren't going to peak at 30%, especially not in richer countries with the money to transition to electric infra.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Current trends seem to support his skepticism.\n\nTime will tell if this is a smart move or not.",
        "points": "0 points",
        "children": [
          {
            "comment": "stares at every Automaker loosing market share in China to BYD and Tesla",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Current trends show EVs will be the majority by 2028..",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I am never ever going back to an ICE car. The money I’m saving on gas and maintenance is amazing and I love the thing.\n\nHow any automaker can be this far behind is beyond me. The world has shifted and they are not keeping up.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I want a hybrid, I think EVs are still 50 years out to be worth it.",
        "points": "-3 points",
        "children": [
          {
            "comment": "Depends on your use-case. For many electric cars are already worth it. I’m saving a lot of money driving an EV, and it’s not inconvenient or anything.",
            "points": "0 points",
            "children": [
              {
                "comment": "It depends very much on your situation; I’m off-grid, and now spend zero to power my cars. Yes, there was initial investment, but the payback is pretty quick.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I drive around a lot for work plus live 20 minutes away to the closest city so for me no way it works, maybe if you live in a main city and don’t drive much.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Solid State battery tech will be available for EVs in 4-6 years. This will allow for a 700-800 mile range, and solve a number of other issues with lithium ion batteries. You wont need to wait 50 years, it will be closer to 10-15.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Are we witnessing the beginning of the end for Toyota?",
        "points": "-8 points",
        "children": [
          {
            "comment": "no",
            "points": "8 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Not at all. It's the favorite vehicle of terrorists everywhere. You don't see them mounting guns on f150s do you?\n\n​\n\nEdit: I know. that was unnecessary.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "remind me in 10 years to post this to r/agedlikemilk",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "His relevance is revealed in the title where if they called him by name nobody would have any idea who he was.\n\nThe future is going to enjoy quoting this guy",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is the same company promising a 700 mile range EV.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Toyota must really be banking on hydrogen car development. I hope it works out for them but I imagine it will take a long time to perfect and develop infrastructure.\n\nRight now existing hydrogen cars only take 5 minutes to fill up which is already amazing.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Make ‘em work in the cold and go farther as well as fast charging or easy battery replacement and they’ll sell",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Who cares what this dinosaur thinks. Renewable energy is the future. Electric vehicles must be adopted. We cannot continue to strip this planet of its livable habitat and warm it beyond its tipping points.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Toyota doing their best Sears impression",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As long as these cars remain outside prices for people who need them most, he's probably right. Rich activist types move from fad to fad faster than white girls buy new water cups.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well this is just a really dumb take. A futurist has to consider any possible likely evolution of technology. Yea, with TODAY’S technology EV will struggle to capture more than a minority share of the market. But to stick your head in the sand and pretend that technology doesn’t move forward is preposterously short sighted for the leader of a company who employs one of the largest engineering organizations in the world. There are dozens of technologies incubating as we speak that will completely alter the coarse of EV capabilities and subsequently impact adoption. Most of these are TRL 2-4 as well! I could understand if you had a slew of TRL 1’s waiting on evolution. But we are WAY past that on many battery, charging and power generation techs!",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"Why would anyone need a computer in their home?\"\n\n-the same type of people",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think the whole electric vehicle concept is floored and not very environmental once you take account of gouging out all the materials for batteries and the cost of upgrading everything from power networks to roads as they are way heavier. In time people will realise what a colossal waste they are.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I just want PHEV with 100mile range. It will cover 90% of my commute and will still let me go hiking without risk of running out of charge.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19egel4",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.pcgamer.com/our-long-term-objective-is-to-make-printing-a-subscription-says-hp-ceo-gunning-for-2024s-worst-person-of-the-year-award/",
    "title": "'Our long-term objective is to make printing a subscription' says HP CEO gunning for 2024's Worst Person of the Year award | Not satisfied with merely bricking printers, HP now wants to own them all forever!",
    "points": null,
    "comments": [
      {
        "comment": "I will NEVER buy another HP printer- no way I’ll support this nonsense. Brother printers from here on out!",
        "points": "143 points",
        "children": [
          {
            "comment": "This is why I tossed mine in the garbage. I could have resold it, but I didn’t want to subject another human being to that bullshit.",
            "points": "22 points",
            "children": [
              {
                "comment": "Maybe should’ve recycled it? What the fuck do I know.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Probably. But I was mad.",
                    "points": "15 points",
                    "children": [
                      {
                        "comment": "We have a kubota tractor that has served us well by crushing our frustrations",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "Fucking love Kubotas. Used them for lawn mowing last summer in Colorado and they rocked. Super easy to work on too",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "This one’s a full fledged tractor with front loader, plus box blade, rake and bush hog attachments. Still strong after 6000+ hours!",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "For future reference with larger electronics you hate: if your city has a rage room, they usually take donations and then recycle them after someone’s done beating the shit out of them.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Garbage printers. Garbage company.",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Came to say the same thing.",
            "points": "15 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Right on brother.",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Bought one bc it was the cheapest option. Planning to get a brother once I run out of toner. Didn’t realize how locked down the stupid things are until it was too late. \n\nThey even let you use it without an account for two weeks, probably to avoid insta returns, then after two weeks it doesn’t work until you create an account. \n\nThink I’ll gut mine and use it for a weird pc case…",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I’m in the printing industry. If it works for one company, the rest will follow is usually the issue with stuff like this. These companies already operate using subscription models like this in the commercial world. Epson, Fuji, canon, hp, brother, Konicaminolta.. both small desktop/office printers up to large format offset/web fed printing presses. They’re just moving the commercial subscription metrics to the consumer level I’m speculating. They already locked in businesses.",
            "points": "3 points",
            "children": [
              {
                "comment": "Let’s not let it work! Boycott HP printers!",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I have 2 brother printers, a b&w laser for at least 10 years, and a colour laser for about 5. They are both going strong and I can use 3rd party toner cartridges.\n\nI couldn’t be happier with the brand. Just search “brother laser printer” on Amazon to see the reviews. They are consistently getting 4.5 star reviews across all of their products from 1000’s of reviewers.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Be careful about putting all your eggs in the Brother basket. They are good now, but they already have some models with subscription ink.\n\nBest thing maybe to just avoid HP, and avoid subscription models in general. Laser costs more up front, but it prints better and doesn't have the subscription ink problem (yet).",
            "points": "1 point",
            "children": [
              {
                "comment": "Any insight whether Epson avoids these pratfalls? I seem to not see any crazy hoops to jump through, but also not alarmed if they are just kept well hidden.\n\nI have a perfectly good Canon printer/scanner, that now only works with my iOS devices (wasn’t kept compatible with the latest Windows 11/MacOS versions, apparently due to awesome decision-making by Canon). So steering away from that brand for the time being as well.",
                "points": "",
                "children": [
                  {
                    "comment": "I think all manufacturers have them now. Epson does have them. Brother is good for now, just be careful not to hero worship them.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Brother for life. Phuck HP!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "My long term objective is to never buy anything from HP.",
        "points": "62 points",
        "children": [
          {
            "comment": "My best printer has been a Brother, so that’s what I’m going with",
            "points": "6 points",
            "children": [
              {
                "comment": "My brother hasn’t printed shit for me",
                "points": "0 points",
                "children": [
                  {
                    "comment": "You’ve got to ask him nicely",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The Brother b&w laser I've had since 2008 will do just fine, thank you. The few documents I do need to print out here and there are perfect in monochrome, and if I care enough to print it in color most any home printer would be inadequate and far too rarely used and expensively maintained. Thanks moron corpo drone #4487 for your wonderful insight, just confirming how correct my path was.",
        "points": "37 points",
        "children": [
          {
            "comment": "My Brother laser printer I got first year of uni in 2013 is still going strong too. Paid $50 for it and have not put any more money into it.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This is the way. It’s almost like unlimited printing. I don’t need or want color. We have screens everywhere we look, plenty of color there. Print shops fill the edge cases.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I had to read the article to make sure it wasn’t a clickbait title, but wow it’s actually real.\n\nAs if owning a printer couldn’t get worse…",
        "points": "27 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Still using a canon laser printer from 2010, only on my second toner cartridge which cost $60. Don’t think I’ll be buying consumer HP products any time soon.",
        "points": "14 points",
        "children": [
          {
            "comment": "We have a Canon all in one color laser. Dang thing is awesome and have had it about 6 years now.\n\nOnly inkjet in our house is a StyleWriter 1500 and that thing doesn't give a single F what brand the cartridge in it is.",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Samsung laser from 2019. Guess I printed a bit more, since it's now complaining that the toner is getting low. Still prints fine though. We'll see how long till it actually runs out.\n\nBut I bought a set of toner cartridges along with the printer. So I should be good for like 10 more years...\n\nAlso funny thing: It was 199€ new. On amazon it now goes for 1080€ used. o.O",
            "points": "1 point",
            "children": [
              {
                "comment": "Bought a Samsung ML-1860 series back in… 2010? 2011? Ran on one toner cartridge for over a decade, replaced it just before we moved in summer ‘22, still running like a champ. Had to extract a driver configuration file to make it work on Ventura, but, it does the job.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Reminds me of when the CEO of Coca Cola (Daft, 2001, appropriate name) dreamed of each and every home having a tap that served Coke.\n\nHP died a long time ago, no longer an engineer-driven company, now run by greedy execs.",
        "points": "11 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Who still needs to print things so badly?\n\nI can't speak for all businesses, but as a personal user and small business owner I haven't needed to print anything in years. The few times a year I actually need a physical copy of something, it's easier and cheaper and less hassle to just put it on a USB drive and take it to my local FedEx store.\n\nPrinter companies are making themselves obsolete. The technology has not improved in 20 years. They are the most user hostile products there are. EVERYONE hates printers and printer companies.",
        "points": "25 points",
        "children": [
          {
            "comment": "Lots of ppl need to print stuff, artists, students, older people, any business that give you any kind of like physical invoice, lots of bureaucratic processes need physical copies, etc… and not all live in the us and / or near a fedex store , also “less hassle” ? How is it less of a hassle to just clicking print at your home to have to put the file in a usb drive, get on your car (spend money on gas) , go to the fedex store, do a bunch of steps to use their printers (probably getting malware in your usb drive in the process) , get in line to pay, pay process (even if you just tap your card it’s an extra step) , get in your car again and then drive off .",
            "points": "13 points",
            "children": [
              {
                "comment": "How is it less of a hassle to just clicking print at your home t\n\nBecause printers suck, and the subscription model they're all trying to go to is a rip off and an unnecessary expense for people who do not print often.\n\nget on your car (spend money on gas) , go to the fedex store,\n\nFor me it's just 2 blocks away. I understand it may not be convenient for everyone.\n\ngo to the fedex store, do a bunch of steps to use their printers (probably getting malware in your usb drive in the process)\n\nIt's literally put the USB stick in, payment method, choose what you want to print and press the button.\n\nI understand it's not for you, but don't try to make out to be this confusing hardship. For some people it's a great option that saves money and the hassle of messing around with a printer, and ink prices, for something they never use.\n\n​\n\nolder people,\n\nI agree here. My Mom likes to print things out, and then put them in a file cabinet. But recently she's been recognizing the benefit of having a NAS and a cloud back up and is selling her behemoth of a printer that's always \"offline\" and needs $75 worth of ink every time the cyan runs out because it won't print in just black when another cartridge is empty.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Right , i mean you started with a question, which the answer is actually lots of people, I’ve done the fedex thing , and it’s different in lots of places , I’ve done it directly at the printer / copy machine and on some locations I had to hop on a computer. Also, to be fair you did say drive so idk if that or waking is the truth or did you just change it for the argument,but I do agree that most printers suck and this Hp model of business is one step lower than garbage, there are alternatives (at least for now) like brother but regardless there are still loads of people (other than elder) and jobs that need printing daily, architects, contractors, artists, notary, students… etc. And as a professional you can’t rely on the open hours of a fedex or the chance that their printer isn’t working or whatever. My point is that the fix for this problem that works for you is far from ideal for a huge amount of people (even more so abroad)",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Yes, sometimes online sarcasm and intent is lost on people. Don't take my question as literally asking. It was meant to convey how ridiculous and user unfriendly...hostile actually...something as simple as printing has become.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Sorry, BW brother printer costs 80$ and will last many years. There is no subscription, the toner cartridge last for thousands of pages.\n\nThe convenience of being able to print something and hold it within seconds is unmatched. You can also do it when the library is closed!",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "My mother has owned a Brother laser for many years and only replaced toner once. And she prints stuff for her neighborhood association.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Is it really as easy as clicking print though?\n\nMore like click print, print job fails, spend 20 minutes rebooting and setting up, click print again, out of cyan toner, order new toner, click print, print job fails anyway",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Thats all done from the website. Upload your docs or pdfs, pic color or not, what type of paper, how many copies, collared or not, yadda yadda, see a sample, pay for it, submit it. Get a text when it's ready and go pick it up.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "This is probably why they are moving towards this model. He can’t accept that the industry that he works in is waning, so they extract more from the customers who need to print.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Or have an old laser printer somewhere. Even if you only print like twice a year, it just works. Unlike inkjets.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I need to print maybe 5 things a year. I’d much rather head to staples or the library and spend $1.50 at most than buy my own printer, keep it stocked with ink, deal with the headache of it never working, and ultimately use the library or staples anyway",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "What a statement.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I print often because 1. Back in college. 2. I have ADHD and don't learn well with screens :( I print out lots of stuff so I can write notes on a physical copy right where/when the idea formed. I also have a Notary loan signing side hustle, and I work with kids---so much printing things, all the time. I can barely afford toner/ink, I so hope this subscription stuff doesn't happen 😭",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I work in architecture/interior design and we print out stuff all the time to pin up and sketch on.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "My wife prints things still. I must maintain a printer so the once a year she wants to print something she can. Then she gets mad at me when the printer doesn’t work because she hasn’t used it in a year and the ink dried up.\n\nOr she could go to the library down the street and get it printed dirt cheap.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yesterday I walked to my local library and printed 6 pages for less than a dollar. It’s the only print job I’ve had to do in two years.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "My wife.\n\nShe prints &#)$&#($*$% everything.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Suddenly, sales of pre 2005 printers have skyrocketed.\n\n\"It is unclear why consumers are so interested in ancient technology.\" -CEO",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The real money is in businesses where they print a lot, and those places ALREADY use printing as a service because they lease those big copiers. They can't break into that market unless they can also provide on-site service monthly.\n\nFor consumers, this will only piss them off right into the arms of Brother, Canon and Epson.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Pulling the plug on my HP inkjet and swapping it for a Brother laser printer was an indescribably liberating experience",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This just made my decision easier in picking a new printer.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Anyone have the phone number for their Canadian repair department? I’ve called many online numbers and always get told to call another department and can never seem to find the right one. Warranty is still good, printer stopped working after 3 months of light use. Paid $800 for this piece of garbage.",
        "points": "4 points",
        "children": [
          {
            "comment": "1-877-231-4351",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "just stop buying their stupid products, they can do whatever the fk they want to ruin their company.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I haven’t purchased an HP printer for years, a very shitty company.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Bought a printer 5 years ago, only used it until the ink ran out. Never needed it after and ended up throwing it away because nobody wanted to buy it on OfferUp. Apparently HP didn’t get the memo, nobody prints things anymore.",
        "points": "2 points",
        "children": [
          {
            "comment": "I may have to do the same thing. Nobody wants to buy the multifunctional printer I’m selling and which i am including extra cartridges. $35. —- i might have to throw it away sadly.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Ok.\n\nBut you will not be responsible for 100% of the cost and labor for all forms of maintenance for the printers you now exclusively own.\n\nI dare you.\n\nI fucking DARE you to pull that trigger. I fucking DARE you to make the frankly eldritch issues printers get constantly into your exclusive problem.\n\nI fucking DARE you, HP",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The ubisoft of printers...\n\nGo Brother.\n\nYou're welcome.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"Fuck no.\" - consumers. Just bought a brother printer and it's working fantastic. Little expensive but thus far worth the investment in spades. Haven't had to replace any toner despite printing more than my HP envy has EVER printed in one \"ink replacement\" cycle.\n\nFuck HP and stop buying any of their products. I say this as having used to do presale tech support on their enterprise equipment ( and at that time really loving their products.). Down with all subscriptions! They are anti consumer!",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m amazed of this next level of stupidity!",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The reality is HP has signaled they’ve lost the race in other technology fields so they have focused in this space to keep themselves alive. I’d be very worried as an HP employee because draconian moves like this are usually the beginning signals of much larger activities that usually result in divestitures or layoffs",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Stick with a Brother, thanks",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Haha HP is crap anyways but fuck this guy.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Next time I’m getting a brother laser printer and be done with it forever",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Everything wants to be a subscription.  It doesn’t even make sense.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If hell exists, the HP CEO should go to the lowest level possible next to or in the boiler room of that level after death.",
        "points": "1 point",
        "children": [
          {
            "comment": "No, you want him at the top level, heat rises lol",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "HP gunna be wondering in 10 years or less how a heretofore unheard of company became the new tech and printer giant.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "HP has been trash for the last decade, at a minimum. No clue why anyone would still be purchasing their products.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And one of the best reasons to not buy into any of it anymore.\n\nRecently pointed out the difference between update, upgrades and sabotage, got thrown off the sight for pointing out the obvious especially with always on the net connections that are unseen and always spying on everything you do, which is just another example of a stolen tech not intended for public or private use but something very specific for survival.\n\nN. S",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This right here is the definition of pure evil",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I just bought a Brother printer with Toner cartridges instead. I spent too much money on ink-jet cartridges that dry out because i only print a few times a year. Im just sorry i didn’t do this sooner.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Thankfully our HP Printer just died. It actually lasted a good 10 years.\n\nBack to a Brother Laser Printer.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Best decision I ever made for my business printer was turfing my HP printer and picking up my brother laser one, thing was $100 and been working for the last 10yrs",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Don’t buy HP, problem solved…",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I am done with HP. Just adding my hat to the ring in case anyone from HP researches this thread because I want them to see how overwhelmingly unpopular this is.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Companies like this should go out of business.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I just finished the cartridge and ordered a brother printer",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As a lazy person, I like this model. I can completely ignore my ink levels for less than a couple Starbucks drinks per month. I get that’s it not for everyone, though.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have been consulting on pay-per-page projects in the 2010s. This is neither new nor unexpected, least of all it’s an HP-only thing.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Stop printing",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's already this way in commercial settings.\nYou never own the printer. You subscribe to the \"service\". You pay a fee for the printer, you pay for the ink, you pay for the service, you pay PER PAGE PRINTED, but you will never own the thing.\nWe recently got a new printer at the office.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I used to be a sales rep for HP and it was incredible how they'd overlook sales of every other HP product to priorize only printers. Sold two Omen desktops? Why didn't you bundle a printer with them??? Sold a printer? Why didn't you bundle the ink subscription, Best Buy warranty, and a stylish cover???",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ars Technica article implies it’s a scam related to a theoretical threat. Either way, the solution would be to sandbox the print cartridge code rather than prevent other ink cartridges from working.\n\nHP’s old Laserjets were great, but I wouldn’t bother to own one of their modern ones for this reason.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s because he knows that printing is a dying technology. It won’t be long now.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If they want to kill this industry and force absolutely every single thing online, which was always inevitable even if far away, this is the way to do it, and quickly.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Anyone else notice the rising cost of printers? They used to be as cheap as $60 bucks now I’m seeing them for $200+",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well… me thinks deskjet tech is likely mature (indicated by move to screw customers rather than improve tech). Time for someone to step in with competition and serve the customer need.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If they make one that won’t jam take my money, until then F off.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If he is talking about business printing this is already the reality. The machines are provided to the business and the business pays per print.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And that’s why I don’t own a printer",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Put him through the shredder!!!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I found a 400$ brother monochrome printer at a thrift store for 10$ and Im already in love with it over my shitty epson that wont print black if the cyan is low",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Good place HP should start with their business is getting the printers to actually work",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I just bought one of their printers and made sure to read the terms. I declined all their subscription bullshit. We’ll see if it keeps them from bricking it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If HP printers are sold at a loss, I may buy one from time to time, sell the cartridges and bin the printer. I’m also happy to loss-lead on fucking HP up the bum.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "How do you serve a M$ bonus to a literal POS?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Do they want to go bankrupt? Cuz when you have an evil plan, youre not supposed to tell your customer, you do like netflix and make it progressively worst until its complete garbage",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wow the other printer company PR departments just got a freebie.\n\nI got an Epson eco tank. Costs more for the printer but the ink is insanely cheap and it’s just bottles that’s it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Good I hate printers, they can have them",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ok you want to make it a subscription? Then I want the printer for free, with free replacement printers (24 hour max delivery) every time your printer breaks.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So…just don’t buy a HP. Unless their model is to give you a free printer and you pay on demand.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Sadly most people don’t pay attention so they will continue to buy HP and complain instead of the obvious solution of buying any other brand. Be one thing if HP actually made really good printers but they don’t. They are cheap crap, prone to breaking and losing their way when need them. Instead they are like the off-off brand of printers that everything mistakenly thinks is the name brand.\n\nI got a Brother printer around 7 or so years ago. Besides occasionally needing to reboot, zero problems in all those years. Whenever need to print, just works.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Brother is the way",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Fuck hp",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19efw7h",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.theverge.com/2024/1/24/24048904/amd-fluid-motion-frames-frame-geneation-directx-11-12-feature-support",
    "title": "AMD’s new frame generation technology can boost FPS on most PC games",
    "points": null,
    "comments": [
      {
        "comment": "What’s the downside?",
        "points": "5 points",
        "children": [
          {
            "comment": "Half of your frames will look blurry/with artefacts. And it works bad with ui.",
            "points": "7 points",
            "children": [
              {
                "comment": "Interesting, is there a video demonstrating this?",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Will this be coming to a 6600M?\n\nHow about a 680M? Doesn’t sound like the 680M will get it",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Thanks nvidia.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don't want fake frames I want real ones!",
        "points": "-3 points",
        "children": [
          {
            "comment": "I think its always great to have more Options. Especially for People that dont have the Best of the Best.",
            "points": "3 points",
            "children": [
              {
                "comment": "Yeah, it’s great for handhelds. I’m running the preview drivers on my ROG Ally and it’s great.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Frames are frames!",
            "points": "4 points",
            "children": [
              {
                "comment": "The fake ones don’t taste the same.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It’s an option, no one’s forcing you to use it. Just lower your settings and resolution and you can get the same fps on “real frames”.",
            "points": "5 points",
            "children": [
              {
                "comment": "No, because it gives game devs the option to not optimize and just tell you \"just turn on frame generation to make our crappy game playable\" - Which they already do.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "Or maybe it gives developers the option to focus on making the game they want instead of focusing on optimizations?\n\nYou know like what happens every other console generation? Tessellation, PBR, TAA, Ray/path-tracing, etc.\n\nThere’s a lot of really efficient coding techniques from the 1970s that are no longer used in because hardware became fast enough to overcome the limitations and it was very tedious work to get that code working correctly.\n\nPeople want better looking and bigger games, only a fool would try to do the impossible and optimize everything instead of going with a blanket solution that already works.\n\nGet used to “fake frames” or play at 720p.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This tech is amazing, I believe \"lossless scaling\" using similar stuff and that program made my otherwise 30fps game feel so much better on my aging 1060.\n\nMinor artifacts though, but worth the fluidity.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19effk5",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://arstechnica.com/security/2024/01/mass-exploitation-of-ivanti-vpns-is-infecting-networks-around-the-globe/",
    "title": "Mass exploitation of Ivanti VPNs is infecting networks around the globe | Orgs that haven't acted yet should, even if it means suspending VPN services.",
    "points": null,
    "comments": [
      {
        "comment": "We've to learn of these critical patches from news outlets rather companies responsible reaching out to us.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19edkta",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://edition.cnn.com/2024/01/24/tech/sap-restructuring-ai-jobs-intl-hnk/index.html",
    "title": "SAP is restructuring 8,000 jobs as it shifts focus to AI",
    "points": null,
    "comments": [
      {
        "comment": "Crazy how sap still has a stronghold in the ERP market. They are somewhat overpriced and extremely difficult and costly to implement.",
        "points": "34 points",
        "children": [
          {
            "comment": "SAP software does not become part of your company, your company becomes part of the SAP ecosystem… or dies while transferring.",
            "points": "19 points",
            "children": [
              {
                "comment": "Hahaha I’ve worked at more than one place that has 35+ year implementations from them.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I used to work for SAP. SAP's most significant achievement is convincing everyone that it is a software company. However, it is not; rather, SAP is a company that sells software. The key to their success lies not in the quality of their software development process but in the effectiveness of their salespeople.",
        "points": "49 points",
        "children": [
          {
            "comment": "And the SI’s who have to implement the garbage",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Seeing that they openly support Nestlé is all I needed to know SAP is an unethical business. So this does not suprise me in the least.",
        "points": "35 points",
        "children": [
          {
            "comment": "What’s so wrong with Nestle that an association with Nestle kills the reputation of another company for you?",
            "points": "4 points",
            "children": [
              {
                "comment": "Oh boy. 🍿",
                "points": "32 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "The fight to stop Nestlé from taking America’s water",
                "points": "28 points",
                "children": [
                  {
                    "comment": "Thank you for sharing.\n\nDown voted for asking a question which is arrogance to assume everyone knows what’s important\n\n…why even ask? Glad there’s an exception here. Thanks again",
                    "points": "12 points",
                    "children": [
                      {
                        "comment": "I recovered you one. Your question wasn’t even in bad faith. We come to Reddit for discourse, links, and information - and then some real entitled shits come along.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "their CEO is a megalomaniac who thinks he owns all the water in the world and it all should be expensive not the God-given right that it is.",
                "points": "8 points",
                "children": [
                  {
                    "comment": "Thank you for sharing",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "Certainly. I don’t know why people are down voting you for asking a question. not everybody knows that Nestlé is buying up all the water out west in the US.",
                        "points": "3 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "/r/fucknestle is a good start",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Whoa 🤯",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Nestle refuses to stop using child slave labor for their chocolate and coffee. Every few years they claim they’re cleaning up their act, but then continue to use child slave labor. They even won a Supreme Court case saying they can’t be sued for using child slave labor.\n\nThey also are big into stealing water and selling it back to municipalities and people as a bottled product, taking more than the ecosystem can replace, especially in drought ridden areas.\n\nBut wait, there’s a lot more.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Thank you for sharing",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Putting the horse before the cart again aren’t we SAP?",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have zero confidence in SAP delivering a useful AI product.",
        "points": "4 points",
        "children": [
          {
            "comment": "I have zero confidence in SAP delivering a useful product.\n\nFTFY",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "[deleted]",
        "points": "18 points",
        "children": [
          {
            "comment": "Yeah you don’t really understand how business software works at all if you think some Excel spreadsheets can replace what an ERP does. You can’t manage every operation of a large or giant business (the only cases where SAP would cost 70 million to implement) on Excel. Or why does every single larger Enterprise have an ERP of some sort?\n\nNot saying SAP isn’t predatory, they are, but what you are suggesting is insane. Unless you work in a very simple business without the need for integrating finance / invoicing, order management, contact / customer / vendor management, procurement, production etc - a compilation of hundreds of spreadsheets will absolutely NOT cut it forever\n\nAlso of course businesses were doing well before ERPs existed, because nobody fucking had them. Businesses were doing doing fine before electricity was invented. Innovations only become that popular when they are necessary for your business to implement to maintain a competitive edge",
            "points": "18 points",
            "children": [
              {
                "comment": "You’d be surprised how many billion dollar, global companies run off systems cobbled together over decades. And the amount of Excel spreadsheets powering these businesses… lol.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "And all of them would love to replace that with a single fully integrated system, and they wish they would’ve done it way earlier. Because the longer you go without something like an ERP, and the more you grow, the more expensive it will become to implement one because of the insane amount of data that accumulates and typically questionable data quality or compatibility between systems. For those businesses an ERP implementation can become prohibitively expensive.\n\nWhich is why you need to analyze in depth what kind implementations and integrations should take place to determine whether it is worth the risk. But saying ERPs provide no value is insane.",
                    "points": "11 points",
                    "children": [
                      {
                        "comment": "I didn’t say anything about the value of a unified system, just providing non-anecdotal experience working in such orgs.",
                        "points": "-2 points",
                        "children": [
                          {
                            "comment": "Yeah I know and you’re right. I was more talking about OOPs claims rather than what you said.",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "As someone who has to deal with 10+ years old, 30 mg sized, 10k external files references, 300k+ improperly delimited vlookups excel files and staff that refuses to do otherwise because \"it worked before\", ouch.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "That makes me cringe just thinking about a system update that changes a column name or position. Keep up the good fight.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I wouldn’t be surprised at all because I’ve been a consultant for startups and massive companies and seen all flavors of ERP with fully fleshed out integrated systems, and a handful of offline spreadsheets where you gotta go “ask Lauren for her special lookup excel book she makes once a month”",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "[deleted]",
                "points": "6 points",
                "children": [
                  {
                    "comment": "lmao alright, I work in ERP implementation (not SAP, much cheaper) and you wouldn’t believe how many benefits you get from using a software designed to manage a business, that fully integrates all operational departments - compared to using fucking Excel sheets or a clusterfuck if 10 different systems for 10 different departments",
                    "points": "6 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "So begins the dismantling of our society as we know it, soon the ruling class vs peasants will be back upon us. the need for profit over humanity meets the constraints of the pocketbooks of the humans they shun.",
        "points": "4 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [
              {
                "comment": "It’s always a Wendy’s",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": true
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Man.. I just do not like SAP. I’ve used it for years. I despise it. It’s so annoying… not to mention ugly as shit.",
        "points": "1 point",
        "children": [
          {
            "comment": "I just battled with it this morning trying to do expenses for my team via their software. It is an absolute train wreck of a UI",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I just battled with it this morning trying to do expenses for my team via their software. It is an absolute train wreck of a UI",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "SAP dumped $4.5 billion on Business Objects, then pretty much deleted the product. Kind of says a lot about how they run a business.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "SAP is one of those corporate monoliths that is so outdated in its tech but so ingrained in the corporate world that it will exist long past being productive for its clients. It’s essentially the model for a corporate product’s stickiness; become essential in a workflow that controls billions of dollars, be so understood that you create SAP job titles within all corporations, profit.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why is this being allowed?",
        "points": "2 points",
        "children": [
          {
            "comment": "How is a business supposed to pivot if they’re not allowed to do this? They have to stagnate and fail?",
            "points": "2 points",
            "children": [
              {
                "comment": "Because there won't be a customer left to buy any of their products",
                "points": "0 points",
                "children": [
                  {
                    "comment": "SAP is ERP software. Its customers are other companies.",
                    "points": "7 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "They’re laying off employees not customers.",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "I think that commenter is making a second order effect claim. Namely, with the layoffs due to AI no one will be able to afford any products.\n\nAnd another person rightly said that their product is bought by other companies.",
                        "points": "4 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "They’re not even really laying people off. As the article mentions the majority will most likely get trained for different skills or voluntary leaving with some nice package",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19ebihr",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.theguardian.com/technology/2024/jan/24/ai-scam-emails-uk-cybersecurity-agency-phishing",
    "title": "AI will make scam emails look genuine, UK cybersecurity agency warns",
    "points": null,
    "comments": [
      {
        "comment": "Jokes on you—I don’t check my email",
        "points": "17 points",
        "children": [
          {
            "comment": "This is more threatening for many companies that rely on email to communicate with coworkers, vendors, clients, etc.",
            "points": "1 point",
            "children": [
              {
                "comment": "We have o365. Nothing to worry about. Even the Microsoft C-Suite execs are so confident, they don’t use MFA.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "We need to move much faster on data signing in general.\n\nC2PA is being developed to guarantee the authenticity of photography\n\nEvery user facing IT system needs to get electronic signing of its incoming communications.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That won’t happen. The misspellings and bad grammar are on purpose to weed out the less educated.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Add those to the other 50k unread emails on my phone, who gives a crap.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The reason scam emails are so obviously fake is to filter out anyone smart enough to see through (and report) it.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There are SPF, DKIM, DMARC, and other security related records/features that validate the original sender. It's very easy to verify the authenticity of the sent e-mail/domain to make sure it's coming from the business the core text says it's coming from. If only the free e-mail providers integrated those checks for inbox delivery. If only. Looking at you, microsoft.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Spellcheck would make scam emails look more genuine.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Say something more obvious in your headline…. Sigh",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s really going to hit older generations hard especially. Getting a deepfake audio phonecall or video is going to con a lot of people.",
        "points": "0 points",
        "children": [
          {
            "comment": "The deepfake audio calls already conned a lot of people. Especially since there’s a lot of human trafficking that goes on.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Cant wait until AI tries sell me NFTs to prove its emails are genuine",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Look as real as you want. I don’t answer emails anymore. I go directly to the source. Problem eliminated.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you don’t know, you need at minimum two email accounts at all times.\n\nOne to sign up for spammy shit, and the other one for professional things like work, applications, maybe bills.\n\nYou can expand it from there and have email accounts for various other categories of things. But you need a throwaway, usually a yahoo, email to hand out for the free trials and garbage websites",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "People check their emails?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Don’t scammers purposely make them not look completely legit? And its not like scammers can’t make a genuine looking email right now.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "But isn’t the whole point usually is scam emails being poorly written so it weeds out the less gullible",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19e0ydz",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://cybernews.com/security/billions-passwords-credentials-leaked-mother-of-all-breaches/",
    "title": "Mother of all breaches reveals 26 billion records: what we know so far",
    "points": null,
    "comments": [
      {
        "comment": "The supermassive leak contains data from numerous previous breaches, comprising an astounding 12 terabytes of information, spanning over a mind-boggling 26 billion records. The leak, which contains LinkedIn, Twitter, Weibo, Tencent, and other platforms’ user data, is almost certainly the largest ever discovered.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There is higher chance off guessing my social security number than of them using my data after it’s leaked.",
        "points": "-1 points",
        "children": [
          {
            "comment": "12345?",
            "points": "0 points",
            "children": [
              {
                "comment": "How did you know my password?",
                "points": "1 point",
                "children": [
                  {
                    "comment": "That’s the code in my luggage",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19e071s",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.reuters.com/business/aerospace-defense/boeing-presses-suppliers-tightening-bolts-after-loose-parts-found-737-max-9-2024-01-23/",
    "title": "Exclusive: Boeing presses suppliers on tightening bolts after loose parts found in 737 MAX 9 checks",
    "points": null,
    "comments": [
      {
        "comment": "Are they saying they don't inspect the work provided by suppliers?",
        "points": "46 points",
        "children": [
          {
            "comment": "It’s only a billion dollar aircraft, who has the time?",
            "points": "4 points",
            "children": [
              {
                "comment": "Far from a billion my friend — it’s very important to do, but not a billion dollars important.",
                "points": "6 points",
                "children": [
                  {
                    "comment": "I know, but a few 100 million doesn’t roll off the tongue the same way ):\n\n….plus no Dr. Evil (post inflation)",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Just a prime example of CYA , finger pointing, blaming others",
        "points": "20 points",
        "children": [
          {
            "comment": "When you fire all your Quality control workers you really need to start pointing at your suppliers I guess",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Boeing issued a bulletin to its suppliers late last week that laid out practices to ensure bolts are properly torqued after multiple airlines reported loose hardware during inspections of the grounded 737 MAX 9, according to a memo seen by Reuters.\n\n \n\nThe U.S. planemaker said that it is \"imperative\" that suppliers meet quality requirements, according to a Jan. 17 memo seen by Reuters, issued weeks after an accident when a panel ripped off of a 737 MAX 9 jet while in mid-air.\n\n \n\n\"Ensure that work instructions are mistake-proof and quality is continuously monitored - particularly torquing requirements,\" it states.\n\n \n\nThe bulletin suggests suppliers document torque requirements on work instructions, require mechanics to record how much torque is applied when fastening components, and ensure tools are properly calibrated to ensure bolts are properly tightened.\n\n \n\nRead the full story for more.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Everyone needs to watch “Downfall: The Case Against Boeing” on Netflix.\n\nThis wasn’t an accident. This was an eventuality. Boeing has transitioned from a great engineering company to just another cost cutting business.\n\nThey are treating airplanes like any other product that you can just slowly cheap out on more and more each year.\n\nWhen it comes to flying, if it’s Boeing, I ain’t going. They are the Spirit Airlines of plane manufacturers now.\n\nYou couldn’t pay me to get on a 737 Max.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Boeing needs to go back to having engineers leading instead of people with MBAs.",
        "points": "1 point",
        "children": [
          {
            "comment": "Or with engineers that also have MBAs!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "There's always somewhere else to point the finger. That's the beauty of aviation in America.",
        "points": "2 points",
        "children": [
          {
            "comment": "That’s the beauty of doing business in America.\n\nFTFY",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19eiont",
    "subreddit": "u/BbIPOJI3EHb",
    "dataType": "link",
    "dataUrl": "https://store.steampowered.com/app/2402170?utm_source=redditgames&utm_campaign=release",
    "title": "I made a puzzle game where YOU design a puzzle and AI solves it. It turned out incredibly deep, challenging and fun! Check it out!",
    "points": null,
    "comments": []
  }
]