[
  {
    "id": "t3_19ajjit",
    "subreddit": "r/tech",
    "dataType": "link",
    "dataUrl": "https://www.technologyreview.com/2024/01/18/1086753/advanced-nuclear-power/",
    "title": "The next generation of nuclear reactors is getting more advanced. Here’s how.",
    "points": null,
    "comments": [
      {
        "comment": "Well god I’d hope so",
        "points": "39 points",
        "children": [
          {
            "comment": "Imagine the opposite, “we can’t figure out how to build nuclear reactors good no more, we didn’t write it down..”",
            "points": "25 points",
            "children": [
              {
                "comment": "That is a serious problem too when nuclear lacks investment for long enough.",
                "points": "16 points",
                "children": [
                  {
                    "comment": "Imagine how much cheaper and more efficient we could be making them now if not for all the anti nuclear propaganda",
                    "points": "15 points",
                    "children": [
                      {
                        "comment": "Had a lady come after me on Twitter, because I commented something positive about their nuclear reactor.\n\nTurns out, she's running for the public commission office there, and makes her whole agenda bashing the current guy who had a lot to do with the reactor.\n\nSo my generally thought was that maybe the thing went over cost so badly, because nuclear has to fight an uphill battle to get permitted. Then when it does, since we had an uphill battle for so long, the technical prowess has diminished.\n\nOn a practical scale, that would mean a kid that wants to become a nuclear engineer, wouldn't stay in a state where nuclear is banned or never built.\n\nThen a few months go by, and I see the same character popping up. They're claiming that this nuclear plant cost rate-payers $11...\n\nDude. $11.\n\nCompared to the rapid train in the UK that some people are trying to stop from going to Scotland. It would cost every taxpayer about $1,200.\n\nHmm. Still, sounds amazing to me, could be lower.",
                        "points": "4 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "What you mean to say is billions in subsidies for decades and they still can't produce affordable power?",
                        "points": "-1 points",
                        "children": [
                          {
                            "comment": "Fossil fuel subsidies?",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "No, nuclear subsidies.\n\nNo reactor build since 1951 has been built without subsidies. In fact if you remove all the subsidies, every single nuclear reactor had lost money in real terms\n\nhttps://reneweconomy.com.au/nuclear-energy-is-never-profitable-new-study-slams-nuclear-power-business-case-49596/",
                                "points": "-1 points",
                                "children": [
                                  {
                                    "comment": "Imagine how much cheaper and more efficient we could be making them now if not for all the anti nuclear propaganda",
                                    "points": "0 points",
                                    "children": [
                                      {
                                        "comment": "Just another trillion bro... I'll pay your back this time I PROMISSSSSSSE...",
                                        "points": "0 points",
                                        "children": [
                                          {
                                            "comment": "Fossil fuel subsidies?",
                                            "points": "-1 points",
                                            "children": [
                                              {
                                                "comment": "",
                                                "points": "",
                                                "children": [],
                                                "isDeleted": false
                                              }
                                            ],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "Lost money gained energy with lower cost to the environment compared to fossil",
                                    "points": "-1 points",
                                    "children": [
                                      {
                                        "comment": "Source required for that word salad bot.",
                                        "points": "0 points",
                                        "children": [
                                          {
                                            "comment": "Lol",
                                            "points": "0 points",
                                            "children": [],
                                            "isDeleted": false
                                          },
                                          {
                                            "comment": "Don’t think any source or article will convince someone who is so certain that fossil fuels are bad for the environment is a lie.",
                                            "points": "0 points",
                                            "children": [
                                              {
                                                "comment": "",
                                                "points": "",
                                                "children": [],
                                                "isDeleted": false
                                              }
                                            ],
                                            "isDeleted": false
                                          },
                                          {
                                            "comment": "Especially one that tries to insult so easily without any real provocation",
                                            "points": "0 points",
                                            "children": [
                                              {
                                                "comment": "",
                                                "points": "",
                                                "children": [],
                                                "isDeleted": false
                                              }
                                            ],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "I’m a proponent of nuclear for a lot of reasons I won’t get into but there are some real dangers and downsides. Current plant maintenance requires an army of trades like plumbers to maintain. New plants should be easier but you do need to be cautious about where the plant is located(see Fukushima). You still have nuclear waste which isn’t just limited to the fuel itself. Most of the time that waste ends up stored on site because facilities that can process or store the waste have backlogs of up to a decade. It’s not something to be hand-waved away. I support nuclear and new plants but it’s not all propaganda.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "All that could’ve been solved by now if not for the propaganda. You can reuse the waste till it’s almost nothing. Accidents have happened, yet we could’ve learned from them and moved on but instead chose to focus more on fossil fuels and other alternatives.",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "But the last time I looked this up there was exactly one functional facility in the world that does the reprocessing and it was backlogged by at least a decade and wasn’t taking more waste. Fukushima made the surrounding area unlivable because of that tsunami and earthquakes but otherwise is a pretty good location for a nuclear plant. Those problems haven’t been solved and it’s not propaganda.",
                                "points": "0 points",
                                "children": [
                                  {
                                    "comment": "You’re correct it is recent and newer technology.\n\nImagine how much cheaper and more efficient we could be making them now if not for all the anti nuclear propaganda",
                                    "points": "0 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "No it's not. Solar panels and batteries work just fine with zero nuclear power plants and nuclear \"engineers\"",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "You joke but that happens. There are nuclear weapons components for example that they don’t have the plans for to make replacements of. One of those was a subcontractor who supplied the original materials went under and because the stuff hadn’t been needed for some years it was thrown away. In other cases the tools and equipment needed for manufacturing gets scrapped.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "I read a funny story about this with respect to B-2 bombers. It was widely believed the windshield was unbreakable because they hadn’t replaced one in decades. During that time the manufacturer shut down and sold off all the spares, no one had ever ordered any. Some dude bought one for his kids treehouse and it was easier to track him down and buy it back than try to build a new one.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "“Nah, we’ll just build this one shitty and see what happens”",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Try building a Saturn V rocket these days….",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Big plot point of the foundation book series.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Greek Fire moment",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Yeah that was the moon program. Apparently completely plausible and everyone is ok with it?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yeah it’s like when Apple say “this is the best iPhone ever” every year. Like they’d come out and say “this year we kinda phoned it in”.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "\"The next generation of nukes is using 19th century steam engine technology!\"",
            "points": "2 points",
            "children": [
              {
                "comment": "*Enters chat in SteamPunk gear",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Hopefully the next generation of humans get smarter as to stop fearing the nuclear energy.",
        "points": "19 points",
        "children": [
          {
            "comment": "At some point the general population, and hopefully legislators, will realize that it is the ONLY way we can realistically provide enough clean energy for our radically increasing power demands.",
            "points": "10 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It's like fear of flying. The failures are one in a million, but when they happen, THEY HAPPEN.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "That looks a like 55gal drum lol",
        "points": "13 points",
        "children": [
          {
            "comment": "Looks a lot like my home brew setup. Doh!",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Well, it's the next generation, so they're using a 550 gallon drum. High tech.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "So how many generations and advancements ahead are we from the last one built in the USA? Probably 4 or 5? Newest reactors we build go on aircraft carriers the military trusts in combat on the seas, and we won’t even give one a chance bc NIMBY so we’ll just frack and coal our way to oblivion.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The old generation of reactors is going to just talk crap and call the new generation of reactors lazy and tell them to eat less avacados to save more",
        "points": "2 points",
        "children": [
          {
            "comment": "Ok boomer. Get it? Boomer...they can go boom....the old ones...cause....\n\nNever mind...",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Awesome. Look forward to seeing them be planned for 20 years and then abandoned as too expensive.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All those key points and not a single mention of waste disposal.",
        "points": "5 points",
        "children": [
          {
            "comment": "Because it's really not an issue?",
            "points": "9 points",
            "children": [
              {
                "comment": "Pretty sure you can reuse nuclear waste",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Yes. Some modern reactor designs can use the fuel over and over again.",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "If not now then in the near future.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "My understanding is that there are some US laws preventing this. It is very technically doable and done in Europe.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Gen 3 and 4 reactors us much smaller fuel pellets that can typically be de-radiated or recycled for use again. I believe the french made moves on that, but I don't remember.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Disclaimer- I’m no expert and this is my take from reading ~4 articles (2 of which admittedly read like sales pitches) and an excerpt of this https://nap.nationalacademies.org/read/26500/chapter/17#290\n\nI think they did talk disposal In a roundabout way, by mentioning most of these designed use alternative fuels like TRISO, which easier to commit to geological storage because of the encapsulation and fuel structure- they’re resistant to groundwater intrusion so they can be buried safely anywhere geologically stable, and primary products are at or below background levels of radioactivity in 1000 years.\n\nIf you’re OK with geological storage and a 1000year problem, it works, though the encapsulation material adds volume, so you’ll need more space than interring current typical fuel.\n\nThe downsides- the stuff is hard to reprocess at all, let alone cleanly/safely. Attempting to do so releases a ton of carbon for less yield of reusable fuel and exchanges a small amount of high-level radioactivity waste for a massive amount of low-level waste.\n\nAlso less recyclability (I assume) would mean new fuel requires more mining as they’re less usable spent fuel available to reprocess into new.\n\n(Again, take this with a grain of molten salt. I have 0 formal education on this subject.)",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "They did.\n\nYou just didn’t understand it.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "There's barely any waste made.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Are we ordering from Temu now?",
        "points": "0 points",
        "children": [
          {
            "comment": "Nah, the shipping would be prohibitive.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Are",
        "points": "-1 points",
        "children": [
          {
            "comment": "It’s confusing, but it’s talking about the “next generation” as a singular noun, ergo “is” is the correct verb.",
            "points": "1 point",
            "children": [
              {
                "comment": "Ah, thanks for the clarification! I took “next generation” as the adjective and the noun as “reactors”, plural. It just sounds, wrong 😅. Have to love the English language!",
                "points": "1 point",
                "children": [
                  {
                    "comment": "It’s stupid confusing at times.\n\nLike how confusing would it be to read a phrase like “through enough dough” the first time of you didn’t know the different phonics.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "now just find a way to deal with all the nuclear waste and make it cheaper then wind/water/solar...",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yeah nah. Same old warmed over, decades old technology.\n\nNew nuclear is producing power 300-500% more expensive than renewables. It's just not cost competitive against renewables. Game over for nuclear I'm afraid",
        "points": "-2 points",
        "children": [
          {
            "comment": "Not until renewables make power 24/7 .. without nuclear it will be more natural gas",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "And that is how Nuka Cola was born!",
        "points": "-7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Bc also - science. In this industry they continuously study, apprenticeship, and have to learn every aspect of each others jobs (at the plant).",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The alternative is to go full battlestar galactica to protect us from AI.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm surprised when reading these articles why no one ever mentions Thorium. Sure it's a bit harder to work with, but there is no big boom possibilities either. It seems the only reason, as far as I could read, is it can't be used for nuclear weapons like uranium and plutonium .",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“Nuclear power plants generate electricity via fission reactions,”\n\nSounds like the reactor is generating electricity but all it does is heating water and running a turbine.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why does the picture look like a still?\n\nMicro reactors! Now with booze function!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No nuclear reactor build since 1951 has been built without subsidies. In fact if you remove all the subsidies, every single nuclear reactor had lost money in real terms\nhttps://reneweconomy.com.au/nuclear-energy-is-never-profitable-new-study-slams-nuclear-power-business-case-49596/\n\nNothing new here just the nuclear industry with their hand out for more taxpayer subsidies.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19a81tm",
    "subreddit": "r/tech",
    "dataType": "link",
    "dataUrl": "https://interestingengineering.com/energy/power-plants-wind-rain-electricity",
    "title": "Researchers develop artificial 'power plants' in the form of tiny leaf-shapes to harness energy from the wind and rain.",
    "points": null,
    "comments": [
      {
        "comment": "Ok this has to be a joke at this point right? Every day we see news about some new source of energy yet we never see or hear about it again.",
        "points": "22 points",
        "children": [
          {
            "comment": "Just like any novelty\n\nNeeds to be scalable or so obviously advantageous but also the political timing for massive funding",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Because it is way overhyped by and for popsci media so they get clicks. Meanwhile the actual research is usually just some test which Might! result in something more. Some scientist are also a bit forced to encourage this hyping so that they can get funding among the other hypers. It creates a circle of people needing to outhype eachother.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Realistically this concept could be turned into artificial turf and be a much more practical solution",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So it’s a magic peace Lilly? Because the image I’m seeing with this add is a peace Lilly with highlighted flowers.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Oh no, not again",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Super cool! Wondering how many will/are inspired by something like this and go on to create something awesome, or build on this! The biggest potential downside here is creating another monoculture that destroys habitat.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Fake trees that absorb carbon better and use rain to generate electricity in the future",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]