[
  {
    "id": "t3_199jerv",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://fortune.com/2024/01/17/mustafa-suleyman-deepmind-ai-a-i-labor-replacing-tool-over-the-long-term/",
    "title": "Google DeepMind co-founder Mustafa Suleyman warns AI is a \"fundamentally labor replacing\" tool over the long term",
    "points": null,
    "comments": [
      {
        "comment": "Yeah. We know.\n\nIt'll be used to replace us long before it's used to save us.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I was going to read the article but there’s a paywall. I can guess the gist of it though. It’s pretty obvious where AI is headed. They’re already in the process of replacing people with it",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_198s7d5",
    "subreddit": "u/HeroWarsDominionEra",
    "dataType": "link",
    "dataUrl": "https://www.hero-wars.com/?delayedsignup=true&nx_source=adx_reddit.{{AD_NAME}}&cp=-.ag-{{ADGROUP_NAME}}.agid-{{ADGROUP_ID}}.aid-{{AD_ID}}.cid-{{CAMPAIGN_ID}}.post-{{POST_ID}}.rdt_click-{{CLICK_ID}}",
    "title": "Many failed before. Will YOU complete the trial?",
    "points": null,
    "comments": [
      {
        "comment": "A black hole is a region of spacetime where gravity is so strong that nothing, including light and other electromagnetic waves, has enough energy to escape it.[2] The theory of general relativity predicts that a sufficiently compact mass can deform spacetime to form a black hole.[3][4] The boundary of no escape is called the event horizon. Although it has a great effect on the fate and circumstances of an object crossing it, it has no locally detectable features according to general relativity.[5] In many ways, a black hole acts like an ideal black body, as it reflects no light.[6][7] Moreover, quantum field theory in curved spacetime predicts that event horizons emit Hawking radiation, with the same spectrum as a black body of a temperature inversely proportional to its mass. This temperature is of the order of billionths of a kelvin for stellar black holes, making it essentially impossible to observe directly.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wait, you actually opened the comments? Are you stupid?",
        "points": "3 points",
        "children": [
          {
            "comment": "Just to see whether I'm alone or not...",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "they are",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I'm that lonely and bored...",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The world would be such a better place without you people in it.",
        "points": "1 point",
        "children": [
          {
            "comment": "You start!!!!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "this you?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "nice",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "son ellos",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "with many on the title this is a juicy clickbait .",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "who is upvoting this why",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wasn't expecting comments on this",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Techbible is your go-to tech community. Ask questions and get expert answers on all things SaaS. Stay updated on the latest tech news, discover trending tools, and share your tech stack with the world. Don't Forget to try it out.\n\nhttps://techbible.ai/",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "wow",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_199cy34",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.theregister.com/2024/01/16/poisoned_ai_models",
    "title": "How 'sleeper agent' AI assistants can sabotage your code without you realizing. Today's safety guardrails won't catch these backdoors, study warns.",
    "points": null,
    "comments": [
      {
        "comment": "There was a paper concerning a similar attack based on Ken Thompson’s trusting trust Turing award speech. The proposal was diversity of tools cross checking each other (in this case compilers but LLM static analysis would suffice). As long as the tools aren’t colluding the end result is more trustworthy.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_199c5ec",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://arstechnica.com/tech-policy/2024/01/cable-firms-to-ftc-we-shouldnt-have-to-let-users-cancel-service-with-a-click/",
    "title": "Cable firms to FTC: We shouldn’t have to let users cancel service with a click | Customers may \"misunderstand the consequences of canceling,\" cable lobby says.",
    "points": null,
    "comments": [
      {
        "comment": "Lmao “we don’t want to give them a button to cancel, so they are forced to call us, and from there we overload them with so much information that it seems like they are getting a deal, when in reality we are removing 5 services and charging them $10 extra”",
        "points": "44 points",
        "children": [
          {
            "comment": "Honestly I just tell them I’m moving to a new location that doesn’t allow them. They be angel no questions asked",
            "points": "9 points",
            "children": [
              {
                "comment": "Just say you're reporting to prison next week.\n\nWhen you say you are moving to a new location, they will pivot the conversation to moving the service to the new location.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Doing whats best for the customer my ass. I hope the FTC sees right through these shenanigans.",
        "points": "33 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“Oh shit… why my TV no workies no more? Me no understand. I just told them me no wants pay money. Now no TV? Jeeze why no one save me from me?” Said no one.",
        "points": "20 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The Capitalist Profit Motive makes for cold and stark conditions in the marketplace, bone-chilling conditions, when you get right down to it. Lobbying the Fed to make it harder to cancel or unsubscribe?? These blood-thirsty bank-account predators are ice-holes, straight up leave-you-out-in-the-snow, ice-holes.\n\nAnd I say, let's all freeze 'em out, just like they try to with us!",
        "points": "14 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No one believes this at all, but I'll give them props for saying it with a straight face.",
        "points": "10 points",
        "children": [
          {
            "comment": "There's a reason for that. During the interview process to become a lobbyist, they make them say increasingly absurd things and keep a straight face doing it. That, and shoveling cash into politicians' front lawn are the only two required job functions, but they tend to do their cash shoveling at night so the public doesn't usually see it.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "No, we completely understand what we are doing!",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is my favorite line: \"The cable lobbyist contended that consumers are happy with cable company cancellation practices\". 😂",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“They may not realize how much money they will be saving!”",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you can sign up with a click you should be able to cancel with a click.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Greedy corporations just want to make money upfront with streaming services. No wonder studios have lost their motivation to create great successful shows that could produce 100+ episodes. Those days and great shows are gone.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“After learning the consequences of enrolling”",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "FTC response: than eliminate the consequences (fees)",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Lina Khan and FTC is so useless. There are actual evil fucks like the cable industry and their bad practices. But she want to score a point for her political career.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“Do you realize that not only will you lose your channels but you’ll also stop paying us!?”",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1999bed",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.bloomberg.com/news/articles/2024-01-17/watching-netflix-on-apple-vision-pro-you-ll-have-to-use-the-web",
    "title": "Apple's Vision Pro Won't Launch With Netflix App",
    "points": null,
    "comments": [
      {
        "comment": "Everyone knows you will have bought it for porn. Not fooling anyone",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We'll see, but once the novelty wears off I can't see too many people wearing a headset to watch hours of video.",
        "points": "1 point",
        "children": [
          {
            "comment": "How much is it again?? I heard something akin to $2,500\n\nEdit: Oh god just read the article and the price in the headline yikes this is Dead on Arrival",
            "points": "-3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Oh noes!\n\nThe thing no one actually wants will not run an app that's available basically everywhere in a dozen other formats.\n\nBut I guess the innovators that fork over $3500 for this nonsense device will want to use it for everything, so perhaps they'll actually be sad.",
        "points": "-3 points",
        "children": [
          {
            "comment": "Some people actually have jobs so that they can afford these. Do just poor bitter people hang out here?",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I tested the quest 3 recently and i was quite surprised how well it performed. Normally you could assume Apple does these things way better. But that price tag is enormous. I would definitely want to try it to see if it’s worth the money",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "thank god it'll likely be a 30 dollar special monthly subscription anyways",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1997tyl",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://arstechnica.com/tech-policy/2024/01/openai-must-defend-chatgpt-fabrications-after-failing-to-defeat-libel-suit/",
    "title": "OpenAI must defend ChatGPT fabrications after failing to defeat libel suit",
    "points": null,
    "comments": [
      {
        "comment": "This is so ridiculous.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "ChatGpt isn’t even what OpenAI is trying to sell to people, chatbot is just a demo of capabilities…",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Skynet make ouchy ouchy … I am sure if you gotta defeat libel suit you can argue it has intellectual property over said “fabrications” no(?)",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1997sqd",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.reuters.com/legal/court-bars-us-apple-watch-imports-during-appeal-over-ban-2024-01-17/",
    "title": "Court bars US imports of Apple watches that read blood-oxygen levels",
    "points": null,
    "comments": [
      {
        "comment": "Apple Watches capable of reading blood-oxygen levels cannot be imported into the U.S. while Apple challenges a government decision that the devices infringe patents, a federal appeals court ruled. The patents in question belong to medical technology company Masimo.\n\nThe ruling by the U.S. Court of Appeals for the Federal Circuit means the affected watches cannot be imported starting at 5 p.m. on Jan. 18 while Apple appeals the U.S. International Trade Commission's ban.\n\n Separately, U.S. Customs and Border Protection on Jan. 12 determined that a proposed redesign from Apple would allow it to import reconfigured versions of its latest Series 9 and Ultra 2 Apple Watches without violating the ITC's restrictions, court filings show.\n\n Read the full story for more.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Didn’t they disable the sensor to comply in the meantime so why are they completely banned?",
        "points": "0 points",
        "children": [
          {
            "comment": "Because they still have potentially proprietary tech in their device that is undecided until they successfully appeal it. Doesn’t matter if it is on or off, it is still netting them a profit from the sales of the watch.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1995938",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.nature.com/articles/d41586-024-00145-1",
    "title": "This AI just figured out geometry — is this a step towards artificial reasoning?",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_1993cax",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.vice.com/en_us/article/y3w4gw/a-shocking-amount-of-the-web-is-already-ai-translated-trash-scientists-determine",
    "title": "A ‘Shocking’ Amount of the Web Is Already AI-Translated Trash, Scientists Determine",
    "points": null,
    "comments": [
      {
        "comment": "Just look at all those posts on Reddit \"What is your most liked level in the game/beer/song/character in movie or game\" and such. So convenient for AI parsing...",
        "points": "178 points",
        "children": [
          {
            "comment": "I was playing through Elden Ring recently and I was wondering if there was a 5th talisman slot so I googled it. Found an article, clicked.\n\nThe entire article was one liner Q/A style information. In the article it told me to get the 5th talisman pouch (doesn’t exist) by killing a boss that didn’t exist (2 boss names combined). It also told me about Elden Ring 5 and how to find the Elden ring in baulders gate in the 5th game. Lots of AI bullshit everywhere unfortunately.",
            "points": "72 points",
            "children": [
              {
                "comment": "I too have elderly ring. Kick getting ass my always. Need lube ? Call 53388602111",
                "points": "29 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Just wait until generative ai learns from those articles and degrades even more 🥲",
                "points": "23 points",
                "children": [
                  {
                    "comment": "A monstrous feedback loop. Not the singularity we were fearing.",
                    "points": "16 points",
                    "children": [
                      {
                        "comment": "Ever more AI polluting search results, more and more optimized to the search algorithm pushing real results further out, delivering less and less actual value.",
                        "points": "8 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Schizophrenic AI singularity.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "That's like the gif of Hank Hill asking what the hell is a jpeg.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Oh lord",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Me: hey what’s happening in the Middle East?\n\nchatgpt_reddit: Things are about to get real “proportional” the houthis have fucked around and are going to find out, Iran hasn’t entered the find out stage of fuckarounding yet. Things might get “proportional” between Pakistan and Iran now Iran has fucked around with pakistan, they may have to find out.\n\nAnd so on and so forth, unchanging, until the actual humans here learn some new fucking words.",
            "points": "48 points",
            "children": [
              {
                "comment": "“Those starving fucks are about to learn why we can’t afford cancer treatments! Fuck yeah!”",
                "points": "24 points",
                "children": [
                  {
                    "comment": "That might be the funniest thing I’ve read all day.",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "It’s the fiftieth variation of it I’ve read this week. 🤷🏼‍♂️",
                        "points": "4 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "“Those unwashed masses are about to find out why I have so much plastic in my blood.”",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Haha DAE FAFO??? Updoots to the left\n\nSeriously it’s horrible lol",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Fat Electrician go brrrr",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "So convinientconvenient for AI parcingparsing\n\nIf the bots can spell, perhaps it will not be all bad.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Holy fuck, yes it is.\n\nGoogle, how do I make a (whatever)?\n\nRandom website - Would you like to make a whatever? It’s very important to know how to make a whatever. In this article we will discuss making a whatever. There are many different types of whatever’s, so it’s important to consider what type of whatever you would like to make. (incomprehensible nonsense)",
        "points": "52 points",
        "children": [
          {
            "comment": "you are still reading in 2024? just ask AI to read it for you...",
            "points": "11 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "And so are most of the accounts on large social media sites. Ever wonder where all those people are coming from on Facebook, Twitter and others? Why the numbers always increase and never decrease? Shouldn't it sort of level out after a while with people dying and others getting an account for the first time, not just increasing?\n\nHow many people are there in the world and how many \"users\" does social media claim they have? Doesn't add up does it?",
        "points": "78 points",
        "children": [
          {
            "comment": "the math is indeed not mathin\n\nResearchers at the Amazon Web Services AI lab found that over half of the sentences on the web have been translated into two or more languages, often with increasingly worse quality due to poor machine translation (MT), which they said raised “serious concerns” about the training of large language models.\n\ni also found it interesting they repeatedly used MT since all i could think of was the \"mechanical turk\" thing that amazon had (has?) where they pay desperate people pennies for... uhh idk, producing low quality content like pointless articles on pointless websites, probably\n\ngfy bezos",
            "points": "34 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Every single white lady boomer in the US has at least two fb accounts due to wine related password mishaps.",
            "points": "20 points",
            "children": [
              {
                "comment": "I don’t think you can just make a new FB that easily. I tried making a spare FB for some services and it wanted me to verify my drivers license and all that.",
                "points": "8 points",
                "children": [
                  {
                    "comment": "That’s for business….\n\nI had like 2-3 Facebook accounts. One for a weight loss challenge they wanted me to check in on Facebook every time I worked out, I didn’t want to bother my friends with risky posts checking into the gym. Made me come off desperate, one for family and one for friends where I posted whatever I wanted. (Mainly bitching about family drama that happened. It was cringe looking back)",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Weird, I couldn’t do it",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Same, tried making a new one for my mom, she has all sorts of leeches on her account and they immediately suspended the new one before I could remove the old one.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Can confirm my mom in fact has 4 accounts because she was very into Farmville back in the day. Rules to create profiles were much less strict then.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "LOL! Holy shit. I wish I was in grade school so this could be my science fair topic…\n\nFacebook accounts: Mostly white wine-drunk boomer lady password mishaps?",
                "points": "2 points",
                "children": [
                  {
                    "comment": "I can save you the experiment I know what it will say. White is primarily involved with technological incompetence.",
                    "points": "-6 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Yeah outside the English speaking world Facebook is still huge. Or I should English adjacent? I know my coworkers who are African use Facebook and WhatsApp and messages to keep in touch with each other",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I know someone who was a writing content creator for a company that creates a ton of “top 9 ways to xxx” type articles (I think it was Word Agents?)\n\nLast year they sent out an email letting all their writers that they would no longer be needing them, and if they still wanted to continue working they would serve as editors to AI created content instead.",
        "points": "13 points",
        "children": [
          {
            "comment": "And nothing of value was lost...",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "what’s even more hilarious is the amount of people that consider AI the second coming? It’s the most ridiculous thing.",
        "points": "27 points",
        "children": [
          {
            "comment": "It's pivot to video all over again. Turns out there's no replacement for actual human journalism.",
            "points": "17 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Coming of the Antichrist maybe.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "it totally and completely changed how I work in my job.\n\nand what about all the people that already lost their jobs to AI? Duolingo translators just recently.\n\nmaybe you find it ridiculous because you don't know how to use it, or don't have a practical use for it",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Remember when everyone thought that automation was going to get rid of all of the jobs in the auto industry in the 1990s?",
            "points": "0 points",
            "children": [
              {
                "comment": "yes I remember the drastic reduction in jobs that happened after automation. that's why so many countries changed from an industrial economy to a service one",
                "points": "9 points",
                "children": [
                  {
                    "comment": "USA turned into one.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "ask google a question and excluding quora or reddit, every single hit will be an ai generated ghost down blog post",
        "points": "17 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "How the AIs will really take over, with misinformation.",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The photo on this article is hilarious. Like the guy is devastated to find out he’s been reading AI bullshit all this time",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "TURN OFF. UNPLUG. TUNE OUT.\n\nFuck the dystopia.",
        "points": "6 points",
        "children": [
          {
            "comment": "As authentic a social media post as I'll ever read.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The next big hot skill is editing AI responses before they are released. It fits with the generative concept. We will forever be programming our robots.",
        "points": "3 points",
        "children": [
          {
            "comment": "To all the people saying AI and robots will take their job: we will be creating new jobs making sure the robots and AIncan do our old jobs correctly. It’s the same way a seamstress in the 1800s felt the sewing machine would take her job. It created a need for someone to run to machine.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Vice probably has AI write its articles",
        "points": "9 points",
        "children": [
          {
            "comment": "Very true lmao. Vice isn’t known to take the high road, ever.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This is one of those things that should be obvious without scientists studying it. Although I guess that helps quantify the issue.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Great stuff to train new AI with",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Entropy in action!",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Oh no, do we have to go back to the real world now?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Most sensitive stuff on Reddit is already propaganda as well as the comments. The narratives and comments are so predictable.",
        "points": "2 points",
        "children": [
          {
            "comment": "Yeah I thought I was the only one seeing that",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Newsweek comes to mind...",
        "points": "2 points",
        "children": [
          {
            "comment": "I don't know what algorithm they're using, but they clearly got that shit figured out. I see them on top of basically every political and news sub.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It's been about a year. If y'all can't see why AI is going to disrupt everything by now, you never will",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "A ‘Shocking’ amount of the web has been trash long before modern AI came onto the scene.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s almost like AI is just a shitty idea. If only there were 100 years of novels movies shows and games that shared that exact notion…. Oh wait…..",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s already human trash, how is it possible to tell the difference?",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you rely on the web as an objective source of info without due diligence then you are shockingly stupid.",
        "points": "-5 points",
        "children": [
          {
            "comment": "What’s your source of info?",
            "points": "4 points",
            "children": [
              {
                "comment": "Common sense, understanding what due diligence means. Trust me, AI can’t come up with anything more stupid than regular folks, other than the stuff input from those said stupid folks. Finding a reliable source other than relying on some YouTube idiot. There actually was a time when the internet did not exist. What did people do? Gosh, can you imagine? Trial and error, what?",
                "points": "-3 points",
                "children": [
                  {
                    "comment": "Sure it can’t come up with anything more stupid, but the VOLUME is of concern here, not necessarily the content.\n\nIt just means the internet is going to be harder to parse through, and media literacy (and literacy in general) is already so low.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Shocking, what will people do? Some will adapt, some won’t, but nothing is going to stop it. Two sides of the same coin, one side thinks restricting information will lead to societies downfall, the other thinks too much unrestricted info will dilute the truth and lead to societies downfall. It’s neither, if the dumbasses are in charge we all fall. Everyone wants to blame the tool. Not the tools that can’t use them.",
                        "points": "-1 points",
                        "children": [
                          {
                            "comment": "What?",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Just flip the switch on and off a couple times and reboot the entire global shitnet",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "A mind this news, why? I think I give the human race far too much credit for anything to do with intelligence, I think.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I get more annoyed at AI clogging up the image search honestly. Trying to find a non ai stock photo is suddenly way harder and a lot of it looks pretty bad/fake too.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI written articles are (at least for now) pretty obvious because they’re mind numbing to read.\n\nI wish I could delete all of the websites that offer to answer a question only to state in 7 different ways throughout 6 paragraphs the same drivel without actually answering the question.\n\nI get it’s probably an engagement metric thing but the one time I fell for it it felt like mental water boarding.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Entirely googles fault. What we consider “the web” is google search results.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The future fucking sucks robot dicks and I hate it",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s a race to the bottom. I for one have stopped googling most stuff outside of Reddit posts, which is already stupid for me to do. Once that goes, eh… encyclopedias?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It doesn’t help that search engines promote AI trash over websites that have been around longer.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Google is barely even useful to me anymore. You have to sift through a whole page of bs just to get to anything remotely close to your search, and once you do just skip the first 4 paragraphs of that cause it will just be saying obvious shit you already know before getting to the damn point.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What did they think was gonna happen. lol.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Google search blows, Twitter is dead, reddit is a shadow of what it once was, Instagram is Instagram, Facebook has always been shit, Amazon sells everything, ebay resales your unwanted Amazon buys, YouTube is more Ads than content, streaming sites is essentially cable TV in all the worst ways, most newsites are shit, more than half the internet feels like bots and AI... Man, the Internet has become a really sad place.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1992xfg",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.bbc.com/worklife/article/20240111-it-hasnt-delivered-the-spectacular-failure-of-self-checkout-technology",
    "title": "'It hasn't delivered': The spectacular failure of self-checkout technology",
    "points": null,
    "comments": [
      {
        "comment": "They work. But not for all situations.\n\nBuying 5 items? Good.\n\nBuying 100 items? Bad.\n\n\nOver here in the states, we have an odd problem. They will install 20 kiosks, but only have 10 open. And there's a huge line waiting to self check out.\n\nI'm guessing at stores in Britain also you will see maybe 20 built lanes, but only 3 open, and the lines are 10 minutes long.\n\nYes, I get it, this is a captivated audience and understanding the rate of processing to customer loss maximizes profit. 10 lanes working 100% is more profitable than more lanes working anything less than 100%. But these are automated kiosks!",
        "points": "55 points",
        "children": [
          {
            "comment": "In Tesco in Britain, they have scan guns you carry with you in the store. You scan as you shop and pack your groceries as you go. When you get to the check out, you scan with you gun and it’s all transferred. You pay and you’re done. It’s the only way I shop now.",
            "points": "33 points",
            "children": [
              {
                "comment": "That exists in the US, but only in areas with high average incomes.",
                "points": "7 points",
                "children": [
                  {
                    "comment": "I hit up a Walmart with the worst theft in the state and I scan as I go and pay at the self checkout with my phone. It takes a phone and a bank account.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "This just is patently untrue I live in a quote unquote lower class area and for sure we have Scan and go in numerous grocery stores. Plus every Sam's club out there has it. In fact Sam's club actually has a majority of theirs either chef check out or scan and go. And the crowd there is definitely not wealthier than average.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "That’s a great idea, but I feel like people in the states would just steal the scanner or forget they have it",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Sam's Club here does that but you use a phone app to scan. When you leave, they scan a QR code on your phone then scan 3 random items. No waiting in lines. Super nice.",
                "points": "",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Auto-scans in Tesco (UK and Ireland) are really only known for one thing: UNEXPECTED ITEM IN BAGGING AREA!\n\nAs soon as the thing wails this infamous phrase, it's gone to buggery.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I do wonder how much it skews their initial metrics on how much they ‘planned’ to save.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "More to this, i am fine with even scaning by myself 100 but there are 2 problems:\n\nweight system- sometimes for example a 6 pack has the plastic wrapper and because of that weight the system thinks you ppaced something else. The same happens when you scan any packs of things and sometimes even to casual things usually from the freezer because it has ice build up so a different weight which means you need an operator and sometimes no one is available so you wait a lot looking for someone.\n\nentering bar codes/per piece. There are a lot of groceries tgat sell per piece not based on weight like mango. They might also have some 'worm food' made on location and the same and if you buy multiple things it takes time and if you are a little older or not savy enough this is a pain.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I think it depends, I haven’t read this article, but the method of scanning your own shopping as you shop and then also having a self-checkout is quicker in both scenarios and my preferred way to shop.",
            "points": "1 point",
            "children": [
              {
                "comment": "I tried it. Seemed great, until I was halfway through shopping with a decently full cart of groceries, and then the scanner didn’t like one barcode I scanned. It gave me a system error and stated that I was to report back to the scanner home base. I proceeded to the front of the store, where the scanner tech attempted to reset the device. This worked, but he said you’ll have to restart and scan everything again now. I lost all excitement to utilize this tech and felt like a beta tester for an unpolished product. Maybe I’ll try again in a year or so, shopping is stressful enough as is.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Are you considered an employee, or an independent contractor?",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Regarding my personal grocery shopping? I suppose that would fall under self-employed heh",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "My store (Sainsburys UK) has an app that allows you to use your phone to scan items. It certainly had a few faults when it launched but it’s been faultless for me for a long time now.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Most stores in Sweden have these but I find that most people including myself only use these when you have very few items. Some stores put a 10 item limit as well.",
        "points": "25 points",
        "children": [
          {
            "comment": "Really? Where I live there's more people using them than not. But maybe you're talking about the type where you bag stuff at the checkout? If so yeah, they suck.\n\nBut the ones where you have a handheld scanner works perfectly no matter how much stuff you have, and more people use it in my city than not judging by the split of people whenever I'm there.",
            "points": "3 points",
            "children": [
              {
                "comment": "At the Walmart I go to the self checkout is always packed and there’s 1 non self checkout lane which is also packed",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Most people where I live just treat it like a normal checkout and go to based on queue length in other lines.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Actually, I love self checking. Much quicker don’t have to talk nonsense to anybody.",
        "points": "46 points",
        "children": [
          {
            "comment": "Same here. I’ve honestly never understood the self-checkout outrage. I’ve used them for years, way before Covid was a thing. I just want to get in and get out of the store. I’ve got places to be man.\n\nI only use a regular checkout line if I’m doing like our bi-monthly grocery trip and I’m getting a crap ton of stuff.\n\nHonestly, the biggest issue with self checkout is the design. I was a cashier in college and could bag items raps fast. Self-checkouts don’t have space to put stuff after they’re bagged, because they have to be weighed. If there was more space, or if you could put bagged items in your cart, a lot could be solved.",
            "points": "12 points",
            "children": [
              {
                "comment": "The people who don’t like self checkout are the same ones that don’t like work from home, they just want to engage in meaningless small talk with people who don’t want to",
                "points": "4 points",
                "children": [
                  {
                    "comment": "I love work from home, don't like self checkout. It's often glitchy at the stores I go to and doesn't seem to save me more than a minute when it isn't glitchy.",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "You can also easily check that the prices and offers are correct. Too many times I’ve had to go back after checking the receipt because something was wrong after going to a cashier. Self checkout I never have any issues.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Where has it failed? Works perfectly fine where I live.",
        "points": "20 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I do my weekly shopping at Aldi (Chicago) and it’s great. Never a problem with scanning, goes right in the bag, done and done. And, I’m old(er).",
        "points": "6 points",
        "children": [
          {
            "comment": "Bizarrely they are now only being tested and rolled out in Aldi Nord (owners of Trader Joe's) in Europe recently.\n\nEdit: Aldi in the US is actually Aldi Süd so hence why the roll-out is different.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Oh dear they’re unhappy with their customer’s job performance",
        "points": "12 points",
        "children": [
          {
            "comment": "I’m afraid we are going to have to let you go…\n\nBut I don’t even really work here!\n\nThat’s what makes this so difficult…",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I like self checkout, prefer it even",
        "points": "12 points",
        "children": [
          {
            "comment": "Self checkout is an improvement over assisted, but better than either is scheduled pick up or delivery.\n\nEvery girl I have ever dated enjoyed walking the aisles, seeing what was new, buying things that piqued their interest. . .And I absolutely love them for it. I can't count the things I have tried and loved and never found again that on my own I would never have encountered. . .But I have absolutely zero interest in shopping or even being in a shop. When I need something I write up my list, load up my grocer's website, buy it and schedule either a pick or delivery and its done. Gig economy exists to bridge the gap for places that don't have an in house service. Nominal fee and a tip but it saves me time which I can't buy.\n\nSo yeah, I like self checkout too but in a lot of ways the model is already obsolete.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Here (in Canada) self-checkout is very much a mixed bag, works well in some stores and is a delight to use... and in just as many others is disastrously painful, leading to lots of exclamations of \"F#$% this\" and people going back to a staffed checkout line.",
        "points": "3 points",
        "children": [
          {
            "comment": "Don’t you mean “F%$% this, eh”?\n\n/s",
            "points": "2 points",
            "children": [
              {
                "comment": "Beauty! …sorry…",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Interesting considering just one kiosk costs over 120k, that’s right, just one. Supermarket chains expect to make up the cost in 5 years. Not likely, I assure you. Whoever was selling these machines, they made out like bandits.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I love self checkout, I hate talking to the cashiers, plus I’m faster than they are. I worked nine years 2009-2018 as a cashier at a grocery store. I used to get asked all the time, about when are we going to get self checkout.",
        "points": "9 points",
        "children": [
          {
            "comment": "I don't miss waiting 10 minutes to begin checking out",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It completely depends on the store. The machines and technology for self checkout can range from crappy and slow to responsive and snappy. If done right, self-check is way faster and more convenient.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Self-checkout really improved the situation at my local safeway. It's a smaller older one, but really near my home and its super convenient, but before they installed a cluster of self-checkout there was always a huge line for 1-2 cashiers. 99% of the ppl in this store use it to get like 3-4 items for dinner or something, and it's just way faster. Four self-checkouts improved the experience 1000x imo... But yeah, echoing others, it kinda sucks for big trips.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I love it and it’s fucking easy",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I once had to wait 20 minutes for the “manager” to give me my money when the self checkout didn’t give me my change. Then he refused because he didn’t like my attitude. 5 minutes later he apparently liked the attitude of the cop I called and gave me my money. Corporate liked the police report even more. I sold the large gift card they sent me and have never been back.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I mean what did they expect? Not only are there dishonest people in this world that take advantage of it but there are people that have no business once so ever even attempting to operate those things. It's been a cluster any which way you look at it.",
        "points": "1 point",
        "children": [
          {
            "comment": "Dishonest? I’m sorry but if I’m working here I’m taking an employee discount.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I like self checkout.",
        "points": "2 points",
        "children": [
          {
            "comment": "60% of people do apparently, according to a poll cited in the article",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Just let me scan my own fucking ID to buy alcohol. Keep someone around in case someone looks too young. I’ve waited 4-5 minutes for someone. All the while holding someone else from checking out.",
        "points": "1 point",
        "children": [
          {
            "comment": "So much this",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Do you remember before we had these, I do, it sucked. Now I’m just upset about the idiot that acts like they have never seen one or just doesn’t care how slow they are, that and the fact the companies refuse to pay their employees a fair wage and thus can’t find good employees to work as cashiers, so to save money they just don’t staff them anymore. Look at pay for a cashier between Walmart vs grocery stores. The tech is really good, the greed in companies is the issue.",
        "points": "1 point",
        "children": [
          {
            "comment": "I’ve been hassled to use self checkout with only a handful of items while standing in a long line. I responded “I don’t work here” and went about idly eyeballing the candy rack waiting in line.",
            "points": "0 points",
            "children": [
              {
                "comment": "If you don’t value the time just waiting, you do you.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "If I had to estimate how much time I spend in line for an entire week … I would be surprised if it surpassed 30 minutes. Let’s say a whole hour … in a week. What is the value loss there?",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "An hour a week, oh my god you're really spending 2 entire days of your life per year waiting in checkout lines? I guess if you've got nothing going on in your life there's no value loss, but I've got other things to do.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This is propaganda. Only corporations and old people don’t like self-checkout",
        "points": "1 point",
        "children": [
          {
            "comment": "As the article says, the main issue is theft",
            "points": "7 points",
            "children": [
              {
                "comment": "Pay the employee monitoring the self checkout are more and maybe they’ll care. Other than that, who has self checkout failed? Propaganda.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "No they won't, they will never care how much the billion dollars a year profit corporation is losing. Only way to make them care is to pay them on performance. Theft goes up, wages go down. Which is of course illegal.\n\nI'm with them, I don't care how much these corporations are losing in theft and I love self serve.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Their performance would be reflected by a drop in theft. If you pay people enough, they will do their jobs.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Trust me, plenty of people of all ages hate using those things. I’m a millennial, and fine with using them if I have only a few items, but a loaded basket? Hell no, I’m using a regular check lane. At the grocery store I work at, there’s plenty of other young customers that come through that agree with me (especially the mothers with a restless kid).\n\nHowever, I’m sure the “failure” to these companies is the high rate people steal things when using these. (Also see that a lot.)",
            "points": "2 points",
            "children": [
              {
                "comment": "I’m not saying that self checkout is for every situation, but it seems hyperbolic to call it a “spectacular failure.” I understand that theft is the main issue, that’s why corporations would prefer to view self checkout as a failure. Well, boohoo for those big companies that pinch every cent out their underpaid employees and then get mad if they’re not monitoring theft very well.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I’m a Millennial who has worked in a retail store, many days at self-checkout, and uses them now as a customer. They’re fine for a few items. I cannot use them when I have a full cart at the grocery store and my toddler is losing her mind. It’s ridiculous to expect people to use them when they have 100 items and nowhere to put anything but the floor. Nothing I want more than to put the food I spent half a weeks pay on, on the dirty floor.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Self checkout ain't going anywhere, anytime soon",
        "points": "0 points",
        "children": [
          {
            "comment": "There are actually quite a few stores around here that have converted back. Only one walmart in the area has them anymore and it's the one in the ritzy side of town.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Doesn’t save me any money in checkout even though the grocery store is (theoretically) employing fewer people",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "lots of people don't have any skills, maybe not that bright, can only work part time due to family, or need a 2nd job. Checkout and bagger is a nice job for a lot of people.\n\nI avoid the self-checkout. I want people to have jobs and pride in themselves.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Of course it hasn’t delivered. It’s a little kiosk, not a self driving car. Smh",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I hate self checkout. I’ll find the one human checkout lane and wait in line if I have to.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Such a failure I see it has expanded everywhere. What is this shit?",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Self checkout technology checks itself out.",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The problem is not the self checkout but people who don’t know how to use them. If I was a dictator leading my country I would demand retina scans for all customers using them. Customers would then be timed using them. Anyone who is too slow gets banned from using them and has to queue up for a cashier with all the other plebs",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Used it yesterday. One of the 3 self check outs open out of 11 that were there",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And guess who’s gonna pay for their oversight, definitely not the boards of directors, investors, or the companies themselves.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What ever happened to RFID technology that would allow us to walk through a scanner, add up all our groceries, charge it to our credit card and the give us a receipt as we walk on by?\n\nI remember those adds from about 15 to 20 years ago.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Self checkout has saved me from standing in a line of 10 idk how many times",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I like them when they work without issues, but they often don’t. And then I have to talk with someone,while my whole motivation to use it was to avoid talking to someone.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In what world is self-checkout a failure? That is just an absolutely insane statement. Self-checkout is ages faster than the alternative. Even a line of 5-10 people will get through self-checkout faster than a single person at the manned lanes. It's been around for 15+ years now and couldn't be going better.",
        "points": "0 points",
        "children": [
          {
            "comment": "I have seen people steal like crazy at the self checkout.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "With Giant grocery stores in my area, it’s the perfect set up. You connect to the wifi, open the app. Scan your item. Put em in the bag. Rinse and repeat til done shopping. Click checkout on app. Scan barcode. Pay. Leave.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The simple act of purchasing groceries became so complex with all the coupons, sales, cards and other points based scams retailers invent. Then people just can't use self checkout.\n\nBtw, for those who don't know. If you don't buy on some sort of sale you are paying over the top. When you buy item on sale usually discounted 10-20% or more you get normal price as it should be all the time.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In other news, smash and grabs and organized looting rings are on the rise.\n\nSelf-checkout or not, retail theft is a problem that will eventually close down retail in many areas.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s fantastic at CVS. At the grocery store it often sucks.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Who would have thought that giving the general public access to the cash register would result in rampant theft?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Maybe if I got a discount for using self checkout at the grocery I would be more likely to use it. It’s faster to just go by the regular checkout with a trained human. And I can bag my stuff while they scan.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I've used them at various different places across the US and the UK, and the only ones that really work are the ones that don't check item weight. I'll generally avoid them if I know they are the weighing kind if I'm buying more than just 2 or 3 items. Just too much faffing about as it inevitably gets the weighing wrong and you have to call someone over etc.\n\nWhole foods in the US and Waitrose in the UK don't weigh.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I reject the premise. I rarely use a manned register. Self checkout is always faster where I live and there is never a line.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_198v2zt",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.engadget.com/google-now-admits-it-could-collect-data-in-chromes-incognito-mode-103807146.html",
    "title": "Google now admits it could collect data in Chrome's Incognito mode | The company updated its disclaimer after settling a lawsuit accusing it of tracking Incognito users.",
    "points": null,
    "comments": [
      {
        "comment": "I have always just assumed that any private mode in the browser was only preventing data from being saved in your devices history.",
        "points": "68 points",
        "children": [
          {
            "comment": "It is, so fine for porn etc but if you’re up to something really nasty the authorities are gonna get it from your isp, but that’s not something us law abiding Redditors need to worry about",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You are smarter than most people on these comment as well as the author of this misleading article.",
            "points": "22 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "My mom amazed me when I was 16 when she had my entire search history after a short convo with her librarian friend",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yep. Literally the only purpose is to make sure your parents can’t tell what porn you’re looking at.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "What would possible make you think that? Other than the disclaimer that explicitly lays that out for you every time you use incognito mode?",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "And Troll Trace is one step closer to a reality...",
        "points": "17 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Incognito is only to hide your porn from your girlfriend ffs.",
        "points": "38 points",
        "children": [
          {
            "comment": "I seem to remember we were always told this? Maybe that’s only Firefox that has a note reminding you that you’re only hiding activities from your own machine lol.",
            "points": "18 points",
            "children": [
              {
                "comment": "I do remember using a website that sold flights, if I turned on incognito mode, the flights got cheaper for some reason, so it did affect the tracking in some way, but you’d have to be pretty naive to think you had erased your tracks completely",
                "points": "13 points",
                "children": [
                  {
                    "comment": "It's more about not logging the web traffic and saving cookies on the client side. Nothing about this keeps your ISP from seeing your furry porn.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It does a lot more than that, especially in managed mode. Can't install extensions in incognito which is a nice stopgap for some malware. Good for dev testing too so the browser stays clean as well. Thinking it makes you anonymous though is just silly misinformation.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This, if you thought incognito prevented websites and plugins etc from tracking you then you are stupid or ignorant of what it is plain and simple.\n\n“The plaintiffs told the court that the company used tools like its Analytics product, apps and browser plug-ins to monitor users. They also argued that by tracking users on Incognito, Google was giving people the false belief that they could control the information they're willing to share. A Google spokesperson explained at the time that the mode could only hide a user's activity on the device they're using but that their information could still be collected.”",
            "points": "8 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "If just using incognito and nothing else then the only way to see what you browsed is via ISP correct? In my country that would take a shit ton of a legal effort, so it’s not too bad a solution, unless you’re doing something really nefarious I guess",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "To be fair - diagnostics and app usage are often cited as the purpose of stuff like this. Part of the problem is it's too easy to de-anonymize you with such data. And companies, like Google, have gotten too greedy with wanting to know too much of what you do \"in an effort to provide you with a better experience\".\n\nThink: Facebook and social security numbers.\n\nThey didn't need it. They simply asked just cuz.\n\nAdditionally the nature of the Internet inherently means it's not 100% private.\n\nLike I said in another comment: Companies should be required to regularly report to users all the data they've collected so far and users should be able to block companies, without consequences, from collecting that information.\n\nAnalytics, for example, should be opt-in and very optional.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Ever since “the patriot act” passed, I’ve always assumed everything was being collected, even key strokes.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you still use chrome, you get what you deserve.",
        "points": "29 points",
        "children": [
          {
            "comment": "It is the majority browser on every continent lol",
            "points": "13 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Pretty bad take when most people not on reddit (which is most people), have no idea.\n\nedit: I get the sentiment though.",
            "points": "1 point",
            "children": [
              {
                "comment": "You get what you deserve too.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Okay joker",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Okay Batman.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Yeah, okay. Fair and reasonable treatment sounds good to me.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "But my plugins and passwords 😩",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I switched to Edge 6 months back but now the new company I’m at is hard-pushing Chrome. What do I do here 😭",
            "points": "-1 points",
            "children": [
              {
                "comment": "Resign",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "There are non-google affiliated browsers that use chromium, my wording on that may be off though.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Edge is literally chromium, it’s still chrome with a different skin.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Step 1: get caught\n\nStep 2: change ToS\n\nStep 3: continue",
        "points": "10 points",
        "children": [
          {
            "comment": "God forbid they actually stop the tracking to further increase user control, instead of changing nothing.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Get caught doing what? Incognito NEVER said you couldn’t be tracked by Google.",
            "points": "4 points",
            "children": [
              {
                "comment": "It’s explanatory text (“notice”) gave overly reassuring messaging that had the effect at scale of confusing users. That is enough. They weren’t precise or direct in an area that legally requires both.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "They could simply the language and settings anytime",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Imagine the length of a privacy policy if they were required to say all the things they wouldn't do",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "You missed step 1.5: Pay $5 billion",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Lol remember “Don’t be Evil”",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Using Google chrome is a form of self hate",
        "points": "17 points",
        "children": [
          {
            "comment": "Excellent!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "i’m too far gone at this point. the amount of passwords alone i have saved on my computer which are then saved on my phone, laptop, and ipad are too much to transfer to another browser…",
            "points": "-1 points",
            "children": [
              {
                "comment": "Firefox let's you import everything, including user/pass information at start up. You create a Mozilla account, use it on all your platforms, and it shares everything. Is it harder than doing nothing? Sure, but it's like a 5 minute process to set it up everywhere. Once you sign in to the other devices it syncs everything for you.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "so i can import all the passwords on my google account? never knew that thanks!",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "So now your login credentials exist not only on google but now Firefox! Great, so doubling the chance of that getting out. Doesn't sound great.",
                        "points": "-2 points",
                        "children": [
                          {
                            "comment": "im a chrome user do i really look like the person who cares about my privacy lol",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "Ha, that was funny. Made me chuckle :P",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "You and the top comment have similar sentiments…. What am I out of the loop of about chrome?",
            "points": "0 points",
            "children": [
              {
                "comment": "Eh. Unless you're looking for bad shit, it's easy to miss. I switched from Chrome to Firefox a few years ago and never looked back.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Any company can collect data from incognito mode and from any browser. Sad, but true.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Told some colleagues I use Safari instead of Chrome and they looked at me like I had 3 heads.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm always amazed at people who don't seem to understand all the various \"private\" browsing modes in any browser only protect you from your spouse finding out you are kinky and/or disgusting. No browsers privacy mode ever protects you from your ISP or Browser knowing exactly what sites you are visiting.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "TBH, I think the case was wrongly decided. Google never claimed to prevent websites or services from tracking the user, they claimed that their activity would not be recorded on the device where other users could see it. This was front and centre whenever you opened up a new tab. There was no evidence suggesting that this was intended to mislead.\n\nRegardless, the court decided that Google was required to predict what features a non tech-savvy user might expect based on groundless speculation on the name, and disclose the absence of any such features. Saying what the feature does was insufficient, they also needed to say what it didn't do, despite nothing in their materials suggesting such capabilities. And that's a pretty unreasonable standard of disclosure IMO.\n\n(And I say this as a daily Firefox user. Definitely no Chrome fanboy here.)",
        "points": "2 points",
        "children": [
          {
            "comment": "I think the case was wrongly decided.\n\nsame.\n\npeople expect everything you don't tell them and its ruining things. Incognito was the tab to make embarrassing searches(or keep what gift you are looking for private), look at porn without needing to clear your search history, etc...",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "So browsers are stating what their incognito does, what does it matter if they state what it doesn’t do, that’s just helpful to everyone and no skin off their back so they may as well just add that?",
            "points": "0 points",
            "children": [
              {
                "comment": "For one thing, it confuses the messaging. When you define something with a bunch of explicit exclusions, that tends to imply that the absence of such an exclusion is meaningful.\n\nBut more importantly, \"this might be nice\" is generally not the standard at which you'd expect to liable for not doing something. The issue isn't that the new disclaimer is bad, it isn't. The issue is that it sets a precedent of businesses needing to predict what wrong assumptions people might make and preemptively correcting them. That's not a good precedent to set and will affect smaller enterprises with less revenue and employees just as much as it does the big fish with their enormous market reseach budgets.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Not surprising in the least. I mean giving the people the imagination that they're anonymous is a f****** joke",
        "points": "0 points",
        "children": [
          {
            "comment": "The great eye is always watching",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It is surprising IMO, considering those people imagined it themselves. More clarity to the warning is welcome, but Google isn't liable for people making shit up.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Google is a data company. Of course they’re collecting data.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I like Apple Maps and Apple’s Browser. Both safe.",
        "points": "-2 points",
        "children": [
          {
            "comment": "I will remember this comment when I’m driving into a river",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Found Tim Cook’s alt account",
            "points": "1 point",
            "children": [
              {
                "comment": "You will suffer me",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Obviously all GoogleJunk is 24/7 privacy invasion.",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“Could”",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"Settling a lawsuit.\"\n\nLawyers get paid. Users get boned. We need a revolution.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well that explains it. Nothings private. ☺️",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Jokes on them. Nobody wants to see my search history.",
        "points": "0 points",
        "children": [
          {
            "comment": "They do, actually. It goes into a large set of training data used for some sort of model, likely to predict user behaviour for more effective ad targeting.",
            "points": "1 point",
            "children": [
              {
                "comment": "When they expect me to zig, I’m gonna zag and fuck up the models then!",
                "points": "0 points",
                "children": [
                  {
                    "comment": "The better to predict the zigs and zags my dear",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "And if 30 years from now you lose your marbles and decide to run for office?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Is this the daily thread where we shit on each other for what browser we use? Ah, yes it is.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you have watched The Social Dilemma on Netflix, you will see the power of Google and its mind control capabilities. If you haven’t watched it, then do. It’s literally terrifying. Even Siri is always listening and that is why you may get ads you were never searching online for, you just happened to be having a conversation with someone about. I tried to turn off Siri but it’s just too darn convenient so I turned it back on.\n\nDuckDuckGo claims to hide history. I haven’t used it. Thoughts ?",
        "points": "0 points",
        "children": [
          {
            "comment": "The Duck is the Goat.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Request all of your data from Google, Apple, Meta etc. This will give you an idea of what they are collecting at an individual level. It may not show aggregation data but it will give some idea of their focus. You’ll likely find apple has very little to give you, at least that was my experience.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Not my porn history, oh no!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As long as they dont tell my wife anything..",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Stop using Google and chrome!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "then what the fuck is the point",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Seems like Google and Microsoft are racing to see who can be more evil these days. They don’t even try to hide it anymore. Eventually they’ll suffer a breach big enough to get some attention and some laws passed here in the states.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Did anyone ever actually doubt this?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You use Chrome? Then you deserve it",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wym settling the lawsuit? Where’s my class action!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And for how many years did they lie about that one, the creeps.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Google always admitted that. They never hid that fact.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Two weeks old news",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "People didn't already know this? Doesnt it say it on the incognito tab from the start?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Really!?? Anyone surprised? Hahahaha!!😂😂😂",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is why we need privacy laws passed.\n\nEvery type of data gather needs to be explicitly opt-in and optional without consequences.\n\nMeaning if, in my app, I want to know how many times people use a particular page/form/control - I need to let users know I want to collect this data.\n\nOpting out of anything should never reduce user experience unless the experience IS the data collection (e.g. AI stuffs).\n\nI should also, at any point in time and very easily, be able to delete my collected non-app-critical data.\n\nIn fact - let's require companies to quarterly contact you on every bit of data they've collected so far. If Ford wants to \"help\" be via copying my phone history - they need to regularly say \"we've collected 104 contacts to date from your vehicle\". If they are scared to say this boldly and out loud - then they know they are abusing it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_198v2yj",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.theguardian.com/business/2024/jan/17/big-tech-firms-ai-un-antonio-guterres-davos",
    "title": "Big tech firms recklessly pursuing profits from AI, says UN head: International community has no strategy to deal with risks",
    "points": null,
    "comments": [
      {
        "comment": "We’ll probably follow the time tested mantra of letting it blow up then retroactively applying legislation. 🤷‍♂️",
        "points": "24 points",
        "children": [
          {
            "comment": "That’s the problem with legislation.\n\nIt’s slow.",
            "points": "5 points",
            "children": [
              {
                "comment": "legislators have to figure out how to profit from the legislation, that takes time.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "The problem with legislation is if something becomes popular, like crypto currency. Even tho it represents a threat to our own public currency and a fraud opportunity, because regulating crypto and BANNING it would be unpopular, no legislation happens because there are no adults in the room, the legislatures are in on the speculation. No one has the will to be the responsible voice anymore, the legislators simply enable the childish instincts of the masses.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "And tech advances accelerate in a bell curve. Legislation can’t keep up.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "And the people who are writing the legislation think that the typewriter is advanced tech.\n\nWe need people who make laws that actually understand the world they live in.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "...and we have become exceedingly efficient at it",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You forgot government bailouts",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "international community has no strategy to deal with risks\n\nThat’s a good summation of global megacorporations for the last fifty years.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Maybe countries can actually fine the companies at the same scale as their profits. Then give the fines back to the victims. We all know companies make tens to thousands times whatever fines they might get, so they just keep acting unethically. Hold them accountable!",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And this is surprising for what reason? Corporations will always use every tool at their disposal to make a larger profit. They don’t give a flying fuck about the ethics of it. Corporations would burn the world to ashes if they thought it would make them and their shareholders more money.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Our society’s laws are still 30 years behind technology, and this is going to make it exponentially worse. Most our politicians are technologically illiterate ffs. I guess once AI starts writing legislation we’ll be fine. 😉",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All these firms pursuing AI should be looking to replace their CEOs first with AI. The shareholder value by not having to pay huge compensation and stock options makes this a no brainer.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_198s5vk",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.bloomberg.com/news/articles/2024-01-16/australia-considering-mandatory-restrictions-on-high-risk-ai-use",
    "title": "Australia Considering Mandatory Restrictions on High-Risk AI Use",
    "points": null,
    "comments": [
      {
        "comment": "Curious to see how they'll navigate the challenges of regulating high-risk AI.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1995r8p",
    "subreddit": "u/reticareusa",
    "dataType": "link",
    "dataUrl": "https://reticare.com/us/?utm_source=reddit&utm_medium=socialmedia&utm_campaign=US_BestEverLaptop_Desktop_IOS_ES_Lapotop&utm_term=cpc&utm_content=EN",
    "title": "It has been proven. Light from screens can generate headaches, eye strain, eye pain, photophobia, dry eyes and death of Retina cells.",
    "points": null,
    "comments": []
  }
]