[
  {
    "id": "t3_19atmua",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19atmua/whats_the_best_ai_tool_to_use_to_make_testsflash/",
    "title": "What’s the best AI tool to use to make tests/flash cards for studying?",
    "points": null,
    "comments": [
      {
        "comment": "Time - ChatGPT will do what you want if you learn to use it.\n\nMoney - Quizlet will do what you want if you pay them.\n\nPick one.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "https://theresanaiforthat.com/s/flashcards/",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19as19h",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19as19h/solution_upload_document_and_generate_questions/",
    "title": "Solution: Upload Document and Generate Questions?",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19arm2r",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19arm2r/does_anyone_know_of_a_document_translator_with_ai/",
    "title": "Does anyone know of a document translator with AI?",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19apbem",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "https://harpers.org/archive/2022/01/routine-maintenance-embracing-habit-in-an-automated-world-meghan-ogieblyn/",
    "title": "Routine Maintenance, by Meghan O’Gieblyn",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19aoyfh",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19aoyfh/nvidia_lets_developers_test_drive_their_ml/",
    "title": "Nvidia lets developers test drive their ML platform for 90 days for free",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19anpad",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19anpad/best_course_bootcamp_to_learn_how_to_be_an/",
    "title": "Best course / bootcamp to learn how to be an artificial intelligence engineer",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19alyjg",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19alyjg/this_week_in_ai_all_the_major_ai_developments_in/",
    "title": "This week in AI - all the Major AI developments in a nutshell",
    "points": null,
    "comments": [
      {
        "comment": "YAY Lego",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19akzuv",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19akzuv/companies_use_ai_to_replace_workers_will/",
    "title": "Companies use AI to replace workers will ultimately lose,Stanford professor says",
    "points": null,
    "comments": [
      {
        "comment": "But there are jobs that machines are better at, so they will be replaced.",
        "points": "51 points",
        "children": [
          {
            "comment": "That's the neat part: the professor did not think about that! ...\n\nNah, doubt it, he just believe in the infinite new job creation after each new emerging technology, just too indoctrinated to realize there are more layed off people than new job positions...",
            "points": "20 points",
            "children": [
              {
                "comment": "Like humanoid robots from figure AIstarting to work at BMW? Sorry prof but why would we build humanoid style anthropomorphic androids? You think it MIGHT be to replace the human workforce? Lol",
                "points": "8 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Ill never understand their logic that this will spawn new jobs. Yes, new jobs that will be done by AI.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "some people are say 60% of the economy will be hollowed out by this new technology. some people mindlessly parrot truisms from prior innovations without a single light blinking on their mental switchboards.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "And the pool of jobs ai can do better than humans will continuously grow, while the pool of jobs humans can do as well or better than ai will continuously shrink.",
            "points": "7 points",
            "children": [
              {
                "comment": "Exactly. Maybe what he describes will be the situation for the next five or ten years, but there's no endpoint where AI is done and stops improving and humans are forever better at some things. And certainly not at a point where those things are enough of the things for most humans to be employed.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Only if machine > machine + human. But there is no use case I've ever seen where this is the case.\n\nAI augmented employees are vastly more powerful than AI left in the hands of people who don't understand the job (e.g. management.)",
            "points": "2 points",
            "children": [
              {
                "comment": "For now",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "AI is an extremely early, emerging technology. It's not hard to see that a machine that can have infinite knowledge, is never tired or emotional and never makes mistakes might be better than a human in many cases. A truly perfected AI machine would perform better without human involvement. But, even before that point, most of the human workforce would still be eliminated. There are human workers in an automated factor, but only a fraction of the number compared to when everything was done by hand.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It's a matter of time before machines are better at all jobs. That will be a glorious day. Human beings are meant for more than just working jobs their entire lives.",
            "points": "-1 points",
            "children": [
              {
                "comment": "Ah yes, glorious. Except almost all the world's economies still run on capitalism. Trying to change that will be a much slower process than the advancement of the AI.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "I don’t really understand this point of view. I don’t really believe that AI will be capable of taking all our jobs anytime soon but assuming it did someday, wouldn’t it be same to assume that AI can also manage economies in a way that people don’t live in abject poverty?",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "The problem is that the people running the economy, and the ones making the decisions, like their jobs very much and are unlikely to give that kind of power up without a fight, even if it made more for AI to do it.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "So in your mind almost none of the billions of people on earth have jobs except the handful of people standing in the way of an AI run utopia? Not only do the billions of people go along with this somehow but these evil fucks are hanging on to the last human performed jobs because “they like it”? I’m sorry I don’t mean to sound rude but I don’t buy that scenario for a second.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "What are these jobs? So far there's been a lot of jobs that AI is worse at, but the companies are ok with that cause it's cheaper. Stuff like customer support for instance. It is by no means \"better,\" it just costs them less, partly because AI just won't solve most types of unique problems people might have.\n\nI have yet to see an AI be better at a job than a human. There's lots of AIs better at specific elements of jobs, but thus far we still need humans to put it all together into an actual \"job.\" I remain hopeful that I will see it in my lifetime, but I don't think we're anywhere close yet.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Here's the thing, those machines cannot own themselves, and the value they are producing must flow to their owner.\n\nInitially this will give the rich an advantage, but people in general will quickly take advantage of the same thing and outcompete them. There's no way to monopolize owning robots.\n\nAs with cars, the poor and middle class will benefit the most economically from robot automation.\n\nThe rich always had horses with carriages, the invention of the car didn't significantly improve their lives. But the poor were walking barefoot for thousands of years. Now the rich and the poor drive in the same highways at the same speeds. Etc.\n\nIn the same way, owning robots to do automation isn't much different from having an employee, except it's expensive.\n\nIn the future, we will all own robots and be draw income from their labor.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Replace word Ai with Robots and think about Manufacturing especially Car factories",
        "points": "15 points",
        "children": [
          {
            "comment": "Except people know that machines are great at repetitive work with exact inputs and outputs.\n\nThere are execs who think that you can replace knowledge workers with ai. AI is a powerful knowledge base which imparts massive leverage to workers, not a thing to replace them.\n\nIt is closer to power tools used in wood working. If you’re a shitty carpenter, you’re able to do more shitty work more quickly, if you’re a good carpenter you will be godlike.",
            "points": "4 points",
            "children": [
              {
                "comment": "Yes but what percentage of “Knowledge workers” are good?",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Good question, from my experience it’s close to Pareto values. 20% delivering 80% of the value.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Yes. The bottom few percent generate negative value",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "whew glad we had a Stanford professor point out obvious shit…for this year\n\nLet’s check in on the big brain in about two years and see what he recommends",
        "points": "28 points",
        "children": [
          {
            "comment": "I disagree. You can't enhance the production of every human on the workforce and still need the same amount of workers.\n\nHumans should, and will be replaced as the tech is able to replace them. Companies who fail to adapt will die to ones with way less overhead.\n\nEdit: I want to add that this is currently happening and will continue to do so.\n\nThat's with the stateless models we currently have. Without taking into consideration any of the research papers since the beginning of the year.",
            "points": "3 points",
            "children": [
              {
                "comment": "Oh we definitely don’t need the same amount of workers. I think this guy is a dork out of touch with how things actually work. But for this year, yeah, companies need to be mindful about their productivity takedowns.\n\nUltimately, I just keep an eye on belwether companies like Amazon and what they do. Amazon is highly operational and highly technical: what they do, and other companies like them do, should be considered the forward indicator of what might cascade through the rest of industry.\n\nIf Amazon runs hard on layoffs this year for non essentials, deploys robotics, enhances supply chain with Ai…loosely speaking, that will be the template that CEOs and consultants follow",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "r/singularity would like to have a word",
            "points": "6 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [
                  {
                    "comment": "Bad bot",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": true
              },
              {
                "comment": "",
                "points": "",
                "children": [
                  {
                    "comment": "You just gotta feel the AGI bro",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "lol don’t look at it, don’t question it, just be confident that the AGI vibe means lifetime UBI starting in three weeks",
                        "points": "-3 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "The r/singularity community is a pseudo-religious technology cult that occasionally has real news about technology.",
                    "points": "-6 points",
                    "children": [
                      {
                        "comment": "Even when they do have real news, they wildly misinterpret it.",
                        "points": "-2 points",
                        "children": [
                          {
                            "comment": "lol they sure got time to show up in other subs and downvote\n\nHello clowns",
                            "points": "-4 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": true
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "If you're using ai deeply, training it and using it for tasks every day, you can see its limits quite clearly.\n\nThe present underlying technology limits the present means to achieve the effect.\n\nFor example, no matter how much better cassettes get, they were never going to have the audio fidelity of a cd.\n\nIn order for ai to progress further, there need to be new approaches to the underlying technology. These can come, but they aren't guaranteed, they dont arrive through iteration and steady improvement.\n\nFor example, the recent invention of cooling circuits https://www.scientificamerican.com/article/scientists-finally-invent-heat-controlling-circuitry-that-keeps-electronics-cool1/\n\nThis is a huge advance. We've been using fans and liquid up till now. There's no amount of improving fans or liquid cooling that gets us to heat controlling circuitry.\n\nAi is complex, and the advances seem to be reliant on modular elements being invented just as much as iterative improvement of existing elements. Everything that relies on novel inventions is not guaranteed.",
            "points": "0 points",
            "children": [
              {
                "comment": "Disagree. There is enough horsepower in gpt 4 to increase the efficiency of any knowledge worker role by 15 percent out of the gate. It’s just stored because it lacks agency and integration.\n\nAI progress could stop right now and you would still be able to realize billions on labor over the next 3-6 years.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "I'm not disputing the claim of what exists at present.\n\nI'm making a point about how technology will advance. There are limits baked in to the present means. The transcendence of these limits rests on inventions that haven't occured yet.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Understood, and thank you!\n\nI think the AGI or not, and progress discussion, is basically misdirecting all of us from focusing on what really matters…which is skill. And it’s plenty skilled. Ultimately right now the AGI and further scaling discussion speaks to problems that aren’t even the major ones right now.\n\nAnd these are the “known knowns,” specific to current closed and open models, not even touching on the potential emergent ones.\n\nI just hope we all can keep our eye on the ball.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Inventions now more likely to occur because of 15% productivity improvements.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "Nonetheless, predicting the future isn't possible. It's an unknown. Statistics are probabilities, not certainties. History is a record of surprises.",
                            "points": "-1 points",
                            "children": [
                              {
                                "comment": "And yet, they will continue to happen and become more and more likely to happen as they snowball on themselves.",
                                "points": "0 points",
                                "children": [
                                  {
                                    "comment": "I see that you can predict the future, unlike every other human being. How fantastic. You must make a lot of money with this unique ability.",
                                    "points": "-1 points",
                                    "children": [
                                      {
                                        "comment": "Saying \"We will invent more stuff\" is not some bold prediction lol.",
                                        "points": "0 points",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "People with jobs have money and use it to keep businesses viable by paying for products and services.\n\nIf in aggregate, AI displaces enough jobs, most companies will do worse.\n\nThere’s probably a good balance to be found but I’m skeptical AI won’t continue to be used to optimize costs rather than fuel growth.",
        "points": "4 points",
        "children": [
          {
            "comment": "Artificially paying people to produce zero value over their ai co-workers just so people have money to spend doesn't save the value of money. Money only has value so long as people are working to create value. If money can't be directly tied to human productivity, money cannot have value unless it is only held by people who produced value commensurate with the amount of money they have. The cost of extracting resources will drop as every method of obtaining and processing natural resources becomes fully automated. With solar or similar energy sources, the cost will drop to near zero. The monetary system cannot survive the end of human labor.",
            "points": "4 points",
            "children": [
              {
                "comment": "Yep. Mass automation will obsolete the current monetary system. Which is a good thing because these kinds of systems rarely change until they have become obsolete.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Completely agree. The idea that robots and AI will do the majority of work at super human speed and efficiency while most of humanity is left out in the cold isn’t realistic economically, socially or politically. The way we exchange capital for labour will be more or less pointless.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Exactly, AI is going to take and never give back. Its going to take years for companies to realise this. And in those years, corpos and CEOs have the luxury to hide in their bunkers made of gold while everyone else starves.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Oil companies are literally destroying that the planet they live on. These CEOs don't give a fuck about the long term.\n\nHow will these companies get money if nobody has money? They'll get money from the same place that oil company CEOs plan to live.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "So naive, sad that its a Stanford professor/teacher. Very spoiled and clueless views.",
        "points": "8 points",
        "children": [
          {
            "comment": "Their brains just cannot process the fact that human intelligence is being superseded and obsoleted. Nothing like this has ever happened. We've always been the smartest and most creative beings around. But all that is going away forever, and there's nothing any of us can do to stop it. It's the last arms race for the last tool / weapon humanity will ever create. The first person to own and even somewhat control an ASI wins everything forever. They'll have the future locked down before we even know.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "In what way would they lose what is the math, with high initial investment into automation less labor costs more productivity, would come in the society of the tomorrow. It would pay the money back, even with UBI. To the matter with people having UBI the money machine will still milk money to the people same way it was before and people putting that money to the machine, but people doing also something else with that freed time would it be philosophy or anything building bridges to other people all the things if things went greatly that would happen, heck with the free time people could voluntarily make a plan to pay a part of debt of the world if they wanted to.\n\nIf there is no replacement then prepare for all the work being so complex your brain will be fried everyday as your work will be competing the machines things that are made to be efficient would then require us suddenly evolving into being more efficient than the machine i do doubt the evolution works that fast.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Give the humans AI to support them. Problem solved, we all win.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is bullshit and obviously retarded. One of the fundamental flaws is that Humans exist within contextual scenarios and are able to adapt to be used within environments, that same nature is ultimately not at all impossible to recreate or even sublimate through mechanisms of structured regimens or formulaic designs of action and productivity. The very nature of these statements is more or less, to reassure people we will always have a place. Even that however is and always has been in jeopardy. The nature of AI is that it can replace all workers, the powerful nature of it means ultimately it should. That being said we must confront our fate and attempt to harness and utilize our own uselessness and become more cunning and creative within the nature of our own outdated modus of utility. Else we do risk not only being useless, but even becoming a hindrance and pain to ourselves.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's almost as if complementing workers with AI leads to fewer workers being needed, therefore replacing the now redundant extra workers.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Depends on the roles the company replaces.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What if most your employees are good only at what AI is good at?",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No\n\nCompanies that replace workers with AI will win, the same way the first companies to go online won over the dinosaurs that refused to adapt\n\nNOBODY WANTS TO FUCKING WORK\n\nWhat do these brain-dead morons not understand about that?\n\nWe want to enjoy our lives\n\nYou used to be able to work and earn a living. That simply isn’t possible anymore.\n\nWe work as wage slaves to avoid the punishing hand of the law and the oligarchy.\n\nThese fucking guys will die confused about that",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Oh they’ll complement them alright..",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They will lose if they do it right now because it’s too early but bet you this is not true, they will win in the long run as they can be faster, scale and wave a shit ton of money",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I really don’t believe AI is as disruptive as it’s being made out to be.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ask Tesla how their over-reliance on robotics/machines went. \n\n The desire to hold other humans accountable is an amazing case study in sociology. \n\n Think of the difference you feel in speaking to a phone menu vs a real person when you call for help. Humans want to work with other humans to problem solve (and most of the American labor force is now a “Service” related industry). \n\nSome of these jobs could go to AI, but you’ll see a snap back event shortly afterwards,  to human amplified AI roles.",
        "points": "-3 points",
        "children": [
          {
            "comment": "I think you underestimate how customer support calls go. The customer and employee can both bring their bad days into the call and make the experience awful. These AI are sounding sophisticated enough already, and the generalized models are responsive enough that they are already starting to reduce necessary workers. Also add in that these AI don't have to be a single department, they will slowly (or immediately if possible) be capable of preforming multiple roles instead of having to put them on hold over and over, another common issue with CS calls.",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I can improve my prompt to get better results from an ai. If I wait minutes or hours to talk to a human, and end up with an over-worked, under-paid human who barely understands English and has decided they don't get paid enough to give a fuck, that's it. I'm sunk. The best I can do is hang up, go back to the end of the line, and hope I win the csr lottery next time. It's a huge, frustrating waste of time. I absolutely cannot wait for all customer service to be fully automated.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "my concisebot gpt just said in response:\n\n\"Balance\"\n\nBest GPT I've ever made!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That prof was born with golden spoon.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Stanford professor tries to justify why he should still have job and not be replaced by ICT teachers because it's only industry that'll still need people for a while. READ ALL ABOUT IT!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Rather silly. Here is a perfect example.\n\nhttps://www.youtube.com/watch?v=avdpprICvNI\n\nClearly the human does not add anything. This is the most common job in the US.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why will they lose? They potentially will have a distinct advantage over companies that don't embrace it..\nSure, AI can't do everything and still requires workers.\nAI is already being used to boost companies workforce. This defeats point 1.\nThey problem with this key, is we are talking about overlap.\nSo only workers who do more mundane or repetitive tasks have to worry about their jobs. Is freelance art mundane or repetitive? Or law clerk? Both are potential AI replacements.\n\nI don't think I agree with this professor. He's talking about the utopian implementation of AI. Call center's for example would be easy to replace all tier 1 with AI. Especially if they are script driven.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Colleges and Businesses might want to think about the Idea It might not be the workers that are getting replaced.\n\nCollege or Ai? Evil Corporation or AI? Who makes this choice in the end it's the people. They can't get rid of us who will buy their goods. We can get rid of them them though. The Clocks ticking.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In the long term AI will replace jobs.\n\nIn the short term, a bunch of executives will be convinced that AI can replace jobs it cannot. They will gut workforces and the quality of their outputs will suffer and so will their companies, until such a time as those executives are given golden parachutes to exit those industries. At which point those executives will have learned nothing and continue wreaking havoc in their next place of employment.\n\nThe next 5 years will be wild.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Creating robots to perform labour is a sign of an evolved civilization. Because labour, while sometimes gratifying, comes with a lot of problems",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "ai and robots for now are just replacing all the retiring boomers",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "People really overestimate current AI tools just because LLM finally got to the point that they’re useful. AI has been around a long long time, almost as long as computers have been. AI started beating everyone at chess almost 30 years ago. LLM are great and a step in the right direction but don’t represent artificial consciousness at all. It’s like people saw ChatGPT and went, “wow this thing knows everything!” and now suddenly it can do every job. It can’t. Try doing some actual work on it. It makes errors in basic mathematics that children can do. It can’t code for shit. It doesn’t have hands to do any labour. It doesn’t know anything that it hasn’t scraped off the internet. It hasn’t created anything that isn’t derivative. When AI actually starts thinking of innovations, I’ll start to worry. For now it’s just a tool that replaced googling things for yourself and can mash pictures together. Those are the problems it can solve.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hold up! My manager can easily be replaced with an AI. 3B model even",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In the short term, people who are adept at using AI will replace those who aren't.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "https://www.youtube.com/watch?v=sU8RunvBRZ8",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If you have 100 employees, and you double their efficiency, you now only need 50 employees. Anything that increases efficiency will, in a sense, replace at least some workers. This isn't necessarily something we should avoid, but it is the reality.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19aknvz",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19aknvz/do_you_know_about_any_opensource_or_lab/",
    "title": "Do you know about any open-source or lab implementing in software the ideas from Jeff Hawkins's book, “A Thousand Brains: A New Theory of Intelligence”?",
    "points": null,
    "comments": [
      {
        "comment": "Closest thing I could find Modeling the Thousand Brains Theory of Intelligence – Towards AI\n\nand this from Jeff Hawkins Himself Neuroscience and AI's Future | Psychology Today",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Read this book, is very good, but for a longer summary take a look here: https://blog.assistos.net/book-review-jeff-hawkins-book-a-thousand-brains-a-new-theory-of-intelligence-be0e89d6fca7",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Numenta.com\n\nis his lab but don't know if any/all of it is open-source.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19ab8q8",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19ab8q8/is_the_concept_of_ai_multimedia_generation_really/",
    "title": "Is the concept of ai multimedia generation really that bad that it can be considered as a \"weapon\" instead of a tool?",
    "points": null,
    "comments": [
      {
        "comment": "Every piece of technology will be weaponized to fulfill the user's agenda.\n\nWeapons are tools and tools can become weapons.\n\nI mean knife crime is on the rise in the UK but it would be dumb to ban knives. Same with firearms. Same with the internet. Same with fast cars Same with airplanes etc etc etc.\n\nLaws can't stop development either. Maybe just deter it.\n\nIf all the 'good guys' stop developing AI. What's stopping a terminally ill person that's crazy from creating a Daemon program that initiated after their death. And that program is designed to kill?\n\nWe would hopefully have tech to counter such an invasion, and that's done quickest when the people are not censored and free to experiment.\n\nThis is how the USA jetted their Space program ahead of Nazi Germany's in the 40s and the Soviets in the 60s. (Also operation paperclip)",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Technology isn’t good or evil in and of itself, but it can be used for good or evil purposes (and that’s not even considering how one would attempt to define good and evil). But in any case, AI exists and it will be developed. There’s no stopping that. It’s therefore essential that we all educate ourselves in learning what AI can and can’t do so that we’re able to participate in an intelligent discussion of what AI should and shouldn’t do.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is a tough argument to try and have, but no it is not worth it to halt all the amazing discoveries we are making for these hypotheticals. It makes more sense to create new tools to mitigate the damage that can be done with them than to stop progress. Creating sites where public figures and entities can verify/disprove can help. Creating codewords with loved ones to avoid potential voice scams. Run all your loved ones through the potential negative uses of AI, and also just how to spot a scam in general. People needed to be educated on phone scams long before now anyways.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It depends entirely on how it's used.\n\nModern infrastructure in the U.S. was built with the intent of keeping black & brown communities poor and further white supremacy. That does not make all roads and infrastructure an evil net detrement to society.\n\nThere are millions of benign applications of synthetic media. This is why media literacy and critical thinking skills are and will continue to be essential life skills. Unfortunately, there are political elements that want to reduce the public's capacity for both because it suits their existing propaganda machines.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All new revolutionary tech displaces older crap. The people whining about this are simply whining that they are going to lose advantages and monetization options that THEY currently have. It's actually really annoying the amount of terrible-faith arguments I've heard, simply from whiny artists who have a personal bone to pick.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19a7rf9",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "https://www.chinadaily.com.cn/a/202401/19/WS65a9ccb9a3105f21a507d2b8.html",
    "title": "Potential for Sino-US cooperation on AI seen",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19abqn0",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "https://www.theverge.com/2024/1/18/24042354/mark-zuckerberg-meta-agi-reorg-interview",
    "title": "Meta's new goal is to build artificial general intelligence and will have more than 600,000 H100 equivalents of compute by the end of this year",
    "points": null,
    "comments": [
      {
        "comment": "Facebook ran out of potential new users so now they're going to make them lol",
        "points": "51 points",
        "children": [
          {
            "comment": "Well, AI is becomming multimodal, and they read the web. It wont be long before there will be content and advertising targeted towards AIs to manipulate their results. So yes, they will be users too",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "whos not on the agi train since google's transformers 2017 idk, what is this, ofc they need compute",
        "points": "3 points",
        "children": [
          {
            "comment": "I feel like this is the zuck saying, \"You perceive us as the guys doing the open source thing on the side, but we want you to see us a primary contender in this ai race. We matter here too! \" and that's probably what they are trying to actually be. It's painful to say this and it might not last, but you have to give credit where it's due even if it's to someone you don't like and the zuck deserves credit for offering so much to the open source space. I actually believe he wants the technology to be available to everyone to develop with openly. If he actually uses all those resources to provide weights to the public for llama 3 I'll consider not hating him any more or at least hating him less.",
            "points": "1 point",
            "children": [
              {
                "comment": "Ye well I dont feel much about celebs, ceos or companies anyways, their are minding their own business. On topic I dont think the AI race will matter much in the long run, we gonna be using this and that. Like if any standard user would care about which email, browser or payment systems they use. They just wanna get salary for replying their bosses emails and picking up the phone, just like they will need to have AI assistance in a polite way. FB(Messenger), Insta and Whatsup users are all like that, around ~3B, thats a lot.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "\"Like Google’s new Gemini model, another focus is on more advanced reasoning and planning abilities.\"\n\nSounds interesting enough.\n\n\"Perhaps, he suggests, these AIs will even be able to post their own content to the feeds of Facebook, Instagram, and Threads.\"\n\n.....\n\n\"Talking to Zuckerberg, it’s clear that, going forward, it’s increasingly going to be about humans talking to AIs, too. It’s obvious that he views this future as inevitable and exciting, whether the rest of us are ready for it or not.\"\n\n....and the sad head of a computer scientist who just wants a friend emerges. This is the real threat; artificial societies, where people who are owned and generated by large companies, interrupt and ruin our ability to use the internet to talk to other people (we simply won't know whether those people and their opinions are real any more).\n\nFrom this we'll be subject to a world of forced false perceptions, that won't be verifiably linked to any sense of genuine reality. A company wants you to think their product is valuable, popular, or worth having? They'll just set everyone you talk to to discuss it with you, until you either think you're mad, the world is mad, or you submit, and buy whatever they're selling.\n\nThis is a branch of the dystopian hell corporate AI risks becoming.",
        "points": "27 points",
        "children": [
          {
            "comment": "I think meta is discussing AI today similar to Verses Ai, since both are at Davos and had discussions/seminars with global leaders this week\n\nhttps://www.youtube.com/watch?v=SYQ8Siwy8Ic&t=783s",
            "points": "2 points",
            "children": [
              {
                "comment": "Hmmm, having just learned of this, it certainly seems likely. The article is probably promotional material aimed to coincide.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "That is how I take it since they name drop the meta data scientist the Verses Ai followers have discussed this week having discussions with Karl Friston from Verses",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "If AI starts comprising large portions of social media, this will hopefully drive the humans out of it.\n\nI wonder how many people are gonna start arguing endlessly with AI lol. And they'll get so frustrated that this person is so stupid.\n\nIf I'm on a social media platform to interact with people, and I feel that a high probability of the conversations I embark on are AI bots, then the social media platform is completely broke.\n\nImo, Zuckerberg is an idiot if he does this.\n\nThe actual humans on his platform ARE the product, and they're also his entire source of income.\n\nThis is perhaps the single stupidest thing you could do, imo. He should be doing the opposite and doing everything in his power to make sure there are no bots, and only people.",
            "points": "2 points",
            "children": [
              {
                "comment": "I agree completely. What's more, big tech companies have an odd propensity to sterilize and homogenize their platforms. Once upon a time youtube users could set customized background pictures and colours on their channels.\n\nThis made them feel distinctly human. The early internet was cluttered but felt compelling to use. Today's websites are practically barren in comparison. The human-ness risks further evaporation. What's more, this isn't the only medium to go through this process - before Newspapers, there were pamphleteers, before Radiostations, there were pirate stations and ham radio operators. This is part of the new media birth, life, and death cycle. People create a new media technology, and form a community around it, corporations see the popularity, and move in. They compete, trying to match each other's look and features \"but be more modern!\" - until, you get a flat white screen, with no humanity left in.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I wonder how many people are gonna start arguing endlessly with AI lol. And they'll get so frustrated that this person is so stupid.\n\nHow do we know this isn't what's happening right now?",
                "points": "1 point",
                "children": [
                  {
                    "comment": "It may have started. Probably has, but people are still the majority. But, it's for sure gonna happen at some point, that the fascists will send out their bots to argue with people and try to create the appearance of huge followings, and also just to try and persuade others to follow their figureheads, and ways of thinking of their fascist cult.\n\nSo far, I may have encountered some of late, but generally, I don't think so.\n\nIt's going to be a while before people figure it out. I know I could discuss with an AI for a while before I figure out it's a fake person.\n\nWhat's kind of ironic, is that the same way that's best to treat trolls is also the best way to identify AI.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "....and the sad head of a computer scientist who just wants a friend emerges.\n\nI suspect this also describes a large portion of the active userbase on forums like reddit",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I thought we'd all be strapped into VR 24/7 by now?",
            "points": "0 points",
            "children": [
              {
                "comment": "I'm not sure why you thought that.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I enjoyed your writing style btw",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "If you don't already have a feeling of solipsism on an anonymous faceless website like Reddit, I don't know what to tell you. This isn't a future problem this is a now problem. While it's unlikely I've argued with bots on here, sometimes I wonder, and we basically already have the technology for it to happen this year.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "What happened to the Metaverse?\n\nThis is an ambitious plan, and I applaud ambitious plans. And... it's impossible for something to fall into the wrong hands when it's in the wrong hands from its inception.\n\nI wonder if there's anything, anything at all that's not evil that they would use this for.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Does that mean no more VR headsets?",
        "points": "0 points",
        "children": [
          {
            "comment": "Sounds like definitely no. I think he's adjusting so that AI is not the priority over the VR stuff though which was definitely not the case previously . I think he sees good AI as a way to coax people into using his meta verse eventually. I think he's pulling back on vr/AR to see how well apple does with making it something less niche. He wants their headsets to be the android of vr headsets as it's inevitable that Apples headsets end up being a huge share of the market when this stuff becomes cheaper and more mainstream. Unfortunately just copying apple seems to often be a better strategy than developing your own ideas,so it sounds like he's sort of pausing that a bit and moving resources to focus on AI so that when they do end up copying apple they will have some ai stuff in the chamber that they can throw in and hopefully gain an edge. Basically they will have to spend time developing the stuff apples headset had that they don't no matter what, so it's best to wait to see exactly what that is and in the mean time just work on ai.",
            "points": "0 points",
            "children": [
              {
                "comment": "I think he's pulling back on vr/AR to see how well apple does with making it something less niche.\n\nso it's best to wait to see exactly what that is and in the mean time just work on ai.\n\nHe's not pulling back. He's increasing investment in VR/AR. He said as much in the article.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I love effing with AI. But if Zuck manages to have the best GIAI, (unlikely) I’ll forgo it and settle for whatever ends up being second best.",
        "points": "-5 points",
        "children": [
          {
            "comment": "It's being open sourced, so whatever zuck has the rest of us will have",
            "points": "3 points",
            "children": [
              {
                "comment": "Yes, but you won't have the metric truckloads of compute required to use it.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "But e.g. AGI can help design a vastly a better chip",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "What? The point is that the average user will not have access to the amount of computing resources necessary to run such a tool. If they are successful, it will require tens or hundreds of thousands of dollars of equipment to run.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Meta is a dead company with no identity. They will pivot until they fully run out of money",
        "points": "-7 points",
        "children": [
          {
            "comment": "At least they actually pivoted to something that actually can make money and useful.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Meta is responsible for maintaining pytorch. Aka the biggest AI library among researchers",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "With 3 billion active users they will have a lotttt of places to pivot",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I play Oculus VR games every day to lose weight (specifically \"Thrill of The Fight\"), and it's worked very well. I chose the system because no tether to a computer is required. It's a fun way to get healthy.\n\nI also use facebook messenger every day, and a lot of people use Instagram regularly. Seems like Meta has a fair few things going for it. From the article:\n\nMeta already has more users than almost any company on Earth and a wildly profitable social media business.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Zuckerberg has never had any actual ability to innovate and, and has no expertise with AI... he'll just latch on to whatever he thinks will rescue Facebook/Instagram from their inevitable death a la MySpace. He's not really building anything, he's just desperately pouring ad-revenue cash into server power in the hopes someone will use it to keep him relevant... everyone else is doing AI so he doesn't want to be left out. Yawn.",
        "points": "-8 points",
        "children": [
          {
            "comment": "FAIR has existed for a long time.",
            "points": "3 points",
            "children": [
              {
                "comment": "Facebook AI at its core was all about figuring out how to tag people in FB photos and generating custom feeds. They never really went anywhere with it. And now, he's late to the party, playing catch-up.",
                "points": "-9 points",
                "children": [
                  {
                    "comment": "They are a world class research organization that has contributed both in publishing and in open source. You have no idea what you are talking about and should stop.",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "They are a world class research organization\n\nYou specifically referred to FAIR, which doesn't exist anymore... but now refer to it in the present tense as a world-class organization?\n\nThere's a distinct difference between something that has simply had wads of cash thrown at it, and true innovation. Zuckerberg knows nothing about innovation. His AGI \"goal\" is nothing but a pipe dream.",
                        "points": "-5 points",
                        "children": [
                          {
                            "comment": "You realize that Facebook created React right? Which is world’s most popular modern front end framework/library.",
                            "points": "5 points",
                            "children": [
                              {
                                "comment": "And your point is what, exactly?\n\nReact is not even remotely AI, not even a marketable product, and brings in no revenue. It's a byproduct of Facebook web developers.\n\nAnd \"world's most popular\" is unsupportable hype, but that's the least of it.\n\nThe irrational desperation in here to pump up FB & Zuckerberg is palpable.",
                                "points": "-3 points",
                                "children": [
                                  {
                                    "comment": "No, people are just calling you out for being wrong and biased.\n\nNo one likes Facebook, but to deny they haven’t produced some good technology like React is just you being an insufferable twat.",
                                    "points": "5 points",
                                    "children": [
                                      {
                                        "comment": "React is not relevant to this discussion... in the process of FB web development, they made a web tool that's been shared as a free library. I won't deny that for a second, but it's a non sequitur to the larger discussion.\n\nPeople supposedly \"calling me out\" are reacting emotionally with irrelevant nonsense... claims that he's rich and famous, or can hire experts, or has achieved more than I have... or that FB maintains an open-source web tool library. All the weak sauce just proves my point.",
                                        "points": "-2 points",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Almost every line here is factual false.",
            "points": "4 points",
            "children": [
              {
                "comment": "Do tell then... what's his specific AI cred? \"I started Facebook\"? \"I can buy up talent\"? \"I can make big goals\"?\n\nTalk is cheap.",
                "points": "-2 points",
                "children": [
                  {
                    "comment": "That's about the only thing you've said that's accurate, not an ai expert, but he can hire experts.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "not an ai expert, but he can hire experts.\n\nYou don't just hire your way into something like that. 'Hiring experts' is not innovation, it's not even a plan. It's throwing money at the wall in hopes something will stick.\n\nNoticed you still couldn't refute whatever else you have an issue with.\n\nLots of defensive Zuckerberg fanboys here.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "That's because everything else you've said is wrong. Lol\n\nYou literally don't need to be an engineer to be a CEO. He leads a number of highly successful companies.\n\nAnd no I'm not a fanboy I think he's a horrible person.",
                            "points": "4 points",
                            "children": [
                              {
                                "comment": "That's because everything else you've said is wrong.\n\nYou can't refute it because it's wrong?! I see it's pointless trying to have a rational discussion with you.\n\nYou literally don't need to be an engineer to be a CEO\n\nStrawman, never said you did.\n\nI think he's a horrible person\n\nAnd yet you spend your time trying to defend him. Sure thing. You a bot?",
                                "points": "-1 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "They already have AI talent. And he’s well regarded, and already capable of getting and retaining talent…",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It's actually a long term business model that they've had. They basically suck up tech patents (812 patents and counting according to this article, which is from 12 years ago).\n\nSome of them they've been able to spin off into companies, most lay dormant.\n\nLikewise they've acquired at least 100 small tech companies for similar reasons.... here's a very long and extensive info graphic, charting them from 2005 - 2020.",
            "points": "2 points",
            "children": [
              {
                "comment": "Right... throwing cash at the wall, hoping something will stick.\n\nBuying up patents is not innovation. And they buy the startups to harvest the people within them, not to develop products.\n\nAll that may be a \"business model\", but Facebook is still just Facebook, even if he likes to pretentiously call it Meta now. He doesn't have either the genius or the corporate model it takes to take on his new \"goal\". He has some AI researchers on staff that he's bought, and he has Facebook cash to throw at server power. But no vision, no spark, no culture, no experience, no leadership.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "He is famous, rich, powerful and has created a huge business which most of the world interacts with.\n\nSo what have you achieved - or will ever achieve - in your life?",
            "points": "0 points",
            "children": [
              {
                "comment": "He is famous, rich, powerful...\n\nYou just proved my point... none of those are relevant to his \"goal\". You, like so many people, are blinded by image. He's no genius, no great leader, has no particular vision. He was in the right place at the right time with the right opportunity, and has benefited greatly from that.\n\nAnd what does this have to do with my achievements? Why would you think that is relevant to whether Zuckerberg is really up to his stated task?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "LifeLog is indeed a good societal monitoring / spy tool. Zuckerberg was in.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I didn't destabilize democracy worldwide",
                "points": "-2 points",
                "children": [
                  {
                    "comment": "Have you done anything?",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19a9lg4",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "https://www.side-line.com/response-nick-cave-on-chatgpt-used-by-stephen-fry-at-letters-live-event-watch-the-video-now/",
    "title": "Nick Cave on ChatGPT at Letters Live Event",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19a4sde",
    "subreddit": "r/artificial",
    "dataType": "link",
    "dataUrl": "/r/artificial/comments/19a4sde/anyone_know_of_an_ai_that_can_write_an_entire_25/",
    "title": "Anyone know of an ai that can write an entire 25 minute long sitcom pilot for me?",
    "points": null,
    "comments": [
      {
        "comment": "Sure. But he charges $5,500/ep and I hear his union is a bitch.",
        "points": "9 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why do this? Just out of curiosity,",
        "points": "2 points",
        "children": [
          {
            "comment": "I want to film it with my friends and don’t have time to come up with a script myself",
            "points": "-3 points",
            "children": [
              {
                "comment": "GPT-4 Turbo could do it, or Claude Pro. But it will suck. LLMs aren't funny.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "If you ask it to emulate comedic styles from specific tv shows or stan-ups it delivers some good results. 1-2 out of 10 jokes are usually good in my experience",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "If you don't care about the script just download one, no AI script is going to be funny, it doesn't understand jokes. It's just going to parrot other things labeled as comedy and shoehorn those things in to your script.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Here you go:\n\nScene 1 - act 1 :\n\nA GOLDFISH SWIMS IN A BOWL. A MAN IN A SUIT ENTERS THE ROOM AND TAKES A SEAT. THE MAN WATCHES THE FISH FOR 24 MINUTES AND 30 SECONDS, WHILE THE CAMERA CHANGES ANGLE TO INCREASINGLY TENSE MUSIC. THE CAMERA FOCUS ENDS IN CLOSEUP ON THE MANS FACE.\n\nMAN: “Well that was just not worth it. Stupid fish.”\n\nEND",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "GPT can do it just fine if you have it break down the plot into a summary first, and then have it expand section by section.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm writing a book chapter and use GPT but you have to give it the structure first and then ask it to write the first section but then keep a log of all the outputs and feed it back all of the information up collectively so that it gets smarter as it writes and you direct it to improve the sections before moving on to the next one",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Take something already written in the public domain and use something to modify it. Like professional writers do",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "novelai.net",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI will not be able to do creative speech until it has learned better ways to copy people. Even then it will be easy to detect.\n\nSteve",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think LLMs can be super forgetful with long context",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Go to Poe, there is a bot that will write an entire book for you, I'm sure you could use it for a sitcom instead. Tell it how many scenes you want etc.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "George Constanza we know this is you.",
        "points": "0 points",
        "children": [
          {
            "comment": "Well dang how’d you find out",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  }
]