[
  {
    "id": "t3_19au7x5",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "/r/Futurology/comments/19au7x5/automation_because_of_artificial_intelligence/",
    "title": "Automation because of Artificial intelligence",
    "points": null,
    "comments": [
      {
        "comment": "This question has kept me up nights lately, but after reading a lot about it it feels kind of unlikely.\n\nThe AI we have now is comparatively pretty stupid. It can handle basic queries fine, but struggles with anything complex. Frontier Airlines recently learned this to their detriment.\n\nIt will get better, but it seems like there's a scalability problem. For a large company fielding thousands of interactions a day via text/calls/emails with a variety of customers and other businesses, a lot of computational power is needed, and that's expensive. Sam Altman is already telling the WEF that further advances in AI are going to take a lot more energy, maybe in the order of another breakthrough like nuclear fission.\n\nWhile we're starting to see humanoid robots rolled out in some situations, it remains to be seen how effective they will be. Again, they'll get better, but it's going to be awhile before they're effective and affordable enough to be an everyday solution.\n\nAnd then there's the practical consideration of who will buy products/services if no one can afford them. Capitalism requires someone to do business with.\n\nWill there be disruptions? Almost certainly, but it'll probably be neither as dark or rosy as most predictions.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If the people in charge really gave a shit a large portion of the world could already be on UBI. This won't happen in the foreseeable future.",
        "points": "",
        "children": [
          {
            "comment": "Soon or later politicians should apply ubi otherwise people are going to be rebellious without job, even during COVID era in many countries something similar like ubi took place.",
            "points": "",
            "children": [
              {
                "comment": "Why would they be rebellious?\n\nWe already have large parts of the world in extreme poverty, or poverty compared to developed nations.\n\nMajority of India is in shambles, the Chinese are near slaves, the UAE and Saudi Arabia has thousands of actual slaves. There is no reason the same will not be done to the middle class of developed nations with a gradual slide.\n\nWe already have mass displacement occurring in Canada with mass immigration, and there is little unrest from it, as young people struggle to afford basics and our standard of living plummets.",
                "points": "",
                "children": [
                  {
                    "comment": "In west people will not accept that, in east people are used living like this.",
                    "points": "",
                    "children": [
                      {
                        "comment": "You forget we had a great depression here? My grandfather was one of 19 children, in a house of 800 sqft. Which was a kitchen, with a fire place, and couch to the side, and separate bedroom for the adults. The kids slept in the attic space.\n\nThere's no reason we won't adjust as we head backwards, and we will. Humans are positive creatures by nature and will adjust to accept living standards.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Soon or later politicians should apply ubi otherwise people are going to be rebellious without job, even during COVID era in many countries something similar like ubi took place.\n\nman have you not seen people fighting to be able to live decently in western countries and being severely repressed by the police ?\n\npoliticians and rich people wont let them have a piece of the cake, they would rather see everyone die than to share a small crumb.",
                "points": "",
                "children": [
                  {
                    "comment": "Rich people need the plebs to have their dick measuring contests.\n\nEven Donald Trump's White House was sending people checks during COVID.\n\nWhether that was so GOP donors could keep making money or out of genuine altruism, the result was the same.",
                    "points": "",
                    "children": [
                      {
                        "comment": "dont need all of them for that.\n\nalso they'd rather see the world burn to the ground and everyone die than to not be on top.",
                        "points": "",
                        "children": [
                          {
                            "comment": "Their bank account isn't going to keep them safe from hundreds of millions of unemployed, pissed off people with nothing to lose.\n\nBeing unable to leave your home so you can say \"neener neener I won capitalism\" seems like a bad tradeoff.",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "5 years?\n\nIMF Report: AGI destroys all jobs within 5 to 20 years! Frontier of Automation expands beyond humans",
        "points": "",
        "children": [
          {
            "comment": "Automation engineer here, actively involved in open-source LLM projects.\n\nIt's going to be closer to 20 years than 5. My own guesstimate is not before 2035.\n\nIt's impossible to say for sure, though, because LLM-based AI (like ChatGPT) is intrinsically incapable of exhibiting AGI. Developing AGI is contingent on more complete cognitive theories of intelligence, and nobody knows when cognitive scientists might trot out a sufficiently complete theory of general intelligence.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "30-50% of economically valuable tasks in the US is probably 3-5 years away. How many actual jobs translate to is unclear. But like 50 years till ubi is required is preposterous I think.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19atrcg",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "/r/Futurology/comments/19atrcg/i_want_to_hear_your_oceanic_futurism_takes/",
    "title": "I want to hear your oceanic futurism takes!",
    "points": null,
    "comments": [
      {
        "comment": "I want to see offshore oil wells converted into giant 3D printers that generates floating and submerged dwelling spaces out of oil converted into large diameter clear plastic tubing. It will continually grow in concentric circles both outwardly and underwater until it reaches a certain size, say, living, working and recreation space for 10,000 people, then detach to be relocated anywhere on the planet.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "One technology being applied to ships is aerofoils...\n\nhttps://thetius.com/brief-guide-to-sail-assisted-cargo-ships/\n\nSea floor mining has been speculated about for decades. Norway just took an initiative to push it closer to reality.\n\nhttps://www.wired.com/story/norway-deep-sea-mining-arctic-svalbard-batteries-environment/\n\nNetpens are already in use for salmon farming.\n\nhttps://salmonfacts.org/the-salmon-ocean-farming-industry/\n\n​\n\nThe Arctic Ocean is an emerging battlespace of interest for military strategists.\n\nhttps://www.cbsnews.com/news/russia-arctic-military-presence-ukraine-war-nears-two-year-mark/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "More ocean cooled offshore server farms is an interesting idea, but I do wonder what effect it would have on the local ecosystem and perhaps even larger currents if done on a large enough scale.\n\nMore ground effect vehicles would be cool. I loved seeing one in the latest Avatar movie.\n\nI'm also optimistic about there being more offshore wind farms, as they can generate a tremendous amount of power with a high degree of reliability/consistency for essentially free.\n\nI think a shorter range but higher precision sonar for real time terrain mapping and object detection is probably something thatd be cool to see. Imagine being able to see clearly in any underwater conditions with AR, and the benefits that would give to rescue divers and the like.\n\nCombine that tech with underwater server farms and I can't think of a cooler job. Imagine being a scuba certified sys admin. Lol. I know itd never work out that way, but it still sounds like a fun job concept to me.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19at85y",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://www.esa.int/Science_Exploration/Space_Science/Buried_water_ice_at_Mars_s_equator",
    "title": "Buried water ice at Mars's equator? - Its findings suggest layers of water ice stretching several kilometres below ground – the most water ever found in this part of the planet.",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/Gari_305:\n\nFrom the article\n\nOver 15 years ago, Mars Express studied the Medusae Fossae Formation (MFF), revealing massive deposits up to 2.5 km deep. From these early observations, it was unclear what the deposits were made of – but new research now has an answer.\n\n“We’ve explored the MFF again using newer data from Mars Express’s MARSIS radar, and found the deposits to be even thicker than we thought: up to 3.7 km thick,” says Thomas Watters of the Smithsonian Institution, USA, lead author of both the new research and the initial 2007 study. “Excitingly, the radar signals match what we’d expect to see from layered ice, and are similar to the signals we see from Mars’s polar caps, which we know to be very ice rich.”\n\nIf melted, the ice locked up in the MFF would cover the entire planet in a layer of water 1.5 to 2.7 m deep: the most water ever found in this part of Mars, and enough to fill Earth’s Red Sea.\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19at85y/buried_water_ice_at_marss_equator_its_findings/kin52k5/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "From the article\n\nOver 15 years ago, Mars Express studied the Medusae Fossae Formation (MFF), revealing massive deposits up to 2.5 km deep. From these early observations, it was unclear what the deposits were made of – but new research now has an answer.\n\n“We’ve explored the MFF again using newer data from Mars Express’s MARSIS radar, and found the deposits to be even thicker than we thought: up to 3.7 km thick,” says Thomas Watters of the Smithsonian Institution, USA, lead author of both the new research and the initial 2007 study. “Excitingly, the radar signals match what we’d expect to see from layered ice, and are similar to the signals we see from Mars’s polar caps, which we know to be very ice rich.”\n\nIf melted, the ice locked up in the MFF would cover the entire planet in a layer of water 1.5 to 2.7 m deep: the most water ever found in this part of Mars, and enough to fill Earth’s Red Sea.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19arnp4",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "/r/Futurology/comments/19arnp4/why_dont_we_have_any_of_our_trasport_vehicles/",
    "title": "Why don't we have any of our trasport vehicles controlled by simulator setups yet ?",
    "points": null,
    "comments": [
      {
        "comment": "If it can be controlled remotely, it must be able to gracefully handle a loss of connection. And the work required to get that isn't far off from the work required to just remove the human from the loop the whole way. \n\nAlso, a non trivial part of the job of the driver is to deal with unusual situations like unruly passengers, system failures, etc.",
        "points": "22 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You’re still requiring a driver and increase expense, liability, & complexity. What’s the upside besides turning driver into a WFH job? The automation here would likely come with automating the driver position with the ability for a human to take control in a complex situation.",
        "points": "4 points",
        "children": [
          {
            "comment": "What’s the upside besides turning driver into a WFH job\n\nYou could do a morning shift in NY and an evening shift in LA, have more drivers available in the locations where they're needed most at the minute. Or hire drivers from a low cost of living area to drive in hcol areas. (I don't actually think remote drivers are a good idea, but I do think these are benefits you haven't thought of)",
            "points": "",
            "children": [
              {
                "comment": "It sounds interesting, but it might need to be the perfect combination of affordable and legally required to have a human watching, in order for it to a better solution than in-person drivers or fully automated driverless",
                "points": "",
                "children": [
                  {
                    "comment": "Yeah it's a bad idea for cars. Something similar is already happening for fast food drive thrus though, having someone remote operating the speaker. Currently it's just employing people in third world countries so you don't have to pay min wage; but there are some cool non dystopian uses.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Not to mention handling all the edge cases like support for the blind or disabled (who can currently be helped by the driver) or when there's something on the tracks that needs moving (in the case of trolly busses) that the driver could just hop out an move, etc etc\n\nAnd for seemingly zero upside.\n\nSo, why?",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Meh - Uber already has driveless cars that sound WAY safer than remote controlled cars as they monitor a much wider field of view with instant reaction times.\n\nI’m sure fleets of driverless transport vehicles is just around the corner, although home delivery will obviously take longer.",
        "points": "1 point",
        "children": [
          {
            "comment": "They're not asking about driverless i.e. autonomous vehicles, they're asking about remote-controlled vehicles. There would still be a driver, who would be located outside the vehicle, presumably in a central location.",
            "points": "1 point",
            "children": [
              {
                "comment": "Yes - and I was arguing driverless cars are far safer and the technology is already here so remote controlled cars really don’t make much sense for broad commercial use.\n\nRemote controlled cars do make sense in environments where a human life might be in danger such as military, remote rescue, or off world situations, but not for regular transport where driverless capability would work just fine.\n\nI could see remotely monitored cars, but actually driving them on any production scale seems unreasonable.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "In some part of the words mostly Europe and east Asia and Chile, they have train and subway like this, the rest of the world buy cheap or bad mostly expensive and bad",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Never seen but I've heard of the amazon puller bots automatically navigating a warehouse and collecting bins. Some farm equipment can be programed to plow a field by itself, lawnmower roombas. But bigger than that I think it's a matter of driving on public roads or the speed and power of a train.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm of the opinion that the driver should have some skin in the game (literally in this case). If the driver knows that the worst that can happen if he messes up is that he gets fired and perhaps charged with manslaughter, then he will drive differently compared to knowing that the worst that can happen if he messes up is he dies a painful, violent death.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19ard20",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://ukdefencejournal.org.uk/new-british-laser-weapon-in-successful-high-power-firing/#google_vignette",
    "title": "New British laser weapon in successful high power firing - During a trial at the MOD’s Hebrides Range, the DragonFire laser directed energy weapon (LDEW) system achieved the UK’s first high-power firing of a laser weapon against aerial targets.",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/Gari_305:\n\nFrom the article\n\nDragonFire is led by the Defence Science and Technology Laboratory (Dstl), on behalf of the UK MOD, working with its industry partners MBDA, Leonardo and QinetiQ.\n\nThis milestone demonstrated the ability to engage aerial targets at relevant ranges and is a major step in bringing this technology into service. Both the Army and Royal Navy are considering using this technology as part of their future Air Defence capabilities.\n\nDefence Secretary, Grant Shapp said:\n\n“This type of cutting-edge weaponry has the potential to revolutionise the battlespace by reducing the reliance on expensive ammunition, while also lowering the risk of collateral damage. Investments with industry partners in advanced technologies like DragonFire are crucial in a highly contested world, helping us maintain the battle-winning edge and keep the nation safe.”\n\nThe Ministry of Defence say that the latest milestone builds on a series of highly successful trials, including the first static high-power laser firing of a sovereign UK capability and demonstration of the DragonFire system’s ability to track moving air and sea targets with very high accuracy at range.\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19ard20/new_british_laser_weapon_in_successful_high_power/kimraxs/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I hate that we're getting laser weapons before flying cars.",
        "points": "",
        "children": [
          {
            "comment": "I feel you, but from everything I've ever heard they are sadly just impractical.",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Deaths rays",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Think about how awful people are at driving land-based cars. Do you really want those same people flying cars over your fucking house?",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I will assert once more that directed energy weapons will some day soon make ballistic missiles INCLUDING NUKES, as well as all kinetically fired armaments (except maybe bullets), OBSOLETE. This will render the capabilities of nations like Russia, China and North Korea to launch nuclear strikes from their home soil with the intent of striking the US, neutralized. Shit is moving quickly in this space. And this is only the stuff they are showing us.",
        "points": "",
        "children": [
          {
            "comment": "Agreed. Nothing moves faster than light. All the nuclear powers will have to figure out another deterrent once these lasers become powerful and reliable. No missile stands a chance. An array of lasers could wipe out a country's entire nuclear arsenal within minutes. Which means that military power will become more important.",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "That would require the energy from the direct energy weapon to be sufficient to fully disable the attacking missile with a nuclear warhead. How about they just cover the attacking missile in mirrors?",
            "points": "",
            "children": [
              {
                "comment": "It’s a good point, but adding highly reflective surfaces would significantly increase its radar signature, making it easier for traditional radar-guided interceptors to hit it. I don’t think Directed Energy Weapons alone will be the answer.",
                "points": "",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Or just start another nuclear arms race to swamp any defences with nukes and decoys.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "And this is only the stuff they are showing us.\n\nYup, I saw this on an exhibition stand a good 5-7 years ago, which probably means it was around a good 3 before that lol.",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Great news. I don’t know anything about it, but how does the laser destroy a nuke without detonating it?",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I didn't count on lasers making nukes obsolete. Neat",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "From the article\n\nDragonFire is led by the Defence Science and Technology Laboratory (Dstl), on behalf of the UK MOD, working with its industry partners MBDA, Leonardo and QinetiQ.\n\nThis milestone demonstrated the ability to engage aerial targets at relevant ranges and is a major step in bringing this technology into service. Both the Army and Royal Navy are considering using this technology as part of their future Air Defence capabilities.\n\nDefence Secretary, Grant Shapp said:\n\n“This type of cutting-edge weaponry has the potential to revolutionise the battlespace by reducing the reliance on expensive ammunition, while also lowering the risk of collateral damage. Investments with industry partners in advanced technologies like DragonFire are crucial in a highly contested world, helping us maintain the battle-winning edge and keep the nation safe.”\n\nThe Ministry of Defence say that the latest milestone builds on a series of highly successful trials, including the first static high-power laser firing of a sovereign UK capability and demonstration of the DragonFire system’s ability to track moving air and sea targets with very high accuracy at range.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In other news something unknown pierced the side of an air freight liner forcing it to land …",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19apqvs",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "/r/Futurology/comments/19apqvs/journey_to_2050_video_explore_future_cities_and/",
    "title": "🌐 Journey to 2050 (Video): Explore Future Cities and Mars Colonies!",
    "points": null,
    "comments": [
      {
        "comment": "I loved this video so much!! I hope these cities become real!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI narrated. Insta closed the window sorry, unwatchable.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19ao1sd",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://www.euronews.com/green/2024/01/18/end-of-the-line-for-diesel-powered-lorries-and-buses",
    "title": "End of the road for diesel-powered lorries and buses in Europe. Near-complete phase-out by 2040.",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/IntrepidGentian:\n\n\"The EU has taken another significant step in its efforts to clean up road transport, with a political agreement on CO2 standards for trucks and buses that amounts to a near-complete phase-out of diesel-powered models by 2040. The average carbon dioxide output from new trucks and coaches sold in the EU must be 90% below current levels by 2040, European lawmakers have agreed, while city buses must be entirely emissions-free five years ahead of that date.\"\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19ao1sd/end_of_the_road_for_dieselpowered_lorries_and/kim2tbs/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"The EU has taken another significant step in its efforts to clean up road transport, with a political agreement on CO2 standards for trucks and buses that amounts to a near-complete phase-out of diesel-powered models by 2040. The average carbon dioxide output from new trucks and coaches sold in the EU must be 90% below current levels by 2040, European lawmakers have agreed, while city buses must be entirely emissions-free five years ahead of that date.\"",
        "points": "11 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Great, no more clouds of black soot from the back of the 'better for the environment' buses",
        "points": "15 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Full of good intent, but sadly it's a short sighted idea. Here in Norway we already shifted to a fully electric bus service/system. It's been going badly, partially or fully cancelled services repeatedly because the vehicles don't work well enough in -20⁰c weather.",
        "points": "4 points",
        "children": [
          {
            "comment": "Bjorn explains what happened :\n\nhttps://www.youtube.com/watch?v=nQXc_C0m9Gg\n\nIt seems the vehicles had no problems, the chargers failed, but it's a problem that can be solved.",
            "points": "7 points",
            "children": [
              {
                "comment": "There's also ramge issues too.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "care to move the goal post further?",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Sure. But when market is bigger the problems will be solved. A perfect example is when EU forbid the classical light bulb. Led was just in experimental faze. In the start the led bulbs were expensive and bad. Now, they are far superior to the classical ones.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This is meaningless.\nWhat will get rid of diesel large vehicles is technology - better EV tech specifically (arguably also with a low but non zero chance of some other tech, like a breakthrough in hydrogen production and use).\n\nIf the tech isn’t ready, the deadline will be extended. If it is, the ban probably isn’t needed.\n\nPeople really do need to stop celebrating politicians as if they are the solution of our problems.",
        "points": "-6 points",
        "children": [
          {
            "comment": "To some extent that is true, but by making this sort of ruling a strong signal is sent to the manufacturing industry about where their development focus needs to be. I don't see any downsides to this kind of ruling.",
            "points": "11 points",
            "children": [
              {
                "comment": "Yes! We hear these kinds of arguments over and over but governments announcing benchmarks is effective, for the reasons you cite.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It’s a combination of things that will illicit the change and arguably the EU are increasing the size of the market and therefore the incentive for investment in the technology required.\n\nThe combination of an end of sales, the fact many European (especially EU) cities are enacting LEZs which would prohibit (via cost) these vehicles from city centres and the related incentive to invest in the technology will together drive the change required.",
            "points": "",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The trucking guys say EV technology is already good for some purposes. The break even point for yard trucks is around 2-4 years depending on the usage. It's an incredibly good investment. I guess it depends what you're using them for.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Battery tech will do just fine for this use case. Solid State will be on its second or third generation by then and the battery industry will already be serving all cars produced in the world long ago and the hundreds of billion spent on R&D will bring enormous improvements in battery density and performance.\n\nIt’s also better to have one technology serving road transportation rather than two.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "How will they deal with the fact that the lithium ion batteries just stop in cold weather",
        "points": "-8 points",
        "children": [
          {
            "comment": "All EV batteries are thermally regulated. There is fluid circulated through the battery. The vehicle can preheat on grid power, then it scavenges waste heat from the motor/inverter to heat the battery. You can still aggressively discharge a LFP lithium battery to -20C. So it doesn't take long to preheat from -40 to -20 on an extremely cold day. To enable regenerative braking or charging, the battery needs to be heated to 0C or above.\n\nWhich, compared to running your combustion engine are you 100C isn't actually very warm. The new Sodium-ion batteries that have just hit the market can charge/discharge down to -20C.",
            "points": "15 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This is not true. Source: thousands of electric vehicles in Scandinavia.",
            "points": "12 points",
            "children": [
              {
                "comment": "They have had a series of snow storms in Oslo, Norway recently and half the busses in the Ruter transport network stopped working. The range was reduced severely others too",
                "points": "3 points",
                "children": [
                  {
                    "comment": "Most of that was the charger network failing. Why not read up on that incident in detail instead of relying on clickbait headlines.\n\nAlso; those issues have already been identified and a fix is in the works. It was some components in the chargers failing to charge at -35 or something like that. Insufficient cold weather testing was done. Fortunately heating equipment connected to the grid is simple.",
                    "points": "11 points",
                    "children": [
                      {
                        "comment": "They're having range issues as well as charging issues.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "The 'range issues' also happen with combustion engine cars. You get worse mileage in winter. Combustion engines are extremely wasteful. Harvesting waste heat is easy. This is harder with electric cars.\n\nHere is some real world range loss testing done in Norway. -10 to -28% depending on the model. https://www.fiaregion1.com/naf-worlds-largest-electric-car-test/\n\nCars are improving every year, so if you live in a cold climate, buy a car that performed well on this test. A lot of makers are modifying cars to improve, so this will get better year over year.\n\nAs for all these 'charging issues', the actual charging issues tend to be overblown hype by the media. America's new standard for EV charging from all the companies that accepted the governments billions is 98% uptime. Broken chargers will happen. Broken gas pumps happen too. The right wing media loves making big overblown reports about broken chargers. Never seen the same article about broken gas pumps. You just drive to a different charger or gas pump. The charging apps show which are working. If you can't figure out driving to a charger that works, well, maybe you aren't the sharpest tool in the shed. My favourite media article was a guy who plugged his car in and waited 6 hours and it never charged. This person is what you call 'stupid'.\n\n80% of all ev owners currently have home charging. You start every morning with a pre-warmed battery and a full charge. Do you start every morning with a full tank of gas? If you have access to electricity, the car itself does not have a problem charging. Batteries are heated and thermally managed via a liquid circuit. Most of the faults come down to the charging networks themselves. If something is going to fail, it is going to fail on the hottest or coldest day of the year. I used to be a mechanic and during the first cold snap of the year the tow trucks are lined up around the block from cars that don't start. Same with the first hot day. The Volkswagen 'electrify america' network was built as punishment for dieselgate and was shitty on purpose. They now have legal requirements for uptime that must be met.\n\nDo some reading up on electric cars being used in the far north. They work just fine. In fact, chances are that your electric car will go when it is -50C, where as your diesel truck won't start so it needed to be left running all night. Given the high fuel prices up in the far north, buyers are flocking to EV's.\n\nThere is of course a learning curve going on here. Gas pumps have been around over a century. Rapid chargers are rapidly improving every year and of course there will be teething issues. But these issues are resolved and are improved every year. Because failing costs money, and chargers make money.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "Combustion engine vehicles can be filled in minutes, thus negating range issues entirely.\n\nNorways EV adoption is fantastic and I love driving our family's Electric car, just keeping it real here in our subreddit.",
                                "points": "2 points",
                                "children": [
                                  {
                                    "comment": "However, you waste time every week at a gas station. With home charging, how often do you actually have to find a rapid charger because you are so far away?\n\nAs ranges improves, this is less of a problem. Once you cross 400-500km of range, stopping for a 30 minute steak and a pint at the pub to gain 75% of your battery charge is no longer really a 'problem'. It's a better way to live. But did you need to get back to 75%? How often do you drive 800-900km in a day? Once a year? Twice? That is less time spent than 10 minutes a week at the gas pump.\n\nIf you don't have home or hotel charging however, it sucks. And this is going to be a serious divide in society. Grocery stores adopting rapid charging station is the fix there. That half hour stop to get 3/4 charged.\n\nAnd this highlights how the roadside highway gas station experience is built wrong. It needs to be paired with restaurants, coffee shops, malls, tourist traps, etc.",
                                    "points": "-1 points",
                                    "children": [
                                      {
                                        "comment": "For personal use an EV is perfect. Charge at night and only use charging stations very rarely as you say.\n\nI think you'd love Norway. We've got so many charging areas here in Norway. They're set up around malls, shopping centres, as well gas station charging areas.",
                                        "points": "1 point",
                                        "children": [
                                          {
                                            "comment": "I'm in Vancouver BC and it is following Norway's model of lots of perks for Ev owners. And expensive fuel/cheap electricity.\n\nOf course, I can't actually buy a long range heavy duty electric van capable of towing big loads just yet. But it's coming soon.\n\nCanada has a problem of being absolutely huge and the distances you cover on highways is crazy. The government is using carbon tax money to slowly fill those gaps. All the bitching about range is from places like this. I need 450km of range while climbing the rocky mountains, and that's with a clapped out 80% life left battery and running the heater. You don't buy for the new range. You buy for 10+ years from now when the battery is tired.",
                                            "points": "",
                                            "children": [
                                              {
                                                "comment": "",
                                                "points": "",
                                                "children": [],
                                                "isDeleted": false
                                              }
                                            ],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Yeah it's been a nightmare.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "i use lithium ion batteries all the time and cold easily halves their effectiveness i have to keep them in my jacket to keep them warm, leave it out over night? absolutely dead.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Electric cars have battery heaters to mitigate this effect. They spend something like 3% of their total charge to heat up the battery (which can be mitigated when doing this while still on cable), then the battery works like in warmer temperatures.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Buy Milwaukee tool batteries and they will work down to -18C. Cheap cells die sooner in warmer temps.\n\nBut electric cars have insulated batteries heated and cooled by liquid. Once that battery is warm it stays warm for a very long time. You just tell the car to preheat the battery in the morning using the heat pump, on grid power or off the battery. You only need to heat to -20C to start driving and heating to 0C enables regen and charging. The car is also scavenging waste heat from the motor and inverter to warm the batteries once you are moving, so it will continue to warm your battery while you drive, then retain that heat for hours while your car is sitting at work for example.\n\n. Much like how you keep your spare power tool batteries inside your jacket. That 'dead' battery actually shut itself off at -18C to protect itself. Using it colder than that forms dendrites and ruins the battery. However as long as it isn't charging or discharging it can get extremely cold and not care.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Hell my M18' work pretty well down to -35f, that was a terrible fuckign day but my tools worked",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Our electric bus fleet in Norway has had mass cancelations of service this winter due to the cold weather.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Oh, man cool but I don't think Europian union will be here by 2040\n\nGfccvv\n\nGgfccc👈",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19ankka",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://thevaisheshikatimes.com/meet-the-worlds-first-cloned-rhesus-monkey-to-reach-adulthood/",
    "title": "Meet The World's First Cloned Rhesus Monkey To Reach Adulthood",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/Brave-Ad-6868:\n\nSubmission statement: Chinese Academy of Sciences: Scientists have achieved a significant milestone in the field of animal cloning. For the first time, a cloned rhesus monkey (Macaca mulatta) has survived into adulthood. At over two years old, the cloned monkey named ReTro represents a breakthrough in primate cloning that could unlock new possibilities for medical research using cloned non-human primates.\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19ankka/meet_the_worlds_first_cloned_rhesus_monkey_to/kilzgbj/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Submission statement: Chinese Academy of Sciences: Scientists have achieved a significant milestone in the field of animal cloning. For the first time, a cloned rhesus monkey (Macaca mulatta) has survived into adulthood. At over two years old, the cloned monkey named ReTro represents a breakthrough in primate cloning that could unlock new possibilities for medical research using cloned non-human primates.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The fact that its first words were \"killl meee\" is kinda worrisome.",
        "points": "1 point",
        "children": [
          {
            "comment": "where does it say that in the article? lol",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "How is this news? We cloned so many animals already to full adulthood. It happens on a daily basis. They just did it with a different species and call it a \"breakthrough\"..\n\nRemember Dolly the sheep? People think she died of short telomeres concluding that dolly her genetic age was the same as the original sheep so she lived a short life. That is not at all what happened. Dolly died of pneumonia,... she had a normal epigenitc age and normal telomeres.\n\nSo this isn't really \"futuru\" stuff.. We just stopped cloning stuff that were on the ethical issue level. Also finding out character traits do not transfer made it a big no-no for anymore wanting to clone themselves. It is just another naked monkey that happens to look like you. That is all.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19alnrs",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://www.cnbc.com/2024/01/19/japan-slim-lunar-lander-touches-down-on-moon.html",
    "title": "Japan becomes fifth country to land on the moon with JAXA’s SLIM spacecraft",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/Gari_305:\n\nFrom the article\n\nJapan staked a claim as a national space power on Friday, declaring its SLIM spacecraft successful in landing on the moon.\n\nThe country’s SLIM lander launched in September and touched down on the lunar surface around 10:20 a.m. ET, according to the Japan Aerospace Exploration Agency, or JAXA. Engineers were checking the status of the spacecraft shortly after its landing.\n\nThe feat makes Japan the fifth country to land on the moon, following Russia (then the Soviet Union), the U.S., China and India. Last year, India joined the list of moon landings with its Chandrayaan-3 mission.\n\nJapan’s SLIM, which stands for “Smart Lander for Investigating Moon,” is a cargo research mission. It carries a variety of scientific payloads, including an analysis camera and a pair of lunar rovers.\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19alnrs/japan_becomes_fifth_country_to_land_on_the_moon/kilkug2/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "From the article\n\nJapan staked a claim as a national space power on Friday, declaring its SLIM spacecraft successful in landing on the moon.\n\nThe country’s SLIM lander launched in September and touched down on the lunar surface around 10:20 a.m. ET, according to the Japan Aerospace Exploration Agency, or JAXA. Engineers were checking the status of the spacecraft shortly after its landing.\n\nThe feat makes Japan the fifth country to land on the moon, following Russia (then the Soviet Union), the U.S., China and India. Last year, India joined the list of moon landings with its Chandrayaan-3 mission.\n\nJapan’s SLIM, which stands for “Smart Lander for Investigating Moon,” is a cargo research mission. It carries a variety of scientific payloads, including an analysis camera and a pair of lunar rovers.",
        "points": "5 points",
        "children": [
          {
            "comment": "Talk about a rushed article. The status of the spacecraft is still being checked, we're waiting for a press conference to confirm whether it landed successfully or not (though BBC reports amateur astronomers receive signals from the lander)",
            "points": "9 points",
            "children": [
              {
                "comment": "Yes, there seem to be signals. But there are indications that the landing was not flawless. What impact that will have on the science they can still do, and crucially on the deployment of the rovers, we just don’t know at this point.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Two hours later we know that they soft landed with 100m precision but the panels aren't generating power\n\nSo a success but how much science they can do is seriously doubtful",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "I don’t think the 100m thing has been confirmed yet.\n\nBut, intriguingly, the rovers seem to have been deployed shortly before the landing (just as they planned it). That’s a big win.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Flypast>orbiter>impactor>lander>rover>sample return>people return>permanent base. That's the \"hierarchy\" of lunar mission complexity.\n\nJapan would definitely want to deploy the rover before declaring full success. The Indian rover took quite some time to charge. Anyone know how long it's supposed to take here? That's when you can expect a proper update.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Japan would definitely want to deploy the rover before declaring full success.\n\n2 rovers have been deployed. One rover is sending signals which is caught by NASA 's Deep space network. The landing has been a success, but it will only last for 5 hours, if the solar panels of the lander fails to generate electricity",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'm always impressed with Japan's space program.  They do really cool stuff with a much smaller budget than NASA.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This mission used a different type of trajectory to the Moon, and did so specifically to prove the ability to target very specific locations on the Moon with great precision.\n\nIt used the Weak Stability Boundary or WSB trajectory, a part of a Ballistic capture trajectory approach to transfers between bodies in space.\n\nNot only does it spend less fuel but actually provides greater precision of landing.\n\nPerfect news.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We need to develop new systems to facilitate colonization like this www.ntari.io/tos",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19akv59",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://theconversation.com/japan-is-about-to-land-its-first-lunar-probe-as-more-nations-race-to-the-moon-how-will-we-keep-the-peace-221223",
    "title": "Japan is about to land its first lunar probe. As more nations race to the Moon, how will we keep the peace?",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/Gari_305:\n\nFrom the article\n\nTo date, the leading spacefaring nations have gone to great lengths to publicly assure us that their intentions in space are peaceful. Yet, last year Yury Borisov of Russia’s space agency Roscosmos bluntly stated:\n\nThis is not just about the prestige of the country and the achievement of some geopolitical goals. This is about ensuring defensive capabilities and achieving technological sovereignty.\n\nBorisov’s comments should not be read in isolation, however. US officials have made similar assertions. In July last year, the US assistant secretary of defense for space policy, John F. Plumb, was equally blunt:\n\nSpace is in our DNA for the military. It’s absolutely essential to our way of war.\n\nSuch official commentary is clearly anathema to the purported peaceful intentions expressed by officials elsewhere in their respective national hierarchies. Similarly, to safeguard its national interests and encouraged by President Xi Jinping himself, China has been fine-tuning its own military space strategy.\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19akv59/japan_is_about_to_land_its_first_lunar_probe_as/kilf3z4/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We won’t, because we have absolutely no idea how to keep the peace.",
        "points": "33 points",
        "children": [
          {
            "comment": "How on earth is anybody supposed to make any money with all this \"peace\" breaking out all over the place. No no no we need more \"freedom\" and \"democracy\" please. Everybody on earth needs a big heaping helping of American freedom and democracy whether they like it or not.",
            "points": "5 points",
            "children": [
              {
                "comment": "War is a great way to make money.\n\nPeace sells but who’s buying?",
                "points": "0 points",
                "children": [
                  {
                    "comment": "These stealth bombers aren't going to sell themselves.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Dominance is how you keep the peace, war is how you remind people they have to be peaceful. /S",
            "points": "1 point",
            "children": [
              {
                "comment": "Ironically not wrong.\n\nSuperior might makes for a peaceful place",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "War is America's peace, and soon peace will arrive.",
            "points": "3 points",
            "children": [
              {
                "comment": "America was the alpha bully, they kept other countries in line. Now that America is starting to move more towards isolationism all these conflicts between countries have started to spring up everywhere as they try to set up their own spheres of influence. We’re going back to the world before American dominance",
                "points": "-2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Exactly. Astroballistic Railgun Online.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "[removed]",
        "points": "",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": true
              },
              {
                "comment": "",
                "points": "",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [
                              {
                                "comment": "",
                                "points": "",
                                "children": [
                                  {
                                    "comment": "",
                                    "points": "",
                                    "children": [
                                      {
                                        "comment": "",
                                        "points": "",
                                        "children": [
                                          {
                                            "comment": "",
                                            "points": "",
                                            "children": [
                                              {
                                                "comment": "",
                                                "points": "",
                                                "children": [],
                                                "isDeleted": false
                                              }
                                            ],
                                            "isDeleted": true
                                          }
                                        ],
                                        "isDeleted": true
                                      }
                                    ],
                                    "isDeleted": true
                                  }
                                ],
                                "isDeleted": true
                              }
                            ],
                            "isDeleted": true
                          }
                        ],
                        "isDeleted": true
                      }
                    ],
                    "isDeleted": true
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [
                              {
                                "comment": "",
                                "points": "",
                                "children": [
                                  {
                                    "comment": "",
                                    "points": "",
                                    "children": [],
                                    "isDeleted": true
                                  }
                                ],
                                "isDeleted": true
                              }
                            ],
                            "isDeleted": true
                          }
                        ],
                        "isDeleted": true
                      }
                    ],
                    "isDeleted": true
                  }
                ],
                "isDeleted": true
              }
            ],
            "isDeleted": true
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Does anyone know whether the probe landed or crashed?",
        "points": "3 points",
        "children": [
          {
            "comment": "Can't it be both?",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "By sheer panic and a herculean effort to not lose. This is the American way.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Keep the peace you say? Well, that's the fun part!\n\n(We won't)",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’ll be like the early internet. Everything was beautiful and wonderful until someone figured out how to make serious money and give access to everyone then It went to total shit.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's in the hands of the brightest minds around the world.. Every scientist out there working on space projects dreamt of space as something beautiful & as a way for progress to human life.. it's up to them to not let these war mongering monkeys to space.. For research yes, but I beg them if there are any tactical ass security thing they're putting up in space, please sabotage the fuck out of it for the sake of humanity..",
        "points": "-1 points",
        "children": [
          {
            "comment": "I hope the general population listens to scientists, facts, and doesn’t devolve into weird conspiracy theories & a cult-like mentality of sheep led by the loudest politician or rich person in charge, by spreading hatred, lies, and misinformation to divide ppl into meaningless culture wars.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yea because space is so small we will need to be fighting over the limited resources.\n\ngood god humans are effing stupid.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "From the article\n\nTo date, the leading spacefaring nations have gone to great lengths to publicly assure us that their intentions in space are peaceful. Yet, last year Yury Borisov of Russia’s space agency Roscosmos bluntly stated:\n\nThis is not just about the prestige of the country and the achievement of some geopolitical goals. This is about ensuring defensive capabilities and achieving technological sovereignty.\n\nBorisov’s comments should not be read in isolation, however. US officials have made similar assertions. In July last year, the US assistant secretary of defense for space policy, John F. Plumb, was equally blunt:\n\nSpace is in our DNA for the military. It’s absolutely essential to our way of war.\n\nSuch official commentary is clearly anathema to the purported peaceful intentions expressed by officials elsewhere in their respective national hierarchies. Similarly, to safeguard its national interests and encouraged by President Xi Jinping himself, China has been fine-tuning its own military space strategy.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Moon war!!!! I got stock in Honeywell I claim Shackleton for Plankton!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Are we expecting fisticuffs or a common brawl on the moon?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "this is like something out of Star Trek or The Expanse \"It all started with the MOON WAR\"",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You meet, shake hands, pop a bottle of your favorite drink, and talk about all the great things you can accomplish working together. How does such an easy solution get lost on you?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Unless there's oil on the moon I'm sure it will be fine.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We don't keep the peace on Earth, why would the Moon be different? Whoever has the tech to carve out territory and the military power to keep it will be the victors.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "A race? I think that doesn’t make any sense after the Cold War. I admit I really help boosting budgets and research but now, what is the race for ?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "we can’t even keep the peace down here so we likely wont up there",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "When I'm sitting with my so, gazing at the moon, it'll be so romantic knowing Gingrich Moonbase's nuclear cannons pointing straight at Earth are keeping us safe.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We won't it will never happen, just look at what's going on here on earth, to think otherwise is wishful thinking",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "we should work together in large groups-many countries and take it out of military spending , what are idiot players with mass shootings trying to get kids use to what kids go through in 3rd world countries and warmonger countries to play against the think do feelings and happening of idiot players otherside = is just messing up the world more n more not fixing the real problems by reducing the worst crap going on",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Didn’t realise this sub was an American one. Please stop using we. Not all of us are brainwashed yanks.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I can’t wait to see NASA’s new moon landing video; should be cool with todays graphics…",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19ajwf4",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://newatlas.com/robotics/figure-bmw-humanoid/",
    "title": "Figure's humanoid robots are about to enter the workforce at BMW - Figure has signed its first commercial deal, and is sending its general-purpose humanoid robots off to start real-world work at BMW's manufacturing plant in South Carolina.",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/Gari_305:\n\nFrom the article\n\nEmerging from stealth mode just 10 months ago, Figure has developed its robots at a frightening pace. The company had prototypes up and walking within a year of development, thanks to a highly experienced team – and at an impressive speed, too, compared with everything this side of the acrobatic Atlas bot from Boston Dynamics.\n\nAlso from the article\n\nAnd now, it's delivering on its promise to get the bots out there doing real, useful work ASAP. Under a freshly signed commercial agreement with BMW Manufacturing Co. LLC, Figure has started identifying initial use cases at BMW's Spartanburg plant, and has begun training the bots up for a staged deployment on site.\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19ajwf4/figures_humanoid_robots_are_about_to_enter_the/kil7wlt/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What's interesting is I work st Plant Spartanburg in assembly and I had to learn about this from reddit. I'm sure we're a long way off from these robots doing what we do in assembly though.",
        "points": "60 points",
        "children": [
          {
            "comment": "Well the guy whose job is making coffee should definitely start dusting off his resume.",
            "points": "27 points",
            "children": [
              {
                "comment": "He should just have chatgpt rewrite it.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Stay strong fellow humanoid",
            "points": "10 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Judging from the video of the robot making coffee, I would think we're a long way off! I expected maybe a pour, a stir, something with fine motor skills displayed. This is just dropping a Keurig pod in a hole, closing the lid and pressing a button. The guy was so smug about it too. Weird.",
            "points": "5 points",
            "children": [
              {
                "comment": "You fucks have no appreciation for just how hard it is to build robots that can do useful things in real world environments.\n\nIt's easy to make a very stupid robot mechanically execute the same exact specific motion to a given tolerance, and set it to repeat.\n\nBut now, shift the coffee machine by 5cm to the left. Shift the coffee pod by 5cm to the right. Make the coffee machine lid catch a bit loose so that the lid doesn't click in the first time you push it down. All of those small changes, little deviations that a human would handle without thinking? They would make the stupid robot fail completely and utterly.\n\nUnless the robot isn't stupid. If the robot is backed by a powerful enough AI? If the robot is not just executing the same pre-set motion every time, but is actually looking at the table, locating objects, observing its own actions to see if they accomplished the intended result and performing corrective actions if they don't? Then you have something worth being smug about.\n\nThat's what makes Boston Dynamics kinematics so impressive. It's not that the robot can walk - it's that it can walk fast and steady while handling all the little deviations that come with it. It's that you can kick a robot and have it move to self-correct and avoid falling down - or right itself and resume its course if it fell.",
                "points": "10 points",
                "children": [
                  {
                    "comment": "Our technology has reached the point people trivialise it",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Oh give me a break! Yes I completely understand that this is a huge deal. Anyone can see that it has such subtle facility with it's movements, the cognizance to put everything in order. But the video promised \"making coffee\" and then they give us a fucking Keurig. That's like saying it's going to cook a meal and then it puts a slice of bread in a toaster and presses the button. The title over promised and the video under delivered and it gave me a laugh.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Good content but why are you so angry?",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why humanoid? Human shape has limitations, they could play god a little and go a little further",
        "points": "30 points",
        "children": [
          {
            "comment": "Compatability. Factories already have lots of human-friendly controls and architecture. An exotic body type may need accommodations.",
            "points": "42 points",
            "children": [
              {
                "comment": "This. Everything we have, lift assists, drills, all hand tools, racks, fixtures, the skids that the cars ride on literally everything is built around making it most accessible and convenient for basically the himan forn. They would practically have to reinvent everything if they were to push for something other than a humanoid form to replace us.",
                "points": "7 points",
                "children": [
                  {
                    "comment": "I think once it's nothing but robots doing the work you should theoretically see the \"final form\" god mode designs come out, since tools and other things made for humans will be irrelevant.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "And the labour to rebuild/rearange is robots by then as well.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "The only possible 'improvement' would be an octopus like robot with various tentacles and free flowing body\n\nWhich we are nowhere near making yet",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I'm sorry but I watched all the star wars documentaries and it's obvious that a telescopic multi-tool is more than sufficient to perform repair and assembly task in any environment.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Does compatability is a world🤔 if not it's funnier because in Spanish, Pata means paw.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "No, it's actually \"compatibility\". They spelled it wrong.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Yes, but 4 legs similar to spider motion is superior locomotion model.\n\nSpider lower, human upper is best.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Ah yes. Robotic humanoid spiders. That's not nightmare fuel at all",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "They could give them at least 4 arms...",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Could at least add some extra arms!",
            "points": "5 points",
            "children": [
              {
                "comment": "Some of these will be using systems like: https://www.trossenrobotics.com/aloha.aspx This is kind of like some welding robots where you move the welding arm around teaching it to perform welds and then sensors correct for errors. But the main thing is it learns from watching a human (with two arms) perform a task. This can be done using pose detection cameras as well in theory like watching a person in a factory pick up and manipulate objects.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Nothing makes you work a bit faster than something that looks like you but doesn't sleep or complain or call in sick working next to you...",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Building humanoid robots have always been a \"Can we do it?\" sort of challenge. It's not actually a optimal design for anything, but the idea is that if done well enough it could be minimally viable design for everything, one machine that can do it all. But the tech is very far from being well enough for that.\n\nActually it's very hard to find any use for humanoid robots, basically impossible to find a use case where they would actually pay for themselves. Right now they are simply not capable enough.\n\nThe breakthrough achieved in recent years is actually just plain bipedal motion, that engineering challenge is now mostly solved. Problem is, in a factory that is a completely useless capability. It's not monetizable and it certainly doesn't justify what it costs today.\n\nBut with how fast the tech is developing, that might not be the case for long, the useless robots could become useful surprisingly rapidly. So some companies choose to jump on the bandwagon now, even though it's just pure expense with nothing gained immediately, but if the tech pans out, then they have a head start compared to the rest of the industry.\n\nSimilarly, I can't imagine the first Unimate having been a worthwhile investment to GE, it probably lost a lot of money on it's own. But all the industrial robot based automation that came after and the experience gained with that first trial.... in that context I'm betting it paid off a thousandfold.",
            "points": "3 points",
            "children": [
              {
                "comment": "Actually it's very hard to find any use for humanoid robots, basically impossible to find a use case where they would actually pay for themselves\n\nThat's actually not true.\n\nMost of the figures I see regarding price are in the $150-$200k range, with maintenance/upkeep/operating costs predicted in the 10% range (so around $15-20k annually), and lifespan at about 5-8 years depending on the manufacturer.\n\nAt that price point and with even the low end of that operating lifespan, the break even point is work tasks that pay $15 an hour at 60 hours a week (so six 10-hour shifts a week).\n\nThat generates something on the order of $230-$240k of labor value (at $15 an hour/60 hours a week) over five years (so low end of predicted lifespan) at a cost of around $225-$260k.\n\nThat's just straight pay, though, and doesn't include things like benefits, incentives, 401k match, turnover costs (especially important for labor at that pay level, with 60% annual turnover as the norm), and efficiency gains from reduced callouts/sudden labor shortages/etc.\n\nBasic math shows that even at the lowest-pay level you're pretty close to parity with robots, and that doesn't include price drops from economies of scale, the ability of the robot to work significantly more than 60 hours a week, etc.\n\nI'm not saying they're going to be some wunderwaffen level change, but there are very clear value propositions for robots even at their current level of capability.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Everything is built for the human form and human interface system (hands+eye-level optics). \n\nIt's generally held to be more cost effective to build a control system (the robot) that you can basically drag-and-drop into a wide range of scenarios with minimal (expensive) adjustment.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Adaptability. It's the same reason Flippy came into use even though it's complete overkill for flipping burgers and cooking fries.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "From the article\n\nEmerging from stealth mode just 10 months ago, Figure has developed its robots at a frightening pace. The company had prototypes up and walking within a year of development, thanks to a highly experienced team – and at an impressive speed, too, compared with everything this side of the acrobatic Atlas bot from Boston Dynamics.\n\nAlso from the article\n\nAnd now, it's delivering on its promise to get the bots out there doing real, useful work ASAP. Under a freshly signed commercial agreement with BMW Manufacturing Co. LLC, Figure has started identifying initial use cases at BMW's Spartanburg plant, and has begun training the bots up for a staged deployment on site.",
        "points": "10 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "One of the funniest interviews I saw in the ‘early 80’s in Toronto was a reporter asking auto workers outside a plant if they were scared of losing their job to a robot. (They’d just installed welding bots). A bunch of people answered yes, maybe, kinda, it’s gonna happen, etc. but one guy said NO emphatically. She asked him, “why?”. He answered “I’m the guy that fixes the robots” and kept walking. The reporter had nothing. Just stood there dumbfounded. I think about that guy every now and then. It’s 2024 and I bet he’s not so sure anymore…..",
        "points": "13 points",
        "children": [
          {
            "comment": "Probably retired by now after long career of fixing robots, a job that is only ever grown since then requiring ever more labor. A robot is just a tool, a hand extension for technicians and engineers behind it to complete a job the robot is doing. Sometimes the same job could get done with a much larger team of lower skilled and lower paid people, but who wants to be that low pay low skill employee?",
            "points": "4 points",
            "children": [
              {
                "comment": "but who wants to be that low pay low skill employee?\n\nActually it seems quite a few people. I mean obviously they would all prefer to be low skill, high pay, but even they seem to realize that that is not realiistic. Given even knowledge of that fact though, there seems to be a large pool of people who just want to get up in the morning, have coffee, go to work, not think for 8 hours, and then go home and collect a check. Any check. They might complain about how expensive everything is and how the rich are robbing their profits, but not enough to actually do anything about it.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It's 2024, he's probably retired, or on the verge of. 40 years ago!\n\nBut his third generation younger apprentice, well that guy better upgrade his skills to work on a different set of robots, but 15 years from now we might have robots fixing the robots fixing the robots fixing the robots... Just a circle of robots repairing each other.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Factory automation guy here. What I see is a wasteful, high maintenance design. It's beautiful marketing wank however. See the coffee video? Notice the engineer placed the coffee cup in the machine for the robot? Hmmm. Ya, this thing ain't as advanced as they are leading you to believe. Not yet anyways.\n\nFactory robots are all about doing the task simply and reliably at a station. You need an arm. Maybe two. And a few manipulators. If the robot needs to move, you probably designed a task wrong. But you can easily hang that robot arm on a track and have it move around a car or whatever.\n\nBut every part you add to your robot project leads to more reliability failures. This is why you always strive to keep the process simple. Will this robot humanoid have the dexterity to slap interior trim into place? I dunno. Humans are actually really fast at this, and they double as quality control.\n\nTesla was famous for trying to use too many robots, then ripping them back out and replacing them with meatbots. The humans were just better at a lot of tasks that require feel and wiggling things into their final position. Like assembling interiors.",
        "points": "8 points",
        "children": [
          {
            "comment": "Your comment reminds me of a great quote about engineering.\n\nA project is not done when there's nothing left to add, it's done when there's nothing left to take away.\n\nI started recording this to the administrative people in my institution who love to add more web forms and things like this, I keep asking you for more and more fucking details. Don't ask what other information do you need, ask which of these fields can you possibly take away so I don't spend 30% of my life filling out these stupid forms.\n\nAnother words, I'm encouraging them to think more like an engineer\n\n:)",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Factory robots are all about doing the task simply and reliably at a station.\n\nNow ask a question: why? Why exactly are all factory robots like that? Clearly, humans are still useful in factories - so why don't we have androids that work in the same way humans do, but better?\n\nAnd the answer is: software.\n\nFor a human body to be of any use, it has to be backed by the lump of grey biomass inside the skull. Robots don't have that.\n\nRobots can't be smart or flexible. Robots can't adapt to changes in their environment. Robots can't problem-solve or instruction-follow. Robots have almost no situational awareness. Robots can't correct their own mistakes and handle their own faults. Robots can only ever carry out a highly specific program, and that program will only result in something useful being done if it's done by a specific robot in a specific environment.\n\nWhich is why you get those specialized arms mounted at their specific stations and performing the same specific operations in the exact same way 384 times a day. It's the only way a robot that's precise and strong, but also almost entirely unaware and dumb as a brick can be made useful.\n\nExcept it's not the 1994 anymore. The year is 2024, and in the past decade, we've had one AI breakthrough after another. Making an \"android mind\" that could make a general purpose android body useful might be, finally, within reach.\n\nThat's what changed. That's what can make \"worker androids\" useful.\n\nTesla was famous for trying to use too many robots, then ripping them back out and replacing them with meatbots. The humans were just better at a lot of tasks that require feel and wiggling things into their final position. Like assembling interiors.\n\nIt's funny that you say that - because Tesla is doing a roundabout. They are currently developing a humanoid worker android, complete with sophisticated anthropomorphic arms kitted with pressure sensors. What for? To handle tasks that require \"feel\" and \"wiggling things into their final position\". Like assembling interiors.\n\nOf course, that's a pipe dream - without some serious leaps in robot AI. Which we are seeing now - because the field of AI is moving in leaps nowadays.",
            "points": "-1 points",
            "children": [
              {
                "comment": "I was clear about using the words YET. Frankly I think Ai is still overhyped and we are further out than you think general intelligence. Ai is a bit insane and very gullible. It's one thing when Ai spits out bad art and we laugh. It's another when it fucks up in person. A car factory is a place to apply robots however. Simple, repetitive tasks.\n\nDon't think for a second that those worker bots will be cheap. And I don't mean cheap to buy. The maintenance on them is going to be a nightmare.\n\nI have friends who have opened up the Boston Dynamics dog and oh my god. It is built like an ultra high performance aircraft. It's a nightmare to work onstage and it needs regular work. The slightest play in a joint makes a robot very angry. 6 axis arms now are built like a tank and are reliable. What I am seeing in these humanoid robots is the opposite of that. Building an entire robot as well as a modern arm would mean a seriously heavy robot. Now we need those to work around humans. If a robot falls over and hurts a human you have a health and safety issue. So it must be lightweight. Which means shitty.\n\nI still think this is an exercise in marketing wank. Good robots don't need to mimic humans in a factory environment.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "You don't need an android to match the intelligence of an average human. \"Assembling interiors\" is not a task that requires high intelligence. It's a spatial ability task more than anything - something a well trained monkey could do. But it's much easier to train humans than it is to train monkeys.\n\nRobots are a bit different though. If you managed to train one android to perform a task, you can transfer that training to a hundred androids. Software scales like that.\n\nI have friends who have opened up the Boston Dynamics dog and oh my god. It is built like an ultra high performance aircraft.\n\nInevitable. You can't cram the DOF of a human hand into something the size of a human hand without getting more than a little bit unhinged with your actuators. Doesn't mean that it can't be done though. Or that it can't be reliable.\n\nGood robots don't need to mimic humans in a factory environment.\n\nIf that was the case, there would be no place for humans in a factory environment at all. And yet, I see humans employed by factories all the time. Clearly, there is some aptitude humans have that robots don't. Clearly, there is room for improvement.\n\nThe maintenance on them is going to be a nightmare.\n\nAnd maintenance is a strong point for general purpose androids.\n\nWhen you have 120 robot arms, over 30 different models from 4 different manufacturers in over 60 distinct configurations, \"replace a failed actuator\" might get a little bit nightmarish. But when you have 600 of the same exact configuration of the same exact android?\n\nBy the time a \"failed actuator\" android makes it into the maintenance workshop? It already self-diagnosed its fault, and was already replaced on the factory floor by a \"full unit spare\" from a hot swap android pool. So you take off its arm, take a spare arm out of its factory packaging, bolt it on, plug the connectors, let the thing run its self-calibration and verify its performance, and send it back into the hot swap pool. Where it would stay, waiting until some other android fails or just runs out of juice.\n\nAnd the arm itself, that hideously complex thing that's a total nightmare to service? RMA. The manufacturer has a repair facility for dealing with things like that. Might be staffed by androids too.",
                    "points": "-1 points",
                    "children": [
                      {
                        "comment": "It's harder than you think building car interiors. And there is a lot of feel making sure everything goes together perfect. A robot can do it if the interior was designed from day 1 for robot assembly. Tesla tried and failed at this task. Maybe they succeed one day. Maybe.\n\nWhen building a factory you tend standardize on one brand and only a couple of robot models. Specifically so you have a low replacement parts inventory. Nobody is buying random shit from everywhere unless they are idiots. And some of my customers are idiots so it happens.\n\nAnd if robots are bad at one thing, it's repairing robots. Do not underestimate the difficulty and complexity of what we do. And so much of it is feel. You seem to think working on robots works like trouble codes on cars. Nope. Electrical failures are pretty rare. When a code happens, often the code is not the part itself, but a loose connection, broken wire in a harness, board fault, etc. Trouble codes are a starting point for complex troubleshooting. It's all the moving parts, fluid leaks, seals weeping, play here and there, noisy gearboxes. And the dexterity required to actually work on these systems is still what robots are bad at.\n\nDouble the number of parts in your robot, cube the number of failures. This is where pie in the sky dreaming bites you in the ass. 5x the complexity is 100x the failures and breakdowns. Just look at the complexity of that robot hand. And how shitty it will get as all the joints get sloppy. Humans get around this with automatic repair every night. It only takes a tiny amount of play before a robot gets real Angry. Proper robot end effectors ('hands') in a factory are the simplest most rugged single purpose things you can imagine. If you build a multifunction robot for production use all day every day it might have multiple end effectors and it does a swap to do different tasks. And usually that is designed to work far better than a hand at that one task.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "Humans get around this with automatic repair every night.\n\nIt's not just that. Humans self-calibrate extensively.\n\nHumans aren't built to the same spec at all - but most humans can perform the same tasks, because their brain adjusts against the capabilities and the performance of their bodies on the go. A human can lose a finger and still complete the same manual dexterity tasks, at a performance loss.\n\nNormally, that's not something industrial robots do. Androids aren't going to be normal industrial robots. Android AI is expected to adjust to changes in circumstances and handle faults.\n\nNobody is buying random shit from everywhere unless they are idiots. And some of my customers are idiots so it happens.\n\nThat's another strong point for general purpose androids. Because they enable your customers to be idiots.\n\nA manufacturing step that wasn't designed for automation from day zero? A human can handle it, so a general purpose android can too! Your product is made by 3 blokes in a shed, and you need to scale it up fast? Buy 100 androids and 30 sheds worth of factory floor, and sort the proper manufacturing out later (or never)!\n\nThere is an awful lot of value in general purpose, flexible robots - if they could be made. Until this point, they couldn't be made. Winds are changing though.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "The next 20 years will be interesting. That's for sure. With the information sharing of the internet and Ai chewing away at individual specific problems we are really headed towards that so called singularity moment where innovation advancement explodes and shoots to the moon.\n\nI am still a firm believer in simplicity solutions for the production environment. For small factory environments I have made mobile carts so they can take a (cobot) robot arm like a UR10, wheel it around and lock it onto a conveyor or a station and do a task. Flexible systems designed to be reprogrammed on the fly. And that does the job of being flexible and repurposed quickly. With 90% less parts and 10x less things to go wrong.\n\nHumans are still better and faster at these ever changing tasks. You can get a temp worker for $20/hr that does that low volume run. We use robots for the 3D's. Dirty, dangerous and dull jobs. Humans need jobs too. We mostly use automation to replace the awful jobs.",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This may not be the best place to ask, but I've always wondered: Why is making a humanoid robot so difficult? We have tons of data about the motion of walking, all kinds of sensors we can pack in to measure momentum and balance, tons of data about motors and pneumatics and their limitations, and computer chips that can process that data at unimaginable speed. Yet a 2-year-old toddler, with his proportionally oversized head, can more gracefully walk and run and navigate terrain and obstacles than the most advanced robots. Why?",
        "points": "4 points",
        "children": [
          {
            "comment": "Miniaturization, power density, and AI are the three big ones.\n\nPower density was by far the biggest stumbling block in the past, preventing most research into independent (i.e., untethered) robotics for a long time, as we just didn't have batteries that could provide enough power for a low enough weight and that lasted long enough. \n\nMiniaturization is related to the power point, in that we needed high-performance servos, motors, gears, gyroscopes, etc, that were small and light enough to work on something roughly human sized.\n\nOnce you had both those physical aspects solved, it basically came down to developing an AI that can combine walking, manipulating goods, dealing with multi-sensor stimuli, etc.\n\nThose are all individually pretty difficult problems to solve, and you can't build a humanoid robot that's really good for anything without all of them combined.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yet a 2-year-old toddler, with his proportionally oversized head, can more gracefully walk and run and navigate terrain and obstacles than the most advanced robots. Why?\n\nI'm not sure that's true anymore. Boston Dynamics' humanoid robot can basically do parkour.",
            "points": "3 points",
            "children": [
              {
                "comment": "Only when choreographed and trained for that routine. If you were to put any of those robots in front of a pile of random cushions, I doubt they could climb over it at all. A random 2-year-old would probably handle it easily.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "AI. The answer is AI. Has been for decades.\n\nMaking an android frame is something that could be done in the 90s, with contemporary tech. Making an \"android mind\"? A control system that's flexible and capable enough to make the entire android useful? That was absolutely impossible.\n\nWas impossible, back then. With the recent AI breakthroughs? We might be getting close now.",
            "points": "-2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Because you’re not just solving motion. You’re also solving choice. The machine has to make micro decisions all the time, using its onboard model of physics which includes knowledge about its own centre of gravity, speed, its appreciation of the terrain etc. There’s just a lot. It’s not just about traveling from point A to point B. We effortlessly do that but once you aren’t in a sanitised environment, we unconsciously decide how we navigate our environment, every step. The model would have to be fed with constant new information whenever it encounters new surfaces, new places, etc. Because afaik even BD robots aren’t capable of making the same kind of inferences we do (that looks dry, non-slippery) it just has to go for it and learn about it by experiencing. Robots are quite literal in the way they understand the world, there might be millions of different kinds of slippery surfaces, and you’ve probably guessed they’re slippery 90% correctly without needing to experience it for yourself, robots can’t do that. That said, you only have to teach it once so I can’t imagine many of BD’s robots are going to have problems in a vast majority of use cases",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Maybe they can build a cooling system that makes it to 100K now.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's impressive to see recent progress in this space. With recent progress in AI we're finally starting to see robots adapting to changing situations. Two minute papers has a good video on this trend.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I can't wait to see them slowly move parts from one bin to another and then stand there awkwardly as a human takes the parts from that bin and actually installs them xD",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can we PLEASE just get some friggin' robot maids to clean the damn house?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Mass starvation to follow. Don't worry, cleanup will be handled by robots. It's just about time to start putting the kabosh on privately owned wealth at the detriment of others.",
        "points": "3 points",
        "children": [
          {
            "comment": "Well we don't have enough houses in Canada to fit everyone plus the mass immigration levels.\n\nSo we'll just let 4% of the population starve and replace them with fresh immigrants. Perfect way to push down those useless wages.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "2. 1. Rednecks sabotage them godless demons!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My opinion on this is not well informed, but the company's age, and it's tech-bro CEO who talks like Elon Musk, make me wonder if this isn't so much vaporware.\n\nNothing in the article indicates how much these robots cost, how long they can work before they need to recharge, or that they've developed any competency at the tasks the company wants them to do.\n\nAgain, not well informed, but if the plant is already facing a labor shortage, maybe BMW just told these guys \"sure, let's bring your robots in for a trial run and see what happens\", and Figure is now trying to parlay that info further investment?",
        "points": "-1 points",
        "children": [
          {
            "comment": "This is absolutely vaporware.",
            "points": "-2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I just saw an article about how in the US, BMW is the 3rd highest brand for production defects. Hopefully robots will help make them better, safer cars.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "BMW NA LLC and their contracted work.\n\nI worked as a Parts Analysist for the Warranty Parts Return Center (WPRC) in Nazareth PA. THE ONLY PLACE ANY BMW WARRANTY PART IS SENT (after repair) form the North American market, and when THEY refused to hire us as BMW employees (Nearing the end of a 5 year contracted worker agreement, entire place was \"contracted\"), but rather opted to continue \"Contracted Workers\" I saw the writing on the wall. By the time the \"New 5 year contract\" was settled. I had already found a job and left, but the ones left behind were either completely cut, or had to take a hefty pay cut.\n\nThis move from BMW / BMW NA LLC does not surprise me. If you work for BMW NA LLC in any capacity, I would say that it would be prudent to make sure you resume is at least current and up to date. Stay well, and best of luck in providing for your families and yourselves out there.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wow BMW's are made in South Carolina? That really kind of defeats the whole German engineering appeal.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19ajjve",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://www.theguardian.com/environment/2024/jan/13/human-behavioural-crisis-at-root-of-climate-breakdown-say-scientists",
    "title": "Human ‘behavioural crisis’ at root of climate breakdown, say scientists",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/BothManufacturer1307:\n\nHow do WE collectively join together to fix something (climate change) that WE collectively created?\n\n\"People are the victims -- we have been exploited to the point we are in crisis. These tools are being used to drive us to extinction,\" - Phoebe Barnard (evolutionary behavioral ecologist and study co-author)\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19ajjve/human_behavioural_crisis_at_root_of_climate/kil6bt7/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Maybe we don't have hundreds of rich people fly on private Jets to a summit? Maybe we start actually targeting the sources instead of things with negligible effects like plastic straws?",
        "points": "487 points",
        "children": [
          {
            "comment": "Idk man there's A LOT of straws out there. /s",
            "points": "94 points",
            "children": [
              {
                "comment": "👏 TURTLES 👏 NEED 👏 COCAINE 👏 TOO 👏\n\nIdk man, the more the rich blame us for this shit the more I start to agree with the EAT THE RICH people which is something I never ever thought I'd say.",
                "points": "113 points",
                "children": [
                  {
                    "comment": "The threat is as strong as the execution. Radical yes, but they need a power check so badly. They \"forgot\" that we make their businesses run.",
                    "points": "40 points",
                    "children": [
                      {
                        "comment": "Did you mean our businesses?",
                        "points": "18 points",
                        "children": [
                          {
                            "comment": "Well it should be yes.",
                            "points": "6 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "Internationale is intensifying.",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "We watch you while you sleep.",
                        "points": "-1 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Welcome brother, fuck the elite.",
                    "points": "17 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Yeah like we could ban ALL single use plastics. Get your retournable glassware. Go back to the store and simply give it back to the store. I mean thats how it used to be.\n\nThe. The company will take their empty containers on their way back after supplying the stores. It really isnt anything new.\n\nA million things could also be packaged in waxed paper, like soap. The Tide Pods for example. Cheese, and fish or meat at the supermarket.\n\nMost thinks only have to survive from the supermarket to your house. All those stupid styrofoam plates, plastic wrappings etc are ridiculous.\n\nTetrapack is also significantly better than 1 gallon jugs. Perhaps they can find a way to replace the thin plastic layer that tetrapack has with some kind of cover that lasts at least until the content has expired. At which point the container becomes soggy and breaks up.\n\nForce ALL industry to install solar panels, and larger companies to use only electric delivery cars. Like we should all be forcing Amazon, alibaba, dominos etc to use only electric cars.\n\nOf course we could also just use biodegradable futuristic materials made of algae or something.\n\nAll Im saying is that we have both new and old technology that could work.",
                "points": "18 points",
                "children": [
                  {
                    "comment": "Dry soap is the future. So much cheaper, no plastic whatsoever, no transportation weight. We should have powdered shampoo and body wash.\n\nhttps://www.amazon.com/dp/B09SFHK2D8/ref=sns_myd_detail_page?sbo=GLaw0Fx56FiNH%2FiZ%2B6XKiQ%3D%3D&th=1",
                    "points": "",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I can't make straws. Who is making all those straws?",
                "points": "2 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Plenty to grasp at, that’s for sure. It’s almost too perfect that the misdirection for the climate crisis was aimed at straws… like the wealthy were literally grasping for straws.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The rich are a problem, no question, but the rich are also a problem in that everyone is in a struggle to join them.\n\nThe underlying problem with the rich and non-rich is that consumption is what we all aspire to do - work hard to get a bigger house/apartment, buy a nicer car, a bigger TV, a new iPhone, weekend in Vegas or a trip to Europe. We don't find happiness in a walk in the woods and a nice sunset - something that everyone, rich and poor, can enjoy equally - we seek out things that are limited such that we can show our status. Just as the rich show off by flying to Davos, the less rich go see Taylor Swift, or buy something fashionable. It's all the same phenomenon, just that some can do it on a larger scale than others, but almost everyone aspires to the same process, and the other 7 billion of us of lesser means make up for it in volume.\n\nThe plastic straws aren't negligible on the scale they are used. Eating out is an aspiration. Fast food is a convenience where we trade time for pollution. That most of the planet is completely unaware of that in their decision making is the problem.",
            "points": "30 points",
            "children": [
              {
                "comment": "It feels a bit doomer to say that all human desire for materials is limitless and natural when a lot of consumer researchers agree that cultural and societal factors are bigger influences on consumption. Like there are other cultures that are less focused on that type of stuff, even a lot of folks in the US and Europe reject living like that.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I guess the best and biggest legislation no one is talking about that would do wonders for the world would be to forbid planned obsolescence in general",
            "points": "4 points",
            "children": [
              {
                "comment": "Should be prison terms for planet wreckers like that. All private jets need to be crushed, the 1% go on same cramped planes as everyone else (including monarchs)",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The largest climate change legislation in U.S. history was passed a little over a year ago by the Biden administration. I think a bit more than plastic straws (which is meant more from a microplastics pollution issue than climate change) is being done.\n\nConsumption/waste is our biggest issue and there doesn’t seem to be any efforts to address this outside of limiting the burning of fossils fuels, but still consuming vast quantities of energy via other means.\n\nThe U.S.’ addiction to SUVs and Pickups (even in EV format) is a great example of this waste.",
            "points": "33 points",
            "children": [
              {
                "comment": "We need a carbon tax large enough that it will significantly change behavior and force major changes in the economy. Like gas prices should be high enough that people actively seek more fuel efficient vehicles and/or move closer to work and/or walk/bike to work. Prices for goods and produce shipped from halfway around the world, once the carbon costs for transportation are factored in, should be more significantly more expensive than locally sourced stuff.\n\nBut that will piss off a helluva lot of people, so no politician will come close. At this point in time we cannot adequately address the climate crisis without disrupting everything.",
                "points": "13 points",
                "children": [
                  {
                    "comment": "Here in Canada public perception is changing about our carbon tax and now the majority of people somehow blame it for every economic woe we're experiencing, and it's likely the next government (who is currently using it as a scapegoat) is going to get rid of it.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Any carbon tax that is large enough to significantly change behaviour will be voted out by the next administrative that is voted in",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "It's a knife-edge.\n\nDoes the Biden administration push some unpopular but necessary policies to start tackling climate change, but at the risk of pissing off the general populace and giving Trump the opportunity to get back into the White House?\n\nOr do they go down a more subtle, softly-softly approach, which, albeit addresses climate change much more slowly, helps to keep the Dems in power a bit longer and therefore in the driving seat to actually be able to address some of these things for longer?",
                "points": "4 points",
                "children": [
                  {
                    "comment": "It’s also…not subtle. It’s bold, elegant even. It looks at the consumption culture and says “ok, instead of fighting the uphill battle to change this and probably lose, how can we use it to our advantage?”\n\nIt takes the behavior (consumption, capitalism) and uses it to snowball change. The incentives drive down the prices enough for certain items (ev’s, induction cooktops, heat pumps, whatever) just enough to increase demand. It starts a positive feedback loop (aided further by competition) that drives the prices lower until, eventually, the item in question dominates market share. And everyone’s happy because they got a better product for cheaper.\n\nAnd because the policy gives so much $$$ to red states (arguably too much) the next admin is going to have a hard time repealing it.\n\nWill unpopular decisions need to be made? Of course. But it makes perfect sense to start with the popular ones, especially given how much carbon is generated by Americans due to travel and home energy alone. You’re beginning to cut out a big slice of the pie right there.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "The focus on EVs is idiotic at worst, naive at best. The US doesn't have the electrical infrastructure to accommodate the wide adaptation we're trying to encourage. Further, places with inclement weather are finding out that rechargeable batteries don't like the cold and there's not enough chargers to go around.\n\nThe legislation passed is toothless. It's going to have a minimal effect and basically be ignored, which is fairly typical.\n\nI will agree on consumption and waste. We need to start punishing manufacturers like Apple and Dell especially for soldering parts unnecessarily to boards. Not only does it make the devices ewaste and irreparable in the event of a part failure, it means the devices are less likely to be retained as they're not upgradeable. Further with Apple locking authentic parts behind software acceptance so even a real part will fail unless the right person puts it in is just exacerbating things. Those are places to start. The EU forcing all manufacturers to switch to a single charger type is exactly what should be emulated in the US.",
                "points": "17 points",
                "children": [
                  {
                    "comment": "Apple & the US Government have a strategic partnership. So, unfortunately, this won't change anytime soon =(.\n\nEdit - EU has to keep forcing these regulations - as that is the only way that they will make their way into the US.",
                    "points": "12 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I disagree on the EV side. You’re correct that investments need to be made to enhance the grid, but that also relates to the investment in solar/wind generation as part of the legislation. It’s a net positive towards the decrease in C02 production, which we’re already seeing.\n\nLegislation and funding is the only way we’re going to change behaviors. Corporations don’t typically do what’s right for society, but what’s right for their short term bottom line. I’m hoping that at some point in the future, we develop a waste tax that funds more green energy. Want to burn a lot of gasoline for your big pickup, or natural gas for your non-solar home? Cool, here’s a C02 waste surcharge at the pump or energy bill to fund more renewable power to offset your waste.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Corporations don’t ever do the greater good unless their hand is forced by a larger entity either the government or a union (keep dreaming if you think boycotts effect anything anymore). You only need to trace the history of child labor or the need for OSHA to realize that.",
                        "points": "5 points",
                        "children": [
                          {
                            "comment": "Your power company doesn't have to think about the greater good when it comes to EVs. They get paid for power. It's in their best interest to be able to provide it to users. In my neighborhood people are installing ACs and getting electric cars left and right. Big increase in power consumption and thus payments to the power company. The power company is upgrading the lines down the street. Turns out when you pay them, they like that.",
                            "points": "-1 points",
                            "children": [
                              {
                                "comment": "I agree and disagree. Those neighbors are buying ev because the government subsidized making them cheaper and more available. For my city and state they have put down a lot of regulation about how much of our power must be renewable and because this state is blessed with an ocean and a lot of mountains the hydropower alone (not counting solar and wind) makes clean energy much more attainable but they still needed the push. I can also choose to use 100% clean energy by simply opting for that plan with my local power company which I do. Again it’s a mix of personal choices and group choices.",
                                "points": "1 point",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The richest 1% emit more than 66% of the rest of the population of the planet. It's clear where the problem is.\n\nhttps://www.oxfam.org/en/press-releases/richest-1-emit-much-planet-heating-pollution-two-thirds-humanity#:~:text=The%20richest%201%20percent%20of,a%20new%20Oxfam%20report%20today.",
            "points": "9 points",
            "children": [
              {
                "comment": "If you warn more than $60,000 a year and don't have kids, you're in the global 1%. It's really funny how the people living in rich developed countries think they aren't rich, \"No no, the rich people like me aren't the problem, it's the ultra rich!\"",
                "points": "2 points",
                "children": [
                  {
                    "comment": "You need to stop getting statistical data from Vox. 😜\n\nThe top 1% globally earn over $1 million annually.\n\nThe top 10% globally earn over $100,000 annually. Many of us Westerners fall into this category.\n\nhttps://www.zippia.com/advice/average-income-worldwide/\n\nReferences and links to data are provided at the bottom of that page for transparency and verification.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yea, I hear you but, have you poors tried to consume more of our more expensive compostable packaged goods??\n\nIt’s like when we are told to use water sparingly while allowing corporate farms to continue growing non native and extremely water intensive crops for export in the middle of a drought.",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Davos man disagrees.\n\nThose are very important people, how to you expect them to save you if they cannot do things you are not allowed to do? /sarscam",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "That and the empty jets",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This is exactly the scientist's point. It's really really easy to blame anyone other than ourselves. You'll notice it from the top comment on every single futurology post including this one.",
            "points": "9 points",
            "children": [
              {
                "comment": "Ok, but.\n\nMy carbon footprint for my entire life is basically a blip compared to the people flying on private jets. Like. Their impact is the meteor that killed the dinosaurs and mine is a cow ripping ass. It's not me passing the buck and blaming them. It's me acknowledging that even if every american changed their ways, their actions wouldn't even have a notable effect due to corporations and the rich refusing to change theirs.",
                "points": "7 points",
                "children": [
                  {
                    "comment": "No single raindrop feels responsible for the flood.",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "I better sell my gas truck, quit going on jet setting vacays and put LEDs in my guesthouse.\n\nOh wait. I don't have or do any of those things.\n\nHope my reusable plastic bags help.",
                        "points": "8 points",
                        "children": [
                          {
                            "comment": "https://www3.epa.gov/carbon-footprint-calculator/",
                            "points": "-3 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "At some point the only thing left for an individual to do, in order to reduce their carbon footprint, is to unalive themselves. At what point, if any, should we turn our attention to systemic issues, economics, and/or politics instead?",
                        "points": "5 points",
                        "children": [
                          {
                            "comment": "systemic issues, economics, and/or politics\n\nAll ways of describing how you deal with POPULATIONS. Consisting of individual human behaviors. Like you and me.",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "We're not all raindrops, though. 1% of us are swimming pools.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "https://www3.epa.gov/carbon-footprint-calculator/\n\nFeel free to see where you stand in the world",
                            "points": "-3 points",
                            "children": [
                              {
                                "comment": "I don't even have a car, man, don't compare me to Taylor Swift.\n\nWhat point were you trying to make? We're all equally responsible? We're not. That's a fact, its not up for debate.",
                                "points": "6 points",
                                "children": [
                                  {
                                    "comment": "My best guess is that they want to make out with rich people's buttholes",
                                    "points": "-1 points",
                                    "children": [
                                      {
                                        "comment": "The point is that the worst part of our environmental crisis is that it is really hard to see how people's individual contributions affect the outcome. But they do, and it is necessary for the 8,100,000,000 people on this planet to change instead of doing nothing and only blaming the 100,000 you by sheer surprise coincidence happen to already hate. Especially when you're commenting on an article telling you exactly what I'm saying.",
                                        "points": "3 points",
                                        "children": [
                                          {
                                            "comment": "LOL I was talking about you, not TO you. No interest in your opinions. I'd just ask some rich asshole what it wants the simps to say if I really wanted to know",
                                            "points": "0 points",
                                            "children": [],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              },
                              {
                                "comment": "",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The whole 'rich people flying jets' is just another diversionary concept along with all the others. We will grasp on to anything so long as it means we, as individuals, don't need to consume less.\n\nRight wing diversionary concepts:\n\nClimate change is fake\nClimate change is real, but humans are having a negligible impact\nTechnology will solve climate change\n\nLeft wing diversionary concepts:\n\n70% of carbon emissions are caused by just 100 companies\nRich people have an outsized carbon footprint and the rest of us have a negligible impact\nWe need structural changes to the world economy and an end to political stratification before we can deal with climate change\n\nIn reality, we either consume less via our own volition or the breakdown of earth's systems and subsequent effects of society will force us to consume less. We don't have enough time to wait for structural change and technology will only solve climate change IF we put a price on carbon (ie. carbon tax).",
            "points": "10 points",
            "children": [
              {
                "comment": "I don’t think it’s meaningless to reduce your own footprint. Certainly I strive to do so in as many little ways as I can but I do think the point is it’s approaching meaningless for me to go native and emit 0 carbons all my life and have that entire life emissions zeroed out by one day of emissions from some corporate factory etc etc. obviously I’m being slightly hyperbolic here but you get the gist. The problem is both individual and collective. It’s just as meaningless to say we all individually need to reduce emissions without holding businesses accountable too especially as here in the US corporations are people too.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I'm curious what an actual carbon tax looks like in contemporary society. How does it not just become something that disproportionately affects the lower classes trying to get by, and another modern inconvenience fee for the wealthy. I feel like whatever the implementation is, rich people are very well insulated and can continue their current levels of consumption. Poor people will be pushed into further austerity, and more people on the margins could be pushed into poverty or homelessness. Or for a less extreme example, let's say now there's a $100 per plane ticket carbon tax. Rich people just pay it and go about their plans. A middle class person might say, \"Oh well, it's not worth it. I just won't visit my family this year.\" I know we have to do something, but taxation feels like it will simply punish those who don't have money.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I think we should do both.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "If you ban straws, you can't have the last straws toppling the bucket and have climate change destroying the planet /s",
            "points": "-2 points",
            "children": [
              {
                "comment": "Paper straws work fine if you're done drinking in 60 seconds.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "hold big business and the governments accountable.\n\nThere are 100 companies responsible for 71% of global emissions. The companies should be heavily regulated and restricted with government subsidies so the population doesn’t feel the difference.",
        "points": "276 points",
        "children": [
          {
            "comment": "The study you’re referencing looks at who was producing the fossil fuel, rather than who was emitting the CO2. So those 100 companies are companies like Exxon Mobil, and when you drive your car with the gasoline they produce you’re part of the 71%.\n\nWe could absolutely regulate and restrict them: that was the point of the study, that it’s easier to regulate 100 companies than billions of downstream consumers. But the population would absolutely feel the difference, because all the fossil fuel-based things we enjoy would increase in price or become harder to find.\n\nThe study: https://cdn.cdp.net/cdp-production/cms/reports/documents/000/002/327/original/Carbon-Majors-Report-2017.pdf?1501833772",
            "points": "33 points",
            "children": [
              {
                "comment": "And that is exactly where city design comes into play.\n\nOne bus can carry many people, calm traffic by taking over 20 cars off the road, and reduce emissions if they're electric.\n\nLocal elections can literally influence climate policy as you can vote for bylaws around construction and for your city to put more money into public transportation. Cities should be designed for people, not cars.\n\nWe need more 15 minute cities. Valuable space is being wasted by building massive highways and parking space.",
                "points": "13 points",
                "children": [
                  {
                    "comment": "Problem with that is you got the Koch brothers 20 year campaign to demonize public transport as dirty and unsafe and they have been hugely successful.",
                    "points": "6 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I'm not going to make claims about people moving around being the biggest problem, but it is an area where we can make huge gains.\n\nMaybe companies should either be encouraged to find employees close to their base of operations or forced to increase work from home opportunities. Tax companies for employee travel distance. Make non-EV cars more sober: Only available in dirty brown color, lacking luxury options. \"Want AC? Sorry, that's only available in our EV model.\"",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "the US government has billions of dollars to subsidize other things, they can reallocate that spending to subsidize fossil fuels.",
                "points": "-2 points",
                "children": [
                  {
                    "comment": "That’s circular. If you regulate Exxon (say with a heavy tax on each barrel of oil) and then subsidize the gasoline they sell, you end up in exactly the same spot with exactly the same amount of emissions.",
                    "points": "13 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "But when business is in bed with the government and the agencies responsible for oversight are either toothless, or full of former employees of the same businesses that they are supposed to be investigating… who watches the watchmen?",
            "points": "20 points",
            "children": [
              {
                "comment": "We fucking do!",
                "points": "1 point",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Those 100 companies are providing crap that we all collectively use, though. Companies don't exist without consumers of their products. There's definitely room in all corporations to do better, pollute less, etc. But an energy company is going to be a massive producer of emissions until we get enough renewables and batteries online to replace burning dinosaurs. But honestly, even then there is going to be large emissions in making panels, batteries and footings for wind generators.",
            "points": "16 points",
            "children": [
              {
                "comment": "This is true but it's not like everything that exists needs to. Look at shit like LOLDOLLS that's just piles of single use plastic designed to exploit children's lack of impulse control to annoy their parents into buying over priced plastic shit no one needs.\n\nThe problem is most people's mentality of \"I have the freedom to do whatever the fuck I want consequences be damned\".\n\n\"Sorry literally everyone on the planet is riddled with microplatics at the cellar level but my freedom of blind consumption is more important than a functioning ecosystem and life worth living.\"",
                "points": "15 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "The problem is a lot of the times theres no choice as a consumer. If you want to buy something its normally been shipped overseas from China rather than manufactured locally.\n\nYou need the government to incentivise bringing local manufacturing back.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "But honestly, even then there is going to be large emissions in making panels, batteries and footings for wind generators.\n\nThese processes themselves need to be electrified from cradle to grave.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "We do don't we? \n\nIsn't everyone else just shopping second hand, buying only when they need to, shunning fast food and reducing their meat intake. Only driving where they need to, and being mindful to reduce unnecessary journeys, or carpooling where they can. \n\nWho isn't doing these very obvious, and relatively simple things, to hold companies to account by reducing the amount of money they give to the companies?",
            "points": "16 points",
            "children": [
              {
                "comment": "who isn’t doing these things\n\nthe vast majority of people, obviously. and the vast majority never will, which is why asking this question is just moral posturing. corporations manufacture our desires, they have influence into every second of the peoples’ thought processes. how the fuck else do you end up with tiktok and spray cheeses, nobody ever asked for that shit.\n\nwhen you complain about this issue, but put the culpability on the side of the people, you’re just circlejerking. trying to feel better than all of the people who you think “aren’t doing enough” while spending no effort into finding a real solution that would actually do anything within the confines of how humans actually act.",
                "points": "13 points",
                "children": [
                  {
                    "comment": "corporations manufacture our desires\n\nCorporations create your desires through marketing and advertising.\n\nMajority of the stuff we consume, we would never have thought we ever needed or wanted. Home Shopping Network and late night infomercials are a prime example.",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "That’s exactly what he just said.",
                        "points": "4 points",
                        "children": [
                          {
                            "comment": "I inferred he was using the word manufacture to mean produce (e.g. they only manufacture what we want) not generate (e.g. they create new things that we don't want or need, then make us believe we do).",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "Ahh gotcha, yes you are correct though. I just inferred your meaning from his point and thought you were trying to counter it with the same idea.",
                                "points": "1 point",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "This is the pull yourself up by the bootstraps of climate change talking points. People respond to the environment they are given, we have a deep cultural rot stemming from the our world become consumed by corporations. They are not designing a world in good faith they are designing a world (already really have designed to be honest) that preys on your legitimate biochemical makeup and responses. You know why abstinent only sex education doesn’t work? Because your telling people not do something their body is quite literally chemically compelling them to attempt to do (not everyone of course but on average)it’s like pulling starving people into a room full of jelly doughnuts and telling them don’t eat these because they’re bad for you. We need legitimate cultural and societal reform at a fundamental level to stop any of this. Going vegan and dunking on your in-laws at thanksgiving because they’re “umm actually hurting the environment by eating this turkey way more then you are ever” is antithetical to any hope of real change.",
                "points": "16 points",
                "children": [
                  {
                    "comment": "Simply put I can try to save, but will in effect only help reduce demands which are are by the expectations of our culture. If I don't eat meat, someone else will pay less and eat more. If I reuse everything with my freetime someone else will not and I culturally pay, because I compete with others for social belonging against a life style corporations are selling everyone.\n\nI can piss into the wind all I want and only come up short. I still try my best. But we live in a world of hedonistic self indulgence we are programmed to want through marketing.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "But insisting on keeping our patterns of behavior the same while vaguely pointing at \"corporations and billionaires\" to be stopped will also lead to no change.\n\nThere need to be top-down changes of legislation, but these won't happen without a wide political movement to push for them, which won't materialize if people keep insisting the climate is someone else's problem.",
                    "points": "7 points",
                    "children": [
                      {
                        "comment": "I’m not saying our patterns stay the same just pointing out that trying to tell people to stop doing xyz thing isn’t going to be what actually works. Creating structure to support the behavior needs to exist first. You want people to stop eating meat, provide them with bountiful alternatives that are accessible affordable and workable. In order for that to stop happening the government would have to literally throw down with the meat industry, and yeah that’s what has to happen. While we can tell people over and over again to do xyz and the world can still provide them with the other thing in over abundance to the point that for some people at least here in the states legitimately can not consider switching to healthier eating habits that impact the environment less because the environment around them does not provide them with that opportunity. Which ofc is the end goal of all corporations, limit our options to only them. Which is why before we start yelling at people to ride bikes every where instead of driving we need to get corporations controlled and their influence largely removed from society.I’m not saying don’t do the better things for the environment if you can, ofc do them. But that at its core this strategy is not going to work.",
                        "points": "8 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "if 100 companies are producing 71% of the emissions your efforts are futile.",
                "points": "28 points",
                "children": [
                  {
                    "comment": "That 100 company study included most of the world's largest energy producers, and considered the resultant emissions from goods produced from their outputs to belong to those companies.\n\nIn other words, if people consume less energy and buy less shit, that 71% would drop. People make the mistake of thinking they don't contribute to that 71%.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I think what they're saying is these companies can't make money off of us if we don't continue to indulge in their products. We have to make better choices about who we spend money with. We are responsible too.\n\nThat doesn't mean companies shouldn't also be held responsible, it just means to be aware of yourself too and be able to recognize how our choices have an impact.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Just please understand that when we do regulate these companies, it's going to have a huge impact on our lifestyles anyway. People make it seem like our individual efforts make no difference, but what you're calling for will have to change our behavior Just the same. I don't think it's a bad thing, I think it's what needs to happen. But it will require crippling supply chains and making everything we consume way more expensive. To the point we have to repair things rather than buy new ones, from phones, to clothes, to Cars etc.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "The point he is referring to is that companies supply what people demand. Even if we regulate companies, if everyone in the world had the same consumption pattern as USA citizens, for example, the world would have ended.\n\nBoth are true, companies are responsible for that AND we have to change our consumption patterns to be more sustainable.",
                    "points": "26 points",
                    "children": [
                      {
                        "comment": "The point he is referring to is that companies supply what people demand. Even if we regulate companies, if everyone in the world had the same consumption pattern as USA citizens, for example, the world would have ended.\n\nNot always true. Simple example, T-Shirts and Socks.\n\nI used to buy a package of socks or a 3-pk of T-Shirts, Fruit of the Loom or Haines, for a decent chunk of change. They were thick, they were quality, and they lasted a long time. Years even.\n\nThat same company decided it was cheaper to manufacturer in China. Now that same package of socks or 3-pk of T-Shirts is super thin, low quality, and may only last months before I need to throw them out, and replace with new. Yes, the price is lower than it used to be, but the quality is much lower.\n\nI would much rather pay more money for better quality, but the company does not want to supply that. Instead they supply what creates the most profit, whatever the environmental impact.\n\nWhat is worse, one company ends up buying up all the brands which eliminates any competition meaning as a consumer, who needs socks and shirts, I have no choice.",
                        "points": "8 points",
                        "children": [
                          {
                            "comment": "Yes exactly, but did you continue to buy their products after recognizing the issue?\n\nIf no, you are doing your part.\n\nIf yes, you are the problem.\n\nAnd until all the people collectively agree that the brand you're talking about has changed and is no longer worth the money, that company will never change anything.",
                            "points": "4 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "You're telling me there aren't other options because I can spend three seconds on amazon and show you how there are plenty of other options.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "You'd be surprised where they are made. Likely the same factory in China.",
                                "points": "1 point",
                                "children": [
                                  {
                                    "comment": "https://www.inthefashionjungle.com/underwear-manufacturers-usa/\n\nhttps://mackweldon.com/pages/underwear-quality1\n\nhttps://understance.com/\n\nhttps://www.pietrastudio.com/l/finding-clothing-manufacturers\n\nhttps://wheredotheymakeit.com/underwear-made-in-the-usa/\n\nhttps://www.panaprium.com/blogs/i/usa-made-underwear",
                                    "points": "0 points",
                                    "children": [
                                      {
                                        "comment": "I mean, $32 for a single pair of underwear is a little more rich than I.",
                                        "points": "",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "I concur, you are so absolutely correct! Unfortunately I’m trapped in this “jacked up society” and although I am a firm believer in the concept of “Recycle, Repurpose & Reuse” not everyone around me understands. A quote I heard “if YOU are not part of the solution… YOU are part of the problem” fits.",
                        "points": "4 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "companies supply what people demand\n\nDo they? Then I wonder why Amazon throws away millions of dollars of goods that no one wanted, and why grocery stores have dumpsters of expired food guarded by police to prevent people from getting food they desperately need if they can’t profit from it?",
                        "points": "15 points",
                        "children": [
                          {
                            "comment": "You're cherry picking. Lots of companies produce waste, but lots of companies have programs to mitigate this issue.\n\nYes, a majority of the problem is obviously from companies and their negligence. But those arguing that it's all up to companies and the government to fix our issues is literally why we are in the state we are in.\n\nToo many people are selfish. We play a role here, maybe not as big, but it's still every part as important. 29% isn't a small number.",
                            "points": "8 points",
                            "children": [
                              {
                                "comment": "Yes I’m cherry picking - are you asking me to list every single company and every single way that they create waste that no one asked for? I was describing some of the most egregious examples.\n\nYes there are things individuals can do to reduce their own footprint (a term made up by oil companies to deflect responsibility), but as long as the system remains unchanged your individual actions are going to have virtually no impact on global emissions.\n\nmaybe too many people are selfish\n\nMaybe too many people have no other choice, have corporate propaganda pushed at them to hide the impact of their decisions, and have colourful delicious marketing shoved in their face all the time to encourage them to make those choices.\n\nAll of those things we can control with legislation. Not everyone has the education, knowledge or ability to make the best choices for the planet, especially if those aren’t the best choices for themselves as an individual.",
                                "points": "0 points",
                                "children": [
                                  {
                                    "comment": "People can be really wasteful and selfish",
                                    "points": "-1 points",
                                    "children": [
                                      {
                                        "comment": "No one said otherwise. However corporations have a fiduciary duty to be selfish and wasteful if it maximizes profit, and have an outsized influence on how selfish and wasteful our society as a whole is",
                                        "points": "0 points",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "I understand why you chose Amazon. But it's not the best example for supply and demand as they don't produce or buy all of the product that's sold on their site. It's a more complex issue than just typical supply and demand like you see at a grocery store for milk or eggs. Amazon is definitely wasteful and those poor practices should have a spot light put on them. I agree it's an issue.\n\nMy point being, legislation alone may not be enough if individuals don't also actively engage in the issues they're seeking to fix. The people are the ones who make these legislations happen by voting representatives into office. If they aren't educated and don't see the purpose, like you or me who are willing to put thought into this stuff, then you're right, our efforts won't matter. Legislation can't get passed without the support of the people. People have to be informed to make those decisions. So it's important to paint the whole picture when we can and not make broad statements when there's a complex system at play. It doesn't accurately represent the issues we are seeing.",
                                    "points": "-1 points",
                                    "children": [
                                      {
                                        "comment": "One Amazon warehouse reportedly throws out 130,000 products a week, including some that are brand new. An expert blames its giant third-party retail business.\n\nI pointed to Amazon specifically because their business model relies on over producing goods that no one wants and throwing away stuff no one bought, because that model maximizes their profit.\n\nYes there are other examples, but the amount of waste cause by Amazon and its business model is egregious.\n\nlegislation may not be enough\n\nLegislation can go a long way in regulating waste and emissions. The government can also regulate advertisement of harmful products, levy penalties and fines for misinformation or failure to adhere to environmental regulations, and conduct public education campaigns to better educate the public to make better choices.\n\nA very obvious example would be to limit advertising on meat products, and running a public education campaigns on the personal benefits of a high veggie diet, or subsidizing plant based proteins. Run advertising that makes beans look as sexy and delicious as a Big Mac to destigmatize plant proteins.\n\nOr limit advertising for monster trucks, invest in public transportation and walkable cities, and public education on the benefits of walkable neighbourhoods for small business.\n\nIf you let corporations control the regulatory environment and narrative, what you get is a society that runs for the benefit of corporations. We could instead structure our society for the benefit of people, and are choosing not to.\n\nMake the right choice the easy and appealing choice, and people will choose better.",
                                        "points": "2 points",
                                        "children": [
                                          {
                                            "comment": "",
                                            "points": "",
                                            "children": [],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I understand your frustration but companies only make money if we give it to them.",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "That's a collective action problem that's fundamentally unsolvable. Regulation is the only way to get people to work together to produce a solution, because they will not give it up individually to be at a competitive disadvantage to their peers. Businesses know that, that's why they always push individual 'solutions', because they don't really want the problem solved.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Fucking THANK YOU!!!\n\nI’m so sick of the onus being shifted to us over the companies turning everything into cheap, mass produced, disposable bullshit that ends up in a landfill",
                    "points": "10 points",
                    "children": [
                      {
                        "comment": "I agree with people that we should be more sustainable but at the end of the day the government is supposed to regulate these companies. They cant because they’re bought out.",
                        "points": "10 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "You didn’t make some genius realization here. It’s mostly but not entirely on corporations. Your “fucking THANK YOU!!!” is extremely naive / oversimplified.\n\nThere are basically no protests, riots, etc NOTHING in the US against corporate greed or consumerism or the actively collapsing environment or really anything. People just drive their fat selves around in their gas trucks to pick up fast food with their child abuse level fat kids then go buy trash nobody ever needs at target walmart amazon. After the rush of buying it it’s rarely used again because it’s about the buying not the having.\n\nIf all of a sudden one day people could no longer buy all the unessessary US consumerism trash the rest of the world is slaving and being annihilated to produce, there would be FULL SCALE ARMED RIOT IN THE STREETS TOMORROW. If this was even a new law being announced to come in to effect over time, same result. Absolute bedlam. But it’s 0% “our” fault? fUcKiNg ThAnK you 🎪",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "The fuck are we supposed to do? The corporatists have the fucking military and police on their sides, as well as total control of the geopolitical landscape. When we try to protest them, we get cracked down on, violently. I’d love to see a full blown revolution against the structure more than anybody. But the painful reality is, nobody wants to be the first one to get shot for their cause",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "Overall? Nothing will happen until people are so desperate they go violently revolt and die. That’s a ways off and will most likely be futile anyways. Regardless it’s already too late to avoid civilization crumbling global heating and the fascism starting in under a year in the US followed by global totalitarianism. Voting is a sham but still half of people vote for straight up fascism and rewriting the constitution to benefit nobody but the ruling .1% and corporations, so yes I guess go vote non-fascist democrat even the they’re still total corporate shills and mostly pieces of hypocritical shit.\n\nBut you’re talking about 100 companies causing 71% of emissions. The vast majority of those emissions are from manufacturing and moving shit the masses buy and don’t need, over and over. My only point is don’t go saying the masses have NOTHING to do with it, especially in such a ridiculously arrogant way. The fastest most surefire way to get the masses to revolt is by taking away the pointless consumerism trash that causes this 71% by 100 companies.",
                                "points": "1 point",
                                "children": [
                                  {
                                    "comment": "We didn’t ask them to turn fucking everything they sell us into cheap disposable plastic trash. Nobody asked for cars that will only last 5 years, or phones that burn out by design. What, exactly, do you expect me, the individual, to do that I haven’t already tried? My actions across an entire lifetime get offset in like a minute of corporate emissions.",
                                    "points": "-1 points",
                                    "children": [
                                      {
                                        "comment": "",
                                        "points": "",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "The thing is we won't fix the problem and keep this world liveable for 8 billion + people, if we don't ALL drastically change our way of life. Ofcourse the big companies polluting the most, have got to step up massively and finally take responsibility. But let's say those 100 companies stopped emitting tomorrow, yet everyday people would continue overconsuming and maintaining their unsustainable lifestyle.. we still wouldn't be in the clear by a long shot.\n\nCO2 in the atmosphere is cumulative, so unless we get to zero it's only going to get worse. When you realize we're well on track to overshoot the +2°C of warming and set off tipping points, you'd see why it's very urgent and very important that everyone does their part the best they can. Or else the second half of the century will be catastrophic. And I haven't even mentioned the criminal damage we do to the ecosystem besides the fossil fuels, that makes the problem even worse. The whole mindset of (for example) \"why shouldn't I take a plane, when there's people on private jets\", is setting us all up for failure. Human selfishness and greed is our biggest enemy in this",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "We would have 3x+ the amount of time if those 100 companies stopped tomorrow.\n\nYou’re trying to shift the responsibility onto normal hardworking people. “Recycle your plastic” and most of the plastic goes into the landfill anyway.\n\nI don’t care. I’m not living a restricted life so that large multinational corporations can profit unrestricted.",
                        "points": "-1 points",
                        "children": [
                          {
                            "comment": "You haven't read my response correctly than. Ofcourse the majority of the blame is on those companies. I am not, and will never, defend those companies. But you need to see the bigger picture if we want to solve this. A lot of their pollution also comes down to the demand from the general public. I'm not shifting blame, I want the world to still be habitable and have enough food when I retire. Your mindset is exactly why there's no hope for humanity left, we'll just keep op consuming till the wheels fall off. You choose short term profit/status quo over mid-long term saving of the planet, and are proud of it... appaling human being",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yea, start by regulating the behavior of billionaires, that would be much effective but of course they want to blame the peasants",
            "points": "3 points",
            "children": [
              {
                "comment": "Ban private jets and yachts, force the rich to fly/float commercial. Watch how fast the climate is no longer that big of a concern.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Our habits and modes are dictated by them, they are not our choice, they are a necessity brought on by the race to the bottom they exploit.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "And they produce nothing we consume? Seems strange",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "And then people will get their services from other companies. These companies are responsible for 71% of emissions because of the customers like you and me you dumbo. Overpopulation.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The Supreme Court is currently hearing a case that may gut the federal govt's ability to regulate based on environmental issues. We all know how that's going to go.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yes the headline should be human behavior of 100 people. There are 100 ceos that could fix this with a memo.",
            "points": "0 points",
            "children": [
              {
                "comment": "That’s bullshit, though.\n\nThat ceos telling people they can’t eat as much meat anymore or whatever behavior their company is providing for? They’ll be fired. If not, the companies go out of business fast and the consumers find providers somewhere else.\n\nThat’s also why politicians can’t fix the problem, they’ll be voted out of office.\n\nWe’re the problem but almost no one wants to take a cut in their living standards.",
                "points": "7 points",
                "children": [
                  {
                    "comment": "Do you have any examples of CEOs being pro environment and getting fired?\n\nThe argument that the company is allowed to do bad things because people buy their products is pretty ignorant. A company has many choices to make when producing a product. The problem is they choose the highest profit path, all we need is for more companies to choose the lower environmental impact path.\n\nI would argue the votes are there for politicians that have a pro environment stance the problem is there is a bigger push against them as thier policies could reduce profits.",
                    "points": "-2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I don’t think so. We are afforded modern day luxuries because of these companies. We would still be where we were 300 years ago without them. They are a part of us and we are a part of them.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "I'm not saying these companies have to disappear, I'm saying they could be responsible and put global well-being at a higher priority than profits.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I wish for that too. But as long as they are human, they will be greedy",
                        "points": "-1 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why do they completely ignore manufacturing?\n\nI mean what are people overconsuming and wasting in the first place? Manufactured things. Trying to solve environmental issues from the waste end is fucking mental. Yes, we need to account for our waste and consumption but we do that by regulating the manufacturing in the first fucking place.",
        "points": "18 points",
        "children": [
          {
            "comment": "Bottling plants used to have to recollect, wash, and reuse their containers, but corporations figured out they could make more money if they passed the responsibility to the consumer.\n\nI agree with you, but the first step is convincing corporations that profit margin is not actually the most important thing.",
            "points": "9 points",
            "children": [
              {
                "comment": "They could be \"convinced\" by government regulation, if the government cared to fulfill their duties to represent public interest.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Idk, I feel like the emissions are simply a function of the amount of people trying to live on the planet and the standard of living they aspire too. You can tinker around the margins but more people, more emissions. My feeling is that the post industrial revolution, western standard of living relies on exploiting fossil fuels, if everyone on the plant has inalienable rights and aspires to the same standard of living, it has to cause problems.\n\nSo its an inherently unfair pyramid where our standard of living is built on exploiting the rest of the world, so if everyone tries to reshape the pyramid it overloads the planet but why shouldn't people have that right to aspire to a better standard of living.\n\nAbsent some magic bullet free energy technological innovation, I don't see a fair way to resolve the contradiction.\n\nI think liberalism will have a problem squaring this circle.",
        "points": "36 points",
        "children": [
          {
            "comment": "more people * QoL = more resource consumption is spot on. but...\n\ntotal population is peaking already and will not grow much anymore but rather shrink in the next decades, so the \"more people\" thing sorts itself out\nhow much resources (and which ones) is a factor we can *dramatically* change by using green tech and materials, theoretically towards zero (except land use in general)\n\nIn fact, there are even technologies that are \"negative\" in the sense that they literally **reduce** ecological risk factors instead of increasing them. We don't even need some miracle tech breakthrough anymore - at this point is simply a motivation problem and political will to turn things around.",
            "points": "20 points",
            "children": [
              {
                "comment": "Yeah like all the double wrapped plastic in the food industry. Thats an easy one to point fingersat to change what they do, especially in the us where food is penta wrapped up in plastic baggies to please someone god knows why.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Unwrapped food doesn't last as long as wrapped food. You are more likely to dispose of uneaten unwrapped food than wrapped food. What was the environmental impact of making that food, only to be wasted.\n\nThe government never examines things with a large lens. You need to understand the full end-to-end impact of decisions.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "You make a good point, but I feel there has to be something in the middle between \"not protecting food\" and \"protecting food with materials that won't break down for thousands of years and have been shown to be accumulating in human blood.\" We need a green alternative to plastic--something that'll last a year or two under proper conditions, then can be returned to the soil. And I feel we HAVE a lot of tech that's headed that way, but most big businesses won't embrace it until they're forced because it'll cost 2 cents instead of 1 or whatever.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "Totally get it, and agree. Just pointing out that things aren't always as simple as sustainable packaging.\n\nThere was a coffee company that moved from plastic jars with plastic lids to a cardboardy pouch that was biodegradable. It changed the recommended shelf-life of the coffee from 1 year to only 3 months meaning a significant increase in disposal of coffee without being sold or consumed within the shelf-life period. The environmental impact of production of coffee, farming, manufacturing, packaging, and transportation is significant. The impact on the environment of waste of that coffee due to sub-par sustainable packaging was much more significant than the impact due to the old plastic jar and lid.",
                            "points": "5 points",
                            "children": [
                              {
                                "comment": "i totally agree about everything you have said thus far but my comment was more directed towards the blatant disregard for trying to save some materials. This hamburger helper was tasty last night but it was a cardboard box and inside the cardboard box there was a plastic bag with the noodles in it. I'm just mad because i know these big companies CAN and SHOULD do a lot better, but they choose whatever is cheapest because its easier to buy the pack of noodles and then put it in their box vs. get the noodles and put it in the box.",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I feel like the emissions are simply a function of the amount of people trying to live on the planet and the standard of living they aspire too.\n\nI just can't agree to that. EVERYTHING we do could be done in a lower/no carbon way. Thinking of climate change as some kind of inevitability due to our standard of living is some real 1970s republican shit.\n\nThe green revolution is all about efficiency. Conservation = doing less with less. Efficiency = doing more with less.",
            "points": "3 points",
            "children": [
              {
                "comment": "We have never been more efficient than we are today. Think back to life in the 1960s.The issue is, the population has exploded globally since the 1950s. More people = more carbon.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "More people is not more carbon if the carbon per person is reduced sufficiently. CO2 emissions are not something required by thermodynamics, it's a result of choices we made in designing our energy production and manufacturing. The choices can be revisited and changed. We do not need any new technology to do this (though new technologies may make it easier as they have done in the past).\n\nMore and more what I see becoming a hurdle is some built-in hippy-dippy bullshit in the movement that presumes there is no path to sustainability that doesn't involve regressing our technology and lifestyles back to more naturalistic ways. That is not now and never has been realistic. The only way out is forward.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "For sure, but in 1950 USA, there were 25 million cars on the road. They consumed leaded gasoline and burnt gas like no tomorrow. In 2020 the number was 220 million cars on the road. Yet, they are far more efficient than in the 1950s and spew far less pollution than ever before. Globally there are 1.5 billion cars. This is a direct correlation to the growth of population globally as well and the growth of wealth to allow people to own cars.\n\nIf we didn't add the population, but drove the same number of cars using todays technology, carbon emissions from cars would be a non-issue.",
                        "points": "4 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Emissions have been dropping in the west, including the U.S., for 20 years. It’s not a morality problem, it’s just a technology problem. One that we’ve essentially solved. It’ll just take a while to roll out the solution across a big world.",
            "points": "2 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It really won't end until we massively scale back our myriad industrial sectors, and no red-blooded capitalist would deign to accept a greener footprint at the cost of a loss in profit. This headline, calling it a behavioral issue, is just blame-shifting when the ones most in need of \"behavioral reconditioning\" are the very same heavily armed and heavily monied people that have given themselves the right to decide what is and isn't acceptable behavior. It's why a certain date on a certain month back in 2021 didn't accomplish anything; how can you rebel by acting in accordance to your oppressors' rules?",
        "points": "23 points",
        "children": [
          {
            "comment": "I don’t believe blame is a useful emotion to instigate any sort of change, but everyone in the modern world has to understand that the socioeconomic model we hold (house, car, vacations, flying, material consumption patterns) is the problem.\n\nChange has to come at a societal level, not an individual. We cannot look at one person and say, “I need you to fly less, and eat less meat, and recycle” or even worse, “I’m going to make it illegal for you to do these things”\n\nWe need to understand that our behavior is driven by cultural beliefs that are socioengineered by corporations to drive our lifestyle, “you need a fancy home/car/vacation” etc…\n\nFurthermore, we make the adoption of sustainable lifestyles more difficult, either economically or psychologically\n\nThe more we understand this, we can then socioengineer cultural psyche to change our norms and beliefs. We have to place positive incentives on sustainable living, for instance, “all the cool people live sustainably” to make the psychological transition to sustainable living psychologically easier for people.\n\nWe have to structurally change our society to facilitate economical sustainable living, say by making renewable energy cheaper than oil, or creating intercity maglev transportation that drastically reduces need for flying, or widespread mass adoption of EVs, or even redesigning cities to completely eliminate the need for vehicles period.\n\nAll of this has to driven be as a communal decision, where we all share a common belief that we need to change our structure if we are to survive, and better yet, a belief that changing our structure will actually make us HAPPIER too.\n\nWe have so many tools at our disposal, human tech is at an unprecedented level of sophistication, there is no question that it can be done. What is lacking is a truly powerful, organizing force to drive the change.",
            "points": "8 points",
            "children": [
              {
                "comment": "The more we understand this, we can then socioengineer cultural psyche to change our norms and beliefs. We have to place positive incentives on sustainable living, for instance, “all the cool people live sustainably” to make the psychological transition to sustainable living psychologically easier for people.\n\nThis is all well and good; but who's going to do that, and how are they going to combat the socio-engineering of capitalist marketing?\n\nWe've understood for a long time how companies use marketing to manipulate us, it's not a new idea. The problem is no one in power wants to combat it.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "They are going to run this thing at max speed until the wheels fall off. No one is coming to save us and we will only react once it’s too late as humans throughout history tend to do.",
            "points": "11 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If as citizens we were given a clear path to cooperating in order to achieve the goal of a clean earth I think most people would buy in. This, is not happening.\n\nLike others have said, me not drinking bottled water, not driving and not drinking plastic straws isn't saving the Earth.",
        "points": "2 points",
        "children": [
          {
            "comment": "Producers need to be responsible for the waste they manufacture, not consumers.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It. Is. Capitalism. It is the system of production driving overconsumption. It is supply side driven. We all need to buy and drive cars because profits of car companies needed to be increased at the expense of investment into public transport. We all behave with overconsumption, but we are a part of the system that demands it if you are to keep your place in it.",
        "points": "24 points",
        "children": [
          {
            "comment": "Factories and cars in socialist countries have emissions just the same as in capitalist ones... And it isn't capitalism's fault that people want things.",
            "points": "11 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "When it comes to the matter of capitalism the horse has rather bolted the stables already. It's not like you'll change a culture through making society... socialist? Whatever isn't capitalist? Things won't change that way.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "If it’s capitalism, then why are the biggest polluters non-capitalist countries?",
            "points": "-13 points",
            "children": [
              {
                "comment": "If you're talking about China, you're completely ignoring the fact that western countries offloaded  huge amount of their manufacturing TO them. Our hands are not clean when it comes to Chinas carbon footprint",
                "points": "17 points",
                "children": [
                  {
                    "comment": "Last time I checked, China was a sovereign nation fully capable of making its own decisions about energy sources, manufacturing share, and every other aspect of its own economy. If China chooses to reduce the price of its manufacturing sector by thumbing its nose at concerns over climate change, that is on China — not anyone else.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I don’t see Cuba polluting much. China is a state capitalist country driven by profit, just with slightly higher connection between political and economjc power than the US.",
                "points": "14 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "because whichever countries you’re thinking of all have capitalist modes of production.",
                "points": "12 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "biggest polluters non-capitalist countries\n\n[CITATION UNAVAILABLE, NONEXISTENT]",
                "points": "6 points",
                "children": [
                  {
                    "comment": "Just run a search if you’re curious. China is the largest CO2 emitter, by far. And communist countries like Russia are notoriously polluted.",
                    "points": "-2 points",
                    "children": [
                      {
                        "comment": "Both China and Russia are not Communist.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "Someone tell the CCP (Chinese Communist Party).",
                            "points": "-2 points",
                            "children": [
                              {
                                "comment": "wow you seem to have such an advanced and nuanced perspective about what makes a country communist. do you mind sharing a little bit about the source of your knowledge and how you learned so much? i aspire to be so educated",
                                "points": "1 point",
                                "children": [],
                                "isDeleted": false
                              },
                              {
                                "comment": "",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "China is capitalist, private ownership of stock/land.\n\nThe government owns your money in America, they can freeze your assets at anytime just the same as the CCP.\n\nThere are Chinese protests going on right now demanding socialism because they know it’s just an act. They’re owned by businessmen just like the US.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "It’s hard to have rational discussions when people have such insane views of the world. If you’re position is that China isn’t collectivist enough, then there’s really no basis for further fruitful discussion.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I would be fine with capitalism if we could figure out a way to price in environmental externailities. What I do not want is a small group of people a thousand miles away micromanging my life.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Given much of the world is undeveloped, and all those people want the trappings of modern consumerism - I'd say the world is fucked.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Compulsive resource-hoarding behavior is at the root actually.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This absurd garbage ignores the fact that the vast majority of pollution and climate change is caused not by individual action but the actions of a small handful of private industries acting in the interest of profit, as incentivised by the systems they built.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Of the total emissions attributed to fossil fuel producers, companies are responsible for around 12% of the direct emissions; the other 88% comes from the emissions released from consumption of products.\n\nSource: https://www.politifact.com/factchecks/2022/jul/22/instagram-posts/no-100-corporations-do-not-produce-70-total-greenh/",
        "points": "4 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "When will people learn that this strategy is simply not going to work. People are not going to change. No matter how often they point out that they should for the environment. We have been at this for decades and frankly I am getting really sick and tired of people pretending to fight climate change by doing stuff like this.",
        "points": "6 points",
        "children": [
          {
            "comment": "welp, it was a good run. So long and thanks for all the fish.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Smart as humans have become by standing on the shoulders of giants, we need to apply past, present and future knowledge in an attempt to recover our (human) misguided past.\n\nClimateActionNow #ClimateAction #ClimateBreakdown #Climate #HumanSurvival #ClimateCatastrophe #HumanGrowthOrExtinction #Human",
            "points": "-9 points",
            "children": [
              {
                "comment": "I don’t think tags work like that on Reddit",
                "points": "9 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Set maximum wealth to $50,000,000. Own the rest collectively. Cut out all the middlemen. We can build a lot for a lot less if you don’t have a bunch of parasites at the top.",
        "points": "4 points",
        "children": [
          {
            "comment": "The two best ideas I’ve come across in this aspect are; 1. Land taxes. 2. Transaction taxes on every financial transaction. (Flash trading would be massively curbed as an example)\n\nAbolish all other taxes, including income tax. Apparently the revenue would dwarf all the other systems we have now, it would be vastly simpler and encourage a lot of behaviours we want.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Human behavior is at the root of every crisis and event in human history, this is no different. Any events of today is no different.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hmm I wonder if this has any overlap with the social science that is economics. It would be interesting to find if any economist had a theory about the tendency for \"behavioural crisis\" to disrupt our society and productive systems. Perhaps someone post-Adam Smith, but maybe pre-keynes?",
        "points": "1 point",
        "children": [
          {
            "comment": "Michael Muthakrishna, economic psychologist at London School of Economics, encompasses this in his Theory of Everyone.\n\nA very, very big thinker across many fields.\n\nOur collective cultural intelligence will evolve to solve this, the main question is how bad it gets before we turn it around?\n\nHe’s focussed on the reality of how humans have evolved to behave collectively in order to find solutions.\n\nNuclear power is at the top of that list. Many people that aren’t engineers won’t like that idea.\n\nhttps://darwinianbusiness.com/2024/01/05/the-cultural-evolution-revolution-inside-a-theory-of-everyone-by-michael-muthukrishna/",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Oh really? I had no idea. I thought Climate change was caused by Evil Witches who live in caves.",
        "points": "1 point",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "These researchers are correct.\n\nTheir solutions would be the end of the capitalism though, which the rich will never ever ever ever ever ever allow because then the rich won’t get perpetually richer. So continue on with the doom.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The fun thing is that was diagnosed 50 years ago if nothing happens to fight climate change. Nothing happened since then..",
        "points": "1 point",
        "children": [
          {
            "comment": "If we went hard on nuclear energy back then, we’d have largely solved the carbon emissions part of the problem.\n\nBut humans are emotional and irrational by nature. No matter how much we assert otherwise. Nobel prizes have been awarded pointing that out.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Nothing can be done until there is a single authoritarian state that governs the earth (which i am not advocating for). Without that, it is unfair. If the US puts all these laws/regulations into place we become weak compared to china or India. Our GDP slows. Our costs to produce goods skyrocket. Regulations are bad for economies. Our companies will begin to underperform foreign companies. The only way to combat this crisis is to all do it at the same time together. That won’t happen. china wont do it unless the US does it and who’s to say India will go along with it. Plus all parties have to be truthful and we know governments aren’t the most truthful.\n\nFucking i think germany has a crazy high score on their recycling metrics because they burn plastic for fuel!!!!!! They dont actually recycle a large amount of their plastic and the fact they produce energy from burning it, means their recycling score is bonkers. It makes them look like saints. Really they are trading air quality for plastic recycling. Idk i read an article on it once a few years ago. Maybe things have changed\n\nAsia straight up dumps truckfulls of trash into their rivers because its cheap. Who’s gonna tell them they cant do that??!?!?!? Everything we make is made from plastic. Who’s gonna tell any country that they can no longer make things out of plastic? Are we gonna outlaw plastic? Then there will be an illegal black market for plastic manufacturing.\n\nPrisoner dilemma and a few other thought experiments show that humans are just naturally greedy. Maybe if women ran the world? Idk we haven’t tried that yet (i am a man)",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "and population growth\n\nOh dear goodness gracious time for another villain monologue. Can't wait.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "i would say capitalism is pretty much a \"human behavioral crisis.\" Our economic system is based on eternal growth in a limited system, and that is just impossible.\n\nCombine that with the political capture by the elites and you don't have so much a human behavior problem, as you do a power imbalance.\n\nHuman beings have come up with all sorts of ways to live on this planet, some good, some bad, some mixed. We all just think the way we live now is some sort of default, when really its an aberration in the long history of our species.\n\nWe can and we will have to, figure out a better way to live. Our \"human behavior\" is pretty adaptable.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I disagree. On a macrolevel, humanity should expand, preferably exponentially. It should expand in everything - economy, general well-being, population, etc. There will always be high and low tides, but for 15,000+ years we’ve been on an uptrend, and should continue on it.\n\nWhat this guy says is partially correct - yes, meaningless consumerism is bad, but it’s a huge stretch to equate it to some “behavioral crisis”, humans have always been producing and consuming.\n\nInstead of trying to extinguish humanity’s flame, we need to adapt in the moment and create solutions which continue our progress. Green energy could be an example of that - but there is no harm in burning fossil fuels for the next 10 years until all cars are electric (just one example) if it means we don’t lose out on the speed of progress. Let’s not shoot our selves in the legs.\n\nLast point…\n\n“The Merz Institute runs an overshoot behaviour lab where they work on interventions to address overshoot. One of these identifies “behavioural influencers” such as screenwriters, web developers and algorithm engineers, all of whom are promoting certain social norms and could be working to rewire society relatively quickly and harmlessly by promoting a new set of behaviours.\n\nThe paper discusses the enormous success of the work of the Population Media Center, an initiative that creates mainstream entertainment to drive behaviour change on population growth and even gender violence. Fertility rates have declined in the countries in which the centre’s telenovelas and radionovelas have aired.”\n\nThis is absolutely scary, and is basically a large scale psychological terrorism operation. Absolutely unethical and I am surprised this is not spoken larger about.",
        "points": "1 point",
        "children": [
          {
            "comment": "There absolutely is harm in sticking to another 10 years of fossil fuel.",
            "points": "-1 points",
            "children": [
              {
                "comment": "There is more harm in staggering the growth of economy and population for the following 10 years than there is from fossil fuels for the following 10 years. Atomic energy is the answer here, really. This shouldn’t even be a discussion",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I disagree. On a macrolevel, humanity should expand, preferably exponentially.\n\nLike cancer? Do you know what kills most cancer patients?\n\nThey are starving to death as the cancer is expanding, corrupting organs, and eating up most of the intake calories leaving none for the actual body itself.\n\nIt should expand in everything - economy, general well-being, population, etc.\n\nHow will you fuel that expansion if not with the very finite resources we have access to? How will you keep that system running once those finite resources are running out?\n\nThere will always be high and low tides, but for 15,000+ years we’ve been on an uptrend, and should continue on it.\n\nJust because the human species has been on a population uptrend does not mean that the same uptrend applies to our one and only biosphere.",
            "points": "-1 points",
            "children": [
              {
                "comment": "Space is infinite in resources.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "If an engine didn't have pistons, it would explode. If a car didn't have brakes, it wouldn't take long before it crashed.\n\nIf capitalism is allowed to continue unregulated, it will eventually destroy the earth.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "How do WE collectively join together to fix something (climate change) that WE collectively created?\n\n\"People are the victims -- we have been exploited to the point we are in crisis. These tools are being used to drive us to extinction,\" - Phoebe Barnard (evolutionary behavioral ecologist and study co-author)",
        "points": "-1 points",
        "children": [
          {
            "comment": "Michael Muthakrishna gets this 110%. He’s also very optimistic, based on science and human behavioural history, that our cultural intelligence will innovate to solve it.\n\nHe provides practical methods for doing so that align with behaviours we already have.\n\nhttps://darwinianbusiness.com/2024/01/05/the-cultural-evolution-revolution-inside-a-theory-of-everyone-by-michael-muthukrishna/",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "BuT i caNt stOP eaTiNg Meat beCAUse tHe MarKet. yOu Cant eXpECt peOplE tO CAre ABOut tHe ENVIronMent wHeN mEat aND MaRKEt DemANd.",
        "points": "-1 points",
        "children": [
          {
            "comment": "You're making light of this, but it kind of is the problem. \"Everyone should recycle! The rich should pay their fair share! Corporations need to invest in greener solutions! What!? Give up my meat and cheese and candy diet? Too inconvenient!\"\n\nSaving the environment is THE shining example that everyone thinks everyone else should make the necessary sacrifices for a better world.",
            "points": "6 points",
            "children": [
              {
                "comment": "I'm making light only because of several frustrating conversations with people about the environmental impact of eating meat.\n\nThe \"argument\" for eating meat is always that \"but it's what people want! people aren't just going to stop eating meat!\"\n\nWhich, of course, isn't a helpful way to look at things. Why do people want this despite the consequences? What dynamics reinforce this behavior? How can we make people see the connection between their consumer choices and the way corporations pollute?",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "People are not going to stop eating meat, no matter how many vegans yell at them, it's not going to stop, ever. You know what will help? Lab grown meat. Advocate for, work on, fund that, because that will take care of the environmental and ethical problems you're worried about.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "[deleted]",
        "points": "-2 points",
        "children": [
          {
            "comment": "Old people know now thou and still want to prop up policies and people who are basic eco terrorists.. so again old people still suck\n\nYoung people suck too, they should know better but don't care or don't care to know\n\nIf the university was in the USA... It's simply laziness.... Americans are fucking lazy....",
            "points": "-2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "We try to vote with our dollars as best as we can. I get a new phone only when the old one breaks down. Most of my entertainment is streaming and gaming, most of the time digital. We buy books digitally and use the library. We don't travel, though someday I'd like to take my wife somewhere exotic. We did buy a minivan but with a family you kinda have to.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It's concerning enough to me that I'm making some changes to my lifestyle, I will say that.\n\nFor instance, I am a major collector (hoarder) of books. I love books; I wish I had a house big enough to contain them all. But I've realised that by hoarding them, all I'm doing is exacerbating the problem: I don't re-read, so those are books taken out of circulation - when they could be offsetting the trees used to make them by continuously changing hands. More books traded/bought secondhand = less people buying those books new.\n\nSo I've made an incredibly difficult decision for my autistic, compulsive ass to start parting with them after I've read them. It's uncomfortable. I don't like it. But I want to do something to help the climate.\n\nI'm also going to start composting, recycling better, go litter-picking, reusing where I can, growing my own food in the garden, reducing plastic use, and walking when I can. I can't avoid meat entirely for dietary reasons but I can cut out beef, so sure, I'll do that. Bit disappointing but I'd rather the planet be healthier. And that's the crux of it: how much discomfort are we willing to tolerate collectively to save the planet? I mean, I'm not going to turn my gas fire off in a freezing January.\n\nPlus, what use is even two million of us doing that if industry offsets it by billions of tonnes of emissions?",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "TLDR: Capitalism is killing the planet. Got it. Those that control the system don't care",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "About the only way to shift things is for politicians to do something about it. We can vote in as many good actors as we want, but if there's not widespread support amongst the Boomers in the seats in the upper tiers of government nothing will change.\n\nWe need a refresh, clear the chairs and elect people who actually embody the will of the people they're meant to represent. No more of this split down party line bullshit, we need to come together as countries and peoples to figure it out before we can no longer breathe outside.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Basically... we're gonna need drastic action and divergence from the current norm to change the increasingly obvious and locked in outcome.\n\nWhat we'd have to do is nothing less drastic than voluntarily matrixing ourselves... or at least move most of our physical human activity into the virtual space - where we go to work, where we go for entertainment, where we go to socialize and educate ourselves (even though so many of us are already doing this and doing so comfortably)... and then leave the function and maintenance of the physical world to highly optimized AI and robotic systems.\n\nBut... too many would reject such a world - I suspect if people comment on this, it'll likely be in the negative - such is the radical nature of the proposal.\n\nAnd it's also a prime example of why we're locked into our doomed fate - far too few of us want to enact the drastic change that is required to stave off the problem at hand.\n\nThe longer we wait to do so, the more radical the change needs to be, and the fewer our options become... until those that refuse to change have died out, and those that are left, have no options left but to die.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"Humans are the stupidest species in the ecosystem.\"\n\n“In the case of economic agents, just like in the case of bandits, stupid people do not optimize the system they exploit. But whereas the bandits can survive a crash in their revenues when their victims rebuild their wealth, stupid people ruthlessly destroy them, ruining themselves as well. There are several examples in the history of economics: one is the case of the mining industry which is exploiting resources that will need at least hundreds of thousands of years to reform by geological process, if they ever will. It is also the case of industries that exploit slowly reproducing biological resources. A modern example is that of whaling, as we demonstrated in previous papers. The same resource destruction also occurs for other cases of human fisheries. Humans do not seem to need modern tools to destroy the resources they exploit, as shown by the extinction of Earth’s megafauna, at least in part the result of human actions performed using tools not more sophisticated than stone-tipped spears. Overall, the destruction of the resources that make people live seems to be much more common than in the natural ecosystem. This observation justifies the proposed '’6th law of stupidity,'’ additional to the five proposed by Carlo Cipolla that has that ’Humans are the stupidest species in the ecosphere.’”\n\n\"...Humans are a relatively recent element of the ecosystem: modern humans are believed to have appeared only some 300,000 years ago, although other hominins practicing the same lifestyle may be as old as a few million years. Yet, this is a young age in comparison to that of most species currently existing in the ecosphere. So, humankind’s stupidity may be not much more than an effect of the relative immaturity of our species, which still has to learn how to live in harmony with the ecosystem. That explains what we called here “the 6th law of stupidity,” stating that humans are the stupidest species on Earth. It is a condition that may lead the human species to extinction in a non-remote future. But it is also possible that, if humans survive, one day they will learn how to interact with the ecosystem of their planet without destroying it.\"\n\n― Ilaria Perissi and Ugo Bardi | The Sixth Law of Stupidity: A Biophysical Interpretation of Carlo Cipolla's Stupidity Laws",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Behavior is built on several layers beginning with a theological ontology at the foundation, then a philisophical response to stimulus (life). Too many people have no ontological or epistemological purpose outside of the economy. So they give up. DON'T GIVE UP\n\nWWW.NTARI.IO",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yes we have alien technology for zero point energy and we’re not using it because the powers the be are keeping it hidden. I’d say that’s a behavior crisis.",
        "points": "-2 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Until we hold something in higher esteem than wealth and personal satisfaction (including personal safety), we are fucked.\n\nTo band together we need a common belief, whether God, or nation, or just global brotherly love, we need to have a symbol of global unity. Only then will we get out of this.",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19aj18f",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "/r/Futurology/comments/19aj18f/dreaming_about_future_tech/",
    "title": "Dreaming about future tech",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19ahtds",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "/r/Futurology/comments/19ahtds/manned_outpost_beyond_mars/",
    "title": "Manned outpost beyond Mars?",
    "points": null,
    "comments": [
      {
        "comment": "We put the man on the moon.. because it was fuelled by cold wars, basically who is advanced than who race.. but nowadays it's all economy, if there is no return of bling bling to goto space, we won't.. say if there is something on Mars worth lots of bling bling, we'd be there digging for it by this time..",
        "points": "33 points",
        "children": [
          {
            "comment": "I hate how accurate you are here.",
            "points": "11 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "For reference see: For all Mankind",
            "points": "7 points",
            "children": [
              {
                "comment": "Such a good show no one ever talks about!",
                "points": "3 points",
                "children": [
                  {
                    "comment": "We need to talk it up more so Apple keeps renewing it",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I think once we get the tech downpat for asteroid mining that will be the major driving force. More gold than all of earth in a convenient travel-size rock package",
            "points": "2 points",
            "children": [
              {
                "comment": "Can't wait for the space piracy age. Hijacking mining ships and having laser fights with robots in zero g sounds kinda dope.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "See ya later, space cowboy",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I think it will be astroid capture that really reignites the space race. There's a lot of money in the kuiper belt.",
            "points": "-1 points",
            "children": [
              {
                "comment": "Mars can be a great base for asteroid mining, providing the miners with clothing and food.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I wouldn't bet on a human outpost. Distances are too vast, more complex vehicles to have to break and maneuver within a gas giant system, which is like a mini solar system, and also the radiation belt around a giant like Jupiter. Maybe a robotic outpost is possible. Our chances even for a Mars outpost by the end of the century is slim. A crewed landing for a brief period on Mars is very possible, I would bet by 2060's.",
        "points": "19 points",
        "children": [
          {
            "comment": "This sub needs to be renamed wishfulthinking with how bad you're getting downvoted.",
            "points": "2 points",
            "children": [
              {
                "comment": "It generally is.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Titan and Europa may be easier to colonize than Mars or Earth's moon, beyond travel time.",
        "points": "16 points",
        "children": [
          {
            "comment": "Europa has a fair amount of radiation.\n\nAnd weird under-ice critters that eat spaceships. Iirc, there was a report about Europa a few years back.\n\n/s juuust in case",
            "points": "10 points",
            "children": [
              {
                "comment": "Good movie.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Colonize is a few steps beyond some form of outpost or science presence.\n\nIf we're going to be in an ISS style box somewhere it seems like this'll be more of a distance, travel slingshot options and PR question.",
            "points": "2 points",
            "children": [
              {
                "comment": "Moon would be easiest for an ISS style box on another planet like body. Minimal travel time. Frequent launch windows, about once a month.\n\nCan launch a mission to Mars every 26 months.\n\nMission to Jupiter technically every 13 months but also would likely need to do flybys of other planets so dependent on when a mission to Mars/Venus can be launched. Could be as bad as having 28 years between resupply missions to Jupiter's moons. ISS type box on a moon of Jupiter would then need to be self sustaining for at least twice that amount of time, in case a resupply mission fails.\n\nISS type box on a moon of Jupiter would be challenging. May be easier to establish a self sustaining habitat on a moon of Jupiter than a non-self sustaining research facility. Relatively small difference between being stocked with enough supplies to last half a century and having enough of an economy to remain active indefinitely.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Titan and Europa are a lot less Earth-like than Mars. The metal content is worryingly different so you’d probably have to mine the orbiting asteroids.",
            "points": "",
            "children": [
              {
                "comment": "Titan is fully of methane and Europa is full of oxygen, so I would think they would be ideal for fuel depots. Having a propellant store out there would be game-changing.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I think a scientific outpost around Jupiter and/or Saturn is not impossible by the end of the century. So much to explore there, it would make sense to have something right there instead of sending a new probe every 20 years. Probably not large space stations with a singificant population though.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The thing for space exploration is always “Why?” So in order to even send a probe to another planet, they evaluate the pros and cons and what they can benefit from sending a billion dollar probe into space. That’s the million dollar question.\n\nA good example for this is the nearest object to our planet. The Moon. It is relatively near to us but there is absolutely no interest to visit it any time soon. But Mars on other hand is pretty far away but is a very strong candidate.",
        "points": "4 points",
        "children": [
          {
            "comment": "Ehm, there are planned missions to the Moon",
            "points": "14 points",
            "children": [
              {
                "comment": "You’re absolutely right. There are planned moon missions but compared to mars they are very limited exploration options for moon due to its nature.",
                "points": "-10 points",
                "children": [
                  {
                    "comment": "There are lunar tunnels and areas we have never even seen. There is so much exploration left to do on the moon.",
                    "points": "9 points",
                    "children": [
                      {
                        "comment": "Absolutely! Imagine NASA had the same budget as the military. Perhaps we would have already conquered the entire solar system by now. But at what cost? What’s the benefit of conquering the entire solar system? You see where I’m going with this. Earth is barely stable with global conflicts and economical crises. We humans as intelligent species can’t even put our sht together. How can we become multi planetary when we’re still dealing with such basic problems on our planet.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "If we could get industry on the moon, that's of real value to earth. That's less mining and pollution on our planet. There are valuable minerals on the moon, and asteroids. Once you have a low gravity industry base a lot can be achieved with far less impact on earth.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "just because something hasn't been done yet doesn't mean there's a strong enough economic incentive to finance it",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "There is an economic incentive, \"on the far-side. It is made of oxygen, silicon, magnesium, iron, calcium, and aluminum, with small amounts of titanium, uranium, thorium, potassium, and hydrogen\" https://science.nasa.gov/moon/facts/\n\nIf you could set up a way to mine and refine those. As well as send them back to earth using the materials and fuel you mine. It would reduce pollution, and allow continued growth and opportunities to feasibly harvest asteroids, with far more valuable materials. There is plenty of economic incentive for space. There is a reason multiple countries and world powers are developing technology for space, and working towards lunar landings.",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The last part, why is that? Is a base actually sustainable on mars with out resupply? That seems like something is doomed to malfunction.  I know stepping foot on another planet is important.  Meanwhile, I feel like we should be sending rovers to the moon every 6 months to perfect them and lower the costs. . We could easily resupply.  Seems like the moon is much more feasible at our current tech.",
            "points": "2 points",
            "children": [
              {
                "comment": "You raised some valid points.\n\nFirstly let’s talk about sustainability on Mars. Scientists are making step by step plans as of right now. The general course of action is they might have to send probes and supplies to Mars for couple of years with about 3 months intervals until Mars eventually becomes sustainable. And yes it can because it has frozen water and minerals.\n\nSecondly, as for the Moon. Although it’s fascinating to send probes and explore it more, there aren’t any valuable resources on Moon and having a station on Moon isn’t financially feasible. Yes it’s awesome to have a space station on the surface of the Moon but the cost benefits aren’t worth it. It’s way cheaper and cost effective to have satellites and space stations orbit earth than stationary on moon.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Except the moon does have resources. There are mining companies planning scouting and mining missions. There is also ice and other minerals to make fuel for spacecraft. The cost to build and fly something from the moon would be much less than building from earth due to earth's massive gravity well. After the set up of the lunar industry of course. A feasible long term way to mars(and other galactic locations.) travel is to have a resupply and fuel station on the moon, and a large space non atmospheric spacecraft that can transport more people and supplies. Like a big space bus.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Yes it seems feasible in the next few decades. We’ll have to see. Perhaps moon base and mars base simultaneously. Though moon has one problem and that is “moon dust” it’s incredibly hard to get rid of on spacesuits and it destroys many mechanical parts of spacecrafts on landing and take off. They’re currently working on some advanced spacesuits that use electromagnetic fields to take the moon dust off of the suite but further research and development is needed.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "A base on Mars would have to be terraformed.\n\nIdeally the best way of going about it would be installing an outpost in the Valles Marineris, as this is where local gravity would be maximized and therefore allow for some gaseous retention. It would also serve as a way to partially mitigate the copious amounts of radiation on Mars (no electromagnetic field).\n\nA sustainable base could be feasible, assuming the introduction of carbon-converting organisms is achievable. Mars has known quantities of ice (therefore water), making longterm operations viable if the previous conditions are met.\n\nThe issue is interest. No country, company, or coalition really cares to expand on a planetary basis at this moment. It’s a massive engineering challenge, and I could easily see the cost basis surpassing a trillion dollars. Given that few nations on Earth could afford it (and it’s not a US defensive interest), it’s moot.\n\nEdit: expanding\n\nThis comes with the added drawback of isolation. The first people (person more than likely) sent there are almost undoubtedly not be coming back, and certainly not while theyre still young and mobile. So it also has an additional ethical issue as well. They would be taken away from any and all connections they had ever built, stripped of all relationships",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Radiation on the Martian surface isn’t exactly ‘copious’. It’s the same as aboard the ISS.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I think we will seeing the beginnings of scientific bases on Venus and larger bodies in the asteroid belt towards the turn of the century.",
        "points": "0 points",
        "children": [
          {
            "comment": "Venus is a toxic hell hole  probes were only able to send us information for a short time because the extremely high temperature and pressure on the surface of Venus melted and crushed the landers.",
            "points": "6 points",
            "children": [
              {
                "comment": "This is true for the surface of Venus. However the atmosphere is made up of carbon dioxide, which is heavier than Earth's atmosphere so a balloon of Earth air would (in theory) float at roughly 30mi above the ground which would also help with the pressure issue as this is far above the altitude the probes got crushed.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "I think you just want to see cloud city.",
                    "points": "8 points",
                    "children": [
                      {
                        "comment": "Yes. This may be me at the peak of Dunning-Kruger but I want it and if the technologies needed are in the cards I don't see why not.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Is it likely\nHumans can't survive off world. Our bodies require Earth gravity to function. Humans is distant isolation in Antartica, with free air and water, lots of entertainment options and full confidence they can be rescued relatively easily, still go mad. Imagine how difficult it will be when you know any accidents are potentially fatal. The isolation will be crushing.\n\nSo this will never happen. There's no technological or eonomic path for permanent occupation right now anyways. There's been no major \"game changers\" that point the way.",
        "points": "0 points",
        "children": [
          {
            "comment": "O'Neill Cylinders my man. Spin gravity. They have gravity, air, water, the ability to farm, and are 100% scientifically feasible with no uncertain tech. Completely feasible.\n\nLiving on other worlds? I don't see it happening any time soon. There's nothing we could possibly do to Earth (even if we tried) that would make the Earth less habitable than the other rocky planets in our solar system. Terraforming takes centuries.\n\nSpace habitats are the way to go. The tech is all there. You wouldn't be isolated, you'd be surrounded by tens of thousands of other people on the same platform.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Extremely unlikely.\n\nIt’s been over 50 years since we visited the moon, we havent been back in decades because there is no real economic incentive.\n\nThen there is the tech barrier, even a visit to Mars is a challenge now, let alone permanent habitation. Beyond that is magnitudes more difficult.\n\nAnd then there are the challenges on Earth with a deteriorating climate having ever greater impacts on our economy. It will be more difficult to justify what are basically expensive vanity trips that could just as well be done by relatively cheaper robots in a time where we will likely see huge upheaval from extreme weather evens and the impacts on our crops and coastal cities.\n\nThat said, the future is never certain, who knows AI solves a bunch of our problems and it becomes super easy to go out beyond the moon.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No. Anything less than 1g is lethal to humans in the long term.",
        "points": "-6 points",
        "children": [
          {
            "comment": "we dont know that. crews on ISS using workouts 6 days a week come back in better condition than when they left. we have minimal data on how long term partial gravity impacts a crew. radiation exposure is more likely the bigger issue than partial/micro gravity",
            "points": "2 points",
            "children": [
              {
                "comment": "It also seems like the issue is returning to 1g. If people choose to stay permanently on moon / Mars / zero g, it may not be an issue for many years. Even so, going to Jupiter's moons would take many years round trip, so send a fit 60 year old that has no intention of coming back to Earth and continue to run marathons.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "[deleted]",
        "points": "0 points",
        "children": [
          {
            "comment": "Gas giants moons.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "In the end the factor that decides where and how spacecraft are sent is money. If there is money to be made by sending humans to gas giants, then it will happen. Given the huge costs involved and the pace at which AI and autonomous systems are developing, it seems that sending autonomous systems will be much cheaper.\n\nYou can of course send humans for propaganda purposes, but I don't think there is much propaganda value in sending humans to gas giant moons. Most average people would simply be \"they send astronauts where?\". Add to the equation the possibility of loosing the astronauts and the case for a propaganda trip isn't very good.\n\nThe only way I see humans being sent to gas giant moons is if there is a development in rocket engine tech that brings down costs by several orders of magnitude.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not at this pace. My estimate in rough order would be: Moon, Mars, and Titan. Titan would act as a fuel hub owing to its atmosphere and hydrocarbon lakes, making it the most logical choice among the gas giant moons. So, Moon and Mars have to come first, both of which remain slowed down by bureaucratic delay. The distance factor will be remedied eventually by technological advancement; the worst things affecting space colonization are within our own governments.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Outposts on gas giants? No, they'd be crushed. Space stations and/or outposts on their moons? Almost certainly. There are some valuable resources on the moons of gas giants and there's plenty to be learned from them.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "We need to develop a lot more tech to coordinate these kinds of activities. Check this out www.ntari.io/tos",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "we will leave the moon for the stars\n\nwe will travel way beyond the mars\n\nwe will stop all of the wars\n\nyeaaah we gonna ride the planet horse\n\nhttps://youtu.be/QOgKho9ngko?si=BSVZJ8_qAXbu5x20",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yeah there’s missions already on tap for exploring Europa and Ganymede for life in their oceans. The “cloud city on Venus” is not on the agenda yet but it could happen as humans began to mine objects in the asteroid. Siphoning off the usable gasses from gas giants requires people too",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not unless we have a warp drive or FTL or whatever. So yes, the distance is too far. Keep the crew alive you know",
        "points": "0 points",
        "children": [
          {
            "comment": "Even using more conventional thrust, the distance to the outer planets vs Mars is staggering.  You’d be in space for YEARS traveling there \n\nIn The Expanse books, the big breakthrough is the Epstein Drive, essentially a technobabble way to explain why you can maintain almost constant thrust for extremely long periods of time using relatively little fuel.  This makes outer planet stuff feasible because now it only takes weeks or months to get out there.\n\nIn reality, unless we could create something comparable, outer planet outposts won’t be feasible for a very long time",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "DARPA have awarded feasibility projects to a number of companies, in regards to putting commerical lunar infrastructure on the moon. Roads and what not by 2030s.\n\nhttps://spacenews.com/darpa-picks-14-companies-for-lunar-architecture-study/\n\nLockheed Martin, have with their spin off company Cresent Moon, plans deliver full coverage of the moon via satellites.\n\nNASA have tested laser based communications recently.\n\nYou'd have to say depending on how that all goes and how the space race between China and USA develops (China want to be the major space power by 2045), we might have a Mars landing by 2040s - 2050s.\n\nBeyond that it really depends on propulsion technologies and the usual suspects of enough water and oxygen.\n\nIn the longer term, say next 100-200 years, I could see outposts on moons that have reserves of water below their surface.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There are a few obstacles standing in our way. First of all in order to large structures in space we will need to learn how to harvest raw materials and process them in space. We're not even close to this yet.\n\nSecondly human societal structures tend to be relatively simple and self-regulating. This would not be very well suited for creating sophisticated space colonies with international cooperation. I would suspect that the human need for dominating other humans terrorism, war,corruption etc would preclude us from long range planning tasks like this.\n\nThe third big problem is that the human body is just not suited for space travel. We have specific needs for example we require gravity heat food protection from radiation etc which would slow down any progress about building space stations and space colonies especially in distant locations like the outer solar system.\n\nMy guess is that humans will continue squabbling and fighting over the dwindling resources on Earth and will eventually become extinct within the next thousand years.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Doubt it. The moon and maybe mars is the most realistic goal of this century. We still don't even know what effects low gravity will have on the human body, and how to protect against solar radiation effectively. We also need to study if it's even possible for an outpost can become self-sufficient. \n\n The iss has been up there for 23 years and only recently did we learn pretty much everything we can with microgravity and being in low earth orbit",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think it will depend more on cultural motivations than technical. With mostly autonomous mining and manufacturing on the lunar surface being a goal within the next 20 years, we will have the ability to build much larger spacecraft/fuel tanks than what we could readily launch from the Earth's surface, that or in orbit manufacturing/assembly might be preferable. The challenges are not small, but within the bounds of human ingenuity.\n\nGetting out to the gas giants and ice giants in a state where humans actually want to go is another matter. Depending on how quickly we can get a human from Earth to a research station, our needs for radiation shielding might be manageable, but assuming you don't want to send old people on a one way trip, you are going to need a very fast very reliable. vehicle, or a slower but much more shielded vessel. Both options are resource intensive, so if people think its worth it we might. Realistically, we are more likely to send more and more capable robots than biological people, but those robots could be considered human beings with rights and with that respect they are crewed facilities.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Man hasn’t left low earth orbit since 1972. Fifty years after the last moon landing we have gone nowhere. Without some sort of new space transport technology, it’s unlikely we will be sending people beyond the asteroid belt before the 22nd or 23rd centuries. However there will be lots of very cool robotic missions we’ll likely get to witness.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No the biggest issue keeping us from going farther than Mars isn't necessarily travel speed but propellant boil off. If we can find a dense and lightweight propellant that doesn't boil off and gives good amounts of Delta V it is possible.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It is barely conceivable that we could use a colony in the asteroid belt to simplify mining the asteroids. If we find life on one of the methane saturated moons, it's almost conceivable that we'd set up a nearby, but not on that moon, colony of scientists, if only long enough to figure out how to collect and ship the critters so everybody can get a look.\n\nA colony on Mars is not all that scientific a goal. It'd be nice to have people in the loop when we're looking for life, but it's mostly to boldly go because that's the kind of species we are.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think energy is the biggest threshold. If we can have a break through on energy production I can see a humans having bases on all planets in the next two centuries",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No way. I'd be surprised if even Mars. There's no financial incentive so why would we do that. The curiosity is killed by the cost here, even for Mars. We haven't even explored Antarctica",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There will. As of right now, there is a new existential awareness emerging similar to what was seen at the end of World War that lead to the space race. Space race ending up with Russia launching Sputnik and the US landing on the moon. The new existential awareness is the new void that has been created by the normalist elites who rule the world. They have since the 1970s, have had an international system entire predicated on motivation being based on income and nothing more. What was produced was what was produced and harbored no incentive for innovation. Hence, part of why technological innovation has slowed down outside of the potentially profitable AI. Not even motivation in utilizing said money and its values for said innovation as said motivation is only to make more money and/or buy more assets. Innovation itself utilizes motivation that is independent of motivation to produce profits. Though now with this void of motivation, the rise of AI taking jobs, and the misery of only producing wealth for the sake of wealth, there is an upcoming existential crisis that is going to affect every single class of people on Earth except maybe for un-contacted tribes people. People will have no reason to work for someone who won’t pay them or offer them any real reason to work for them intrinsically outside of potential threats to livelihoods. CEOs with AI taking up all the workers will have no reason to employ anyone to work for anything less than free as their only motivation is profits. After said conflicts subdue and the international societies work these issues out, there will along with AI and the internet be a surge of innovated technology that will be something like seen in the Space Race.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19agnum",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://www.theguardian.com/science/2024/jan/18/pig-liver-animal-to-human-transplants",
    "title": "Surgeons externally attached a pig liver to a brain-dead human body and watched it successfully filter blood, a step toward eventually trying the technique in patients with liver failure.",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/mvea:\n\nThe University of Pennsylvania announced the novel experiment on Thursday, a different spin on animal-to-human organ transplants. In this case, the pig liver was used outside the donated body, not inside – a way to create a “bridge” to support failing livers by doing the organ’s blood-cleansing work externally, much like dialysis for failing kidneys.\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19agnum/surgeons_externally_attached_a_pig_liver_to_a/kikmyw8/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "God I hope there's a day when scientists can rebuild a heavily damaged brain. Not just for me but for so many other people that have relatives that are suffering with debilitating brain injuries.",
        "points": "59 points",
        "children": [
          {
            "comment": "Or for Alzheimers and other prion diseases. The scans showing brain tissue shrivelling away are horrifying.",
            "points": "18 points",
            "children": [
              {
                "comment": "I saw a documentary/porno where a doctor did this sort of thing",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "What do you mean \"/porno\"????\n\nI'm too afraid to find out the answer.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Poor things",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "You can’t really because it’s encoded with info. You regrow the brain, you can’t regrow the info. Thats like slapping a new hard drive into a computer and hoping all your photos are still on there. Once brain cells die, those parts of who the person is/memories are deleted",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The University of Pennsylvania announced the novel experiment on Thursday, a different spin on animal-to-human organ transplants. In this case, the pig liver was used outside the donated body, not inside – a way to create a “bridge” to support failing livers by doing the organ’s blood-cleansing work externally, much like dialysis for failing kidneys.",
        "points": "20 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It makes me a bit uneasy using brain dead people in experiments, it shouldn't, my father had brain death and we donated his organs to save lives.\n\nIt is a step in the right direction, but anyone that had family dependent on dialysis will tell you this is not a long term solution. Hopefully better xeno transplants can be the next intermediary solution while we search for a long term.",
        "points": "17 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Is it possible that brain-dead humans can be used for experiment research long term?",
        "points": "1 point",
        "children": [
          {
            "comment": "In democratic countries, if they consent before their brain “dies”.\n\nIn totalitarian countries, government owns your body -even when it is dead.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "A step you say? Perhaps a pigstep? I’ll see myself out…",
        "points": "-8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And they dont even honor the donor by giving the name",
        "points": "-4 points",
        "children": [
          {
            "comment": "Its not like he can consent wouldnt that be a hippa violation?",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Ok, so like zombies? Like that's the future, reconstruction of dead brain cells or reviving them, but its zombies!",
        "points": "-9 points",
        "children": [
          {
            "comment": "Nothing like zombies.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Bonus, after you get your new liver you can eat the rest of the pig",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19aaz77",
    "subreddit": "r/Futurology",
    "dataType": "link",
    "dataUrl": "https://www.technologyreview.com/2024/01/18/1086753/advanced-nuclear-power/",
    "title": "The next generation of nuclear reactors is getting more advanced. Here’s how.",
    "points": null,
    "comments": [
      {
        "comment": "The following submission statement was provided by /u/BlitzOrion:\n\nMolten salt is one leading contender for alternative coolants, used in designs from Kairos Power, Terrestrial Energy, and Moltex Energy. These designs can use less fuel and produce waste that’s easier to manage.\n\nOther companies are looking to liquid metals, including sodium and lead. There are a few sodium-cooled reactors operating today, mainly in Russia, and the country is also at the forefront in developing lead-cooled reactors. Metal-cooled reactors share many of the potential safety benefits of molten-salt designs. Helium and other gases can also be used to reach higher temperatures than water-cooled systems. X-energy is designing a high-temperature gas-cooled reactor using helium.\n\nTRISO, or tri-structural isotropic particle fuel, is one of the most popular options. TRISO particles contain uranium, enclosed in ceramic and carbon-based layers. This keeps the fuel contained, keeping all the products of fission reactions inside and allowing the fuel to resist corrosion and melting. Kairos and X-energy both plan to use TRISO fuel in their reactors.\n\nToday, most reactors coming on the grid are massive, in the range of 1,000 or more megawatts—enough to power hundreds of thousands of homes. Building those huge projects takes a long time, and each one requires a bespoke process. Small modular reactors (SMRs) could be easier to build, since the procedure is the same for each one, allowing them to be manufactured in something resembling a huge assembly line.\n\nPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19aaz77/the_next_generation_of_nuclear_reactors_is/kijpkxj/",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Molten salt is one leading contender for alternative coolants, used in designs from Kairos Power, Terrestrial Energy, and Moltex Energy. These designs can use less fuel and produce waste that’s easier to manage.\n\nOther companies are looking to liquid metals, including sodium and lead. There are a few sodium-cooled reactors operating today, mainly in Russia, and the country is also at the forefront in developing lead-cooled reactors. Metal-cooled reactors share many of the potential safety benefits of molten-salt designs. Helium and other gases can also be used to reach higher temperatures than water-cooled systems. X-energy is designing a high-temperature gas-cooled reactor using helium.\n\nTRISO, or tri-structural isotropic particle fuel, is one of the most popular options. TRISO particles contain uranium, enclosed in ceramic and carbon-based layers. This keeps the fuel contained, keeping all the products of fission reactions inside and allowing the fuel to resist corrosion and melting. Kairos and X-energy both plan to use TRISO fuel in their reactors.\n\nToday, most reactors coming on the grid are massive, in the range of 1,000 or more megawatts—enough to power hundreds of thousands of homes. Building those huge projects takes a long time, and each one requires a bespoke process. Small modular reactors (SMRs) could be easier to build, since the procedure is the same for each one, allowing them to be manufactured in something resembling a huge assembly line.",
        "points": "4 points",
        "children": [
          {
            "comment": "mainly in Russia\n\nI think very few nations will be interested in buying any kind of nuclear tech from Russia (besides Turkey, for some odd reason). Even without the current sanctions from their invasion of Ukraine and all the badwill associated with it, they still have bad rep in the nuclear community since their slight snafu at Chernobyl.\n\nImagine trying to sell this concept to the local regulators, city councils and whatnot:\n\n\"From the people who brought us Chernobyl, now with an improved reactor that combines the safety of uranium with environmentally friendly molten lead.\"\n\nhttps://tenor.com/view/great-success-yes-gif-5301633",
            "points": "5 points",
            "children": [
              {
                "comment": "Russian nuclear exports is a thriving industry. One of the few areas where they are having success against western peers.\n\nPeople are vastly overestimating anti-russian sentiment outside the west.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "Russian nuclear exports is a thriving industry.\n\nthere's no alternative, that's why they are exempted from sanctions, otherwise nuke plants in western europe would just have to be halted.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I don't think anyone has suggested purchasing nuclear tech from Russia. I suspect it was mentioned to demonstrate that the technology isn't hypothetical.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Russian nuclear reactors are fairly popular, since Russian offers are very convenient: they pay for the entirety of the cost of the nuclear reactors they build, and sell the country they built the reactors to electricity. They also train the engineers/technicians. Now, keep in mind that very few reactors have been built in the past 30 years.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "If they haven't already these companies are going to find that the reality is their designs too are subject to exactly the same torturous planning, approvals and appeals that makes any nuclear project take a decade to complete. And what is worse the designs are novel, which makes the public easier to whip up against them for faux green activists and gives politicians more excuses to do the wrong thing.\n\nRolls Royce has been trying to get SMR's off the ground for 2 or 3 decades and has yet to gain approval (that sticks) anywhere even for a pilot plant. Thats been the case too even for advanced traditional plants that could completely lose all power, lose control and still self contain.",
        "points": "-2 points",
        "children": [
          {
            "comment": "Yeah! Cause we can always trust corporations to do the right thing and never cut corners. Let's just remove all regulations on nuclear reactor building!",
            "points": "5 points",
            "children": [
              {
                "comment": "Why not a reasonable balanced approach? Regulations can be effective without being onerous. But no one wants to try that.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  }
]