[
  {
    "id": "t3_19al31k",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.xda-developers.com/snapdragon-x-elite-vs-intel-core-ultra-7-155h/",
    "title": "Snapdragon X Elite vs Intel Core Ultra 7 155H: We ran the benchmarks",
    "points": null,
    "comments": [
      {
        "comment": "I like to hear it. The more competitive these guy get, the better for everyone.",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nice of them to include the fanless MacBook Air 😂",
        "points": "1 point",
        "children": [
          {
            "comment": "Just wondering, are the X Elite models also fanless?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19ah8ft",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.techspot.com/news/101571-jailbroken-wiis-gain-access-revived-digital-storefront.html",
    "title": "Jailbroken Wiis gain access to a revived digital storefront | Service could eventually offer every digital Wii game for free",
    "points": null,
    "comments": [
      {
        "comment": "lol... not if this makes the news on all these tech sites it wont",
        "points": "1049 points",
        "children": [
          {
            "comment": "Not sure, hshop for 3DS has been around for years",
            "points": "48 points",
            "children": [
              {
                "comment": "Does hshop offer Nintendo published games on it? If not, then Nintendo doesn't really have grounds for deleting it. But im not sure",
                "points": "5 points",
                "children": [
                  {
                    "comment": "It sure does",
                    "points": "41 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Literally every 3ds game",
                    "points": "23 points",
                    "children": [
                      {
                        "comment": "Oh nice, thats pretty cool",
                        "points": "6 points",
                        "children": [
                          {
                            "comment": "And patches and all DLC",
                            "points": "6 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "nobody reading those anymore",
            "points": "90 points",
            "children": [
              {
                "comment": "Literally just Nintendo lawyers.",
                "points": "59 points",
                "children": [
                  {
                    "comment": "LiTeRalLY",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "Wii.....would like to sue you",
                        "points": "9 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Meh, reddit is filled with people that can’t help but brag that they pirate games and where they do it. They stand behind some fake “fight against the man” or “emulators have legal standing” as if politicians and lawmakers aren’t bought regularly.",
            "points": "-142 points",
            "children": [
              {
                "comment": "Emulators have plenty of legal standing, and this has nothing to do with emulation. Tons of games are either running in emulators and being sold on storefronts or use smaller emulators within them, and developing an emulator of another company's hardware is protected and supported. The part where redditors get stupid is in shouting from the rooftops where they got their collections of downloaded games, but that'd be illegal even if they couldn't play them.\n\nThe association of emulation and piracy is akin to the association of PCs and piracy in the 2000s.",
                "points": "74 points",
                "children": [
                  {
                    "comment": "You missed my point and followed it with my point, weird. The original commenter mentioned how the tech sites will get this ruined and I brought up a similar situation but it’s done with users that just can’t stfu.\n\nIdc if it has legal standing, many of our politicians and lawmakers can be bought and that is an outright fact. It has legal standing now. But again that’s not my point, My point was simply that some people can’t just keep a good thing a secret and instead NEED to brag.",
                    "points": "-70 points",
                    "children": [
                      {
                        "comment": "Be specific. 100% of republican politicians can be bought and 45% of democrat politicians can be bought . While not ideal in any way, it can be balanced a bit with the right vote.",
                        "points": "5 points",
                        "children": [
                          {
                            "comment": "I don’t need to be specific until it’s a rarity or only one side. The fact it can happen is a travesty. Idk how people can see how shitty things are now with capitalism and not think that eventually even laws and protections will be striped down.\n\nUbisoft just the other day had a dude talk about people giving up the idea of physical ownership. I just cannot imagine that “ever increasing profits” won’t inevitably lead to laws being changed in favor of the companies vs the people. Especially in a country where we can start chiseling away at child labor laws\n\nI fully understand it’s mostly Republicans. But I also can look at the past, see where we are and see the future is likely going to be even worse, especially if trump is elected.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Do you have anything against piracy or emulation or do you just wanna be a contrarian?",
                "points": "16 points",
                "children": [
                  {
                    "comment": "That’s not even contrarian? I’m saying some people can’t stfu and let a good thing staying in the background. Instead they have to scream it to the world what they use to play illicit games and where they got them.\n\nAre you offended because you can’t just pirate games peacefully and must instead announce it or are you normal and just pirate the games and play them?",
                    "points": "-14 points",
                    "children": [
                      {
                        "comment": "I don't even pirate anything, but what's wrong with publicity? More people will have the chance to \"try it out\" if it's made public. The pirate sites will be eventually forced to close for hosting illegal content anyway, so why not give a chance to others while they still have the time?",
                        "points": "-5 points",
                        "children": [
                          {
                            "comment": "If it’s made public it’s easier to shut down.",
                            "points": "5 points",
                            "children": [
                              {
                                "comment": "It will be shut down eventually anyway, so why gatekeep?",
                                "points": "-7 points",
                                "children": [
                                  {
                                    "comment": "Because you don't want it to shut down sooner? The f?",
                                    "points": "",
                                    "children": [],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "",
                                    "points": "",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Beating Tears of the Kingdom a week before it hit store shelves was pretty sick though lol",
                "points": "16 points",
                "children": [
                  {
                    "comment": "If they’re not going to give me the option to purchase them on my steam deck, they can get the fuck over it. I’m willing to purchase games but not behind “spend $200+ for the opportunity to buy this game”.",
                    "points": "-32 points",
                    "children": [
                      {
                        "comment": "I mean, legally speaking you can buy a physical copy of the game and rip it to play on an emulator.\n\nNot sure what's going to happen when physical copies aren't around anymore.",
                        "points": "10 points",
                        "children": [
                          {
                            "comment": "Idk. I’m downvoted for perceived “anti piracy” but also downvoted for saying I’d download a game that is being paywalled behind another device to purchase. If I say that Id buy a game on a device I don’t have so I can justify emulating it on my steam deck I’d probably be downvoted for that as well.\n\nBut that is smart and I’ve suggested that to people before. Even if you have a scratched up disc it would show that you’ve purchased it. But I bet that’s only going to be a real problem in the future if game companies set their sights on laws and regulations.\n\nlooks disgustingly at Ubisoft",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Honest question.\n\nWhy?",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Growing up I would always read reviews where reviewers got the game weeks ahead of release date and played through it and gave their thoughts about it, I always thought that was really cool and wished there was a way I could get review copies of the latest games, and with this one I was able to.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "So it just made you feel cool to play it one week before someone else? Ok.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "It’s really not that deep.",
                                "points": "1 point",
                                "children": [
                                  {
                                    "comment": "",
                                    "points": "",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              },
                              {
                                "comment": "",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Same deal with ad blockers--we just want to share the trick we learned that makes our lives way better!",
                "points": "0 points",
                "children": [
                  {
                    "comment": "The difference there is that adblock is something you set up on your own computer or network that prevents your device(s) from communicating with certain addresses.\n\nA \"store front\" needs to be hosted somewhere out on the net where Nintendo can force the host to shut down and ISPs can block access to.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Well if the wider piracy scene has taught the world anything, you can't really permanently shut down piracy hosting.",
                        "points": "5 points",
                        "children": [
                          {
                            "comment": "Not completely, no. But every time they are forced to move part of the user base falls off. If the hosting info is hard to find most people won't bother and just sign up to one of the subscription services, if it is easy to find it is easy for publishers to go after them. For a good while now the publishes haven't cared much about piracy because the general public hasn't been pirating anywhere near what they used to. As piracy regains popularity we'll probably see new road block get put into place, and with so much free and cheap content available there isn't much motivation for a lot of people to spend trying to get around them.\n\n\"Piracy Is More About Convenience Than Price\" goes both ways.",
                            "points": "-1 points",
                            "children": [
                              {
                                "comment": "They just gotta figure out how to get a BitTorrent client onto a Wii and then Nintendo can't do anything :P",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "There is no worldwide law against it. There’s plenty of countries that don’t give a shit about American or Japanese copyright laws and there’s nothing they can do about it.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Literally just make it a torrenting site and any ban will result in a slightly different domain popping up. They haven't been able to get rid of piratebay to this day.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I don’t use them because I only use YouTube and Reddit. My daughter and I use YouTube almost exclusively so I have premium. BUT! I’ve said that before, adblockers are going to get shafted in the future and I hope the community that used them call out the loudmouths.",
                    "points": "-2 points",
                    "children": [
                      {
                        "comment": "I don't necessarily agree. It's possible, but I think the cost to really make a fool-proof system against ad blockers is much higher than the revenue companies stand to gain. It's a constant battle that requires significant ongoing development costs.\n\nIf you look at piracy in general, for example, the only industry that's made meaningful strides is the gaming industry...and even there the most effective solution has been to really strongly tie gameplay elements with online play so piracy can't get you the whole game.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Even if it's not available through the Wii, the system having life is a great thing. If only it output HDMI natively.",
        "points": "253 points",
        "children": [
          {
            "comment": "What does everyone use to convert their signal? I’ve seen some cheap eBay adapters that specify Wii support, but a straight up AV to HDMI converter may be better long term and cost about the same.",
            "points": "56 points",
            "children": [
              {
                "comment": "i got a \"Wii2HDMI\" converter off Amazon for like $10 and it works fine. There's probably scalers that make it look better, but whatever these are old ass games to begin with.",
                "points": "21 points",
                "children": [
                  {
                    "comment": "+1 for Wii2HDMI. I even bought 3rd party component cables and a component to HDMI converter (cheap one) and it didn't work as well as the all-in-one Wii2HDMI.",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "Yeah the Wii2HDMI magic.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I had an HDMI converter that I got on Amazon but sadly the imagine was meh and the sound was extremely loud. As in, the highs and such would be blown out because the source volume from the converter was super loud.\n\nUnless there’s another way, hard modding and such, the way I “got around it” was just modding my Wii U and that has the ability to have not only Wii over HDMI but native GameCube as well.",
                "points": "29 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I use an OSSC clone I got on Amazon and it's great, worth the $200 or so considering the cheap ones are such garbage.\n\nIf you want to ball out get a RetroTINK-4K",
                "points": "21 points",
                "children": [
                  {
                    "comment": "$200 is above my budget for a cable.",
                    "points": "14 points",
                    "children": [
                      {
                        "comment": "That's like 4 Wii's",
                        "points": "5 points",
                        "children": [
                          {
                            "comment": "I still have mine 🤓\n\nWii Fit is gonna be so happy to see me after 15 years",
                            "points": "3 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "No cable can convert an analogue signal into digital, the only way to do this is with an active scan converter.\n\nYou can get them as cheap as $10 if you don't mind outrageous input lag, massive scaling artifacts, and terrible color accuracy though, so that's an option I guess.",
                        "points": "4 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I too watch LTT",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Or you can get your Wii modded for native HDMI output for cheaper",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "My OSSC also works for my PS2 and OG xbox, so it ends up being cheaper than doing all 3 mods.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Wii U adapters work on Wii.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Use a Wii U",
                "points": "3 points",
                "children": [
                  {
                    "comment": "No Gamecube support though :/",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Any Wii-HDMI adapter from a reputable brand (and plenty of unbranded versions) are fine and better than a composite video-HDMI adapter around the same price.\n\nThe Wii adapters are converting the native 480p output of the console instead of converting 480i.\n\nYou can spend a lot more on an upscaler.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I'm going through this right now... I'm finding that to get a really good image with little input lag it gets kinda expensive. Like several hundred dollars for a RetroTink.\n\nAlso, it's all about getting an RGB signal out of your console. Not sure how easy that is on a Wii.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "The Wii had a component output cable that should give you analog RGB with stereo audio output",
                    "points": "8 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Ignore the cheap eBay or Amazon adapters - the Wii2HDMI from Electron Shepherd is the one to get - https://electron-shepherd.com/products/wii2hdmi",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Wii U",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Tbh your best bet it to get a wiiU. They output HDMI natively and you can mod the vWii in them the same way you can the normal Wiis",
                "points": "",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Retrotink 5X",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Wii U",
            "points": "10 points",
            "children": [
              {
                "comment": "Wii U doesn’t have GameCube controller ports though",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "If you get an adapter it does",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "You don't need that if you use Nintendont, you can use any USB or controller adapted to USB or Wii Controllers, and You don't need Memory cards either.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Sounds like a hassle honestly",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Just an An on the Homebrew Channel and you can run any GameCube game you want, from an SD card save the Memory card files on the SD card, force 480p for almost every game and wide screen. Etc. Etc very easy",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "You can use the Wii pro controllers too.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I found a little native adapter. The sound is too loud, but it’s not distorted, and it’s been working great. I have a bunch of games on an attached usb drive, and we still fire it up and have a blast.",
            "points": "2 points",
            "children": [
              {
                "comment": "I do the same with my WiiU. Hacked the vWii the same way as a normal Wii, and now we can play Wii sports whenever we want",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Get a Wii U for cheap you can run all the things and homebrew the Wii can and you get HDMI.",
            "points": "1 point",
            "children": [
              {
                "comment": "I have a homebrew WiiU, and it's great. Kinda wish I had a spare lol",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "In fairness, most any modern PC can run a Wii emulator at 1080p. Grab yourself a cheap blue-tooth dongle for your PC and you can connect a wiimote to it for controls. Pick up a wireless Wii sensor bar that runs on batteries and boom. Wii games at full HDMI. Hell, they even make a combo sensor bar that has bluetooth connection built-in for like $30. All you need is the wiimote.",
            "points": "1 point",
            "children": [
              {
                "comment": "Oh, I agree, but there's something special about using original hardware",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Absolutely fair, and I don't disagree. There's a special magic in it, but at that point, worrying about pushing it beyond its original native resolution seems like a moot point. Hook up to an old CRT and those older systems look just fine at native resolution.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Oh I want gonna push the poor thing. I wish I still had my old Sony Trinitron. Damn thing was actually a 1080i tube. Got for $30 from Craigslist from a family that probably paid thousands for it",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Hell yeah. When I was living in a bachelor pad I scored us a GIGANTIC 70-inch 1080i tube for $200. That shit was video game heaven. Was way too big to reasonably move with though, so unfortunately it got left behind.\n\nThat said, I really do lean more towards emulation on older systems, and any emulator worth its salt has a CRT filter of some kind available that makes them look SO good. I fully support those who are OG hardware enthusiasts, but I just can't justify spending money on all that when I can get the same or better results for my personal taste right here on my computer.",
                            "points": "",
                            "children": [
                              {
                                "comment": "",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I was quite aggregated to find that they only support 480p, but when “jail broken” my output is now 720p.\n\nHow is their no supported Wii / Nintendo update for resolution.",
            "points": "0 points",
            "children": [
              {
                "comment": "Nintendo? Update their consoles? That's a good one lol",
                "points": "1 point",
                "children": [
                  {
                    "comment": "😅",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Didn’t the mini Wii do hdmi?",
            "points": "-1 points",
            "children": [
              {
                "comment": "Nah. Only Wii with HDMI was the Wii U's BC mode.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Oh ok, I guess I remembered incorrectly",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "It also doesn't have GameCube hardware in it, making it significantly less fun to hack",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I jailbroke my Wii back in the day with a wiikey or whatever it was. Had to grind down an IC on the PCB to get access to pins to solder it to, because Nintendo had cut the pins on the outside of the package in an effort to prevent jailbreaking. Good times.",
        "points": "107 points",
        "children": [
          {
            "comment": "I just rented a copy of Twilight Princess, idk when hardmodding was necessary",
            "points": "61 points",
            "children": [
              {
                "comment": "If I remember correctly, hard modding became necessary for later models like the release of the all black wiis.",
                "points": "22 points",
                "children": [
                  {
                    "comment": "All black wii here and I was able to soft mod it when i got it. What i recall about the all black was that you couldn’t mod it to play dvds.",
                    "points": "15 points",
                    "children": [
                      {
                        "comment": "Yep, I've still got a softmodded wii in the living room. Passing on Mario Kart fights to the next generation.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "I think there’s a revision difference between early and later all black Wiis, the later ones that are harder to mod also removed the GameCube controller ports and memory card slots I think",
                        "points": "3 points",
                        "children": [
                          {
                            "comment": "I think the black ones also have a smidge better video signal, though you can mod the white one to have that too. They definitely removed the gamecube ports. The wii U gamecube controller usb adapter works great though",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "That sounds right. I know mine was one of the earlier models.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Yeah, all black was long past the time of DVDx being removed, I have a white Wii without a compatible drive. But we don't need to use burnt DVDs anymore to play games.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I modded the shit out of my black Wii. Still have it and it's in great condition. Sadly I don't use it anymore as I just use Dolphin now.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "It became necessary for a time. These days you just slap the required files on your SD card, plug it into the system, open them from the correct system menu, and bam. Custom Firmware. At that point you can plug in a portable hard drive loaded up with Gamecube and Wii games and use homebrew to launch them all, use cheat codes, etc. Super easy.\n\nPeople think that modding a console is some huge to-do, but 9 times out of 10 it's literally just copy-pasting files onto an SD card/flashdrive and turning on the system. It's a little trickier these days with system firmware updates every couple of months playing cat and mouse with exploits and \"always online\" systems that you have to manually deactivate to prevent your console being bricked, but if you can read and follow simple instructions it's nowhere near the rocket science people seem to think it is.",
                    "points": "4 points",
                    "children": [
                      {
                        "comment": "You've got me making eyes at my \"retired consoles\" shelf. I'd always heard modding consoles was a pain in the ass, but since mine are almost all launch models it might be a bit easier and worth looking into... Breathe a little life back into them rather than dusting them off once a month looking pretty.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "Absolutely. I never fucked with PS3 during it's lifespan because it was constantly changing and updating and methods at the time were complex. Just recently I pulled mine out, looked into it, and I literally had to stick a couple of files on a flash drive, plug it in, then run a file from the menu and viola. Suddenly I can play all those exclusive PS3 games that people are charging $600 for on the resell market without going broke. I'm told that PS4 is getting to that stage as well and I'm half tempted. Apparently the 360 is fairly simple to mod, and the Wii/Wii U are piss easy. When you get back to more classic consoles it's more of a crapshoot. Stuff like the NES/Genesis/N64 only need a flashcart to play their entire library and then some, while the disc-based consoles might require a piece of third-party hardware and a boot disc to get it running stuff off of a hard drive or back-up disc. That said, I straight up \"modded\" my Sega Saturn with a piece of duct tape. You just have to tape the cover indicator down so it thinks the lid is always closed, run a legit disc until it verifies, then swap it out with a back up and there you go. \"Hacked\" Saturn.\n\nHonestly though, if you're gonna go to the trouble, Wii/Wii U will play Gamecube natively along with basically any console generation before it via emulation, and Playstations usually have the power to emulate older generations of their own line, even if it might not be quite perfect. If you've got one particular console that you really enjoyed back in the day with a lot of your favorites native to it, go for that and turn it into a multi-system gamehub via emulation.\n\nIt bears pointing out that doing it during a consoles life span is a fair bit trickier, because there are often multiple people making different iterations of CFW that operate differently, sometimes developers pack it up and quit and if you were using their version you have to jump through hoops to convert to another type, constant firmware updates mean you have to be careful you don't update past what can use CFW currently, certain homebrew will break once you update CFW and you have to wait for that to be updated, and that's not even getting into modern games that require a certain firmware edition to be playable, so sometimes you have to wait to play new games to not lose CFW access, and other times people will find a way to patch it to play on lower firmware. It's a whole thing, and you have to stay pretty on top of it to not be lost when you do want to update.\n\nBasically, if you're looking at classic consoles then you won't have much trouble at all. Just google \"[insert system here] custom firmware\" and you'll probably trip over six different tutorials that you can read over to make it super easy. Unless you're dying to mess with the latest hardware and see how hard you can push it's limits, don't worry about them, because it'll be a whole ordeal and is often rife with developer drama for no good reason.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Black wii. Soft mod using...letter bomb? I think.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I hardmodded mine a week after launch. I never bought a single game. Then after a couple years you could just jailbreak and store everything on a hard drive instead of burning games on disks",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Omg where you load the save and walk backwards?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "That d2c chip drove the discovery of Banner bomb and a bunch of game save overflows. The hardware mods had a huge limitation in that no additional content worked like eShop titles or DLC",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Nintendo’s veritable army of lawyers will never let this happen",
        "points": "234 points",
        "children": [
          {
            "comment": "Don’t be so sure, the exact same thing was done to the 3DS and they haven’t been able to stop it",
            "points": "117 points",
            "children": [
              {
                "comment": "Not entirely true. The og freeshop did get killed eventually because it was actually dling from ninty servers.",
                "points": "52 points",
                "children": [
                  {
                    "comment": "Hshop is running on its own repository, which this seems to be as well. They updated the 3ds firmware since then, but that's only answered some common methods of hacking. It hasn't addressed the source of the free games.",
                    "points": "37 points",
                    "children": [
                      {
                        "comment": "Nintendo can never black 3ds hacking in its entirety, it's a hardware level fault that's gotta he fixed. I'd imagine the same goes for the Wii and WiiU",
                        "points": "8 points",
                        "children": [
                          {
                            "comment": "Yup. I was there from the very beginning of custom firmware development on the 3DS and watched it all play out. Some obscure game has a flaw that allows the loading of third-party software, shoots up in price, Nintendo patches it, another backdoor is found, rinse repeat a few times, then someone discovers that you can get the system into recovery mode by using a straight up magnet to trick the system into thinking it's closed. They've developed easier software-only methods since that take advantage of built-in basic software on the system, but even if Nintendo pushed another update at this point to address it, we'll always be able to put custom software on the system with a fridge magnet, and there's nothing they can do. It literally cannot be fixed.\n\nEven if they found a way to patch the firmware to eliminate current methods, someone would find a new way. I've been an enthusiast of custom firmware for decades at this point, and I've watched people endlessly roll into discussions talking about how a system is \"unhackable\" and there will never be custom firmware, then half a year later there it is. Then they start talking about how the latest update will never be exploited, and a month after that update has an exploit found. There isn't a piece of software in the world that can't be exploited, modified, hacked, or worked around given knowledge and dedication.\n\nThe fact that the 3DS has a straight up physical feature that makes it fully exploitable is actually kinda rare in the modern age. The Wii/Wii U don't have the same kind of hardware \"flaw\", but part of the way their basic programming works just leaves them easily exploitable, no matter what Nintendo tried to update. Programmers caught on a long time ago and when they found useful exploits they didn't tell anyone and waited until a final update was pushed to systems to say \"Okay, so here's this thing the creators missed and now that they're done we can hack all updates and versions of this system.\" It happened with the PSVita, and even when Sony pushed out a surprise firmware update afterwards it didn't solve the problem. The fact is, nothing is unhackable, and the internet will always outnumber corporate programmers.\n\nAdd on to that the fact that you can't ever scrub something entirely from the internet, and that taking down one resource just means two more will take it's place from a database backup, and online e-shops for the 3DS aren't going anywhere. They might go down for a short time, but something will always replace them. Nintendo thought they got rid of piracy when they dropped a ton of lawsuits a few years back and nuked some famous, long-standing sites, but all they did was make people more creative, and now it's easier than ever to find whatever video game you want with google and a pinch of common sense.\n\nBasically, nothing is ever going to make game consoles unhackable, even hardware revisions, and nothing is ever going to scrub piracy from the internet. This free-shop ain't going anywhere.",
                            "points": "8 points",
                            "children": [
                              {
                                "comment": "Not to mention the first hardware version of the Switch. I still have mine and use it regularly",
                                "points": "0 points",
                                "children": [
                                  {
                                    "comment": "",
                                    "points": "",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "Same with the Switch V1 which they are incredibly pissed about",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "I got super lucky and nabbed a v1 from a pawn shop in 2020. Replaced the thumbsticks and everything has been smooth sailing ever since",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "what the hecc is a dling?",
                    "points": "-1 points",
                    "children": [
                      {
                        "comment": "What the heck is a hecc?",
                        "points": "3 points",
                        "children": [
                          {
                            "comment": "a shortened way of writing heck",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "but it's not shortened",
                                "points": "2 points",
                                "children": [
                                  {
                                    "comment": "😅 I never claimed to be an englishologist",
                                    "points": "2 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Downloading",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "wtf",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "DownLoadING",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "My 12 year old sister getting a cease and desist for selling old hot topic shirts with mario on them on her etsy",
            "points": "12 points",
            "children": [
              {
                "comment": "Wait for real? I can't imagine that has any actual standing.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "yeah i would have ignored that, unless she was claiming it as her original work, theres nothing illegal about reselling nor does it infringe on copyrights. Thats like Samsung suing me for selling my phone on facebook…",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Nintendo doesnt have a moral leg to stand on. Piracy is moral when the goods aren’t available to purchase any longer.",
            "points": "1 point",
            "children": [
              {
                "comment": "Capitalism isn't moral. Nintendo doesn't give a shit about morals.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Tell that to the active 3DS modding community lol",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The hackers in the Wii scene have always been cool - back in the day I followed team Twiizers and that scene, hacked my Wii to play stuff from a hard drive.\n\nA few months ago I decided to fix it up - to my surprise the scene is still alive and had one script I could run to update everything, and they even have online multiplayer and the Wii channels hacked to actually work today. Only hiccup was having to setup a separate WiFi network for it.\n\nReally no need for a service like this, you can do it over your local network already or just use a hard drive like I do.",
        "points": "40 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "my local pawn shops used to give you a wii for free with purchase. they had so many they were basically worthless to them",
        "points": "31 points",
        "children": [
          {
            "comment": "Seems like there’s a time after a consoles launch when it just becomes worthless… until the value swings the other way.\n\nLike in 2007 when my friend said “hey you want this old Dreamcast, controllers and a box of games? I don’t play it. Just take it.”",
            "points": "6 points",
            "children": [
              {
                "comment": "Yep, I got all sorts of Saturn games for almost nothing because it was practically e-waste at that point.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "if you look at the numbers, there are more nintendo switches out there",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Recently been having a lot of fun with my homebrew Wii. It’s so nostalgic and can do so much fun stuff. You can get the component out cables (5 color) to do 480p natively from the Wii. Honestly, that looks really good. I have mine hooked up to a Trinitron CRT that only does 480i so it’s “max resolution!” lol. But seriously, mod you Wii. It’s fun.",
        "points": "11 points",
        "children": [
          {
            "comment": "Good hhd to the USB port in the back and you can put the whole library in that bad boy",
            "points": "5 points",
            "children": [
              {
                "comment": "Just did that myself... ~700wii and 1000NES.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "I need to pick up one of the mics that's compatible for all the karaoke.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Same here! I just added an external HDD to mine, downloaded 700+ Wii games and then installed an NES Emulator and installed 1000 of those NES games. It's quite overwhelming but in a good way.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I just wish I could play those extra Mario Kart levels that were only available online.",
        "points": "7 points",
        "children": [
          {
            "comment": "Its still possible, https://wiki.tockdom.com/wiki/Tournament_Museum",
            "points": "9 points",
            "children": [
              {
                "comment": "Thanks I had no idea.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "You should also look up ctgp revolution\n\nThey added like over 200 new tracks. Pretty sure it works online too.",
            "points": "2 points",
            "children": [
              {
                "comment": "Thanks, sounds interesting!",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Im told that Nintendo got lazy with its Wii/WiiU store encryption, which made it easy for someone to create an app that literally downloads the games to your Windows PC for free, copy the files to a SDHC card, install using homebrew software. Done and Done.\n\nWiiU may not have been popular, but its freaking awesome for hacking. It will play almost everything and GameCube/Wii games dont even need emulation as they use the same OS as the WiiU. Connect a 1TB external SSD and have enough room for almost every GC/Wii/WiiU game, everything else can be stored on the SDHC. You can even buy adapters that let you connect N64 or Sega controllers to your Wii Remote. The Gamepad controller even upscales old NES-N64 roms, making them more playable.",
        "points": "7 points",
        "children": [
          {
            "comment": "That sounds fun, but honestly question, why not just emulate at this point?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "IMO If someone buys a digital item and it becomes unavailable from the original source that shouldn't mean that the purchaser loses his rights to the item.\n\nConsumers should have their rights protected.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So let’s say I had a Wii still…. And I want to AVOID doing this so I don’t go to prison on accident. What website do I need to stay away from?",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The wii is still a charming system. Muramasa demon blade is underrated",
        "points": "3 points",
        "children": [
          {
            "comment": "I loved that game - but I thought the screen was too small to fit all the action",
            "points": "1 point",
            "children": [
              {
                "comment": "get component cables or play it on Wii U, it looks a lot better on a big HDTV that way. There's insane detail.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The wii has been the one console I always have running.",
        "points": "4 points",
        "children": [
          {
            "comment": "Same. Mine is an original (first series) lol I am wondering how I modify my HomeBrew to access ALL the games and not just what is on my hard drive. Anyone know? It’s been so long I don’t want to mess up what I already have",
            "points": "0 points",
            "children": [
              {
                "comment": "What do you mean exactly? Are you using a backup loader to load them? Usb Loader GX is the one is use to access all my channels wii and gc backups I think.. I usually just have nintendont running so it's been awhile I'd have to double check to make sure.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Anybody have a guide to get something like this on a Wii? I found a working one at a thrift shop for 25$ but a lot of the games I want to play are expensive and hard to find.",
        "points": "4 points",
        "children": [
          {
            "comment": "r/wiihacks",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I just used this easy guide. I now have 700+Wii games and about 1000 NES games installed on my HDD that's connected to my Wii.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Wii Shop Wednesday are back boys!",
        "points": "7 points",
        "children": [
          {
            "comment": "Super Mario RPG\n\nSonic the Hedgehog\n\nDonkey Kong 3",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why do you need a digital storefront though for a jailbroken Wii? When all you need is an SD card? The whole internet is a digital storefront. I'm not about to be posting links, but if you really can't find what you need then you aren't looking very hard.",
        "points": "3 points",
        "children": [
          {
            "comment": "I can only speak from 3ds perspective which has a similar shop. It's very convenient to install new software directly on the device, without the need to remove your SD card, plug it into your PC, download the software and plug it back into the console.",
            "points": "8 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Does this work for the Wii U in Wii mode?",
        "points": "5 points",
        "children": [
          {
            "comment": "There’s already guides to jailbreak the Wii U, they’re not hard to find",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I had that thing that gave me every wii game for my nieces 10 years ago.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In my opinion, the Wii + WiiU are the best consoles ever made by Nintendo. Both still have a place in our home.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That's a shame; I'm only interested in the analog wii gamss.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I mean, happens with pretty much every Nintendo system..lol, even the Switch has had various shops pop up. They’re already aware, they do what they can to stop them but every time they strike one down another pops up.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What? I only mine to play Melee. Is this the same thing as the Homebrew?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Could the 15 of us who bought a Wii U take advantage of this with the Wii software on the console?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don't care about the games. I just want to sit & listen to the music for an hour.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "One of these already exists for hacked Vitas, it's glorious. So many games...",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Literally no reason for Nintendo to take this down, they shut down the services, basically they will make no more profit from the Wii, it's not worth it monetarily",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“Many critical functions, including downloading games and apps, don't work yet”\n\nThis isn’t going anywhere",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nintendos Attorneys.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why play on the Wii at shit 480p when you can emulate on PC in 4k?",
        "points": "1 point",
        "children": [
          {
            "comment": "people can and will have fun even at 480p :)",
            "points": "2 points",
            "children": [
              {
                "comment": "Yeah but an PC bought in the past five years will take care of this, and is just a few clicks away.",
                "points": "-2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Now I wouldn’t have cared years ago, since I have my favorite games backed up” already but with my 3 year old this could be awesome lol.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nintendo lawyers be like:",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is such old news.",
        "points": "-11 points",
        "children": [
          {
            "comment": "Well, I never heard about it, it’s news to me.",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "woah watch out for this trendsetter, guys",
            "points": "1 point",
            "children": [
              {
                "comment": "It really has been at least five or so years that people can do this. But hey if it’s new to then that makes this article not a waste.",
                "points": "-2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Buy the games m/movies and support your developers and actors… or we deal with strikes that can bring these industries to a halt. People and the workers themselves complain about pay, yet still choose to a pirate. Companies will always always 1up the consumer. Up to us to be the bigger side of it and start doing what’s legally right on our end.",
        "points": "-10 points",
        "children": [
          {
            "comment": "You literally cannot buy these games legally from the developers anymore in most cases. Pirating games still available on store shelves is bad imo, but Wii era? They shut down the storefront so the only use people are getting out of their Wii are physical games. Heck, there’s tons of digital only Wii ware games that are almost certainly never going to see the light of day again that someone might play pirated and then go on to support the devs new games.",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "No.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "OK, where can I buy them Wii Channels?",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The Wii shop was permanently shut down and these games aren't sold in stores, so how exactly do you propose people go about doing that? If you don't understand something then you probably shouldn't speak to it.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Companies will always always 1up the consumer. Up to us to be the bigger side of it and start doing what’s legally right on our end.\n\nif companies always one-up the consumer (which i agree with by the way, or at least they try to), wouldn't it logically follow that we should refuse to partake in the market on their terms, pirating games instead?",
            "points": "0 points",
            "children": [
              {
                "comment": "We only really need to get caught once, then we’re going to be piss poor forever paying the executives even more. The reward for the risk of the penalties to real life is what makes me not pirate.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "what do you feel that the chances are of getting caught?",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Pretty fat since I only own a work issued computer and phone. It’s not just about the risk. The idea of it makes me feel like a pos for doing that to people who are expecting a paycheck.",
                        "points": "",
                        "children": [
                          {
                            "comment": "Pretty fat since I only own a work issued computer and phone\n\noh, okay, well that's different then. but you can't pretend that those circumstances apply to the majority of people\n\nThe idea of it makes me feel like a pos for doing that to people who are expecting a paycheck.\n\nwhich people did you mean specifically, the company that owns the rights to the intellectual property?",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Until Nintendo crushes them",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Homebrewing your Wii and adding HDMI is easy. The real challenge is getting the controllers/sensor bar to work with the large size TVs today that weren’t in the original design spec. (Open to suggestions on this!)",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "mario kart!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Expect that to be patched real quick",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19a9g3c",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.pcworld.com/article/2211322/asus-says-intels-nuc-extreme-isnt-coming-back.html",
    "title": "Asus says Intel’s NUC Extreme isn’t coming back",
    "points": null,
    "comments": [
      {
        "comment": "FUC!",
        "points": "66 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The moment Intel was like \"nuc is gone but the others can still do it, we encourage it!\" this was kind of destined to happen. No company gave enough of a shit even though the barebones pc thing is a neat idea.",
        "points": "37 points",
        "children": [
          {
            "comment": "Asus bought the NUC division and is releasing new models this year, they just aren’t releasing a version of the system that had the main board as an add in board with a PCIe slot",
            "points": "18 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I mean might as well build an itx system with actual upgradability",
        "points": "19 points",
        "children": [
          {
            "comment": "Non Upgradable Computer",
            "points": "10 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I really liked the idea, but it was never a fit for anything I wanted to do. I guess I wasn't alone in that.",
        "points": "7 points",
        "children": [
          {
            "comment": "It works great for my dad who only needs to browse the web and work on basic documents. Pensioner PC market probably isn't huge though.",
            "points": "5 points",
            "children": [
              {
                "comment": "A lot of people like that just get a laptop.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Or all in ones",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It worked really great for many folks wanting a home server. You could fit it behind a TV, in electrical box or whatnot. I guess for things like POS systems, there are cheaper options and even an iPad might make more sense.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The Extreme was probably a fan service. I don't think majority of the sales of it were made there as I saw more regular cube NUC in conference rooms and never seen an Extreme.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The only thing I’ve ever liked about the NUC is that it has a skull on it for some reason.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19a88iy",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://arstechnica.com/gadgets/2024/01/samsung-may-charge-users-for-galaxy-s24-ai-features-after-2-years/",
    "title": "Samsung’s Galaxy S24 phone might someday have fees for AI usage | Samsung says AI features are \"free until the end of 2025.\"",
    "points": null,
    "comments": [
      {
        "comment": "I'm so fucking tired of everyone making every aspect of life basically fucking DLC.",
        "points": "610 points",
        "children": [
          {
            "comment": "It's not even DLC, it's nothing but subscription services, enshittification, and shrinfklation all the way down. We know they would absolutely love to bring back company towns and company script if they could.",
            "points": "181 points",
            "children": [
              {
                "comment": "The ebay scandal is proof that it’s the laws that protect us. The base instinct to profit, whatever the cost maybe to life and limb has not changed.\n\nRegulate them.",
                "points": "51 points",
                "children": [
                  {
                    "comment": "Ebay scandal?",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "I'm assuming this:\n\nhttps://www.cbsnews.com/news/investigation-ebay-employees-stalk-harass-couple-60-minutes-transcript-2023-03-26/",
                        "points": "15 points",
                        "children": [
                          {
                            "comment": "God Damn.\n\nThat's wild.",
                            "points": "8 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "That was an insane read, thank you.",
                            "points": "7 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "I am curious on this as well",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "No it isnt. Fucking lol regarded reddit take.\n\nThe law and helps the big companies trounce new competitors and keep them away. And the consumes are too fucking stupid to understand that THEY are the cause of the companies acting the way they do - because you keep giving them money. They dont go to competitors, especially not new ones if they're just a tiny bit more expensive.\n\nConsumers are also not willing to NOT buy the shit. Because 'sumers gonna 'sume.\n\nRegulation will do fucking nothing. You think the old oil moneys were afraid of Teddys regulations? Fuck no, they laughed at them and got richer because of them.",
                    "points": "-4 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Samsung already essentially has a company city, look up Suwon. They control everything from health care and transportation to food and childcare.",
                "points": "16 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "You're gonna be tired for a long long time my dude\n\nYour kids will know little of owning anything without strings\n\nLife sucks. But I stand by it always has",
            "points": "56 points",
            "children": [
              {
                "comment": "We can fight this. Our passiveness is the only thing that let those kind of shit happening. Laws can be passed given enough voters incentive.",
                "points": "50 points",
                "children": [
                  {
                    "comment": "Don’t need a law, need enough people not to buy the product is all.",
                    "points": "9 points",
                    "children": [
                      {
                        "comment": "This is not gonna work that's the problem. This has been an issue in gaming for a while now. Developers release shit/incomplete products, but people still preorder/buy that garbage and they're still making a fortune off of it.",
                        "points": "4 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "This is the way",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "More laws are how we got here in the first place",
                    "points": "-6 points",
                    "children": [
                      {
                        "comment": "In what way ?",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "You say that like I have plans to have kids in this hell landscape",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Good. Please don't",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Features on a physical product shouldn’t have servitization",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I literally do not get this complaint. Ai features are inhernently server dependent",
            "points": "-1 points",
            "children": [
              {
                "comment": "They are offering there ai service to make their physical hardware more attractive. Include it in your price calculation for your hardware product.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "they did, that's why the first year is free. Also it's not like the price is a bad deal compared to the s24 ultra. It is a step up in basically every aspect hardware wise",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "And spamming the ai tag",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "People will buy. So they will sell",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "more tired than spamming the word AI on every single feature/product?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "What features will these AI phones have that people will be willing to pay ?\n\nI am unable to understand the whole AI in this AI in that.\n\nAn AI based voice assistant. I don't see the charm. It's useless.",
        "points": "340 points",
        "children": [
          {
            "comment": "All I've seen is that you can circle around items on photos and remove/replace it or let Google look up some search results of that",
            "points": "118 points",
            "children": [
              {
                "comment": "I thought that was a feature Google was adding to Android (hence why it's also coming to the Pixel), not a Samsung AI feature?",
                "points": "54 points",
                "children": [
                  {
                    "comment": "Google says it's pixel 8/8 pro exclusive when it comes to pixel phones so is not for Android, as it stands right now only the Galaxy s24 series and pixel 8 series will have it.\n\nAlso this isn't a really new feature, it is basically google lens with a different UI.\n\nRight now you can do the same thing on a pixel by going into the recent app view and press and hold on an image and you get the option to search it with lens, the main difference is that you can't just directly search an item in picture, you first have to enable Google Lens for that picture then move the lens square to the item in the photo, the new one is a little faster way of doing it.",
                    "points": "46 points",
                    "children": [
                      {
                        "comment": "I discovered this feature the other day in the Google photos app. It does actually work. I'm not sure if it's a normal feature in the app, or part of my storage plan? I have an S20 FE not a Pixel.",
                        "points": "10 points",
                        "children": [
                          {
                            "comment": "That's normal, it works in google photos on any phone.",
                            "points": "14 points",
                            "children": [
                              {
                                "comment": "",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "And the S23 series and 2023's Fold/Flip iirc",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I believe the latest s24 Samsung phone has it baked into Samsung photos and it’s different in behavior then the pixel editor",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Also the live translation for phone calls seems like it could be useful for a lot of people.",
                "points": "10 points",
                "children": [
                  {
                    "comment": "That feature is local to the phone so no Internet required. It's unlikely that would be included. Then again it could be a subscription and you have to connect to the Internet periodically to verify it...",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "All I've seen is that you can circle around items on photos and remove/replace\n\nI saw it on mkbhds video and the generated background when you replace something looks terrible. Also it adds a permanent watermark on the picture lmao\n\nAnd literally everyone can use Google image reverse search all this does is make it a bit simpler to use thats all.\nThis whole \"AI\" thing is a joke imo",
                "points": "7 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "All I've seen is that you can circle around items on photos and remove/replace it\n\nThey have that on their phones now, my S22 has it.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Interesting! But also weird that Samsung pays influencers to exactly show these features in their instagram stories to promote the AI thing haha",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Last time samsung tried forcing an assistant on us we got bixby. And bixby was universally hated.",
            "points": "45 points",
            "children": [
              {
                "comment": "Still waiting on that waifu assistant that leak some years ago!",
                "points": "9 points",
                "children": [
                  {
                    "comment": "I think the story of that is the internet literally created so much porn of the character that the company actually stopped using it for that reason. Like literally the character became primarily associated with r/rule34 more than it was samsung.",
                    "points": "7 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Bixby ultimately provided me with an extra physical button I remapped to do things that are actually useful, like toggling the flashlight on a long press",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Yup, my S10 is nearly 5 years old and I never activated Bixby lol",
                    "points": "7 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Yeah but they made it more of a hassle than it should be to remap that button.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Yeah I have to use a third party app to do it. They should just be cool and give you the option to remap it themselves.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Damn, now I imagined phones with... buttons. That you can program to whatever you want. That would be awesome.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The reality is \"AI\" has been a thing you've used on smartphones since their inception. The new corporate label of AI is literally just rebranding with a shiny-new label and/or some machine learning on top.",
            "points": "17 points",
            "children": [
              {
                "comment": "…And a subscription.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Live translation of calls/texts\nRecording, transcribing and summarising meetings, including detection of who is talking\nTranscribing and re-formatting notes\nIntelligent fill in photo editing\n\nNot useful for everyone but for some it'll be worth it, I'd prefer not to pay for it as part of the device and have the option to subscribe if I'd use it.",
            "points": "5 points",
            "children": [
              {
                "comment": "I suppose these are not local processes, that need an internet connection to work, thus the sub is there to cover hosting and ML costs?",
                "points": "0 points",
                "children": [
                  {
                    "comment": "It's a mixture, but yeah partially",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "None of it is something I'd pay for out of my pocket at least.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Well you see you can put cat ears on a photo so",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "filter bad photos from my library\n\nmy mom is turning 50. Choose a good picture of her and make it into a postcard\n\ncheck my inbox, delete and unsubscribe from spam emails\n\nmake a list of upcoming birthdays, create a suggestion list of gifts with links to purchase them\n\ngo through my messenger, prepare a list of hanging conversations I forgot about\n\nmake a list of contacs that are flirting with me without me realizing\n\nmake a list of meetings I agreed for that are not in my calendar, add them to my calendar, range them by importance\n\nI just made it up but with how booming the technology ATM I wouldn't be surprised if it is available by the end of 2025",
            "points": "-3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yeah, didn't Apple just announce this type of deal too? I'm lazy and not gonna watch a whole press conference, 1 hour and 59 minutes of patting themselves on the back, then \"by the way this apple sauce will make all of your relatives immediately die\". Are they saying you can't use predictive searching at all if you don't pay for it premium? Like... most modern phones are using some sort of AI. They better price lock their app store then, it uses AI every day to recommend things.",
            "points": "-7 points",
            "children": [
              {
                "comment": "The only free now / paid later feature Apple has announced was the emergency satellite messaging, and they've extended that deadline anyway.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Smarter Bixby nag screens?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It feels like they are trying to solve problems that don’t exist. I was actually disappointed with all the AI stuff.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "If this phone didn't have these features it would almost literally be last year's model with a flat display, titanium, and a faster processor. But I wish they actually innovated rather than giving us useless features like this that are disguised as innovation. If I really want AI, I can just open up chat gpt lol.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Real time translations for text and voice calls may be one of the big ones. But that is a specific user profile. Business users mostly I imagine.\n\nTranscription with voice separation was another. Kinda cool I guess but there are other transcription apps and services or there.\n\nNote organization and summarizing. Neat but I wouldn't pay a subscription fee for it.\n\nAnd then the image searching capabilities. Again, neat but I don't see myself payong a subscription for it.\n\nI pre ordered the s24 just because I am due for a new phone and it's basically free from Verizon with an ultimate plan and a trade in. I see the AI stuff as a fun new gimmick but if they start charging fees for it this may be the last Samsung phone I buy.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This will go like the “heated seats of BMW”, they put the feature under a subscription, no one bought it, they switched back.\n\nBMW drops plan to charge a monthly fee for heated seats - The Verge",
        "points": "220 points",
        "children": [
          {
            "comment": "Samsung is just seeing if they're able to get away with it. If other manufacturers do the same it'll be a bonus for them, if not they'll get rid of it and claim the goodwill for it.",
            "points": "38 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "With one major difference, in order for some AI functions to work, a server in their cloud has to dedicate time for your phone which costs money. It somehow needs to be paid if their cloud costs are sky rocketing. It's either a subscription (if you use it more than fair use policy, it could have a limited free tier) or a bigger price for the phone for everyone.\n\nLook up how much it costs OpenAI for everyone to use ChatGPT, even though it's free for users. There needs to be an extra goal to allow those costs to be made (e.g. training their AI model). If that is no longer the case, or those costs can't be justified, it needs to be paid for by someone else. It's not a charity.\n\nBMW just made the cost already for everyone by implementing a physical thing in the car but didn't make it functional for the standard price of the car. It isn't a variable like cloud costs that are dependant on usage.",
            "points": "8 points",
            "children": [
              {
                "comment": "a server in their cloud has to dedicate time for your phone which costs money. It somehow needs to be paid if their cloud costs are sky rocketing.\n\nSounds like a personal problem. They should chill on the streaming subscriptions, cut eating out down to once a year and strive not to get the $5 chilled lattes anymore out and about.\n\nCompanies like this can pound sand and piss off. \"Paid Feature Creep\" will just ratchet up to where the phone is still expensive as hell, and everything is tacked on like a appetizer menu at the restaurant. Need to make phone calls? That's a fee cause it's AI \"assisted\" somehow! Take a photo? You guessed it.... Long press and tap copy/paste? One guess...\n\nSamsung is a giant company that can \"shuffle around\" their expenses into other company divisions. We are not talking a rinky dink startup in a non existent garage rags to riches story.\n\nSlash and burn the stockholders/executives demanding unobtainable ROI numbers by the hour instead and watch the \"issue\" magically correct itself",
                "points": "29 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Yes. It couldn't be less like heated seats.",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "And?\n\nWhats your point? Samsung adding a feature no one wanted and then complaining about the cost is the height of stupidity.\n\nNo one WANTS anything other than good quality products form Samsung, and we can't even get that anymore outside the Phone/Tablet market.",
                "points": "9 points",
                "children": [
                  {
                    "comment": "My point? That it's not the same as a physical object that they lock behind a subscription.\n\nWhat's your point of your reply to me? I never said if I or the world will want to pay for it. Tbh I couldn't care less, it'll be what it'll be.\n\nJust stating a view on the matter on why a business may put a limit on it being free.",
                    "points": "23 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Samsung aren't \"complaining about the cost\".\n\nAI subscription, and usage, will be optional, so users also have no reason to complain.\n\n\"No one WANTS anything other than good quality products form Samsung,\"\n\nThey lost me at the point I could no longer have an SD card or 3.5mm jack.",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "If you really believe that no one wants or cares about it, then there's literally nothing to be upset about. You should be looking forward to two years from now when free runs out and Samsung realizes they wasted everything they poured into their plans for the service when everyone says no thanks to paying the subscription.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "It is kind of amazing how Samsung was the absolute king of TVs through the late 2000s early 2010s and then just dwindled and fell off and let LG eat their lunch, who used to make absolute shit TVs but now make the best TVs available",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "in order for some AI functions to work, a server in their cloud has to dedicate time for your phone which costs money\n\nSo they're selling a product whose costs aren't covered in the purchase price?\n\nSounds like someone needs to go back to Math 101.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Thats how most free AI products work at the moment. In the end, they will all get a fair use policy or subscription model.\n\nWhile it's free, it's to try and get people to rely on/want to use those features. And to train their AI models.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Except these are phones that cost (Ultra models) over £1k / $1k on release for a number increment and generally small spec bump. Flagship models used to be half what they cost now and I highly doubt the cost to make them has doubled for what are incremental bumps.\n\nIt's unfair to try and use OpenAI for comparison because that is essentially all they do whereas this phone does plenty of things with AI thrown in.",
                "points": "-2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "If only they made money by using your personal data for marketing purposes and selling their devices for like twice/trice the money it costs to manufacture🤔",
                "points": "-2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "That's only half-true. You can have AI running locally with a snapshot of the trained model, not everything needs to be cloud based.\n\nDepends on the processing power needs and online capabilities of what the AI is doing, more often than not these things are done \"in the cloud\" not because of those but because they want to keep the model locked up behind bars so nobody else can use it without their limitations, and so they can keep profiteering by selling you a service that was most likely trained on data they didn't pay for.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "This has server costs. (And BMW also had an option to buy it out right.)",
            "points": "3 points",
            "children": [
              {
                "comment": "You missed both major points here.\n\nYes there are server costs, there's also support and warranty costs.\n\nIf they are advertising \"feature X\" to sell me a phone, \"feature X\" should continue to work until the phone dies.\n\nIf they want to sell extra features fine, but they can't tell me my phone can face-swap, then charge me for it again after 2 years, I've already paid for it. It was their choice to use a cloud service for it, not mine.\n\nThe BMW thing, the hardware was already part of your car, you owned it. It was 2 inches from your ass, in your own car. BMW charging you to turn it on is stupid.\n\nBuying it outright? You are already sitting on it! It came with the car!",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Apple is doing AI processing on device, and plans to do in the future as well, for privacy reasons. Nothing stops Samsung for doing the same. But it is harder to ask subscription from that…",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Until Apple does it, then stupid iSheep will lose their minds.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You underestimate the stupidity of people, if Apple does this for 10x the cost the sheep will flock to it and call it revolutionary!\n\nI absolutely despise braindead consumerism and brand \"loyalty\" towards some big predatory corp like Apple...",
            "points": "-3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Was this legit? I thought it was a meme lmao",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Don't really care for AI.\n\nI still have a new Samsung Policy to agree to on my phone which has been sitting there for almost 3 years.\n\nAs you get older, these things really don't matter anymore.",
        "points": "82 points",
        "children": [
          {
            "comment": "Ha I'm glad I'm not the only one who just ignores that notification every Friday",
            "points": "16 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "That's so true. When I was younger, I was all about the newest tech. Now, I barely touch the majority of features these phones have. I use my phone to text, browse, and occasionally make calls.",
            "points": "5 points",
            "children": [
              {
                "comment": "When did the change happen for you? I think it was around 18-20 for me.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I don't think there's ever a time in your life when software license agreements feel like they matter.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Right. Just like older folks \"didn't really care\" for cameras on phones. I remember when that happened. Every MF from here to Timbuktu over the age of like 40 was like \"now why on earth would I \"need\" a camera on my phone!? How ridiculous. This gimmick will die in no time, people can just buy a camera.\" And of course, here we are. Nearly every older \"common sense\" person was simply wrong about that. Then the iPhone came, and everyone over 40 once again was so obviously wrong about that too. I think past a certain age you just think \"this new gimmick can't be something\" even when it obviously will be.\n\nAI will be the same spiel. There will be some folks who say \"meh, AI buzzword marketing mumbo jumbo it's nothing anyway\" but by this time next year every single device that can run some type of LLM AI will be doing that. Because duh. The amount of shit you can get your devices to do with it is nearly endless. Pretty soon I'll be able to tell my phone to send emails, calls, texts, make appointments, and it won't be some god awful thing like Siri where you have to robo-speak slowly and clearly, and then do the actual tasks step by step mostly yourself- it will be truly automated and seamless. And it will be huge.\n\nAnd then people like you will be like \"well no one could have seen it coming or just how important it would become to daily life!\"\n\nAnd then it will start replacing people's jobs, as we all know it will. And more people will somehow be surprised.\n\nEye roll",
            "points": "1 point",
            "children": [
              {
                "comment": "Nice wall.\n\nAs you get older your don't care if your phone has 4x 120MP cameras with f1.6 lenses and 9 stops of dynamic range.\n\nYou just take photos.\n\nRoll eye",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "What's that policy about ?",
            "points": "1 point",
            "children": [
              {
                "comment": "Privacy or something, I just scroll it to the right every month it shows up.",
                "points": "9 points",
                "children": [
                  {
                    "comment": "Good on you.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "Thanks.",
                        "points": "5 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I did this as well but doesn't it automatically acknowledge when swiping away?",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "no, I swipe away the notification and it keeps asking me to agree to it every week.\n\nI'm not a lawyer but I suspect there may be some legal lines that would be crossed if dismissing a notification counted as a user agreeing to terms",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Neat.\n\nI’m inclined to decline that offer",
        "points": "61 points",
        "children": [
          {
            "comment": "You mean after a while my phone de-bloats itself from having extra AI junk?\n\nWin win.",
            "points": "10 points",
            "children": [
              {
                "comment": "If only it happened to Bixby.",
                "points": "7 points",
                "children": [
                  {
                    "comment": "Holy shit, can you imagine how far their heads must be up their own asses if they tried to start charging people for bixby?",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I'm disinclined to acquiesce to your request.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Then you have to pay up front, $1500. You could've gotten it for $750 and $9.99/month for the next 6 years. Some people",
            "points": "-1 points",
            "children": [
              {
                "comment": "Or I could just not buy that phone.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'd settle for the ability to uninstall all of that Samsung bloatware.",
        "points": "44 points",
        "children": [
          {
            "comment": "Nnooo but you really need this Ai feature that tells you what is in the picture my dude. It's super useful and not a gimmick at all. Imagine how many times in your life you see something and you think to yourself : i wonder what this is. Now with only $9.99 a month you get to answer that question.\n\n🤢🤢🤢",
            "points": "14 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Ew, no.\n\nIt'll probably be a core system app like Google Chrome. Want to uninstall? Too bad! Have to have this app you never use just sit there forever.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "As long as I can disable it or choose not to use it. I don't care if they want to charge for it. If I ever find that I do want to use AI for some reason, there are plenty of free options.",
        "points": "16 points",
        "children": [
          {
            "comment": "you can, you can disable all the cloud version in the settings. annoyingly the feature will still be shown in the apps, you just can't use it without re enabling the cloud AI settings",
            "points": "7 points",
            "children": [
              {
                "comment": "Yeah, I don't see a problem with that. Similar to Microsoft Copilot, I can see how some businesses have a use case to pay for that but I'm not going to. I can just use software to bind the Copilot key on a laptop to another function as well.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The rest of the world trying to figure out how to turn off all of the samsung bullshit on our galaxy phones.\n\nGod damnit, Biggsby",
        "points": "14 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well. That just cancelled my order then. Shame. I need a new phone. ASUS ROG phone it is then.",
        "points": "36 points",
        "children": [
          {
            "comment": "I'm still using an S10. (Never enabled Bixby on that one). What online AI features were you looking forward to? Is it like camera stuff?",
            "points": "14 points",
            "children": [
              {
                "comment": "Bixby's mutilated body is scattered in the same depths as hell as cortana's",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Don't do it. They are pieces of heavy dog shit. Good luck finding replacement parts when it breaks .",
            "points": "9 points",
            "children": [
              {
                "comment": "Why buy parts? Just replace the phone, pretty easy.",
                "points": "-20 points",
                "children": [
                  {
                    "comment": "How you doin money bags",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "Is that a question? I'm doing great, how are you?",
                        "points": "-8 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Was planning on replacing the battery on my current phone, then buying a new one once the 2027 EU law about replaceable batteries come into effect.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "That's a piece of shit phone. The Nubia red magic 9 pro is literally way better for half the price. $600 vs $1200.\n\nI would rather burn my money than spend it on an ROG phone.\n\nIf you really want a good camera. Then the nubia z60 ultra is amazing.",
            "points": "2 points",
            "children": [
              {
                "comment": "Do you have long term experiences with ZTE? I own a note20 ultra. Hardware is still excellent but I've read that they stop patching it this year.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "As long as the hardware is flagship grade.You don't have anything to worry about. GSMArena well praised the phone. It's so insane how good this phone is. Also under screen selfie makes the screen very beautiful.\n\nAnd it's a snapdragon soc. It's gonna be supported by custom roms for years. And I believe it's granted 2 years of updates just like Asus.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I was potentially looking at one of these - was it for the storage + the headphone jack? That's why it appealed to me",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Just like buying a Subaru and getting a free 3yrs of starling service but having to pay a subscription for the same service every year for the rest of the vehicles life.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "well yeah, its not like they dont cost samsung anything, this is free trails, so business as usual.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Between Microsoft awkwardly trying to shove yet another assistant at us and Samsung demanding yet another subscription fee, and given both companies' propensity for obnoxious notification spam and nagware, this is about the best advertising Apple could hope for.\n\nAnd I'm saying that as someone who loathes my work-issued iPhone.",
        "points": "2 points",
        "children": [
          {
            "comment": "Don't worry fruit company will invent same thing and everyone will tell you why this is fine.",
            "points": "1 point",
            "children": [
              {
                "comment": "\"Well of COURSE it's different when my favorite company does it because\"",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Look, I've been an Android user since 2010 with the Motorola Droid. I've stuck with them through the proliferation of notification spam, the rampant increase in data mining, and the relentless march of features that I just could not possibly care less about (I will never need to add cat ears to a photo).\n\nI've tried iOS a few times over the years. I know people love their iPhones so this isn't a slam on them but I personally find it awkward and annoying to work with. I have a work-issued iPhone and some of the core features (\"swipe down from the top ... no not from that top, the other top ... no on the other side of the top ... no not that side the other other side\") drive me nuts. People should use whatever phone they like but for me personally, iOS is just a huge hassle.\n\nBut adding a subscription fee gets us a lot closer to a tipping point where I have to choose between being annoyed at iOS, or being increasingly annoyed at AND paying additional fees to use Android. And I can probably just re-learn my usage habits to match iOS.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not for me thanks",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yeah because I already use bixbee so much /s",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Subscribe or get rekt b...ch is the new tactics to milk your money.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It is so nice of samsung to go out of their way to boost the sales of their rivals.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I hate the future.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If people want AI features on their phones badly enough to pay a shit subscription for it they should just get a Pixel instead since Google loves to advertise how it's all about AI on their phones. Samsung is kicking themselves here.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why would anyone want a free trial preloaded on their phone? It isn't a feature if you don't know when it will suddenly disappear and be locked behind a subscription.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Phone dlcs now.....",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I can't tell where the s24 is better than the S20. Slightly faster processer on the S24, but otherwise it's a worse phone. Same ram, no SD card, micro transactions, nobody cares about slight camera changes, and the cost is stupid. Skipping this one.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Like Klaus Schwab said, \"You will own nothing and be happy\". But y'all will still vote for candidates that are enacting this agenda.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I was thinking about switching to the Pixel Phone, this makes my choice much easier.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "yeah because a 1300$ + smart phone isnt enough",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "K. I'm upgrading to an xperia then",
        "points": "4 points",
        "children": [
          {
            "comment": "Your mileage may vary. I bought an Xperia and it was significantly worse than my S20 FE 5G. I was bitterly disappointed with how bad it was. \n\nThat's just one experience, maybe you'll get one that isn't a massive piece of shit like mine was",
            "points": "11 points",
            "children": [
              {
                "comment": "Details",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Awful camera. Yes, it's marketed as having a high quality camera, mine was defective. Terrible image quality. Fiddling with settings did not help\nPhone overheated a lot. Too computationally complex = so hot you need to have a case on it or it's uncomfortable. Could feel the heat underneath the case just doing things like checking email\nPhone refused to run anything in the background. Software error with resetting the RAM cache too frequently. So, no listening to music or podcasts unless you are IN the app itself. If you check an email, or a text, music app crashes. No amount of developer options fixes, RAM cache fixes, etc made this problem better. \n1 I could have lived with, since I'm not a photographer guy. #2 was bad but not a deal breaker. #3 was horrendous and a total deal breaker.",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "I've had an xperia 5 II for around 2 years.\n\nCamera - it's different to apple/samsung cameras as it take images that are much more \"realistic\" than the other phones (so closer to a DSLR/mirrorless camera). I am into photography so this was important to me. So, if you have good light, this camera, IMHO surpasses apple/samsung cameras as it doesn't over sharpen and you have much more leeway in editing.\n\nHowever, if you want to take a quick snap, especially in low light or contreast scenes, it's not that good, and videos in low light situations or contrasty scenes is poor. I bought an iphone 13 pro max as a secondary phone for the camera :/ However couldn't switch over to the iphone completely as IOS sucks completely.\n\nOverheats? Not for me.\n\nBackground processes? No issues\n\nWhat is great about it is that it takes an sd card and has a headphone jack.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "for me too, that's exactly why I wanted one - and having the headphone jack was awesome. I think the one I got was just kind of a dud. It's totally possible I got a bad one and the rest are just fine",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "I tried the Xperia 5 ii for a week and found I didn't like the tall screen, the screen wasn't bright enough, and the flashlight wasn't bright enough. Also weak batter life even brand new.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Lol, I wouldn't call that an \"upgrade\".",
            "points": "2 points",
            "children": [
              {
                "comment": "It has headphone jack\n\nSD card\n\nThat is an upgrade for me over any billion pixels and zoom shit and load of bollocks these phones sell.",
                "points": "-5 points",
                "children": [
                  {
                    "comment": "That's neat for you. Wired headphones are obtrusive and mostly obsolete. Samsung sell phones with plenty of storage capacity and if I need more I'll just use my NAS for personal cloud storage. SD card is also unnecessary.",
                    "points": "-5 points",
                    "children": [
                      {
                        "comment": "I know wired headphones is a niche but there are still awesome when my tws battery dies and I need something to watch\n\nSD card is great for not so heavy offline storage I have some SD cards on my smartphone which I hot swap depending on the need. One has my manga, other my music and other has movies and TV series.\n\nWhen I am completely offline and out somewhere, guess who is the person who helps everyone when they are bored and want to watch something.\n\nLol\n\nI know I am a niche audience, but being a niche audience doesn't mean completely devouring of necessary features.\n\nThere are lot less disabled people in the country but there is still infrastructure being made for them so that it can be accessible for them too. I mean the government can easily say, piss of you lot you guys are very niche we don't need to spend extra money on disabled friendly infrastructure.\n\nXbox makes disabled friendly controller now that is a niche too, same thing Microsoft can say that piss of very fee disabled people play games so we won't make stuff for them but they don't.\n\nThe reason Microsoft does that is because it gives them good PR. Having a headphone jack cuts on the sale of tws (which has batteries and on average lasts lot less than a wired earphone) they don't have SD card slots because that cuts on the profits they can make when you upgrade your storage and pay the company the money rather you buying a SD card from other companies.\n\nNot everyone needs a super fast storage, most people storage needs for photos and some basic stuff is met by SD card slots.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "Like I said, that neat if those features are useful to you. While you're hot swapping SD cards, I've already got all the content I need on my phone without needing to hot swap anything.",
                            "points": "-2 points",
                            "children": [
                              {
                                "comment": "The storage on the Xperia is pretty good, why is more optional storage a negative, I don't understand...",
                                "points": "-1 points",
                                "children": [
                                  {
                                    "comment": "",
                                    "points": "",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Over Samsung? Yeah. It's an upgrade no matter how you look at it.",
                "points": "-11 points",
                "children": [
                  {
                    "comment": "S23/S24 shits all over it so badly it's hardly a challenge.",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Speak for yourself. Perhaps however YOU look at it, it's an upgrade. But from an objective and factual look, the way I look at things, the Xperia is a downgrade.",
                    "points": "-2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Loving mine",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You read about Apple overtaking Samsung in phone sales and other statistics of Apple gobbling up the market space more and more each passing year, and you'd think Android smartphone manufacturers would make genuine attempts to make strong comebacks. Alas, they're audacious in all the wrong places - ditching the headphone jack because Apple did, selling phones without the charging brick cuz Apple did, setting the phone prices sky-high because - yup you guessed it - Apple did it with their $1000 trend iPhone X onwards.\n\nWorse, they're failing to provide reliable software and security updates, consistently less stellar software and hardware experience, and the list goes on. Now, Samsung doesn't have strong MVPs with their S24 series lineup against Apple's 15 series. So when I read about the new AI tricks, I thought this would help them as they worked with Google to bring some pretty neat, useful and exclusive features to their new phones. But there it is, you gotta pay for that in addition to a friggin $1300 for the Ultra. I'm sure that'll work out well for them.\n\nIn so many of the aforementioned aspects, many Android devices could offer something beyond what Apple does that's also less pricey and flaunt that advantage in their marketing. They have some great perks with Android in how practical, customisable, operational it is, and yet they seem to fail to see it and keep making things worse.\n\nKnow your place and turn that into the desired destination.",
        "points": "3 points",
        "children": [
          {
            "comment": "Year ago I had to make a choice of new phone. I was always on android either Samsung or Xiaomi and would never consider an iPhone. But when Xiaomi wanted to charge 1k for mi series phone, Samsung similarly while having constant issues and having 30gb of bloatware on 128gb phone I looked at apple. Well, iPhone 13 mini costed me less than xiaomi or Samsung, is actually in perfect size for me (god I hate these >6” screens) and tbh I’m amazed. Simple, clean UI, not much garbage apps you cannot uninstall, no ads in system itself, the engineering behind phone itself is amazing and everything just simply works. It’s totally different experience. Even though iOS is supposedly closed system I still feel I have more freedom on it that on “open” android where I’m flooded with ads and unwanted apps. Also apple has nice feature of 5 years of updates after sale of certain model ends. Which android phone provider offers that?\n\nApple is able to provide well made software for their products because they have 4 models per series + once every few year SE series based on insides of current iPhone. The cameras are pretty much the same in all models but they squeezed everything from them softwarewise. Android phones have many more models per year and cameras marketing catch is amount of mpx, not actual results. Softwarewise it’s meh. With limited amount of hardware in circulation apple can focus on improving the iOS, if they had 20 different models each year like xiaomi or Samsung it’d be impossible to do so",
            "points": "1 point",
            "children": [
              {
                "comment": "Which android phone provider offers that?\n\nBoth Samsung and Google offer 7 years of updates for their phones.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I hate the design of iPhone software (mostly from not using it in forever). I left iPhones when android came out with good hardware. And I'm not really bothered by the fact the android phones I buy cost more than the top end iPhones. Although I did switch away from Samsung when they decided to start charging $1600 for the Note line.\n\nBut even I'll say that I'm not too sure how much innovation Samsung is doing now. I had to upgrade my fold z 4 to a fold z 5 because my hinge started going bad. And I would literally pick up my old 4 by accident and use it (without opening it) and not realize I wasn't on the new phone. The differences are so minor that I couldn't tell which one I was using unless I looked very closely to try and tell them apart.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Welcome to the future! What tier of AI can you afford to subscribe to?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wait the only new feature that might sound interesting on this phone they're going to put behind a micro transaction wall?\n\nHahaha haha hahaha... Fuck that shit.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Quietly marks the s24 off my potential new phone list",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Open Source will kill chatgpt and Microsoft shitty bing Ai",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As far as I can tell, most of the AI services that are offered, are done so through access to servers running the AI. So in order for the AI to be utilized, you would need to access their servers. This costs money to run, and that I can understand. There are chipsets with AI built in, limited as it may be, that do exactly that. It's only Intel right now, but that's just a matter of time until everyone else jumps on the bandwagon. I don't think it's worth it at the moment to hop on as an everyday consumer. As a creator or an artist, there are plenty of reasons to want or need it.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Maybe it will also someday have the better CPU everywhere in the world instead of just US and yet the price being the same lmao.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Make an AI assistant that's actually useful and I may even be glad to pay.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think they're overestimating the amount of people that will actually use any of these AI features outside of the camera.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I was just about to trade in and pre-order it. Thanks for sharing this info. Definitely not upgrading to this",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Okay next phone will be pixel with the graphine os lol",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "See this is why Samsung phones are awful. They have ads everywhere, and now they want to charge you for phone features.",
        "points": "-8 points",
        "children": [
          {
            "comment": "ADS??",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Ads? Huh?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Samsung needs to give stuff away after their source code got stolen and Lee Jae Yong got convicted for bribery",
        "points": "-7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Sounds great, since this will lead to custom roms and more rooting communities, to counter corporate greed and allow users the freedom to do whatever they want with their 1500€ devices",
        "points": "-4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "well thats why i am still happy with my s21 ultra as though those AI are a great features, im still happy with my s21 ultra as its performing very well.. and don't need those AI features that much",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The \"AI\" features of the new s24 lineup seem so useless.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Good thing I'm not gonna use it so I can save some money",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well, time to invest all our money into AMD, Intel and Nvidia.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "u/spelunka13 would love this",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "/r/localllama",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Hearing this makes me SO MUCH less interested in the S24",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If the end users in mass provide the data why charge them to generate it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'm actually glad I won't have to pay for a \"free\" feature, either by paying for it in the cost of the device, or by being shown ads, or by having my data collected and sold.\n\nI don't need AI? Cool. I won't pay for it.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So smartphone DLC now? We have become a DLC culture!!!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "First hit is always free ...",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I was going to swap my Google pixel 7 pro for one of these but nvm, not that I'd ever use the features, it just feels gross buying a phone and some of the features become paywalled, what else will they paywall?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I won't pay for it, FU Samsung :)",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "How much to get a better battery? How much they gonna charge for email support? Gotta start charging to up the screen brightness past 25% and charge per percent.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No thanks",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19a7qlq",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://uk.pcmag.com/laptops/150537/acer-swift-x-14",
    "title": "Acer Swift X 14 Review by PCMag",
    "points": null,
    "comments": []
  }
]