[
  {
    "id": "t3_199j4ls",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.ft.com/content/bd36da71-c4cf-4ad1-a511-13abacbd93fd",
    "title": "The latest AI gadget frenzy wants to do away with phones",
    "points": null,
    "comments": [
      {
        "comment": "Wow this is possibly the worst news website I've seen, immediately asked me to pay to view, a few popups, and darkens the screen to ask about cookies. Wonderful.",
        "points": "11 points",
        "children": [
          {
            "comment": "Yeah, I just downvote these types of post and move on",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I don't think modern phones are getting replaced with this ever. There is demand for this sort of simplicity but I doubt a majority want this. It's way too simplified and walking around using a GPT walkie-talkie gets old very very quickly. Most people want a computer in their pocket but just as the article says on this, modern phone does literally exactly what this device is capable of. It's only selling point is it strips 90% of your functionality in return for a simplistic experience that's voice-centered, which even a modern smartwatch can do much better if you want that simplicity",
        "points": "4 points",
        "children": [
          {
            "comment": "Yup, it should have just been an app.",
            "points": "2 points",
            "children": [
              {
                "comment": "An app would be sweet with this saw the showcase because it was plastered everywhere neat stuff. But its own device kinda pointless.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Look at the finger scroll bar though. That shit will be disgusting in like a month and broken by the 2nd. It really bothers me idk why",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Heh heh there’s plenty reading this on the porcelain throne…\n\nI don’t disagree. I did think this device was a bit odd. Seems like it’s just an AI cash grab TBH.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why is this rabbit AI constantly posted about an everyone says the same thing, that it's worse than a smartphone in every way.\n\nThis is clearly an army of bots or something posting this app. I see it every day in my feed in a different sub.\n\nAnything about this should be banned.",
        "points": "3 points",
        "children": [
          {
            "comment": "It’s lame vaporware being pushed by ex crypto bros",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The answer is always venture capitalists",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I watched this be presented at CES. It's cool for what it is.\n\nBut everything it does can be replaced by an app on your phone.,🤷\n\nI do not see it succeding",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Oh cool, 5% of the functionality of a smart phone in a similar form factor to a PlayDate. This shit will be DoA. Typical tech bro investment scam bullshit.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19946sq",
    "subreddit": "u/SaladChefs",
    "dataType": "link",
    "dataUrl": "https://salad.com/download-high-end?utm_source=reddit&utm_medium=promoted-posts&utm_campaign=reddit-distributedcomputing-1&utm_content=golden-ad-suite",
    "title": "Don't let your GPU gather dust. Start Chopping on Salad and earn up to $180 in rewards each month.",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_199eue2",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.cnbc.com/2024/01/17/apple-avoid-ban-by-selling-latest-watches-without-blood-oxygen-feature.html",
    "title": "Apple will avoid ban by selling latest Apple Watches without blood oxygen feature",
    "points": null,
    "comments": [
      {
        "comment": "So will that dramatically inflate the prices of the ones sold prior to the ban with an active blood oxygen feature?",
        "points": "136 points",
        "children": [
          {
            "comment": "I’m sure they’ll appeal and appeal until either the patent is invalidated or they come up with a new method.  Or if they can convince a judge that their algorithm is different and thus it can be turned on with a firmware update.  Honestly, I’ve built one of these myself.  They’re not complicated or anything.  Though I don’t know the exact details of their circuits.",
            "points": "37 points",
            "children": [
              {
                "comment": "The point is not being impossible.\n\nSomeone came uo with it and patented it.\n\nApples tried to sue squared corners after all.",
                "points": "16 points",
                "children": [
                  {
                    "comment": "But have you seen the patent? Its the most generic thing possible. Patents are good but these super broad patents should also not be allowed.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Alternatively they could come to an arrangement where they pay a fair price for the patent. It's not like Apple aren't protecting their parents in exactly the same way against others. Considering large parts of their hardware are made by Samsung anyway, they can work with partners in this way.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Pay? Apple Pay? A license fee? Steve Jobs would turn in his grave.",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Thank you for the input",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "As much as I hate big companies abusing their resources for drawn out legal battles, this patent is patently silly. Blood oximeters do little more than shine a Red and IR light in pulses and detect how much of both either reflect or pass through a body part. More blood oxygen saturation means more red pass through relative to IR, and vice versa. The algorithm isn’t exactly complicated either as it just compares the light levels in both wavelengths. I don’t like that such simple devices can just patented so easily",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Maybe, but those editions may be frozen in time.  Any future watchOS updates would probably not include the feature",
            "points": "8 points",
            "children": [
              {
                "comment": "There is a difference between “not update the feature” (assuredly true) and “block the feature” (unconfirmed.)",
                "points": "6 points",
                "children": [
                  {
                    "comment": "For best compliance they will likely remove it in future updates",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "I agree that’s likely, but it hasn’t been confirmed yet at all. And it’s a difference from “frozen in time.”",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "The only likely reason they might do this is so they don’t have to complicate the update process with a second set of firmware updates specific to watches sold after a certain date. The ban is only on importing and selling them. Apple didn’t lose the patent infringement case, which was a separate thing from this, so there’s nothing to comply with other than not selling new ones with the tech.\n\nPart of me thinks they’ll just do one firmware and remove it from all because it’s simpler on their end but that will almost certainly open them up to a class action suit from current owners so the dual firmware is option might be worth the trouble to keep customers happy.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "So there may be another court case where Apple will have to license the feature for already sold watches, or, disable the feature (and compensate or be sued by angry customers), or recall the watches?\n\nAny of those scenarios is going to cost them dearly.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "Masimo has said they intend to retry the case, but the jury was 6 to 1 in Apple’s favor in the first trial.",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Correct, I doubt Apple is going to make a fork across every watchOS distribution in this case.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "So dramatically. I’d pay nearly double for that incredible feature\n\n/s",
            "points": "3 points",
            "children": [
              {
                "comment": "Now if it was blood pressure…",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "this is a weird one. why would anyone buy it now (unless they slash some $$$ of the price)? I was considering upgrading but now I'll just wait (or buy it in another country)",
        "points": "47 points",
        "children": [
          {
            "comment": "I'm really curious what their solution is. The article makes it seem like there is a hardware fix, but there is no way they would still market it as S9/Ultra 2 with a missing sensor.\n\nMy best guess is a WatchOS fix that disables the app on certain serial numbers only produced after whatever date. Whenever they can address whatever code they presumably stole, they can still re-enable the feature.",
            "points": "17 points",
            "children": [
              {
                "comment": "“You wouldn’t download a feature”",
                "points": "13 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "It's a software patch.\n\nThe company said Wednesday that the tweaked models will go on sale Thursday at its retail outlets and online store. The new models will still include the blood oxygen monitoring tool, but it won’t function.\n\nBloomberg - https://archive.is/pT568#selection-5649.0-5649.206",
                "points": "8 points",
                "children": [
                  {
                    "comment": "So don’t update your watch if you have a working sensor?",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "We have to wait and see whether older watches are affected.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Only a matter of time until someone works out the difference between the EU version and the US and releases a software fix if it is a software change.",
                "points": "-2 points",
                "children": [
                  {
                    "comment": "Not possible due to the way Apple signs software.",
                    "points": "8 points",
                    "children": [
                      {
                        "comment": "Probably more accurate to say, \"Difficult due to the way Apple signs software\", Apple protects iOS devices using signatures as well, but iPhones are regularly jail-broken.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "That’s true but the simplest solution will probably be just disabling updates.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "That is said with every hardware device. The iPhone is hackable. They don't need to read the software, just the program code that is put into the cpu memory, or the instructions sent to the device, and you can do that by replacing the chip with a hacked one (and a bunch of other complex steps). Once they have the important parts of the program code, they can reverse engineer the important parts and write the rest of the code.",
                        "points": "",
                        "children": [
                          {
                            "comment": "They don't need to read the software\n\nA cryptographic signature isn’t used to read data, but to get someone else to read it.\n\n Once they have the important parts of the program code, they can reverse engineer the important parts and write the rest of the code.\n\nYes but that isn’t the actual issue.",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Because the number of people buying it BECAUSE OF the blood oxygen sensor are few and far between.\n\nThe heart rate sensor is necessary with all of the health tracking features, especially anything fitness related. But the blood oxygen sensor literally just tells you that number. And for anybody who really is worried about it, I wouldn’t be trusting my watch.\n\nYeah, it’s nice to see how it dips when sick, and rebounds when you’re feeling better. And it’s a good red flag for someone who is generally healthy. But it’s not like this is a headline feature. I think it got a brief mention in the original introduction, and basically nothing since.\n\nSo yeah, I’d rather it be there than not, but it’s not like someone who was going to buy an Apple Watch is going to abandon the purchase because this is missing.",
            "points": "1 point",
            "children": [
              {
                "comment": "I’ve checked it against medical grade sensors quite a bit and it is pretty accurate. Good enough for personal use. If it shows different levels it isn’t very much different.\n\nIn a consumer device being off by one or two doesn’t matter. If you’re low it will definitely tell you that.",
                "points": "6 points",
                "children": [
                  {
                    "comment": "Right, but my point is that the overlap of people who need to know if their blood oxygen is low (or expect it to possibly be low) and those who would by an Apple Watch is incredibly small.\n\nIt’s a nice feature, but it’s not something a single person is buying the watch because it’s there.",
                    "points": "-3 points",
                    "children": [
                      {
                        "comment": "I have an Apple Watch, it was my reason for upgrading. There is at least one of us.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "I did too. There’s two of us!",
                            "points": "-1 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Most people buying the latest watch probably don’t even know what it is or what it does or even want it.",
            "points": "-6 points",
            "children": [
              {
                "comment": "Lol right? I don't wear a watch as-is, why would I want a bloated one?",
                "points": "-10 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "america only perhaps? apple australia still advertising watches with blood oxygen feature",
        "points": "13 points",
        "children": [
          {
            "comment": "It’s an American patent fight so right now I’d expect this to affect America only in the immediate. But I also don’t expect Apple to manufacture different units for different regions in the future.",
            "points": "10 points",
            "children": [
              {
                "comment": "I dunno, they are tooled up for it, no reason to kill that line for a global market that is bigger than the US market.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Depends on a lot of things. There’s bloat in maintaining two code bases, even for something that relatively minor (mostly because once you start doing that, you do it for lots of regional things.) If it’s profitable, they’ll do it. If not, they won’t.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "They do it already for radios, the rest of the world tends to use the same different standard than the states.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "That’s…completely missing my point. I’m not talking about hardware.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "It’s way cheaper to maintain two software bases than hardware, IF vs, factories, physical infrastructure.",
                                "points": "",
                                "children": [
                                  {
                                    "comment": "Sure. But if we’re talking about the cellular radios used to make a phone function, then we go back the “it’s more profitable.” They literally could not sell the device without it.\n\nIn this case we’re talking about an ancillary feature (one I like, but still ancillary) not needed for core function. Hence now they’re branching their code base for an ancillary feature, and then it’s just an equation of “how many regional ancillary features can we support before it’s not profitable, and as soon as it’s not, which regional ancillary features are least profitable”?",
                                    "points": "",
                                    "children": [
                                      {
                                        "comment": "Regional? Remember the US is the smaller market, compared to the rest of the world. It already sounds like this will be a software restriction, that just applies in the US. The reverse tesla experience.",
                                        "points": "",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It’s a US ban",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "That is the feature that made me get the AWU.\n\nI got tired of charging my Oura every 2-3 days. I get 4-6 with an AWU.",
        "points": "16 points",
        "children": [
          {
            "comment": "Garmin does pulse oximetry.",
            "points": "14 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Fortunately, the feature will continue to work on existing customer devices. But it really sucks for anyone looking to buy a new one.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Do they have to buy back any products retailers have bought and (I assume) also can’t sell?",
        "points": "3 points",
        "children": [
          {
            "comment": "Nope, the ruling only prevents Apple from selling the device, which includes selling it to retailers. Anything retailers have in stock is fair game to sell.",
            "points": "13 points",
            "children": [
              {
                "comment": "Fair game is a real thin line when it comes to the law, my dude.",
                "points": "-4 points",
                "children": [
                  {
                    "comment": "Considering the order banned imports, that line is very bold and apparent.",
                    "points": "8 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Given the exact situation and current legal challenge, it is not.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "You don't know their contracts. If a store operates a consignment model then it could be illegal to sell too. There's no Loony Tunes loophole that lets apple say \"well we didn't sell it, Best Buy sold it and then paid us\".",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I mean, what are the chances of another respiratory virus going around",
        "points": "0 points",
        "children": [
          {
            "comment": "What is the correlation between this ruling and that exactly?",
            "points": "0 points",
            "children": [
              {
                "comment": "A consistent drop in your blood oxygen level is a symptom of a respiratory virus",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "That a lot of people bought these to monitor their health during the lockdown.\n\nThat's what I read in an earleir pier.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Better headline, apple steals and finds a way to circumvent the law, again",
        "points": "-1 points",
        "children": [
          {
            "comment": "what were the other times then?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Will they actually remove the sensor that measures blood oxygen or just remove the feature from the software?",
        "points": "-1 points",
        "children": [
          {
            "comment": "This is ONLY a software disable. The hardware is NOT changing. Lots of news orgs are getting this wrong.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I ditched the Apple Watch a few years back. The battery life was one of the main drivers. Charging every day or so was kind of annoying. Now I love my Gamrin.",
        "points": "-1 points",
        "children": [
          {
            "comment": "Ultra Watch 2, charge needed every 3 days",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Hopefully other patents are challenged, and this thing gets banned outright.",
        "points": "-20 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’d rather they shit percentage points and chew aluminum. But this is a temporary solution for suckers who won’t buy the device for biofeedback.",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don't get why Is it so hard for people to gave a BP, BS, and an oxymeter at home.\n\nI can understand if you have a condition, but otherwise? C'mon.",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nobody uses this feature anyway nobody cares",
        "points": "-10 points",
        "children": [
          {
            "comment": "Speak for yourself. I’ve owned Apple Watches for 7 years and I’ve used it 4 times.",
            "points": "4 points",
            "children": [
              {
                "comment": "I do hope this is a joke",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I swear I've seen this story posted on every subreddit in Reddit at least twice.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "For discounted price, right? Right? /s",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1998waa",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.theverge.com/2024/1/17/24041945/apple-watch-series-9-ultra-2-blood-oxygen-ban",
    "title": "Apple Watches with blood oxygen tech are banned again.",
    "points": null,
    "comments": [
      {
        "comment": "You don’t become a 3 trillion dollar company without breaking the law, getting away with it, and then monopolizing on that. In this exceptionally rare instance, the now Goliath has temporarily lost. Sent from my iPhone",
        "points": "376 points",
        "children": [
          {
            "comment": "You're part of the problem.\n\nNot that I'm better, sent from my Samsung.",
            "points": "109 points",
            "children": [
              {
                "comment": "Touche",
                "points": "23 points",
                "children": [
                  {
                    "comment": "Sent from SM-G960U1 using Tapatalk",
                    "points": "32 points",
                    "children": [
                      {
                        "comment": "🎶Nokia Chime🎶",
                        "points": "11 points",
                        "children": [
                          {
                            "comment": "https://m.youtube.com/watch?v=uub0z8wJfhU",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "Fuuuuck. Haven't heard the name Tapatalk in years.\n\n420 Flash it boys",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "Always read it on tech forums.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "En garde from a 7 year old phone!",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "You're all less of a problem than I am, sent from my Pixel",
                "points": "4 points",
                "children": [
                  {
                    "comment": "The one too important to even be sold to the rest of the world.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "though samsung is better than iphone, HEY YO",
                "points": "-12 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "If you act like you did nothing wrong people are less likely to think anything is wrong. Especially when you act like they're dumb for not understanding how things work, and that's why nothing illegal was going on. Plus the American government doesn't enforce the law if it'll hurt the economy. Praise be to Capitalism. Let the tide raise all ships, as the pursuit of wealth can only be good. Sent from a phone and definitely not sentient ChatGPT",
            "points": "11 points",
            "children": [
              {
                "comment": "I’m watching you SkyNet. I got both eyes on you. You ain’t getting past me this time.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "3 eyes on you.",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Just checked to see if my O2 app is still on my ultra 2 and working.",
            "points": "0 points",
            "children": [
              {
                "comment": "97 percent",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Anyone see the stylus for my Palm2. Anyone???",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Same!",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Existing watches aren't going to lose the feature. Only new watches being sold starting tomorrow.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Hey guys\n\n-- oneplus",
            "points": "-4 points",
            "children": [
              {
                "comment": "I'm hearing Bob Marley now.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I’m lost in the irony",
            "points": "-2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I can’t remember is this the case of patent trolls or a legitimate breach of IP?",
        "points": "170 points",
        "children": [
          {
            "comment": "A lot of random people are claiming patent trolling, but I've yet to find anyone who can actually explain why.\n\n​\n\nI tried to read the patent, but I'm not a hardware engineer. Though it didn't seem very vague to me.",
            "points": "148 points",
            "children": [
              {
                "comment": "Well, the claim from the patent owner is that Apple poached their talent to recreate their tech in house (rather than licensing it, or investing in the company who invented the tech). The case is strong enough to warrant a ban. So this doesn’t seem to be a patent troll situation. \n\nI’ve seen the interviews with the company (Masimo) and it seems pretty compelling that Apple is in the wrong here in a David vs Goliath situation.\n\nBut I’m no patent expert, so that’s just my interpretation of it.",
                "points": "167 points",
                "children": [
                  {
                    "comment": "Masimo is a pretty fucking huge Goliath. Masimo is still a multibillion dollar company.",
                    "points": "12 points",
                    "children": [
                      {
                        "comment": "Pretty sure Masimo is David and Apple is Goliath. In the original story Goliath is a giant",
                        "points": "3 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "The status of the case doesn't really rule out the possibility of Masimo being a patent troll.\n\nPatent trolls don't create products. They look for ways to lock up patents on ideas that they'll never use. They often patent ideas that are adjacent to exiting technologies, but changed just enough to qualify for a patent. Or they simply apply for patents that probably shouldn't be awarded, and hope that the patent office is dumb enough to award. It happens all the time.\n\nThat said, Masimo doesn't really fit the patent troll definition, regardless of whether the patents are deemed valid. They make a lot of products in the consumer health space. They're a $1.24b company with real products, not just a war chest of patents.\n\nPatents are complicated af. Apple's IP lawyers obviously felt differently about Masimo's patents than Masimo does. Now that dispute is in court.",
                    "points": "18 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Has anyone seen the actual patent? Pulse oximetry has been around for decades. Is this patent on the software methodology?",
                    "points": "19 points",
                    "children": [
                      {
                        "comment": "I read the patent - their tech made pulse oximetry and other noninvasive biometric sensors significantly more reliable using novel signal processing techniques. Prior to their tech these sensors would often fail in the fringe cases where they were most important. This page describes the disputed technology in a more accessible way.",
                        "points": "25 points",
                        "children": [
                          {
                            "comment": "Thank you for this. Was the patent extended somehow? From the page it was released in 1995, I’d assume they filed before it was released. Shouldn’t the patent have expired by now?",
                            "points": "5 points",
                            "children": [
                              {
                                "comment": "I’m not sure if they were extended or not but the patents in question are set to expire in 2028.",
                                "points": "1 point",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "They have the patent AND product.\n\nhttps://www.masimoconsumer.com\n\nNot just an empty patent, they have a working consumer model. With this I can see why Masimo wouldn't relent anyway. Who would buy one of Masimo's devices if an apple watch could do the same and more? They're not out to lose that chunk of cash. They'll make more selling that wristband that's coming out than just the patent.",
                "points": "103 points",
                "children": [
                  {
                    "comment": "The patent in question is for the oximeter itself. The watch seems like a twist of the knife to Apple since Apple's wrist oximeter barely functions. Masimo is just showing them that they could have actually made it work well on the wrist if Apple had just licensed it from them.",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "Which is what I mean. What I meant by all that is that it's not just another patent troll case with just a piece of paper and nothing else to show. If there were no product, a patent troll case could be thrown into the debate but with an actual line of products on the way any idea that this is a frivolous patent troll case goes out the door. Masimo is aiming to make money off a real working sensor, not just licence it so there's 0 trolling here.\n\nJust to add, the watch itself isn't smart at all, it's just a fancy sensor with a screen that sends the data to the app. Doesn't really have smart features at all. I think where Masimo is really looking to cash in is the pure wristband oximeter sensor model. No real competition against that.",
                        "points": "7 points",
                        "children": [
                          {
                            "comment": "Yeah, I'm not disagreeing with you, I was pointing out that this parent isn't just for a new watch. That oximeter they invented has been in industry wide use for decades and every person reading this has probably either had it used on them first hand or seen it used in person.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "What’s your source for “barely functions”?",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Here's a meta review\n\nIt's mainly reliability. On average Apple only has around 1% error but it has a lot of outliers.\n\nIf you actually need an oximeter for medical purposes, outlier errors of up to 15% happen too often to rely on Apple.\n\nThe paper is overall positive on the watch if you're healthy though since outliers in that case aren't much of a worry. Though, people in that bucket don't really have much need for an oximeter anyway.",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "Thank you! I was mainly curious if it was an accuracy thing or a usability thing and this answers all my questions.",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Masimo is out their mind if they wanna charge more than an Apple Watch for a Fitbit. I would love to know who their target demo is considering it’s not a medical device and isn’t regulated to those standards.",
                    "points": "-10 points",
                    "children": [
                      {
                        "comment": "They're a pretty major healthcare device company (just mainly to hospitals so it's a niche audience). Part of what you're paying for is FDA certification. Usually, though, someone would buy this under their insurance because they need continuous osat measurements and a Dr can't prescribe something if it's not cleared by the FDA which Fitbits and Apple Watches, etc are not.\n\nApple's wrist oximeter is also notoriously inaccurate. Masimo invented the tech and has had their oximeters in every hospital for decades. Normally it's done on a finger though, which is why Apple's fails on the wrist, but if Masimo is putting their reputation on the line here, I'd put money on them actually getting it right on the wrist.",
                        "points": "19 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Masimo is a big name in hospital-based patient vital monitoring. They make spo2 monitors, CO monitors, vitals carts that nurses use for patient monitoring etc. Their target demographic is hospitals with massive budgets. I have used their equipment in every facility I have ever worked (5+), so they are pretty ubiquitous. Which is why they were probably able to actually take on apple (with good cause imo) and win.",
                        "points": "9 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Good questions but I'm not sure that any of that is relevant to whether Apple stole their IP.",
                        "points": "6 points",
                        "children": [
                          {
                            "comment": "It isn’t because I wasn’t talking about whether they did to the person I commented to.",
                            "points": "-2 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Define “empty” patent. What does that even mean? You might misunderstand how patent law works. There is constructive reduction to practice (describing an invention and enabling it) vs actual reduction to practice (a working prototype or product). In no way is one less valuable or less enforceable than the other.\n\nMasimo is put in a no greater position than before simply by having a product. That’s not how infringement works.",
                    "points": "-7 points",
                    "children": [
                      {
                        "comment": "It's not how infringement works, I know. What I meant by \"empty\" is that it's not just a patent troll case as in just a patented idea on paper with no product. I'm just saying it's not a purely frivolous patent troll case.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Very few people are going to buy their watch anyway. Most will be prescribed the watch by their medical professional.\n\nRegular consumers will just buy an Apple Watch since the ecosystem is huge and there aren’t monthly fees to make sure you’re not dead.\n\nAs to why they are considered patent trolls - up until now their company has relied on medical devices sold to medical professionals that are used on site (think hospital or inpatient clinics) or get sold to patients / loaned out to patients.\n\nThey also seemed to refuse to work with Apple to license the technology for all long time.\n\nNow all of a sudden in 2022 they come out with a wearble consumer product (a watch) that looks almost like an Apple Watch. They are trying to cash in on Apple’s prior success in the watch market and using their patent to wage war. To some people they might seem ungrateful since they are literally standing on the shoulders of giants. But all is fair in love and war so 🤷🏻‍♂️\n\nFinally, it might seem as a power play that just hurts consumers some of which might need the technology for health reasons. I think it’s fair to say that Masimo is unlikely to gain a significant market share in the smartwatch field so they are just holding onto a potentially life saving technology just because. If you already have an Aaple Watch or any other smartwatch and you get told that you need this sensor it’s very unlikely that you’re gonna ditch your smartwatch and switch platforms. What will most likely happen is that they will be wearing two watches and you can imagine how annoyed people would be by this? You mean some silly patent war is making me get a separate device instead of just working with other manufacturers?\n\nThey have to be very careful though because their design will likely toe the line on Apple’s Watch patents. The second that Apple believes they have infringed they will come down on Masimo to bar the sale of their watches.\n\nFor better or for worse Apple tends to hold grudges and they like their retribution.",
                    "points": "-4 points",
                    "children": [
                      {
                        "comment": "This entire post is ridiculous",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "It’s not. Masimo invented the tech and has the patent. Apple approached them in like 2011. After years of no deal, Apple hired away their lead Medical Officer then “made their own” version of it.\n\nhttps://www.theverge.com/2023/12/28/24016913/apple-patent-dispute-masimo-lagemo-true-wearables",
                "points": "144 points",
                "children": [
                  {
                    "comment": "It’s not. Masimo invented the tech and has the patent.\n\nThey didn’t invent pulse oximetry, no. That’s was invented 90 years ago.\n\nMaxsimo was the first company to patent a specific measurement method for pulse oximetry. But only in the US, the rest of the world doesn’t allow companies to ‘camp’ patents on existing medical devices.",
                    "points": "10 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "It’s because they are not being honest. Masimo has been making pulse oximetry devices for decades. Apple thought a court would bail them out and it failed.",
                "points": "28 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "it's not. Probably what was \"supposed\" to happen was what went on with Siri. Tech they wanted and was willing to integrate with hopes of buying out the original creators. They snakes, always have been always will be. This time it didn't work the way the lawyers wanted.",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "My non-expert understanding of it is that it’s kinda patent troll-flavored infringement. Yes, it infringes, but the company being infringed upon isn’t interested in playing ball on any sort of of reasonable fee for licensing or anything like that which I understand would be pretty standard in a case like this.",
                "points": "-36 points",
                "children": [
                  {
                    "comment": "There’s a lot more too it, they were negotiating a fair fee when Apple bought a bunch of their employees (more then doubling already industry leading salaries) and made their own and stopped showing up to the table",
                    "points": "28 points",
                    "children": [
                      {
                        "comment": "Oh wow, definitely makes sense why they wouldn’t want to play ball with Apple then",
                        "points": "6 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Bingo! Masimo initiated all subsequent contact and made good faith efforts to collaborate. Apple refused to reply.",
                        "points": "8 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Not willing to license it does not make them a patent troll. A lot of companies file patents because they want the technology to be proprietary and unique to their products.",
                    "points": "20 points",
                    "children": [
                      {
                        "comment": "Yes I know, I didn’t call them patent trolls.",
                        "points": "-15 points",
                        "children": [
                          {
                            "comment": "You sorta did\n\nMy non-expert understanding of it is that it’s kinda patent troll-flavored infringement.",
                            "points": "7 points",
                            "children": [
                              {
                                "comment": "That’s explicitly not the same thing as calling them patent trolls. I would have just said they were patent trolls if I had intended to call them patent trolls.",
                                "points": "-9 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "glad you are not an expert. you might want to learn to read again also.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "If you’re going to suggest I can’t read (for whatever reason) you may want to learn the difference between your and you’re.",
                        "points": "-2 points",
                        "children": [
                          {
                            "comment": "touche",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "What’s reasonable and what are they asking?",
                    "points": "-1 points",
                    "children": [
                      {
                        "comment": "It actually doesn’t matter what’s ‘reasonable”. They have no responsibility to license a patented technology.",
                        "points": "9 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "[deleted]",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "This is a discussion forum.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "\"Patent troll\" typically applies to companies whole sole existence is just to own patents in order to sue others to force license payments.\n\nMasimo is a legitimate, multi-billion dollar, publicly traded company that makes medical devices. Not a patent troll in the traditional sense.",
            "points": "25 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "From that I understand:\n\nApple went to the company with the tech and asked to train engineers to put it to use in apples stuff and pay them a license fee\n\nApple then never payed what ever sum was agreed to, or never agreed to one, even after Apple begun selling new devices with the yet to be licensed tech inside of them\n\nApple has been releasing infringing tech for years and this is the origin companies most recent means of seeking restitution",
            "points": "35 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Trolls are typically companies that buy patents and try to license them or extort settlements in court.\n\nMassimo is a real company that invented the tech themselves. They do tons of R&D. They're not a troll.",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "2 legit",
            "points": "7 points",
            "children": [
              {
                "comment": "They quit",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I believe Apple went into the company with the tech and pretended they were there to license it. Then ended up stealing the engineers and recreated the tech.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Depends on who you ask. That assessment isn’t cut and dry anyway.",
            "points": "-23 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "They just hired Bob Chapek, that explains everything about their company.",
            "points": "-23 points",
            "children": [
              {
                "comment": "They did nothing of the kind. Masimo appointed him to the board. That’s a hell of a long way from “hired”.",
                "points": "9 points",
                "children": [
                  {
                    "comment": "The fact that he’s even on the board. He’s a money hungry piece of shit. Doesn’t change anything that I said. It explains exactly who Masimo is.",
                    "points": "-21 points",
                    "children": [
                      {
                        "comment": "Board seats are not usually paid positions.",
                        "points": "3 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "As if Apple isn't just as money-hungry?",
                        "points": "9 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yes",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "So if my wife has an Apple Watch (series 7) with this feature already on it, will it get disabled next update they push out ? Or will it just apply to all NEW Apple Watches getting released moving forward? And if it’s the former and you decide to not update the watch, will you be able to keep the feature ?",
        "points": "40 points",
        "children": [
          {
            "comment": "Only affects new devices, the blood oxygen feature isn't going to be disabled on already purchased watches.",
            "points": "52 points",
            "children": [
              {
                "comment": "This is bullshit. Apple needs to pull their GIANT fucking wallet out and do what’s right.",
                "points": "27 points",
                "children": [
                  {
                    "comment": "Most likely by throwing that wallet to their newly higher engineers to rebuilt the feature in a way that doesn't infringe on that patent anymore.",
                    "points": "19 points",
                    "children": [
                      {
                        "comment": "That or pay the patent owners",
                        "points": "-7 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "But now they can play victim to their customers. \"Woe is me, I want to be able to provide you all the cool features, but the big bad government won't let me. Please ignore the fact that we stole this from someone else.\"",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "I hope nobody is duped by that. It’s a sweet feature that is the reason I bought series 6 and I will buy more apple stuff, so they should just pony up and own up",
                        "points": "-1 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Hahhahahahhaha. These are the same companies that at internal “all hands” will boast about how work they are doing, their profits, etc. THEN tell employees they are tightening belts and raises/bonuses will be limited and they are cutting the free coffee and tea….",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Nobody can really say. At the moment, the judgment prevents Apple from importing new watches into the US or selling existing ones, but doesn't affect already sold ones.\n\nIn order to get around the judgment, Apple may try to remove the functionality via a software update. It isn't entirely clear to me that this would actually resolve the issue - if the patent claims are method claims, it would be fine, but if they're capability apparatus claims, that may not be enough. Either way, it's easier for Apple to pull it from everybody with those watches than figure out what was already sold. They might not even care for watch type if it's a monolithic update",
            "points": "-2 points",
            "children": [
              {
                "comment": "Yeah, no, that’s never happening.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "Google did this with their speakers, i can see Apple doing it",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "That's not true. Watches that are sold in the USA on or after Jan 18, 2024 will have the future disabled in software. The blood oxygen app will still be on the devices, but when you try to open the app it will tell you to check the health app on your phone, where you'll be led to an apple support article explaining the situation.\n\nIf you already own an Apple Watch with a blood oxygen sensor, it will continue to work as normal.\n\nit's easier for Apple to pull it from everybody with those watches than figure out what was already sold.\n\nApple knows the day you purchased your device. It would be easy as hell just to add in a quick \"if purchased on or after jan 18, disable blood O2 app\"",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Why does the purchase date matter here? Its okay to use stolen tech as long as it was purchased before anyone else found out?",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "That's how the court is enforcing it while the appeals are pending.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Another perspective: I worked for a leading maker of pulse oximeters. Everything we did was subject to FDA scrutiny; that was the easy part. Avoiding frivolous lawsuits from Masimo was more difficult. Masimo used litigation and threats of litigation to intimidate its competitors long before it made a claim against Apple.",
        "points": "31 points",
        "children": [
          {
            "comment": "If that’s the case, and it makes a lot of sense, I kinda hope Apple gets away with this one. Boo on Masimo for trying to monopolize a medical advancement, especially to this extent",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "What watch face is that? I kinda like it",
        "points": "13 points",
        "children": [
          {
            "comment": "Looks like the snoopy one between animations.",
            "points": "10 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Back in the day we used to call it a clock",
            "points": "41 points",
            "children": [
              {
                "comment": "Back in the day we used to call it a clock\n\nYou didn’t have analog watches “back in the day”?\n\nSo you’d see someone wearing a watch, and you’d say, “nice clock” back in your day?",
                "points": "17 points",
                "children": [
                  {
                    "comment": "Back in my day we had to go to the town square and look at the church building to check the time",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "Mr Gucci loafers over here thinks he’s too good for a sundial",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Uh wtf Looks like comic sans text lol",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yes that’s the snoopy watch face.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Glad I got my 9 a couple weeks ago. The finger gesture they added is so handy.",
        "points": "1 point",
        "children": [
          {
            "comment": "What’s the finger gesture?",
            "points": "0 points",
            "children": [
              {
                "comment": "It fingers you",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I feel like there needs to be serious consequences for this. Not \"you owe this company 250 million dollars, don't do it again\" consequences, but more like \"you owe this company 250 million dollars, also pay 500 billion in fines, hopefully you learn your lesson.\"\n\nHow many cases of corporate misconduct do we read about where the punishment is so small it's basically ignorable? Apple is a giant company, they tried to use that to bully a smaller company. The same way they tried to pick on someone a fraction of their size, they need to be picked on.\n\nActions like this can absolutely sink a company. Apple needs to lose so much money it puts them at risk of going out of business, because that's what they were willing to do to someone else.",
        "points": "0 points",
        "children": [
          {
            "comment": "They didn’t though, and Masimo is fucking huge, lol.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Fuck that, the apple watch is an amazing product that just got worse. I don't give a fuck about masimo",
            "points": "-4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Wish I had a dollar for every time I read this",
        "points": "-3 points",
        "children": [
          {
            "comment": "This is the second ban… so $2?",
            "points": "12 points",
            "children": [
              {
                "comment": "Still read it 15 times today - sorry you missed it. I'll take a downvote though, please. In, fact, gave myself one just to make you smile.",
                "points": "-7 points",
                "children": [
                  {
                    "comment": "Some of us aren’t terminally online.",
                    "points": "-10 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "That felt good. Now downvote me and let me know how it goes.",
                    "points": "-7 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I mean sure they hired away Masimo engineers to make their own, but they also hired away Intel designers to make their M chip so it’s just par for the course?",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Who the hell do these guys think they are, John Bloodoxtech (inventor of blood oxygen technology)?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "",
        "points": "-12 points",
        "children": [
          {
            "comment": "🍎🤬",
            "points": "-12 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Can't we just ban crapple?",
        "points": "-17 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Someone tell me whose life is getting better because Apple had to make a worse watch?",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s really ridiculous, you can get a meter starting at $10",
        "points": "-3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What’s the point of the extra side sticking out where the dial is at?? The old watches look must sleeker",
        "points": "-8 points",
        "children": [
          {
            "comment": "The watch pictured is the $800 Apple Watch Ultra, not the standard Apple Watch. It’s designed for high stress environments ( trail running, mountain climbing, diving, etc) and therefore has a focus on ruggedness over sleekness, hence the more stable and better protected housing for the action button.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Well, to be honest, it was like the jankiest feature that barely worked",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Apple Watch Users Try Not to Take an L CHALLENGE (Impossible)",
        "points": "-6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Because it doesn’t work properly. Fix it, Apple.",
        "points": "-9 points",
        "children": [
          {
            "comment": "Because it's blatant patent infringement and talent poaching. Apple is totally in the wrong here and the technology cannot be legally included in the watch",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "But it’s innovative af? Why let people suffer",
        "points": "-22 points",
        "children": [
          {
            "comment": "Because stealing tech is not \"innovative\", it's IP theft. Making an interesting product while committing a crime does not make it not a crime.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Publicity stunt? At this point it has to be... More exposure than any legitimate advertising they could've done.",
        "points": "-18 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Masimo is playing with fire here. There’s always a huge risk when engaging in high-stakes patent litigation with someone who has the kind of legal horsepower that Apple does - the nuclear option of a defense motion to find the patent invalid is always looming. Only after trying that approach will they even consider licensing or acquiring the patent.",
        "points": "-24 points",
        "children": [
          {
            "comment": "Apple has already tried all that. A couple Masimo patents were ruled to be invalid, but not the one in question. It's already been through the courts. Apple has run out of options. This appeal was their last shot. It's time to pay up now.",
            "points": "2 points",
            "children": [
              {
                "comment": "It’s the world of IP litigation, nothing is ever final, that why this bullshit drags on for years",
                "points": "-2 points",
                "children": [
                  {
                    "comment": "This one has already gone on for just over 4 years now. Other than redesigning the blood oxygen sensor to work in a way that does not infringe the patent, there's no recourse left for Apple really.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Only 4 years? This is just getting started then.",
                        "points": "-5 points",
                        "children": [
                          {
                            "comment": "But where else can they go? It's already gone through appeals, which were just rejected. Even the president declined to veto the initial ruling.",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Can someone explain why? I haven’t looked into it and at this point idk where to look",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Title should read 'Apple disables feature on watch rather than pay patent holder'.\n\nIt's not banned at all, it's just not their tech.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1998vxr",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.notebookcheck.net/Exynos-2400-Samsung-confirms-deca-core-CPU-and-FSR-support-for-Xclipse-940.794155.0.html",
    "title": "Exynos 2400: Samsung confirms deca-core CPU and FSR support for Xclipse 940",
    "points": null,
    "comments": [
      {
        "comment": "We want a LARGE battery, a large lens for high clarity, physical buttons with touch fingerprint sensor and a jackphone port and make this waterproof.\n\nIt is so easy Samsung. So easy. But you always fuck up the last mile.",
        "points": "-1 points",
        "children": [
          {
            "comment": "Well, if they made a perfect phone then you wouldn't need a new one.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Sony makes those.\n\nSD card slot, 3.5mm headphone jack, dual front facing speakers, 4K screen (kinda dumb on a phone), great Pro Cameras.\n\nA bit expensive thou.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_1998rjg",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.theverge.com/2024/1/17/24041535/ios-17-3-release-stolen-device-protection-apple-iphone",
    "title": "The next iOS update will make it harder to break into your iPhone.",
    "points": null,
    "comments": [
      {
        "comment": "Great update, people in the comments don't realize this is meant to prevent social engineering attacks, it's not supposed to be some massive anti zero day inicative.\n\nThis is more like, if your S/O has your password and takes your phones, they can't access your credit cards without your permission.",
        "points": "445 points",
        "children": [
          {
            "comment": "Seriously, most of these people are clearly commenting without realizing a new opt-in security feature is being deployed. But hey, they can comment snidely about \"isn't that the point of updates?\" before the post hits 20+ comments, so it's a win in their book I guess lol.",
            "points": "139 points",
            "children": [
              {
                "comment": "There was some major horror stories before this update.\n\nThieves were in bars, would peer over shoulders looking for someone to type in their passcode, and once they saw it they’d nab the phone, change the passcode, and update biometrics. This would lock the owner out from using their apple account to try to recover or report stolen the phone.\n\nWorse yet. They would gain access to the users bank accounts, brokerage accounts, etc.\n\nThey would then transfer the users money into an account where it would go into crypto, and be stolen forever.\n\nI believe the journal did a podcast on it, where some girl lost tens of thousands from her phone being stolen. It’s bad software design on apples part.",
                "points": "25 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "That is what updates are for though. Apple adds new layers of security pretty much every single major update. They’ve been doing new opt in stuff for a long time now.",
                "points": "-33 points",
                "children": [
                  {
                    "comment": "are we supposed to never talk about new features lol",
                    "points": "23 points",
                    "children": [
                      {
                        "comment": "We should",
                        "points": "-14 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "in addition to the potential financial losses, the really big one is losing your apple ID and everything associated with it (including all your icloud photos). that's because if the theif steals your phone and oversaw you enter the pin, they can immediately change your apple account password and get you locked out from it completely. apple won't help you in this case and everything you had on icloud is lost.\n\nWSJ did a good series on this problem and how the ppl impacted didn't even care about the stolen phone all that much nor about the hassle of dealing with some financial fraud, but that they couldn't get access to their photos and apple wouldn't help them. a lot of apple users probably have many years and gigabytes worth of photos on their icloud and never bothered backing them up elsewhere. losing those photos would be super devestating.",
            "points": "18 points",
            "children": [
              {
                "comment": "I have my photos sync to my iPad and my MacBook… and my old MacBook and my Mac mini… plus a time-machine backup…",
                "points": "4 points",
                "children": [
                  {
                    "comment": "yeah that's the way you're supposed to do it - make sure you have a backup somewhere safe, even better if you have it on multiple places like you do, although w/ 5 devices i guess you really dont wanna be losing them haha. but what percentage of apple icloud users w/ say 20 gb+ worth of photos you think simply leave all their photos on icloud and don't have a backup anywhere else? probably a ton, if not a majority.",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "If all of those things require your Apple ID to log in, you don’t have a backup. This includes the local backups if the encryption is tied to your Apple ID.\n\nI don’t know the specifics on some of these so I don’t know for sure if an Apple ID is required, but if it is, you need a better backup solution so you don’t lose everything if you lose your Apple ID.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "You can’t just change your Apple ID password so easily. It’s much more nuanced then you’re leading on",
                "points": "-6 points",
                "children": [
                  {
                    "comment": "apple's been fixing this incrementally over the past few months with a few fixes including this one, but no it used to be that simple. you have the phone and you have the pin and you can reset everything.\n\nhttps://www.youtube.com/watch?v=tCfb9Wizq9Q\n\nhttps://www.youtube.com/watch?v=QUYODQB_2wQ&t=444s",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "They make you verify your email, your sms and they require your Apple ID password which is not and cannot be your PIN number.",
                        "points": "-6 points",
                        "children": [
                          {
                            "comment": "Which the person almost certainly has because they have your phone unlocked. They didn’t need the Apple ID password, just the passcode.\n\nWorse than that IMO is if you have 1Password they have everything in there because you can (today) add another faceID with just the passcode. Total access to email and all my passwords with a single pin is crazy bad. I’ve disabled faceID on 1Password but it’s still really bad that the faceID is such bad security because it’s totally bypassed by the passcode",
                            "points": "4 points",
                            "children": [
                              {
                                "comment": "That’s only if you allow it. If you don’t care about your security enough to turn on 2FA and prevent changes in the settings then that’s on you. But if you’re here to spout off WSJ bs from 9 months ago… let me save you the effort. I don’t give a fuck",
                                "points": "-7 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "did you even bother watching those two vids, dated 8 months ago?",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "Why would I watch an 8 month old video?",
                                "points": "-6 points",
                                "children": [
                                  {
                                    "comment": "because it's explaining the whole point of this upcomming fix... and it's not just changing your apple id password, it's using the recovery key. apple made a few fixes in the past few months and this one to combat this problem. i don't even get what your point is. i stated why apple is making these changes and then you act 'well no it's not that easy' yeah it's not because apple JUST made a few changes and are still making changes to combat this problem.",
                                    "points": "3 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "They don’t require your Apple ID password at all. You would never be able to reset a forgotten passcode at all if that was the case. Most people also use iCloud mail, so the email is already signed in, and the sms is right in their hands.",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "How? I just tried it in my IPhone right now exactly as in the WSJ and it just asked me for my pass code (which isn’t just numbers in my case).\n\nTry it yourself, you can cancel at the New Password screen.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I have my security settings properly set up. In order to change my Password I have to verify my email, SMS and current Apple ID password. My phone PIN doesn't cut it. Go into settings and change it",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "You are just as smart as Apple engineers thought they are",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Thanks Tim apple, holy smokes. It has to be better then the last update that purged internet pirates.",
            "points": "-26 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Yours is the top comment as of now, so I didn’t see these other comments, but you’re spot on. I remember not too long ago, a thief targeted a woman specifically by observing her enter her PIN (or something like this), then stealing her phone and locking her out of everything.\n\nShe had no recourse. It was ridiculous. I’m glad to see Apple is making efforts to address this. Ultimately, anyone should be able to prove who they are with their ID and go to an Apple Store or something to shut it all down, but we’re not there yet.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Terrible title. Great feature.\n\nBasically they delay you from changing settings e.g. disable FaceID if you're not at home/work.\n\nWhich should help prevent a lot of phone thefts.",
        "points": "183 points",
        "children": [
          {
            "comment": "The feature I really like is that you can request confirmation from the other party that they are indeed them. Helps protecting people vulnerable from abuse.",
            "points": "12 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "For anyone wondering why this is being addressed, this WSJ podcast does a great story on the vulnerability and how it was exploited.",
        "points": "21 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is good.",
        "points": "15 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Correct title: The next iOS update will make it harder to break into your Apple ID account.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Yeah yeah.. same headline different update.",
        "points": "84 points",
        "children": [
          {
            "comment": "I get the feeling you’re being glib and dismissive, but I don’t even know what the subject of your ire is. Are you criticizing the article because it’s formulaic or are you dismissing the feature as nothing new?\n\nEither way, it’s a pretty significant change and worth discussing.",
            "points": "17 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This one is actually pretty major. Right now the top iPhone theft rings centralize around the ability to reset the phone. Adding additional protection atop the passcode for various things will make a real world difference in physical phone theft.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I bet there hasnt been a single update that didn’t contain some security patch. This is a constant in software development, especially for something so big.",
            "points": "24 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It’s always the case in cyber security",
            "points": "-9 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Apple shouldn't use a passcode to unlock everything of an iphone at first. Such low secured encryption key should only be used to unlock the screen.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Apple needs to make a feature that would require a passcode to turn off the phone. Most of the time thieves would steal a phone and turn it off to prevent tracking and send it off to China to be stripped.",
        "points": "6 points",
        "children": [
          {
            "comment": "That would make certain repairs and crashes super difficult. Plus they can just use a faraday cage, you can literally have one that folds up in your pocket like a pouch.",
            "points": "14 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "On newer models there is at least a feature that keeps sending out a gps signal even when the device is turned off. It uses a negligible amount of battery and solves this specific problem",
            "points": "4 points",
            "children": [
              {
                "comment": "It uses Bluetooth that reaches out to other iOS devices which then report back its location like an AirTag. Not GPS from the off phone.",
                "points": "9 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The tracking stays alive even if the phone is off. It requires your password to fully turn off the phone, tracking and all",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Android already has this.\n\nI don't know if it blocks shut down, but if you turn it in and do not input the password, you cannot turn it off now.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yet another thing to be aware of when you inherit a deceased person's phone.",
        "points": "2 points",
        "children": [
          {
            "comment": "Yes, spent three months going through the process to get my father’s iPad unlocked when he passed away. It’s quite something.",
            "points": "0 points",
            "children": [
              {
                "comment": "Someone in the family forget their password and they had to resort to someone that had to get Apple support to change and hard reset it.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Did apple give you access to your father's locked ipad? I don't think I would want family members getting into any locked devices after my death.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I don’t want to break into my phone. If it’s preventing others then fuck yeah.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Great but why is it every day I'm getting a message from halfway around the world someone's trying to login into my apple ID?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Seems like a separate password for iCloud would have been a lot more flexible of an option, but where's the vendor lock-in for hardware repair in that?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Will my 6s be included?",
        "points": "0 points",
        "children": [
          {
            "comment": "Probably not since this feels more like a feature update rather than a security vulnerability.",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Zero day for that shit incoming.",
        "points": "-13 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My problem with this is that FaceID isn't 100% accurate. It sometimes fails to unlock.",
        "points": "-2 points",
        "children": [
          {
            "comment": "Face ID and the security delay aren't required when you're at familiar locations like your home.",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The formidable Press 1 to Continue",
        "points": "-1 points",
        "children": [
          {
            "comment": "Keyboard not detected - Press Space to continue.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'm optimistic, but it is Apple.",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Even better chance for the device to endup at a landfil.",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Harder for who ?",
        "points": "-5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And then the next update and another and ok cloud svc",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Again",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Would have thought every OS update for our everyday devices should be continously making it harder. No need for headline or post.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I just want split screen for my iPhone. Maybe landscape too so I don’t have to keep flipping my phones orientation when docked",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "But does that mean the thieves will hijack you and bring about your home to break into your phone?",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Shouldn’t all the updates make it harder to break into your phone",
        "points": "-12 points",
        "children": [
          {
            "comment": "Read the article.",
            "points": "12 points",
            "children": [
              {
                "comment": "Shit",
                "points": "-12 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "How about they fix the “allow paste” option when copy and pasting an address into google maps",
        "points": "-4 points",
        "children": [
          {
            "comment": "go to settings/ google maps / and all the way at the bottom is paste from other apps. if you change it to allow it will stop being such a terrible user experience",
            "points": "4 points",
            "children": [
              {
                "comment": "Thanks! I remember it being a big deal that Apple fixed the “allow paste” thing and thought it was just my phone not allowing it",
                "points": "0 points",
                "children": [
                  {
                    "comment": "it's apple so it will randomly stop working and start giving you the popup again so you'll have to go retoggle it every few updates. lol",
                    "points": "-3 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Well yeah, that’s like half the reason why updates exist.",
        "points": "-24 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Shocker.",
        "points": "-23 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Will eventually be featured on /r/agedlikemilk",
        "points": "-29 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Cool, cool, let's just take away PIN forever. In fact, let's just make the phone unlock when you're within two meters of it. Nothing will ever go wrong with that.",
        "points": "-5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That's not the point of updates? Make it secure?",
        "points": "-25 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Will it fix my broken predictive text?",
        "points": "-6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It will probably just kill the battery",
        "points": "-25 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And easier for app developers to hack your data.",
        "points": "-22 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This will only add $250 to the price of next year's phone",
        "points": "-12 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "For a week",
        "points": "-15 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Doesn't it actually become harder to break into iOS every update? I think it's kinda normal?\n\nExcept all of these are an issue when repairability is at stake - it gets harder and harder to replace components, because they're battling both the unauthorized service centers - and stealing the phones \"for parts\".",
        "points": "-20 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don’t give a shit, Just fix wireless charging on the 15pro please",
        "points": "-19 points",
        "children": [
          {
            "comment": "There’s a problem with it? My phone charges fine using MagSafe.",
            "points": "6 points",
            "children": [
              {
                "comment": "You can see in the last ios update notes they were working on it for 13 & 14 models. It’s specific to Qi chargers, which is found in several models/vehicles",
                "points": "-3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Wireless charging is detrimental to the health of your phone battery, just use a cord ffs",
            "points": "-6 points",
            "children": [
              {
                "comment": "Is it the heat generated from the coil? I didn't know that. Thank you for your comment. I'll try charging with cable more now.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Yeah, that and the radiation generated is generally bad for everything. The charging bay in the car has a vent underneath to keep it cool while charging",
                    "points": "-5 points",
                    "children": [
                      {
                        "comment": "This is nonsense.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "When a device is charged wirelessly, electromagnetic radiation is generated. What part about that is nonsense?\n\nOr does a cooling fan hurt your brain?",
                            "points": "-3 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "and the planet, they couldn’t invent a more inefficient charging method if they tried.",
                "points": "-2 points",
                "children": [
                  {
                    "comment": "Yes they can. Ultrasonic waves blast an entire room, a small receiver (basically a microphone) receives the vibrations and turns them into energy. They already made them, they just don't use them because they're terrible.\n\nYou can also make a charger like a crystal radio, but that's just longer range and more inefficient charging.\n\nHowever, when we're talking about phones, the current wireless charging really isn't a big issue. It's a minor amount of power. We lose more by people forgetting to turn a lightbulb off.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "One of the reasons I love my ‘24 Tucson is the wireless charging bay under the console. I drive a lot for work and never needed to charge my phone, or experienced a drop in battery health. It was 98% when I traded it in.\n\nNow it won’t work. My fiancé’s 15pro max? Perfect. Mine won’t charge in the car, or my docks / mats in the house.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "your iPhone\n\nI have Galaxy S22 ultra",
        "points": "-25 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is a great update.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "isn't this after that guy made people casually give him their passwords and he would \"break\" into the iPhone and change the passwords?\n\nJesus what a title. I thought this was about jailbreaking.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_198sgfe",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://wccftech.com/iphone-16-switching-to-qlc-nand-flash-higher-storage-less-endurance/",
    "title": "iPhone 16 Could Switch To QLC (Quad Level Cell) NAND Flash For Higher Storage Models, But At The Cost Of Lower Write Endurance, Other Drawbacks",
    "points": null,
    "comments": [
      {
        "comment": "Anyone who manages to use up his QLC NANDs Write Endurance on an iPhone for this to actually become an issue I both tip my hat and point my finger at laughingly.",
        "points": "284 points",
        "children": [
          {
            "comment": "It’s literally such a non issue this isn’t worth talking about. If you have 1TB iPhone you’d need to write like >300GB/Day for 5 years to even remotely accelerate the failure.",
            "points": "158 points",
            "children": [
              {
                "comment": "And you have to port the ProRes video to an external drive for 60 FPS. I wonder if that’s related, or they could’ve allowed it within capacity on the 1TB model?",
                "points": "36 points",
                "children": [
                  {
                    "comment": "I’ve always wondered if this is a heat issue not a nand write speed issue.",
                    "points": "10 points",
                    "children": [
                      {
                        "comment": "I think it’s a user experience issue since 3rd party apps such as Blackmagic cam can do 4k60 internally.",
                        "points": "4 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Not in my wheelhouse. It could be both?",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "It could certainly be a combination of both.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "With QLC(4 bit per cell) it is also possible to allow even faster speeds as a manufacturer if you use parts of the storage as TLC(3),MLC(2) or even SLC(1 Bit per cell). You loose quite some capacity in these configurations but ssd manufacturer eq handle it sometimes with a reserved quarter of the ssd that, if the ssd runs full, will be treated again as QLC slowing the speed down again. Apple could do something similar.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "I don’t need a 1Tb phone to accelerate failure, I can do it just fine on my own",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "This guy nands",
            "points": "11 points",
            "children": [
              {
                "comment": "Wolfman's got nands!",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "What… exactly is ‘write endurance’? I’m not super tech savvy.",
            "points": "4 points",
            "children": [
              {
                "comment": "SSDs physically wear down at a microscopic level each time you record new data (“write”) to it. After an insane amounts of new writes, that one cell stops working, decreasing the usable space.\n\nThink of it like a storage room with a wood floor. Every time you put something there you’d cuff the floor. When that one spot gets too scuffed up, you aren’t allowed to put more stuff there. You end up with less floor space to store things.\n\nBut!!! No one in normal usage would hit that limit in a phone by the time it becomes unsupported (5-7 years).",
                "points": "27 points",
                "children": [
                  {
                    "comment": "Oooh! I knew about the SSDs. I didn’t know it had terminology behind it.\n\nThanks a lot! I learned something today.",
                    "points": "5 points",
                    "children": [
                      {
                        "comment": "NP! What the article is saying is that Apple is going to use QLC (“Quad-level cell”): using a cell to store 4 bits of data.\n\nReprising the wooden floor analogy, this is the equivalent of stacking 4 boxes on one spot on the floor, making the floor wear down/scuff faster— ie decreasing the lifespan/“write endurance”.\n\nThis isn’t a huge issue nowadays, but it depends on how good a controller is attached to the SSD. A controller is kinda like a warehouse foreman who will tell the workers not to keep using the same convenient spots and to haul stuff evenly across all the spots on the floor, to make the wear even. Now, even a good foreman can’t do their job perfectly— which is why sometimes they tell the workers to put the boxes in a worn down spot. Not a huge issue with 1 box or maybe 3, but stakes are higher when you’re stacking 4 boxes tall; the errors add up and add up fast. And if you tell workers to put boxes in an already really scuffed up place— the boxes can fall through the floor and get lost.\n\nIt remains to be seen whether Apple will use or develop a good controller to mitigate these issues. But theoretically, you won’t hit the scuff limit on a mobile phone with normal use.",
                        "points": "4 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "ELI5ish: The data you store is basically just a bunch of electrical charges. Charges are stored in little cells, and while it is easy to read how much charge is inside, it is difficult to change the amount of charge because you basically have to shove electrons through a solid cell wall they don't want to go through. If you made the wall weaker, the memory wouldn't be stable. So by forcing them through the wall when you want to change the charge, you damage the wall a little each time. Eventually you damage it so much that you crack it and electrons leak out.\n\nBy moving to different technologies, you may have either a weaker wall relative to the energy required to change the charge, or may need to change more cells more frequently, either of which causes the wall to break faster.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "So don't run a storage server for a multimedia company on it. Got it.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "On top of that, it’s an Apple rumor. Apple is very tight-lipped so we very likely won’t know for sure until someone tears down the phone. It’s an article written just for clicks. It means absolutely nothing.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Plus, higher storage devices (independent of whether it's a SSD, phone etc.) usually consist of an increases number of memory chips, meaning when the same amount of data is written the writes can be distributed across more cells increasing write endurance (if the same memory is used).\n\nThe only issue I see here is that the same price premium is kept, which is already higher than the increased cost for the additional memory.",
            "points": "-1 points",
            "children": [
              {
                "comment": "increasing write endurance\n\nIt's an order of magnitude worse. Capacity is almost irrelevant. QLC P/E cycle is in the low hundreds while TLC is thousands. Most TLC drives can survive 2000TBW per TB capacity (3000 P/E cycle assuming 1.5x amplification).\n\nDon't make excuses by saying capacity can adequately compensate anything, it's not even close.\n\n200-300TBW isn't something a normal user would ever reach on a phone. So if that's your argument, don't pretend capacity is a factor to begin with.",
                "points": "7 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I mean, this could totally be a problem on base models. A QLC chip which is 95% full over a long period of time dies very fast. I don't think it will be a problem for higher storage models though.",
            "points": "0 points",
            "children": [
              {
                "comment": "Pretty sure the only way for this to become an issue on an iPhone is by using an App specifically designed to make this an issue. The only time I've ever heard of NAND Flash dying en masse was when ppl started doing that weird ass Blockchain Calculation where it makes use of fast Storage Systems.\n\nThis Article has like zero value except to the Sensationalists seeking for a reason to bash Apple.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Dude stop. You’re on Reddit, blind hate for Apple is what is required here.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Internal Apple meeting: “this technology comes with two significant benefits: it increases capacity of storage and makes the phones die faster.”",
        "points": "262 points",
        "children": [
          {
            "comment": "“Shut up and take my internal resources.” /s",
            "points": "71 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I hate designed obsolescence as much as the next guy, but the difference between qlc and tlc write endurance isn't that huge. Also, larger drives will have more flash to level wear across. So in this specific case it's probably not a big deal.",
            "points": "44 points",
            "children": [
              {
                "comment": "Even heavily used QLC drives end up getting controller failures first ime. I work in IT and I track the write cycles of drives, I think I only ever saw one get under 50% and it was backing up an entire system every day, so tons of writes.\n\nThe only way I'd see an issue for iPhones is if someone was doing lots of 4k recording and regularly filling it up.",
                "points": "16 points",
                "children": [
                  {
                    "comment": "Weird that the controller would wear out, you'd think that would be designed to work basically forever 🤔\n\nEither way, interesting to know.",
                    "points": "8 points",
                    "children": [
                      {
                        "comment": "You'd think so, but I've literally never seen an SSD die from wearing out the flash. It's always something to do with the controller/host interface. I've seen thousands of them at this point, it's honestly bizarre. It's also why I have zero qualms about using QLC. Maybe once someone makes an actually dependable SSD aside from that I'll worry about it.\n\nI've even seen the high end Samsung NVMEs die. Never even close to wearing out the NAND. They either get corruption issues or just stop responding completely. It's very annoying.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Tim Apple: heavy breathing",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "“You had me at “significant resources”. Or if you were wearing a black turtleneck while saying it, then you had me before opening your mouth.”",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You missed the part where they charge more for higher capacity",
            "points": "-7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "“That one sounds interesting, but we need to do something about the other one… I suggest we restrict the capacity in software.”",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I was gonna say \"when most of your clientele is already buying a new phone every year for stupid reasons anyway, why not?\"",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Hmm yes... I know some of these words...",
        "points": "53 points",
        "children": [
          {
            "comment": "iPhone 16 could switch to eeeeeeeeee for higher storage models but at the cost of eeeeee, other drawbacks",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Every memory cell could store 4 bits of data instead of 3 (or less), but you can wear out every memory cell more quickly.\n\nThe amount you need to write to wear it out is still massive and would be a non-issue for most people.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I'll preface this by saying QLC gets a bad rap, it's improved a ton and capable enough for a phone, but with how much they charge for flash (like $1 a gig) switching to QLC to save $0.01 on that gig is an insult.\n\nWhere it's going to be rough is when your phone is near full and your phone is consuming tons of time and cycles defragging the storage with the slower QLC writes.",
        "points": "11 points",
        "children": [
          {
            "comment": "TLC is really only necessary for desktop computers that read/write large volumes of storage often for years at a time.\n\nGaming PCs, handhelds, mobile devices, there's no need for it, QLC is fine. Now if this resulted in a price drop on new phones that'd be great but you know it won't. They're making them cheaper while increasing the price as usual",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I've not heard of defragging solid state storage. People defrag their QLC storage devices?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Nothing about the cost will be lower when it comes to iPhone storage.",
        "points": "25 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why? Apple asks a higher premium for higher storage variants and they are still greedy?",
        "points": "11 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I would be extremely mad if they use cheaper part without lowering the price.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Using cheaper storage while increasing prices seems to be pointless.",
        "points": "2 points",
        "children": [
          {
            "comment": "It 's very pointful for their bottom line",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Damn it will be hilarious if they still maintain their overpricing of storage even after switching from TLC to QLC 🤡",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "QLC is such thrash haha apple stupid.\n\nMeanwhile My intel 600P from 2015 in my 24/7 torrent pc is still up and running.\n\nPlease tell me more about your 9 years old phones that you still use everyday",
        "points": "10 points",
        "children": [
          {
            "comment": "Intel has moved to QLC since the 660P and improved their AFR over the 3D NAND TLC they used earlier in the 600 series.\n\nThe endurance of TLC and QLC is pretty much identical these days, you only get a considerable increase in P/E cycles my moving to MLC or SLC but your storage density drops like a rock at that point.\n\nThe main thing you loose with QLC is write speed performance but this can be mitigated with higher SLC or RAM cache.",
            "points": "21 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I've had 8 QLC drives fail from 3 different vendors. I'm no longer considering QLC as more than a temp drive to keep easily accessible downloaded content on.",
            "points": "8 points",
            "children": [
              {
                "comment": "I have bought my first one in 2014-15 (not sure tbh) for a gaming laptop it is a 1TB model, after I sold the laptop I kept it and used it as a torrent device (that was in 2019) it's still working\n\nI have an office with 15 machines running, all intel 660 and 600P 1TB, most of them built in 2018-2019. Never had a problem.\n\nI built a pc for my hardcore gamer brother, Intel 660P in 2020, all is well for now.\n\nAnother PC built in 2021 for a friend, Intel 760P, no problem so far too.\n\n​\n\nQLC is reliable and cheap, I love it. That being said my gaming machine runs on samsung's 990 pro, there was a special on amazon...",
                "points": "-2 points",
                "children": [
                  {
                    "comment": "The Intel 600p, 760p, and Samsung 990 pro are all TLC. The first QLC drives came out in 2018. You love TLC, not QLC.",
                    "points": "-3 points",
                    "children": [
                      {
                        "comment": "The 660p is QLC, 760p is TLC the 760p has actually slightly higher AFT than the 660p which makes it overall less reliable a bit than the 660p.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The old Samsung pro SSD drives all have true write capacities in the petabytes, those things will last longer than our civilization would. Of course once they’re powered down they lose data relatively quickly.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Where is this QLC not lasting long coming from? Article writer needs to go back to tech school.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Keep in mind that, as well as a reduction in endurance, QLC can be significantly slower as well.\n\nTrue Apple innovation.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Disposable, just like they want their products to be.",
        "points": "-2 points",
        "children": [
          {
            "comment": "Why do they do free iOS updates for so many older phone models?\n\nIf the goal is making phones disposable, why not refuse iOS updates after a year?",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The average consumer doesn’t care about this. These small ‘enhancements’ are tiresome. No one at Apple has the balls or vision to overhaul the landscape of the iPhone, which is what it needs. What initially made iPhone so revolutionary was because Steve Jobs wasn’t afraid to make big scale changes. He wasn’t afraid to wipe the slate clean and start over, no matter how much work was involved up to that point. He was innovative.\n\nNo one at Apple is a big enough visionary, brave enough, or has the clout to make sweeping changes to Steve Jobs’ last vision. There is a huge fear to take it to the next level because nobody wants to be responsible for tanking the iPhone brand.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "iphone fuckin sucks. even at basic shit now like battery life.",
        "points": "-7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Article by Microsoft comments by Apple",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Love the outrage by folks who are falling for a rumor from a phone that's 8 months away from even being announced. Highly doubtful rumor and yet, it'll do what it intended to do, drive website clicks and ad revenue.",
        "points": "-1 points",
        "children": [
          {
            "comment": "They could have moved to QLC years ago, and no one would have cared because most people have no idea what it is and for phones does not matter at all.",
            "points": "-1 points",
            "children": [
              {
                "comment": "Totally. Most folks don't use their phone anywhere enough or to a level they'd run into an issue and 99% of buyers are just everyday users.\n\nHeck, they could not upgrade the processors for the next couple years and most wouldn't notice a difference because they don't even need the current processing power.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I realize that QLC is inferior to TLC but this is a use case where I can't see it becoming an issue. People don't fill and empty their phones very frequently and the slow long term writing speed shouldn't affect any operation of a phone really. The really disgusting bit is that this is only a move to improve their margins though, so fuck Apple for that.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why do people need so much storage when there’s iCloud?\n\nEdit: wow! This really struck a nerve. 😂",
        "points": "-18 points",
        "children": [
          {
            "comment": "Unreliable internet?",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Dependent on apple for storing all my shit?",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You can't record a video directly to iCloud, for one.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Data bandwidth?\n\nData transfer speed?\n\nData transfer cost?\n\nData transfer reliability?",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "What does this mean?",
        "points": "0 points",
        "children": [
          {
            "comment": "Apple can produce new Iphone at cheaper cost. New phone dies faster. So it's a win win for them",
            "points": "0 points",
            "children": [
              {
                "comment": "Its not really going to die faster with the usecase of how phones work/are used.. if you had a 1TB SSD in your phone, even crap QLC drives are rated at completely wipeing and filling the SSD 0-100-0 everyday for a year.\nIn the real world, 99.9999% of people would never get close to the limits of what QLC SSDs can do in the total ~7-year life span of their phone.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "These sorta problems are really for people who can afford to just get a new device whenever they need it.\n\nThis really won't cause any consumer harm so long as the controller for the storage medium is even marginally effective.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "How about adding SD card slot like normal phones do?",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_198s7d5",
    "subreddit": "u/HeroWarsDominionEra",
    "dataType": "link",
    "dataUrl": "https://www.hero-wars.com/?delayedsignup=true&nx_source=adx_reddit.{{AD_NAME}}&cp=-.ag-{{ADGROUP_NAME}}.agid-{{ADGROUP_ID}}.aid-{{AD_ID}}.cid-{{CAMPAIGN_ID}}.post-{{POST_ID}}.rdt_click-{{CLICK_ID}}",
    "title": "Many failed before. Will YOU complete the trial?",
    "points": null,
    "comments": [
      {
        "comment": "A black hole is a region of spacetime where gravity is so strong that nothing, including light and other electromagnetic waves, has enough energy to escape it.[2] The theory of general relativity predicts that a sufficiently compact mass can deform spacetime to form a black hole.[3][4] The boundary of no escape is called the event horizon. Although it has a great effect on the fate and circumstances of an object crossing it, it has no locally detectable features according to general relativity.[5] In many ways, a black hole acts like an ideal black body, as it reflects no light.[6][7] Moreover, quantum field theory in curved spacetime predicts that event horizons emit Hawking radiation, with the same spectrum as a black body of a temperature inversely proportional to its mass. This temperature is of the order of billionths of a kelvin for stellar black holes, making it essentially impossible to observe directly.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wait, you actually opened the comments? Are you stupid?",
        "points": "2 points",
        "children": [
          {
            "comment": "Just to see whether I'm alone or not...",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "they are",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I'm that lonely and bored...",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The world would be such a better place without you people in it.",
        "points": "1 point",
        "children": [
          {
            "comment": "You start!!!!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "this you?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "nice",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "son ellos",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "with many on the title this is a juicy clickbait .",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "who is upvoting this why",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wasn't expecting comments on this",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Techbible is your go-to tech community. Ask questions and get expert answers on all things SaaS. Stay updated on the latest tech news, discover trending tools, and share your tech stack with the world. Don't Forget to try it out.\n\nhttps://techbible.ai/",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "wow",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]