[
  {
    "id": "t3_19dlcs9",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://newatlas.com/motorcycles/bel-and-bel-akira-kaneda-electric-motorcycle-replica/",
    "title": "Post-apocalyptic dream ride made real in the striking Akira electric moto",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19djoqq",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.notebookcheck.net/HP-cites-threat-of-viruses-from-non-HP-printer-cartridges-to-justify-blocking-their-use-experts-sceptical.795726.0.html",
    "title": "HP cites threat of viruses from non-HP printer cartridges to justify blocking their use, experts sceptical",
    "points": null,
    "comments": [
      {
        "comment": "The REAL question here is \"why are your ink cartridges sucepitble to viruses whereas every other printer out there isn't\". Seems pretty damn easy to fix, it's not like the cartridges should be doing too much heavy lifting within the firmware. They hold the ink, and receive power to dispense it, they don't NEED to be carrying tons of memory for your DRM nonsense purposes, nor do they need to allow reading that..",
        "points": "42 points",
        "children": [
          {
            "comment": "But if they cartridges aren’t tied into the system you’d never be able to tell if they’re HP cartridges!",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You don't need to be an expert for this one.",
        "points": "17 points",
        "children": [
          {
            "comment": "I ditched HP for Brother laser printers and never looked back. The “I’m done” moment for me was when my printer wouldn’t let me print a black/white page because I was low on cyan (which shouldn’t be needed to print all black, especially since I had replaced the black ink). I realized HP was just a bunch of suits angling for promotions by screwing their customers for short-term game while actually wrecking their company in the long term.\n\nDisclaimer: I have never done any work with either of the companies I mention here.",
            "points": "10 points",
            "children": [
              {
                "comment": "I was a copier repair man 10 years . I’ve worked on both HP and brother. HP is the devil. They started putting chips into their ink cartridges so you had to buy their ink but their chips sucked often an HP won’t even recognize an HP chip or it will miss read. At that time you could pull the chip off an old cartridge and glue it onto a new one, but I’m not sure that even works anymore.",
                "points": "8 points",
                "children": [
                  {
                    "comment": "There is only one-ish solution: riot (and/or memes)",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Burning the HP HQ to the ground?\n\nCrusades?\n\nPS: Fuck HP.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "yeah, way back in the day (2009?) had a nice all in one HP scanner/printer, I liked it quite a bit. It wanted fresh ink cartridges, so I took some still sealed, popped them in, and it told me they were already expired. F U\n\nThrew the whole thing in the trash, got a black and white samsung laser for $40, lasted me good 13 years. Recently got a Brother HLL2305W so should be good for another decade at least :)\n\nA toner cartridge lasts me something like 5+ years, and a two pack is $20 on amazon.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "It is used to print that hidden watermark to identify your printer for the CIA and FBI.",
                "points": "",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "then you never came across the reason for my rage quitting: replaces the ink with an old cart i found, it let me know the cart was too old to be used. same model cartridge. dated 2017. come on…",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "​\n\n<image>",
        "points": "5 points",
        "children": [
          {
            "comment": "So they can make sure it’s their cartridge lol",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I will probably throw some sort of mini celebration when HP finally die.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Other printer manufacturers must absolutely love HP going above and beyond to be as scummy as possible so their own shenanigans look almost quaint and benign by comparison.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Reset the printer and load original software and disconnect internet updates and the printer can use third party cartridges without a hiccup.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "He cited a threat that he himself raised years ago.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“I just need you to tell me that viruses COULD come from non-HP cartridges.”\n\n“Sir, that’s not a likely—“\n\n“Just say the word ‘virus’.\n\n“Virus.”\n\n“Great, we’ll take it from here.”",
        "points": "1 point",
        "children": [
          {
            "comment": "I could see that conversation happening.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "HP is flailing as they're failing.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Gunna need an N95 mask due to the overwhelming stench of bullshit",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If theres an interface between the printer and cartridge to allow for a virus payload to be injected, thats concerning to begin with, cuz what data could possibly be communicated between them other than \"ink low\" warnings ?\n\nFurthermore, What exactly would a virus do inside a printer ? Log the data you print and send it to chinese servers ? Print malicious stuff to waste your ink ?",
        "points": "",
        "children": [
          {
            "comment": "Well we know that the HP ink cartridges have DRM chips, so they must have a data protocol to speak with the printer. The fact that HP is worried that malicious cartridges can infect their printers tells a lot about their security capability (i.e. that it's pretty bad). They've effectively just admitted that they've secured the channel poorly.\n\nBut infecting office appliances like networked printers is quite useful. They can be used as hops to spread horizontally to other devices on the network. Many poorly configured networks will have firewalls only on the internet facing side, so there is often less security to deal with if you're attacking the network using a device within the network. Or these could even mine cryptocurrencies or send spam. These are internet connected devices after all - sure just a single printer isn't going to be very valuable for mining but consider the millions of HP printers in use.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "People still use printers?",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You need to be brain-dead to believe this one.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That's just begging for a black flag op by HP",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19djo64",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.techspot.com/news/101599-intel-arrow-lake-s-desktop-processors-could-ditch.html",
    "title": "Intel's Arrow Lake-S desktop CPUs could ditch Hyper-Threading after more than two decades",
    "points": null,
    "comments": [
      {
        "comment": "It's the Apple strategy: If you have no new features remove them and reintroduce them later again as a feature.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19djn4t",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.techspot.com/news/101593-hp-ceo-customers-who-dont-use-companies-supplies.html",
    "title": "HP CEO says customers who don't use the company's supplies are \"bad investments\"",
    "points": null,
    "comments": [
      {
        "comment": "Just like the printers they make...",
        "points": "94 points",
        "children": [
          {
            "comment": "I agree - but they all suck - all of them. The CUPS protocol needs to shot in the head and thrown off a bridge. And don't even get me started on AirPrint - holy fuck.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I actively avoid selling HP whenever I can aside from laptops. Shitty company showing off how “eco friendly” they are but why tf do they send every set of ink in plastic bags just for me to take the ink out and throw out the bag. Fuck subscription ink. Brother is no hassle and just works and Epson did well with their ecotanks and thats why their printers are almost always out of stock at my store",
        "points": "47 points",
        "children": [
          {
            "comment": "Agree, had a brother laser printer for years , when he finally died after many years of abuse, I wanted a color one but hate the ink printers , decided to test the ecotank thing , loving it !",
            "points": "11 points",
            "children": [
              {
                "comment": "The first part of your sentence is wild if taken without context 🤣",
                "points": "13 points",
                "children": [
                  {
                    "comment": "Hahaha 🤣 , another subreddit and it would be quite different read ! \n\nnote to self , read over stuff you post online before post",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Xerox ColorQubes",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yea I’ve had an HP laptop for the past 5 years and it’s held up great but in no circumstance am I buying one of their subscription printers",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "This exactly. BTW since you have experience, which do you prefer? Brother or Epson?\n\nI've had brother A3 printers for over 15 years and fuck HP.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Maybe it would be a good investment if... THE BLOODY SCANNER WORKS WITHOUT INK!",
        "points": "24 points",
        "children": [
          {
            "comment": "Wait really? The scanner takes ink to work?",
            "points": "3 points",
            "children": [
              {
                "comment": "HP will lock off functionality of the scanner if the ink subscription isn't paid for",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Is that for America only or for all over the world?",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "I imagine it's their global profit strategy for their subscription ink. Ransom hardware so nobody buys their products again is the more likely outcome",
                        "points": "3 points",
                        "children": [
                          {
                            "comment": "I have an HP scanner+laser printer. I've been using afm cartridges for 3+ years and it works, no problem with scanner even with Wifi. I think it got something to do with America.",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "You have to have a valid cartridge in there. If the cartridge is empty or not loaded, it won’t scan. Some 3rd party units have a chip to fool the printer.",
                                "points": "",
                                "children": [
                                  {
                                    "comment": "It does not show ink level on app but everything else works fine, the \"put an HP supported cartridge\" also disappears after some time. I think the chips do fool the printer, and you all need those chips in America lol.",
                                    "points": "",
                                    "children": [
                                      {
                                        "comment": "Nah fuck HP. I love my Ricoh. HP is an embarrassment to the world and makes American corporations look like greedy wastes of oxygen.",
                                        "points": "",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "Might not have a subscription ink printer if it's older than 3 yrs",
                                    "points": "",
                                    "children": [
                                      {
                                        "comment": "It will be 10 years old this year lol",
                                        "points": "",
                                        "children": [],
                                        "isDeleted": false
                                      },
                                      {
                                        "comment": "The multifunction unit that wouldn’t scan for me was definitely older than 3 years. The only way to do HP is find an old monochrome 4/5 series or some of the business lines. Fact is that Ricoh, Brother and Canon (who have made HP laser print engines) are just better.",
                                        "points": "",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Look at that, a shit company has a shit take on how customers work.",
        "points": "13 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "HP CEO is a textbook case of how delusional one becomes if they spend every minute of every day huffing their own farts.",
        "points": "12 points",
        "children": [
          {
            "comment": "Its what happens when the C Suite are paid enormous sums for their 'leadership', they get delusions of omnipotence.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yeah well HP products are terrible investments",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Luckily I threw my last HP printer away around 1997, since then I have used Epson and Canon printers, all of them dying sooner than later. Since 5 years only using Brother laser printers and no issues whatsoever.",
        "points": "4 points",
        "children": [
          {
            "comment": "I hate to provide them a minor score, but I still have my HP printer from circa 1997 and it’s been in regular use the whole time =x it’s one of those colorful ones that Elle Woods from Legally Blonde would have (mines teal and white with orange accent).\n\nI’ve been anxiously awaiting its death so I can upgrade, but for my casual printing jobs I can’t rly justify it until it gives in naturally.\n\nI’m sure I’ll be blown away by the progress printers have made over the years once I finally get experience it myself lol",
            "points": "1 point",
            "children": [
              {
                "comment": "Credit where credit is due: before something went wrong sometime in late 2000s, HP products were quite good. Laserjet 1020 an similar printers are virtually immotral.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Wow, well if it's working that's great.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "\"our long-term objective is to make printing a subscription.\" - HP's CEO\n\nNope. Not playing that game.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "When I was working for commissions at a computer store 20 years ago, if folks came in for ink I’d sell them a new printer. It was roughly the same price as a new set of cartridges (this was before they started doing starter cartridges).\n\nA strong bit of evidence to my teenaged brain that capitalism was a bad plan.",
        "points": "1 point",
        "children": [
          {
            "comment": "My wife once came home with 6 printers she bought for $15 each instead of paying $150 for ink, because fuck the environment",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "well, that would be true when the business model is to sell you a printer at a price where they need you to buy overpriced ink to offset that again",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "HP, more like Hateful Printer",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Buying an HP printer is a bad investment",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I remember when an HP CEO went on to become the vice presidential pick of Ted Cruz in 2016. What a pedigree!",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Did that guy just try and revive “NO U”?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wait, I thought I invested in the printer, I had it backwards?",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19d4ub3",
    "subreddit": "r/gadgets",
    "dataType": "link",
    "dataUrl": "https://www.engadget.com/vibrating-belt-that-treats-low-bone-density-gets-fda-approval-181552362.html",
    "title": "Vibrating belt that treats low bone density gets FDA approval",
    "points": null,
    "comments": [
      {
        "comment": "A vibrating belt targeted at woman of a certain age? The jokes practically write themselves.",
        "points": "470 points",
        "children": [
          {
            "comment": "The vibrating belt made my bone quite dense.",
            "points": "129 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Lots of ladies about to start having bone density issues",
            "points": "18 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Better boner density.",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Daddy ain’t gonna break these hips. Buzzzzzzzzzz",
            "points": "9 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Pretty sure I saw those in Betty Boop cartoons",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "It’s stimulating",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "From the study\n\nThis double-blinded, randomized controlled trial enrolled postmenopausal women with low bone mass who were not taking bone-active medications. Women had a bone density DXA and assessment of thyroid function to screen for eligibility Those who qualified were randomized to receive Osteoboost treatment 5x/week for 12 months with the belt in either the active or sham setting. The sham device created a sound but did not deliver vibration.\n\nHow is this really a double blind study? Wouldn't people be able to tell that the device wasn't vibrating rather than just creating a sound? Doesn't mention how they controlled for things like how much activity the participants were getting. Seems like something worth mentioning since things like exercise can have a huge effect on bone loss.",
        "points": "112 points",
        "children": [
          {
            "comment": "Presumably, the participants weren't advised HOW the device improved bone density, just that it did. If you didn't know the real device was supposed to vibrate, then you'd probably just assume the noise was the device doing something positive.",
            "points": "160 points",
            "children": [
              {
                "comment": "Hmmm yea, just like when this thing around my ankle starts yelling at me for trying to leave the house or because it detects alcohol.",
                "points": "55 points",
                "children": [
                  {
                    "comment": "because it detects alcohol\n\nThe ankle monitors are stealing our blood now?!",
                    "points": "9 points",
                    "children": [
                      {
                        "comment": "They actually just detect it on the skin",
                        "points": "4 points",
                        "children": [
                          {
                            "comment": "Seriously?",
                            "points": "2 points",
                            "children": [
                              {
                                "comment": "Yes, actually.",
                                "points": "5 points",
                                "children": [],
                                "isDeleted": false
                              },
                              {
                                "comment": "Yep, it's a small molecule that can be excreted in sweat, it can be picked up this way",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Also from the study\n\nSome limitations of this study include a small, racially-homogenous study population and inability for blinding and placebo-control. During the sham treatment, participants were told that vibration may occur at low levels so as to be imperceptible. However, during the verum treatment, it would have become immediately obvious that the device was on, and was off for the previous treatment.\n\nSo you're right to point this out and they did include this caveat to the blinding part of the study in their conclusion.",
            "points": "26 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You bring a good point about blinding, however the results (change in bone density) can't be manipulated if user knows they're getting vibration, they CAN however be manipulated by the reading radiologist .. but hopefully that's the party that's blinded. So I guess that's okay? Unless the vibration frequency is ultrasonic. (This part is probably patented and not subject to disclosure).\n\nThe controls you mentioned weren't mentioned either which probably play a huge role.",
            "points": "22 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Never been so excited for grandma to get a vibrator.",
        "points": "38 points",
        "children": [
          {
            "comment": "Why make fun of women? I’ve got osteoporosis and it’s no fun. If I fall, I’m likely to break something important and be in a world of hurt. Way to show compassion",
            "points": "-31 points",
            "children": [
              {
                "comment": "If a vibrator joke riles you up this much maybe just... Completely stay out of the comments... You're likely to shatter",
                "points": "24 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Never been so excited for grandpa to get a vibrator",
                "points": "11 points",
                "children": [
                  {
                    "comment": "THANK you. Old men with osteoporosis needed this comment.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Why you so fragile...",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "this is the same mechanism was to why cats pur and have higher bone density?",
        "points": "14 points",
        "children": [
          {
            "comment": "My thought as well",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "My dad had one that he wore around his neck for neck surgery recovery.\n\nWorked better than the old timer “drink milk” foolishness.",
        "points": "116 points",
        "children": [
          {
            "comment": "Drinking milk is a very good way to supplement the nutrients you need to recover from a broken bone.",
            "points": "52 points",
            "children": [
              {
                "comment": "Calcium really. Extract of bovine lactate is just more likely to be on hand.",
                "points": "17 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Did you get bone density scans before and after?",
                "points": "-26 points",
                "children": [
                  {
                    "comment": "He doesn’t have to there are already studies that prove supplementing minerals like calcium can treat low bone density",
                    "points": "27 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Google is so easy to use. Here you go friend https://www.renoortho.com/specialties/general-orthopedic-surgery/nutrition-for-healing/",
                    "points": "11 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Are you telling me I am not getting my legs back by drinking milk each morning? I was wondering why it was taking so long.",
            "points": "2 points",
            "children": [
              {
                "comment": "If you drink it in the morning, you don't have any in you at night, and sleep is when recovery happens. Start drinking it at night and you'll no longer be forced to be Lt. Dan on Halloween.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I remember seeing one of these types of belts advertised to “jiggle fat away”",
        "points": "21 points",
        "children": [
          {
            "comment": "it was all the rage in the 20’s didn’t work then, doesn’t work now.",
            "points": "18 points",
            "children": [
              {
                "comment": "Right but they’re saying this new one gives you a boner. Or something like that. Skimmed it tbh.",
                "points": "17 points",
                "children": [
                  {
                    "comment": "Impacts improve bone density -- things like jumping rope are quite good for your bone health (Though can be hard on your knees). I'm pretty sure this is related as it would effectively be causing a series of fast, low magnitude impacts.",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "Boners aside, it is pretty interesting. Guess it stimulates the stuff the builds bone up.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I worked on a conveyor belt for years and can tell you that being pressed up against the frame can indeed have that effect.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "Niiiiice 😏",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "*1920's",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Yes and they were still in the gym in the 60’s and 70’s. No one wanted to believe they didn’t work I guess. Lol",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I was given one of these to use for several months after my second spine fusion. I do think it helped speed up signs of bone growth-fusion. I didn’t have one of these after my first fusion and even after 1 year there wasn’t much fusing going on but this time X-rays showed results much more quickly.",
        "points": "10 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If it makes old ladies less grumpy then I am all for it.",
        "points": "34 points",
        "children": [
          {
            "comment": "Get off my lawn!",
            "points": "6 points",
            "children": [
              {
                "comment": "Why don't you get off first and see how you feel!",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It's the hysteria that you need to worry about.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I think it should be strapped at the front ಠᴗಠ",
        "points": "16 points",
        "children": [
          {
            "comment": "Helps with the other kind of bone density ;)",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Can’t wait for the South Park episode for this!",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "have we gone full circle from the 60 belts? you know Those things?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They’re wearing it wrong",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "it’s set to wombo",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I'd rather have a cat.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So it's basically a \"cat purr generator\"? I thought of that, but it was not as clunky.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just like a cat. This would likely help improve other health as well.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Bone twerking",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "gat DAMN these electric sex pants",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "There’s a whole episode of mad men about this",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That women was born to model this product",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "After watching that documentary not sure I trust any sort of gadget getting approved.",
        "points": "0 points",
        "children": [
          {
            "comment": "Which one?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why not just put a bunch of very content cats on the patient? Go fancy and offer bathtubs full of cats to float in? Nature already provides everything we need.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That’s weird. Low bone density is due to a lack of activity. Young and old. The best way to increase bone density is doing some resistance training. Lifting some weights or using your body weight.",
        "points": "2 points",
        "children": [
          {
            "comment": "While it's true physical activity is important preventative care and treatment, some people genetically are way more prone to losing large amounts of bone mass.\n\nAnd the strength training has to involve the bones you're trying to strengthen/prevent loss. There are plenty of elderly who maybe can't due to injury and are then going to have extra trouble recovery due to the bone loss as well. Whereas this well enable someone who is sedentary to help improve.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Ummmm no, it’s not weird at all. Women who are in or post menopause (menstrual periods completely stop naturally due to age), elderly, even younger gals/women not getting their periods due to low weight/low BMI, malnutrition, over exercise, eating disorders, etc are all prone to bone density loss and osteoporosis. Hormones, thyroid dysfunction, and other conditions can affect your bone density too.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Not true. My friend lifts weight, runner, aerobic and still losing bone density.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Oh yeah, it definitely treats “low-bone” density",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Not again",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That’s not the only thing it treats…",
        "points": "0 points",
        "children": [
          {
            "comment": "hysteria? wink",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why did I read this as “vibrating butt plug” and not question it? And why did I immediately think that maybe my vibrating butt plug might negate my family’s history of bone density. And that I might have a better health outcome in that regard relative to my arthritic grandmother who has likely never used or owned a vibrating butt plug?\n\nETA: I’m relieved this isn’t a vibrating butt plug. It will be much more usable and will able able to reach a wider market",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "<image>",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Vibration is not the mechanism by which bones cells are signaled to lay down minerals which would increase bone density. This is bullshit which will pray on lazy people not willing or, admittedly, physically able to do the actual restive training that is known to improve bone density.\n\nThe FDA is a joke. This is 100% a money grab.",
        "points": "-5 points",
        "children": [
          {
            "comment": "Vibration is not the mechanism by which bones cells are signaled to lay down minerals which would increase bone density.\n\ndo you have links to your source?\n\n​\n\nWhole-Body Vibration Therapy as a Modality for Treatment of Senile and Postmenopausal Osteoporosis: A Review Article\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC9925023/\n\n​\n\nA Comparison of Whole-Body Vibration and Resistance Training on Total Work in the Rotator Cuff\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC2742455/\n\n​\n\nVibration therapy and osteoporosis\n\nhttps://theros.org.uk/media/uvsdna2v/vibration-therapy-fact-sheet-august-2017.pdf\n\n​\n\nhttps://ntrs.nasa.gov/api/citations/20150000242/downloads/20150000242.pdf\n\nInfluence of Combined Whole-Body Vibration Plus G-Loading on Visual Performance",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "$800? C’mon.",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "[deleted]",
        "points": "1 point",
        "children": [
          {
            "comment": "“Case in point”.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Lady has no backbone",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Can I get a vibrator for my big bone?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Weren't these things sold as a weightloss solution?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Is this real, or a Fox News 3am product.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Relax-a-Cizor",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is a Dead Like Me episode",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "like the Niagara vibrators",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Shake weight vibes",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just take some Deca",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My only regret is that I have boneitis",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Did the study account for cat owners vs non cat owners?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is cool, I use a vibration platform for general well being and lymph node drainage, I guess it’s good to hear it might be impacting my bone density in a positive way. I believe these were organically inverted for to keep astronauts from losing bone density in space. So it makes sense.",
        "points": "0 points",
        "children": [
          {
            "comment": "This sounds interesting. And I have osteopenia. Do hhave a link?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The shake and bake",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I already have a vibrating bed. So I wonder if it works the same way?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]