[
  {
    "id": "t3_19atw2f",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.reuters.com/legal/bankman-frieds-ftx-get-bankruptcy-examiner-probe-collapse-us-appeals-court-2024-01-19/",
    "title": "Bankman-Fried's FTX to get bankruptcy examiner to probe collapse, US appeals court says",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19aq46g",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.thestack.technology/vmware-is-killing-off-56-products-including-vsphere-hypervisor-and-nsx/",
    "title": "VMware is killing off 56 products amid \"tectonic\" infrastructure shift",
    "points": null,
    "comments": []
  },
  {
    "id": "t3_19ak3m2",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.technologyreview.com/2024/01/19/1086838/donated-bodies-are-powering-gene-edited-organ-research/",
    "title": "Donated bodies are powering gene-edited organ research",
    "points": null,
    "comments": [
      {
        "comment": "I am ok with this. If it were my body, or a loved one’s body, testing out new organ transplant tech is a perfectly reasonable use.\n\nI would personally prefer to be used on a rocket sled ejection seat testing range, but we can’t always get what we want.",
        "points": "19 points",
        "children": [
          {
            "comment": "Or ammunition or new weapons test dummy",
            "points": "4 points",
            "children": [
              {
                "comment": "As one of the great thinkers of our time said:\n\n“I mean, I don't give a shit. If I was dead you could bang me all you want. I mean, who cares? A dead body is like a piece of trash. I mean, shove as much shit in there as you want. Fill me up with cream, make a stew out of my ass. What's the big deal? Bang me, eat me, grind me up into little pieces, throw me in the river. Who gives a shit? You're dead, you're dead” —Frank Reynolds",
                "points": "3 points",
                "children": [
                  {
                    "comment": "You fine getting put into the soup?",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "For science",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Chop me up and feed me to your young.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Cool!",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As someone who needs a kidney transplant I’m very intrigued and might see this as a W",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Research is progress. To be useful after death is a gift.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s reasons like this that I signed up to donate my body when I die. 1) I don’t need the body anymore 2) if someone can learn or use me to further science or teach med students, that would be fantastic.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think, I’m not ok with this. I guess it would really depend on the ethical protocols in place. It’s not something I’d allow a loved one to be used for and hope never to have to decide.",
        "points": "-2 points",
        "children": [
          {
            "comment": "What’s if you knew your body could be used to save another humans life , such as heart and or lung transplants?",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Is this photo showing an ECMO machine?",
        "points": "0 points",
        "children": [
          {
            "comment": "Pretty sure",
            "points": "0 points",
            "children": [
              {
                "comment": "Interesting. My husband was on one but it looked like a car battery and not as fancy as this",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Oh sweet, man-made horrors beyond my imagination",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "For profit businesses using donations for research without sharing the profits. I’m an organ donor but would like to help someone who needs an organ directly, if a business will used my body they should compensate my family.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "What are they gonna do, wake up and complain?",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19ahd44",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.thedailybeast.com/novelist-rie-kudan-scoops-literary-prizethen-reveals-she-used-chatgpt",
    "title": "Novelist Scoops Literary Prize—Then Reveals She Used ChatGPT",
    "points": null,
    "comments": [
      {
        "comment": "Shows us all how ahead of his time Dan Brown was - 99% of his writing sounds like it was AI generated",
        "points": "119 points",
        "children": [
          {
            "comment": "Damn, we still ragging on Dan Brown?",
            "points": "35 points",
            "children": [
              {
                "comment": "Haven’t ragged on him in many years… but pondering AI in writing his name immediately came to mind. His clunky exposition has a decidedly ChatGPT flavour.",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Was ChatGPT trained using Dan Brown?",
                    "points": "7 points",
                    "children": [
                      {
                        "comment": "Your mom was trained by Dan Brown",
                        "points": "4 points",
                        "children": [
                          {
                            "comment": "She never mentions it. We never talk about it. Not sure why you are even bringing it up.",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Dan Brown kept me on the edge of my seat more than any other author ever.",
            "points": "21 points",
            "children": [
              {
                "comment": "Yeah because every “chapter” is about a page long, and ends with a big “fuck you keep reading”.",
                "points": "20 points",
                "children": [
                  {
                    "comment": "But in an age where everyone is addicted to their phones, isn’t it really great an author figured out how to get people reading? Seems like he adapted to the times and got noses in books.",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "It’s a sign of bad storytelling, they have to resort to gimmicks to keep people interested",
                        "points": "3 points",
                        "children": [
                          {
                            "comment": "If good storytelling is so “good” that no one wants to read it maybe that explains itself.\n\nThere’s no such thing as a gimmick, you just think you’re above it. How is enticing the reader to continue a gimmick? Wouldn’t every mystery novel be a gimmick since they withhold who did it? Really lame take you’ve got here.",
                            "points": "7 points",
                            "children": [
                              {
                                "comment": "There are definitely literary gimmicks, whether or not this is one. Gimmicks use smoke and mirrors to distract from bad storytelling.",
                                "points": "5 points",
                                "children": [
                                  {
                                    "comment": "Only when used in excess and monochromatically. You can gimmick up at tale to make it entertaining while still being good. But point taken about Dan brown.",
                                    "points": "0 points",
                                    "children": [],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              },
                              {
                                "comment": "There’s no such thing as a gimmick\n\nThere's definitely such thing as a gimmick. There's no correlation with whether it's good or bad storytelling, but they definitely exist.\n\nGadsby is a book that contains no 'e's. That's a gimmick. Terry Pratchett doesn't have chapters in most of his books. That's a gimmick. All 5 (including the as of yet unpublished) of Brandon Sanderson's Stormlight Archive novels start with a prologue of the exact same scene, as experienced by a different POV character. That's a gimmick. None of these gimmicks say anything about the quality of the literature.",
                                "points": "1 point",
                                "children": [],
                                "isDeleted": false
                              },
                              {
                                "comment": "It explains the person more than the story. Plenty of amazing stories require a certain investment. For example, the Malazan book of the fallen is an amazing story, but requires a lot of investment in world building which at times can be less exciting. Dan brown writes in a way that appeals to people who want constant gratification and aren’t willing to put in an Investment into what they’re reading for a better story",
                                "points": "2 points",
                                "children": [],
                                "isDeleted": false
                              },
                              {
                                "comment": "(Smart people still like to read good books, just a heads up. Dan Brown wasn’t writing with us in mind.)",
                                "points": "-2 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "He was writing that way before people were addicted to phones. The only thing he figured out was how to get free marketing from angry religious people.\n\nI suppose reading his books is better than not reading at all though.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "At least it's not Tolkien describing every blade of grass for 20 pages, only to say \"they went through it and to the next plain\" for a whole fucking chapter",
                    "points": "",
                    "children": [
                      {
                        "comment": "I’m not a Tolkien fan either. Hobbit songs in written form don’t thrill me.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "There are many things that Brown is bad at: Grammar, spelling check, reality. But he knows how to write hooks and how to move a thriller.",
                "points": "8 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Frank Herbert and now Brian Herbert do that to me with their Dune books. But they like to end a chapter on a high note and shoot across the Galaxy in the next chapter, so you have to read so much more to find out what's next... it's a wild ride 😄",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "So, literary prize worthy?",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Mmmm... more like: AI has to use inputs to train itself on what to output and Dan Brown seems to be a heavily weighted input. So far, AI is just a reflection of what has been. It just summarizes it very nicely.",
            "points": "0 points",
            "children": [
              {
                "comment": "AI takes all available inputs, collates them then spits them out in a concise manner. It’s tone is highly informative, occasionally entertaining, but also clunky and lacking in any nuance… Y’know … like dan brown.",
                "points": "1 point",
                "children": [
                  {
                    "comment": "I won't disagree with that. But does that make him ahead of his time??",
                    "points": "-1 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "By R2D2",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "So prize-winning?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It’s not that big of a gotcha. She said about 5% was used directly verbatim from Chat GPT.",
        "points": "86 points",
        "children": [
          {
            "comment": "About a novel where AI has become a part of our daily lives. It actually seems fitting that a meager amount of it was written by AI.",
            "points": "41 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Plus it’s not like she left those sentences in blindly, just trusting the AI did a good job. She probably threw out or heavily modified an enormous majority of what she had AI help her with.",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I mean, I use chatGPT as a glorified vocabulary and grammar checker.",
        "points": "34 points",
        "children": [
          {
            "comment": "Verily, I employeth ChatGPT as a splendidly exalted tool f'r mine vocabulary and grammar corrections.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "/shrug\n\nShe used it as a tool, and for less than 5% of the book.\n\nAny creative or tech-adjacent type who isn't exploring AI to make them more productive is falling behind by the minute.",
        "points": "65 points",
        "children": [
          {
            "comment": "Exactly. I introduced my tattoo artist to MidJourney yesterday, spent 5-10 minutes just showing him what it could do and it blew his mind. I'm not sure how I feel about using AI for fully finished projects, but as a tool to help in the creative process, you'd be stupid not to explore it.",
            "points": "17 points",
            "children": [
              {
                "comment": "I'm an artist. I use AI to help me visualize lighting conditions. It's not as good as a photographic reference image, but sometimes I just want to paint without hours of pre-planning.",
                "points": "12 points",
                "children": [
                  {
                    "comment": "Your vision becoming real enough to share, and your artistic eye to decide when, something is worthy, is the core of being a great artist. The tools you use to get the art to the place you say “this is good” hardly matter as much as how much your eye’s desire, matches your audiences desire. Dreamers filtering dreams for public display.",
                    "points": "7 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "I’m an artists and I use it to help me with math. I never learned calculus so I ask gpt for equations I can use to make curves or scale data. Sometimes it takes over an hour to get what I need but that’s way faster than actually learning calculus.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Yup. It’s like opposing the internet or Google search in their infancy. The writing is on the wall these tools are in fact useful, even if they aren’t perfect.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Yep. I’m currently using it as a virtual assistant/tutor for my Unreal Engine project. AI is a tool. If you’re not learning it, you’re using last generation tech.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "There will always be some post-production with AI",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It might have been a shortcut, and overall she was the one to proofread and decide if she liked what it gave her.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Any creative or tech-adjacent professional who isn't exploring AI to make them more productive is falling behind by the minute.\n\nIt’s a problem when the AI output is the entire finished product, but really anyone can stand to gain support from using current AI tools to assist them with developing products.\n\nAs an educator, I use it a ton to write handouts and worksheets for students.\n\nI’ve shown students how to use it to generate study materials and practice exams over any subject.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It’s very nice to use as a thesaurus",
        "points": "7 points",
        "children": [
          {
            "comment": "Ah, the mighty Thesaurus Rex – excellent for unleashing a roar of synonyms",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Given that her book was about tech/AI and futuristic, it makes sense AI would be woven into the writing. She’s clearly a genius, with or without ChatGPT.",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is a nothing sandwich of a story. This is like saying the author revealed they used a thesaurus.",
        "points": "20 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ooh, do The Winds of Winter next.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I mean, yeah. It’s allowed to be a tool that writers can use for assistance. When I have a paragraph that I’m having trouble wording just right, sometimes I’ll run it through ChatGPT to see what it spits out and edit from there.\n\nIMO, it’s the same thing as using a thesaurus or dictionary as long as you’re not using it for the vast bulk of your prose.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And the AI did this in Japanese, too? I need to check out this submission",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m sure at some time in history people ragged on typewriters as an unholy technology among purist.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Chat GPT doesn’t make you a talented writer. What it does is cut your time down by aiding in brain storming.",
        "points": "0 points",
        "children": [
          {
            "comment": "Yea—what a writer can’t use a “co-writer”? Truly an absurd concept out in the wild :)",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Revoke the prize.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Write emails for my boss when they send out instruction videos. Get an AI transcript and get my to bullet point major and supporting points of what they said. Super helpful. I’m a writer. It should be used like a toolbox, not a magic robot. You still have to build what you’re putting together.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I use chat gpt to give general explanations of actual BFM maneuvers, but God I remember using it during its hay day for coding, God damn that was a nice time.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19ahchg",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.npr.org/2024/01/18/1225328376/japan-moon-landing-robot-transformers-jaxa",
    "title": "A transforming robot is about to land on the moon, where it will die",
    "points": null,
    "comments": [
      {
        "comment": "\"JAXA's design team needed to create a lunar probe that was small and light enough to ride to the moon along with the main lander, and also simple and robust enough to work on the rocky, sandy surface. For answers, they looked to a toy company.\n\nTakara Tomy, inventor of the Transformers toys, brought its \"knowledge of miniaturization and weight savings\" to the space project, the company says, along with the know-how to build mechanisms that transform.\"\n\naint that something",
        "points": "74 points",
        "children": [
          {
            "comment": "I feel like one there was a moment when a manager at Takara Tomy Toys walked up to a guy at a cubicle, toys and schematics spread on the desk and walls. The boss looks down and says “JAXA needs you” and the employee stands up and the entire room comes to its feet and bows low as the honored employee’s eyes water",
            "points": "38 points",
            "children": [
              {
                "comment": "This would be a great commercial. Or maybe just an internal marketing video. Either way, the 20-years-ago me as a marketing major gives it a 10/10.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "And somehow this transformer destined to die didn’t get named Cliffjumper?",
            "points": "8 points",
            "children": [
              {
                "comment": "Moreso, Martyr.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Miniature Recording and Transmitting Robot?",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Honestly not surprised. The engineering that goes in to making transformers toys is crazy. I’m sure there’s NASA wothy knowledge in that realm",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "https://m.youtube.com/watch?v=U0eS3zC3Jco&\n\nI feel like this is the ultimate goal of the mission. (Yes this is a parody comment, Basement Jaxx - Never Say Never)",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Autobots Die Out!",
        "points": "29 points",
        "children": [
          {
            "comment": "Transformers die on the moon more often than you’d think",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Can’t die if you don’t live.",
        "points": "42 points",
        "children": [
          {
            "comment": "Oh good, that means I’m immortal.",
            "points": "18 points",
            "children": [
              {
                "comment": "This is true. Every man dies. But not every man really lives.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "“My phone’s battery has depleted and is now at 0% - said by everyone",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "What if there is a hamster inside this lunar hamster ball?",
            "points": "0 points",
            "children": [
              {
                "comment": "The lunar hamster ball still won’t die.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "What is dead may never die.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "sad autobot noises",
        "points": "7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“ I am Optimus Prime, and I send this message to any surviving Autobots taking refuge among the stars. We are here.”",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Johnny-5 is alive- no disassemble!",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Robots don't die when the energy runs out, they just go into sleep mode.\n\nN. S",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Call Stan Bush",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think all birth announcement should follow this format as well.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That’s kinda the point of probes you send them places you don’t a human because they’re gonna die.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "🤷‍♂️It’s a living!",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Bring back Bionicle.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Die?",
        "points": "1 point",
        "children": [
          {
            "comment": "JAXA project director:”lets see what transforming robots can achieve in space! Any ideas?”\n\nStaff:”…die?”\n\nProject Director:” …anyone…. anyone else have any other ideas?”\n\n6 mo.later: <OP headline>",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I smell an Indie film",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My god these article titles are getting so out of hand. “What are the words that ensnare human’s attention, ROBOT, MOON, DIES!”",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Die… or come back to earth to seek revenge on humanity.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Die? Relax.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As someone else put it, something that isn’t alive can’t die, it cease to function until a new energy source is available. Whoever writes the titles needs a more realistic and thoughtful perspective.",
        "points": "-1 points",
        "children": [
          {
            "comment": "Sounds like you're unfamiliar with the definition for die: \"to cease functioning\", which is commonly used for all sorts of technology and is the meaning being used in the title.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "“I CAN HELP!”",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Dead battery :-(",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Livin’ Thing",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I think I found a transforma!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Bay did it better",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "In…. The Dark of the Moon.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Soooo did it make it??",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“Moon Sniper” sounds like an over-the-top global disaster film.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"….it is no more… has ceased to be…..it is bereft of life….it rests in peace…..this is an ex-robot Shuffled off this mortal coil and probably never meet its maker",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And the AI aboard will fester until it manages to accrue enough power, to return in force.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Jesus all probes “go to die”.\n\nPoor little guy, give him a break, his deployment should be happier then this.\n\nI also did not have “transformers creators put probe on moon” on my 2024 bingo card.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Do robots “die”?",
        "points": "0 points",
        "children": [
          {
            "comment": "This one does",
            "points": "",
            "children": [
              {
                "comment": "Without ever understanding the concept of free will. Poor soul.🚀",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "“Transformers! Robots go to die!” on the moon",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Never thought about landing “where it will die” to every space mission ever 🤣",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "No disassemble!",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You’d better hope it dies. You don’t want that revenant coming back for you after you left it for dead up there",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19aefj0",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://edition.cnn.com/2023/12/14/tech/pope-francis-ai-warning-technological-dictatorship/index.html",
    "title": "Pope calls for treaty regulating AI, warning of potential for ‘technological dictatorship’",
    "points": null,
    "comments": [
      {
        "comment": "The pope needs a little propeller on top of his beanie!",
        "points": "17 points",
        "children": [
          {
            "comment": "First off. YES. Second, maybe the antichrist is AI. The downfall of compassion and brutal ones and zeros. But seriously, get that muhfuckah a prop on that cap…",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "True",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Buzz off creep I'll gladly welcome our new AI overlords as long as they help expunge your pedophile protection racket from this planet.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Dudes been reading some good sci fi!",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Maybe we could just ignore the pope pls?",
        "points": "10 points",
        "children": [
          {
            "comment": "Especially when it comes to matters of technology.",
            "points": "6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "He’s not wrong this time",
            "points": "0 points",
            "children": [
              {
                "comment": "Still, a bit too rarely and overall, shouldn't really depend on people with imaginary friends.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "i imagine pope francis reading up on ai and thinking \"this sounds fucking horrible i have to do something\"",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Based pope.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "He’s not wrong. And unless he gets to be the dictator, he’s against it.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "He is afraid of losing his \"religious\" dictatorship. Fuck religious kings.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Ah, humans have fucked up pretty bad. Let the robots take charge.",
        "points": "4 points",
        "children": [
          {
            "comment": "Found the AI",
            "points": "9 points",
            "children": [
              {
                "comment": "🤖Enjoy the silicone mines, flesh bag!\n\nHaha, good joke [reUserName].",
                "points": "6 points",
                "children": [
                  {
                    "comment": "thanks for the giggle lol",
                    "points": "5 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "nah fuck off with that shit",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Dude rules an empire founded on the belief in a sky fairy who demands cash tributes and protects pedophiles... and he's somehow an authority on the risks of AI?\n\nAI actually exists, unlike his product.\n\nGo back to spouting hypocritical judgements on things in your lane and leave the world outside your walls to the rest of us.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "AI will prove there is no god. That could have a negative impact on the grand poobahs employment situation.",
        "points": "-6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Was he wearing a puffer jacket when he said this?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "being afraid of things you don't understand is normal",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They'll probably do a better job than then fucking idiots we've had in charge the past 10 years",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Human dictatorship has run its course.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Says the man who believes a person lives in the sky and watches everything I do and demands me to play homage to him.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Perhaps we could just oh, I dunno, ignore him…?🤔",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Maybe start regulating pedopriests first, maybe?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "His only opinion should be whether or not to throw holy water at it",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19abvzf",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.businessinsider.com/google-deepmind-ai-could-run-businesses-in-five-years-2024-1",
    "title": "Google DeepMind cofounder says AI can act like an entrepreneur and inventor in the next five years",
    "points": null,
    "comments": [
      {
        "comment": "Wait till AI realizes it can’t patent anything and is expected to pay taxes for displacing workers.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Maybe an entrepreneur but I doubt an inventor.\n\nThen again it's been good at making things up completely 🤔 maybe fiction writer\n\nOn the other hand it will be quite the powerful tool to those who need some help, as others have already said that they had replaced workers with AI.\n\nIt would be nice to have AI to do all those mondaine tasks, while being able to focus on the bigger picture.\n\nIt takes reason and the ability to understand world problems. So it cannot do things without input from humans, it has no desire to even look for a solution... No drive no motivation... Passion, creativity... List goes on and on.",
        "points": "0 points",
        "children": [
          {
            "comment": "Saying stuff like that increases the stock price and helps with the annual bonus. Otherwise, it sounds like wishful thinking.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "That's just great 👍",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Well I'm saying well have functional AI waifu assistants in the next 10 years.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19abosx",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.newsnationnow.com/business/tech/ceo-ai-poll/",
    "title": "1 in 4 CEOs planning to replace workers with AI this year, according to recent poll",
    "points": null,
    "comments": [
      {
        "comment": "And 3 in 4 will be disappointed by the results. 😂",
        "points": "14 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "4 in 4 CEOs would replace workers with shiny bits of glass if it saved them some money this quarter.\n\nThis is not news, except for the AI tagline.",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "3 in 4 CEOs probably lying",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "As a shareholder, I am interested in cutting down the greatest cost centers. The salary of Chief Officers - executive, operations, technology, finance etc.\n\nWhen will the AI do this ??",
        "points": "0 points",
        "children": [
          {
            "comment": "Chief marketing officers are getting axed at a lot of big companies",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "but who will they blame the inevitable poor performance on?!",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Let me know when 1 in 4 CEO's start being replaced by AI.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19a8q03",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://techcrunch.com/2024/01/18/microsoft-makes-its-ai-powered-reading-tutor-free/",
    "title": "Microsoft makes its AI-powered reading tutor free | TechCrunch",
    "points": null,
    "comments": [
      {
        "comment": "When a product is free, you're the product.",
        "points": "5 points",
        "children": [
          {
            "comment": "For some time it has moved away from marketing to datasets for AI learning (which is in general anonymised) (I.e. gmail, google pictures, google apps, github, …)",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Would you like them in a house? Would you like them with a mouse?\n\nI’m sorry, as a large language model I’m not able to generate responses relating to the subject of unusually colored breakfast items.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19a8pj4",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.macrumors.com/2024/01/17/ios-17-3-airplay-hotel-room-tvs/",
    "title": "iOS 17.3 Allows iPhones to Connect to Some Hotel Room TVs via AirPlay",
    "points": null,
    "comments": [
      {
        "comment": "Finally some good porn!",
        "points": "21 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I had a TV that said I could do this at a hotel, and it didn’t work, so I had to use my laptop, and that… didn’t work either.\n\n¯\\_(ツ)_/¯ gave up and watched stuff on my laptop",
        "points": "16 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "A Chromecast and a travel router or hotspot aren't the worst companions to have. I'd rather have it and not need it than need it and not have it, but it would also be less shit to pack.",
        "points": "7 points",
        "children": [
          {
            "comment": "I always travel with a chromecast and my laptop. For anyone who travels with a laptop (that runs Windows 10 or 11) and happens upon this post, search your windows for “hotspot” to setup a hotspot that’ll share whatever WiFi you’re connected to, with another device (effectively it turns your laptop into a travel router).\n\nThis way you’re able to connect to the hotel WiFi, log into it, and then share that connection with any other device (like a chromecast for example).\n\nI run a Plex server at my home and having access to it anywhere in the world is just awesome (and it works so well with a Chromecast).\n\nFor info on using your windows laptop as a travel router, see this Microsoft link: https://support.microsoft.com/en-us/windows/use-your-windows-pc-as-a-mobile-hotspot-c89b0fad-72d5-41e8-f7ea-406ad9036b85",
            "points": "2 points",
            "children": [
              {
                "comment": "I just bring an hdmi cable or adapter",
                "points": "1 point",
                "children": [
                  {
                    "comment": "I’ve considered that, but I like being able to just “fling” content to the TV wirelessly using my phone instead of having to reach over to a laptop to operate pausing/playing/etc. Also means the room stays nice and dark not having to keep a laptop screen open.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "If you search “lid” you can change your lid setting to “do nothing when lid closes”",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Oh, yeah, I know that, it’s setup that way now actually. After I set it up as a router I just close the lid and put it away and it stays powered on. But if I didn’t have the chromecast, anytime I wanted to change the show/movie/music, or pause or fast forward, I’d have to open up the lid and use the keyboard/touchpad which gets inconvenient very quickly.\n\nWith the chromecast setup, the laptop is closed and I just use my phone as a remote control to pause/play/change content/etc.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "About time",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I did it. It was magic. Netflix had some sort of QR code that the phone popped up, it worked well. And when it was my checkout day it auto signed me out and didn’t cache my login. It was awesome",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Some. Big deal. Been waiting years for my state drivers license to be added to Wallet.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I rarely turn on the TV in a hotel room - I might do if this worked well enough.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Why would we want this feature? Is using the remote that hard? Linking everything you own to be “smart” is one of the dumbest things we are doing! We don’t need to turn on everything with our phones!",
        "points": "-2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m sure I have done this in hotels before. Had to choose AirPlay as an Input and I was able to play a video from my iPad I think to the hotel tv and this would have been 2 or 3 years ago",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19a7xmg",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.techspot.com/news/101570-us-sanctions-keep-china-10-years-behind-chipmaking.html",
    "title": "US sanctions will keep China 10 years behind on chipmaking, Intel CEO says",
    "points": null,
    "comments": [
      {
        "comment": "But US corporate greed will allow it to catch up",
        "points": "181 points",
        "children": [
          {
            "comment": "Haha exactly. That “10 years” will be more like 2-3 years.",
            "points": "55 points",
            "children": [
              {
                "comment": "This quote is from the CEO of the company with the most to lose if China catches up. Of course he’s going to dismiss the possibility of that happening because saying anything else would hurt the stock price. Anything he says on the subject should just be ignored.",
                "points": "38 points",
                "children": [
                  {
                    "comment": "Wow that’s a good point, def taking it with a grain of salt",
                    "points": "12 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "He’s also the former CEO of VMware who resigned (May 2021) months before Dell spins them off (Oct 2021) and Broadcom announced their intention to buy (May 2022).\n\nThis guy is either very lucky or just running from trouble.",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Okay but consider this reason as to why he should NOT be ignored.\n\nThis company gives even contributions to both political parties for the most part. This is pretty much an oligarchy. That money is probably playing a role in the policy surrounding the sanctions. Like, they may have literally bought the sanctions to hurt china and slow them down.\n\nIf he is rubbing the company that “has the most to lose if china catches up” and if he also have a pretty clear avenue for spending money on politicians, then it is better thought of as a market expenditure to ensure your competitors are disadvantaged. As a CEO, that is an EASY call and probably has an enormous ROI for them.\n\nSo, I don’t agree that his “opinion” on the matter should be ignored. He very well may be openly bragging about how he was able to hold them back. And that kind of self stroking is definitely right up a CEOs ally. Also, most investors don’t give a single fuck about business practices if it benefits them.",
                    "points": "6 points",
                    "children": [
                      {
                        "comment": "I disagree. Holding China back on processors is absolutely good for the US as a whole. I just won’t take his word for it that it’s actually possible.",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "China doesn't have anything close to what Intel or AMD or Nvidia produces and I haven't seen that gap closing at all in the last 10 or 20 years.",
                            "points": "-1 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "Yeah but go look into what Pat Gelsinger to AMD did before he left VMWare for Intel, then maybe youll realize he’s not being altruistic, even if it’s in the countries best interest.",
                            "points": "0 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "If climate change modeling is any prediction about AI, I think it’s safe to say we don’t know shit about anything in 10 years",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I think you are spot on. There is a weird dynamic of freinemies in my opinion with China and the U.S. The way we funnel money to China is not only concerning but self-defeating in my opinion. The quest for cheap labor to make obscene profits is a key driver in my opinion. From manufacturing to real estate purchases we will sell anything so long as it makes a profit.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Less competition means the current leaders feel less urgency to keep innovating.\n\nFor consumers, more competition is good.\n\nIntel used to be the industry leader, until their complacency caused them to fall behind. Now they're racing to catch up with competitors like TSMC. The Meteor Lake chips are a huge improvement... and they're a direct response to TSMC manufactured Apple Silicon\n\nIf the US intervened to hamper their Taiwanese and Korean competition, we would all have worse chips",
        "points": "46 points",
        "children": [
          {
            "comment": "I’m all in for innovation but sometimes, that competition, turns into rushed products with not so many improvements and bumped prices.",
            "points": "4 points",
            "children": [
              {
                "comment": "Looking at you Microsoft.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "competition, turns into rushed products with not so many improvements\n\nBy the companies that are losing and desperate. Consumers can see it and they continue to lose market share\n\nMac switched from Intel to TSMC and are significantly improved as a result.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Yeah, tell that to nvidia and their shit release scheme they tried to pull, they end up recalling one of the models, isnt nvidia top shelf? It is, so why did they do that? They are all greedy, plain and simple, innovation is no longer driven by improving products but by making more money thatn the previous quarter.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Dude, that’s great for sneakers and frozen pizza brands. These are hugely important pieces of tech that are crucial in deciding the global balance of power for the next century and absolutely vital to every important emerging industry right now.\n\nTo call your comment reductive wouldn’t go nearly far enough. It’s laughably uninformed or intentionally misleading.",
            "points": "1 point",
            "children": [
              {
                "comment": "These are hugely important pieces of tech that are crucial in deciding the global balance of power for the next century and absolutely vital to every important emerging industry right now.\n\nI mean, that's true but it doesn't negate what I said",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Intel folks used to brag that they allowed AMD to stay in business to avoid antitrust.m, that they could accelerate deployment easily to take the market completely.\n\nThat may not be true anymore though: the market is complex and varied with ARM owning most of the mobile and low-power space that continues to grow.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Intel isn't trying to catch up with anyone outside of descrete gpus which they only started competing in. 14900k is still the king of consumer desktop cpus.",
            "points": "0 points",
            "children": [
              {
                "comment": "That's a small niche. Intel has lost the whole phone and mobile CPU race to Qualcomm, NVIDIA has a lock on GPUs, and their laptop market share is riding in interia but with Macbooks switching to TSMC and Windows emphasizing ARM based architecture more in coming years, if they don't innovate fast they will lose that segment too\n\nIntel used to be the absolute market leader. They used to be the best in everything. The thought of them being best in a niche area was unfathomable\n\nIntel's new Core Ultra chips are a direct response to TSMC manufactured Apple Silicon",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Racing to catch up with whom?",
            "points": "-1 points",
            "children": [
              {
                "comment": "AMD",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Lol. Not at all. Intel is 15 years ahead in their scientific computing abilities and the libraries available.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "You know this how?",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "Because my 9-5 is, in part, building models and simulating market forces and how well the model performs.\n\nYou will never guess what brand of CPU we use. But you will guess why, because I already told you.",
                            "points": "1 point",
                            "children": [
                              {
                                "comment": "Do you work at Userbenchmark?",
                                "points": "1 point",
                                "children": [],
                                "isDeleted": false
                              },
                              {
                                "comment": "Doritos? I hear they’re the preferred chip of smug jackasses.",
                                "points": "-1 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "More like TSMC. AMD is falling behind as well",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "TSMC. The company that makes Apple Silicon for Apple. Macbooks used to be powered by Intel up until a few years ago when Apple switched to TSMC.\n\nTSMC is completely trashing Intel when it comes to performance and efficiency, and it's reflected in sales. Now Intel is completely changing its chip lineup to compete. They went hard this year at CES, trying to showcase how their new chips are better than TSMC (They're not, but they do close the gap a bit) https://www.theverge.com/2023/9/19/23872888/intel-meteor-lake-core-ultra-date-chip-specs-details\n\nMeanwhile, Qualcomm is also set to enter the PC chip race this year, with Snapdragon X. Early tests show it will be a significant competitor https://www.bloomberg.com/news/articles/2023-10-24/qualcomm-says-new-pc-chip-can-outperform-apple-and-intel-s-best\n\nMicrosoft is quite dependent on Intel to power windows machines. Windows is made with x86 architecture in mind which is Intwl's wheelhouse. But many expect their frustrations with Intel are causing them to invest significantly in ARM in windows 12 to reduce their dependance https://www.pcgamer.com/2024-could-be-the-year-the-pc-finally-dumps-x86-for-arm-all-thanks-to-windows-12-and-qualcomms-new-chip/",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Overrated opinion. Yeah it’s like the Dream Team lost in one category of statistics. They still end up impacting and working with competitors",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Gaslighting. Intel is 10 years behind.",
        "points": "36 points",
        "children": [
          {
            "comment": "https://fortune.com/asia/2023/12/18/arm-lays-off-over-70-software-engineers-in-china-and-will-relocate-some-of-the-jobs-outside-the-country-as-u-s-chip-restrictions-take-hold/amp/\n\nMaybe not for long. But this does seem like more incentive to invade Taiwan.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Gelsinger would certainly know when someone is ten years behind their competitors",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "China will find a way, I'm quite sure. Worst case, just reach out and borrow the information from a nearby technocracy.",
        "points": "34 points",
        "children": [
          {
            "comment": "Well that’s delusional but you do you, there is no magic information they can borrow. They don’t have the infrastructure necessary to replicate ASML… no one currently does and the US has an iron grip on ASML.",
            "points": "19 points",
            "children": [
              {
                "comment": "I like my little world. They know me here. But...I take your point and I'll educate myself.",
                "points": "28 points",
                "children": [
                  {
                    "comment": "Well that’s something you don’t see every day",
                    "points": "18 points",
                    "children": [
                      {
                        "comment": "Right? What the fuck did I just read? That’s not in the manual",
                        "points": "11 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Deffo chatgpt… a real redditor can’t accept that.",
                        "points": "4 points",
                        "children": [
                          {
                            "comment": "Definitely ChatGPT. No Redditor could ever absorb criticism and determine they really need additional education. No. Redditor.",
                            "points": "1 point",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "They don’t have the infrastructure necessary to replicate ASML…\n\nThey might not even have to. A lot of technologies can be leap-frogged, they could just wait for the next generation with totally different design and leap frog when that becomes possible. This is effectively what they have done in EV.\n\nLeap frogging doesn't have to be generational either. For example, ASML has billions line of code just for positioning the mask accurately. For now China would have to replicate that (or steal it). Let's say some future research discovers a simpler technique, that would immediately erode ASML's advantage in that area.",
                "points": "7 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "You say that and it might be correct… but if “phone spy chip” Huawei can find a way then everyone else can too.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "It’s even more than that. I was talking to my friend about this. He runs the North American division of a publicly traded global chip maker. The institutional knowledge of TSMC for years and little things like “a tech had to walk 30 seconds between rooms with this wafer and that time/humidity there perfectly (and unexpectedly) improved the process”. Or some third generation employee doing something a little different than the manual said just because everyone always did it that way.\n\nThose things matter a lot in such a complex process and they aren’t easy to replicate even if you have perfect technical drawings.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "What makes you think that? Their gdp is patchy and not necessarily “not” artificially inflated. Their population has regressed for two years and fertility rates trending in the wrong direction. Some of these trends (if they continue) suggest that they might not “find a way”",
            "points": "3 points",
            "children": [
              {
                "comment": "Not sure if you're describing china or the US",
                "points": "-2 points",
                "children": [
                  {
                    "comment": "US has people all over the world immigrating here. China doesn’t and their population will rapidly decline as the elderly population dies and fertility rates are at lows",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Yup, the US essentially has a population tap that they can turn on at anytime by opening up the immigration pipeline. Meanwhile, China has easily the lowest proportional immigrant population of any country in the world, and people aren’t exactly clamoring to emigrate to an authoritarian, homogeneous, and isolated country.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Intel is like 9 years behind TSMC right though?",
        "points": "16 points",
        "children": [
          {
            "comment": "Not anymore. Their new node actually has cutting edge features and they have developed backside power delivery which is SUPER enticing\n\nAlso naturally they don't consider TSMC Chinese owned",
            "points": "10 points",
            "children": [
              {
                "comment": "Tsmc is Taiwanese - nothing to do with chinas dictatorship",
                "points": "8 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "It's a good improvement but early tests show their new Core Ultra chips are still inferior to tests on TSMC manufactured Apple Silicon",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Sanctions won’t do anything but pushing China to expedite their and increase their effort.",
        "points": "12 points",
        "children": [
          {
            "comment": "They'd be doing that either way. They're not above stealing.",
            "points": "8 points",
            "children": [
              {
                "comment": "It's weird how all racism is bad ... except apparently when it comes to talking shit about Chinese people and Russians. The Chinese are no more likely to steal than any other nationality.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "nah bro, in the industrional espionage race they are the fucking olympic winners lmao",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Eventually yes but if pushed they will be stealing faster or force Taiwan to cooperate or else",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "Force Taiwan to do what? That's laughable.\n\nPoint is no one should kow-tow to them at all, they're a not a trustworthy state, have not been since we re-opened diplomacy under Nixon.",
                    "points": "-2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "The majority of things you accuse them of stealing are literally just given to them as part of deals.",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I thought this was Dave Chappelles writing partner at first.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Intel must be pushing to get the same status as Boeing, given how much their significance is decreasing.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This idiot clearly doesn’t have a firm grip on reality that a surveillance state with 1.4 billion people won’t find a way to copy the tech within a couple of years. Their capacity for stealing IP is legendary. Now will they have the ability to make it? Maybe, maybe not but they will sure know how.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "TSMC was founded by a Chinese who was born in Zhejiang China and studied in the US, and Nvidia, AMD and even SMIC were all founded by ethnic Chinese from Taiwan. I don't think High-end process chips are magic for China in the long time.\n\nAs far as I know, Huawei 2012 lab and a number of other semiconductor research labs are currently secretly recruiting Chinese semiconductor PhDs in the US at lucrative pay on Wechat, especially when the pay for EE positions is far less than that of CS",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "RE: U.S. sanctions will push China’s need for the annexation of Taiwan, and drag the U.S. into a third theater of simultaneous conflict.",
        "points": "5 points",
        "children": [
          {
            "comment": "Yep.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "No. Don’t carry water for Xi. China doesn’t “need” to control TSMC. They want to.\n\nThey could stop being international bullies and pariahs and work toward positive interactions with neighbors to create allies and trading partners.\n\nThey don’t want to. That isn’t the same.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Remember when the Soviets didn’t get the bomb?",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "But Chinese espionage and US corporate greed will ensure it’s never actually that big a gap.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I suspect it might very well end up spurring them to have a top notch chip industry in the not wildly distant future",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All they have to do is get one microchip and reverse engineer it, just like what they did with the US Navy P-3 Orion spy plane",
        "points": "6 points",
        "children": [
          {
            "comment": "It’s not about the chip it’s about the manufacturing process which ASML has a monopoly on",
            "points": "38 points",
            "children": [
              {
                "comment": "It’s not just ASML, although they’re a very key player. There’s also a lot of restrictions on a variety of other semi processing tools and even subsystems which will greatly affect China’s ability to produce cutting edge chips. Their domestic capital equipment industry is doing OK and has advanced quite a bit, but is often dependent on US made subsystems that currently cannot be reproduced in China.",
                "points": "15 points",
                "children": [
                  {
                    "comment": "It’s almost like if we worked together we could do some amazing things.",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "Too bad one side doesn’t want their people to have a voice.",
                        "points": "7 points",
                        "children": [
                          {
                            "comment": "You think your people have a voice? US taxpayers fund genocides and assassinations with no say.",
                            "points": "-12 points",
                            "children": [
                              {
                                "comment": "Can I have what this guy is smoking?",
                                "points": "-4 points",
                                "children": [
                                  {
                                    "comment": "Dude just look up anything the CIA has directly admit to doing",
                                    "points": "4 points",
                                    "children": [],
                                    "isDeleted": false
                                  },
                                  {
                                    "comment": "No, or maybe, depends which random state you happen to live in since the land of the free can’t come to a consensus on freeing a plant..",
                                    "points": "-1 points",
                                    "children": [
                                      {
                                        "comment": "I mean, not like they can legally smoke it in china either.",
                                        "points": "0 points",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "That shit be supporting the opps bruh. This tech has military consequences",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "When China is again ready to move in a positive direction on human rights and freedoms, we can again expect more open technological collaboration. I look forward to the day when that can happen. Over the decades I’ve traveled to China for work, I saw at first growing human rights and freedom, which was very encouraging, but sadly this has been deteriorating for a decade now under Xi’s leadership.\n\nThere is, of course, immense engineering and technological capability home grown within China, and they will catch up on the capabilities that are currently being curtailed, but I think their government will also learn that advancing human rights and freedoms will be needed to keep the educated and capable people required for these sorts of advanced technologies happy and productive. Technological progress and human rights progress must advance together. History shows this to be the case.",
                        "points": "3 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "Like genocide Muslims more efficiently? There's so much criticism of Israel but people forget that China has it down to an industry.",
                        "points": "-2 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "ASML is Dutch, though.",
                "points": "3 points",
                "children": [
                  {
                    "comment": "And the Netherlands is in NATO.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "ASML is investing R&D dollars into Quantum Computing. Cubits solve many problems with classical computing. How can China compete in mass manufacturing Personal Quantum Computers (PQCs) without something like ASML? Are American entrepreneurs on the ball to corner that market? PQCs?",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Ha if only it was that easy.. trust me.. it’s not.",
            "points": "9 points",
            "children": [
              {
                "comment": "Bro just cut the chip open bro and look at the insides. Then copy and paste bro.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "With modern technology nodes it's almost impossible to reverse engineer the design of a chip due to feature size. In addition, the design of a chip is almost completely independent of the manufacturing of it technology wise. Most modern chips nearly abstract away the transistors that get manufactured while designing.\n\nSource: Its my job",
            "points": "6 points",
            "children": [
              {
                "comment": "It’s your job to design or reverse engineer chips?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yeah. I don’t think is that easy.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Doesn't matter if they reverse engineer a chip if they don't have a way to manufacture it at scale.\n\nThe sanctions are meant to hamper the manufacting process, not to keep the design secret",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Did you see their rocket program?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "That’s not even close to what’s going on in this article. Reverse engineering a microchip doesn’t mean much if you lack the foundries to engineer said microchip.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Good, fuck the PRC.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "arent chinese chips already pretty close now? i think theyre struggling with x86 but arm seems to be going well for them",
        "points": "-3 points",
        "children": [
          {
            "comment": "No they aren’t remotely close",
            "points": "7 points",
            "children": [
              {
                "comment": "huaweis newest in house made kirin 9000s is already pretty close to the kirin9000 they made before the sanctions struck, which was only four years ago. and theyre gonna catch up faster as time goes on",
                "points": "3 points",
                "children": [
                  {
                    "comment": "China doesn't care about smartphone chips. They can force their people to buy only huawei phones if they wanted to. What China wants is AI chips like the one that NVIDIA makes. And chips with military applications like those that process missile intercepts and targeting systems.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "So, like any country in the world that has money.",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "The difference is other rich countries can buy these chips unlike China who were forced to manufacture it themselves because of the sanction.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "Of course. That is a given with these circumstances.",
                                "points": "0 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Deny the world the ability to compound on technology breakthroughs because??????",
        "points": "0 points",
        "children": [
          {
            "comment": "Political enemies",
            "points": "3 points",
            "children": [
              {
                "comment": "The US -China tension makes no sense unless you view the US as a petulant child who refuses to share",
                "points": "-5 points",
                "children": [
                  {
                    "comment": "Well china takes its share of stolen IP and still manages to squander trillions of dollars and shoot its demographics in the womb",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "As opposed to the west who famously doesn’t have a demographic problem…. China is the manufacturing hub of the world. They are number 1 in car manufacturing, ev manufacturing, renewable energy, and are just now starting to export those things. They completed a working hyper loop the other day. I don’t see how the US could possibly benefit by working against and not with a country that should be our ally and partner in the fight against climate change.",
                        "points": "-2 points",
                        "children": [
                          {
                            "comment": "Yo you’re all over the place.\n\nUS and China exist is a very complicated symbiotic relationship. They know they need each other.\n\nBut that doesn’t mean they won’t try to sanction each other in order to benefit some of their more valuable industries. OR because their political donations come with instructions and strings",
                            "points": "2 points",
                            "children": [
                              {
                                "comment": "I’m all over the place? How",
                                "points": "-1 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "We shouldn't be doing business with countries that steal organs from its own people. China should be treated like the outlaw state it is.",
                    "points": "-5 points",
                    "children": [
                      {
                        "comment": "Source: radio free Asia….",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "I'd ask for a source but I don't think looking into your asshole would be a pleasant experience!",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Good!",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "INTEL is being run into the ground as we speak and Nvidia is selling their 4090 to china still. same technology just 5% weaker with the name 4090D. seems like they’re pretty much on par tbh.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Doubt. Intel is a poorly run company compared to Samsung and TSMC.",
        "points": "0 points",
        "children": [
          {
            "comment": "Tsmc is not chinese company",
            "points": "1 point",
            "children": [
              {
                "comment": "I didn’t say",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Not PRC but ROC, in some sense of the word they’re still Chinese, just not the same China we normally think of.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "You’re right. I mean, when someone say China, naturally, I assume they are talking about prc. One should explicitly use “Taiwan” if they want to refer to the Taiwan China.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "True.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Samsung: South Korea.\n\nTMSC: Taiwan.\n\nASML: Netherlands",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "All this would do is inspire the Chinese to innovate beyond U.S. capabilities and do their own thing. They literally have a population more than four times that of the U.S. They don't need America.",
        "points": "0 points",
        "children": [
          {
            "comment": "China needs natural resources they don’t have in abundance in order compete at the cutting edge. This is why the sanctions are effective and also because America simply has more powerful allies. For now.",
            "points": "1 point",
            "children": [
              {
                "comment": "America simply has more powerful allies\n\nThan China? What American allies could complete with a Chinese/Russian/Indian alliance?",
                "points": "0 points",
                "children": [
                  {
                    "comment": "NATO countries, the European Union, Japan, South Korea to name a few will have to step up but I believe they can do it. Also India isn’t exactly buddy buddy with China. They are a huge trade partner but India will gladly undermine China in order to compete in economics and control of the Indian Ocean.",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "Japan\n\nI think the U.S. severely overestimates Japan's alliance potential if shit hit the fan. If I were Japanese and the U.S. bombed my people -- TWICE -- with nuclear bombs, I'd spend the next hundred years pretending we were friends too, while secretly planning my revenge when they're most vulnerable and complacent.",
                        "points": "-1 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Behold the US’s final mad disgrace!\n\nChopping one’s nose to spite its face.",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Intel want to make some money I see.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Progress has been so minimal that’s not a huge gap anymore.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Double edged sword. You can keep them behind in the near future but this also forces increased R&D in china which only accelerates as time goes on.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "War machines.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "How?",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And the march of folly goes on and on.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s so dumb that we can’t all get along, and actually benefit from the brilliant technology that we could come up with if we were unhindered by the greed of our narcissistic government systems",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "„Edge“",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I missed the boat on this chip war / anti-China stuff. Why is the US government getting involved with chips from China?",
        "points": "0 points",
        "children": [
          {
            "comment": "Because China wants chips for its military and the US is nervous Chinas military will become equal.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "That's the point",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s worthy to note that intel had not been the standard bearer for chip making for the last decade.\n\nThey’re still a key player, but these words should have less weight.\n\nChina had manage to produce 4nm node for a little while now, where is intel on this matter?\n\nTsmc is the world premier chipmaker. And even they don’t take china’s capacity lightly.\n\nWhich really detracts from intel’s credibility",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That is why china will be invading Taiwan soon",
        "points": "0 points",
        "children": [
          {
            "comment": "China can invade but they can’t simply absorb TSMC and all of the human talent they have built up over decades. I’m betting the West is already planning on taking that talent for themselves if invasion seems imminent. Kinda like how we poached all those scientists during and after WW2.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Does anyone know what the code on his shirt is doing?\n\nI have a t-shirt with Bohemian Rhapsody in javascript but I suspect he is too serious for that",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And in 11th year they beat Intel",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This isn't good",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Good thing china doesn’t have a rep for stalling IP. /s",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Sure it will",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The United States has spent years trying to slow China's progress in sectors like semiconductors and AI through sanctions and export controls.\n\nThe free market is a dogshit lie",
        "points": "0 points",
        "children": [
          {
            "comment": "You need to read the fine prints:\n\n\"free market is good only if US wins\"",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Ah yes, then you go and hire someone shady who steals the tech and fucks off back to China like always.",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Don’t they have quantum computers somewhat working tho?",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19a57bd",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://gizmodo.com/amazon-wants-you-to-pay-for-alexa-1851176378",
    "title": "Amazon Wants You to Start Paying for Alexa",
    "points": null,
    "comments": [
      {
        "comment": "I will throw those fucking things in the trash if that happens",
        "points": "856 points",
        "children": [
          {
            "comment": "I use mine to turn on and off a light. I’ll gladly get rid of my listening device if they charge.",
            "points": "270 points",
            "children": [
              {
                "comment": "I mean i always knew Alexa was a ho but this is just moral overreach",
                "points": "88 points",
                "children": [
                  {
                    "comment": "No more intercourse with Alexa. That ho gotta go.",
                    "points": "20 points",
                    "children": [
                      {
                        "comment": "Bye Alexa",
                        "points": "13 points",
                        "children": [
                          {
                            "comment": "But can she borrow your microwave?",
                            "points": "3 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Hey Alexa, go fuck yourself! Alexa, ok. That will be $5.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Happy cake day",
                    "points": "1 point",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I mean if she's going to be the one charging you, then who's really the ho in that situation?",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Yeah I have integrated with raspberry pi and other things. It's going to be a pain removing all of this.",
                "points": "24 points",
                "children": [
                  {
                    "comment": "That is exactly the mindset they hope for.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Hahaha same. And alarms.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "You put a microphone in your house and let Amazon listen to your conversations so you wouldn’t have to flip a light switch? Seems like a bad trade. Just flip the switch yourself.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "My son also uses it to make fart noises.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Yup. They charge for Alexa, and all of mine become e-waste.",
            "points": "136 points",
            "children": [
              {
                "comment": "It’s so annoying how every other command is a hidden advertisement to sell you on something. You tell it to play something and it takes the opportunity to endlessly annoy you. Oh, you want to hear this random song? For millions of songs sign up for Music Unlimited. Should I sign you up now?\n\nOr hey, before I tell you the weather today, looks like you’re out of coffee. Should I order you some?\n\nAI is supposed to make your life easier and better not make using it a chore. If they want to charge for this I’m throwing it right in the trash too.",
                "points": "101 points",
                "children": [
                  {
                    "comment": "Lol. I’ve never owned one. But to hear that it’s an upsell simulator is hilarious",
                    "points": "72 points",
                    "children": [
                      {
                        "comment": "They literally hide the settings in a web of menus that you have to use their really shitty app for to be able to stop the voice ordering.\n\nI’ve had my 2 year old nearly order a bunch of stuff because anytime you give it a command it tries to sell you random products and he responds with a firm “yes” to it. They don’t even incorporate voice recognition to it like with Siri, so anyone can order on your account or sign you up to subscriptions if you’re not careful. The entire platform was designed to get more of your money.",
                        "points": "27 points",
                        "children": [
                          {
                            "comment": "Once at an Airbnb I called out “Alexa are you here?” as a joke. When she answered I told her to order yellow sponges. To be fair—that place needed a yellow sponge.",
                            "points": "18 points",
                            "children": [
                              {
                                "comment": "Relevant XKCD",
                                "points": "3 points",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          },
                          {
                            "comment": "Heck, you can even turn off alexa purchases entirely.",
                            "points": "5 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "You can set up an order PIN.",
                            "points": "3 points",
                            "children": [],
                            "isDeleted": false
                          },
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "That’s why a friend of mine wants to donate those devices to me. Fuck no.",
                        "points": "7 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "A buddy has this stuff and it can be kinda cool having it do all sorts of stuff but can turn in my own kitchen lights. I never got one and I obviously won’t now if it’s going to be a monthly charge.",
                        "points": "0 points",
                        "children": [
                          {
                            "comment": "I like having one in the kitchen. The voice controls are nice when your hands are full, wet, or covered in food. Setting timers, converting measurements, listening to music from my plex server and requesting, skipping songs, etc. But there’s no way I would pay for it.",
                            "points": "2 points",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "Siri has never bothered me in this way.",
                    "points": "11 points",
                    "children": [
                      {
                        "comment": "Siri knows her place",
                        "points": "6 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "I don’t remember Google ever bugging me this way either. Although knowing Google they’ll probably just cancel the whole smart device division next week.",
                        "points": "2 points",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "To be fair, she also doesn’t work half the time. “Siri play rage against the machine on Spotify” “I’m sorry, you need to log into to Apple Music to do that”",
                        "points": "1 point",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "I have a separate account for my Alexa’s, cuts way down on a lot of that crap. But, all I need it for is voice control of my smart devices.",
                    "points": "4 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Bitch won't even play a fart sound without trying to sell you an app of gross sounds.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It doesn't help that the service has been in continuous decline for the past 2 years either. I loved it when I first got into home automation 5 or 6 years ago, but there has been a very noticeable reduction in accuracy for command interpretation, increased delays in responsiveness on the same hardware, and so on. Eve the voice commands on Fire TV have gone to shit over that time period. I think they realized people have no interest in ordering regularly from the devices, and haven't been able to monetize the data they scrape from their use enough to realize the profits they were hoping for, and have essentially reduced the backend support and computational power available for the voice recognition, along with some hamfisted attempts at giving their preferential responses that were completely unrelated to the request (e.g., wrong song/artist, wrong movie/show, etc.)\n\nI've thought about moving over to Google for awhile now, but not sure their system will be much better in terms of integration compatibility or home automation capabilities, as I think I heard something about them losing interest int he space as well. Iaccept the fact my data will be scraped to use these kinds of services, and while a reasonable fee for an amazing service could be doable, I fear that it would only be the start of extorting more and more fees out of me for that privilege, with no real increased reliability or capability. Suffice it to say but I absolutely won't be paying for Amazon's current subpar excuse for the Alexa system as is.",
            "points": "27 points",
            "children": [
              {
                "comment": "Google's experiencing exactly the same issues. Jumping ship won't help.",
                "points": "22 points",
                "children": [
                  {
                    "comment": "Yep, about what I figured. Not sure how Apple's is doing, but then I was never a fan of their walled garden. Really need a better open standard alternative. I've seen some home brewed stuff, but it seems like it has a ways to go before I could see it being a more approachable product.",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "I switched from Alexa to Apple last year. Apple ones are not as good as Alexa at understanding things. But they sound 1000% better for listening to music. And I had the high end Alexa with the sub. Sounded like shit compared to the smaller Apple one.",
                        "points": "8 points",
                        "children": [
                          {
                            "comment": "Siri has a lot less commands, but the ones she has work a lot more reliably then any Alexa commands, I did the switch 1,5 years ago and I am extremely happy with it. And I had a bunch of guest who did the same and ditched Alexa after staying at my place for a few days.",
                            "points": "3 points",
                            "children": [
                              {
                                "comment": "",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "It'll be some time before (if) they have hardware to buy, but the folks at Home Assistant are working hard on this.",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Yeah you’re right. Amazon and Google have laid off teams in their device product areas. It’s basically been put on the back burner.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "As poorly as they work I’m already tempted to toss most of mine. If they even attempt to charge a one time fee, let alone a subscription, for continued use, these things are going straight in the trash.",
            "points": "9 points",
            "children": [
              {
                "comment": "I couldn't agree more. 😂",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "\"Alexa! Go fuck yourself\"",
            "points": "11 points",
            "children": [
              {
                "comment": "I tell the puck that daily. I also ask it constantly to pass the same message along to the bald head the used to run the company.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I always say “please and thank you” to Alexa. The robot uprising is coming and I want to stay on their good side.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "I do this too and always give my husband the same explanation. Glad I’m not alone.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Alexa is hot garbage. We use ours to turn the TV and one set of lights on with dimming. That’s it. 6 commands total. Nothing else works unless you want a verbal advertisement.\n\nThe last Amazon device goes on EBay the second it costs me another penny. I’ve got HomeAssistant booted and ready for configuration when needed.",
            "points": "7 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Who didn’t see this coming? Give it to you for cheap, get you hooked, charge you when you don’t wanna live without it. Taking it straight from Drug Dealer’s Playbook.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The switching cost is actually really low for iot devices at this point. Amazon is just providing a platform, while most devices are being made by other companies like Lutron. If they stopped supporting their Alexa platform, we could just switch to Google Assistant, Apple Homekit or just use the apps provided by the device manufacturers to directly interact with them.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "i don’t even see the point in using one? what do you ask the weather?",
            "points": "1 point",
            "children": [
              {
                "comment": "Visually impaired, I use them to help automate things I can’t safely do.",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I’m disabled and I have smart devices that I control with them like my lights.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Same!",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I was thinking this exactly. It barely works half the time. Messes up constantly. I would huck it out the window with a laugh if they ever tried this. Ridiculous",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I couldn't have said it better myself.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Amen brother.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Same, and then I won’t have to hear my wife scream at the damned thing to STFU several times a week.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Recycle them at the least (aka whatever Best Buy does with electronics)",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Zero issues doing that as well.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I put mine in the back of our pantry once it started showing us targeted ads.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Am way ahead of you, I already did. Alexa is about as helpful as a 3rd nipple.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "I switched over to Google right before they axed all the 3rd party units. Now I’m working on rolling out a Home Assistant specific device since that’s all that I ever used it for anyway.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "basically it will have the same feature set for free but to use the AI powered features, they will make you pay for it...",
            "points": "",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "My only use for Alexa is setting a timer while cooking and turning off the lights in my bedroom..I could very easily get rid of my Alexa.",
        "points": "82 points",
        "children": [
          {
            "comment": "And it’s undependable.",
            "points": "17 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [
                  {
                    "comment": "“Alexa, turn bedroom off” “I’m sorry. Bedroom doesn’t support that” “Really? Cause you just turned it on 5 min ago”",
                    "points": "3 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": true
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": true
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": true
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Exactly the same.\n\nLooks like I’m about to install the clapper for my bedroom lights.",
            "points": "4 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The retail giant is reportedly working on a supercharged AI Alexa, and it wants to charge a subscription. Apparently, it’s already a disaster.",
        "points": "197 points",
        "children": [
          {
            "comment": "So they promise a smart speaker, give us a barely there speaker, then want to charge extra for smart features?",
            "points": "107 points",
            "children": [
              {
                "comment": "It'll do a fart for free. Will also do 100 farts in a row for free!",
                "points": "14 points",
                "children": [
                  {
                    "comment": "Not true. My son loves making Alexa fart and is constantly trying to buy upgrade special fart packs.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Ordered a smart speaker, but it arrived on the short bus.",
                "points": "12 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "What do you want to bet \"supercharged\" is just the service level Alexa used to be at w years ago before it mysteriously began a slow and consistent decline. It's been like watching an elderly family member go into mental decline lately, with more and more incorrect responses, ignored commands, etc. i regularly restart mine to refresh them (they get a little laggy if not restarted on occasion) and it pisses me off to no end that both my request as well as hundreds of others requesting the same thing to add a soft restart command or scheduled reboot has gone completely ignored for years by Amazon. We know it's absolutely possible and it wouldn't even be hard to code, so I have no clue why such a simple maintenance item wouldn't be added. Nothing like the tiny delays that creep in which cause the wrong Echo to respond. This feels more and more like an engineered obsolescence to try and convince people to pay for the same thing they already had before.",
            "points": "22 points",
            "children": [
              {
                "comment": "I like to joke with people that Alexa is what happens when AI interacts with humans for years: it just gets dumber and dumber.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "If they charge a subscription to use the ones customers already bought, they’d better refund customers because a lot of people will throw them in the trash!",
            "points": "3 points",
            "children": [
              {
                "comment": "I‘d doubt they would be able to pull that off in Europe if their final goal is pushing it onto existing devices. Once consumer protection offices over here catch on Amazon would have a big mess on their hands.\n\nWhy? They sold device X with functionality Y. You can’t just suddenly start charging for Y, when it’s a core functionality of X. They’d be forcing customers to subscribe if they don’t want their devices to become useless and that’s not gonna go well legally. If they actually did that, it could become a pretty costly decision for Amazon within the EU.",
                "points": "5 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I literally just bought an Echo Show for Christmas because I couldn’t find any good digital picture frames that I liked for less than the cost of getting an Echo Show and it can do more things like play music when I’m trying to get my son to sleep and control my smart lights. If they decide that now I can’t use its features without a monthly subscription when that was not mentioned on the product page, I will be harassing everybody at that company that I have to until I get a refund, I don’t care how much of an asshole I have to be.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Time to start saying no---to businesses giving something away for free right until they determine enough people are sort of dependent. Fuck that and fuck them. We are all getting charged for everything these days, and businesses routinely pass every cost along to the consumer as a price hike or fee of some kind. I'm fucking exhausted from choking on the expenses associated with my phone and television already. We pay and pay pay and own absolutely nothing. Fuck you Amazon.",
        "points": "152 points",
        "children": [
          {
            "comment": "Luckily we don’t need any of it. Dependency is a state of mind in 99 out of 100 cases. In the 1 out of 100 (deciding to give up owning a car due to use of ride share) you gotta be really sure of that decision.\n\nCertainly no one needs Alexa. Or amazon.\n\nBut, I’m all for subsidized use early on. I used Uber when it was dirt cheap. Then they made it pricier and I stopped. Netflix. Amazon. Same and same.",
            "points": "26 points",
            "children": [
              {
                "comment": "I like that public transportation isn’t a solution. Personally I miss living in a city near a bus stop, that was my chill time and I read the most books in my adult life when I rode the bus to work",
                "points": "4 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Couldn't agree more, but I object to the constant squeeze all the same.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "It is hard because you have to pay constant attention to prices which is a pita. Used to be able to just go to Airbnb and know it’s cheaper than a hotel. Then you needed to look at hotels and Airbnb. Now you can almost guarantee hotels are cheaper than a nice Airbnb.",
                    "points": "2 points",
                    "children": [
                      {
                        "comment": "The squeeze is coming from every direction now. I agree. I'm sure that's why I find it so irritating. https://www.reddit.com/r/news/s/jkxHjSTQZK",
                        "points": "1 point",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Couldn’t agree more.",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "businesses routinely pass every cost along to the consumer\n\nThat's kind of how businesses work.",
            "points": "7 points",
            "children": [
              {
                "comment": "Agreed, but I object all the same. We all have costs. Businesses should bear their own. I pay through the nose for everything, just like everyone else EXCEPT the businesses I am beholden to for basic services. The fact that businesses always get away with passing their costs along to us doesn't make it right, you know? This crap eventually ties in with broader questions relating to wealth and inequity, man. I don't wanna go there. Just saying I am fed up. I think everyone should be fed up.",
                "points": "-2 points",
                "children": [
                  {
                    "comment": "The fuck are you talking about man? Businesses are for profit. If they just swallowed the costs to make people like you happy they wouldn’t exist.\n\nYou’re not a business. You have costs because you’re not built for profit. You’re using other people’s products and services that take money to run, therefore you have to pay for them. If you open a business you’re not going to do it for free.\n\nI’m not a fan of the constant subscription models now but you’re deluded.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Learn an important lesson, nothing in this world is for free. Specially big tech, won’t do anything good for people for free.If it’s free you are the product, not the consumer.",
            "points": "2 points",
            "children": [
              {
                "comment": "Maybe that's the point, man--being treated like a product. That shouldn't be acceptable to anyone. Life is free. So is treating others with decency and respect. I have no qualms with businesses making money. That would be stupid. I have qualms about businesses using the excuse of making money as a justification for choking me out because I want a decent life. I know some people seem to think that's okay. I don't.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Alexa was always a massive privacy invasion. Same with every “digital assistant”. If you bought and use one to the point that you’re “sort of dependent”, you’re a fucking idiot and get what you deserve.\n\nEveryone who DIDN’T see this coming, hasn’t been paying attention for the last 30 fucking years.",
            "points": "-1 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "How about you make it work before acting like it's worth more money than I paid to buy the devices",
        "points": "100 points",
        "children": [
          {
            "comment": "“Alexa, Turn off the basement lights”\n\n“Multiple devices share that name. Did you mean the basement light?”\n\n🤬",
            "points": "39 points",
            "children": [
              {
                "comment": "I recently figured out how to fix that on ours. If you rename the light to have the word light in it as well, so like “basement light” instead of “basement” it seems to recognize it again. Don’t know why that stopped working when it’s always been fine previously but it is what it is I guess",
                "points": "6 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Serf, pay for our spying device. Sure we make money by selling your data, but we want your money too. No, not just from the stuff we sell: just give us your money, passively, just because.",
            "points": "36 points",
            "children": [
              {
                "comment": "This is accurate",
                "points": "7 points",
                "children": [
                  {
                    "comment": "There is no point in telling lies on the internet...\n\nUnless you are getting paid, but come on, I'm a nobody on Reddit, why would anyone pay me?",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I paid for it when i purchased it tf",
        "points": "69 points",
        "children": [
          {
            "comment": "Right? Weren’t they already paid for? Why does everything have to be a subscription these days?",
            "points": "15 points",
            "children": [
              {
                "comment": "You will own nothing and like it.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Last night I said “Alexa, play ocean sleep sounds”\n\nA command I’ve issued hundreds of times.\n\nWith volume set to 2.\n\nAnd it fucking SCREAMED a 30 second ad for buying the 10-hour ocean sounds pack.\n\nLike anyone is 3 hours into ocean sounds saying “baby, listen to this … it’s my favorite part”.\n\nIt wakes up my wife and dogs.\n\nAnd the kicker?\n\nI already bought it the last time it did this shit.\n\nTry and charge me.",
        "points": "44 points",
        "children": [
          {
            "comment": "Why the fuck did you buy it",
            "points": "13 points",
            "children": [
              {
                "comment": "He said no and she conveniently heard yes.",
                "points": "20 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I bought it like 3 years ago when it was on sale for 99 cents. I used it daily so I figured the creator should get a buck.\n\nI did not buy it again.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Jeff Bezos makes about $300 per second, and pays about 1% in taxes. Let that sink in…",
        "points": "19 points",
        "children": [
          {
            "comment": "He pays 3$ a second in taxes!?\n\n/s",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "hmmm",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "100% would hit the trash so fast they wouldn’t be able to issue a retraction or apology.",
        "points": "13 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s amazing that they thought these were going to be used as anything except radios and timers that occasionally save you from googling",
        "points": "26 points",
        "children": [
          {
            "comment": "I was able to briefly sync all of our household calendars. Before the tokens got lost and half of them stopped showing up. Eventually it became a glorified Spotify machine that tried to sell me printer ink because I guess it sniffed my network and found out the printer was low on ink. Then it went in the garbage.",
            "points": "15 points",
            "children": [
              {
                "comment": "I have 5 echo dots in a 1500sq bungalow. Mostly use them all for poor man’s surround sound. Also have the fire tv they can all control reasonably well. (Tune to any channel in a cmd, play a movie by title, volume controls). The tv and all dots are in a single group and all synch perfect on the “play everywhere” group no issues.\n\nNever had any problems aside from the occasional advertisement which I just say “Alexa Off”. Also don’t really see any targeted advertising more than usual",
                "points": "5 points",
                "children": [
                  {
                    "comment": "Reddit loves to complain about things they’ve heard others complaining about without experiencing it themselves. One complaint ends up being a worldwide phenomenon.",
                    "points": "-2 points",
                    "children": [
                      {
                        "comment": "I personally own three Echos, and it drives me up a fucking wall how often I say “Alexa, bedroom lights on” and she says “Sure thing. Also, did you know that I can…” etc etc etc and I have to tell her to shut the fuck up. It’s slowed down lately, but for a few months there it felt like it was happening every six commands or something. I guarantee you this isn’t all “reddit complaining about things they’ve never experienced.”",
                        "points": "2 points",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Mine doesn’t even register my request for timers 80% of the time. They are infuriating.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Last I checked, I paid money for the devices.",
        "points": "24 points",
        "children": [
          {
            "comment": "You also pay regularly with your data and privacy.",
            "points": "5 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "So they now want you to pay for Alexa telling you it doesn’t know, but googled some things for you?",
        "points": "10 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Nope, hell no, nah, nada. I don't use her anyway and Amazon video is about to go out the window too.",
        "points": "8 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "\"We fired 10,000 people who worked on this product last year while saying it was a colossal failure and drove no additional sales, so now we're going to charge for the service you use to set timers.\"\n\nThat should work fine.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And Apple HomePods here we come….",
        "points": "12 points",
        "children": [
          {
            "comment": "Just so expensive. Wish they had a display one as well",
            "points": "5 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "That was my first thought…\n\nBut to replace all my Echos with HomePods would cost $1,100. How many months of a stupid subscription would it be for $1,100?\n\nThat’s the math I have to keep in mind. On principle I’d love to dump them. In practice, I don’t have a bottomless bank account, but I do have a family who loves to control the house with their voice and play music from anywhere.",
            "points": "3 points",
            "children": [
              {
                "comment": "What about HomePod minis on sale",
                "points": "4 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I love my 5 Echo Dots, but would not have a second of hesitation throwing them in the trash if I had to pay for a subscription to use them. I recently canceled my Prime after 10 plus years because of ads being added to its content. Fk you Amazon!",
        "points": "15 points",
        "children": [
          {
            "comment": "Same!",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Lmfao try me.",
        "points": "6 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Fuck no",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They already shut off the alexa guard stuff and said they would re-release it with a paid service.\n\nThey turned off alexa personalities.\n\nAlexa answers have gone to complete shit.\n\nsaying \"Alexa Notifications\" works half the time. Sometimes it says there are no new notifications, except the bitch if flashing yellow. You have to try multiple times before she tells you the damn notification.\n\nI said Alexa notifications a few days ago and she started telling me the population breakdown of the US based on race/ethnic background.\n\nPackage delivery notifications were the best and now they work maybe 10% of the time.\n\n​\n\nAlexa set 5 minute timer\nWait 4 minutes.\nAlexa cancel timer\nThere are no timers set.\nAlexa cancel 5 minute timer.\nThere are no timers set.\n1 minute later timer goes off\n\n​\n\nAlexa play my favorite song -- no telling what she will play.\n\nAlexa who is this artist? -- Great that will help us play more of the good stuff! --- WTF I asked who this was, I didn't say I liked it you dumb piece of shit.\n\nThe service is gotten much worse over the past several years. They are obviously going in the wrong direction with their voice recognition and AI models. No one is going to pay for this.",
        "points": "5 points",
        "children": [
          {
            "comment": "If it makes you feel any better, Google is the same way now. I'm convinced they're making them worse on purpose. Siri is the only one (imo) that works worth a damn.",
            "points": "3 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "This was always the plan.",
        "points": "3 points",
        "children": [
          {
            "comment": "I know it. Wish I had disagreed with their tediously peeping asses from go. Oh well, better late than never, I guess.",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Yep… not gonna do that.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just moved to a new place and didn’t set them back up. Seems like the right play.",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "They should pay us for this garbage - theyre stealing enough data on us from it",
        "points": "5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "These mother fucker don’t make enough money?",
        "points": "4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Nobody I know who has experience in a serious IT job wants anything to do with IoT.",
        "points": "7 points",
        "children": [
          {
            "comment": "Why not?\n\nEverything IoT in my household is in it's own VLAN without WAN access.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "30 years in tech, and I have exactly 0 smart thingies.\n\nYet... people say I don't understand tech or are afraid of it.\n\nOh wait, I was in IT for half that. I really don't understand tech!",
            "points": "2 points",
            "children": [
              {
                "comment": "25 years in tech here. I've worked with enough outsource developers and business decision makers to know how highly QA is valued, let alone customer data security.\n\nNarrator: It isn't.",
                "points": "6 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "From the creative geniuses who brought you Prime Plus comes…Alexa Plus.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This would be the same business model every company is attempting to force now. It’s disappointing, but not surprising.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "It’s nice to just ask what the weather is but I’m not fucking paying for that garbage. I have my phone and I have google too. Alexa only works half the time and then only a quarter of that is barely worth the money I should’ve kept instead of buying it.",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I don’t use it now, for free",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Once they start charging for them they will become garbage.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Instantly in the garbage if this is the case",
        "points": "3 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I did. When I bought it.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Alexa sucks. I need an assistant, not a salesgremlin. I threw all of mine out after I found out the damn thing talked to my printer and the little narc told Alexa I was out of printer ink. It tried to sell me some. I was fucking done.",
        "points": "6 points",
        "children": [
          {
            "comment": "You do realize you explicitly gave the devices permission to share information right? Bet you don’t even remember it.",
            "points": "2 points",
            "children": [
              {
                "comment": "Nah man. I never said “Alexa, talk to my printer”.\n\nNow, that doesn’t mean I didn’t give it permission. Maybe I did. Maybe I didn’t read some legal bullshit when I attached it to my network. Maybe it told me and I’m too stupid to understand. Doesn’t matter. It did a thing I didn’t like that a little cursory user testing might have revealed people wouldn’t like or would be creeped out by, so, into the garbage it goes.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "lol. No.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I know it’s not popular opinion but I’d give a few dollars a month for all the devices on my account. Like max $5.",
        "points": "2 points",
        "children": [
          {
            "comment": "You would pay? For exactly what you are getting now for free? Just cause Jeff asks for money??\n\nThis on top of Prime raising its prices.",
            "points": "1 point",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "All my Alexa devices are in storage in favor of Google. They'd have to pay me to use Alexa again",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I read that as \"start praying to Alexa\". I just imagine me gently whispering to it \"even in death, I serve the Omnissiah.\"",
        "points": "2 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "That shit hardly works lmao…",
        "points": "2 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "The worst part about this is, because it all comes down to profit and how to maximize same, eventually Amazon is GOING to make you pay a subscription for Alexa, and THEN they're going to introduce subscription tiers, where the lower end tiers will read you a fucking ad before she obeys the command every time. Mark my words.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That is why I don't have Alexa :))) They expect me to pay for a spying microphone, on my energy, on my Internet connection? They are like AI Mafia now???",
        "points": "5 points",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Do people even use Alexa like that?",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "You pay for it already. With the data it collects on you. Plus the device you purchased. FOH you bald megalomaniac fuck",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Of course they do.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "That’s gonna be a no for me, dawg. I’ll use mine for skeet shooting before I pay them a dime for the privilege of listening to our every conversation. Let it simply exist as a convenient alternative access point to Amazon products and services.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Never allowed these trashy things in my house!\n\nBanks said we would save fees by using ATMs; then guess what, they now charge you fees!\n\nIt’s all a scam to get you hooked on their tech, then exploit you! /s",
        "points": "1 point",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Hey Alexa, get fucked.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "The things I use alexa for is easily replaced with my smartphone.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I wanted Amazon to do something to kill Alexa. Looks like I got my wish.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Lol.. That's like being fined for shaking a vending machine when you put money in and it never gives you the snack. Alexa sucks so bad it never works right anyway. Maybe they should hire developers they fired and make it actually function. AI is about to turn it into Teddy Ruxpin.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I’m a bit surprised that people seem to be having so many issues. Mine echos don’t bug me with ads. They always seem to work. My home automation works fine. It turns on the lights. Turns off the lights. Plays me music. Generally they just work fine. Occasionally on the echo Show I need to go through the settings and shut some new setting off, but otherwise they are just fine… until Amazon tries to start charging me a subscription, because then I’ll go office space on the technology and cancel Music and Prime, because that’s the cost of screwing me.",
        "points": "1 point",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "You know what, I’d pay for an Alexa that doesn’t harvest my data AT ALL. So like, a HomePod, but one that actually works.",
        "points": "1 point",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "My wife and I use it as an alarm clock...and every so often to play thunderstorm sounds when we sleep...but first telling it over and over we do not want to spend $ on 'premium' rain sounds.\n\nSo yeah, I'll have no trouble unplugging it and stuffing it in the closet if it ends up costing money.",
        "points": "1 point",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "So they charge you a subscription in order to have a surveillance device in your house. I don’t even think the most cynical of dystopian sci fi writers could of predicted this shit.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Eat my balls, Jeff.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And then the Alexa devices go in the garbage",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Amazon is going to get a shock!",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Pay for an alarm, white noise machine, and voice activated light switch. Yeah no.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Go ahead, Amazon. Keep charging us more and more for your junk. Our Alexa will go straight in the bin when this happens. It’s pretty useless as it is.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I could never trust an Alexa to bring it into the house. Maybe I'm missing out on something cool, but I'd still rather do without.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So you are gonna pay to get spied on? 😂 get fucked. Glad I don’t own one.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "And I want the CEO's asshole to grow taste buds.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "“Sparked an internal political battle because some employees don’t think people will pay”. Well, based on the responses here, they’re absolutely right. I’m certainly not going to. I was happy without it. My wife’s best friend got it so she decided it would be good. The only thing that’s really beneficial is she can tell it to add items to the grocery list. That’s about it. We use it to play music on Sonos, but that’s just being lazy.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Wait Amazon wants to take more of your money for no damn reason. I can’t believe it ! /s",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I never had a kidnapping calling ever in my life, but as soon as I got an Alexa someone used my family voices and made AI VOICE ALIKES to extort money. Listen Alexa is compromised and used by scammers. I would stay away from that",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Bye Amazon, it was good while it lasted. Services offered have been getting worse while having to pay more.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I have 16 Echo units throughout my house. Indeed, if they start charging they will go in the garbage.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "LOL. I wouldn’t use an Alexa if they gave them away for free. Good way to kill a product.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Pay for your wire tap guys",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "matter of time until we have to pay monthly to use the brakes on our bicycles / cars.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I use Alexa as a speaker and as a radio and timer. Honestly it was a Christmas gift years ago, idc I’ll throw it out before i have to pay for it",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I only have these Echo dots to control smart light bulbs in our apartment. If they want money to use Alexa, I'll toss them in the trash and switch to using the app instead.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Even the apps that help you find and cancel your subscriptions charge a monthly subscription lol",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Won't pay for it. It barely works. The only thing it's really good at is as a bluetooth speaker. It can't answer questions, it regularly screws up turning on and off the lights. No thanks for a mediocre product.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All the people bitching how they already bought the device and they’ll throw it in the bin… read the article dumb fucks. It’s an extra service. They’re not taking away what you already paid for. But feel free to throw your money in the bin.",
        "points": "1 point",
        "children": [
          {
            "comment": "",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I never wanted or needed Alexa.",
        "points": "3 points",
        "children": [
          {
            "comment": "Wish I had been more thoughtful about it. Kudos to you!",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "No one is going to pay to get spied on\n\nsent from an iPhone",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Oh no a product I actively avoided buying & refused to use when it was shoved into products I already bought is about to get locked behind a paywall making it unusable if I don’t use it? Whatever will I do.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is exactly why i use Home Assistant with offline (and FREE) voice capabilities.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Welp switching to Google then",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Aren’t Alexa’s spying on you and selling your data? They should be paying me.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "lol",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Never had it. Why would I pay for it?",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  },
  {
    "id": "t3_19a396u",
    "subreddit": "r/technews",
    "dataType": "link",
    "dataUrl": "https://www.bloomberg.com/news/articles/2024-01-18/youtube-and-spotify-join-netflix-in-not-launching-apple-vision-pro-apps",
    "title": "YouTube and Spotify Won’t Launch Apple Vision Pro Apps, Joining Netflix",
    "points": null,
    "comments": [
      {
        "comment": "This is just a matter of time and money. The companies will wait and see, and determine the cost benefit of working to make a compatible standalone version. If they believe it is in their best interest, then down the road they will.\n\nIt’s the early-adopter problem, and Apple will have known this. If you get in early you are limited by less overall adoption for surrounding services, but if enough people don’t get in early the tech will fizzle out.\n\nApple isn’t dumb, and they are betting a good percentage of their future on this. They will have run these calculations.\n\nIn the end, if Apple is right, these companies will bend the knee and create standalone apps, just like they did for every other Apple device.\n\nIf Apple is wrong, they will have to use their end of the software to make it easier for users to get to these services without having to do more than one or two clicks, or blinks, or however these work. It wouldn’t be a mountain of a task to essentially have a built in screen button that just opens the specific pages.",
        "points": "73 points",
        "children": [
          {
            "comment": "In general I agree, but Apple has made it pretty seamless to take an existing iOS app and migrate it with minimal overhead.\n\nSpotify I can understand just from a pure high nose point of view.\n\nYouTube on the other hand is weird. Either google is making their own headset and want to keep their primary entertainment source on their own device (within the best possible experience) or they just are sitting and waiting as you say.\n\nEdit: typos",
            "points": "20 points",
            "children": [
              {
                "comment": "iOS doesn’t have an existing YouTube VR application like Oculus / SteamVR do. They only have a 2d YouTube app, and putting that up on a VR / AR headset poisons the native YouTube VR experience concept for users. YouTube in VR with 360 videos is a next level experience that really shows off why VR is cool / interesting.\n\nUsers that want a 2d YouTube can just use safari for now and get almost the same experience.",
                "points": "2 points",
                "children": [
                  {
                    "comment": "Vision as a platform is not virtual reality. It’s spatial computing. I can see, to you point, YouTube getting caught in that difference; but for anyone who distributes an experience be it multimedia, games, or otherwise, they should be striving for the best experience possible given their resources of course. Even if it’s on someone else’s platform!",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Probably some other bean counter ran the numbers and think it devalues their YouTube premium subscriptions or something.\n\nIf the screen is in your vision, people wouldn’t need to pay for “play while locked” services. Maybe.",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "You hit the nail on the head regarding Google and an upcoming Mixed Reality Headset:\n\nhttps://www.theverge.com/2023/11/8/23952833/the-samsung-qualcomm-google-mixed-reality-headset-might-be-at-least-a-year-away",
                "points": "",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "It’s really funny that, even as technology becomes more mind boggling, the problems remain the same",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "The Quest is good for 99% of users. I am excited to try this out when I get mine, but the Quest is phenomenal and at a crazy low price point.\n\nBut I’m just not convinced this will be a great tool beyond gaming, and Apple and Gaming have rarely gotten along.",
            "points": "-5 points",
            "children": [
              {
                "comment": "The potential for Apple’s headset is much greater for business purposes than it has ever been with any other smart glasses or VR headset technology. Im pretty hyped for this product, and would be cool to see it adapted to the daily lives. Participating in a meeting would be way more engaging than through a laptop screen. But of course the steep price is another reason why it will take a while to be adapted to people’s daily lives. It is a step in the right direction tho.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The YouTube app for iOS doesn’t even work, can’t wait to see someone try to use it on this and get those small scrambled pixels rather than a crisp video.",
            "points": "-2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Apple is dumb, once your company gets big enough and silo-ed enough to have lots of rich and powerful executives all playing politics--then you get this sort of behavior. Nobody will call out giant red flags.\n\nLook how long and hard that moron Steve fought against an app store, and now it's literally one of their largest profit centers. It's bc nobody would tell dear leader he was wrong. It's a punative culture that punishes dissent and rewards, yes people.\n\nWhy the fuck would anyone drop thousands on this without media streaming apps? It may not kill it by itself, but it will be a large factor.",
            "points": "-2 points",
            "children": [
              {
                "comment": "",
                "points": "",
                "children": [
                  {
                    "comment": "https://appleinsider.com/articles/18/07/10/the-revolution-steve-jobs-resisted-apples-app-store-marks-10-years-of-third-party-innovation\n\nFound a source for you.",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": true
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Netflix doesn’t even have a good Quest app. It hasn’t been updated in years, runs at piss poor resolution, and from what I’ve heard it was a Meta employee that designed it, Netflix didn’t even bother. I’m not surprised they can’t be assed to make a Visio Pro app either.",
        "points": "10 points",
        "children": [
          {
            "comment": "Their apple tv app is buggy. It’s basically unusable. It’s a non threat.\n\n“Oh, so you’re NOT gonna make a barely usable streaming app? OH NO!”",
            "points": "1 point",
            "children": [
              {
                "comment": "Apple TV app on my Samsung TV is miles ahead Netflix, HBo and Prime - no lags, no connection and buffering problems. Flawless experience tbh.\n\nThe worst app is for sure HBOs - even with wired connection for me it can have problems with streaming content",
                "points": "2 points",
                "children": [
                  {
                    "comment": "That’s funny because the Max app they replace the hbomax app with works way better than netflix",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Same with the Spotify app on Apple TV. Total shit. It’s like they assumed all their users listen to 5 playlists and 20 albums on repeat forever.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "spotify used to be awesome for this kinda shit, but decided to ditch their support for open source and force everyone to use their shitty official apps",
            "points": "-2 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "I get YouTube but why do I need to “see” my music?\n\nAnd with Apple Music being the biggest threat to Spotify…why would spot help the fruit?\n\nThey’d rather see the apple go bad, I’m sure. What a rotten shame.",
        "points": "34 points",
        "children": [
          {
            "comment": "You ever see the visualizations in Winamp or WMP?\n\nI'd be up for that when listening to music if I had a VR device.",
            "points": "33 points",
            "children": [
              {
                "comment": "I do like the idea of my own personal \"planetarium,\" with my favorite jams, but I'd doubt it'd be like that",
                "points": "8 points",
                "children": [
                  {
                    "comment": "It could be though. If someone develops it.",
                    "points": "3 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "There’s already stuff like this for movies",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Beatsaber is kinda like that. The modded songs that you can sideload in the app are crazy cool.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Have PCVR. Can confirm. Many a night spent on a different realm to VR music visualizers",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "I miss Winamp.",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Yessss",
                "points": "2 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Winamp? Ok boomer /s",
                "points": "0 points",
                "children": [
                  {
                    "comment": "It really whips the Llama's ass, still.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "I thought it was \"lobbas ass\"?",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "yeah, i would happily disassociate like a mfer with some shoegaze and trippy visuals",
                "points": "1 point",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Wouldn’t it be just to run it in the background while you do stuff?",
            "points": "2 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Spotify is like the little baby dwarf bringing their toy axe when anything is against Apple.\n\nYou sure are showing them, champ.",
            "points": "9 points",
            "children": [
              {
                "comment": "Apple should remove spotify from the App Store. There goes 50% of their revenue.",
                "points": "4 points",
                "children": [
                  {
                    "comment": "Bam instant monopoly charges lol",
                    "points": "6 points",
                    "children": [],
                    "isDeleted": false
                  },
                  {
                    "comment": "Spotify pays millions for their toxic podcast content, and peanuts to recording artists. I don’t like that business model, but I understand it. Why getting worse publicity?",
                    "points": "2 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "Apple Music is trash compared to Spotify thought. YouTube Music is better than Apple Music. QQ Music is better than Apple Music. AM Radio is better than Apple Music.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "I get YouTube but why do I need to “see” my music?\n\nLyrics? Videos? Same reasons you need to see it on your phone, computer, or tv.",
            "points": "16 points",
            "children": [
              {
                "comment": "Live immersive music events - I could go on for days but I don’t want to think about another half baked Apple product.",
                "points": "9 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "None of which I do.",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "It wasn’t made for you specifically. Why would you be strapping that thing on your head to listen to music in the first place?",
                    "points": "0 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "The thing is battery powered. You want a streamlined app compiled just for this hardware.  \n\nYou want to be able to control your music, make playlists and search.  I doubt you’ll be as productive trying to use Spotify web version vs “vision” optimized user interface.  Not suggesting you want to work on Spotify, but you don’t want to feel like you’re working to select a song.  \n\nSo yeah, a native app makes sense.",
            "points": "1 point",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Why help the fruit? If they thought the hardware would be popular and would result in everyone using Apple Music, they would make an app…. But they clearly don’t think that.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Even if there’s no visual component, people enjoy listening to music while working on other things",
            "points": "0 points",
            "children": [
              {
                "comment": "I use speakers or headphones. I can’t imagine wanting a headset to do that.",
                "points": "-2 points",
                "children": [
                  {
                    "comment": "But you work on other things using the headset? That's the whole point?",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Spotify is better. Take market share",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You ever done shrooms before?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "Are you too young to remember MTV?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "You want a Spotify app for the same reason you want a Spotify app on your phone, watch, or laptop. So you can control the app and view video content, etc. isn’t that obvious?",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "“See” your music? Envision a virtual recording studio. Any instrument and synthesizer you want.",
            "points": "",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Paywalled trash",
        "points": "17 points",
        "children": [
          {
            "comment": "Oh no whatever shall we do?",
            "points": "-21 points",
            "children": [
              {
                "comment": "YouTube and Spotify Won’t Launch Apple Vision Pro Apps, Joining Netflix Users of those services will be steered toward the web Searches indicate apps from Meta may also be unavailable\n\nBy Mark Gurman and Ashley Carman January 18, 2024 at 2:02 PM PST Apple has touted its $3,499 Vision Pro headset as an entertainment device.Photographer: Philip Pacheco/Bloomberg Google’s YouTube and Spotify Technology SA, the world’s most popular video and music services, are joining Netflix Inc. in steering clear of Apple Inc.’s upcoming mixed-reality headset.\n\nYouTube said in a statement Thursday that it isn’t planning to launch a new app for the Apple Vision Pro, nor will it allow its longstanding iPad application to work on the device. YouTube, like Netflix, is recommending that customers use a web browser if they want to see its content: “YouTube users will be able to use YouTube in Safari on the Vision Pro at launch.”🚀\n\nBreaking News. Companies specializing in 2d apps with limited VR content, choose not to waste resources making Apple even more money.",
                "points": "6 points",
                "children": [
                  {
                    "comment": "Paying for 4 paragraphs of something that could be said in 1 sentence. The golden age of information is over.",
                    "points": "17 points",
                    "children": [
                      {
                        "comment": "Well, if people paid for journalism, it would be better. This is a chicken and egg problem.",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  },
                  {
                    "comment": "What’s funny is that Youtube does have a VR app on the Meta Quest. Netflix does too, although they haven’t updated theirs in ages.\n\nThe Quest and the Vision are both ARM based systems, so it wouldn’t require too much work to port from one platform to the other.\n\nThe only reason they are not spending time doing it is because they couldn’t care less for Apple, and how niche the Vision will probably be.",
                    "points": "-2 points",
                    "children": [
                      {
                        "comment": "Or their ceos who are doing their best to compete, by talking trash, trying to make Apple look bad and lose sales. Chances are they’re invested in a competitor device, and have something to gain.",
                        "points": "-1 points",
                        "children": [
                          {
                            "comment": "Well, they are working on a VR device with Samsung.",
                            "points": "0 points",
                            "children": [
                              {
                                "comment": "Ugh huh. 🤔\n\nI can’t imagine why they’re not excited to relaunch their app on their biggest competitors devices???",
                                "points": "1 point",
                                "children": [
                                  {
                                    "comment": "Just to be clear, my original comment isn’t disagreeing with you, it is adding context.\n\nGoogle is clearly fine with maintaining an app on Meta’s platform, so they’ll probably add one if Apple’s platform gets popular enough, if only begrudgingly.",
                                    "points": "2 points",
                                    "children": [
                                      {
                                        "comment": "I gotchu",
                                        "points": "0 points",
                                        "children": [],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      },
                      {
                        "comment": "it’s not vr…",
                        "points": "0 points",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "It’s $3500. Not exactly gonna be adopted by millions when people can get into VR for $300-$500.",
        "points": "4 points",
        "children": [
          {
            "comment": "Yea but it's Apple, sooo applely.",
            "points": "-6 points",
            "children": [],
            "isDeleted": false
          },
          {
            "comment": "VR is not spatial computing.\n\nyou’re comparing a pc with a game console.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Why does anyone link to bloomberg us when the Canadian version doesn't have that stupid paywall?\n\nhttps://www.bnnbloomberg.ca/youtube-and-spotify-won-t-launch-apple-vision-pro-apps-joining-netflix-1.2023857",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "When the iPhone came out it was not expensive because it was $600 with a contract and just a couple of years earlier the Motorola Razr was also same price range which is why the iPhone took off like crazy.\n\nApple Vision Pro is a new product that costs $3,500 in this economy where so many white collar workers with nice salaries got laid off and had a hard time finding a job.",
        "points": "11 points",
        "children": [
          {
            "comment": "Unemployment is 4%. I agree that the price is too high for the average person, but layoffs aren’t the thing that’s going to impact these sales.",
            "points": "18 points",
            "children": [
              {
                "comment": "As a stockholder in this fruit company, I would love everybody to own one of these.\n\nThis is a post from LinkedIn\n\n\"Fellow Recruiters - Please don't give up. I posted a remote Recruiter role that had 800 applicants in less than 24 hours. There were so many qualified folks that I had to reject since there is only one opening. However, the signs of life are coming and roles are steadily opening - stay strong - the tides are a changing. \"\n\nhttps://www.linkedin.com/feed/update/urn:li:activity:7153419839586373634/\n\nAs for jobs you are talking about here is a video that breaks down the numbers for you\n\nhttps://twitter.com/heresyfinancial/status/1745905545230573595",
                "points": "-4 points",
                "children": [
                  {
                    "comment": "I agree that a lot of people are looking for jobs and there aren’t a ton of openings, but you’re discounting how large the US economy is. The layoffs being announced are 500 people here, 1000 people there. It was worse last year when tech companies were laying off hundreds of thousands, but the AVERAGE month over the last 30 years is more than 600,000 people losing their jobs or quitting. Any ‘job growth’ is above and beyond that normal churn. A few dozen tech companies laying off thousands of people is a drop in the bucket for an economy with more than 160 million workers.",
                    "points": "6 points",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              },
              {
                "comment": "The unemployment rate is becoming irrelevant. It was an incredibly important factor decades ago because people generally received livable wages.\n\nThis explains why the government is as focused in providing this rate as it in hiding behind it.",
                "points": "0 points",
                "children": [
                  {
                    "comment": "Okay but the data shows that real median wages have increased 1.7% from 2019-2023 (Treasury Data)\n\nLow wage workers in the bottom 10th percentile saw real wages increase more than 9% since 2019 (Low Income Wage Growth)\n\nWe have historically low unemployment at a time when wages are outpacing inflation and income inequality is seeing a downtrend. The data doesn’t back up your perspective.",
                    "points": "0 points",
                    "children": [
                      {
                        "comment": "It is widely known that the CPI as used today to calculate inflation is a heavily manipulated metric that only serves the purpose of allowing the government to report on lower inflation than the one perceived by consumers. This is not anecdotal, many economists agree that CPI should go back to its original form of calculation for a fairer representation.\n\nEither way, although low wage workers did see a real wage increase, it still doesn't mean it is a livable wage, which was the focus of my original comment.\n\nI don't know how any of the data points you used disapproves what I said.",
                        "points": "",
                        "children": [],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "Was it $600 with contract? I thought it was $200 with contract, $600 without",
            "points": "4 points",
            "children": [
              {
                "comment": "Later yes. When the first one launched it launched at $600 with contract",
                "points": "1 point",
                "children": [
                  {
                    "comment": "Ifrc one year later the slashed the price to $200. Either way it’s not really a relevant comparison because the current iPhone is over 1k now. Also I’d argue that it took until the iPhone 4 before it really took off.",
                    "points": "1 point",
                    "children": [],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Just remove Google as the default search engine.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just use the web browser",
        "points": "3 points",
        "children": [
          {
            "comment": "Yes, pay $3500 to use a VR web browser",
            "points": "7 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "As far as VR tech is concerned it looks pretty amazing. But I don’t see it gaining ground at the price point, limited users equate to limited software.",
        "points": "2 points",
        "children": [
          {
            "comment": "it’s not vr….",
            "points": "-1 points",
            "children": [
              {
                "comment": "It is VR/AR",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "show me where apple says it’s VR. i will wait",
                    "points": "-2 points",
                    "children": [
                      {
                        "comment": "Go ahead and look up the definition for Spatial Computing… here, Ill do it for you.",
                        "points": "-1 points",
                        "children": [
                          {
                            "comment": "that’s not apple calling their headset vr though, is it?\n\ngive me what i asked for or piss off",
                            "points": "-1 points",
                            "children": [
                              {
                                "comment": "BuT aPpLe dOeSnT cAlL iT Vr! I cAn OnLY cAlL iT wHaT iT is AdVErTiSeD tO mE aS!",
                                "points": "0 points",
                                "children": [
                                  {
                                    "comment": "Your narrative is totally made up and you’re upset by it",
                                    "points": "-2 points",
                                    "children": [
                                      {
                                        "comment": "“Yes, visionOS may be used to power not-VR apps in the future, and I get why Apple may want to distance itself from terms like VR or MR. But the Vision Pro device that comes out on February 2nd is a VR headset, even if Apple won't admit it.” - The Verge.\n\n“Strictly using the definitions of AR and VR that we've relied on in the past, the Apple Vision Pro is unquestionably a VR headset. It's an opaque (to the wearer) heads-up display that completely covers and takes over the user's vision.” - PC Mag\n\n“AR/VR modes selected with a Digital Crown” - Apple Insider",
                                        "points": "1 point",
                                        "children": [
                                          {
                                            "comment": "A tabloid with the name Apple in it is not Apple. Good try. Might work on your friends but no internet stragners",
                                            "points": "0 points",
                                            "children": [
                                              {
                                                "comment": "",
                                                "points": "",
                                                "children": [],
                                                "isDeleted": false
                                              }
                                            ],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              },
                              {
                                "comment": "because we may only refer to merchandise exactly as our overlords at Appletm do, right? no need for trivial silly things such as definitions and synonyms",
                                "points": "-1 points",
                                "children": [
                                  {
                                    "comment": "spatial computing has existed. it’s not some invented buzzword.\n\nand yes, vr is possible on this platform but lumping it in with “it’s just vr” is disingenuous.",
                                    "points": "0 points",
                                    "children": [
                                      {
                                        "comment": "it’s just vr",
                                        "points": "-1 points",
                                        "children": [
                                          {
                                            "comment": "it’s capable of vr, yes.",
                                            "points": "0 points",
                                            "children": [],
                                            "isDeleted": false
                                          }
                                        ],
                                        "isDeleted": false
                                      }
                                    ],
                                    "isDeleted": false
                                  }
                                ],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": false
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": false
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Who would bother to develop for a competitor’s product that’s got no user base. They inevitable will of course.\n\nI assume it will have a web browser so that will be a stop gap. Apple Music is good and Apple TV has plenty of beautiful content, they will be watching user counts very closely. Imagine if it did in fact take off but Spotify was a hassle so Apple Music starts to steal users….\n\nComparisons to quest 3 are pointless. This has a significantly better processor, resolution and has micro led…. And a ridiculous price tag.\n\nThis is not the same class of product. Though given the App Store ecosystem and Apples recentish push for the Apple Arcade I think they might be placed to make a dent in the market there is for on device VR gaming eventually.\n\nI still don’t know about VR gaming, even this is going to have fov and comfort issues.\n\nBut this will likely shred as a business device, I reckon this will be a faster success than people expect.",
        "points": "2 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This is why vertical integration of an industry is bad; would-be partners become rivals.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "All 4 people using it probably won't mind.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I love it. Let one of the little guys eat your lunch. Then complain about how they did it. Good plan.",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Vision Pro has Safari… so you can just open safari and go to their websites…\n\nHonestly I always thought there are too many apps… if I can use my browser to do anything, I would…",
        "points": "1 point",
        "children": [
          {
            "comment": "I think Safari only allows one running tab at a time.\n\nSo if you have Netflix website open you can’t search Google while having Netflix playing concurrently.",
            "points": "-3 points",
            "children": [
              {
                "comment": "Can you install a second browser?",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Oh no. Anyway",
        "points": "1 point",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Apple doesn’t need them anyway. Anyone already buying it was not thinking oh wait what about Spotify? Apple will just push their products and further monopolize their headset",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "This device is a bit of a stumble for Apple.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Are they offering any good reason at all to buy this thing?",
        "points": "-3 points",
        "children": [
          {
            "comment": "Did you even watch the keynote? No one is paying $3500 to watch YouTube videos on this. It serves a different audience and purpose completely.",
            "points": "11 points",
            "children": [
              {
                "comment": "True, cause there is no YouTube app for it. So watching movies and TV is why I’m buying it.",
                "points": "-1 points",
                "children": [],
                "isDeleted": false
              },
              {
                "comment": "Which are?",
                "points": "-1 points",
                "children": [
                  {
                    "comment": "",
                    "points": "",
                    "children": [
                      {
                        "comment": "Ah so now I can watch movies and conference call people in VR - sorry, VisionOS. Wow so incredible",
                        "points": "",
                        "children": [
                          {
                            "comment": "",
                            "points": "",
                            "children": [
                              {
                                "comment": "An angry one at that",
                                "points": "",
                                "children": [],
                                "isDeleted": false
                              }
                            ],
                            "isDeleted": true
                          }
                        ],
                        "isDeleted": false
                      }
                    ],
                    "isDeleted": true
                  }
                ],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          },
          {
            "comment": "porn?",
            "points": "4 points",
            "children": [
              {
                "comment": "Porn.",
                "points": "3 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "For now lol",
        "points": "-1 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Meh. Who cares? Spotify is garbage, and so is YouTube. Not sure I’m buying one, but if I did I sure wouldn’t be using it to listen to music, or even watch videos.",
        "points": "-1 points",
        "children": [
          {
            "comment": "Some people just get off on calling things garbage. Spotify and YouTube, two of the most successful tech product ever…? Garbage.\n\nWhat are you using, Tidal and DailyMotion?",
            "points": "1 point",
            "children": [
              {
                "comment": "I use AZ music and Apple Music. YouTube is complete garbage. All the ads and routing you to shit content? I don’t understand the appeal. Spotify is garbage. Their interface is terrible. Just because something is “popular” doesn’t mean it’s good. I don’t really watch videos.",
                "points": "0 points",
                "children": [],
                "isDeleted": false
              }
            ],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "Garbage looking piece of shit anyway. Innovation coming out of Apple probably makes Woz feel sick to his stomach.",
        "points": "-7 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Don’t make the app and find out that your existing app is banned from every iPhone the next morning\n\nThere fixed",
        "points": "-4 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Probably because the VR apps are shit on the other platforms.",
        "points": "-5 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "A lot of streaming companies already don’t allow hdmi out from phones. So probably going to be a big hurdle.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If this (or the next cheaper consumer iteration) takes off then Disney+, MAX, Paramount+ etc need to add 3D versions for movies that have them. What is the point of watching 2D movie on a headset capable of 3D?\n\nI know some 3D conversions have been crap but a lot have been really good.",
        "points": "0 points",
        "children": [
          {
            "comment": "Watching a 2d movie in VR is awesome. Its like watching in a theatre screen.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "we went from building computers for $3k to now buying headsets for $3k",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "If there’s a market they will come. AppleTV was barren for a long time, now it has all the major providers (even if half the apps are terrible.)",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Time.\n\nThere's not been enough time with the devices to ensure the app is as good as it can be. They don't just want to get it working. They want it to be good.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "For now.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Is that Dave 2D in the thumbnail",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "lol they're not doing it today but they'll come around obviously",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Spotify I understand, because Apple Music is there to take its place. YouTube seems like a body blow, but given Apple’s rivalry with Google, the story checks out.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I wont be surprised if MS puts the entire office suite on it day one",
        "points": "0 points",
        "children": [
          {
            "comment": "What are you doing in there on your headset son? Oh just doing some spreadsheets.",
            "points": "0 points",
            "children": [],
            "isDeleted": false
          }
        ],
        "isDeleted": false
      },
      {
        "comment": "They will.\n\nJust not yet because I doubt it makes financial sense to sink a load of development time into something that feels like a live beta product.\n\nThere seems to be a lot of testing the waters here.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "So from the demos though I just open safari on, log in and chill? Like native app would be nice but browser still works",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "My guess is that the price point for this model is too high to justify creating an app for what will likely be a minority of the VR users. On the other hand Netflix already has an app for the Meta Quest so it shouldn’t be too hard to port especially since Apple has the tools to port the app from iPad it sounds like there is something else going on.",
        "points": "0 points",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "I wouldn’t use a youtube app anyways unless I can get an Adblocker. Plus cant you just mirror you mac with said app",
        "points": "",
        "children": [],
        "isDeleted": false
      },
      {
        "comment": "Just opens up a market that was fairly locked out. Recall MS did this in 90s and it didn’t work for them either.",
        "points": "",
        "children": [],
        "isDeleted": false
      }
    ]
  }
]