[{"text":["Nvidia 551.23 flickering/sharpness issue","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Is this a malware or something like that?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Windows 11 freeze","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Clicked on Phishing Link How bad is it?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Most likely they have no information as the error about filling all fields was almost certainly client side(ie. in your browser, stops it before it sends anything) but there is a chance that the data you have entered was given if they had some kind of server side check which had already received data(unlikely if the site is built like 99% of websites on the web)You won't have malware from it, these are designed to get information for fraud, not to infect your pc"],"points":0},{"text":["No post on new pc","Got pics so we can check if you've missed something?","Bios update?"],"points":0},{"text":["Help needed! Temporary files storage constantly increasing but can find out why","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","I think windows counts the hiberfil.sys & pagefile.sys also as temporary files. Both are hidden files stored directly in C: . On my system both are together over 30Gb. Maybe check their size.in hiberfil.sys windows stores temp data to make waking up from sleep/hybernation state faster and in pagefile.sys windows stores your virtual memory, if your dedicated memory fills up and so on."],"points":0},{"text":["Having trouble installing psychopy with pip install."],"points":0},{"text":["Can I prevent others on the same wifi network from printing from my printer?","It would depend what security settings your printer has, it would be worth checking the manual or their website to see if you can enable a pincode or limit which devices have access","If your router is capable you could create an VLAN for your devices and an VLAN for guests. Your router might an have an guest network it can output which sometimes has the option to do exactly what an VLAN would do"],"points":0},{"text":["I proceeded \"your connection is not private\"","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","You're fine, if your operating system is 11 years old though, I'd definitely upgrade, lots of badware out there for windows 8"],"points":0},{"text":["Phone speaker volume lowering automatically?"],"points":0},{"text":["Can i play some games with these ?","No, I mean there will be something that runs on it but that's 2nd gen mobile i7 and that ram will be ddr3 at best, the quadro isn't designed for gaming either"],"points":0},{"text":["Did I fuck up my laptop hardware?","Can you check cpu and gpu temperatures?"],"points":0},{"text":["Dell XPS 17 9720 not turning on."],"points":0},{"text":["What other apps besides Whatsapp require a full factory reset of Android to transfer data from iPhone to Android?"],"points":0},{"text":["My internet works but the icon shows as no internet"],"points":0},{"text":["Graphical issues and lag despite new driver install with DDU","Sounds like your GPU is faulty,"],"points":0},{"text":["My computer has become extremely sluggish and unusable and irresponsive","To exclude software problems, make clean windows install, with deleting system partition. Since you have mentioned laptop being dropped, check cpu/gpu temperatures."],"points":0},{"text":["Is my gpu dying?","It looks like gpu problem, but you should first exclude potential software causes - and the best way is clean windows install, with deleting existing system partition (or just install on another drive, for test). and after that it could be problem with motherboard (try changing gpu slot, if your mb has more than one)."],"points":0},{"text":["Girlfriend's monitors not displaying any output from her PC, simply black screen.","So, an update. I'm not sure how to post photos in a comment, I don't post much on reddit in general, BUT. It turns out the issue was that, somehow, both of her HDMI cords ended up FUBAR at the same time. Thank you to those who viewed or may have been typing an issue up."],"points":0},{"text":["how make work","If you want to run cable there are some discreet alternatives to baseboards .Sewer vent pipes, chimneys and all run between floors. There is sufficient gap around them to fish cable between floors without too much trouble.Often, chimneys and vent stacks are behind closet walls.A small hole in the back of my closet near the sewer vent allowed me run Ethernet from my basement router to a bedroom.Coax from security cameras and attic antenna run down to the basement next to the chimney.Coax for the living room TV comes up from the basement next to a cold air return behind the TV stand."],"points":0},{"text":["Macbook constantly dropping WiFi"],"points":0},{"text":["Am i clean of viruses?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Your never clean untill youve done a deep wipe virus are extremely sneaky they can make it so you think you got rid but inreality its running when task manager is closed"],"points":0},{"text":["Asus TUF a15 fan noise","Update: i tried plugging the old fan and it has the same problem, im going to check the bios"],"points":0},{"text":["Please help! I got BSOD and now my computer won't even go passed the initial load screen and I'm so this is the end of a comp barely a year old!","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","It's a bit of a mess that needs clearing.First, your motherboard definitely supports Windows 11. It requires 2 things set in bios for that: UEFI boot (not csm/legacy), and enabled TPM (here is Asus video with instructions). Another way is to update bios to the latest version, that will automatically set all required bios setting.Second, something could be wrong with your windows 10 installation, do it again, using Microsoft media creation tool and different usb drive.When installing windows, connect only one drive, keep it that way until windows is completely installed, and then power off computer and connect all other ones.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":1},{"text":["LG laptop not turning on for few days then works fine"],"points":0},{"text":["RTX 4090 Pin help"],"points":0},{"text":["Luxul access point setup?!?","PoE will supply power to the access point via the Ethernet cable. That's the point of the poe injector. Once the device is powered just follow the manual to add the AP to your network and it will function like a mesh system with the main router. Since you bought the AP used, make sure you factory reset it just in case the seller didn't, before you try to set it up"],"points":0},{"text":["I can't activate my windows 11 even tho it's legit.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","So did you buy this license retail? Entered the key from the sticker?","You aren’t allowed to just take someone else’s license for software and use it for yourself. That’s not how that works. That’s called theft. You didn’t pay for the software, it belongs to your school. You need to buy your own license.Your school also uses an activation server that is going to register the key with that specific hardware and its ids. This wouldn’t have worked anyways even if you had access to the raw key values."],"points":0},{"text":["GPU of my Laptop not working(Errorcode 43)","Looks like hardware, and only way to discard software as a cause is clean windows install, with deleting system partition."],"points":0},{"text":["What is this mysterious file that keeps getting flagged by Windows Defender but doesnt exist nor get removed?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","When trying to remove a virus or malware. The quickest, easiest, and most effective way is to just do a fresh install of the OS. It also offers the peace of mind that it's gone. As well as anything else that never got flagged."],"points":0},{"text":["Manual file transfering after OS migration.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Windows doesn't really have a clean separation of what files are Windows and what files are everything else, if you want a clean install, do a clean install."],"points":0},{"text":["Wifi/ Network Connection button disappeared?"],"points":0},{"text":["Installing nvidia driver causes black screen and boot loop","Edit. Should note that laptop is running Windows 10."],"points":0},{"text":["Radeon Relive recording at very poor fps"],"points":0},{"text":["Computer Screen is black after logging in (Windows 11)","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Changing UK broadband provider and want to keep phone line - is it possible?","It can be done absolutely, whatever you've read from Ofcom may be a misunderstanding, Ofcom get really bitchy when a phone company screws a persons number over.In regards to the technicalities, as it's within the same provider, they shouldn't need to do much more than allocte a new billing account and assign the active connection to that, there should be zero need to do an actual line takeover as the active line is still used by you and provided by them. Even if they did do a proper line takeover(again.. on their own line...) they have the ability to easily retain the number at takeover when submitting the request. This can be done by all providers.If for some reason someone screws up(changed numbers are almost always someone untrained and unaware placing the order trying to rush a number of ticket closes in a day because call center targets suck), they can very easily change the number on the line back to you.There are some circumstances where if the original number belongs to another provider and they lose it it'll go back to the original company who owned it and not be in their pool to allocate, should this happen they can reach out to the provider owning the number and request as a gesture of goodwill could they let them keep use of it(this happens and is a very painless process)Just call the call center and explain what you need, and that you need to retain the number, they'll sort it, and if any issues come up, it's easily fixed, if the call center people told you Ofcom says you can't do that, escalate to their manager until you get someone who's trained and not just wasting their life away, it can absolutely be done and is a very normal processSource: Used to write training on number porting processes for a large ISP in the UK."],"points":0},{"text":["Need advice on what to do with my drives","Your drives are failing. Backup data and warranty them"],"points":0},{"text":["How to fix Windows 10 Reversion Crash Loop?","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Try resetting using a flash drive"],"points":0},{"text":["Can I just use a anti static wrist strap instead of disconnecting the battery?","Anti static strap won't help you if you short motherboard, and since modern os often use fast boot, laptop is not fully shut down, current is present on some parts. It's much safer to disconnect battery. Try searching for disassembly video for your exact laptop model, there are several ways how battery is connected and how it should be removed."],"points":0},{"text":["How do I do a system partition migrate and not a full disk migrate.","Really can’t move it on the fly to another drive I believe. You have to have your second disk installed, formatted and partitioned. You then have to install windows on that disk using either system recovery or some other installation media and set your BIOS to boot from that disk as top priority. Then all your documents and stuff will be retained and accessible on your original disk.","Try Macrium Reflect. You can make a backup to another drive. Which is straight up bootable."],"points":0},{"text":["Weird plastic tabs on back of GPU","That's a plastic to prevent scratching the surface of the graphics card back panel. It's supposed to be peeled off before installing the card. They won't do anything performance wise, so it's safe to leave them there if you're not comfortable taking the card out."],"points":0},{"text":["Is my CPU or RAM dying?","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","It's not error that can be pinned precisely on one component. It could be ram sticks, or memory controller (which is on CPU), or motherboard problem - slots or traces, or bad overclock (XMP).First disable ram overclock in bios and test again. After that, if you have more than one ram stick, try with only one."],"points":0},{"text":["Microsoft Visual C++ error screen popping up, although I've never used it","It is caused by an Adobe app. Uninstall adobe and reinstall"],"points":0},{"text":["Hello, I am thinking of buying a laptop with an i3 n305 processor, I would like to know what your opinion is about it?"],"points":0},{"text":["Factory reset vs virus","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Weird PC behaviour"],"points":0},{"text":["laptop help?","Can you provide more information?"],"points":0},{"text":["The Finals (game) causes all other applications to change my display resolution"],"points":0},{"text":["System Process High CPU - ntoskrnl.exe|KeInitializeApc","Use Malwarebytes program to scan and remove any malwares and malicious programs from your computer."],"points":0},{"text":["EZ Debug LED CPU, can anyone help me with this?","CPU or motherboard is dead. Try reseating DRAM. Boot without DRAM to see if the behavior changes. Try CPU in different board if possible.","I'm a fan of the AMD ryzen cpus but their failure rate is way higher than intels. I've had to warranty several ryzen cpus in the past 5 years and never had to warranty an Intel CPU in the past 20 years."],"points":0},{"text":["valdus 400 speakers"],"points":0},{"text":["External Hardrive not working"],"points":0},{"text":["An Internet Service Provider does not work on a game","You need to work with the ISP. Anything reddit says would be a guess and may still need your Isp to fix"],"points":0},{"text":["Glare insignia class f30 series led","What you want to get is anti-glare film or an anti-glare screen protector for the tv. Should be on amazon or other online retailers, just make sure to match the dimensions of your TV and don't cheap out on the bargin bin one if you want it to last."],"points":1},{"text":["Windows 10 Temp Profile Regedit Fix Failed?"],"points":0},{"text":["Laptop won’t turn on"],"points":0},{"text":["Network Troubles"],"points":0},{"text":["Can't change my pc brightness level and display resolution","Your computer may not be powerful enough. You'll need to reduce the resolution and details of any games"],"points":0},{"text":["Windows 10 PC - grey screen"],"points":0},{"text":["Is there a way to verify if a blank DVD-R disc is original?","Try this https://www.videohelp.com/software/DVD-Identifier"],"points":0},{"text":["Wrong RAM chip","What model sodimm ... Give the long model identifier"],"points":0},{"text":["Any ideas?"],"points":0},{"text":["Laptop shuts down and sometimes bluescreens every time I close the lid.","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Is your power setting for what happens when you close the lid set to sleep or hibernate? You might want to try one of the other settings or maybe even try the do nothing setting as a test."],"points":0},{"text":["What just happened to my PC?","I'm not an expert, but it sounds like a power supply issue. As quoted from Chron article\"Bad Power Supply - The little brick-like metal case inside the desktop tower contains the power supply, and it houses a little fan of its own to keep cool. If this supply fails, the computer itself won't power up, but the cooling fan may still run.\"I've had this happen the first PC I learned to build on, it was the power supply, but the red light and the fan would still whir. Nothing else would even look like it had life."],"points":0},{"text":["(Windows 11) After installing latest Windows 11 update, taskbar is disabled and Startup programs are not launching until 3 minutes after entering home screen.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["How do you open this menu in Windows (11)?"],"points":0},{"text":["Please help! Facebook messenger app suddenly made me use end-to-end encryption, but for only one conversation?"],"points":0},{"text":["File transfer from usb/external drives causes permanent high ssd usage","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["My Computer Keeps Switching to \"Power Saver\" Mode - HOW TO STOP!?!","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Friends PC shutting off with his GPU in his rig, but his GPU works fine with my rig and vice versa?","Is the PSU maybe not powerful enough?"],"points":0},{"text":["Samsung 990 Pro Very Slow Speeds","Your drive seems to perform as expected.When loading the game the driver is under maximum usage? What game are you talking about? This issue occurs with all games?This problem more likely relevant to the game rather than your SSD."],"points":0},{"text":["Mouse and Keyboard disconnects ONLY when playing video games"],"points":0},{"text":["Steel Series Nova 7x mix not working when plugged in wired for windows 11 but works for windows 10","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["PC not reading GPU?","Did you try replugging the gpu? And is you monitor plugged in the gpu or the motherboard?"],"points":1},{"text":["Do these \"mini desktop PCs\" work just fine for things like internet and word processing?","Should do, but don't expect great performance. At that price point since you need a display, a good tablet and keyboard case is an option","it depends on the software you are using. if it's just email, clerical work, web based apps, etc. they are fine. they are essentially a laptop without a built in keyboard, mouse and monitor. they typically use mobile parts for cpu and ram.here's intel's spec sheet for the cpu in this system:https://ark.intel.com/content/www/us/en/ark/products/231800/intel-processor-n95-6m-cache-up-to-3-40-ghz.htmlit's a low power mobile cpu. it will be fine for what you describe, and not much else.","I would go for a slightly better one with at least an Intel i5 CPU.I use a similar MicroPC with an AMD Ryzen 3500 and one with an Intel i7 - performance is not even comparable, but both do the work you envision more than good enough. The i7 runs extremely smoothly.Your model is too weak, IMO. The only really decent things about that computer are the 16GB RAM and the 512GB SSD.This one: https://www.amazon.com/dp/B0B9JRT7Q9or this one in particular: https://www.amazon.com/dp/B0CPPMXP3Swould be my choices","Pass. No OS so the costs continue as you add keyboard, mouse, display and maybe an OS.In that price range we get laptops like https://sellout.woot.com/offers/dell-latitude-7280-7th-gen-12-5-fhd-laptop-open-box-1?ref=w_cnt_lnd_cat_pc_3_6 for less. Yes, it's only W10 but for the price, you're done and good to go. Yes, we bought many for the office but today we get the ones that have W11.","Oh, absolutely, those mini desktop PCs you've spotted on Amazon can be a pretty solid choice for just surfing the web and getting some work done in Word. They're small and won't hog much space, plus they're usually pretty good on the power-saving front too.Just make sure to peek at the specs to see if it's got what you need—like how fast it is, how much memory it's got, and the storage space.Bear in mind, you might need to grab a few extras like a monitor, keyboard, and mouse if you haven't got those lying around. And check if it comes with Windows or whatever OS you prefer, some of them do, but some might leave you to set that up on your own.Also, don't forget to check the ports and stuff to make sure you can plug in everything you need. But yeah, for browsing and docs, a mini PC should do the trick nicely! I use the ACE MAGICIAN (middle one on the top row here) my only issue was the power supply started \"crackling\" lol after about a year, I just replaced it and have had no issues since."],"points":1},{"text":["Keyboard not working on Boot Manager","The Boot Manager has \"Asrock UEFI\" text on the top and shows the \"Please select boot device\" thing, with the options, plus two buttons underneath: \"Enter Setup\" and \"Boot default\"What I believed to be the UEFI settings tab has \"Asrock EZ Mode\" on the top left corner and shows some of my computer info such as DRAM Information, Storage Configuration and Fan Status\". I can't seem to interact with any of them in any form"],"points":0},{"text":["Graphics card Artifacts RTX 4080","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Can work see what I’m browsing if phone is charging in work dock while I’m at home?","Nope"],"points":1},{"text":["Windows won't install onto my PC.","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Latest bios ?"],"points":0},{"text":["iPhone 12 charging problem"],"points":0},{"text":["Ghost mic"],"points":0},{"text":["mouse keeps disconnecting unless there is a alreadycontant bluetooth connection."],"points":0},{"text":["Desktop sub-par WiFi performance and can't detect 5Ghz networks"],"points":0},{"text":["Desktop speakers buzz proportionally with my fps","somewhere your grounding is failing, so check where that failure is and fix it","How close are the speaker wires to the cables (hdmi/display port/etc) that connect pc video to the monitors?In my mind I'm thinking interference is being picked up from the monitor video cables."],"points":1},{"text":["Missing/Inaccessible disk space on 1 TB HDD","Tried running WinDirStat as Administrator? Might be some files it can't see running as a regular user"],"points":0},{"text":["Remote Access of home PC"],"points":0},{"text":["Laptop keeps taking screenshots","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Is this a \"Good\" CrystalDiskInfo on my HD?","Don't see anything concerning there, looks more like the hard drive's slow just because hard drives are slow, would highly recommend upgrading with a cheap SSD, and maybe adding more RAM if the current amount is insufficient.","You cut off the type of drive and there are more values if you scroll down. You can't know anything without knowing the drive manufacturer as they treat the SMART fields differently.Maybe it is a seagate, in which case there might be 2 seek errors which is unusual and may be an indication of a problem. Post full screenshot and we can check it out.What does task manager show? Sort by HDD, GPU, CPU, are there any processes with unusually high percent ?Get malwarebytes and run a scan: https://www.malwarebytes.com/As others said, an ssd upgrade will be the best bang for the buck"],"points":1},{"text":["Display stopped working suddenly"],"points":0},{"text":["RAM GIGASTONE RGB GAME PRO 32GB DDR4 3200MHZ"],"points":0},{"text":["Second monitor stopped being detected today; doesn't redetect."],"points":0},{"text":["It's probably the Flash Drive, isn't it?","Yeah the flash drive is dying. Could be because it's cheap, could be because you already write enough to kill some of the cells (eg, continuously filling it to the brim, watching, then remove and refilling etc). FWIW, NTFS isn't actually ideal for flash storage, it write a lot of itty bitty changes to the drive, even if you're just opening the files. Use exfat instead if your TV support it.Next time try buying offline, in stores specializing in photography equipment, they tend to have better products in stock.","If you want to watch downloaded movies, maybe try some free streaming software like plex, it's easy to install and as long as your pc is running you can stream the movies to your TV or phone. using Chrome cast has been a blessing for this."],"points":0},{"text":["Rx 570 4gb's one fan won't spin under load"],"points":0},{"text":["HOT CPU","A crude test is to allow it to run a bit, and feel how much hot air comes from the cooler. If it's substantial, that means there's good conduction, but if your fans blow cold, the CPU may not be making proper contact with the heat sink."],"points":1},{"text":["Charging laptop shows full charge but isn't","That sounds like a defective battery to me.The HDMI connection has nothing to do with this issue, because the display connected through HDMI draws power from its own power supply, not the laptop's battery.You can try draining the battery to 0% and then charge it to 100% and check if it works normally unplugged after that.You can also get a battery report on windows, but it's not super accurate in the case of a defective battery:To get a battery report on Windows, follow these steps:Open the Start menu and search for \"Command Prompt\" or \"PowerShell\".Right-click on the top result and select \"Run as administrator\" or \"Run as administrator (Windows PowerShell)\" depending on your version of Windows.In the command prompt or PowerShell window, type the following command and press Enter:powercfg /batteryreport /output \"C:\\battery_report.html\"This command will generate and save a battery report in the root of the primary driveOpen File Explorer and navigate to the root of the primary drive (usually C:).Double-click the battery report (HTML file) to open it in your web browserThe battery report will provide detailed information about your battery usage, capacity, and health. Some sections you might want to look at include the installed battery, recent usage, and battery usageSome laptops (like some Acer models) have a pin hole switch at the bottom that let you disconnect or power cycle the battery. You can push that using a paper clip"],"points":0},{"text":["5Ghz network slower than 2.4Ghz only on my laptop","Clear path and close for 5g over 2.4g","Are other devices at the same distance from the router?","Are you using them in the exact same location? 5GHz while faster is also far more sensitive to obstructions.","There is the possibility the 5Ghz antenna has disconnected or is broken. Find the wifi module near the ram.and hard drive.","See if your network settings are set to metered or public. Windows does that sometimes...."],"points":2},{"text":["Everything overheating"],"points":0},{"text":["Bitlocker my recovery page not working","Works just fine on my side. Can you at least open https://account.microsoft.com/ normally?","Can you access it from another browser or pc? How does it load up on your phone?"],"points":0},{"text":["Polwii Bluetooth mic not connecting to iPhone"],"points":0},{"text":["This black piece of my usb keeps coming off and getting stuck in a usb port, can I just leave it off"],"points":0},{"text":["Switching from intel to amd with the same hard drive","You could do a files and folders backup of your drive and then format it and set it up for the new system and restore the files and folders you need. I have moved drives from one processor to another and the amount of time it takes to make it work likely exceeds the time it would take to set it up new and simply restore the programs and files you need.","So what are the new and old PCs? And what OS do you have installed?Assuming Windows and vaguely modern ones, you should be looking for something like Windows Boot Manager in the boot order, not just the drive as a whole."],"points":0},{"text":["Unable login to windows 10 after update (20H2 - 22H2)"],"points":0},{"text":["How to force close service in services.msc"],"points":0},{"text":["USB doesn’t appear in File Explorer, or Disk Management"],"points":0},{"text":["pointer freezing/stuttering only on desktop"],"points":0},{"text":["Is this normal behaviour for a stock 13700k ?","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Try removing the cooler and see if the thermal paste is spread evenly across the entire IHS. Maybe there is a mounting issue and the cooler is not making proper contact. Update your motherboard bios."],"points":0},{"text":["Accessing HDD files from new SSD *Windows*","The SSD is smaller than the HDD so I couldn't really just clone the disk.This would've been a bad idea for more than a few reasons, and it's a good thing you didn't clone itWhen I go to access files from the HDD it states that I have to seize control, however I don't want to do anything that may corrupt or compromise her FilesDoes it say this literally, or is this translated from a different language? I've never seen this wording used for getting access to files, so i can't really tell you for sure, but it just sounds like you need admin access, and just pressing yes gives it to youIs there a way to transfer her Windows User account/folder from the HDD to the SSD?Yeah, you can just copy over the \"C:/Users/<her username/\" contents in the new ssd, but i wouldn't really recommend it since you'll get a lot of junk alongside of the files she actually wantsSo essentially we want to use the SSD for OS and some games/apps that are better on SSD, and all the files, data and apps on the HDD we want to leave there and be able to easily access and run.You'll have to reinstall all of the software you want to run on the hdd since your new windows install isn't aware that they exist, and where they exist, some software will still run if you find its executable, but some software relies on other dependencies so it might not start, or throw an error, or even start, but throw an error later while you're using the software. Aka, remove old files, and install the software from scratch"],"points":0},{"text":["Google search relating full name with scam websites","Your friend's name was leaked in some list (or simply randomly generated) and then scam sites use it to drive traffic. Not much you can do unless you're in the EU and want to exercise the Right to be Forgotten"],"points":0},{"text":["Error when reinstalling windows after reset","If it's a new install. Why not just install it again?","Also just in case you did this. DO NOT use the built in windows reset utilities. It is often unstable and breaks the PC. If you are not familiar with doing windows installs then find a video."],"points":0},{"text":["Data Recovery After Factory Restart","Attempting data recovery without proper knowledge or skills can result in permanent loss in data. Prior to data recovery, it is best to create an image of the failing drive. For important data, it is recommended to send your drive to a data recovery professional. For more data recovery help, please visit /r/datarecovery.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","For source codes, push them to GitHub/GitLab. For resumes, put them into Google Drive. Your photos may be small enough to put into Google Photos, if not, copy them to an external storage (but consider a backup service if they're really important to you).","How about buying a new hard-drive for your pc? You can upgrade the capacity and speed while having a fresh install. Then you can keep your old windows for your old files. Ps if your doing NetBeans and vscode projects your probably more tech literate then you lead on."],"points":0},{"text":["WiFi Adapter doesn’t want me to connect to WiFi","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Unplug it and install driver's then plug back in If that doesn't work Adapter settings and make sure it is on DHCP (auto assign IP) and ipv4 only no ipv6 Stabbing in the dark but try that first","Driver's though yeah?"],"points":1},{"text":["Unexplained Instagram Session Hijack","Was there actually full access to the account or was it just acting like it was the account owner, ie. could you edit their settings etcSimilar has been seen on certain Microsoft sites for some time, it's due a cache issue but usually on the providers side, the images and text being shown are for the wrong user but you still have the permissions of the user you should be."],"points":0},{"text":["Make monitors the same size"],"points":0},{"text":["Streaming a Bluray on my smartphone","It's called HDMI over IP. Lossless solutions require very large bandwidth, but with lossy you can even go with a crappy wifi connection.","plex/jellyfin"],"points":0},{"text":["S21 ultra sound is not working"],"points":0},{"text":["Wifi not working","Warranty it, or pop off the bottom cover and see if the antennas are disconnected, or the wifi card popped out"],"points":0},{"text":["Macbook air performance","Since all ARM-based MBA are actually very decent in performance and fanless, I'm assuming you're using the older Intel-based MBA. Sorry, not much you can do about it, you can't make the fan quieter without losing even more performance due to throttling, you'd have to use another solution to cool it down, such as a cooling pad."],"points":0},{"text":["Game crashes","Hi! Before anything else congrats on the new PC, can you provide your specs, sorry for the sarcasm but we don't have magic crystal balls that can magically see the problem and magic wands that we can wave to fix it whatever that is causing this issue for you."],"points":0},{"text":["Programs closing, unsure how to diagnose the problem","Does this happen when streaming your monitor/game via discord or watching streams of others or also when the app was totally idle only showing your messages for example?"],"points":0},{"text":["My PC wont connect to the internet/no internet at all.","Check the antenna cable/connection, it might be loose.Desktop PCs need either external antenna(e) or an external USB \"stick\" for WLAN/Bluetooth."],"points":0},{"text":["Video not playing.","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Windows 10 Start Menu automatically closes"],"points":0},{"text":["CPU doesn't turn on in the morning unless I put it in the car first.","It sounds like the delta here is the time it's spending actually unplugged.Next time try that.When it won't start in LocA, unplug it, hold the power button down for about 60 seconds and do nothing else. We are fully draining the capacitors in the power supply. After that wait a few minutes, plug it back in and see if it boots.If it does chances are good your power supply is failing and what has been resolving the issue is the long delay whilst unplugged from AC power.","Don't even open the case, just unplug it from the wall. You want to minimize any other interference so as to isolate the troubleshooting at this point.Power supply capacitors can hold charge and if they are failing then the internal electronics inside the power supply won't respond properly.The power button trick holding it down like you're turning it on) makes the connection so it starts trying to deliver power and drains them of any residual charge."],"points":2},{"text":["I need help disabling memory integrity"],"points":0},{"text":["i have a list of requests for a friend","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Your friend should read rules 2 and 6","A thought here. Even https://github.com/ntdevlabs/tiny11builder found there are limits to what can be removed. If folk that do this hit a brick wall, maybe that's it for now.That said, I have both 10 and 11 (work and home) and didn't find 11 to look much different after a few clicks to restore the taskbar. But I don't use Windows much. Just the browsers and a few games so the OS fades away to something like the robot that serves butter for Rick Sanchez."],"points":0},{"text":["Windows 10 booting into black screen","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Brand New laptop hinges get loose right after"],"points":0},{"text":["HELP! My laptop will not open new apps or shutdown","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["External Hard drive not working","Does it the disk get listed is disk manager?"],"points":0},{"text":["Help - New laptop will only work when plugged in","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","The battery is screwed, if it's new like you say, just get it swapped under warranty"],"points":1},{"text":["Was i hacked via hotspot?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","No, he won't have hacked you via being connected to your phone hotspot, a lot of people on reddit are scaremongerers with no technical knowledge who spout a load of crap constantly tbh, most of them wouldn't know malware if it slapped them in the faceAt very worst he could have visited dodgy websites which would appear as if they came from your phone if the authorities asked who was this IP at x time but that's just going into the realm of espionage spy shit and fantasy in 99.999% of cases, but there's no chance he hacked you via you sharing hotspot"],"points":14},{"text":["Chrome problem"],"points":0},{"text":["spacedesk help"],"points":0},{"text":["Problem with Microsoft Fotos (Windows 11)","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Did you maybe disabled some of the windows telemetrics/diagnostics/tracking data with a third party software in the past?also what error the microsoft store will give you?"],"points":0},{"text":["My Capture Card is bugging out and can't fix it, anyone help?"],"points":0},{"text":["Why does AssistiveTouch keep coming back after i’ve turned it off?","try switch it off and hard reboot"],"points":0},{"text":["Misery BSOD on new PC","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Sounds like the storage. With NVMe drives, the self diagnostics (SMART) is useless. The general status at the top has been useless for 10 years because it's up to the manufacturer how much it has to fail before the status changes and is almost useless on HDDs as well. The percentage health is not actually related the current health at all, it's how much of the warrantied writes you have used up. The biggest problem is that NVMe drives (And a lot of new SATA SSDs as well) have removed almost all of the useful parameters for checking for errors. I've seen hundreds of faulty NVMe drives and I've seen less than five report any issues in SMART.That it runs find in a different system is actually big, it could be the motherboard/slot. Could you try a drive from that other machine in that PC?"],"points":0},{"text":["Alt tabbing in borderless window behaves like fullscreen","Have the same thing in Lords of the Fallen. Dlss overrides borderless to fullscreen. Maybe that's the problem."],"points":0},{"text":["How to listen to microphone on headphones only?"],"points":0},{"text":["USB-C to headphone jack keeps breaking: advice?","The first thing that comes to mind is bending. This is very strange since these are devices that should last forever under normal conditions.Could you be bending the headphone connector inside the adapter without noticing?Also, if you haven't already, check to see if there's lint or dirt inside the adapter and clean it out using a pin or paperclip that is straightened out. This used to happen a lot on old Apple phones because the jack was on the top instead of the bottom."],"points":0},{"text":["How to encrypt or configure a external hard drive to be accessible by certain set of PCs or specific Windows user.","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Only your IT knows what constraint they're facing before they decide to block external drives entirely. If your work is negatively affected by the restriction, complain to your supervisor so they'll consider an acceptable compromise.","Setting up a shared network drive and even making it restricted access to certain users is pretty easy on a home PC. But it's practically impossible when you don't have Admin rights on a system that is managed by an IT dept that don't want you to even access that drive in the first place!This is a case of \"explain to the people who have the power why you need this, and hope they will listen/agree\"","I know this is not what you're asking but it's highly unlikely they would give you any kind of read or write access. This is an unnecessary risk for most companies to take.Some companies that work with classified information actually still burn DVDs and store highly confidential info this way. They can also use an intranet based solution.Is it possible to ask your admin for more storage space or network space? Or maybe I'm missing the point 🤷🏻‍♂️","No problem. Look at \"biometric flash drive\" for example. Unlocks only for the user with that fingerprint."],"points":3},{"text":["Poor streaming from wifi and need help to diagnose","When you say \"signal is poor\" are you referring to the signal indicator in your task bar/notifications bar? If so, try getting closer to the WiFi router/access point, and stream there. If it works, then you just need to move wifi closer to wherever you prefer to load podcasts/watch videos","If you live in an area with high population density, your issue might be interference from other wireless networks nearby. If you can get on your wireless router, try scanning channels to see if it picks a different set for your 2.4 and 5GHz frequencies.","Go to Ookla Speed Test and run a test from where you want to stream. Check your latency/ping. You could have perfect connection speeds but that's only one part of the equation. If your latency is poor (high numbers, 30 or lower is ideal) it means that there is significant lag and delays. Some ISPs are also throttling certain types of traffic.What type of connection is this? (Fiber, Cable, 5G, Satellite)","Speed test then trace route to Google see if it lags out somewhere at the start"],"points":1},{"text":["Just installed TEKKEN 8 on Steam and got this, how do I fix this?"],"points":0},{"text":["Laptop won’t stop trying to connect"],"points":0},{"text":["Accidentally put boot files onto recovery partition.","What do you mean changed your pc?"],"points":0},{"text":["Old nostalgic pictures lost forever?","A long shot but have you tried connecting the phone to a pc as the phone should show as a drive under Computer."],"points":2},{"text":["Can I connect to YouTube on a smart TV without immediately replacing what's on there?"],"points":0},{"text":["Is my laptop camera dying?"],"points":0},{"text":["Upgraded GPU and now my pc runs worse"],"points":0},{"text":["1060 6gb worse then expected","It would be helpfull if we knew the full specs of your PC."],"points":0},{"text":["Ethernet connection","Wireless ethernet is WiFi.But on a less pedantic level, you can try Ethernet Powerlines, which will attempt to run your network over the existing power cables that you plug into the wall. TP-Link is a reputable brand. But be aware this may not work well, depending on quality of power cables/distance and seperation of circuits.Alternatively, try a mesh network solution. Good quality ones use a backhaul channel that's seperate from the WiFi itself, allowing for faster data speeds.If it does come down to running a long ethernet cable, I would recommend Cat 6 at minimum - it's not much more expensive, but provides a greater guarantee of speeds and interference mitifation.","A \"client bridge\" will connect her wired Ethernet devices to wifi.But i fear the reason she stipulates wired is to avoid wifi..."],"points":0},{"text":["Slow WiFi dongle Windows 11","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Is there a free universal spell checker for Windows desktop that works on all the SM apps I use, like Messenger, WhatsApp, etc.?","Grammarly"],"points":1},{"text":["Web or app advance"],"points":0},{"text":["I want to restore iPhone data to an Android. What can I do?","https://www.android.com/intl/en_uk/switch-to-android/To transfer the most data, recommend using your old iPhone Lightning cable."],"points":0},{"text":["HP Laptop just shuts down on any boot attempt."],"points":0},{"text":["2020 MacBook Air Won’t Start - Corrupted Drive?"],"points":0},{"text":["Permision without my permision"],"points":0},{"text":["How to fix Google Chrome"],"points":0},{"text":["BSOD PAGE_FAULT_IN_NONPAGED_AREA (50)","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","The pattern of these crashes suggest drive issues, to my mind. Please run the following commands in a cmd prompt terminal and link a screenshot of the output:wmic diskdrive get FirmwareRevision,model,statuswmic pagefile get Caption, CurrentUsage, Status, TempPageFile","Won't let me edit the post, but I added my recent minidump files as well","That happened to me as I changed to the RTX 3070. After I sorted that issue then I got the 3090 as prices came down. In this case it was the near new 850W PSU. I won't get into make and model here but a new 1,000W PSU cleared it up and let me move on to the 3090 when the prices came down.But the clue for me was the crash was rarely the same thing. One time it would be disk related the next some audio or video nod.","Most are memory related, but the page file is often referenced and one crash directly blames storage. The page file is basically treated like RAM so it's quite common to get crashes that look like RAM with storage.So it's probably the storage. If you have lots of drives, it's the drive with the page file on it. You can check which drive has the page file by running Get-CimInstance -ClassName Win32_PageFileUsage -Property * in Powershell."],"points":1},{"text":["Gigabyte RX 5700xt getting differents temps on differents PC's"],"points":0},{"text":["Only boot screen with VGA"],"points":0},{"text":["Audio cuts out after I go into full screen mode or something."],"points":0},{"text":["How rating sites work?","Those sites aren't to install remote tools, those are to gather information and they can use that to call and trick people into giving access to their computer.If not information was given and the site closed after, you'll be fine"],"points":0},{"text":["Pc blue screening kernel power 41 issues and major bugs","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Slower than usual, but now…","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Black squares appearing on screen"],"points":0},{"text":["How to erase everything from a m.2 nvme that's read only?","Presumably you could just reformat the drive? Will wipe all content. You may even find it performs better after if there was some sort or issue present.","SSD's go read only when they have too many write cycles completed, this is to ensure you can access the data without total loss.Without the ability to write however you can't format or initialise the drive, the best way to stop data being recovered would just be to destroy it physically but honestly if you send back for a replacement under warranty, they're just gonna do the same anyway, noones going to actually check it or read your data, the drive will be destroyed and gotten rid of.","Have you tried the clean cmd using diskpart?Right click Start>powershell/terminal with admin & enter:diskpartlist diskselect disk X (where X is the number of the drive you wish to clean)CleanExitExitThen open drive management & format the drive.If at any time it fails then the drive cannot be fixed.","I've actually never run into this situation but I wonder if it would accept the ATA secure erase command? The read only lock is from the controller as a fail safe to keep the drive readable once it's past its write cycle life, but the secure erase command is executed at the controller level and should bypass that I would think.Your BIOS might have a secure erase function built in, or you can use the Adata SSD Toolbox to run it if you're booting Windows off of another drive. You could also make a Parted Magic USB stick and use that to execute the secure erase command from the Disk Eraser utility."],"points":0},{"text":["No #:\\User folder on old laptop drive"],"points":0},{"text":["need help with rx 7600 underperforming"],"points":0},{"text":["Cannot open most apps. Windows cannot access the specified, device path.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Driver support applications are unwise and unsafe, drivers should only be updated directly from the manufacturers website or via Windows update.Remove anything the program installed and itself, find the driver from your motherboard manufacturers website","I'd wager either the Path system variable has been broken, or a drive letter may have changed.","See if you can do a system restore to point prior to when the issues started."],"points":3},{"text":["Random login from various countrys","Change your Microsoft account password. Consider turning on two factor authentication (2FA). If you use your phone for two factor authentication then make sure you know to recover access to your account in case you lose or replace your phone."],"points":0},{"text":["How to remove suggested emails?","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Buying new monitor","This is not a sales advice sub. Rule 5r/buildapc","There's no need to spend that much even. Also,10 bit color won't make a significant difference compared to 8 bit, especially for something like YouTube video content. A wider color gamut would make more difference. You can pick up a 27\" 180 Hz, 1440p IPS panel, with 95% DCI-P3 coverage nowadays for around $200 - $250 in the US. Acer do some good ones, but check that you're getting more recent models, with the Max Brightness setting available.https://youtu.be/qA6DwVUAx7k?si=YdQNuLbTF7RFh7yR"],"points":1},{"text":["Asus Prime z370-a and 3 RAM Sticks","It's not a good idea to mix and match RAM, even from the same brand and at the same speed. Nor is it good to use more than two sticks in many systems, unless they have explicit support for four sticks. For three sticks especially, that will remove any advantage from running in dual channel mode and is counter productive, if you can even get it to work, as you are finding.Your best options are to run two identical sticks in the correct slots and, if you need to upgrade, upgrade both of them at the same time. Or, if your board supports 4 sticks, which as I recall that one may do, then buy RAM that is on the QVL list for the board at 4 sticks, and at the speed and capacity that you want to upgrade to."],"points":0},{"text":["Framerate in Fortnite","No problem in playing Fortnite.Try changing all the settings to low? Just to test.And from where did you download your drivers for your graphics card?","Have you enabled above 4g decoding and resizable bar/SAM in the BIOS? That can make a big difference. Also, make sure you are using the latest drivers, including the recent preview drivers, from AMD, not the ones from the motherboard manufacturer.If you do think that you need to reinstall Windows, do an inplace upgrade first, so that you keep your files, apps and settings, rather than a full, new install. Only do the latter as a last resort. This thread also might be of use:https://www.reddit.com/r/Amd/comments/15wcx43/smart_access_memory_is_the_same_thing_as_rebar/","FYI, it seems to be an issue in Fortnite itself. I also have been experiencing huge lag spikes, along with my friend, for no apparent reason. Neither of us made any change to our settings before or after the update.We're not sure whether it's Fortnite itself or the new Nvidia driver (came out a couple of days after the fortnite update), but since you don't have an Nvidia card it might be Fortnite itself.Keep Task Manager in background to monitor any apps taking up your resources, but I think you're suffering from the same issue my friend and I are suffering from, along with at least another guy who posted on the fortnite sub. Best to wait and see if it is resolved.","No need to defrag SSDs btw","What about Lumen? Does it allow you to turn on hardware lumen on an AMD card? If so, that will tank performance pretty hard."],"points":7},{"text":["Pc starts freezing. I really need help , i have no idea what to do.","Have you cleaned the inside of your PC recently? Do so carefully if you haven't. Double check that all cables are properly connected to the motherboard, drives and GPU and to the case itself (so the power cable to the case). Reseat the RAM sticks. In fact, test the system by rebooting with only one stick at a time in different slots. See if that makes a difference. Check that your temperatures aren't too hot with something like HWInfo64."],"points":0},{"text":["Any mic on my PC will only capture vibrations (Win 11)","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","It might seem obvious but do check that the mic isn't muted. This might also help:https://youtu.be/0sMaYwuJrK4?si=gDLtKT8W6rg6Zu0S"],"points":0},{"text":["External access mac nvme"],"points":0},{"text":["PC not showing any display"],"points":0},{"text":["How to connect ethernet wifi which is connected manually","Very unclear .. It doesnt have to be connected to internet ( wan) for lan /wifi to talk","So the PC you are using is connected to the WiFi, but you can’t connect your phone to the same WiFi network, is that correct?"],"points":0},{"text":["Onyx color issues in Ubuntu vs nvidia drivers"],"points":0},{"text":["Pc boots into black screen with white line","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["What Docsis modem works best for T-mobile home internet?"],"points":0},{"text":["Laptop repair question","Attempting data recovery without proper knowledge or skills can result in permanent loss in data. Prior to data recovery, it is best to create an image of the failing drive. For important data, it is recommended to send your drive to a data recovery professional. For more data recovery help, please visit /r/datarecovery.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Strange that the SSD ‘failed’ when you sent it in for repair…Though if the SSD is still usable then it’s possible to recover the data yourself and reinstall windows on it with just a USB"],"points":0},{"text":["Is it normal for my LaCie rugged secire to do a high-pitched *chirp* when ejected?"],"points":0},{"text":["about a dubious .exe","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Youtube app still apearing in Chrome after already uninstalled","Google owns YouTube and (Google) Chrome so it’s possible that the ‘app’ is integrated in Chrome and that is probably the reason for your problem.Chrome is really heavy on computer resources.Use Brave or Firefox, even Microsoft Edge is preferable. This is my recommendation."],"points":0},{"text":["How to delete windows","Go to My PC (folder) -> Right Click on the SSD -> press on Format -> Press on ok, done."],"points":2},{"text":["Creating an image from a moving video","I’ve never done anything like this but searching for panorama from video has some promising links.","I don't know if this is the best or quickest method, but I'd convert the video to a series of image files in premier pro and then try to knit them together in photoshop."],"points":0},{"text":["% app in windows taking 800 gb of my space","Seems like malware, download malwarebytes and perform scan.","Run WindirStat to find the folder and data usage in your disk. Maybe that can be a good hint.","No. As folder names are arbitrary there's no way of definitely identifying the program. Your need to go into the folder and inspect the properties of any executables. Other option is to look for the same name in the program uninstall section of Windows"],"points":2},{"text":["light bleed on laptop screen asus tuff gaming a15"],"points":0},{"text":["Key inputs are wierd","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Your Windows key is stuck down. Mash on it a few times."],"points":0},{"text":["Im not entirely sure if this the correct sub I think it is, anyways my problem is that I probaly installed a malware?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Problems uninstalling a program"],"points":0},{"text":["Windows boot stuck"],"points":0},{"text":["HD 6670 drivers keeps crashing"],"points":0},{"text":["How exactly does the predictive text in your phone work ?","You got a side piece you trynna hide from your GF? Afraid the name gonna pop up when she borrows your phone? 👀","It depends on the keyboard app you use, the predictive engine is provided by the app, not the OS. Some use cloud prediction that can offer unique names if it's popular among its users (eg, maybe a certain singer is often talked about this week), others offer to read sent email to collect data, and others use field-specific completion packs, ie, medical and IT, which can suggest a name of inventors or public figure.For names learned by the engine, the rule varies too on how often they need to see the occurrence before they offer it.","I don't know a lot about it but I know it learns your writing. Also there are sentences that often repeat more often than others. Ask yourself how much in your lifetime you used the sentece \"What's happening?\".","There are other ways words can appear as predictive words.I get predictive words from mis-spelling stuff too many times, or from typing a partial word like with \"partial\" if I type \"part...\" it assumes I want to finish it as \"parts.\"I also don't see why you couldn't see similar behaviour if you type 3 letters, accidentally use the predicted word instead of completing the word manually, then it remembers unless you specifically tell it to stop suggesting. It's remembered lots of mis-spelled words on my phone and is kinda irritating.If they are using a mixture of non-english and English words, I imagine that could confuse things further.(Also, I use Samsung keyboard, but if I used Google, I imagine it would use my search history and YouTube watch history, too. And I know if you have a shared account on a smart TV or whatever, they can make \"surprising\" suggestions to the behaviour of other people using the account.All that is to say, don't feel like the world is ending because of 1 small detail, but I guess there must be some subconscious or preexisting stuff hanging around for this type of event to be a big deal. Seems like talking about things would help.If they're not happy and are also unwilling to talk about it. That's a bigger signal that something needs to change than some random shit on their phone's autocorrect!"],"points":1},{"text":["Your device has run out of memory","Is your GPU or CPU running out of memory? If the former you may need to drop quality settingsIf the latter you'll need to I'd the greedy process in task manager"],"points":0},{"text":["SSD Stuck. Any advice on what to do?","First of all relax.You should care about the cables.Can you upload a video or a gif?Trick for creating a gif if you have WhatsApp is taking a video and you can convert it to a 5sec gif."],"points":0},{"text":["PC unresponsive on start","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Can anybody help me with my bios skipping and going to the windows login","On all the PCs I have owned, getting into the BIOS required me to hold down a key during power on. The key to press down differed by model. It could be ESC or one of the function keys. You may have to research the correct key for your PC."],"points":0},{"text":["Help me out Guys","That's on all recent Android, it merely point out \"hey, currently this app can listen to your microphone\", which is, d'oh. The idea is if you're indeed making a call with say, WhatsApp or Telegram, then yes, that's normal, but if you're just watching videos or browsing and suddenly such notification shows up then you know you have a naughty app spying on you.","Start by reading rule 2"],"points":1},{"text":["iOS creepy automated voice during phone call?? Help?","I seriously doubt it had anything to do with your phones, sounds more like a glitch at either your network provider or your BF’s.The automated voice you mentioned is generated by the provider, not your phone, that’s why I strongly suspect they had some sort of glitch.I really wouldn’t worry about it when it was just a one of occurrence, glitches happen in systems as complex as phone networks."],"points":1},{"text":["App goes Blurry"],"points":0},{"text":["High temps on Mafia 1 DE RTX 3090"],"points":0},{"text":["Adobe Acrobat Reader save files"],"points":0},{"text":["What is going on here? I get BSoD 30% of the time I try open R6. Has happened numerous times this week since I updated my drivers","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","I see a deleted post replying to the bot, did you use one the recommended file hosts (If it was dumps posted)?"],"points":0},{"text":["Anyone knows how to fix this error message I tried everything \"windows setup does not support configuration of a installation disk connected through usb or ieee 1394 port\""],"points":0},{"text":["one of my pc LED “lights” that is controlled by the gfx application will not turn off no matter what i do"],"points":0},{"text":["HP M27FD FHD USB-C 27\" - monitor flickers in and out of connection with USB-c DisplayPort, when external power cable not connected to laptop"],"points":0},{"text":["WinRT Storage API replaced the default Windows 10 media player app (solution)"],"points":0},{"text":["Solution to error: procedure entry point NtDisableLastKnownGood not located in dynamic link library","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["MacBook 2017 Screen Issue: Cursor Problems, Flickering, and Black Lines at Full Lid Opening However No Issues When in Video Screen – 'Dustgate' or Software Glitch?\""],"points":0},{"text":["My Laptop Screen Only Works When Connected to an External Monitor"],"points":0},{"text":["Gotta proplem here, pc wont let me in","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Purple tint on gray/white and FULL RGB not working. MSI Optix AG321CQR"],"points":0},{"text":["Help me I think I ruined my husband's pc and don't even know what happened","Try unplugging every cable (except power cable ofc) and then turning it on. While booting, take pictures of the mainboard (this is where everything is mounted, looks like a green thin plate). Focus on the top right side of the mainboard, there should be some small led's take pictures of those or look wich led is lit and comment whats written besides it.Edit: I thought it turned off by itself. Why would you need to force shut down?","Is it a PC or a Laptop ? (Laptop comes with a Screen built in).If its a laptop, then the red flashing light suggests the battery is flat, and simply needs recharging.Personally, I'd just leave it be until your Husband wakes up. Don't attempt to change anything - just leave it as is.","You didn't read rule 2, thats what happened","If it's a laptop (has a built in screen that closes} then just plug it into the charger"],"points":0},{"text":["Website help","That would be the website, it’s possible they only ship to certain states? Can contact them to find our"],"points":0},{"text":[":((( I think I ruined my husband's pc","if I were your husband I would want to leave it be and let me look at it when I wake up","You can't ruin a pc by listening to music... It'll probably be ok and if it's not, it's not your fault","A beep and shutdown can be a safety mechanism to prevent overheating and actual damage. I'd leave the PC as it is so your husband can check later."],"points":15},{"text":["Possible DDOS? A messed up prank? Help me get a better understanding on a situation a friend and I are facing!"],"points":0},{"text":["The problem with no hearing mic on SteelSeries Arctis Nova 1","Have you tried plugging the mic in in the rear of the case 3.5mm jacks? Some audio software will detect rear input is being used and switch to it over the front ports on the case.Do you know if realtek audio software is installed or not. If it is, i would play around with it. (if you have realtek audio)","Is microphone set for input device for windows? Right click on speaker icon by the clock, click \"open sound settings\" under Input it should be set to microphone.Another thing to check, right click on speaker by clock, click on Sounds > Recording tab > properties. What does it say for Jack information.https://i.imgur.com/lydHfs7.jpeg"],"points":0},{"text":["i need help reverting my factory unlocked oneplus n200 from lineage os to stock firmware"],"points":0},{"text":["Any idea what's making this noise (its not the pc fans)"],"points":0},{"text":["Hyper-V not showing up despite my computer saying I have it","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","enable the virtualization from the bios settings","Some screen shots would be helpful","What version of Win 11? You need Pro for Hyper-V","Windows 11 home? It's only available on pro and enterprise","Is there a specific reason you want hyper-v? You can still use virtualisation in windows without hyper-v, hyper-v is just arguably the easiest.Something like VirtualBox will do what you need it to do, if you just want to fire up a VM"],"points":0},{"text":["How can i down DirectML.dll"],"points":0},{"text":["My pc won't turn on","Try to change the CMOS battery","Is that running Windows 10 or Windows 11? I have seen this happen a few times on my Windows 10 when updates were running and when resuming from suspend mode it might be busy checking to complete or rollback the changes."],"points":2},{"text":["Cant download from microsoft store"],"points":0},{"text":["Google Docs: Every time I make a new page, it creates a new one but it keeps the same image (I don’t know where else to ask this, sorry if this is the wrong place)","",""],"points":0},{"text":["Temperature issues"],"points":0},{"text":["android malware","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","I apologize for my minimalist post, but I spent almost an hour writing out a long detailed account of the problem and troubleshooting only for the automatic moderation to remove it instantly without any reason given. Ive had to slowly over the last 40 minutes re write the entire post slowly losing more and more detail, losing all patience, and this is what the system permitted... although the androidquestions allowed my entire post with all the details no problem. I appreciate any help, im getting really frustrated now","Disable browser notifications"],"points":0},{"text":["Why is this happening to my phone?"],"points":0},{"text":["MacBook - issues following deletion of windows partition - Afraid of losing files"],"points":0},{"text":["Is the dp to hdmi converter defective or am i doing something wrong?"],"points":0},{"text":["Windows text all jaggy and not smooth."],"points":0},{"text":["Computer suddenly shuts off without warning while playing Palworld."],"points":0},{"text":["Obscure windows tablet battery died and now it wont turn on or charge"],"points":0},{"text":["HP spectre x360 15t d100 Fan not working properly"],"points":0},{"text":["Audio only coming through in one headphone","When you have headphones hooked up to 3.5mm jacks or through USB, you only get sound?Have you check windows sound settings?Right click on speaker by the clock, click on open sound settings. Check output device.I would also right click on speaker icon, click sound, then check what is enabled for playback."],"points":0},{"text":["Is it possible to change the default bios settings on a laptop?","Return it to that guy and tell him that he inatalled thr wrong bios version and please install the one for your device and provide him the the serial number , your issue is not fixable, it is a bios issue"],"points":0},{"text":["Strix 2080 TI Exceeding 325W power limit at over 500W!"],"points":0},{"text":["My phone just wont turn on","Sorry, you have to fix the screen"],"points":0},{"text":["Need help with audio"],"points":0},{"text":["PC randomly shuts down, especially when gaming","It could be sign of a bad power supply or power cables are loose inside the PC case (no inside power supply itself, don't open it). With the system unplugged from the wall, open up the case and follow each cable coming out of power supply to where it's connected to see if it's plugged in all way or not. Make sure the power cord is plugged all the way in the back of the case too.It wouldn't hurt to download HWMonitor (free software) and monitor CPU/GPU temps and other information."],"points":0},{"text":["Cannot get full resolution and hertz for monitor.","If this your laptop:https://www.msi.com/Laptop/GF63-Thin-11UX/SpecificationThen the specs lists the HDMI can do 4K @ 30Hz and that would suggest it’s an HDMI 1.4 port. In that case it will max do 75 Hz at 1440p, assuming the monitor also supports a 75 Hz mode.Edit:Do you have lightning or DP symbol by your USB-C port? If yes that would indicate it can do DisplayPort and you could connect your monitor that way for higher refresh rate support."],"points":0},{"text":["Monitor not working","Did you make sure everything is fully connected. Did you try a different port on GPU. Maybe play with the cable going to monitor to see if it starts working."],"points":0},{"text":["Windows PC doesn't wake up from sleep"],"points":0},{"text":["upload speed limited over one device wi-fi"],"points":0},{"text":["What is .fdata and how can i open it","Do you play fate samurai? https://steamdb.info/patchnotes/12959211/"],"points":0},{"text":["I was looking at sheet music and clicked on a website that may have downloaded malware","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","They look like fake virus popups, there's a couple of thing you can try:Clear cache. Go to chrome://settings/clearBrowserData , select site data and cache, in the Time Range select All Time, and click Clear Data.Disable all extensions. Go to chrome://extensions and disable them all.Disable google Chrome notifications","Just need to disable notifications in chrome, open settings and search notifications","looks like your windows is not actually activated, maybe activate it"],"points":0},{"text":["Is there a problem with my pc?"],"points":0},{"text":["MacOS - Accessibility - Spoken Content: System Voice keeps resetting itself"],"points":0},{"text":["PC has ARGB splitter to light up some fans...sometimes does not boot unless I unplug some of the ARGB splitter connections"],"points":0},{"text":["How do I reset an icon to the original in the taskbar?","Is this a pinned item or in the systray?"],"points":0},{"text":["Is something wrong with my benchmarking?","Sounds like it's doing what it should"],"points":0},{"text":["Mic sound very low with Windows 11","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Did you get the driver from the laptop manufacturer?","Had the same problem sound output not showing headphone only showing speakers had to downgrade windows to 10 but still same problem windows 11 removed my intel smart sound technology oed and sst"],"points":0},{"text":["USB Recognition on SmartTV","What sort of antenna is it, do you have a model name or product page?I’ve never heard of a TV that accepted antenna input over USB, on any TV I’m familiar with you’d have to connect an antenna to the antenna input. That will be a round connector on the back, usually labeled antenna."],"points":1},{"text":["\"duplicate these displays\" laptop screen is horizontal but monitor is showing vertical, how to make them both vertical","With the mouse pointer on the display you wanna rotate try Ctrl+alt+an arrow key I think up should make it normal.If that doesn't work maybe try the settings on the actual display."],"points":0},{"text":["How to use text to speech in discord voice calls?"],"points":0},{"text":["Fortnite fps problem","Reinstall OS uninstall all drivers should fix it"],"points":1},{"text":["Touch ID"],"points":0},{"text":["Download problems with Extended Storage"],"points":0},{"text":["PC entering slow motion upon waking from sleep."],"points":0},{"text":["Computer crash randomly is it safe?","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["My brother messed up with something and my partition shows logical drives. Only c drive is avaliable and no other drives are visible.","https://imgur.com/HCBmJx7"],"points":0},{"text":["\"the decryption operation failed see inner exception\""],"points":0},{"text":["Help! Can't get into bios w11","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["If my windows diagnostic tool is saying there is no issue with my memory can there still be something wrong with my RAM","Run a program called MemTest86. You boot it from a USB stick so it runs before loading into Windows.You may need to adjust you BIOS boot order to look for the USB stick first, or select the USB stick from a boot list.","What’s the actual problem that you’re experiencing ?","maybe turn the pc off and pull the ram sticks, blow any dust out of the slots and reseatmemory is ramwhy are you checking it","Yes. Memory error testing indicates if it finds an error, as it sounds. Issues with RAM can include stability, which can be more or less intermittent depending on how unstable the RAM is. I've diagnosed several RAM stability issues using Prime95 let run overnight that were minor issues so intermittent that testers like MemTest read them through fine.Note that stability issues can often be fixed through adjusting the OC (increasing voltage, loosening timings, lowering clock speed), it doesn't always involve swapping DIMMs out."],"points":0},{"text":["What hardware component has high possibility of being failed if i get this error and it is sure there is no software issues"],"points":0},{"text":["My graphics card isn't being detected by my computer","Is your monitor plugged into the graphics card? If not, the graphics card is probably not active.Shut the computer down and make sure the monitor is connected to the ports on the graphics card (your gtx 560). This is usually the set of ports further down the computer.","Maybe the gtx560 isn't powered properly. It needs at least one power cable straight to it.I see gtx560 cards are worth $20...."],"points":0},{"text":["Will American biught router work in Europe?","Mostly work yes, legally not necessarily, the legal channels mostly overlap but some require power limiting or radar avoidance in one region or the other, if the router lets you, change the region settings, or check what channels you're allowed, https://en.wikipedia.org/wiki/List_of_WLAN_channels.I know the power plug type is different but will it have issues with 220 volts if I use adapter?You'll have to look at the specs on the actual power brick, it might be a universal one, or it might be a 120V only one."],"points":0},{"text":["PC crashes and make buzzing noise and shuts off","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","I would download HWMonitor to check CPU and GPU temps while gaming, Play for awhile then minimize to check temps. Is your case getting enough air flow?"],"points":0},{"text":["Can someone pls help me","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Maybe, by creating a 32-bit VM of older Windows to install the driver and use a USB passthrough to connect. Otherwise, repartition the drive to dual boot the older Windows correctly. The Intel driver should mention which Windows version it's supposed to work with.","Yes"],"points":0},{"text":["Computer has significant water damage, need it for school and not sure how to move forward.","Unfortunately, you stand quite a low chance of making that computer work again. If this ever happens to you again, step 1 is turn it off and leave it for several days, somewhere warm. You have turned your computer on while water was inside of it, causing the electronics to short out, it is likely not repairable, and will likely get worse.I would take it to a repair shop for an opinion, but they will likely say the same. Sorry for your loss."],"points":0},{"text":["Hum/Buzz/Whine noise coming from adapter of aquarium light"],"points":0},{"text":["G15 overheating (kinda)"],"points":0},{"text":["How do I run an old PC Disk game on a new PC","Buy a portable DVD drive?"],"points":0},{"text":["Access IP camera on private network - without pass?","Google the brand and model and hope that they didn't change the default details"],"points":0},{"text":["No Desktop Audio while on Whatsapp call","The speaker icon by the clock (bottom right corner) right click on the speaker icon and click on Sound.Under communications Tab, is Mute all other Sounds checked? On mine i have Do Nothing checked."],"points":0},{"text":["Memory card problem .","You likely bought a fake/refurbished card. The random disconnect is because as the phone send read/write request, the cheap controller in the card get overwhelmed while waiting for the slow (dying) cells. Early on it wasn't a problem because it can prioritize using the still good cells.A recovery service may be able to extract some of the data, but they're quite expensive."],"points":1},{"text":["blue screen issue","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["WD HDD Unlocked not appearing"],"points":0},{"text":["Laptop disconnecting from WiFi"],"points":0},{"text":["Opening a custom feed"],"points":0},{"text":["Someone please help my PC keeps randomly diverting pretty much ALL of its power to my fans","Check route thermal paste","It's not diverting power to your fans. Does it shut down or just back screen. Does it come back again after a while when it black screens ?","What is your power supply? Sounds like you might not have a powerful enough one to power your system under load"],"points":1},{"text":["Closed and deactivated non-stop!","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["What is a usb splitter cable?","Can you describe what you're actually trying to do? We can't help you if you're requesting some vague device that doesn't actually exist because USB doesn't work that way. What are you trying to do that you want to control two \"consoles\" at a time? What console is it? What are you doing on the console?"],"points":1},{"text":["So uh.... I did an oopsie.","The correct solution is reimaging, so no problems there.It sounds like you've taken good steps for better security. I'd triple check email accounts' (all email accounts) authenticator devices registered to your accounts, ensure emails passwords changed. Make sure that another person hasn't added their own 2fa method to your account essentially.If you use a password manager, of course, change your master password, and verify/review known authenticator devices added to your account.Then think about every website, game, software, account you've ever logged into. Look at old emails, search \"sign-up\", \"verify\", \"account\" keywords into your email to find emails showing accounts you've signed up for, and change passwords there, if you really want to take it seriously.There is a software by Nirsoft called webbrowserpassview, and chromepassview etc. and if you save passwords to your browser, this software can extract your passwords. If you booted your system with a portable windows and ran this software, you could locate your Chrome/browser appdata and find any saved passwords in your browser, and review what might have been stolen.If your computer is infected, assume the malware ran this same software, to extract your saved passwords from your browsers. This trick does not even need admin permissions to run, which is why I recommend a password manager, and not saving browser passwords.","can't reboot photovirus listEdited for spacing in between the two links, they looked like one link.","wow dude. Depends on many things. For basic computering, I would set up bootable Linux Tails flash-drive until it's possible to do a clean install windows."],"points":8},{"text":["What happened to Samsung Data Migration Tool?"],"points":0},{"text":["Pc help"],"points":0},{"text":["PC shuts down after hours of running fine and RGB RAM still glowing","Yes, it's pretty likely your PSU broke.When one of a PSUs safeties gets triggered (UVP, OVP, OTP, OCP), it usually turns off and won't turn back on until its fully power cycled.Make sure you replace the modular cables if you get a new PSU from a different brand or get a different model. Modular cables aren't standardized and aren't interchangeable between PSU brands and sometimes different models from the same brand."],"points":0},{"text":["What the hell just happened with Microsoft troubleshoot","They essentially reinstalled windows","As far as I know, Microsoft doesn't have support technicians that work directly with non-enterprise end users. Who exactly did you let into your computer?","I used to work for Microsoft 365 Support. Different department to windows support, but we were not allowed to use remote access through quick assist, only to direct users while watching their screen. Its probably just a difference in department policy but make sure they didn't do anything fishy. Does also seem like a massive jump in troubleshooting steps, quite a few things they could have tried in-between (depending on what the original steps were)."],"points":0},{"text":["How to use a new driver with an old graphics card?","The latest driver for this card is 474.64.If that isn't good enough then you'll have to buy a newer card.","You download the driver.You install the driverAnd surely you tried that, and it didn't work, but what happened? What errors did you encounter, what problems occurred?"],"points":1},{"text":["Transparent Blue Screen","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","BattlEye (BEDaisy) crashed. Try updating it to the latest version.Also, if your RAM is set to 6000 MT/s it might cause problems. Only up to 5200 is supported with two modules (3600 with four). If your system is crashing in something other than BattlEye you may have to look into that. BattlEye unfortunately is infamous for its bad stability."],"points":1},{"text":["Computer freezing and screen glitching (see photo)","I remember Bonzi Buddy, that thing had so much malware.Might need to do a clean install of GPU driver. If you have Nvidia driver you can do that easy by downloading last driver, while installing it don't do express install, you should see a box to check to do a clean install.Are you able to see inside the case to see if CPU and GPU fans are working. Does your case have a tamper seal on it to prevent you from taking side cover off to see if fans are working and GPU and RAM is seated correctly."],"points":0},{"text":["ASRock Pro RS/D4 won't reboot.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Is it normal for my Ryzen 5 7600 to be at 100% CPU usage?","Not really, in Task Manager, which apps are using the CPU? It should break it down in terms of which processes are using which % of CPU. If the game is using the full 100% then I would say this is an optimization issue on the games part. You should try updating all of your drivers and installing Windows Updates though.","Not really. What resolution? I can play BG3 and put on YouTube or whatever, at 1080p I never max out my CPU. And I've only got a r5 3600."],"points":0},{"text":["Can't get Steam key from HRKGame","I dont think anyone here would be able to help you. I think you gotta either continue to try to get in touch with support and if they still dont answer then do a chargeback.Try a different browser and make sure your adblocker isnt causing page issues."],"points":0},{"text":["Gaming Pc shuts off randomly when playing specific games","Try downloading HWMonitor, run the game for a few minutes, close it and check the CPU temperature. Usually a PC shutting off with no other warnings/symptoms is either power or temperature related. Your power supply should be fine though based on your other specs.","Whens the last time you used a can of air to blow the dust out. When using can of air, don't let the fans spin while blowing dust out."],"points":0},{"text":["How do I fix this?","Was the original one in 3?"],"points":0},{"text":["System reserved taking up 50% of RAM","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","It seems to be common in windows 11 to sit on a lot of ram usage and pre load stuff into it for lack of better terms. If you google high ram usage windows 11 there’s some pretty good comments out there on Reddit and other forums explaining it better then I ever could. I’m 99% sure nothings wrong with your pc cause mine does the same but all my games run fine and win 11 just frees up ram when applications need it.","Sounds like you have a bunch of memory mapped to an integrated video card.","[deleted]","Here are a few suggestions:Ensure your RAM is compatible with your motherboard and Windows 11 by checking the motherboard's qualified vendor list.Try re-seating the RAM sticks or testing them in different slots.Look for any additional Windows updates or patches that might fix compatibility issues.Investigate Windows memory allocation settings to see if adjustments can be made.If the issue remains unresolved, you might consider rolling back to a previous Windows version to check if the problem is specific to Windows 11.","I think that means one ram module is not working","If you don't have an integrated iGPU, then, have you ever used a VM and forgot to turn it off? Also, check boot options. Right click on start - run - msconfig - boot - advanced options - uncheck everything here, save and reboot the pc.","Let Windows manage your RAM use. Anything up yo 100pc is normal. It's a resource,"],"points":4},{"text":["WiFi issues on windows 10 - no options coming up","Can you connect to the internet via Ethernet or a USB adapter? You probably need to update your drivers via Windows Update and/or the manufacturers downloads site for your device."],"points":0},{"text":["Job in US/CANADA","From where?","India"],"points":1},{"text":["Bluetooth cuts off when launching a game, every. time.","just wanted to add that it doesn't disconnect while doing ANYTHING else, just when i launch a game, or even have it sitting in the background while tabbed out"],"points":0},{"text":["Nvidia Update 551.23 problems","Have you tried reinstalling the older driver version? It seems counter-intuitive but if it fixes your problem, I would just wait until they release their next update, then you can try again.","Not even sure what the previous version was, 551.22?"],"points":0},{"text":["really confused about this","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","does your pc say it’s actually connected to wifi or does it say connected but no internet, and what message pops up when trying to go to the websites"],"points":0},{"text":["Acer aspire laptop help","So it dosn't turn on? If it has a removable battery, try removing it, holding down the power button for around 20 seconds, re-insert then try again."],"points":0},{"text":["Just bought a new computer, and I'm experiencing input lag on every game.","Have you checked Windows Update > Advanced > Optional Updates for any driver updates? Alternatively, go to the laptops product website and go to the Downloads page and grab all the most recent drivers - especially for firmware, keyboard, display etc.Also, are you running on the High Performance power plan while gaming?"],"points":0},{"text":["GPU always crashing","Your video card model?Have you overclocked it?","Have you checked game reviews or searching the web for the games your having issues with to see if it's a known issue? Not all games are going to be compatible/optimized for all GPU's. As the other commenter asked, which GPU do you have?","What about power supply? Even if it is high enough wattage to power everything in your PC at once, the cheaper ones sometimes don’t put out a consistent voltage. I was in that position once, the voltage would randomly drop to the card with a similar outcome to what you’re experiencing. Screen would go black, PC would hang.Solution was to get a better/higher quality power supply."],"points":0},{"text":["I can't find Ddr5 laptop ram, specially 8GB version.","I just searched for it on Google and results came up for both Crucial 8gb and Kingston Fury Impact 8gb DDR5 SODIMM. Are you saying that they’re just out of stock everywhere? I could be misunderstanding something. I don’t know much about laptop RAM."],"points":0},{"text":["How do i fix my laptop?","Does the laptop have a removable battery? If so, try removing it, holding down the power button for around 20 seconds or so (with AC unplugged as well), reconnecting the battery then try again.Some laptops have a reset button inside a small hole on the back which does the same thing, but it depends on which kind of laptop you have."],"points":0},{"text":["Trying to uninstall Riot Client","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Did you see if it’s running in the background of task manager? Did you check “add or remove programs?” Or in the list of programs in control panel?","No.. there are files somewhere. You should be able to delete it from that list if I remember correctly."],"points":0},{"text":["Computer Crashing no matter what I do","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","You only had one dump file?"],"points":0},{"text":["My laptop is showing only c drive not other d e drives","first open disk/partition manager and see if they show there","Then open bios to make sure their lanes are open.","So they were there and are not now? Do you have two drives or partitions?Does your laptop have an optical drive?","use CMD . type diskutil. then type list disk, then SEL disk 0, then list part. now here you need to select the 200gb partition. so you do SEL part 1 or 2 or 3 depending on what it shows. after the message partition (number) is selected you type assign and press return.you now should be able to see the partition in my PC."],"points":0},{"text":["every time i try to uninstall mcafee from the windows control panel, a popup comes up that won't let me","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Do you know how to check/change your display scaling? It sounds like maybe McAfee isn't rendering properly given your current scaling settings. Make sure it's at 100% and not 125%, 150% etc.Also, if you have a high resolution display, try lowering it temporarily to say 1080p. Once you've done this, retry - you may have to sign out and back in for the scaling settings to properly apply though.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":1},{"text":["Headphones not unmuting in settings.","Just restarted computer and everything seems to be working now."],"points":0},{"text":["Mouse cursor forcing itself on a certain point on the screen"],"points":0},{"text":["help me to solve a problem with my keyboard!","Not sure if you're aware or whether it's part of the problem, but PS2 devices need to be connected before you turn the device on. So reconnecting it while the system is still on might not work. Make sure the device is properly shut down before reconnecting it.","My old PS/2 keyboard died. Had to get another one. Have you tried other keyboards?","The computer may be happy with a usb keyboard ..","It was my problem to Try to use keyboard in bios if it work after that computer can use keyboard in windows If it not works I should know your windows version"],"points":1},{"text":["Internet Disconnecting"],"points":0},{"text":["How to…","Use KVM-switch.Just one example.https://www.amazon.com/Switches-GREATHTEK-Devices-Computers-Keyboard/dp/B0BWRZPXFY/ref=sr_1_3?keywords=KVM+Switches&s=pc&sr=1-3"],"points":0},{"text":["Problem with Windows defender","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Is the file stuck in your recycle bin? If so, try booting into Safe Mode to delete it permanently."],"points":0},{"text":["Recovering Data From Old Ipod"],"points":0},{"text":["Install windows failure","Boot back into the installation USB, delete the disk partitions which were previously created and start again."],"points":0},{"text":["Is there a way to track a phones location using just it's phone number?","Technically yes, the phone location can be located via cell tower triangulation (The cell signal between the three closest cell towers). In saying this, there's no way for a phone owner to find their phone through this technique and even if they could, the location would only be approximate.Your best bet would be retracing your steps and calling the phone in hopes you will eventually hear it before it runs out of battery."],"points":0},{"text":["Amazon fire HD 10 (11th Gen) issues"],"points":0},{"text":["Black screen flickering"],"points":0},{"text":["Specific Devices on my network will not connect to specific websites.","Which websites are they? Do they work in Incognito/private tabs? Do you have Random Hardware Address enabled in your device settings for the wireless network?"],"points":0},{"text":["Pc turns on, no display, then resets"],"points":0},{"text":["Corrupted WAV Files"],"points":0},{"text":["Son building a PC and it's not turning on","Is there RAM in it?","Light flashing is a way the computer is trying to tell you error codes when it can’t display anything look at the light count how many flashes and what color they are and look up the motherboard it will tell you the issue","make sure all power connectors on the motherboard are connected to the power supply...the motherboard manual will show you where they are...good luck"],"points":0},{"text":["Updating bios via flash","If you are planning to use q-flash you only need the bios file, the efi application is just a different way to flash the bios. It's not really a big deal if they all end up on the flash drive anyway."],"points":1},{"text":["Can iPads get malware?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","I mean there's always the possibility that the most recent software update has a vulnerability and could be exploited. However, as long as Apple remains aware of the current threat landscape and you trust that their updates are keeping your device secure, then no, Apple does not intentionally allow malware (or any software at all) to install itself or run on your device via links on the web.The closest thing would be a fake ad that opens the official App Store on your device to a page for a dodgy app and you are tricked into purchasing or downloading an app that you don't want/need.","There are plenty of attack vectors on these devices (apple), but they are usually patched and updated frequently. If the device is kept updated, and you are not using apps downloaded from the internet, instead of the store, you should be pretty fine. The risk of malware on iOS devices is pretty low, but not impossible.Just an example of the regular zero-day attacks that target iOS devices, https://www.malwarebytes.com/blog/news/2024/01/update-now-apple-releases-patch-for-zero-day-vulnerability","Everything is vulnerable in ways we don’t know yet. For example, iOS 16 is considered insecure now. iOS 16.7 is the same now as it was when it was released, why is it now insecure? It didn’t change, but the flaws were found over time. So key is run updates","Unless you go out of your way to approve permission and certificates, nope.","It's not impossible but it doesn't happen often that's why people think ios is invulnerable to viruses and malware","Yeah, don't click on weird links on mommy's iPad, understood, Timmy?","Of course, it is possible to get malware but unless you're running a jailbroken device, nothing will happen because, as far as I know, the programs in iOS run in separate instances, so malware in one instance won't affect another part of the OS.Anydesk malware sessions given to strangers are, of course, another story. And as others have already said, keeping the OS up to date will minimize the security loopholes.","Thanks for the help everyone, I was a bit anxious"],"points":4},{"text":["Go Pro"],"points":0},{"text":["Desktop turns off with burning smell and new PSU doesn’t fix problem","Can’t edit the post for some reason so I’m adding this detail here: The fan and fan light turn on for about a second or two and then turn off rather instantly turning off after turning on for a split second. The fan doesn’t get enough time to reach full speed and makes little to sound due to this."],"points":0},{"text":["Do samsung A13 phones just eventually stop working","Any thrown phone can fail later. Nothing more needs to be told.","It's not about budget phones, even the most expensive phones will break if you keep throwing them around. Get a rugged phone or case for your next phone.","It's the internals. Maybe some components were loose and fell off."],"points":2},{"text":["Getting unplayable extreme low fps only on some games GTX 1060"],"points":0},{"text":["Weird inconsistencies with my Network","Do you have access/control of your router? It seems like there is some QoS (Quality of service) running which dynamically allocates bandwidth to specific devices or applications based on rules and/or the current load based on the usage of other devices on your network.For example, a common QoS rule could be to increase the priority of video streaming, and decrease the priority of online games."],"points":0},{"text":["Laptop got stuck in infinite boot loop.","Unplug it from power and hold down the power button for about a minute. Plug it back up and turn it on. If you can get into BIOS, that means it’s trying to POST. Hit F11 or F12 and see if you can get into one of those. Then reboot.","Reseating memory can sometimes fix random startup issues, also, reset cmos/bios (unplug mb battery30secs)?"],"points":0},{"text":["pc crashing because of nvlddmkm.sys (RTX 3060)"],"points":0},{"text":["iCloud logged out but photos still visible.","If you have actually signed out of iCloud, you can just delete the photos, they will be removed from the device but won't be removed from your iCloud account."],"points":0},{"text":["Software issue or an RMA? Help me figure it out please!","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Can't figure out if I have SSD on this laptop or not","You have an SSD. There is no folder, it's the entire C drive.","You have an SSD. In the Task Manager view is says Disk 0 C:\\ SSD.","There is no SSD \"section\" of the hard drive. The type of the hard drive is an SSD. The entire drive, with every single file on it, will be faster then a regular non-SSD hard drive. The files don't need to be in any specific folder to be fast."],"points":4},{"text":["Bluetooth Handsfree Telephony cannot be selected again"],"points":0},{"text":["Can't get emoji to work after a reinstall"],"points":0},{"text":["Windows 10 lagging"],"points":0},{"text":["im not sure what to title this, this is my first time using reddit","If you will get a new phone, you could get a usbx to USB/HDMI hub Then connect a nouse to your phone and connect it to a monitor/tv","If you will get a new phone, you could get a usbx to USB/HDMI hub Then connect a nouse to your phone and connect it to a monitor/tv"],"points":0},{"text":["How to?"],"points":0},{"text":["Why does my computer keep waking from Sleep mode and going unresponsive? (Wake timers are disabled)","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Sudden green/pink streaks","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Sounds like a similar issue to what I’m having. I have Windows 10 on an HP laptop I bought in early 2019 and the screen flickering + auto restart has been persistently occurring the past few days. Not sure how to remedy the situation. Already uninstalled the display adapter driver in safe mode but that didn’t seem to rectify the issue…"],"points":0},{"text":["Acer Nitro 5 BSOD within anywhere from seconds to 2-3 minutes of startup.","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Storage or RAM. If it has multiple RAM sticks, try installing Windows with one stick installed at a time. If both sticks cause crashes I would suspect the storage.If you have a 6000 series CPU it should be in warranty so not sure how much you want to do with this instead of just returning it on the warranty."],"points":0},{"text":["Help finding datasheet for low end black Friday special HP laptop","The generic series based service manual does mention a 4gb and 8gb module, but it's a series manual after all and not one specific to a particular model.https://support.hp.com/us-en/product/setup-user-guides/hp-laptop-pc-14-d2000/model/38322790?sku=66C75UA"],"points":1},{"text":["Micro Stuttering"],"points":0},{"text":["BSOD: Power State Failure","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Need the dump files."],"points":0},{"text":["Was trying to repair windows but now my pc won’t do anything","Let’s take it back to the start and have some order in your post. Please edit and cleanup.You were running windows repair by what happened?You tried to boot from USB but you don’t have “anything”When you power on do you hear a built in self test which is usually a “beep” after you turn it on?Do you have a graphics options on your motherboard? You may have it set to something other than your graphics card. It could also be a cable problem."],"points":1},{"text":["Please explain Disk use in Task Manager to me","I have no idea how to format this post correctly. There is supposed to be a space between each line. But every time I edit the post and add another space, it just goes back to being no spaces between each line. Sorry if this isn't arranged correctly on phone.On my screen, I literally had TWO spaces between each line, but when I submit the post, there are no spaces between each line.","The percentages are active time, the MB/s are transfer rate. Disk, especially SSDs, can transfer hundreds to gigabytes per seconds, but processing a queue of requests can take its entire capacity even if the total transfer is small. Think of it like a library. In theory an entire class can walk out the door each with an armful of books in a minute, but someone asking for a collection of unrelated books can still keep the librarian busy for minutes even if they just end up checking out five books."],"points":2},{"text":["File size Not showing in File Explorer","Those are folders. Use Tree Size Free for that."],"points":0},{"text":["I can't get rid of this spyware","Letting your kids on the work computer isn't the smartest idea.Reset the notification settings and see if adw cleaner find something.And additionaly I would delete the cache."],"points":0},{"text":["A full Malwarebytes scan that normally takes several hours on my laptop took only a few minutes just now. Why is this, and could this be a sign of something wrong?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Way to less information.But it sounds like you got logged in with a temp profile.This could indicate a system problem.Just check if it happens again. And if you find error codes in the event viewer.And if you did a quick scan it is always fast."],"points":0},{"text":["Intel 14700K Problem"],"points":0},{"text":["Drivers being removed","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["PC hard crashing when idle/low usage, but works normally when under heavy load","I even tried the solutions others found like disabling PBO and CPB. I even tried increasing the DRAM voltage as suggested but nothing worked so far"],"points":0},{"text":["Is it safe to turn off my laptop?","You can turn it off fine. If it continues not to work, go back into bios and disable what you enabled."],"points":0},{"text":["PC randomly loses connection for a few seconds"],"points":0},{"text":["is it safe to edit Hosts.txt file just to block website like twtter","It's safe but inefficient. The best way is to manipulate the DNS for your network to yeet the requests, but hosts would work","Honestly, I think you shouldn’t be editing the host file if you don’t understand what you are doing. I’d recommend the same thing for copying scripts off Reddit.Run PowerShell as Administrator before executing this script$websiteToBlock = \"www.twitter.com\" $hostsFilePath = \"C:\\Windows\\System32\\drivers\\etc\\hosts\"Check if the website is already blocked$hostsFileContent = Get-Content $hostsFilePath if ($hostsFileContent -notcontains \"127.0.0.1t$websiteToBlock\") { # Append blocking rule to hosts file Add-Content -Path $hostsFilePath -Value \"127.0.0.1t$websiteToBlock\" Write-Host \"Website $websiteToBlock is now blocked.\" } else { Write-Host \"Website $websiteToBlock is already blocked.\" }"],"points":1},{"text":["Gigabyte B650 X AX rev 1.4 issues","I have the same board but rev1.2 and it's working without any issues from day one (August 9th)"],"points":0},{"text":["Internet problems","Does your house have an attic or crawl space. If so it's possible to run a cat6 cable from one side of the house to the other. If you don't feel like doing it, hire someone who install IP camera systems, they run cat6 wires in attics all the time."],"points":0},{"text":["Spilled iced americano on Asus strix 17"],"points":0},{"text":["keyboard making other keys work along with original key"],"points":0},{"text":["Can someone help me out please?","I am sorry for being asinine here and not directly answering you questions. But in the future if you are in need of Ethernet ports your best bet is to get a $15-20 network switch like this or simmilar and extra Ethernet cable in your required length.As for your adapter... It is connecting but it is losing connection intermittently? Check to make sure that there is decent 'line of sight' between the wireless antenna and your router. If there is lots of junk and walls between the two it will impact connectivity. If the adapter is plugged into the back of the computer can you move it to a top or front port if any are available?"],"points":0},{"text":["Random pops up while gaming"],"points":0},{"text":["Why does my search activity in my Google products not show up anymore?"],"points":0},{"text":["USB Devices Shutting off and causing bugs in-game while using UE5","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["help w my samsung tv"],"points":0},{"text":["Windows or Linux?","Get one with windows.If you don't like it you can always install Linux","If you have to ask, Windows. Only those who already know Linux are even prepared to start the journey of trying to make games and editing apps work on Linux.","install both but some games and software designed for windows just wont work properly on linux. depends on what software youre using","Get windows, boot linux up from a drive and try it out if you want to. If you like it better, install it.(Or try a VM)","I think you’re asking the wrong operating system. You mean windows or macOS. That depends on the games that you are playing, and if art and video editing are as important as gaming. If you have the money, the Apple M3 Max 16 outperforms the i9-14900K in benchmark."],"points":16},{"text":["Repair Bluetooth headphones"],"points":0},{"text":["Old LG TV giving \"no signal\" error"],"points":0},{"text":["Anyone know how to make battery life better on Windows?","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","https://h30434.www3.hp.com/t5/Notebooks-Archive-Read-Only/Spectre-X360-How-to-Optimize-Prolong-Battery-Health/td-p/5291363","2018 would need a new battery.But do read https://h30434.www3.hp.com/t5/Notebooks-Archive-Read-Only/Spectre-x360-Battery-Life/m-p/5549232/highlight/true#M2684298 and try that.","It's old. That's to be expected. Unless you're willing to replace the battery, nothing else to do."],"points":3},{"text":["Can you pair an old cellphone to a smartphone?","You can use call forwarding, but text forwarding will require an app running on your phone and likely can't work the other way without modifying what you're trying to send (ie, you need to include the recipient number in the message)","Not possible"],"points":0},{"text":["HP Notebook 14 Laptop Issue - Screen Scrambling"],"points":0},{"text":["Are you suppose to keep charging phone?","The best practice is to maintain the charge between ~30% to ~80%, there's no exact number since the real capacity and how your phone handles charging speed differs. If you often use battery-draining apps then it doesn't really matter, just keep it charged when you're using those apps, since you also want to reduce the charging cycle. No need to overthink it, by the time you want a replacement you're likely already considering another phone anyway, if not, battery replacement isn't that expensive to be worth fussing about every day.","Just keep it switched off all the time & the battery will stay above 90% until you charge it again."],"points":2},{"text":["Outlook move email button grayed out"],"points":0},{"text":["RAM issue","If Windows \"couldn't access the memory\" it would not boot to Windows at all. Have you tried removing two of the sticks so you only have one set of dual channel DIMMs, and have you tried using the old RAM?"],"points":0},{"text":["Colors washed out and pixelated with nvidia drivers"],"points":0},{"text":["Potential PSU or MOBO issue?"],"points":0},{"text":["PS5 USB port broken","Took it to a repair shop and the got your PS5 with a broken USB port?Go back to the store and tell them about that, maybe you received a different PS5 or maybe they broke the USB port.This time check that everything works there."],"points":0},{"text":["My taskbar is buggy"],"points":0},{"text":["I am trying to play games on my pc, and everytime i alt + tab or put a game in borderless/windowed my screen goes almost entirely black. When i go back to the game while it is fullscreened it is fixed.","Need better explanation about the problem because the way you described it I do not see any problem.Switching from fullscreen* not borderless/window mode the screen goes completely black is a Windows thing."],"points":0},{"text":["Need Pc Help Please"],"points":0},{"text":["I have a problem with pc but I cannot understand where it is coming from !!","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Try the built-in reliability monitor, in english it should be found by the name \"view reliability history\" and see if that gives any indications. While you're at it run the memory diagnostic too and if you're blue screening give nirsoft's BlueScreenView a try.Failing that start by removing the GPU and just running integrated graphics, then removing all but one ram stick(and trying multiple ones). If still crashing it's time for swapping hardware, probably starting with the PSU or just letting a repair shop find the problematic part."],"points":0},{"text":["Need Helppp!","Either do trial and error. With the repair programsReset to a previous pointOr plug it into another pc and safe the files and re install windows."],"points":2},{"text":["Wifi adapter broken?","Must be drivers uninstall it from device manager and reboot windows will load the generic driver for the card."],"points":0},{"text":["Red CPU light after swapping GPU"],"points":0},{"text":["Super micro H11dsi-nt Version 2 Issue"],"points":0},{"text":["toshiba canvio basics portable hard drive - detecting but not accessible","So good news and bad news, the hard drive itself is fine but what probably happened here is that the hard drive was formated for use as storage for the console.This is basically the same as tipp-ex'ing an entire paper, the old data is still there underneath but marked as \"good to write here\". Unfortunately any data overwritten is hard to restore but still may be possible to recreate.This is not an job for an amateur or your regular pc repair shop. If the files really are important you need to send your drive to a data recovery specialty company which is not cheap but many offers free or really inexpensive quotes.While it may not help you now, in the future remember that all real important files needs to exist in triple; one on your computer, one on a local backup and one in a remote offsite backup."],"points":0},{"text":["Samsung 870 EVO SSD will not power up when connected to HD cables."],"points":0},{"text":["Restart Cycle after system reset"],"points":0},{"text":["Help me, oh wise ones: Old game (Football manager 2012) crashing on game setup","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Did you try running a sfc scan or dism scan?","The file sharing service you used deletes the file after one download so I'd recommend using one of the providers in the AutoModerator reply if you want more people to have a look.edit: Make that the AutoModerator reply as seen in this post."],"points":0},{"text":["Phone audio doesn't work?"],"points":0},{"text":["Legion 5 Pro Boot Problem"],"points":0},{"text":["Problem with dual monitors"],"points":0},{"text":["Windows Computer Crashing","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Memory Diagnostic"],"points":0},{"text":["100°C on i9-9900KF","This might sound stupid, but can you turn your AIO on its head/shake it a bit?Sometimes this releases air bubbles, which could hinder the heat spreading to the water.Other than that, a thermalright peerless assassin air cooler is pretty cheap, and should be enough to cool the CPU (if you're not overclocking it).","I've heard people fixed their issues by turning the PC upside down as a whole. Shaking the head (the thing that's attached to the cpu) gently can also work.Please do it gently. Please don't shake your entire PC :)","You can get what you want. You just need to make sure that it fits in the socket of your Mainboard and in the case."],"points":0},{"text":["HP Laptop - 17-ca2096nr bios"],"points":0},{"text":["Google Auth Issues","If you had the newest version and connected your Google account with it it automatically backuped to the cloud.If not than you're out of luck."],"points":0},{"text":["RTX 2060 jerky slowdown of a fan"],"points":0},{"text":["Game testing drive issues"],"points":0},{"text":["My phone is duping the screen and it looks as it was broken"],"points":0},{"text":["Something is f**** with my new 4k monitors but I can’t figure out what"],"points":0},{"text":["I'm not sure what I need to do for my PC","Never tried Steam link but try this, or get yourself to this post and lets try to work this out.Disconnect your internet cable or wifi usb and restart your computer."],"points":0},{"text":["PSU Relay Clicking After Underload"],"points":0},{"text":["Keep getting 2 different BSOD","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","It's crashing on the same function every time in the five that are the same (Functions are almost like commands). The process involved is svchost.exe which hosts services. This is fairly common to see because the developer might not want to commit resources to fully creating a service so they let svchost do most of the work and just focus on coding the stuff they need. This is usually done for smaller stuff, you wouldn't see a big company like Nvidia doing this. The problem is that if that's the case here, that the service it's hosting is causing the issue, we have no way of knowing which service is causing the issue.Five of them looked like that, the last one looked like memory corruption. With memory corruption it's usually pretty random which driver is blamed because it just lists the driver that had data corrupted. The only interesting thing here is that it was HP Omen Light Studio. Several of the common RGB tools are well known for causing memory corruption because of some bad dll file they all use so it's possible that's what happened there (I'm assuming it's a dll file they have in common because it's hard to imagine that so many RGB tools are that crap).I don't really have any good advice for what to do here. It's probably some program that has a service running causing the issue, but I have no idea how to determine which program that is. If I had to take a shot in the dark, I would uninstall all the stuff from HP. All software that was preinstalled or installed from HP's website."],"points":0},{"text":["Start menu flashing when opening apps"],"points":0},{"text":["Monitor issues?"],"points":0},{"text":["I want to convert from hdd to ssd","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Clone the drive.https://www.seagate.com/support/kb/cloning-a-desktop-hd-how-to-perform-a-clone-in-windows-with-discwizard-007716en/"],"points":1},{"text":["Keyboard tying numbers in between letters, ple3ase3 he3lp i8t5s go9i8ng cr4azy6","You'd need undo \"coffee (going) on my keyboard accidentally\". That involves cleaning the coffee from all internal parts.","Man I love this thread","l3ol. Ge8t a8n ex5tern7l U2SB k3yb0ard.","Coffee is the clue here. Such can create all sorts of mayhem.Which Apple? Some of them the keyboard replacement is easy, some are so bad you wonder who designed it.","Why not keep it? After I read a couple of sentences you wrote I just automatically skip the numbers you type in those words. Replace the keyboard, go to the repair shop if you can't do it yourself.","took the L and bought a new keyboard :-(going to make magnets out of the key caps of my old one RIP 2013-2024"],"points":14},{"text":["Intel arc a770 drivers fail to instal"],"points":0},{"text":["My laptop won’t unscrew","We can't help with that."],"points":0},{"text":["External SSD not showing up on my computer.","Maybe the card reader doesn't support high capacity SD cards.SD cards are using different protocols even if they have the same format and connector and are therefore not distinguishable from the outside. These protocols depend on the size of the cardFor example SDXC"],"points":0},{"text":["WHAT?! I CANT HEAR YOU","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Maybe the button can only be activated with other combinations like Fn?"],"points":1},{"text":["How can I get rid of this annoying fake virus adware!","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","To be safe id just reset windows its a quick and painless built in process and then you dont have to worry anymore","This https://youtu.be/Xd_z8LOteN0?si=-VCYRXhmZwa4q2MB"],"points":2},{"text":["Unknown number sim"],"points":0},{"text":["Bitdefender free and malwarebytes premium","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","WhyNotBoth.gif"],"points":0},{"text":["Laptop docking station Trouble"],"points":0},{"text":["My PC turns on but doesn't respond to any usb/hdmi cables"],"points":0},{"text":["Windows only recognize half my installed RAM as usable.","My 1 cent thought: mobo defective on the ram connectors","Well, its not seeing the 2nd ram.Try them individually.If the are both working individually,reseat the cpu .Could be contamination in the ram socket.Try setting slower ram settingsAlso the ram type is more than speed and brand.. what model ram sticks did you try.."],"points":0},{"text":["Bad quality of microphone after it dropped"],"points":0},{"text":["Disk Partition Software","A live USB of Mint or Ubuntu definitely can repartition your SSD."],"points":0},{"text":["Flashing lights while playing 3D games"],"points":0},{"text":["GZ file in appdata temp folder?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","What was the name/identifier of the malware they detected? You can do a search on the specific identifier to determine why it is seen a malicious..gz is another file compression just like .zip. Most likely it isn't the file itself that is malicious, but something contained inside (Anti-Virus will attempt to scan the contents of compressed files/folders, a common method that malicious actors used to use, put a virus in a Zip, as anti-virus wouldn't scan inside of Zips)"],"points":1},{"text":["Help: CHKDSK Question","I usually do a chkdsk /f before trying an r with the r flag it could take hours or days in your case but its already at stage 4 might as well let it finish"],"points":1},{"text":["Cloned a drive, the storage is reduced","Have you tried a third-party partition manager? If you can't find any Windows freeware, a bootable Mint/Ubuntu has its own partition manager you can use without actually installing the OS itself."],"points":1},{"text":["How do I get my laptop off the black HP loading logo.","\" Did you try turning it off then back on or unplugging it and plugging it back in? \""],"points":1},{"text":["I can hear through my mic but I can't speak."],"points":0},{"text":["Question about my graphics card","Recommendations is usually for decent resolutions, minimum is for potato res. You can get smooth movement with potato res, and maybe with better res but disabling most of the effects and details."],"points":0},{"text":["so apperently my computer has an ssd it never told me about?","Can you see it in Disk Management?","I would suggest physically looking. That's the best way to confirm it actually even exists.","Check disk management","Are we talking pc or laptop? You should check physicaly, maybe its a sata disk without properly connected power cable","Open an elevated command prompt or Powershell (search either in Start menu and righ click to open as Admin).Type:.\\DiskpartthenList DiskIf your unknown SSD shows in the list, type:Select Disk 1Change the number to whatever the unknown drive is labelled in the list.Once you have the unknown drive marked as selected, type:Online DiskPeople are suggesting Disk Management but there are reasons why a Disk won't show there and will in DiskPart so try that. Just be careful cos it's a lot easier to permanently fuck something up in DiskPart compared to the normal and relatively safe Windows environment.Will look something like this."],"points":6},{"text":["YouTube Error","Try it in incognito. If it works, clear your cookies."],"points":1},{"text":["Question for having a friend over"],"points":0},{"text":["Is there a weird way to unlock my pattern?","From many prior answers this seems to be where you take it to be repaired so you can unlock to backup what you forgot to backup.Or if there is nothing to backup, then is it worth fixing?"],"points":1},{"text":["Router not working","If you are having issues with port forwarding checkout this wiki article.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Go to spectrum and ask for a replacement they will let you do that even if it’s not broken","Factory reset....boom done"],"points":1},{"text":["Am I being booted offline?","Have you restarted your router or modem?"],"points":0},{"text":["NVMe compatibility with PCIe 2.0"],"points":0},{"text":["Microsoft Visuals uninstall and reinstall","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Have you tried restarting your computer"],"points":1},{"text":["SUper low storage.","Im willing to share pictures if needed.","Use Tree Size Free to figure out what is using all those space","You can use windirstat to see whats taking up space."],"points":0},{"text":["Desktop won't POST","Update: Just tried swapping power supplies with the same result."],"points":0},{"text":["Purple tint in games"],"points":0},{"text":["HDMI detecting, but not displaying"],"points":0},{"text":["How to get calls on 2 phones?"],"points":0},{"text":["Font color is merged with the background after reinstalling my trading terminal.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["explorer.exe crashes at least once or twice a week","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Is my GPU dead?","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Samsung tv please help"],"points":0},{"text":["Solving a problem for my M.2 SSD"],"points":0},{"text":["Windows 11 Keeps Freezing after a couple of mins.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["installing windows on wrong partition","Delete all partions and start fresh"],"points":2},{"text":["My microsoft store doesn't work, I think it's uninstalled somehow","Have you tried reinstalling the store through powershell?"],"points":0},{"text":["Can’t connect to WiFi after using a boot drive (WiFi driver?)"],"points":0},{"text":["PC randomly turns off and restarts when I play a game"],"points":0},{"text":["Does anyone know of any hardware solution device that has physical task manager buttons to end processes maybe like a steam deck or programmable extra button accessory that's USB that I can setup to end google chrome or a memory hungry app or game with one click?","Problem you’ll run into is if a normal hotkey combo won’t work cuz laggy then an external kill switch will hit the same snags.","Closest I could find is https://damogranlabs.com/2020/05/custom-usb-shortcutter-with-stm32-ahk/Some assembly required.","You can just buy a $7 numpad on amazon and use something like autohotkey to program the buttons. As mentioned though if your PC is completely frozen it may not work."],"points":6},{"text":["Router is wall-mounted, how do I find the wifi info?","The internet is listed as part of the rent in several of the documents.Ask the landlord for the credentials. Not all routers put their default credentials on the back side, and credentials may have also been changed from default when it was setup. If it is included with your rent, just ask them for the password.","Depending on model your default gateway is on this https://setuprouter.com/router/icotera/ip-address.htm list. Type that address into your browser and see what comes up.default user name and password: adminIf they changed that call your landlord."],"points":0},{"text":["Stalking my internet browsing","You are missing a perfect opportunity to troll your brother.Start looking up how to eliminate family members, how to dispose of bodies, how to get away with crimes, how to create an alibi etc. Start \"watching\" true crime videos.Also where to buy hunting knives and bone saws.Then just randomly look at him, give him a smile for no reason and walk off repeatedly. Also walk up behind him quietly and say \"You would never survive in a slasher movie\"If he wants to play games, make it your game, not his.","You're probably just logged in to a browser somewhere and he sees the sync history.","If you are in the same household, I suspect he is either:a) Looking at logs in the router.b) Has a DNS server (for example PiHole), and set the router to use that DNS, then relying on your computer using the router's address for DNS.","can the brother log into your computer at all ?is your password quite complex or something like Pa$$w0rd1 like someone I know :)never hurts to change passwords now and then and scan pc for keyloggers","Lots of stuff going around this thread. Lots of people are mentioning wireshark, but failing to understand that all traffic to YouTube is encrypted with https so you can’t see anything.Your router logs won’t show the video you are watching at all, just that you were on YouTube.One, he probably just has access to your YouTube watch history. Change your YouTube password.Two if not that he probably has access to your browsing history.Three it is possible he has infected your computer with some serious malware that allows him to see everything. This is the least likely scenario.","It sounds like man in the middle, which seems to be possible and maybe even easier if you’re on the same network? https://security.stackexchange.com/questions/262793/is-https-insecure-against-mitm-attacks-and-is-there-a-solutionEdited to also add this thread: https://www.reddit.com/r/AskProgramming/s/b244MYHfkS","First easiest thought, if he has access to your PC he could check the browser history. Or Google search history if synced.If he has physical access to the router it's not too hard. Often the router itself offers tracking. This is most likely where he is doing it, look at the bottom of the router for log in info and find your MAC address. I'm sure you can see your history on there.If it doesn't there are other ways with little effort and router access, for example, this should allow you to use Wireshark to watch all router traffic. The wiki for wireshark talks more about options.However, I don't know you and your siblings. But I have two, I think your much better going from the mutual destruction / fuck you your being a dick approach and treating this as a relationship issue, not a tech support or I'll report you to feds issue.With my siblings probably go like,Hey, like, that's creepy. You know it's creepy right.Cool, okay, so remember when you stole $200 from Mom and blamed Dad on losing it? Look, I don't wanna rat you out and I don't want you being a cunt. Hack something else asshole.Look up annoying bullshit things that upset them for two weeks as testing, if sibling rats you out on watching Panty and Stocking or searching worst gift for siblings birthday or reading erotic Hamlet fanfiction or something then you end up getting to go to parents like sibling is being a wierdo. Stick to things that are not going to get parents to kill you but are mildly annoying.( Lesser extent, phone and data only for things you wanna hide rn )Look part of siblings is discovering the horrors and you both going I am not going to comment. Your brother is being immature and childish and needs to grow up before he sees something he doesn't want to see.","Your fucked if he can go to your pc there is no stopping it. It takes 5 sec to rat someone’s pc with a usb. I say you beat him up","Look to turn off your browsing history for Youtube. That's the most likely scenario here. He's not hacking anything, and with an https connection to youtube, he isn't sniffing your traffic to monitor you.This is a good habit for any website; sanitize, anonymize, and amp up your privacy settings for any site that shares data. For example, I could tell you your name right now because you have poor cyber hygiene.","pretty sure you just got hunter2’d","Keylogger seems likely, or he’s routing dns traffic through his dns server instead of the default provided by your ISP. Changing your DNS server to 8.8.8.8 will resolve the DNS tracking, if that’s indeed what he’s doing. Pull the IP of your DNS server, do a WHOIS and see if it’s correlated to your ISP. A thought, may not be so simple.","I bet you your YouTube watch history is public. Might want to check your settings, champ.","if you have ever logged into youtube on one of his devices, your previously watched videos will be easily accessible. youtube and Google accounts are the same linked accounts. go to your Google settings and log out everywhere, then change your password.","Check what DNS Server ist set in your Router, If its an IP in your Homenetwork, He setup a DNS Server and knows because of that... Check your Google Account, Google yourself without being logged in to See whats publicaly viewable","He could be monitoring your computer any number of ways. The most sure fire way to stop this would be to reformat your computer with Windows Pro to enable Bitlocker with a strong passphrase to prevent him access to your operating system or its files. You would then want to use a full tunnel VPN to do your web browsing which would prevent him access to your internet traffic. The final step would be to make sure he doesn’t plug in random USB dongles into your computer when you use it.Edit: He could have either tracking or a remote monitoring and management (RMM) software installed on your PC. Reformatting would wipe this. Bitlocker would prevent him using this attack surface again. He could be tracking your DNS logs or doing MiTM depending on how much access he has had with your computer to configure this. Wiping the OS and connecting to a VPN would close out this attack. There are USB dongles that can track information by just being plugged in. Making sure nothing random is plugged in fixes this security hole.I have RMM installed on all of my managed computers and both DNS and traffic inspecting programs on my network… and I only play an IT professional on TV.","Probably using Wireshark. I don’t know the tool well enough but yeah you can basically see all packets sent, given that you’re on the same WIFI. Could use a VPN to hide your traffic?","You have a modem/router device for internet in your house where you can connect ethernet cables or wifi? If you can access this as an admin you can view everyones internet browsing from it.","Use a VPN.I’d be careful of him in future. No respect for your privacy or boundaries.","YouTube is really easy to accidentally cast a video to a TV/PC on the same WiFi. Might even be able to see what other devices are watching somehow","There is always a day of reckoning. He may need you one day. When that does come, tell him to kick rocks. So what if he rats you out to family and friends? Pretty much everyone's search history is checkered. As long as you're not checking out cardinal no-no shit. Pretty sure you know what I'm referring to. Again, tell'em to kick rocks.","Watch tubi on autoplay. Leave it playing when you're not home.","What he’s doing is illegal, advise him your next call will end his career.","Actually almost this can be done if his smartphone was unlocked with root access. We did something similar to this when we were in our college. We could access the logs with an app for all the devices connected in the same wifi. Links could be extracted as well. Can't recall the name of the app or if it's still possible or if that app would still work.","While playing games and pranking him back seems fun you should know that what he did is a huge violation of your privacy. It would be like just walking in to your room every 30 minutes without knocking. You or your parents need to talk to him about boundaries. Especially of he is going into cybersecurity where you have to learn how to do the bad stuff in order to do good stuff to counter it. Meaning he will learn in more and more detail how to do creepier and creepier things like having access to your webcam without you knowing. When I was a kid I found a little script that pulls all passwords saved in the browser back when it was just a txt file on the pc and I showed my dad using his computer. My dad isnt a super techy person but he was security forces in the airforce so when it printed a blank page he proudly said \"oh yeah I dont save passwords.\" The point of the story is what if he did save them? I as a teen with a not fully develeped frontal cortex could get access to so much. Bank accounts, email, porn accounts. I can find private things they dont want other people to know or do malicious things impersonating them. He needs to learn when to use his abilities for good, or white hat hacking, instead of bad, black hat hacking. Grey hat hacking would make the argument that if I think someone might have something illegal that hurts others on their pc then I will ignore their privacy to look and use as evidence against them later.And yes still counts as if it was as simple as leaving your browser open. Still a vulnerability that can exploited either maliciously (like blackmailing that they know what they watch on YT) or for good (telling the person they have a vulnerability and should make sure to close out on tabs so bad people cant access their accounts) or grey hat hacking (double check recent history and if nothing suspicious is there then move on)","I was in a house hold that shared Wi-Fi with roommates and i notices it would suggest me videos from them just because we were on the same wifi even though totally separate accounts and interests. Maybe he noticed this too…I doubt it though considering his background","Reposted from a comment because I don't see anyone mention this, but maybe he is packet sniffing, which shouldn't be too hard considering he is taking a cyber security class. I had only half a lecture on packet sniffing and I was able to use wireshark to find out what YouTube video I was watching on my phone in half an hour of playing around.","Brother have a girlfriend? Then do web searches on things like “brother’s girlfriend keeps flirting with me”.If you are all using a common computer, he may have placed a keylogger on it to capture everything you type. If you are using your phone, then install a VPN.","He could be using Wireshark to see packet information you're sending out, probably has page titles or at least urls that he could just reverse search and see what you're watching. If you're actually nervous about it you could try a VPN but I am also liking the suggestion by u/Bergusia","Change your password. It's impossible for him to see what you are doing on an https website. He might see your on YouTube but nothing what your doing on it.","Would like an update at the end of this","If he's on the same network he can easily perform a Man-in-the-Middle attack by sending gratuitous ARP replies to alter the MAC address tables and from there he could either poison the DNS cache or run a packet capture or do both. SSL strip can be used on some occasions to force a downgrade to regular cleartext HTTP from encrypted HTTPS. A much more likely scenario is probably something much simpler though, such as forgetting to log out, session hijacking via cookies or malware he's placed on your computer such as a RAT or keylogger. Definitely sign out of everywhere from a new device and change all your passwords to new passphrases and run a virus scan.You should try hacking the hacker by implementing some social engineering techniques on him lol.. just appeal to his ego and tell him it's crazy cool how he was able to get into your stuff and ask him if he can show you how to do it.You should get learning on tryhackme.com as there are many different attack vectors he could be using. The best defence is a good offense...","Fucking threaten him by going to the cops."],"points":745},{"text":["Synology DS115j stopped working"],"points":0},{"text":["Laptop won't connect to Wi-Fi after battery ran out","What model is your laptop and also wifi card model . If wifi module is mediaTek I can suggest some steps to fix it. You can find wifi card model from \"device Manager\" by right clicking on the bottom left corner."],"points":0},{"text":["Windows 10: Need way to Include X86 Program Files in Windows Search.","Have you tried using a different search tool like Everything?","Use filelocator pro instead. It just works."],"points":2},{"text":["Almost all games crash or don’t start","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Looking for help with a remote printing solution","They VPN in, then print. Simple","You can also use email print if your printer supports it. Sharp printers offer this featurehttps://youtu.be/5vp8YbXdQTw?si=m8c86e-ByaW3ywoR","Is there any software that could handle managing this?"],"points":1},{"text":["Absolutely stumped on this Windows freezing issue","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["MicroSD Card for 3D Printing Keeps Getting Corrupted"],"points":0},{"text":["Ethernet Keeps Breaking"],"points":0},{"text":["Do I need to get my laptop serviced? And if so, how serious is the issue?","Definitely not normal temps for what you're doing. You could try doing a basic cleaning with compressed air but otherwise yes you should have it looked at if you're not comfortable taking it apart.","Age wouldn't be my concern here with those numbers. That's close to AMD's published maximum temperature limit of 95o C--a value we don't want to exceed even under heavy loads. As far as cleaning goes unless you did it yourself I wouldn't eliminate dust and debris as a potential cause, yet.Using Task Manager you can see what processes are taking up that much CPU.Is this a new problem?","Sounds like you're hitting some thermal throttling. Cleaning the laptop, replacing the heatsink compound, and replacing any fans that have seized up should fix it.","Do you use it on your bed? Sometimes people put it on top of the bed covers when watching stuff, they cover the ventilation holes and the fans suck fibres in. Would need cleaning again. If you do, use a \"TV dinner tray\" to place the notebook on for better ventilation.","I see the 3250U has a rated temperature of 95C so that's not a problem. However it needs to be written that in the past few years the laptop makers design the system to let the temp rise so the fans and heatsinks don't work as hard.Laptop users hate the fan noise so makers let delta-T rise.Also in recent history is RAM usage. Everything from OS, browsers and games now use it all. Even if it's for a trivial use. This is how things are today.Given this, what issues are you experiencing?"],"points":0},{"text":["Wifi disconnecting when playing video games"],"points":0},{"text":["Ram Usage","If you suspect your computer might be running low on memory, please see \"How to know if you need more RAM\".Please ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","That's normal he uses as much as possible.Unused ram is useless.","Again.. this should be an FAQ since it's asked so frequently. Windows will use as much ram as you give it to make your computer run as fast as possible. One think it does is it will start pre-fetching programs and data from your hard drive while the computer is idle, so that they can be loaded from super fast memory rather than the slow hard drive when you actually launch the program. If Windows gets it right, then the program launches super fast(or at least much faster than from loading from the disk) If Windows gets it wrong, it doesn't take any time to release the memory to make room for whatever it was you actually wanted to do.Leaving the memory unused is a waste.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":6},{"text":["An issue with google images"],"points":0},{"text":["SSD not found after GPU change"],"points":0},{"text":["Win 10 Not Backing up Folders that Originate on Separate Drive","I'll be blunt. After decades of seeing Microsoft backup apps fail, I use anything else."],"points":0},{"text":["I locked my system SSD drive, can't acces any pc options even as an administrator. What are my options?"],"points":0},{"text":["Laptop won't turn on. Power light always green. HP Elitebook 820 G3"],"points":0},{"text":["Thinkpad Fan on High When in Sleep Mode","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Need to move WinRE **FILES** back to the correct partition. Partition is fine - but EMPTY, and WinRE is no longer on it."],"points":0},{"text":["Repeated BSODs on my friend's (and now mine as well) CPU","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","https://files.catbox.moe/aao95s.zip - MY PC, HIS CPUhttps://files.catbox.moe/f7cerw.zip - HIS PC, MY CPU","What's the error code on the bsod?","Is your motherboard also using the P3.90 BIOS version?","Did you reset the CMOS after swapping the CPUs? They have several revisions of these CPUs which the motherboard often doesn't pick up on when it's very similar CPUs."],"points":0},{"text":["technical issue","Type faster than it can"],"points":0},{"text":["I need help installing WIN11","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","You changed the defaults of Rufus to set the file system to exFAT. You should only do that if you know what you are doing.Because of the above, your media needs to load an exFAT UEFI driver before it can do anything, however, the exFAT driver is not Secure Boot signed, therefore, if you try to boot your media on a Secure Boot enabled system you will get the Security Violationmessage you report (which is the reason why you should not change Rufus' defaults unless you know what you're doing).Two solutions for you:Recreate the media in Rufus and don't change the default options. Then Rufus will use NTFS and not exFAT, and since the NTFS driver is Secure Boot signed, your media should boot on a Secure Boot enabled system.Temporarily disable Secure Boot, and reenable after Windows is installed."],"points":1}]