[{"text":["DNA From the Ocean’s ‘Twilight Zone’ Could Lead to New Lifesaving Drugs, Scientists Say. Researchers catalogued the genes of more than 300 million groups of marine bacteria, viruses and fungi in hopes that the database could lead to breakthroughs in medicine, energy and agriculture.","I’m assuming with the current breakthroughs in AI that the process of navigating all these various genomes will really bring new possibilities to life at much quicker rate than before? If so this is really exciting!","But then guess what. If it is destroyed there wont be anymore.","Uh oh. Next up is orphans holding these ocean bottom discoveries internally in underwater cities.","so there is money at the bottom to sea...","Unleash AI on this data","I do love me some frontier science, but forgive me being a bit skeptical about a free tool coming from a university chaired by MbS.Can't help but wonder if there's a catch.","On one hand they are creating wars and other problems to solve and on the other discovering new ways to create solutions to those problems they keep creating, so what is off about this picture?N. S","TIL there is marine fungi. Amazing. Does it network under the ocean floor and fruit on the ocean floor like terrestrial fungi?","Why does this matter if the exploitation of the ocean is literally killing the planet? Whats the drug that will heal the sick earth when we are supposedly living our best lives?","This sounds awfully nihilist, but the last thing the oceans and other species on the planet need is humans living longer.I greet these news of breakthrough stories with less enthusiasm than I wish I had.The new cancer vaccine sounds promising, too, but also makes me question whether tens of millions of humans living an extra 10-20 years is actually a good thing.I hate to see people suffering, but I hate to see the planet suffering and the extinction rates and the ocean poisoned, too.If not for the stupid Electoral College in the US, Al Gore would have been president in 2000, and life on our planet might look different 24 years later, today.","We don't need to save more humans. Please concentrate on saving the other species that you are experimenting on","Can’t wait to see any arrangements shut down or delayed by big pharmaceutical companies and big energy.Not to mention ton of it’s embraced by them, the price being astronomical.","From my understanding, these aren’t genome resolved correct and the genes are from metagenomic assemblies?","That’s great. Good thing we’re taking good care of those biospheres so that we can use this stuff and benefit humanity.","Do you want Bioshock? Cause this is how you get Bioshock.","Life-saving drugs, cool. Can we get like, super weed"],"points":34},{"text":["AI Needs So Much Power That Old Coal Plants Are Sticking Around","The grid gets fed with whatever generation is profitable under a given regulatory model. It doesn’t matter how the energy is consumed.","What the hell kinda clickbait nonsense is this 😂","Always techs fault. Or the peoples fault. Or your lifestyle. You eat too much meat. You this. You that. But never the gigantic multinational corps who buy off politicians, receive astronomical subsidies. Nah. They are “doing their best.” It’s your fault. It’s the tech industry and their awful advancements.","What kind of pro coal anti Ai bullshit is this?","It’s good to see that the only meaningful contribution the blockchain has made to history is to be the first in a line of meaningless “breakthroughs” that are so computationally intensive that we’re turning back on decommissioned power plants to fuel them.","Is this suggesting that coal was about to be a thing of the past, but then AI showed up and they had to keep the plant open? Lmao trash ass article","AI is the problem sure, not the massive profits that fill the pockets of people that go to lobby the government to legislate against renewable energy. Couldn’t be that, must be the latest boomer boogie man causing it","And absolutely no one asked for this AI crap in the first place!!","Reason 1,078,672 we don’t deserve to be here as a species. Bring on the Matrix!","Thats why I’m not worried about it… we can just unplug it.","Anything that runs on electricity needs a source and a way to produce it and with that one now begins to understand who is behind the propaganda.There is a way to it perpetually, but no one wants that, and I wonder WHY?This is what happens when debts go unpaid and shell games are used to rip off the American Citizens and replace them with anyone else.And it can be done, because I already did it.N. S","Noooooo","Matrix vibes","Good. Fire them up. We got work to do as a people, community, and world.","New coal plants fitted with baghouse technology put out air emissions of a single suv idling in a parking lot in a 24hr period and require clean coal is what I was told. Not sure if I buy all that.Dry fork station in Gillette Wyoming is the only one I know of thats a new coal plant. The Chinese built a similar one in Colorado and it burned the building down to 4ft posts","No worries soon there will be human battery farms to power it","Coal plants are sticking around because corrupt business owners and greedy politicians like Manchin.","dilithium is the answer!"],"points":135},{"text":["Disney offers an elegant solution to VR’s movement problem | TechCrunch","Lanny Smoot is a genius and a gem. I work for the National Inventors Hall of Fame and created a video honoring him. Seeing this invention in real life was nuts. He’s also just a generally awesome person as well.","It appears to be smaller than other treadmills, and I can see it fitting in my room. It seems a little unstable, though, and I doubt I could run that thing, for example, without any user support or restrictions. Not that I could have afforded it in the first place:D","I imagine this would work great in conjunction with the virtual sets they’re already using. You could shoot an entire movie in a room the size of an elevator, maybe not a very good movie.. but still","Lanny Smoot, who happens to work for Disney offers an elegant solution. https://en.m.wikipedia.org/wiki/Lanny_Smoot","How do you get off of it?","I’ll be on the holodeck","Just in time for Vision Pro.","Imagine this stuff in logistics, or industrial applications, there is much potential here it’s mind blowing","Neurologically controlled will likely be good enough by the time this would be cost effective, but maybe not.I still think tech like the neurosky headset or the Emotiv sensors are the endgame for VR movement & controls","Whatever if they’re gonna roll this out, it should be big enough that the person could walk normally.","Ernest Cline is the prophet we don’t deserve","I get Disney wants to advertise it's \"imagineers\" are incredible, but how many people are really interested in this?","But can you moon walk???","Introducing the new Nintendo Power Pad.","How do you get off ? Can you run off it ? What if you slip and fall ?","What the heck is this thing doing? Is there a skin covering each tile that slides freely as you attempt to move?","I used to have the Oculus Quest; it was good, but the movement and setup were awful. Taking under consideration innovations like HoloTile, seems like there's a big future for VR","So is Disney attempting to make a very small version of Star Trek’s Holosuite? VR, with tracking?","I doubt you could run with it though. Youd have to only walk places.","What’s wrong with the one like in community? The slick surface plus socks?","Reality!","and neuralink will take care of sensory perception eventually"],"points":96}]