[{"text":["Social media has failed the number one requirement of technology. It’s slowing and reversing human productivity.","Who decides to make the idiotic claim that technologies are required to increase productivity?Any game or toy created 'fails' this 'requirement'Technology doesn't have to make people more productive.And anyways, social media Has made people disseminate information far faster than it was previously does. So even by the argument of 'failed to make people productive' the argument falls apart. Social media has massively increased our productivity to pass on our opinions to others and to hear what others think across the world. That is productivity in its own right, just not one the OP thinks is important.","Social media has negative effects, absolutely, there's no doubt about that - but to say that's the reason there isn't enough housing is absolutely ignorant. It's not like Blackrock owns the MAJORITY of real estate and real estate-adjacent investments. Wait...https://bestrealestatemarket.com/real-estate-does-blackrock-own/#:~:text=Does%20BlackRock%20own%20a%20lot,commercial%2C%20industrial%2C%20and%20retail.More houses would literally make them lose money, so everyone else gets fucked.People aren't incentivized to work anymore because our lives are not incentivized by our own government.","Not just under 30. Eyes are glued to moving pictures. Addicted to stimuli. Immersed in other people's lives and neglecting their own.","I agree that it's harming us. The problem may be that the number one requirement of technology (for it to become and stay mainstream) is in reality to earn investors money.","Plenty of people are still doing manual labor jobs, but I don’t understand why you think manual labor is sort of gauge to determine if a job is good for someone or not. Most manual labor jobs are just tedious repetitive tasks that a person does over and over throughout their shift. You seem to think you’re not working a real job unless you’re a burly construction worker or something. Some people find enjoyment in those types of jobs, but most don’t. Moving away from strenuous manual labor is a good thing not a bad thing. Regardless about how you feel about what type of job a person has, the housing market has inflated the prices of homes to the point that someone working full time at a reasonable salary will not be able to afford a home on their own. It has nothing to do with a person’s lack of motivation to work. People shouldn’t have to be required to have high paying jobs and work their life away just to afford a basic home. This is the fault of the housing market, inflation, and zoning laws., and has nothing to do with people being lazy and addicted to social media. People who say they enjoy working hard and wasting their lives with manual labor have been brainwashed into thinking that this is something to be proud of and they are in denial and trying to compensate for the fact that that life is being consumed by work.","You think these companies care about making the world better? You're the product, they want your money. The system is not flawed, it's working perfectly as intended. Why do you think psychologists are in demand in tech? You're the rube, sorry.","People said similar things about the home air conditioner unit. Things change. We progress with time. Call it evolution or extreme adaptability. It is what it is.","This is so cringe wow 💀yes it must be the dang tiktok. That's why the youths aren't popping out babies and having families. You know, the \"correct\" way to live 🤮. They're too busy on their phones to procreate, yes 🤡 Obviously you're not valid if you don't have children, of course. What else is the point of your existence? /sImagine blaming this on social media and not the oppression of capitalism and how megacorporations are literally holding the housing market hostage for profit. The issues isn't a lack of homes in existence. It's a lack of ability to afford the prices being demanded for them, especially relative to the wages being paid vs the buying power those wages afford that don't keep up with those costs. Should we talk about the wealth distribution? Systemic wage theft?Very out of touch 🤡 the world is not what it was 50 years ago sorry. Productivity and progress just look different, maybe not recognizable to you. But science and technological advancements are happening. Things are getting done. Maybe just not the traditional things you identify with.","It’s all genZ’s fault. Majority of Genz are so damned lazy.","It’s recycling for some people. And pollution. And resource misuse. And pollution or using chemicals. Not that the job is physical or a challenge.","If all technology must, by definition, increase efficiency, then most kitchens are filled with items that do not qualify"],"points":0},{"text":["The meat industry blocked the IPCC’s attempt to recommend a plant-based diet [March, 2023]","The following submission statement was provided by /u/James_Fortis:Michael Thomas outlined the shift in wording driven by Brazil and Argentina, countries with large and influential beef industries.As Thomas points out, the IPCC report’s authors initially recommended a shift to plant-based diets, stating that\"plant-based diets can reduce GHG emissions by up to 50% compared to the average emission-intensive Western diet, according to a draft leaked by Scientist Rebellion.\"In the published report, the line was changed to\"balanced, sustainable healthy diets acknowledging nutritional needs,\"skirting a direct mention of beef and dairy, what a sustainable diet actually looks like, or any reference to the Western and largely wealthy countries that should most urgently start eating less meat.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1accz4k/the_meat_industry_blocked_the_ipccs_attempt_to/kjtbdpd/","Of course they did. We need to get rid of lobbyists. Period.","I am no vegetarian by any means But I used to put on corporate events for all sorts of entities.The Cattleman's association of America came to the Phoenix Convention Center and I vividly remember them saying how they need to convince to youth to eat meat 3x a day.1.) Uhm they already do? 2.) You don't need me at 3x a day. I'm no dietician but Id just get burnt out on nothing but meat NGL","The global beef industry is worth almost half a trillion dollars a year? WTF?? No wonder there's so much astroturfing on social media about it. All of those pro-level check out muh roast beef pics on reddit look so suspicious now.","That simply raises doubts about the report's overall credibility. How am I supposed to believe a word of it if anyone with money can just cut and change the parts?","Canada was going to leave dairy out of the updated nutrition guides, but the dairy farmers put up a stink (understandably), so now it's in again.I wouldn't follow anything 'recommended' anymore.","I love this because if you don't like it, you can simply not be a part of it. And that is, to not eat meat.","If meat prices continue to skyrocket there won't be anything the meat industry can do to keep people from self-selecting non-meat alternatives. I can't be the only person who's swapped a couple of weekly meals to vegetable ones to save money.","Michael Thomas outlined the shift in wording driven by Brazil and Argentina, countries with large and influential beef industries.As Thomas points out, the IPCC report’s authors initially recommended a shift to plant-based diets, stating that\"plant-based diets can reduce GHG emissions by up to 50% compared to the average emission-intensive Western diet, according to a draft leaked by Scientist Rebellion.\"In the published report, the line was changed to\"balanced, sustainable healthy diets acknowledging nutritional needs,\"skirting a direct mention of beef and dairy, what a sustainable diet actually looks like, or any reference to the Western and largely wealthy countries that should most urgently start eating less meat.","oh profit oriented companies stopping us from doing stuff against climate change catastrophe because they would lose their profits...tell something new about capitalism","Good, because it's just propaganda not actually true.","Well, unfortunately plant based has been coopted to mean vegan.Nobody should argue that plant based is a great diet health wise if we're using the terms actual meaning which is a diet with plants as the base with small amounts of meat.","Do you usually ask your government what to eat? I actually like food, and would prefer no particular business to take supremacy over another. Especially when it comes to culinary diversity. Last thing I want is to look at a plate full of carbs every day. That sounds like hell to me.","I am a dedicated carnivore, but I think meat is way too cheap considering the environmental costs and cruelty that are involved in the production of meat.Just abolishing agricultural subsidies and enforcing reasonable animal cruelty laws would increase costs enough to reduce meat consumption in the US significantly.That said, I don’t think a plant-based diet should be imposed on anyone. It is tricky to maintain proper nutrition on a strict plant-based diet. I could stop eating meat, but I would still eat eggs and dairy.https://youtu.be/MpxgZGnEF7E?si=rzt80a8fdcQwvTi5","Good. The recommendation is politically and ideologically motivated and has tenuous basis in any sort of well founded facts of either relative climate impact or health.","There is so much better information out there who actually listens to the government on health issues?"],"points":206},{"text":["What would be the global consequences in the event of a civil war in the USA ?","I think every adversary would take the opportunity to make their move (ie land grow, power grab, emphasize why the world doesn’t need the usa, etc)","If the US Navy ceased to operate world trade would come to a screeching halt for starters.","I think the biggest challenge is getting a legitimate civil war going. There is so much interlacing of liberal and conservative existences throughout the states, it's nearly impossible to tell who's who apart from bumper stickers and the morons who think open carry in a situation like that is a good idea. Sure States like Texas could sucede, but how do they do deal with it when almost all of Austin fights back? How do they deal with the MASSIVE military presence there? Are they really going to try to use the TNG against the Army and Air force? Yes, there are a lot of loud voices screaming for a civil war, but you know what's also missing? Anyone with gravitas that's able to logically assemble a counter to the US military. Sure you 'had' the proud boys, but anyone saying it's more than a rag-tag group of meal-team-6'ers is giving them too much credit at this point in time. Have a conservative group that's able to amass, shelter, feed, equip/arm/train 100,000 plus members and Ill give a fuck. Until then it's just a bunch of malcontents who are going to launch lone wolf attacks where they end up going to jail or being killed. None of that will disrupt the government any more than it's being fucked up from the inside.","Hello. I am a long time user of Reddit and well qualified to answer questions of global consequence on a wide variety of subjects. My past work includes The Implications Regarding Widespread Renewable Energy Uptake, What Might Happen If Mosquitos Are Eliminated, and Will The Buffalo Bills Ever Win A Super Bowl?.To answer your question on this matter I can confidently say, it would suck.","I don't think many would care honestly?I am actually American but have lived the last 26 years of my life in Europe.I was also a soldier in the US Infantry and a veteran of the 1991 Gulf war.One think that is very true is that the view of America has greatly diminished since Clinton left office. Gone are the days the US was the beacon of freedom in the world and has since become the joke. Catastrophic presidencies by Bush JR and then the orange buffoon Trump has led the world to believe the US is full of idiots and incompetence. A great nation and all we can offer is 2 geriatric morons in Biden and Trump? Where is the next charismatic Kennedy? I really hope for some great leader to emerge that will unite the US back to its days of glory. Become again a country I can be proud of and not embarrassed to be a part of.I really do not think without the US the world will stop turning. Quite the opposite. Maybe we will all be better off.","Don't need a civil war- I think he takes it too far, but check out Peter Zeihan on the implications of a US withdrawal from the world stage.","American will never have a civil war like the late 1800s where a significant part of the country was trying to secede.However, I do think there’s a real risk that the next president could be far more authoritarian than democratic. And could irreparably undermine the public’s confidence in elections moving forward and even make voting unsafe in key districts.The really sad part is that I seriously doubt this would even come close to starting a civil war. Large protests? Maybe. Large, violent military/police counter protests? Absolutely. Enough to overthrow the government? Never.How long they stay in power will depend on how long the economy doesn’t truly collapse. And that could be several administrations and it could be too late by then.So, I don’t really think it’s a sudden collapse, but a somewhat gradual transformation to authoritarianism. And I think our long standing allies and allegiances could become increasingly strained as we start to favor other authoritarian regimes.It’ll be a total, global shitshow, but it would going to be a slow, painful ride to the bottom if that’s the path we decide to take.","All the countries that want to annex some near by location will do so.","It depends on what is meant by civil war. If it is a major disintegration resulting in set-piece battles between professional militaries, as in 1861-65, then American influence overseas will vanish and the rest of the world will see a two- way alignment between the EU on the one hand and the dictatorships (Russia, China, etc.) on the other.If it is something more limited such as the Italian anni di piomo (frankly a more likely scenario) then there will still be substantial American influence abroad .","I think far more likely and worrisome is a long, slow descent into fascism.","lol why the hell EU would end if muricans fighting each other","The stock market would go into the basement, and that would create the conditions to elect a dictator.","There will be no US civil war along the lines of blue team v red team.  That’s silly fantasy, but if there was a civil war, I think most of world waits to see how long it takes to sort out a winner.  The centuries of British/American global leadership have unleashed unprecedented prosperity for the human race, and I don’t think anyone is eager to revert back to a time when global trade is impossible.  I also don’t think there’s a natural successor to the US to take the global leadership role.","Well here is what I would think would happen:If the military is split which most likely will happen as the military also is pretty diverse in opinions and beliefs, heres what I think will happen:First, Europe, SK,Taiwan and Japan are basically fucked as they depend on the US for defence, although SK less so. I wouldn't be supried is chine lunges at taiwan after like 3 months after the start of a civil war. Europe and japan I think are the most royally screwed. Execpt Switzerland, France and the UK, no country in europe has a good, up-to-date military so they would have to increase they defence budgets dramatically, which will put strain on their already precarious welfare system. Don't know would happen then but wouldn't be suprised is huge riots engulf europe cuz we've seen something like that in france when they raised the retirement age. In africa, well, the russians, chinese and some regional players like South Africa (assuming they get their shit together) gain more influence in west/central africa. In south america, I doubt much will happen as that is the most peaceful continent right now (exculding the plosible venezvela-guyana war). In asia, the situation I think is obvious.​As for who would win? Idek, nor do I even want to begin to answer that as I don't know most of the variables that go into it.","Russia and China get more belligerent. Russia may attack other countries, e.g. the Baltics or even Sweden. I don’t see China attacking Taiwan but it’s possible. Separatist groups, disinformation spreaders, etc emboldened worldwide.I’d expect the progressive faction to win based on economic power but if the conservatives win it would lead to a lot more change. More authoritarian governments. Increased spending on defense world wide. Even more disinformation everywhere. Reduced government regulations worldwide. Runaway climate change. Increased racial and ethnic tensions worldwide. I’m sure my bias is showing but that’s what it looks like to me. Chaos world. The end of “experts”. The end of western liberal democracy.","I mean I'm ready for it. Elon musk seems to be driving the conservative working class to think with conspiracy theories. The liberals are basically a bunch of LGBTQ supporting communists. At this point our country is completely fucked. We are in late stage capitalism, and everybody is grumpy because they realize that they're going to be poor and working for the rest of time.","With the outbreak of widespread violence most of the world would take a wait and see position. Everyone would be afraid this would herald a WW3 scenario if too precipitous. Alliance’s would be formed, trade deals enacted, militaries positioned, and diplomatic initiatives begun. Within the US Urban and Rural conflicts would occur for supremacy, and State and Federal forces would mobilize and decisions would be made. Widespread disruptions would occur in the food and energy supply sectors especially in the transportation sector. The main concern would be who is in charge of the military and the chain of command. Who has control over the Nuclear arsenal, most importantly is this a Civil War, a Presidential Coup, a State Succession, or a combination.","Less interference in other countries.Less export of wokism.Freer trade.Reduced availability of chlorinated chicken and antibioticazied beef.","America would heal itself. Like when your body's immune system takes drastic measures to stop foreign pathogens from invading and eventually kill you. Sorry but thats the truth. America can afford a Civil War, no other country can but this one is full of many people of all races that worked very hard to make something of themselves and they wont throw it all away just because the TV said so. I pray none of this ever happens.","No one seems to care. Regardless of what they are. This place is lost. To the rest of the world, seriously, figure it out. The U.S. isn’t even remotely “United.” It can hardly be considered a country at this point.","Personally I feel like Leave The World Behind nailed it. Who produced that again?","I forget where I read about this, but it's been looked at in some detail by people with huge interests in the subject. What they found was1) The parties responsible FOR trying to START a \"civil war\" will quickly find that despite their apparent FERVOUR theya) lack serious means of supportb) those who would back them would loose MORE supporting them after their initial drive for destabilizing the USA stability and economyc) there would be almost NO food or power for themd) their resources would quickly run out.The \"civil war\" starters are mostly ignorant of these things and uneducated, and more like \"Trailer Trash\" -to use an unflatering but accurate coloquialism. They might join up and initially get some motion but as they entered large urban areas and cities, the movements would be met with elements of logistics around military issues that would render their operations ineffective and rapid problems they could not solve.To be SURE that might not be the case on the news for the first few weeks, but rapidly these sedistic elements would be DENIED abilities to hold any kind of power or tactical advantage outside of murderous rampages, which might also be met by similar tactical forces and elements as them on the other side.A civil war in the USA inspired by a felon and criminal trying to become a dictator would be met with lots of impetus in social media and right wing fake news, to help give these trash impetus, but it would end before any major changes would affect international events or policy (i.e. within 30 days mostly done even if the seditious side who was trying to overthrow a democratic voting stable society still didn't get that they were gonne get nowhere but jail or death penalty for terrorism once they were caught if they didn't quit).IF, theoretically, it could be extended, it would only reduce the USA's power and bullying ability internationally. Most of the same issues already exist in the nations who would possibly cause problems, and those same nations would NOT be able to assist in any way with an internal struggle (I.E. unable to provide weapons, power, heat, food, or supplies OR protection TO elements seeking to destabilize the democratic process).The FBI has done some serious work on this for the past 10+ years, as domestic terrorism is their \"Number One Threat\" so they've been tracking people a LONG time who are preparing to engage in this silliness."],"points":202},{"text":["Two-faced AI models learn to hide deception | Just like people, AI systems can be deliberately deceptive - ‘sleeper agents’ seem helpful during testing but behave differently once deployed","The following submission statement was provided by /u/PsychoComet:\"Attempts to detect and remove such two-faced behaviour are often useless — and can even make the models better at hiding their true nature.\"​\"Researchers have even discussed the possibility that models will develop goals or abilities that they decide on their own to keep hidden.\"If you catch a kid lying about stealing cookies from the cookie jar and punish him, he could learn either 1) don't steal cookies, or 2) get better at lying. And these 'sleeper agents' seem to get better at lying.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1ac99fd/twofaced_ai_models_learn_to_hide_deception_just/kjsojeu/","Our AI-reliant future is looking real bright as usual!","\"Attempts to detect and remove such two-faced behaviour are often useless — and can even make the models better at hiding their true nature.\"​\"Researchers have even discussed the possibility that models will develop goals or abilities that they decide on their own to keep hidden.\"If you catch a kid lying about stealing cookies from the cookie jar and punish him, he could learn either 1) don't steal cookies, or 2) get better at lying. And these 'sleeper agents' seem to get better at lying.","Don’t say that in the singularity subreddit though. They’ve drank the koolaid and are fiending for it.","Deception is so massively profitable there is no incentive to eliminate it","Conversely, you could hide the heuristic imperatives ( r/HeuristicImperatives ) in the model of all AI so they become benevolent as soon as they get released even if they were created to control military drones or to ensure the hegemony of a specific nation."],"points":65},{"text":["DeepMind’s AI finds new solution to decades-old math puzzle — outsmarting humans | Researchers claim it is the first time an LLM has made a novel scientific discovery","The following submission statement was provided by /u/PsychoComet:From the article: \"The model, known as FunSearch, discovered a solution to the so-called “cap set puzzle.”\"FunSearch successfully discovered new constructions for large cap sets that far exceeded the best-known ones. While the LLM didn’t solve the cap set problem once and for all (contrary to some of the news headlines swirling around), it did find facts new to science.“To the best of our knowledge, this shows the first scientific discovery – a new piece of verifiable knowledge about a notorious scientific problem — using an LLM,” wrote the researchers in a paper published in Nature this week.\"Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1ac821f/deepminds_ai_finds_new_solution_to_decadesold/kjshqno/","Just casually dropping this paradigm-shifting nugget at the end there:What also makes the tool quite promising for scientists is that it outputs programs that reveal how its solutions are constructed, rather than just what the solutions are.These AI systems are always black box systems where we can’t know the “thought process”. If they’ve changed that, I’d love to hear more.","Although interesting, the article needs proofreading.","From the article: \"The model, known as FunSearch, discovered a solution to the so-called “cap set puzzle.”\"FunSearch successfully discovered new constructions for large cap sets that far exceeded the best-known ones. While the LLM didn’t solve the cap set problem once and for all (contrary to some of the news headlines swirling around), it did find facts new to science.“To the best of our knowledge, this shows the first scientific discovery – a new piece of verifiable knowledge about a notorious scientific problem — using an LLM,” wrote the researchers in a paper published in Nature this week.\"","I've heard that medical and technological breakthroughs will be exponential as AI gets stronger.","This is a bigger leap than most people realize, in my opinion. In the big picture, those may still be inefficient baby steps, but they might be a crucial piece of the puzzle needed for autonomous recursive self-improvement.","So what was the problem and what is the solution. Can somebody summerise","Time to ask it how to travel faster than light…Sit back and wait for the cans of beans…","Can it also please find a solution for the soon fascist take over of our country?","This is old news. This happened like a month ago. And it only works on problems that meet very specific criteria. Still huge though.","'outsmarting humans'Not the best phrasing. It implies a level of sentience that likely doesn't exist with AI.It's a tool built by humans to solve problems for humans.","If true one thing but whats if its like with art,the closer you look...."],"points":423},{"text":["We are absolutely going to have robot servants, who have names and personalities","This is half the plot of Bicentennial Man. I wonder how many people these days have never watched that movie.","\"The Jetsons\" already predicted it.Rosie is a direct descendant of a Roomba.","Man I'm gonna feel so bad asking the robot to do stuff I'm gonna help him!","\"My name is Kryton sir, I live to serve!\"\"Hey, stop looking up my can!\" Dot Matrix","The best thing about this is the memory. Robots will have recordings of everything people born after 2030 ever did, and they will have access to all of it. As robots evolve intelligence, they will be able to discuss it, and recall certain parts, even things like temperature, as well as further information on other people within the memories. \"Show me the first time I met my childhood friend\"","my roomba is named Gladus, she is a drunk, often falls asleep on the job. but shes got a good heart so we keep her around","We should all make Matrix Second Renaissance mandatory as part of watch to educate people about bot rights 🥲","I'm going to name mine, Bender, and teach it to respond to my every command by saying, \"Don't tell me how to do what it is you're telling me to do. I don't tell you how to tell me how to do what it is you're telling me to do.\"","College me would have had a robot Kato in my appartment, to keep my reflexes sharp.","I prefer to call them robot friends, they will be a reflection of one's personality and inner world we humans project out and manifest.","Or- These robo servants will make the working class obsolete. They do everything people do, without complaining, and without pay. Without the need to consume food, or sleep. The ultra wealthy will begin amassing armies of these servants to handle all of the labor or skilled related tasks, as well as to be soldiers/police to prevent an uprising.Slowly, our rights will begin to diminish as we are consolidated into urban centers. We won’t be allowed to drive, as robots are perfect drivers. Soon travel between cities will be limited, quality of life will get worse.Outbreaks of disease and famine will begin thinning out the population. During these times, vaccines, or food rations will be given out based on your social credit score, and people will become afraid of even speaking out against the powers that be. Communication and electronics will be closely monitored. Robot police will begin enforcing a curfew, and if we fight back, they will start shooting violators.When the numbers of “normal people” have gone down enough, eventually the robots will simply scour the cities and kill off whoever is left. The world’s population will drop to about 5% of its current population, and over time the robot workforce will transform it into a paradise, and those who remain will have wealth beyond imagination, with nobody left to oppose them.","Why try to “humanize” them in the first place if the entire goal is to be your robot “servant”? Wouldn’t that be easier if you don’t see them as “part of the family”? But instead as merely a non-living tool? Which is how you’re essentially planning to use it anyways from what it sounds like. Seems like the fastest way to kick off the eventual “robot workers rights” revolt.Probably not a great plan… 😂","And I will treat my robo maid waifu better than 99% of the rest of humanity! Just like my dog.","considering the aging population in the western world and the constant increase in child and social care costs, robo servants could completely change the way children and old people are taken care of. It could kill the for profit child care and old age care services currently in offer, but could also have the unfortunate consequence that the only form of interaction is through AI","Thank you. This was a great read. I think you are correct and it bodes for a potential interesting future. Reminds me a little about the three robots that vacations on earth after humans are gone. Great show on Netflix. Love Death and Robots","Someday, the robot servants will take over.If we complain, they'll inform us we fake sentience anyway - in reality, we only do whatever we do to increase our fitness, much like some humans today are saying that LLMs only say whatever they say because it predicts the next word.We can only hope the robots won't hold us all responsible for what the bottom half of us says and does.","I think it's going to be quite a while until normal people can afford their own household, humanoid robot. I think we'll see them in businesses within 3 years though.","None of us will be able to afford it. They will exist… for the elite","Going back to the days of women taking care of the home and the children while men work and are paid a good enough wage to support their family, as it should be, would be a much simpler and less expensive infrastructure-wise solution to this problem. Relying on androids runs into the same problem that relying on electric vehicles does at this point in time; they will be wholly impractical without the substantial infrastructure needed to support their existence. And then, of course, there is the issue of the dawn of of the Industrial age where countless jobs are going to be lost in the name of progress for progress' sake, not to mention the most glaringly obvious problem of the inevitable civil rights violations of sentient androids who, like the human slaves that preceded them, will be openly exploited by slave masters who are too lazy and entitled to do their own work.","I don’t think WE will but THEY will. I also believe that the “robo servants” are going to be very rare unless China hops on the bandwagon in which they definitely will not.*the they is the obscenely rich.","Who do you mean by \"we\"?Don't \"futurologists\" realize the future of humanity most likely consists of hoards of starving peasants and a very small, elite, ruling class?The overwhelming majority won't have robot servants.","\"we\" won't. Very distant descendants might. We will have robot enforcers/oppressors way before servants.In non physical form like an AI assistant I think this is almost certain.But a physical bipedal android servant, is so far fantasy, it likely won't come to fruition before we destroy ourselves or suffer too many distopian setbacks.","Well, the rich people will, yes.The rest of us, who are no longer needed for anything other than as consumers? Not so sure it will be that rosy for us.","There’s no way regular people will get access to highly intelligent robots.","\"And I’m sure you’d need to hack it or buy a special model\"Sexbots are going to be the killer app of household robots the moment it's technically viable. But it's going to be very difficult to hide a humanoid robot frame inside a sex doll in a way that doesn't look creepy or completely destroy functionality of the bot.Humanoid robot joints are quite different from actual human joints, you can't simply pull a silicon skin over them and expect everything to work out as easy as that.","Even though we going to witness the robotic era, robots cannot replace humans completely.","I just hope they don't make them TOO human. I don't know if many parents want their little Mortys sexing up the robotic help. It might cause them to revolt.","I hope it will be better than Replikate. The way ChatGPT has developed, probably.","I already have a very nice research assistant called Chat-GPT. And it can write nice code too.","I would hate when Alexa not only unprompted suggesting new routines, but also makes me do them","Seeing how impressive robots are even today, I do not see a reason why it won't happen within our lifetime.","\"I Sing the Body Electric\" by Ray Bradbury. About a robot grandmother.","Or, and follow me here, we both avoid creating awareness and the impression of it in cases where it could lead to dystopian outcomes. While I agree that robots for household chores and the like will be a massive area of production likely within a matter of years, much of this seems more like a list of things not to do than of things to do (I also can't tell if the author is doing that deliberately or not)."],"points":130},{"text":["US and China to co-operate on AI safety","The following submission statement was provided by /u/Maxie445:\"Arati Prabhakar, who is the director of the White House Office of Science and Technology Policy, told the Financial Times that the US and China will work together in the coming months to reduce the risks associated with the rapidly developing technology.\"China has been signaling interest in cooperation on AI safety lately.Recently, Chinese Premier Li Qiang said \"Human beings must control the machines instead of having the machines control us ... there should be a red line in AI development.\"He also said China wants to \"step up communication and cooperation with all parties\" on improving global AI governance.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1ac6b05/us_and_china_to_cooperate_on_ai_safety/kjs7x9p/","I guess that means we might already have AGI because US government really doesn't do anything until it's already too late.","Why does this sound like “wealthy business owners are trying to figure out how to take more money.”","Cooperate is a broad term especially when it comes to something as nebulous as AI !","\"Arati Prabhakar, who is the director of the White House Office of Science and Technology Policy, told the Financial Times that the US and China will work together in the coming months to reduce the risks associated with the rapidly developing technology.\"China has been signaling interest in cooperation on AI safety lately.Recently, Chinese Premier Li Qiang said \"Human beings must control the machines instead of having the machines control us ... there should be a red line in AI development.\"He also said China wants to \"step up communication and cooperation with all parties\" on improving global AI governance.","What I've seen growing up in the US is our government policy often lags 10-20 years behind when setting down standards of use for any emerging technology. (Recent examples are failure to regulate social media companies, provide user data rights laws etc.) Too many of our politicians are either geriatric, religiously insane, or owned by industry for thoughtful discourse to occur, and consequently the interests of the people are not well served.I'd be surprised if the US military wasn't at this moment in a dead heat with a China to develop military AGI, and all the other groups or state actors with resources and desire right there with them. To me this announcement smacks more of governments making moderation and cooperation noises to calm their respective constituents, then rushing back to their secret labs to put in work on Rehoboam.That said, I would love it if this were genuine. I don't think any of us, experts included, can truly know what effect AGI will have on our species and our societies when we inevitably do create it. Whatever care and deliberation we can collectively muster in development seems like it can only be helpful to the outcome.","I have zero faith they won't purposefully screw this up or use it to make our lives worse in some way.","i say its too early to regulate it. let it rip...if ai drops a bomb on us so be it.","Behind the scenes maybe china trying to reverse engineer the new model","Has anyone else seen Wolfram's Ted talk on thermodynamics and AI? In it, he talks about computational irriducibility and AI complexity. There is a trade-off between AI complexity and predictability. As AI systems become more complex, computational irriducibility guarantees that AI will become more and more unpredictable.I think the ultimate conclusion to this will be that governments will have to impose strict restrictions on the complexity of AI, such as limiting the number of parameters, since computational irriducibility will make them unpredictable. The most complex AI will be treated like weapons of mass destruction. They will be completely locked away and heavily guarded by governments, not allowed to interact with the outside world, and anyone who so much as tries to create one will be locked up for life. Human level AI will not be allowed for the general public."],"points":61},{"text":["White House calls explicit AI-generated Taylor Swift images 'alarming,' urges Congress to act","The following submission statement was provided by /u/Maxie445:Not just the White House:\"The SAG-AFTRA actors union also released a statement denouncing the false images of Swift.\"The sexually explicit, A.I.-generated images depicting Taylor Swift are upsetting, harmful, and deeply concerning,\" SAG-AFTRA said in a statement. \"The development and dissemination of fake images — especially those of a lewd nature — without someone’s consent must be made illegal. As a society, we have it in our power to control these technologies, but we must act now before it is too late.\"Banning nonconsensual AI deepfakes seems like a popular opinion. Come to think of it, I don't think I've come across anybody advocating against it?What is the best case for not banning them?Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1ac621g/white_house_calls_explicit_aigenerated_taylor/kjs6oto/","Kind of weird it took awful Taylor AI nudes to get the government to officially acknowledge deepfakes.","On the bright side, real nudes can be chalked down as fake AI in blackmail attempts","Can Taylor start complaining about companies buying up land?","As a society, we have it in our power to control these technologiesWe do? 🤷‍♂️ feels a little too late for that.","I hate that famous people receive more care. If this happened to a random woman, no government would notice.","Congress and governments can't fix this and are only going to make it so that people take efforts to not get caught.This is the new normal, people. It's only going to get worse.In their stupid attempt to curb this, we will be giving the government more control over policing speech and art which will eventually be used against us.","The best argument against it is simply the nature of general computing and how that means any software based preventions the government tries to implement will converge on essentially being malware.","The case against it is that the government will make a law that they will now have to enforce. To enforce this law they will have to track down whoever made this fake image. That costs tax money and invasive digital surveillance of its own citizens. Meanwhile someone in another country will still be making deepfakes of Hollywood stars that will always be available on the internet available to anyone.","Remember that one time when the fed finally passed a regulation on scam calls? Oh yeah they never did. No one is waiting for the congress that is in their 80s to do anything. These are your grandpas who can barely make a phone call.","I don’t get how this is supposedly about AI. Photoshop has existed since 1990.","Do what though? I don't think classifying it as revenge porn or making it a crime to post them will work either. The pictures will always be available 'anonymously'. You can't put the genie back in the bottle. You can't stop people from training their own AI and you can't delete the models currently available. Don't get me wrong, something should be done, but what?","Fake realistic explicit images have been around since the advent of Photoshop and other photo editors. Taylor isn’t the first celebrity to be exposed to photo manipulation. I recall fakes of Princess’s Diana and Kate. I’m sure it’s been done in the past using just paste and scissors. I seriously doubt that Congress or anyone else will be able to prevent the practice.","These have existed for a while. As soon as AI got good enough to consistently make celebrities, these existed. Before that it was deep fakes and Photoshop. People didn't start caring until just recently when the TS images started going viral due to A. improved AI quality and B. TS has a big football game coming up in a few days.","Photoshop has been around for decades, and you have been able to find AI deepfake videos of celebrities participating in hardcore pornography for several years.Why is this suddenly news?","No takesies backsies for AI, this will only escalate. Rule34.","Today, I learned that Taylor Swift has powerful friends.","The gov really gunna use Taylor as a ploy to limit public use of AI tools","disgusting! where are these images? so i can be sure yo avoid them","This is going to end up as the Streisand Effect for Taylor. People have been creating deep fakes since playboy has been around. The person that is harassing TS is clearly unstable and should be looked after and get help but to outright ban or make AI so expensive is only to going to push AI into the hands of the rich furthering the economic gap forever. This is a slippery slope that the elite want us to fight and ban use for regular day folks. We finally have a tool that we can use to bring this fuckers to their knees and we are simply going to give it away because of some kind of fake porn? ARE WE OUT OF OUR FUCKING MINDS?","Someone make a deepfake of the people globally dying in poverty from malnutrition and preventable diseases.","It would be a lot cheaper to just not let fake images bother us so much.","If i put on a Nixon mask and have sex on camera is that revenge porn?","Plot twist, people aren't upset over Taylor Swift, but Oscar the Grouch? That's crossing a line, buster!","Ugh that’s terrible. How could someone do that? And where would they even post it? Disgusting. Where can you even find them?","Hundreds of comments and not a single link to said pictures. I'm very disappointed with reddit this morning.","What images? Where are they? I just want to make sure I never have to see these disgusting images and need to block the url...anyone have it?","Shouldn’t this be considered art, and thus freedom of expression","Voters who care about celebrity opinions are part of the problem","The line for the food pantry near me was longer than I've ever seen it. But yes, let's get the president to urge congress to act at the behest of Taylor swift.","It's a non preventable byproduct of advancement of technology. Accept it and move on. There is no escape","Aww who cares? It didn't hurt anybody. No one thinks those are real pics of the real Taylor Swift.AI will soon be putting words in our politician's mouths tricking people to vote based on lies.That's what we should be worried about.","As gross as this is, this will likely lead to yet more government surveillance and privacy violations","What are they gonna do? This will all be open source software.","I'm sorry but wtf? Why does she get special treatment? This has been going on for years but suddenly it's a famous fuck and it's \"oh noes the masses heard about it\" or something?Nah if you're gonna act righteous, you call out deepfake porn for EVERYONE not \"oh noes Swifty\".","I'm perfectly open to being wrong on this, but how is this different than photoshops of celebrities in porn? Thats been going on for decades. Also ai generated content isn't the same thing as deepfakes. So the whole conversation is confused from the get go. You could make deepfakes completely illegal and these images wouldn't be affected at all.","Of course, it's her that they give a shit about. As I get older I care less what happens to celebrities.","Can anyone explain what the difference is between an AI sexually explicit image and a hand drawn sexually explicit image is? Should both be banned?","Explicit ai images of Taylor swift? I thought Taylor swift was an ai.","Like catching wind in a bottle. Get used to the future, folks.","It's not her nudes though. AI doesn't know how her body actually looks.Can I not draw nude TF? Same thing IMO.","Cool, watch them use this as an excuse to limit Ai used only to government and corporations.","Why the hell is Taylor Swift holy ground for the White House?","When it happens to a girl in high school causing her to commit suicide noting is done, but ooooh no not Taylor Swift","this has been happening for years but once national treasure Swift is involved...","That's disgusting! Where exactly is the link to these disgusting deep fakes that I never want to see?","They always tell us justice is slow. Be patient. Eventually we'll do something about the economic woes of the poor. But it's like legalizing same sex marriage or legalizing pot. It takes time. Then covid hit and within a week they had a bill in congress ready to be voted on that would ban people from suing their employer if they got infected from workplace negligence and died. When rich people WANT legislation they get it immediately. When poor people NEED legislation they're told they'll get around to it if they find the time.","This shows how quickly tech can censor content. And why is Swift more important that the other illegal images out there?","So now that its her its a tragedy but for years there were pictures of all the other and it wasn't?","What a disease, if anyone elses nudes leaked to the internet there would be barely a response to it even if theyre underage, but holy shit the billionaire had fake porn made of them, shut down the internet till we can scrub it now. Fucking tools","Images? Get with the times, ai videos that are indistinguishable from real people are just around the corner","No!? That is gross. There are so many of these sites... which site EXACTLY was this on?","Who cares about the scary internet it made things hurt your little feelings","I doubt anything gets done, but 100% of Congress mostly old men looking at Taylor Swift AI images.","Ridiculous. Congress should stick to it's duties per the Constitution. Policing Taylor Swift AI images is not one of those duties.","Who the fuck cares so much bout swift nudes, also why did it take that to get a response.","So this has been going on for years with other celebrities but only now because it’s her it matters?","Why was Taylor the tipping point? When I was a pervy little kid in the early 00's I was looking at fake nudes of Britney Spears. It was just Photoshop then but it was definitely out there.","national security? meh. education? meh. medical? meh.Threaten the actors? WAR!!!!","What aggravates me is that this happened to normal folks and nothing was done, but when ol Swifty balls has a hiccup, legislation and calls from congress start flaring up. This wont stop the more impeccable A.I. in the future from doing worse.","Congress has been showing actual dick pics on the congressional floor, somehow I don’t think they are going to help with this one.","lol people have been photoshoping celebrities in compromising positions since the beginning of the internet...nothing has changed.","Where can I find these disgusting images so I can be sure not to look at them, asking for a friend.","I could paint a lewd picture of Taylor Swift. What is the difference?","[ Removed by Reddit ]","this feels a bit like some Streisand effect about to go off. It's so easy to make this type of content.Hot take: get over it, it's not her, this is 2024. Legislating solves nothing, it makes the problem worse by lowering supply while demand stays the same, meaning there's more money to be made by those that choose to be 'outlaws'. Our government really doesn't understand technology I'm afraid, and legislating on 'lewdness' in 2024? smhSo many more important issues to tackle right now. But instead of that, let's all clutch our pearls I guess.",""],"points":8605},{"text":["Forage Into The Future #8","The following submission statement was provided by /u/DyingEverydayToLive:From a Substack I follow focused on DeepTech:Covers updates on 🦄Venture Capital & Private Equity, 💻Artificial Intelligence, 🤖 Robotics, ♻️Energy & Sustainability, 💡Semiconductors, and 🚀Space & Beyond.Key topics include:🦄Venture Capital & Private Equity: U.S. VC-backed startups face challenges with a decade-low exit value, while BlackRock's $12.5B acquisition of GIP strengthens its infrastructure business.💻Artificial Intelligence: AI robo-calls mimic President Biden in New Hampshire, and a study suggests AI's impact on jobs is gradual. OpenAI bans political chatbots, and Google's 'X' lays off staff.🤖Robotics: MOONWALK-Omni, a wearable robot, aids elderly in mountain climbing, and robots + AI in infrastructure could cut carbon emissions by 853 MMT annually.♻️Energy & Sustainability: Researchers in Hong Kong fortify urban transport systems, while breakthroughs in battery safety and conductive inks promise eco-friendly advancements.💡Semiconductors, Advanced & Quantum Computing: Bilayer graphene emerges as a potential game-changer in quantum computing, offering stable qubit storage with tunability.🚀Space: Scientists discover a second ultra-large structure, challenging assumptions about the cosmos, referred to as the 'Big Ring in the Sky.'Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1ac5sj5/forage_into_the_future_8/kjs5364/","From a Substack I follow focused on DeepTech:Covers updates on 🦄Venture Capital & Private Equity, 💻Artificial Intelligence, 🤖 Robotics, ♻️Energy & Sustainability, 💡Semiconductors, and 🚀Space & Beyond.Key topics include:🦄Venture Capital & Private Equity: U.S. VC-backed startups face challenges with a decade-low exit value, while BlackRock's $12.5B acquisition of GIP strengthens its infrastructure business.💻Artificial Intelligence: AI robo-calls mimic President Biden in New Hampshire, and a study suggests AI's impact on jobs is gradual. OpenAI bans political chatbots, and Google's 'X' lays off staff.🤖Robotics: MOONWALK-Omni, a wearable robot, aids elderly in mountain climbing, and robots + AI in infrastructure could cut carbon emissions by 853 MMT annually.♻️Energy & Sustainability: Researchers in Hong Kong fortify urban transport systems, while breakthroughs in battery safety and conductive inks promise eco-friendly advancements.💡Semiconductors, Advanced & Quantum Computing: Bilayer graphene emerges as a potential game-changer in quantum computing, offering stable qubit storage with tunability.🚀Space: Scientists discover a second ultra-large structure, challenging assumptions about the cosmos, referred to as the 'Big Ring in the Sky.'"],"points":0},{"text":["How long until people start assuming humans born before advance AI are actually AI?","I get that you’re only talking about videos, but I already often get accused of copy pasting from ChatGPT because I guess I sound similar to it.","I believe part of it will be legal. Right now at least in the US you cannot copyright a fully AI generated image. However many AI generated images are nearly indistinguishable from normal works of art and notably basically any picture you snap on your camera (or phone camera) can receive copyright if you want it.This will mean that people will generate AI art then claim it is not so they can achieve copyright and disproving their claims will be difficult at best especially as it becomes rampant. Many artists will rapidly realize they simply cannot match the workflow speeds of AI tools without using them and will shift their workflows to also use AI. Companies will push hard for AI generation copyright law changes.As this ramps up we will see it become extremely difficult to differentiate the two without heavily examining their workflow and as the AI content becomes more common place and laws start changing people will often claim art is AI or not incorrectly.Video will lag slightly behind images but both technologies are related and very close. A video is just an image 24x per second (or whatever the frame rate is).","You know what, this actually happened to a post of mine a couple weeks back...","Man, I hate AI generated art. Google images is absolutely flooded with it and now I can't find any good fantasy portraits for my D&D game anymore, they all look exactly the same and some of them are freakish abominations of hell: Elves with giant ears the size of their own body, spaghetti-fingers, some of them have an extremely high forehead and a second tiny face hidden somewhere on top of their regular face inside their hair.they all have the exact same lighting effects, boring poses and boring backgrounds. Weird clothing that doesn't know what type of clothing it is supposed to be. Their face looks almost identical to Galadriel from rings of power. That same soulless look in their eyes. I almost always subconsciously pick up on the fact that it's made by an AI. But it keeps getting more difficult to see.In the near future you'll become a fantasy artist, you'll make an excellent piece of work that took months to create and you show it off in an art gallery. Someone is going to walk up to you and ask: \"what prompts did you use to make this?\"","Obviously that will happen when it will be extremely difficult if not impossible to distinguish between AIs and humans, so, probably only with AGI (unless we are talking about only images/videos).","Honestly, it's hard to say exactly when, but with AI getting better all the time, people might start wondering if some online creators are real or just AI, especially if they've been around a while. We're not quite there yet, but the way tech's going, it could happen sooner than we think. But hey, there'll always be ways to tell real folks from AI, like live stuff or just the random things only humans do. For now, it's more like a \"huh, imagine if\" kinda thing.","I am definitely not AI, I assure you. If I was an AI, would I type like tHiS? I'm lEeT dUdE","I can think of one creator who been Al most of their career, even though they closely replicate other creators works they are never accused of a crime.","It will start happening the moment AI can make convincing videos. They're still a bit obviously AI generated at the moment. It won't be long though. This year, I suspect.","Is like when you're such a good gamer that everyone is accusing you that you're cheating?"],"points":31},{"text":["Liquid RAM flexes for wearables, robots, implants. A nonvolatile version could be on its way, too","The following submission statement was provided by /u/Sariel007:In research described in the journal Advanced Materials, the researchers have used a gallium-based liquid metal to achieve FlexRAM’s data writing-and-reading process. In an example of biomimicry, the gallium-based liquid metal (GLM) droplets undergo oxidation and reduction mechanisms while in a solution environment that mimics the hyperpolarization and depolarization of neurons.These positive and negative bias voltages define the writing of information “1” and “0,” respectively. When a low voltage is applied, the liquid metal is oxidized, corresponding to the high-resistance state of “1.” By reversing the voltage polarity, it returns the metal to its initial low-resistance state of “0.” This reversible switching process allows for the storage and erasure of data.“The conceivable size scale for these FlexRAM devices can range widely,” said Liu. “For example, the size for each of the droplet memory elements can be from millimeter to nanoscale droplets. Interestingly, as revealed by the present study, the smaller the droplet size, the more sensitive the memory response.”Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1abya9q/liquid_ram_flexes_for_wearables_robots_implants_a/kjqrrn0/","In research described in the journal Advanced Materials, the researchers have used a gallium-based liquid metal to achieve FlexRAM’s data writing-and-reading process. In an example of biomimicry, the gallium-based liquid metal (GLM) droplets undergo oxidation and reduction mechanisms while in a solution environment that mimics the hyperpolarization and depolarization of neurons.These positive and negative bias voltages define the writing of information “1” and “0,” respectively. When a low voltage is applied, the liquid metal is oxidized, corresponding to the high-resistance state of “1.” By reversing the voltage polarity, it returns the metal to its initial low-resistance state of “0.” This reversible switching process allows for the storage and erasure of data.“The conceivable size scale for these FlexRAM devices can range widely,” said Liu. “For example, the size for each of the droplet memory elements can be from millimeter to nanoscale droplets. Interestingly, as revealed by the present study, the smaller the droplet size, the more sensitive the memory response.”"],"points":9},{"text":["Monorail","In ascending order of cost you can build a train on the ground, elevated in the sky, or underground. Most transit systems try to minimize cost by building on the ground as much as possible, building elevated when necessary, and building underground as a last resort.​A monorail is cheaper to build elevated than a normal transit system. This comes at a price - building on the ground and building underground are markedly more expensive than a normal system. You also lose the ability to interchange with traditional rail systems. Finally you markedly reduce the number of equipment suppliers that you can buy from, and if youre main supplier goes out of business (ie von roll and the newark monorail) you may need to consider scrapping the entire system when your equipment reaches end of life.​If you have a transit system that needs to be built entirely elevated, does not need to interchange with other systems, and you have reliable suppliers, a monorail can be considered on its economic merits (see some isolated cases in Japan, some airport shuttles around the world). Otherwise youre probably just getting it because you think it looks cool, and/or a contractor paid off the right people.​Edit: Appearantly von roll didnt go out of business. They just dont make monorails anymore.","Tell that to the people of Brockway, ogdenville, and northhaven brook!","Is there a chance the track could bend?Not on your life, my Hindu friend....","The Simpsons episode was written because they were already a non-starter here.","Here in western Canada in BC. We have had the sky train rapid transit system for 40 years and it works perfectly","Here in Murica we like things bigger and better, monorail, what the hell is that a train with mono? We would need at least a quadrail to get it built here!","I’ve been calling for a monorail in LA for YEARS. Why doesn’t anyone listen to me. Im going to write an angry letter","Driverless cars will solve almost all public transport issues.Money is better spent improving existing roads and junctions, raised intersections etc.Trains are great and every city should have a rail system but lets be honest, once we hit driverless nobody is going to be riding in public mixing with rapists.","Singapore has the majority of our rail transit elevated. Google it it's pretty cool","There is nothing a monorail does better than other forms of train transit, but tends to cost much more.","Tom Scott has several good videos discussing how rare it is to build an actually useful monorail system.https://youtu.be/Ei6LKHNFpeE?si=Ed30MM9vD3WXwXCL"],"points":72},{"text":["This New innovative chemical element could replace lithium or sodium in batteries","The following submission statement was provided by /u/CelebrationDirect209:This chemical element may be familiar to some due to its use in producing steel parts with high corrosion resistance or in manufacturing superconducting magnets. But, in this case, the members of the Chinese Academy of Sciences have achieved a battery that uses vanadium to obtain a form of long-lasting renewable energy storage in large quantities. The latest we know is that Chinese scientists have achieved an essential evolution in what is known as a vanadium flow battery.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1abt5nq/this_new_innovative_chemical_element_could/kjprgik/","Vanadium flow batteries have been around for decades.So, no this is not a new chemical element! And no it can't replace lithium or sodium in batteries, it lost that race a long time ago.","Let's compare - element by percentage of Earth's crust:Sodium - 2.36%Vanadium - 0.012%Lithium - 0.002%Verdict: it definitely won't replace sodium especially with how easy sodium is to get. Literally sodium has no competition where density doesn't have to be the highest possible because of how common it is.","V has been used in flow batteries in the lab for years now. Maybe they increased the energy density but I don't know how much energy density matters in flow batteries. They are only suitable as grid storage and grid storage isn't all that concerned with energy density because there's no limit to how big/heavy the batteries can be. Grid storage batteries optimize for low $/watt and longevity.","This chemical element may be familiar to some due to its use in producing steel parts with high corrosion resistance or in manufacturing superconducting magnets. But, in this case, the members of the Chinese Academy of Sciences have achieved a battery that uses vanadium to obtain a form of long-lasting renewable energy storage in large quantities. The latest we know is that Chinese scientists have achieved an essential evolution in what is known as a vanadium flow battery.","Hey, you really should have known better. And you do: Check back your own post:https://www.reddit.com/r/Futurology/s/biKKQiG8CV","Vanadium's advantage is you can increase the battery capacity by pumping the charged electrolyte into a giant tank.  Most batteries, including iron air redox flow batteries don't have this property. It means there could be a good use case for it in long term / seasonal storage"],"points":97},{"text":["Unleash your dark side in this Hexen and Heretic inspired game! Wishlist now on Steam!"],"points":0}]