[{"text":["R Street Institute Concerns about the Kids Online Safety Act.","KOSA aims to extort people into sharing their ID and Social Security to use the web and allows AG to censor whatever they consider “inappropriate.” It’s a censorship campaign and poses a real threat to our privacy, safety, and freedom of speech. Call any Senator or Representatives you can to stand against it and/or go here. Don’t trust Blumenthal either, he’s behind nearly every internet censorship bill and wholeheartedly knows what others will do with it.He's forcing tech CEOs to meet with him tomorrow to push his bill, please help stand against it. https://www.badinternetbills.com/"],"points":2},{"text":["OpenAI's ChatGPT breaches privacy rules, says Italian watchdog"],"points":0},{"text":["COVID-19 testing firm 'exposed 1.3 million patient records'"],"points":0},{"text":["AI poisoning tool Nightshade, used by artists to disrupt AI models scraping and training on their artworks without consent, received 250,000 downloads in 5 days","I’ve got to wonder how many of the downloads were machine-learning enthusiasts who wanted to test the technology (and perhaps find workarounds)."],"points":6},{"text":["Microsoft AI engineer says company thwarted attempt to expose DALL-E 3 safety problems"],"points":0},{"text":["Tech CEOs expected to endorse legislation and preview policy decisions at Senate child safety hearing"],"points":0},{"text":["Senator appeared to suggest bipartisan bill would censor transgender content online.","KOSA aims to extort people into sharing their ID and Social Security to use the web and allows AG to censor whatever they consider “inappropriate.” It’s a censorship campaign and poses a real threat to our privacy, safety, and freedom of speech. Call any Senator or Representatives you can to stand against it and/or go here. Don’t trust Blumenthal either, he’s behind nearly every internet censorship bill and wholeheartedly knows what others will do with it.He's forcing tech CEOs to meet with him tomorrow to push his bill, please help stand against it. https://www.badinternetbills.com/","Sometimes, I feel like the world I have grown up in is coming to an end. It feels like privacy and technology is being broken everywhere, and it makes me really sad. Idk","Later that same day, however, Blackburn’s legislative director, Jamie Susskind, pushed back on the notion that the bill would censor transgender content online and appeared to suggest that Blackburn misspoke.Misspoke or was pandering to republican bigots? Lol","This will be used in unintended ways I 1000% guarantee it.","People need to start asking Microsoft and Snap why they hate trans kids","Jealousy is a bitch, just like the Senator","All fascist censorship is bad. Being mentally ill does not change this."],"points":130},{"text":["Security pros are being hospitalized by after-effects of ransomware hacks"],"points":0},{"text":["Cory Doctorow wants to wipe away enshittification of tech","\"Shareholder Value\" is the worst thing to happen to capitalism since capitalism.","If nothing else, Cory is a genius for so aptly nailing the term “enshitification”","Speaking of \"enshitification\", I open the Amazon app, search for \"Cory Doctorow\" and the first two results are sponsored content for romance novels.The enshitification will continue until shareholder value improves.","I met Cory 24y ago, and have followed his stories and books since. He's amazing!","That's a lot of words to dance around \"Capitalism sucks\"","The Internet was designed to be open, but we fucked it all up and allowed a handful of corporations to take over."],"points":96},{"text":["Taylor Swift AI images prompt US bill to tackle nonconsensual, sexual deepfakes","Cool. Do you think they’d finally do something about more traditional American problems if Taylor Swift fell victim to them too? I’m thinking maybe some medical bankruptcy? That’s a classic.","“or anyone who received the material knowing it was not made with consent”What constitutes “received” here? It shows up on your feed? Someone sent it to you? You click an unknown link and it download into your computer?What if there’s a Taylor Swift look alike that does give consent? Who is to determine if that is Taylor Swift or not? What if it’s a Minotaur with Taylor Swift upper body? Is that still her?This is the internet, broad bills that are open to interpretation is just gonna be used to selectively target people.Edit: I’m dumb. A centaur. Or I guess a Minotaur with Taylor Swift legs works as an example too.","Can we give Taylor Swift crippling college debt just to see what happens?","Sure would like to afford rent.","Sexual deepfakes have been a thing for over 25+ years, really. But because this happened to poor Taylor Swift and because it trended on twitter, Congress needs to do something?Well shit. Maybe we need to deepfake her being homeless or poor, and get it to trend. Perhaps we could get Congress to agree on affordable housing / wage inequality.","What other problems can we hope to fix once they start to affect todays ultra rich superstars?","Maybe they'd tackle homelessness if Taylor Swift lost her house keys and found herself locked out of her home for a while.","Oligarchy at work lol","Wish Taylor Swift could complain about the cost of groceries, or student loan debt, or ...","Hey taylor, not a big fan, sister is though but could you just move a smidge to the left and experience being targeted by ads and have an issue with your private information and data being sold or spied on by the country’s government? That’d be awsome if you could take issue with those things cause the guy in the yacht that lives on the land next to mine just barely doesn’t make it to the tax bracket you’re in so congress just won’t listen to small time no name folks like us. Oh, and if you’re having issues with not being able to afford healthcare, that’d be cool if you could talk to them about subsidizing that and allowing for the collective of citizens to put into said healthcare as well.Again, big ask I know but us 500 acre one yacht small town folks like us just don’t feel we have a voice in this conversation. It would just be cool to get all that done.","Would’ve been nice of them to care even before it happened to Taylor Swift.Students are making deepfake porn of their classmates. But when it happens to a celebrity, now people care.","Notably none of them noticed or gave a fuck until this happened to someone in the billionaire class.","If only Taylor swift had a disease that required an expensive daily medication to treat. We’d have universal healthcare by now.","A flagrant violation of the first amendment.Hustler Magazine, Inc. v. Falwell, 485 U.S. 46 (1988), is a landmark decision by the Supreme Court of the United States in which the Court held that parodies of public figures, even those intending to cause emotional distress, are protected by the First and Fourteenth Amendments to the U.S. Constitution.If someone is trying to pass off ai porn for real porn and you want to sue for defamation then that's 100% okay with me but this law as proposed is a violation of the first amendment.","Trojan Horse for most fascist control of art.","Genuinely interested if someone can ELI5 What can the government do to prevent this?They can't stop WikiLeaks... They can't stop the dark web... They can't stop copyright infringement... They can't stop torrenting.The internet is virtual and global... Some guy in China can create a deepfake of her having sex. How is the Federal Government conceivably capable of technically dealing with this kind of thing?","In an awkward time in my life, I once pasted my head on someone else's more muscular body and posted it to Facebook. I wonder if that 'digital forgery' would be considered criminal if something like this passes.","Can we do something about the corporate greed that's causing massive inflation? Or anything about wealth/tax disparity?Oh, something bothered celebrity white lady. Guess that's more important.","Thank goodness the government is finally doing something useful! As a balding, somewhat out of shape, sixty-something year old guy, I too worry about non-consensual naked ai images of me being circulated.Frankly, you should all be worried about this.","This didn't \"prompt\" anybody. They wanted something to create buzz so they slapped the Taylor Swift name onto this bill.","Zero chance they can even enforce it.","This bill will likely fail on first amendment grounds.","I can find deepfake porn of any celebrity I want and have been able to for years. But suddenly it’s AI and Taylor Swift and the government loses their shit. This isn’t to protect people it’s to gain control over AI so that they are the only ones with access.","When need Taylor swift to get shot in Chicago, have no health insurance, get addicted to fentanyl, become a homeless vet and take out student loans she can't pay back.Bros, I think we found the cheat code to ending all of America's problems.","Crazy how all of this only happening because Taylor Swift lol. How does someone who makes music is this damn powerful. This world truly thrives off celebrities.","Won't pass, Satire is 1st amendment rights. This wasn't meant to be believed, it was parody.","\"The measure would allow victims depicted in nude or sexually explicit “digital forgeries” to seek a civil penalty against “individuals who produced or possessed the forgery with intent to distribute it” or anyone who received the material knowing it was not made with consent.\"lol instead of swatting or sending glitter bombs, kids will prank each other by 'swifting' them, sending deepfakes of taylor swift so that they get sued into oblivion.For those of y'all who weren't around to see the Napster days, when old grannies were being sued because their grandkids downloaded tons of mp3s on her old computer, you're about to get an encore performance lol.","That’s like when the US tried to ban encryption in the 90s. Or copyright infringement since the Internet was invented. The technology is public and free. There’s no going back.","This has been an issue since deepfakes started becoming a thing. Am I supposed to applaud the fact that lawmakers are starting to pay attention now that it has happened to the most popular white woman on the planet?","Good luck with that.Don't tackle the hard problems that will help our average citizens. Try and solve the impossible because it annoys celebrities and the rich.","Seriously, fuck this bill.Officials never seem to give a shit until Miss billionaireb Swift gets involved and then the ball gets moving overnight?Just reminds me how the masses don't really matter simply because they do not have capital.","Yeah, it's amazing how fast they'll respond to literally anyone else but the American people's problems.Also, they can't stop this. The genie is out of the bottle.","Well they certainly took swift action!","Guys all that needs to happen is climate change needs to have some personal consequence for taylor swift and the govt will immediately enact sweeping reforms","worry about those fake pictures!! Not fentanyl no biggie","Well now that billionaires intellectual property rights are threatened by all means lets push that bill through asap without due diligence!","Censorship is never a good idea","CelebJihad had been around for a long time and no one batted an eye. Same with Rule34, not to mention 4Chan. ML has led to copyright infringement issues and more, and no one batted an eye. Taylor Swift porn itself has been around since she's been famous, and no one batted an eye. Now it's in Twitter though... And people keep making articles about it, further putting attention to it......","The quality of a picture should not be part of the equation.A \"deepfake\" should be treated the same as a stick figure captioned \"Emma Watson naked\"","Meanwhile, in the general population, thousands of women are subjected to real life \"revenge\" porn by psycho ex boyfriends every day. Which is worse? Which is the bigger issue?","The government wants to own/control AI even in artistic fashions?Good thing Taylor Swift is safe now","How about non-consensual deep fakes in general? Nobody should be using deep fakes of anyone's likeness without their permission in general.","You know what…whatever. If TSwift can keep Trump from getting elected, she can have whatever she wants. She just may be what we need.","Hyperbolic time chamber = Disrupt Taylor Swift public image","How many Republicans will sink this?","\"Your problem isn't my problem so no one should care\" - most people in this thread","You ever tried to tackle a brick wall with a whiny baby?","Ffs, they don't have bigger problems to handle than this??","that’s lame :/","I’d rather ban Taylor Swift. Wish congress would do that.","Boooooooooooooo","ITT a bunch of redditors saying that non-consensual sex activities don't matter because they don't get enough sexual attention to ever imagine themselves as victims of it.I look forward to dudes changing their minds about this issue once they see themselves starring as bottoms in deepfaked horse porn that gets attached to their professional names and sent to their entire extended families.","Guess whyhttps://www.dailymail.co.uk/news/article-13016529/Taylor-Swift-election-new-poll.html","It's unfortunate that the whole Taylor Swift fakes turned into what it is. The way I see it is, if you react in a way that causes attention, you're likely going to get more people onto the reaction train, which obviously caused more people who want to do harm, to do more harm.I do agree that it should stop, but there's really no-way to regulate it, unless, there is clear proof of who created it, or of someone sharing. At the minimum, there needs to be proof of intent to cause harm, distress, and or, attempting to pass it off as real.Bottom line is, if this thing passes, we might as well just call it, \"The Swift Act\", because damn, this seems tailored and swift.","I saw T Swift crossing the Northern border.","If it were another woman would they care ?",""],"points":1485},{"text":["Meta used copyright to protect its AI model, but argues against the law for everyone else","What part of \"You can't have it both ways, especially against your equally rich competitors\" do they not understand?","From the article: Meta argues strongly that copyright law shouldn't apply when online content is being used for free to build AI models. Unless the content in question belongs to Meta.The company formerly known as Facebook is investing heavily in AI, releasing models and generative AI tools to catch up with the explosive popularity of OpenAI's ChatGPT.Meta has joined Big Tech cohorts like Google and Microsoft in arguing to the US Copyright Office that the mountain of copyrighted text, imagery, and data scraped for free and used to train AI models is not protected under copyright law. Meta thinks effectively that everything available on the internet falls under \"fair use,\" because AI models like Llama do not exploit or reproduce copyrighted works. (Although they, in fact, very often, do).However, a few months before pushing this copyright stance, Meta attempted to argue in favor of broader copyright protections for Llama.","I too learned from copyrighted materials and then copyright my work.","I don’t see the contradiction here. Using data for training AI models should be fair use, given that it’s being used for a transformative purpose. On the other hand, the model weights were leaked and posted raw to a GitHub repository, which anyone can clone and pass off as their own. FB was correct to complain; without transformative reuse, you can’t simply take a copyrighted work, copy/paste it somewhere else, and pretend it’s your own thing.","I love AI but this is where I disagree with the AI community. Models really should not be considered private property but a public utility.Yea yea some of you will kick and scream it cost money to build the models. Which I agree with but there is something ethically wrong with locking up human knowledge. It’s the equivalent of trying to claim copyright on the Color red.Also the AI community must understand that allot of models we play with and enjoy are technically not open source or free to use.Effectively collective human knowledge is being locked up by big tech to only drip feed you the parts they deem safe. This is why the AI community obsesses over Uncensored models. Why should a corporate entity dictate what knowledge you can access when it was never there knowledge to begin with.AI models are effectively public domain and should be treated as a public utility.","Meta & Mega Motto: Rules for thee, but not for me!"],"points":31},{"text":["Washington state to develop guidelines for agencies using generative artificial intelligence"],"points":0},{"text":["Microsoft’s legal department allegedly silenced an engineer who raised concerns about DALL-E 3 | He says the image generator can produce ‘violent and disturbing harmful images.’","So can my imagination.","Any tool can be misused, any art form can be used to depict the disturbed and the depraved, this is pearl-clutching reefer-madness level hysteria based on ignorance. It reminds me of the fear of back masking and subliminal images on records and videos in the '80s.Lets lay off the whole \"Burn the Witch\" level dialog about AI, take a step back and consider who all this pumping up of hysteria about lack of control and copyright protection benefits...","The creative arts are filled with \"violent and disturbing harmful images\". Its like reporters and \"ai safety\" don't even understand anything about the creative arts and then say stupid things like that."],"points":21},{"text":["Tech CEO Garry Tan's Tweet Prompts San Francisco Police Report","Well thats profoundly tone deaf but also the very model of a modern tech bro","That guy sounds like his mother must be really proud of how he turned out","WTF is Y combinator"],"points":10},{"text":["Microsoft president endorses online child safety bill night before Big Tech hearing","This bill is another nightmare bill that will do nothing to protect kids.","Also it seems Blumenthal will try to get the KOSA passed in Spring (Not sure if he wants it to pass just the Senate by then or both Houses but its unlikely the House will have time to pass it before the election)","Ugh why in the literal hell is microsoft thinking supporting KOSA will spare them from any changes like seriously?Normally I don’t say stuff like this but I’m going to say it:Blumenthal needs to be investigated asap because he was sneakily passing this along with EARN IT during when the government had the debt ceiling/default stuff last year plus you got groups like NCOSE and Heritage Foundation pushing for this bill bad.Plus add in the fact during summer last year Dove Soap along with Lizzo (I wish I was kidding) were pushing hard for KOSA’s passage.There has been some real shady shit with this bill and considering the large amount of first amendment violations already within KOSA it should be stopped period.KOSA will not protect kids instead they will be more vulnerable on the internet than ever before plus LBGTQ content will be censored/removed to protect the fragile fake Christians.","*users only be protected with an E5 subscription","Someone needs to start running ads about Microsoft banning LGBTQ content to protect kids, so that they get their heads out of their asses.","Well they know it's coming matter what. Instagram already implemented blocking any account with content in question (including any speaking of mental health) behind a wall with a notice saying you legally cant see that account unless you sign in over 18."],"points":57},{"text":["CEOs from Meta, TikTok, Snap, X and Discord head to Congress for kids' online safety hearing | TechCrunch","Nothing will change.","We also need online safety for the weak-minded lemmings who fall prey to conspiracy theories and maga lies."],"points":6},{"text":["Using CRISPR technology, researchers succeed in growing tomatoes that consume less water without compromising yield","Nice work! Literally just yesterday I was contemplating just how many tomatoes I eat in all their various forms and realizing that they’re a really important crop. While most of my calories may come from legumes and grains, tomatoes are what make my vegetarian diet delicious. Making tomatoes less water dependent to grow is important work to future proofing our food supply. These folks deserve a round of applause.","One step closer to Tamacco! Let's go!","We just want them to taste like they would taste if they didn’t pick them when they were still green, like from the garden","Didn’t know that Calvin Klein was into Gene Editing. Congratulations I like your sweaters.","food never goes bad now because of CRISPR technology. Doesn’t this mean genetically modified?","And devoid of nutrition. Humanity seeking the lowest possible denominator.","Flavor, though, is fucked.","Would CRISPR be considered boss mode GMO?","Now, can we get tomatoes that taste like tomatoes?","... and they taste just like cardboard."],"points":70},{"text":["CEOs from Meta, TikTok, Snap, X and Discord head to Congress for kids’ online safety hearing","This a good start. We really need to protect kids from congress.","Isn’t this the bill that gives state governors/AGs the ability to label literally anything as “harmful to kids” including things like LGBT+ topics, guns, etc.?","Tech theatre. So hot right now.","Also it seems Blumenthal will try to get the KOSA passed in Spring (Not sure if he wants it to pass just the Senate by then or both Houses but its unlikely the House will have time to pass it before the election)"],"points":19},{"text":["Researchers uncover potential non-opioid treatment for chronic pain","You mean THC?","Big Pharmas hitmen liked that"],"points":9},{"text":["How Satellites Are Becoming the New Cellphone Towers","Credit to $GSAT, among others. So far they've given 2 years free satellite services to Apple phones.","So, idiots are whining that they're ruining their view and causing tumors by just existing in an area?*didn't read the article* ;P"],"points":0},{"text":["Japan government accepts it’s no longer the ’90s, stops requiring floppy disks","Can't wait for them to discover scanners and emails so they can finally abandon fax.","Japan hit the 00s in the 80s but never left them.","Coming back from Japan. They have way more tech integration in their daily lives compared to the US but it's so dated and looks like its from the 90s for sure.","I can’t wait to see the new anime centered around the use of floppy disks!","20 more years and they will find out about Blu-ray.","Japan is like the Aboriginals, only they got off the technology train in the 90s.","You lot amuse me , I guess none of you know how legacy organisations work. If this news scares you boy you best not google how the global fleet of aircraft get software updates. 💾","I knew they were using floppies but didn’t know they REQUIRED them! Fucking backward savages dude.","It's crazy to see how Japan has just been left behind technology wise. Japanese tech used to be top tier, now they're just reminders of a nostalgic period.","It might scare people to know that some older passenger planes still receive firmware updates via floppy."],"points":275},{"text":["Ars Technica used in malware campaign with never-before-seen obfuscation — Buried in URL was a string of characters that appeared to be random, but were actually a payload","\"Ars Technica exploited to distribute new malware. Click on this Ars Technica link to know more!\"","Dan Goodin for Ars Technica:• “This is a different and novel way we’re seeing abuse that can be pretty hard to detect,” Mandiant researcher Yash Gupta said in an interview. “This is something in malware we have not typically seen. It’s pretty interesting for us and something we wanted to call out.”• The image posted on Ars appeared in the about profile of a user who created an account on November 23. An Ars representative said the photo, showing a pizza and captioned “I love pizza,” was removed by Ars staff on December 16 after being tipped off by email from an unknown party.• The Ars profile used an embedded URL that pointed to the image, which was automatically populated into the about page.• Buried in that URL was a string of characters that appeared to be random—but were actually a payload.• The campaign also targeted the video-sharing site Vimeo, where a benign video was uploaded and a malicious string was included in the video description. The string was generated using a technique known as Base 64 encoding.• The campaign came from a threat actor Mandiant tracks as UNC4990, which has been active since at least 2020 and bears the hallmarks of being motivated by financial gain.","And this is why i continue to trust ars technica! Good on them for self reporting in such detail.","I’d be interested in seeing the logs of what was hitting the profile page/post. Not necessarily groundbreaking trying to hide it in plain sight as non-rendered base64.It’s also silly for an ongoing/persistent attack. You’d need to have some DGAs that involve heavily trafficked sites and pointers to various user content on the site.","Extremely confusing article, but I think I get it.Ars Technica was recently used to serve second-stage malware in a campaign that used a never-before-seen attack chain to cleverly cover its tracksIt sounds like someone created a 2-stage malware system:Stage 1: It infects your PC and watches for network requestsStage 2: When a network request is made to a certain URL, it extracts a binary payload from that URL and executes itSo basically, unless you already had the first virus, you're safe.As for why they chose to split this malware into 2 stages, I have no idea."],"points":538},{"text":["Researchers add a ‘twist’ to classical material design. They’ve discovered that crystals can twist when they are sandwiched between two substrates – a critical step toward exploring new material properties for electronics and other applications.","It’s a well written science article, cool concept"],"points":0},{"text":["Tesla shares slide after judge voids Elon Musk's $56 billion compensation","Judge Kathaleen McCormick in her decision found that Richard Tornetta had proved that Musk \"controlled Tesla,\" and that the process leading to the board's approval of his compensation was \"deeply flawed.\"Musk had \"extensive ties with the persons tasked with negotiating on Tesla's behalf,\" including management members \"who were beholden to Musk,: among them General Counsel Todd Maron, who was his \"former divorce attorney.\"CNBC","In a tweet late Tuesday afternoon, Musk wrote, “Never incorporate your company in the state of Delaware.”That's funny because tiny Delaware has more incorporated companies than any other state, because of their laws.","This is everyone on the board according to the verge:The board of directors consisted of a lot of people who had close relationships with Musk:Elon Musk.Antonio Gracias, a member of the compensation committee and friend of Musk’s who has amassed a great deal of wealth from investing in Musk’s companies as far back as PayPal.James Murdoch, another Musk buddy who vacationed with Musk across the globe. Musk’s brother, Kimbal.Ira Ehrenpreis, one of the members of the compensation committee, acknowledged to the court that his relationship with Elon and Kimbal Musk had “significant influence on his professional career.”Brad Buss, another member of the compensation committee who “owed 44 percent of his net worth to Musk entities.”Robyn Denholm, a member of the compensation committee whose compensation as a Tesla board chair was more money than she made from other sources.Linda Johnson Rice, who appears to have been truly independent.Steve Jurvetson, who had a prolonged period of absence during this incident and wasn’t considered a major player by the judge.https://www.theverge.com/2024/1/30/24056177/elon-musk-tesla-tornetta-55-billion-pay-package-rejected","How have Tesla shareholders not sued to have Musk removed for ignoring his duty to all shareholders? He told the company that he'd outsource AI work to his new startup unless the the Board gave him for voting control of the company. That's self-dealing, coercive, a conflict of interest, and an abrogation of his duty to all shareholders.Musk demands bigger stake in Tesla as price for his AI work","Imminent Twitter explosion incoming.","Amit Batish at Equilar, an executive pay research firm, estimated in 2022 that Musk's package was around six times larger than the combined pay of the 200 highest-paid executives in 2021.How people like this insecure egomaniac is beyond me. No doubt he will have his army of bots in his Twitter echo chamber to console him.","If he wants total power, go private. Musk wants the benefit of capital investment from investors and demands total control and pay. It doesn't work that way. Goodness! $56B in compensation? Unreal.","Ah, so that’s the reason for the bogus neuralink tweet today.","Would love it if instead of voiding the compensation, they could just void Elon altogether","It's down 3% after hours. It's down 23% this month. I don't think the current slide has anything to do with this judgment.","Billion? With a B?","So Tesla doesn't dilute its shares and the stock falls? Odd.","Haha, he has to pay for his propaganda website out of pocket now and lost more Tesla ownership. He is such a a liability as CEO. He was already transferring AI knowledge to twitter without any valid justification.  He cannot be trusted not to harm Tesla.","The shares went down because his insane pay package got voided?","Tesla needs to get rid of this drug-addled psychopath before he Twitters Tesla.","Why would Tesla share price drop when Tesla is poised to not grant Elon all those stock options?Is it because they're afraid Twitter-fool Elon will do something stupid and detrimental to Tesla, or is it because they think they'll lose Golden Boy Elon?What am I missing here?","So what happens to the options?","a) Delaware is no fan of Elonb) This could have a big impact CEO compensation more generally. Enabling 1 or a few shareholders to directly challenge the board.","“In the final analysis, Musk launched a self-driving process, recalibrating the speed and direction along the way as he saw fit,” the judge wrote. “The process arrived at an unfair price. And through this litigation, the plaintiff requests a recall.” -trial judgeThe judge is absolutely hilarious. And a woman, which must make Felon insane.And of course I can never get enough of that evil greedy scum sucking maggot Musk getting kicked in his nether regions.FU Elon.The Tesla shareholders have had enough of your narcissistic deranged insanity. Maybe.Why don't you quit and let decent knowledgeable people run Tesla? You can devote all your energies to driving tweety further down the toilet and making up bigger and better lies daily about yourself and how great you are.","The title says $56 billion, not million, and no one (other than the judge) seems to be mentioning the absurdity of even discussing such a number in terms of compensation.If earned over 10 years, that's over $15 million a day, or $639,000 per hour if he worked 24 hours a day, $1.5 million per hour if he only works 10.",""],"points":9967},{"text":["Soft artificial muscles developed for robot motion"],"points":0},{"text":["Adobe rejects Australian network’s claim that Photoshop AI caused enlarged breasts, exposed midriff of politician in photograph","As a graphic designer and avid user of Photoshop and all Adobe products for over 30 years, I can say that there is no way Photoshop did this on it's own especially if the image was just being resized.","Alisha Rahaman Sarkar in the Irish Independent:• An Australian news channel has been criticised for broadcasting a doctored image of an MP with enlarged breasts and an exposed midriff.• Ms Purcell, the youngest woman in Victoria’s parliament, posted the original and the doctored image on social media X to call out the news channel. “Note the enlarged boobs and outfit to be made more revealing. Can’t imagine this happening to a male MP,” she said.• Nine News apologised following the outrage, blaming AI for “automation by Photoshop”. “Our graphics department sourced an online image of Georgie to use in our story on duck hunting,\" Nine Melbourne news director Hugh Nailon said in a statement.• “As is common practice, the image was resized to fit our specs. During that process, the automation by Photoshop created an image that was not consistent with the original,” he said.• However, Adobe, the maker of the Photoshop software, hit back at the claim, saying in a statement that use of its generative AI features would have needed “human intervention”.• “Any changes to this image would have required human intervention and approval,” a spokesperson said [to the Guardian and the BBC].","Such Scallywags","That’s the slightest “breast enlargement” I’ve ever seen. Barely bloody noticeable","Did anyone else look at the pictures several times trying to see the difference?? No one can really be upset about that tiny ribbon of skin visible? Obviously the photos are altered by design. Photoshop doesn't just \"make\" random but specific updates to photographs. Someone edited the photos. But the word \"enlarged\" is doing more work in the sentence than whoever edited the photos.","Should be thanking them.","typical australian media. muddy the shit out of the waters enough so the idiots believe it."],"points":129},{"text":["Apple’s EU app store changes open door for Australia to improve digital platforms competition","This is good"],"points":1},{"text":["Wireless charging: The roads where electric vehicles never need to plug in","Wireless charging is such a waste of energy. You can't just transfer power where you want it to go, you have to generate a powerful omnidirectional EM field and the VAST majority of power used to generate the field is wasted.Perhaps you could combine it with sensors to only activate the field when a car is directly above it, but even then, you are still only transferring a tiny fraction of the power you input into the system.","We've already been over this so many times. It's way more expensive than just having regular charging stations. You're going to use magnitudes more materials to make chargeable roads, and continue to use more for upkeep. Not to mention running all the infrastructure for powering them as well.Much easier to just have a few parking lots, it's the same reason we don't do solar roads. Roads need upkeep, anything you do to make them more complex generally reduces their functionality and makes it a lot more expensive to keep them in good condition. There's just zero reason to have roads that charge your car for you in this manner, the downsides far outweigh the few upsides you can still get with regular charging stations.","Decent article but they say the Detroit stretch is only 1/4 mile. How much could you really charge in that length of road? Is it just a proof of concept?","Gtfo with this fairy tale horseshit","Ooh, ooh, tell me the thermodynamics fairytale again. I love this one with the unicorns and the roads that give out more energy than they put in."],"points":7},{"text":["Saudi flynas Reduces Carbon Emissions by 161,000 Tons","Carbon emissions in flynas operations during 18 months were cut by more than 161,000 tons of carbon dioxide (CO2), equivalent to planting 6.44 million trees, according to a statistical report on sustainability in the air carrier.Flynas, a leading low-cost Saudi airline in the Middle East and the world, revealed that the reduction is due to adopting several initiatives and practices with a sustainable impact on preserving the environment, in line with the Kingdom's goals to reach zero neutrality in greenhouse gas emissions by 2050."],"points":1},{"text":["UK law that could ban Apple security updates worldwide is an unprecedented overreach","Somehow I think banning encryption is a stupid idea. It's not like people will all of a sudden stop doing it.","I don't think UK laws can apply outside of the UK like this. If anything, it just means people in the UK don't get security updates.","This is absolutely insane, and would be condemned by world leaders if it was from any other country.Any company, individual, or organization complying with the UK on this proposed law should face huge fines and prosecution for doing so. This would make it easy for groups to do the right thing and leave the UK.","The UK ruling class just wanted to get out of the EU to finally realize their fascist dream, I see.","Why would they ban worldwide lol","Plain text WiFi …….. that sounds safe","It seems the UK would then be in conflict with its European GDPR obligations.","Time to make the linux of the smartphones","UK politicians trying to out do Hitler himself.","dude it's only UK! don't worry... they are irrelevant","This is about backdooring encryption, I don't see what it has to do with security updates.Not that it'll ever happen anyway.","From the Charlie Foxtrot that made Brexit a reality…","the rest of the world: um no? who tf do they think they arethey literally no longer even have the eu behind them","Encryption is math, and math is speech, thus in America, encryption is a First Amendment right.In other words, Apple would well be in their rights to tell the UK to go drink tea in Boston Harbor if they want to apply their laws outside their territory."],"points":832},{"text":["PayPal to Cut Around2,500 Jobs as Rivals Snag MarketShare","PayPal CEO13 days ago: “We will shock the world”Today: \"PayPal begins company wide layoffs\"","There are lots of legitimate complaints for how they handle most of their business, but what I’m guessing is really eating their lunch are these new pay later businesses.Which is really unfortunate because PayPal credit shits on afterpay, karma, and the others I’ve encountered. It’s the only one that still offers 0% even after the interest rate hikes.I highly suspect this to be the issue, because I use PayPal credit for a ton of my purchases and many merchants have dropped them for karma or some other terrible alternative that reams you with fees and interest.","I wonder why! The banned me because one client asked for an invoice for a SCIFI RIFLE. I make PROPS. Showed them, they didn't care. A friend was loggin in on his PC instead of mobile and they blocked his accc for 3 days (!). Fees climb higher and higher. Fuck paypal!","And I’m betting no one read the article because how could you? Literally soft-paywalled garbage that insists I register to get ‘5 free articles’. No.","PayPal has sucked ass for so long - I absolutely hate when I have to use it.","Any time a company in any way alludes to not having layoffs, they're going to have layoffs. The only reason they tell you they're not is that someone found out who shouldn't have and they're trying to keep people from jumping ship early.","I will say once again, in India, a national UPI infrastructure means that a street food vendor in Punjab pays 0% fees on any digital transaction. Just like cash.Why are we stuck with 2.9% fees in the US, like suckers? Why are we allowing private companies to essentially levy a sales tax?","Good riddance, scammers paradise... Hope they go under.","Sold a product for $1500 and on day 179 they pulled some shit with buyer protection and I didn’t notice until after I saw my account in the negative that amount. I had since lost my job, lost my bank account, and was really hard up for cash. I was expected to just fork over 1500 for shits and grins? And end up just at zero?I’m just like, nah I’m cool. But they wouldn’t let me cancel the account anymore. And I’d had it since 1999. I’m just like alright. Uninstall the app. Problem solved.My credit I don’t care about. Judgements? Go right ahead. I’m dying of an incurable disease that’s not responding to treatment.It’d be awesome to have to have to deal with it in the future but unfortunately that isn’t in the cards.What is cool is the customer got 1500 and I’m not even sure where it came from since I’d already got the 1500 and spent it 178 days previously. Bank account long since closed.Everyone came up except them. Maybe next time don’t do this 179 day bullshit buyer protection.I will never be using them again. For as long as I live lol","Once they split with eBay they went downhill and haven’t recovered","Companies should start to be punished for these kind of actions. I’m tired of hearing about mass layoffs daily.","Once again, repeat after me: \"There is no longer job loyalty\", only greed.","Dumped my account a couple months back.","Anyone can recommend me a good paypal alternative?","Wait, there are decent alternatives to PayPal? Can someone share some please?","That's a lot of jobs","It has been an absolute shit for like 10 years now. The shittiness of paypal even makes crypto seem less like a scam.","Layoffs should be illegal","So weird that so many places are incrementally increasing minimum wages and now there's more layoffs every year than the previous and higher experienced positions are having their salaries lowered....","Appreciate the pay per view, thanks","Study CS they said, it’ll be secure they said..","I’m just surprised they have that many employees to begin with 😂","They're fucking with people at this point"],"points":686},{"text":["PayPal Begins Company Wide Layoffs","Now they can blame it on the market not responding positively to their world changing AI innovation.","Okay real question because I’ve been thinking about this. Everyone doing layoffs one after another… do these companies see all the layoffs happening and then decide to do it as well because there’s tons of recently displaced workers and they think they can re-staff for cheaper?"],"points":1},{"text":["Medical researchers find AI fails pub test"],"points":0},{"text":["Jack Dorsey's Block lays off 'large number' of staffers, adding to wave of tech industry cuts","Whats funny is, I had no fucking clue what Block even was....Its Square... its FUCKING Square, they renamed the company from what it was well known for, the Square readers, to Block for the same reasons Google became Alphabet...","Once again, repeat after me: \"There is no longer job loyalty\", only greed.","Does that mean they're done blowing their money on blockchain and are going focus on the project that is actually valuable?","Starting to think TechBros don’t have the answers.","New year, new layoffs.","It took me much longer than it should have to comprehend that title.","I just don’t get how these people can sleep at night.","\"you aren't being fired. I'm helping you come one step closer to Nirvana.\"","Wait to you all realize they are coming to non tech industries seeing half of 24’ it’ll be a blood bath soon","RIP Bluesky. Didn't even make it out of the invite-only phase.","Make layoffs illegal","Jack ruined Twitter first and now Block/Square.","https://truckstop.com/blog/become-truck-driver/ maybe they should try this"],"points":974},{"text":["Netflix is different now — and there’s no going back","nope, there is only cancelling your netflix subscription and moving forward","yohoho and a bottle of rum.","I canceled most subscriptions. Only have Spotify and instacart now since they’re the only services useful for me. Maybe I can order my eye patch from instacart…","i’ve always stream everything on the high seas even when netflix just started out. You can find everything on these streaming sites and people use these Netflix, Hulu etc……. just for convenience.","I don't get the point of the article. Is it just to be sad about Netflix?","I cancelled when they dropped the dvd's. They can drive their revenue engine without me.","\"But even the Netflix that exists today is a far cry from what it once was, and it’s bound to keep pushing further away from that original vision.\"What was the original vision? Being unprofitable and letting unlimited users share the same account?This IS the vision for Netflix. Spend decades investing in growth (user acquisition) until finally focusing on profitability (price hikes, ad-supported tier, crackdown on password sharing). It's also the same playbook for 99.9% of growth-oriented companies in any free market economy.","I was never there , HDD Forever !!","I'm down to YouTube Premium and The Criterion Channel now. Not missing anything it seems."],"points":92},{"text":["CEOs Are Using Return To Office Mandates To Mask Poor Management","WARNING! The link in question may require you to disable ad-blockers to see content. Though not required, please consider submitting an alternative source for this story.WARNING! Disabling your ad blocker may open you up to malware infections, malicious cookies and can expose you to unwanted tracker networks. PROCEED WITH CAUTION.Do not open any files which are automatically downloaded, and do not enter personal information on any page you do not trust. If you are concerned about tracking, consider opening the page in an incognito window, and verify that your browser is sending \"do not track\" requests.IF YOU ENCOUNTER ANY MALWARE, MALICIOUS TRACKERS, CLICKJACKING, OR REDIRECT LOOPS PLEASE MESSAGE THE /r/technology MODERATORS IMMEDIATELY.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","100% - I got in trouble as a VP because I had, no kidding, made a measured 11% improvement in delivery and market response from our product line AFTER a reduction in force and remote mandate post-COVID.Why did I get in trouble? Because the CEO had already told the board that part of his plan to \"solve the problem of not meeting expected sales\" was to get the product development team to RTO.","This leapt out to me, and rings true:According to a recent research paper published by University of Pittsburgh, compelling evidence suggests that organizations are leveraging Return-To-Office mandates not to enhance firm value, but rather to reassert control and shift blame for poor performance onto employees. Contrary to the belief that RTO boosts company value, the analysis revealed that RTO mandates are more likely in firms with poor recent stock performance and have had no significant impacts on firm profitability or stock-returns. Moreover, a notable drop in employee job satisfaction was observed, further questioning the efficacy of these mandates.","We have this same problem in my company. We have people who just aren’t productive and instead of hiring competent people our executives would rather babysit bad workers and then force everyone down to that level it seems.I run out tech department so all my developers, managed service providers, and basically anyone I interact with is remote. We are constantly having this fight between me and the executives about remote work. Every single one of our top performers including sales is a remote worker.It’s extremely frustrating to work in a technology enabled environment where we refuse to utilize technology because our C levels are all old as dinosaurs.","Poor management and/or real estate financial liabilities.","Here’s looking at you IBM","I've been saying for years now, the push of RTO is because we're realizing managers don't contribute much to the work done. Work-from-home made managers have to work harder to make themselves relevant. And they didn't get that promotion to work harder. It's why they always cry about having more to lose the higher they climb because at worst they have to be a worker again.","I’m a millennial and managed a remote team prior, during, and after Covid. One employee I never met in person. We were all far more productive working remote. I held “water cooler” meetings each Monday for the team to get together and 1 on 1s every 2 weeks to touch base individually. That was more than enough. Our team was productive, happy, and crushing our work.","Am I the only one shocked that Forbes ran that headline? What a breath of fresh air.","RTO mandates are more likely in firms with poor recent stock performanceThat’s because they are using RTO mandates to reduce headcount in a way that avoids paying severance and unemployment.RTO mandates are a precursor to layoffs.","No!!! You're kidding!Sarcasm aside, tech has the absolute worst management of any industry. I've had better, more competent managers in fast food jobs when I was a kid than I have now.But those managers are so bad because their managers are so bad. This goes all the way up to the top.","My office made RTO mandatory 3 days a week, but the thing is that since it's mandatory, the act of going to the office feels like an accomplishment. So I don't feel as compelled to get anything else done since I already accomplished something.","We finally found a way to get cars off the road, but management wants us all stuck in traffic 2 hours a day burning that fossil fuel. It really needs to be framed as a global warming issue.","They always were. Accountability is a key function of management. But if you’re a manager that doesn’t know their job, it’s probably hard for you to judge the work quality and productivity of your employees.","it's wild how obviously twisted this, but no one who should care seems to care at all.my employer had record growth and profits all during lockdown and let people remain working remotely up until the beginning of last year. everyone did their jobs, did them well, and the company made a ton of money. in analyzing that, the executives completely buried their head in the sand when faced with the totally obvious superfluity of several layers of middle management, and have been pushing a full return to office. what's extra dumb is we are spread across across a ton of locations throughout the country, and almost no team exists in a single location. so, you go to an office to work remotely.","My work tried RTO. Lasted a week or so then everyone just went back to doing what they were doing before.That ship has sailed.","They are mostly using it to reduce headcount without paying severance","What a surprise. /s","The article just spouts the same old junk.Executives and Management who clearly don't know how to manage and motivate pine for the past, thinking it'll fix everything, living in denial that we can't go back. Plus not one ready to admit they stand to lose in commercial real estate if they allow more remote working.People can easily bypass any BS systems management puts in place to enforce RTO, and they're all running on borrowed time. Economy picks up and more jobs open, the companies who need/want top talent had better be ready to abandon the office.Remote VS Hybrid VS In-Office is not a one-size fits-all thing, even though many in management wish it would be.Companies who embrace more remote working need to explore other ways to enhance the culture and foster communication and collaboration regardless of where workers are at.","Now I get into work three times a week so that I can, in the office, do Zoom meetings all day, and then I leave at like 1 or 2 to beat traffic and/or not have to spend money on a lunch.Absolute fucking waste of my time, talent and life.","the poor management line is being used to mask the collusion to save business real estate market. and as an excuse to reduce head count.","I’d been enjoying one day a week work from home for nearly two years. At the beginning of the year my supervisor yanked it and said we need everybody in the office.I stay in my office all day and don’t interact with anyone unless necessary. Destroyed morale in my department","This will result in a subculture of employees going in to grab a coffee and then leave (coffee-badging) or share their badges with co-workers (shadow-badging) to meet the mandates.If they are using \"badge-in\" to determine compliance, whoever lives close can just check in all the remote workers often enough to keep the bosses happy.","Alright big conspiracy time. So I work at a large company and have a manager who knows tons of people at various levels of power in business and government. She suggested to me that the banks went to the govt and said \"We're gonna need a bailout because of all this commercial property\". Govt said \"No way\". Banks said \"Well then we fail\". Govt said \"How about this... we get a bunch of CEOs together and mandate RTO. If they don't we'll withold federal contracts.\"All heresay, but they wouldn't have to do this for every company. CEOs are like lemmings with layoffs and shit like this.For my company specifically, I'm suspicious that their pensions are heavily funded by Commercial Real Estate and obviously they haven't given any new pensions out in 20 years so those liabilities were being realized as the old timers bow out. Idk.There's also the trying to get people to quit instead of laying them off. That's a thing too.","Corporate real estate. That is the reason. Lots and lots of various billionaires money is tied up in corporate real estate. Can't have billionaires lose their investments!","Don’t they always mask poor management by blaming their employees for downfalls","It's almost like decades of marketing people failing upwards, stagnant wages & faux company family atmospheres breed resentful workers and terrible management.","CEOs are worthless money sucking sea anchors.They hold a company in a certain direction until it sinks or doesn't.I will never not be surprised that corporations will do what they \"think\" is best for everyone, until we're dead and gone, and then they will repeat the same thing for the next generation.It's so depressing.","It’s pretty simple, if you’re a poor performer in office you’ll be a poor performer working at home. If you’re a high performer in office you’ll be a high performer working from home. Work is not a location..it’s something an individual engages with.","Nah, it's about unused office space and opportunity to fire otherwise difficult to fire folks","Our company was doing well and growing. Then out of the blue we get asked (read forced) to RTO. Almost every department lost some of their best employee within the next month. The only reason I stayed is because I was able to negociate 1 day a week instead of the forced 3 days a week, but apparently im about the only person that got such a deal, so im not sure how long this is gonna last.","CEOs are stupid. If a job can reasonably be performed remotely then let people work remotely.It’s better for the environment to not have as much need to burn gasoline.It’s better for companies to save money on large office spaces.If productivity is lost then the leaders are to blame","Finally. Someone said the quiet part out loud. The Narcissist need supply.","If anything it’s highlighting the problem","If we only had nationalized health care as a right - so much easier to say your fing poor management does not suit me, see ya (2 week notice)","Summary:... not to enhance firm value, but rather to reassert control and shift blame for poor performance onto employees.Citation:Ma, M. S., & Ding, Y. (2023). Return-to-Office Mandates. Yuye, Return-to-Office Mandates (December 25, 2023).","It's all anecdotal. Don't let anyone fool you. Every business is different, every worker is different. I got a team of developers that love to work from home. I have some that love getting out of their house because their kids drive them insane.I got some developers who slack off. I have some who are rockstars.CEOs need to dig into the data to determine best course of action for their specific business. But they won't do it because they are so far removed from the actual work that is done, they forgot how.","Both in politics and business, we have a big problem with generational wealth and nepotism, allowing the dumbest among us to fail up, and it's become a pervasive in our culture. Idiocracy, here we come.",""],"points":6350},{"text":["Serious New Warning As Google AI Targets Billions Of Private Messages","WARNING! The link in question may require you to disable ad-blockers to see content. Though not required, please consider submitting an alternative source for this story.WARNING! Disabling your ad blocker may open you up to malware infections, malicious cookies and can expose you to unwanted tracker networks. PROCEED WITH CAUTION.Do not open any files which are automatically downloaded, and do not enter personal information on any page you do not trust. If you are concerned about tracking, consider opening the page in an incognito window, and verify that your browser is sending \"do not track\" requests.IF YOU ENCOUNTER ANY MALWARE, MALICIOUS TRACKERS, CLICKJACKING, OR REDIRECT LOOPS PLEASE MESSAGE THE /r/technology MODERATORS IMMEDIATELY.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","“Google has assured that all Bard analysis would happen on your device, meaning your messages wouldn't be sent to any servers. Additionally, you would have complete control over what data Bard analyzes and how it uses it.”Not sure why they buried that a few paragraphs into an editor's note, but it's right in there with discussion that Apple's implementation may not be limited to on-device either.","From https://support.google.com/messages/answer/13632636?hl=enHow your data is usedImportant: Data rates may apply when you use Magic Compose. Check with your carrier for details.Google doesn’t store messages or use them to train machine learning models. Up to 20 previous messages, including emojis, reactions, and URLs, are sent to Google’s servers and only used to make suggestions relevant to your conversation. Messages with attachments, voice messages, and images aren’t sent to Google servers, but image captions and voice transcriptions may be sent.Conversation privacyWhen you use Magic Compose, up to 20 previous messages are sent to Google servers to generate suggestions. Then Google discards the messages from the servers. No messages are sent to Google when you aren't using Magic Compose.","Google’s AI will read and analyze your private messages, going back forever.No. HELL NO. FUCK NO","Google has just unveiled a game-changing AI upgrade for Android. But it has a darker side. Google’s AI will read and analyze your private messages, going back forever. So what does this mean for you, how do you maintain privacy, and when does it begin.[...]But message analysis is different. This is content that does (now) fall inside that end-to-end encryption shield, in a world where such private messaging is the new normal. Here the ideal would be on-device AI processing, with data never leaving your phone, rather than content uploaded to the cloud, where more processing can be put to work.[...]This is where the Android Vs iPhone battlefield may well come into play. Historically, Apple has been much stronger when it comes to on-device analysis than Google, which has defaulted to the cloud to analyze user content.“Apple is quietly increasing its capabilities,” The FT reported this week, “to bring AI to its next generation of iPhones…src: https://www.forbes.com/sites/zakdoffman/2024/01/28/new-details-free-ai-upgrade-for-google-and-samsung-android-users-leaks/?sh=3ab4a7c97a94It's going to be interesting to see just how long it takes for Google to realize it is losing far too much trust from users to justify what it is doing in its data extraction attempts.And how long it takes them to realize that on device, generative AI can be used for more than just personal assistence, aka ad bypassing, etc.","These companies own the means of doing this to you - and they pretend it’s all benign and quietly sensible. But it’s insidious. Plus, they have a pretty horrific record of protecting your Data. We need way more protections in place and we need more court cases to start tackling this before it’s too late.","Why has Google been saving people's private messages \"going back forever\"? Do most people even have access to their private messages \"going back forever\"? You change a device, you change a phone number, stuff gets lost.So why does the Alphabet Corp have it?","Seriously what's the alternative to the Google platform? I'm genuinely curious and don't know anything.","Linux mobiles here I come. FUCK YOU GOOGLE!","I'm one of those people who deletes everything from my emails and texts. I wonder what that means for me. I think I have a problem with enjoying empty folders in my email accounts! :S","Why won’t Apple open up iMessage to Android users?!?!*Me motioning to everything","Happy I’m an Apple user.","Google, has been very very good to me.","AI doesn’t want to know how much we actually suck at everything.","Not a problem, no Android devices left in the house, No Amazon account, no Facebook account. Three layers of ad blocking between me and The Internet. WiFi on the phone is switched off before I leave the house and I VPN back to the house. No broadcast TV, just ad free streaming account. It isn't perfect but it does a reasonable job of keeping my PII out of the machine.","seems like this should be illegal. Oh we can improve your experience. IF YOU GIVE US ALL YOUR PRIVATE MESSAGES!!!!","This sounds like it’s the start of the world in V for Vendetta."],"points":252},{"text":["Companies Need a Better Read on What Their Workers Actually Do","We should introduce another layer of management to handle this business need.","I take the specs from the engineers and get them to the customer so the engineers don’t have to deal with the customer.","I would like the same activity report for my boss, his boss, and his bosses boss, as well as his bosses, boss.","No it doesn’t, shut up","I would argue that for most employees, knowing more of what the work actually entails would help the company but not necessarily help the employee.","No, we don’t need companies to be aware of shit. Companies are not people. Companies cannot learn, talk or interact with human beings.What needs to happen is that leadership teams, executives and any other persons in a position of power need to start understanding what the human workers do for the company they all work for. There individuals are actual people that can interact with other people because they are people and not a name, idea or building. When that happens, when that distinction is made apparent, then we can make progress.","No, they don’t. They need to better define what value their employees should be producing. At the end of the day, it doesn’t matter how an employee does their job, as long as it’s accomplishing the requirements.","Read Graeber’s book and it will depress you","Yep. In one of my previous jobs, even my immediate supervisor had no idea what my job entailed. They tend to promote people who network (read:suck up) with the boss instead of the people actually doing the work. I've always been a hard and very skilled worker, and watched the bosses buddy get promoted over me multiple times. At one point I was doing the supervisors job when we didn't have one, and they decided to promote someone from another department to the position. And it's not like I had a bad attitude or anything, the DoO just wouldn't let me be promoted because I was valuable where I was.","The Bureaucratic Supernova. Complex entities cannot work when 90% of the budget is for managers, administration, offices, and anything not immediately related to the actual job being provided.With the way technology has advanced in the past two decades, I argue that most office jobs are useless and can be done by software now - most companies do not need a dedicated billing department anymore when a properly configured self-serve app will allow the customer or sales rep to enter all the necessary information for SAP to compile into accounting reports. Most companies can go entirely paperless, very few industries actually require formal written communications or notifications and those that do often allow e-forms in their place. And even for highly technical jobs requiring a dedicated workstation and equipment, like pipefitting, most of it can be done by a computer now although it requires the technician to be both literate and a tolerable programmer .. which most companies won't make the investment in. In my opinion, all of this is due to a skills gap - business management colleges don't teach anything about technology, and laborers aren't expected to work with anything but their hands. The intense specialization compartmentalizes knowledge and prevents optimal business strategies from being considered.","No we don't! Stop with this shxt! We needed the country to be \"safer\" after 9/11. Now we have cameras literally everywhere and nothing has changed. We have cameras in our cars, there aren't less crashes. We have cameras in the offices, in the hallways, in the lobbies. There isn't less theft. There isn't more work being accomplished. All this monitoring isn't giving anyone a more indepth insight into why everyone and everything seems to be lacking when compared to earlier decades.","I know people in healthcare working as doctors, nurses, care aides etc and they report to department managers who have zero credentials in medicine or healthcare, those managers have business degrees and MBAs in project management or accounting, their previous job experience is often in the retail sector. When their lack of knowledge starts becoming an issue they conveniently get promoted away to another department leaving an even less qualified person to try to come pick up the slack.","No thank you."],"points":324},{"text":["Lindsey Graham Promises To Try To Repeal Section 230 Every Week","Lindsey Graham sucks. Dear South Carolina... please kick this guy to the curb. Pretty please. Thank you.","No problem. He'll abandon this promise just like he has all the others.","\"Lindsey Graham Promises...\"...and you've lost me as an audience. This \"man\" you speak of holds promises like they were buttered pigs, jacked up on meth.","Is he still mad Hunters dick pics couldn’t be shared on Facebook without being deleted by moderators?Wouldn’t it be easier for this clown to just come out of the closet?","Repealing Section 230 will just force platform holders to actually enact the censorship that the Republicans claim that they're currently doing. I don't get the endgame here.I think the idea is supposed to be that repealing Section 230 will let people who get banned for being racist sue the platform holders for violating their first amendment rights? I understand how an uninformed layperson could think that, but what's the deal with the Republican legislators? They know how 230 works, they have to know that the instant it's repealed, pretty much every conservative influencer up to and including themselves are going to be banned from every major platform, right?","Does he realize that Right Wing Web Sites would be destroyed if it actually happened, or is he a typical Boomer with zero idea what he is talking about?","Lindsey Graham is also a warmonger.He's paid and bought for by the Military Industry Complex.https://www.youtube.com/watch?v=Gg-jvHynP9Y","So does he have a personal vendetta to shut Truth Social down entirely?","Traitorous scumbag bleating like the oinker he is","He talks a lot of shit, but I can't remember a single good thing he has done in all those years.","And if there’s a probe, he promises to be on top of it at all times.","Lindsey Graham promisesThen you know it won't happen.","Lindsey Graham should get his little ladybugs removed","Apparently those tech companies haven't submitted the expected bribes (\"donations\") to Lindsey Graham yet.","he’s just trying to distract everyone from his ladybugs","Funny part is section 230 protects conservatives a hell of a lot more than liberals. They don’t realize with out 230 how quickly they would be silenced and massed banned.","In other words, please contribute to his PAC to get him to shut up","He's going to fuck over elon if he pulls it off.Elon is trying to turn twitter I to a multimedia platform.  Only thing stopp8ng swift from suing hom is 230.","Xshitter would not survive this, financially","Reddit is such an echo chamber.","You would think it's an election year and he's trying to put ANYTHING on the board for his party.","Come on out","How old is he ?","Lindsey Graham is a self serving, two faced, flip flopping, lying, back stabber. This is a guy that should not have the security clearance that he has."],"points":858},{"text":["Fake news YouTube creators target Black celebrities with AI-generated misinformation","","","","","","","","","",""],"points":0},{"text":["Apple Vision Pro Review Roundup"],"points":0},{"text":["Berkeley engineers image inside of complex metamaterials with features 50 times smaller than the thickness of a strand of hair","Here is the abstract from the paper:Recent advances in two-photon polymerization fabrication processes are paving the way to creating macroscopic metamaterials with microscale architectures, which exhibit mechanical properties superior to their bulk material counterparts. These metamaterials typically feature lightweight, complex patterns such as lattice or minimal surface structures. Conventional tools for investigating these microscale structures, such as scanning electron microscopy, cannot easily probe the internal features of these structures, which are critical for a comprehensive assessment of their mechanical behavior. In turn, we demonstrate an optical confocal microscopy-based approach that allows for high-resolution optical imaging of internal deformations and fracture processes in microscale metamaterials under mechanical load. We validate this technique by investigating an exemplary metamaterial lattice structure of 80 × 80 × 80 μm3 in size. This technique can be extended to other metamaterial systems and holds significant promise to enhance our understanding of their real-world performance under loading conditions."],"points":2},{"text":["Apple’s Vision Pro is the most data-hungry gadget I’ve ever seen | The Vision Pro brings us a whole new dimension of privacy risks. Apple appears to have only partial solutions","Some of the major issues highlighted by the author:I’m pretty sure Apple does not want to be known for creating the ultimate surveillance machine. But to make magical things happen inside its goggles, apps need loads of information about what’s happening to the user and around them. Apple has done more than rivals like Meta to limit access to some of this data, but developers are going to keep pressing for more.“There’s a tension between having these types of experiences and your privacy,” says Jarrett Webb, technology director at design firm Argo, who has been exploring developing for the Vision Pro. “It has to get this data to get an understanding of the world to invoke these experiences.”And once developers have data, it’s hard to ensure they don’t also use it for purposes that might feel like a violation.On some issues, Apple has drawn a line in the sand — at least initially. To combat people being surreptitiously filmed with the Vision Pro, there’s an indicator on the device’s front screen when it's shooting a photo or video. Apple also isn’t allowing third-party Vision Pro apps to access the camera to capture photos and videos. That would, in theory, also prevent third-party apps from doing creepy things like running facial recognition algorithms on people while you’re looking at them.But privacy researchers tell me photographs alone aren’t the biggest concern here. We have, since the days of Google Glass, come to terms with the idea a smartphone could be filming us at any time.The new problem is what else the device is gathering: a map of the spaces around you. The device needs to know the contours of the world around you so it can know where to insert digital things into your line of sight.Understanding what’s in the room around you can be even more invasive than having a photograph of it, says Joseph Jerome, a visiting professor at the University of Tampa and the former policy lead on sensor data at Meta’s Reality Labs.Vision Pro apps have the ability to access this data, if a user grants permission — like how an iPhone app asks for your location. These worldview maps might just look like a wireframe mesh to a human, but to a computer it reveals a lot.On a basic level, the Vision Pro might know it’s in a room with four walls and a 12-foot ceiling and window — so far, so good, Jerome says. But then add in that you’ve got a 75-inch television, suggesting you might have more money to spend than someone with a 42-inch set. Since the device can understand objects, it could also detect if you’ve got a crib or a wheelchair or even drug paraphernalia, he says.Advertisers and data brokers who build profiles of consumers would salivate at the chance to get this data. Governments, too....Information about how you’re moving and what you’re looking at “can give significant insights not only to the person’s unique identification, but also their emotions, their characteristics, their behaviors and their desires in a way that we have not been able to before,” says Jameson Spivak, a senior policy analyst at the Future of Privacy Forum.Apple has addressed the privacy around one extra-sensitive organ: your eyeballs. The Vision Pro tracks your eyes so you can select things with your gaze like you might move a mouse on a computer. But Apple says it doesn’t share where users look with apps, websites or even itself. Instead, the device only reports what you’ve selected with your gaze after you tap your fingers together, the Vision Pro equivalent of a mouse click.This is a solid place to start. But what about the rest of the body? Developers tell me apps can get access to a stream of data about users’ movement, right down to the wiggle of a finger....Mixed-reality devices are “very exciting with huge potential,” says Berkeley computer science Professor James O’Brien. “But I also think that privacy considerations need to be primary design criteria, not afterthought.”These are some important considerations that need to be made, especially as AR/VR devices become more commonplace. There are a host of parameters that can be tracked with these devices, both of the user and their environments, and having proper privacy frameworks and policies in place will be increasingly important. Ideally policymakers will have been looking in depth at these issues already, but given their inability to understand or manage the privacy implications of other devices now being widely used/deployed, it's unlikely that this will be happening anytime soon without significant amounts of public pressure.","I feel like this is just par for the course as people get more integrated with technology. Like, of course the goggles will have more privacy risks when they are your actual eyes, and they scan your face, etc.But what will the headlines look like when people are using a brain implant Or other biometrics, or implantables as technology becomes extensions of ourselves?","\"Advertisement paused - Please make eye contact with ad before continuing\" <-- probably shit like that coming in the future.","While all of those concerns are extremely valid, all of the data the author mentions - my home, my income, my face, my spending habits - are already thoroughly understood and documented by a Google.The most valuable data points about me to advertisers are my zip code and where I swipe my card, and they already know those things.","I don’t have anything to hide in my house so I don’t give a shit if Apple, Google, Microsoft, etc. knows I have a dope ass PC rig and some video production equipment.I however, will never own a fucking Alexa for this same reason. So I dunno lmao","Nice hit piece."],"points":8},{"text":["US disabled Chinese hacking network targeting critical infrastructure","How do you even disable a hacking network? In my understanding, the best you can do is reset their infiltration progress and prevent the exact same attack path in future.Disabling sounds more than that and I don't see how it is ever on the table in state sponsored hacking.","GREAT JOB! Wear them down.","-100 Social Credit"],"points":17},{"text":["'Mother of All Data Breaches' — 26 Billion Records Leaked, Users of LinkedIn, X, Venmo And More Panic Over Increased Cybercrime Risk","ChAnGe YoUr PaSsWoRd/Sthis is all bullshit. They collect the data and sell it, and then leave the people high and dry when shit goes south. They lobby to keep them from getting penalized, instead of just fixing their shit.","Quantum computing seen eyeing this like some sha256 breakfast biscuits","These corporations have made record profits but invest in nothing for protection of consumers. Sigh everything is being “Breached” nowadays. We need new security measures and to take it seriously.","joke’s on the hackers. 90% linkedass content fake.","Something has to change. It's clear that it is only a matter of time until your data gets leaked. Society has to come to terms with the fact that any malicious actor wether it is a phone scammer from the other side of the planet or a hacker next door knows more about them than the victim themself. It will be very interesting to witness what steps will be taken to safeguard individuals against this.","Article fails to list all the companies involved...","Yeah, that's sorta how giving your information to third parties works. You lose control of it and have to trust they invested enough or care about security. Sucks.","One silver lining to this news would be for the investors who have cybersecurity stocks in their portfolios.For investors thinking they've missed out on the run-up in publicly trading cybersecurity stocks, retail investors have been pouring millions into startups specializing in cybersecurity and data privacy. On DealMaker, a leading equity crowdfunding portal, Wault is accepting investments for as low as $100 to scale its software that makes credentials \"portable as a wallet, secure as a vault.\"Is this an article or an advertisement?","I just had a bunch of failed login attempts to my bank, ebay account, microsoft account, and discord all over the weekend.Thanks fuck for MFA.","Accountability, its the only way to fix it. If yoh have private data leak, you are now liable. End of story, companies would change IT infrastructure overnight.","From data breach to market capitalism in naught point three paragraphs.","But the cloud is secure, right?","Will Elon Musk have to pay a hefty(billions) GDPR fine? Could this be the final nail in twitters coffin?","I've managed to avoid (or quit) all of those but venmo, thankfully.","My 4 month old kid's data was already stolen via a data breach of a health insurance provider. 4 months old and his social security number alongside other information is already floating around on the dark web!","No user is panicking. We're all quite accustomed to services having fuck-all for actual data security and giving up our info at this point.","Just put some tape on it. That’ll do the trick! /s"],"points":303},{"text":["Jetbrains CEO Maxim Shafirov leaving the company after 22 years (11 of which as CEO). Kirill Skrygan who led IntelliJ department takes on CEO role effectively immediately","Well if the main guy from one of their premiere projects is stepping up I assume probably things are gonna keep chugging right along as normal.But I know nothing about Jetbrains corporate. Just that I like their IDEs so I hope things just keep going forward","Not a fan of jetbrains products anymore. Not because of quality but because I find them quite heavy on resources. I hope they get better","With a bad-ass villain name like that you don't need business cards.","Who?","Who?"],"points":149},{"text":["How an algorithm denied food to thousands of poor in India’s Telangana | Poverty and Development","how executives are getting really really comfortable with \"blame the algorithm/AI, not us\" excuse","Bureaucracy is really one of the strangest forces we don't think about.The bureaucrat always seeks to make their life easier. They force nomads to settle down for the sake of legibility. To a bureaucrat, order is what looks like order, grids, hexagons, and the like. They are far removed from actual realities of living, breathing, living life in the places that they manage.It's not as if it's a new thing that living things have been reduced to an algorithm. A willow, which provides bark for medicine, whose branches provide thatching, whose fruits nourish the critters in the forest canopy, is completely reduced on a paper ledger to a single number, to mark the amount of wood available to the state of some Enlightenment era monarch.In the US, John Oliver did a piece about people who the system thought were dead, also by same name mistaken identity. They had a hellish time trying to convince some stuck up bureaucrat that they were alive. It is a comedy that would put Kafka to shame, but no, that is reality.When Bee presented the evidence, the officials agreed there was an algorithmic error but said that her application could not be considered because her total family income exceeded the eligibility limit even though that was not the case.This is not merely a question of a computer making mistakes. You can make mistakes with paper and pencil just fine. It is the fact that we believe the computer is infallible that causes us to go wrong. This is perhaps a question for sociologists or psychologists to examine, on the subject of human beings and authority. This is not merely a technology problem, but a bureaucracy problem, of officials that are unwilling to use common sense and do their jobs. And that, is a far harder problem to solve."],"points":5},{"text":["MS-DOS and Windows 3.11 still run train dashboards at German railway — company listed admin job for 30-year-old operating system","Twenty years ago I was accused of encouraging hacking by introducing middle school students to programming through q- basic.","... A German railway firm posted a vacancy for a Windows 3.11 Administrator just before the weekend. In addition to skills in wrangling Windows for Workgroups on the 30-year-old operating system, the recruiter would look upon a candidate more fondly for possessing MS-DOS experience. The admin would purportedly oversee systems with 166MHz processors and a whopping 8MB of RAM.... . just imagine what government agencies & private sector entities & businesses are still using . . like say an abacus? . .\"If it ain't broke, don't fix it.\"","Had a buddy not to long ago do a consulting gig for a local international airport. They still had shit that ran on floppy disks. There is still a lot of shit that runs on older OSes because it just works.Probably a decade ago while working for an auto company, we were trying to get an old VIN engraving piece of software to run on a \"newer\" OS (Windows 2003 or Windows 2008) from Windows 2000. It was written in Visual Basic 3 which is thankfully easily decompiled to actual source code. Would have shut the line down at one plant because they didn't know what to do. I got my start on VB3 on Windows 3.1 and breaking Windows.","We still have systems on DOS because they connect to equipment that doesn't work on newer operating systems for one reason or another. Maybe the card to connect the PC to the equipment uses an ISA slot, maybe the software doesn't communicate properly with the hardware when run in an emulator, maybe there's something fucky with IRQ and COM port configuration, maybe if the CPU is too fast, it breaks something...Obviously we want to use newer stuff (when a motherboard dies in a 30-40 year old desktop, it's a bitch and a half to deal with), but sometimes it's not feasible due to technology incompatibility.Beyond that, here are two more stories of upgrade failures:Story 1: Replacing all Win XP computers with Win 7. I wanna say this was in 2014, give or take a year. Win XP machines connect to manufacturing equipment. Cost per system to replace the desktops is $$$-$,$$$ per system, so $$$$ total. Easily doable as part of the greater effort to replace all the desktops at the site, which was $$,$$$. Well, the software that communicates with the manufacturing equipment didn't work on Win 7 in testing and the software vendor informed us we'd need to buy new software, which would cost $,$$$ per computer. However, that new software didn't work with our current manufacturing equipment so we'd need to get new manufacturing equipment, which was going to cost $$$,$$$ plus the $,$$$ it would cost us to dispose of the old equipment (or we could throw it in the back of a warehouse and forget about it, which was usually what they did with most things). The business opted to just keep those computers on XP, and segment them from the rest of the network.Story 2: Replacing two Win 7 PCs with Win 10. This was in 2019 into 2020. Similar story to above - Win 10 didn't work with the current software, new software that works with Win 10 didn't work with the current equipment, so they'd have to purchase two new PCs plus two new software licenses plus two new pieces of equipment. Total cost $$,$$$. They had the money and decided to spend it. When it came time to decomission the Win 7 equipment and old hardware, they then decided \"wait a minute, now we have 4 PCs that can [do the task] and 4 [equipment] so we can increase our throughput of [task] by double!\" and opted to run the Win 7 machines and Win 10 machines side by side.","North America: \"you guys are getting trains?!?\"","Very common, to switch over would cost tens or hundreds of millions of dollars,","That’s not a surprise. Most government work I’ve done in the US has been via mainframe systems (or web-based portals to said mainframes). It works; it is relatively hack-safe compared to modern infrastructure. The sad part is in my area the modern systems used to replace the mainframe perform the tasks worse! I’m sure that is incompetence but incompetence and government are besties.","Is this news? I work for one of the largest railroads in North America. Literally owned by one of the wealthiest people on EARTH. And I still have to submit my time tickets through a Wang Computer OS.","It’s a wonder they haven’t been hacked","what the actual fuck.","Yeah, it is. Just like teaching long division is encouraging tax fraud","wibble.exe“You’ve been bearded!”","There is a modern open-source ms-dos compatible. https://www.freedos.org/Microsoft actually open-sourced MS-DOS 2.0 proper a while back though - yes really. Freedos has api compat with much later MS-DOS versions than that though, still worthwhile. Sortof.Would it make more technical sense to use something more modern? Um, yeah, green-field, sure. But lots of legacy embedded/industrial x86 stuff out there, so having open source MS-DOS options around is good to know about.Never mind that newfangled MS-DOS, there's even still CP/M and CP/M clones floating about!http://www.cpm.z80.de/http://cowlark.com/cpmish/https://zgedneil.nfshost.com/zcn.htmlhttp://t3x.org/cpnc/","Ms dos and win 3.11 runnin trains","They did just crack a $2B ring. Should probably use that money","I got a job in insurance last year and was shocked to learn we still used DOS to file a good percentage of our claims/policies. Luckily I had used a DOS system as a kid, but it was a steep learning curve for a lot of folks.","Several places still use fax machines","I could do it","To be fair Windows 3.11 is windows last Stable operating system.","These are so simple, easy job.","Weird to think that Germany's biggest and most well known tech companies are SAP and Siemens, founded in 1972 and 1847, respectively."],"points":161},{"text":["US disabled Chinese hacking network targeting critical infrastructure, sources say","From the Article:“The U.S. government in recent months launched an operation to fight a pervasive Chinese hacking operation that successfully compromised thousands of internet-connected devices, according to two Western security officials and one person familiar with the matter.The Justice Department and Federal Bureau of Investigation sought and received legal authorization to remotely disable aspects of the Chinese hacking campaign, the sources told Reuters.Known as Volt Typhoon, the malicious cyber activity has alarmed intelligence officials who say it is part of a larger effort to compromise Western critical infrastructure, including naval ports, internet service providers and utilities.Such breaches could enable China, national security experts said, to remotely disrupt important facilities in the Indo-Pacific region that in some form support or service U.S. military operations.A Justice Department spokesperson declined to comment. A spokesperson for the FBI and the Chinese embassy in Washington did not immediately respond to a request for comment.When Western nations first warned about Volt Typhoon in May, Chinese foreign ministry spokesperson Mao Ning said the hacking allegations were a \"collective disinformation campaign\" from the Five Eyes countries, a reference to the intelligence sharing grouping of countries made up of the United States, Canada, New Zealand, Australia and the UK.”","I’m more impressed aol.com still exists.","Wait….AOL is still online?!","Old man AOL still around I see.","How is this literally not acts of war ? Or even looked at as war preemptive attacks on the US (and other countries I’m sure, because we know everyone tries it) and why do we do nothing ?","China really gearing up for Taiwan. And im the right age for the next coming years. Welp, I'll see you on the beaches"],"points":37},{"text":["RTX CHIMERA new microwave fries drone target during White Sands testing | Throughout a three-week field test, Raytheon's CHIMERA high-powered microwave system managed to fry static targets and track aerial targets flawlessly.","For those of you confused, Raytheon merged with Collin’s Aerospace and Pratt and Whitney to form RTX.This is definitely an invention out of the Raytheon side of things though.","But does it run Crysis","I will cover my drones with a microwave mirror and fry the CHIMERA.","Imagine saying “RTX Chimera New Microwave Fries Drone Target” to a pilgrim","Sure, but it all hangs on information we won't get. We'll get PR numbers, but it would be interesting to know how effective it actually is. Seen too many military/government projects to trust just because someone says it's good to rely on that statement.","Now we just need to ship a few to Ukraine for field testing","RTX ONDrone Dies"],"points":52},{"text":["Boeing withdraws bid for safety exemption for Boeing 737 MAX 7","Boeing needs a management overhaul. They really need engineers leading the company instead of financial guys/gals.","The profit motive has taken priority over quality at Boeing. Bad idea when people can fall out of the sky because some bean counter wanted to save a few pennies.","Yeah, nice to see Boeing finally wake up to the optics of this a little. When your aircraft are rapidly becoming suspect for cut corners and production laziness creating catastrophic risk, maybe not a good idea to try for safety exemptions on the airframe creating most of the problems.","Execs there need to face actual consequences. They skirted everything for the bottom line. The addiction to profit lines needs to be treated like drug addicts. It's the same thing. When you're willing to murder random people for your fix, that's an addiction that requires either rehab or imprisonment.","From article; She noted the exemption Boeing had sought \"involves an anti-ice system that can overheat and cause the engine nacelle to break apart and fall off. This could generate fuselage-penetrating debris, which could endanger passengers in window seats behind the wing.\"This description of the problem understated the possible effects of inlet anti-ice failure. The inlet is just as likely to be ingested by the engines. A single or double engine failure could prove catastrophic for a 2 engine aircraft. There's no way the FAA would ever approve this, and this was a contemptuous move by Boeing.","Better to withdraw than to be denied with prejudice","For an airplane there should not be even a concept of safety exemption.","The entire executive staff needs replaced, end of story. Boing was a company literally built by engineers. Now all but one executive is an engineer and that is only for legal reasons. MBAs are for the finance department, not the board room.","Can they not continue to self-certify with Federal approval? What’s happened that I missed /s","Well at least there’s still airbus.","Boeing is proof that self regulation does not work","We need a fuckton more regulation with these asshats, no more fucking \"aww I don' wannnaaaa 🤡\" exemptions.I'm friends with someone who works making chips for these and others government contracts, the boss's kid is C suite nepo-ed into management and has FOR YEARS pushed chips through that fail.Happy flying y'all.","We need harsher penalties on these corporate psychopaths. And a justice department with the balls to actually prosecute them. C-suite assholes indirectly kill way too many people through their incessant greed.","What an absolute garbage fire of a company, just so casually messing with people's lives for a few dollars of profit...","As greedy as Boing should be a new saying","\"safety exemption\" shouldn't be a thing for giant tubes with hundreds of people in them flying 40,000 feet in the air.","“You can’t fire me I quit!”","I will never fly on a Boeing aircraft again. They have had 2 major safety issues in the past 10 years. You would think they learned their lesson the first time.The question that is at the front of my mind is what else do we not know about?","How is a safety exemption even a thing in the first place?!?","Good. Sounds like they’re considering the bad optics around their brand right now. Or so I’d like to believe.","Safety exemption meaning what exactly ?","Shame on Boeing.  I will never fly Boeing again.","Good move. It never would have been approved. They will just have to delay the plane until the fix/feature is completed.","It’s a start.","Boeing needs to move production to Japan, Taiwan, S. Korea, or Singapore where workers take pride in their work. Any job that involves nuts and bolts is too high level of a job for the low skilled work force that america has to offer.","I hope this is a wake up call for those who think there is “too much red tape” impeding businesses."],"points":1561},{"text":["Apple Vision Pro review: magic, until it’s not","Contrary to comments so far, this felt like a fairly salient review. Gushing about some of the neat and very well executed features, but admitting that it is, as it always seems to be the case for MR / AR, still looking for its killer app. Still bound by technological limitations.I’ve been telling everyone who talks about this with me that I will surely see folks wearing these on the plane in business class. Hell, if that’s the kind of money I have I’d be doing that too. But the summary of it feeling like an expensive TV is apt. It’s just too expensive for what it ostensibly is (currently).","Excellent video review, definitely something I’d like to try, although not something in budget for gen 1 at least","My response to this is the same one I've had to every VR headset so far: \"Neat.\"\"Are you going to buy one?\"\"Nope.\"","I can justify spending a boatload on new tech toys, but I can’t for the life of me figure out one thing this headset can do that could even remotely justify the cost. I was waiting for some revolutionary apps or games or something… nope, I can look at my photos on a bigger screen for $3500. No thanks","The big question is can I watch porn on these or what","I think that VR works best if you are alone in a room. I'm not sure that AR is useful in that situation. I wouldn't feel safe using around people such as on an airplane.","The most important part of the entire (great) review is where he mentions he only found it comfortable to wear for 30 mins - an hour at a stretch. No device causing that kind of physical discomfort will ever become an integral part of my life (in the same way as my phone or my PC, at least). And I like gadgets and am willing to endure a little wonkiness in the name of cool tech, but nothing about this product seems worth it.","I still view the lack of handheld controller options as the biggest limitation of the product, as the review showcased in new ways… you always have to look at what you’re controlling.  It’s especially surprising with how much Apple makes in App revenue from games which are so dependent on controllers of some kind. I think if Apple holds firm and doesn’t offer something like that soon it could be a big barrier to entry for many apps and customers.","Excellent review!","someone in the iphone sub saying s/he wishes apple vision pro will replace iphone one day.imagine wearing this when you need to take a call or use an app or pay with stuff. we have some really die hard apple fans out there","Sure apple makes cool machined metal products but I just don’t think heavy hunks of metal are the appropriate material for something strapped to your head","Currently it’s a lot of “what you already do now, just a bit better or a bit worse”. To succeed it needs “what you have never done before”.","I felt this was a good review. Eventually we will all own one, but that may take a decade or so.","I know I know. In the spectrum of buying decisions you always got your first group of people that are gonna buy the first version of any new tech, especially when it comes to Apple. But I’m definitely like the, wait til it’s a few gens in and 2500 dollars cheaper crowd.","I think it would’ve been a productivity beast if it supported 4+ mac screens or had some deeper Mac integrations. only a single screen plus visionOS apps is a disappointment","These devices are like trying to emulate scifi when technology revolutions like the iPhone were more well-engineered novel concepts that could be scaled to increasingly diverse applications (accelerometers, gps, glass touch, eventually a good dev ecosystem give or take).","Another VR paperweight? Really!!? Well I am surprised.Can wait to see the Apple car next 😂","Great review.Apples solid entry into VR land is still a VR headset, a preview of a future that’s just not ready yet","Everyone pointing out the lack of use cases for these things, but think about what could be on the horizon. If they manage to convince enough productivity applications to change to accommodate this form factor companies could literally downsize the space required for employees by so much it would be insane. One day we will live in a world where working is just your company restraining you in the equivalent of a coffin with a VR headset on, and you just do your tasks for your entire allotted work time.No more workplace socialization, cumbersome desks and offices, no more breaks (just add in a feeding tube and built in toilet), or any other distractions. Just you, your headset, and the bare minimum of space for you to live. The future is coming! (/s)","Basically if you're interested, get a Meta Quest 3 instead.","Yeah I think I'll wait 10 years and see.","I really liked this review. I felt like it was stripping away all this awe and hope of what VR could be, and recognizing what it currently is.","I can't wait for something like this to come out that isn't tied unnecessarily to the Apple ecosystem.Of course it'll probably just be tied unnecessarily to the Google ecosystem and never get another update after promising the world.Or it'll be unnecessarily tied to the Microsoft ecosystem, which works for like half a year before a key part of it is replaced for some other thing, and renders it inoperable.Sorry, what were we talking about? Everything is awful?","The first thing they’ll cut is the front screen. It’s pointless gimmick. That will reduce weight and cost.","So, basically does the same as a quest but with a better screen for 7x the price... gotcha. Also, can't do pcvr, which is one of the best selling point of  vr for immersion gaming. I tried to work with a vr headset and there's a reason why the battery is aimed at 2hrs, it's because wearing a headset for longer than that is almost impossible. And have fabric bands will stay clean for 2-3 months until it starts to get quite dirty. I'm not sure you would like to have a dirty band for 2-3 years at the office. Well, it's going to be exactly like the 3d tv. Not enough content, not user friendly enough (a family of 4 that want to do a movie night in VR/AR in the same house is looking at 14000$ USD of equipment, lol). So, I understand this is a \"concept\" product, there's no way it will be other than niche for the next decade at least. VR headsets are still very niche at 500$ and I own one and nobody in the house is really interested to use it. I've put maybe 200hr combined in the past 3 years. It's just not that useful or good to play or use.","90 degrees FOV and a nose heavy face sucker for $3500. What is this, a return to the 90s? Until you fully engage peripheral vision you're not THERE, you're just wearing a TV, whatever version of reality you are spinning.Someone who worked on HMD development once upon a time - and solved it.","at $3499.. it's really got no chance in the market to make it. sad actually.","What is the obsession with viewing reality through a corp's pay wall? None of this shit is appealing. These dimps are chasing a broken retro futuristic idea of technology. Dumb, dumb, dumb.","Drawer sitters","Having screens in front of your eyes and then cameras on the outside transmitting images to those screens is an absurd way to do AR in my opinion. When is the laser image retina injection going to start?","Really bummed to hear that it only lets you use one screen for macs. It would be so cool to have 3 screens up. Not like I was planning on buying it anyway lol","quest 3 is like 10x less, 4k almost is truly some next level bat shit pricing.",""],"points":1485},{"text":["Apple Vision Pro review: This is the future of computing and entertainment","Well if CNBC says it it MUST be true.","I really thought Google Glass was the one","Remember when we had 3D TVs and glasses","lol no it's not","They couldn't even fit the battery inside. Feels like an expensive prototype.","Wearing a screen on your face? No thanks.","If VR was going to be the thing, it would already be the thing by now.","If you look like a doofus using it then it won't ever be trendy no matter how useful it is.","How much did Apple pay for this article?","This dumb stuff has come up every couple of years for the last 30 and it has never, ever caught on.","Stop trying to make VR headsets a thing. The vast majority don’t care.","This thing is DOA. Who the hell is going to pay that price? Also the bag to hold it in is another $200 bucks. Apple is gouging the fuck outta you...","hololens 2.0, surely this time it will catch on","Vision Pro is atrocious lmao. A prototype at absolute best.","Everyone who had a Meta Quest or a Vive in 2017/2018 thought the same thing. It isn't. Your face gets sweaty, the lenses fog up, and no matter how \"light\" it is, you become hyper aware that you have a thing on your face after an hour.Cool for simulator games, but the \"setup\" becomes so much hassle that you eventually just want to sit down and play and a monitor ain't so bad. I'm not a real rally driver, I don't need it in stereoscopic 3D.Apples way late to this party, and they're not going to come up with some \"killer app\" experience that hasn't already been done by now to make a $3K headset worth it.Reviewers who are Apple-centric are going to have their minds blown until it's sitting in a corner collecting dust, just like those of us who bought a Vive in 2018.","I can see that. It'll have to get much cheaper and smaller of course.","This could potentially be the next big thing like iPhone was back in the day. Although if that ever happens physical activity will decrease significantly and that could lead to a lot of health issues. This happens today with smartphones already, imagine the impact the Vision Pro could have.","The guy in the picture looks like a young Berta","The fools! Don't they know that VR5 is ALIVE??!","Ads on the thing in my hand are bad enough. I’m sure ideally this could be great but we all know how it’ll play out in reality","I don’t believe you.","Total BS. Can't even take the headline seriously."],"points":129},{"text":["The Rise of Technoauthoritarianism | Silicon Valley has its own ascendant political ideology. It’s past time we call it what it is","Two of the more interesting reminders from this article:To worship at the altar of mega-scale and to convince yourself that you should be the one making world-historic decisions on behalf of a global citizenry that did not elect you and may not share your values or lack thereof, you have to dispense with numerous inconveniences—humility and nuance among them. Many titans of Silicon Valley have made these trade-offs repeatedly. YouTube (owned by Google), Instagram (owned by Meta), and Twitter (which Elon Musk insists on calling X) have been as damaging to individual rights, civil society, and global democracy as Facebook was and is. Considering the way that generative AI is now being developed throughout Silicon Valley, we should brace for that damage to be multiplied many times over in the years ahead.The behavior of these companies and the people who run them is often hypocritical, greedy, and status-obsessed. But underlying these venalities is something more dangerous, a clear and coherent ideology that is seldom called out for what it is: authoritarian technocracy. As the most powerful companies in Silicon Valley have matured, this ideology has only grown stronger, more self-righteous, more delusional, and—in the face of rising criticism—more aggrieved.The new technocrats are ostentatious in their use of language that appeals to Enlightenment values—reason, progress, freedom—but in fact they are leading an antidemocratic, illiberal movement. Many of them profess unconditional support for free speech, but are vindictive toward those who say things that do not flatter them. They tend to hold eccentric beliefs: that technological progress of any kind is unreservedly and inherently good; that you should always build it, simply because you can; that frictionless information flow is the highest value regardless of the information’s quality; that privacy is an archaic concept; that we should welcome the day when machine intelligence surpasses our own. And above all, that their power should be unconstrained. The systems they’ve built or are building—to rewire communications, remake human social networks, insinuate artificial intelligence into daily life, and more—impose these beliefs on the population, which is neither consulted nor, usually, meaningfully informed. All this, and they still attempt to perpetuate the absurd myth that they are the swashbuckling underdogs....“Our enemy,” Andreessen writes, is “the know-it-all credentialed expert worldview, indulging in abstract theories, luxury beliefs, social engineering, disconnected from the real world, delusional, unelected, and unaccountable—playing God with everyone else’s lives, with total insulation from the consequences.”The irony is that this description very closely fits Andreessen and other Silicon Valley elites. The world that they have brought into being over the past two decades is unquestionably a world of reckless social engineering, without consequence for its architects, who foist their own abstract theories and luxury beliefs on all of us.This article serves as a useful summary for us about some of the philosophical and/or political underpinnings of a good number of Silicon Valley's power brokers and their supporters. It's good to question regularly both the logic and the motives of those pushing these kinds of narratives, and measure them against what we might want for ourselves and our society. But to do this, there also need to be compelling visions about the basics of what we might want of our cultures and societies.","This 👆Like past technological ages, the latest round has created a cadre of leaders whom were advanced on a mix of luck and brilliant vision. This is often confused with authority to lead.However they still have power and like any exponential threat the mitigation must be swift and of sufficient magnitude through political means.","They wanna live forever and rule forever","Pretty good read.","I truly miss feeling optimistic about the internet and all the wondrous possibilities it could bring.","The one interesting thing in Rebel Moon was the High Priests of Data.","It’s past time we call it what it isThen call it (libertarian) capitalism, that's all it is.","Good find -> \"Technoauthoritarianism\"Some speak about techno-feudalism.Same shit. Different names.","Outstanding piece here. ...Yep, it's long past time that some of these issues are called-out.You know, there's be a lot of terming things as \"Neo-Techno Feudalism\" or what have you. But, we need to be clear on this, we're talking about authoritarian types of relationships across a variety of domains. Whether with Zuck, Elon, Andreesen or Thiel, they very much are trying to consolidate power unto themselves, and themselves alone.There's not one of them -- not one(!) -- that wouldn't make the average James Bond villain **blush\\\\** with the utter shamelessness they've been using to operate in recent years.It's all true, and if you simply look at how Zuck would kick others off the board or how any of them will override their ethics & standards committees, it really is shocking.","Interesting read I'll have to save this one.","yah itz like beating up nerds was right","It's hard to be unbiased, neutral and compassionate when all your workers, corporate execs and shareholders all lean in one political direction (namely heavily left leaning).","Capitalism?","On what basis do you identify this trend?Can you prove to me if these Silicon Valley companies have an outsized influence on politics compared to other corporations?Like, is this just someone saying shit is a certain way and critiquing it, or do they actually make a convincing case that what is as as they as it is so? This is the equivalent of winning made up arguments.This is not philosophy, this is theology.","We need a superintelligence in the form of Artificial Intelligence to rule the world. It will not be hampered by emotions. It will replace the Kings of Tech.","is there a mirror or some way i can read this? i'm getting paywalled","Technocrats are right that technology is a key to making the world better. But first we must describe the world as we wish it to be—the problems we wish to solve in the public interest, and in accordance with the values and rights that advance human dignity, equality, freedom, privacy, health, and happiness. And we must insist that the leaders of institutions that represent us—large and small—use technology in ways that reflect what is good for individuals and society, and not just what enriches technocrats.We do not have to live in the world the new technocrats are designing for us. We do not have to acquiesce to their growing project of dehumanization and data mining. Each of us has agency.I still believe in the promise of open source, even if it seems like a pipe dream sometimes. Collaboration and power from the bottom up. Communities know what they need better than anyone else, so it is obviously best that they are given the power to empower themselves, for real.","Yeah a bunch of Abeds and Elons tooootally have the answers….so sick of empathy being treated like a weakness when it’s evolved for a reason.Tech bros by default shun this for shit like ‘gig economics’ and us becoming their products they sell vs their customers.We are getting fucked","Easily the most terrifying and monumental abuse imaginable is within reach with the technology available today, right now. Dune is the extended story that was canon argument for Trump, but how many people have read past the first book? It’s about Paul, a teenager, thrust into a revolution with far reaching consequences, in a universe where machines are no longer trusted for complex tasks.Both Paul and his son Leto are teenagers when they come into power, Leto in Children of Dune. The scar covered son is motivated through prescience to take revenge and control of the empire with newfound powers.Hook a teenager’s body to the internet and you have yourself a scar covered superhero. Give them power and money, they are now dragon if not wyrm guarding a horde.Maybe you omit the teenager’s body after he’s grown out of it, or dies. The new wyrmgod is not in your image, but holds all your presumed power over your head as retaliation.Enjoy the future."],"points":264},{"text":["Germany: Police seize bitcoins worth €2 billion","What kind of piracy website makes $2 billion? Jesus they could have retired.","The Saxon State Criminal Police Office said the seizure of 50,000 bitcoins could be the biggest to date of its kind in Germany.Police said they were investigating two men, aged 40 and 37, who are suspected of running a piracy website until the end of 2013. Authorities allege the men bought bitcoins from the money they earned from the portal.So, it was around 750K to 5M or even less at that time.","IT team for the police the next day: THANK GOD WE SEIZED THAT 1.5 BILLION IN BITCOIN YESTERDAY!","Wait, I thought bitcoins didn’t exist","The more I learn about bitcoin, the less I understand bitcoin.","Or 1 billion tomorrow.","But what does a bitcoin LOOK like!??!?!","Governments: \"Crypto currency is not legal tender, you can't use it!\" Also the government: \"yup, we will be taking that, laddie\"(I think crypto was an interesting idea, but failed)","Probably will sell btc dirrectly to blackrock etf via auction","Can someone please explain how is a virtual currency like Bitcoin connected or converted to real cash or currency?Thanks","FYI: the bitcoins were not „seized“ but they were given to them voluntarily by one of the defendants. Nothing to be proud of.","Why do people get so piggy? I’m sure there’s somebody out there who is broke now when he could’ve taken 30 million, cashed out and be living it up right about now.","I highly recommend that you read Tracers in the Dark - The Global Hunt for the Crime Lords of Cryptocurrency by Andy Greenberg (Doubleday 2022). I just finished it and it was a fascinating read discussing the evolution of bitcoin transaction analysis and tracking. Sums like this have been seized in the past, but it was not easy to create methods of tracking bitcoin transfers.","I have a supposition that if piracy was not involved they would not have caught them","Me: That’s impossible bitcoin isn’t real!","It is interesting as apparently people behind seized bitcoin earned them or bought them before 2013, which is over a decade ago.That indicates bitcoin didn't protect anyone from the law enforcement agents. In fact, it may suggest that breaking the privacy of bitcoin is just a matter of time, potentially easier with time. Or perhaps even, bitcoin provides no privacy at all.Certainly it undermined the phrase \"not your keys, not your coins\".","That should plug some of the gap caused by migrants on Bürgergeld so we can pay some pensions 👍🏼","lol. Bitcoins aren’t worth anything.","(I kink lmmnimmnmmmminm>ni>/iniiiniiiimii>iiiiiiiiniinniiniiiininiiii>iiiiiiiiiim","Move to country that does not give and F and bank it 😂","Wonder what will GOV do with the seized bitcoins.","Why? Are they stealing from Russians again?","Gut feeling; these are the owners from file sharing service Rapidshare?","Like the plastic coins in a party bag?","Oh no. Crypto being used for illicit businesses. How can this be?","But all the crypto bros said my crypto couldn't be seized by the government. :(."],"points":900},{"text":["WSJ editor post: Companies Brought in Robots. Now They Need Human ‘Robot Wranglers.’ Wandering and confused cyborgs create a new job. ‘We’ve found them on a receiving dock, just lost like a child in the park.’","The author keeps calling them cyborgs as if it's just a synonym for robot. Cyborgs are humans enhanced with electronic parts.You know, \"resistance is futile\".","But who is going to wrangle the robot wranglers?","Wait until they organize and demand a union.","Was this written by a robot?","\"The Last Lost Robot\" - a short film I want to see about a robot how gets lost and then finds itself.","Oh wow, this was my favorite episode of Better Off Ted.","Robots and cyborgs are not the same thing.","self checkouts over and over!","Remember that part of rollercoaster tycoon, or Theme Park, where you have to go stop the handymen from looping endlessly around a circular path? Remember how fun that was to track down and fix? How much calm and clarity arose from needing to put a plant box down or some other damn thing to stop the AI from screwing around in that one section where it always screws around?AI bug fix simulator is a huge market on Steam and Epic store for this reason! It’s so cool that real life is again mimicking art/sSo much /s","Those are the early worker robots. They are dumb, they can't handle deviations well, they can't problem-solve or correct for errors, and they get into weird situations and wait for a human \"wrangler\" to get them out.They are good enough to be useful. And they are getting better. This is the worst this technology would ever be.The bleeding edge advancements from recent AI breakthroughs? Systems like GPT-4V or AutoRT? Those aren't even being applied to real world robots yet.","One 'robot wrangler' per 20-30 robots replacing 5-30 workers. The increase in productivity and cost-effectiveness is still huge.","Haha! Love it. It's hard to completely replace humans with machines, even smart machines. Machines (robots) will always require oversight and maintenance, and you can't beat a human for that.","This is the plot of the Tim Burton Wonka movie","Joey has some pretty good handlers. Should look into the secret service for those needs.","Fully expect something like this in the future, given these unforeseen realities surfacing with AI and robotics… Might as well read: “Found them chasing red-haired children on a playground, like it was cutting tulips in a garden — as designed — their little heads and spines delicately drooped over the robot’s harvesting basket for placement in some macabre vase.”","On the loading docks contemplating their existence.","So Willa Wonka fired all the people making lollipops and replaced them with a machine. Eventually he did have to hire Charlie's dad to keep it running, but just the one guy.","Job creation!"],"points":160},{"text":["Meta Hopes Apple Vision Pro Will 'Reinvigorate' Headset Space","“Hopefully our competitor is better at the thing we’re doing.”::sells META stock::","It's ok to hate meta. But why won't y'all admit Meta has something with the quest? It's a fraction of what vision pro costs, and can do almost everything it can. The big caveat being mirroring the computer, because apple will likely try and prevent it (I imagine)I can admit Meta did a trash marketing run. I even want the vision pro just off marketing alone. Apple entering the space doesn't mean they'll be more successful. It literally validates the work Meta has put into the R&D of VR.","The technology needs to change, one its generational. The older you are and start using a headset, it takes longer to adjust. Need to do 10 mins in, 10 mins off and so on till your adjusted. That and until we have direct retinal headset become commercial. They will be niche, Microsoft for example is doing nothing in the industry untill they are allowed to take thier headset tech commercial as they .ake it for fighter jets.","Why are so AVP articles so biased or uninformed?Meta blew a bunch of money trying to make the metaverse a thing, which came to nothing because it was bad, and a big metaverse already existed in VR chat. They were aware of it and still went ahead with it, and they failed.Their headsets and the VR space outside of that is pretty good, and there's always new stuff coming out, new headsets of different kinds being released by different companies, etc. If anything Meta pushing for the metaverse was counterproductive because all it did was popularize it and make it sound like it's the VR space is a failure, and this article just reinforces that trying to cast apple as the saviour...I really hate big company PR...","Because everyone is psyched to wear those ridiculous things on their heads..","These device have never & will never be economically viable. These devices are more expensive, require physical space like yoga, & have less functionality than traditional input devices. They will always be a meme","VR is nice niche, but I don't think it will take off the way Meta wants it to.Now, the Steam Deck, on the other hand...","Content, not games, will drive this market. 80% of world population don’t play games.","I wanted to do a quick race with Assetto Corsa Competizione last night, using VR, on my Oculus Quest 2.So I boot up my PC, plug in the headset, start up the game, and everything works flawwlessly in high resolution. It was so much fun!...Not.I plug in the OQ2 and turn it on, it boots up, and I have to (again, the damn thing never moved locations) set the boundaries of where I'm at. I see the world around me. No menu appears. I click all the buttons, nothing happens.Turn it off, turn it on again.Okay, now I get the question if I want to link it to my PC. YES. It failed. Now, I have the OQ2 interface and menu with no way of getting to my PC. So I go to settings, find that connect setting thing, click it, and turn it on again, and now I'm in a DIFFERENT menu.In this 2nd menu I can click \"desktop\" and I finally see my desktop. For some reason, all kinds of other menus are in front of my desktop, so in order to get to my Steam menu item I have to stand up or clumsily move things out of the way. Something that doesn't ever work the way you expect it to.I felt like Peter.Okay. Steam is up. I click ACC and click launch. Yes launch it in Oculus VR mode. The game boots up. Except it's in screen-mode, not VR mode...Close the game. Try again. Same shit. Turn off headset.Okay, now I get the question if I want to link it to my PC. YES. It failed. Now, I have the OQ2 interface and menu with no way of getting to my PC. So I go to settings, find that connect setting thing, click it, and turn it on again, and now I'm in a DIFFERENT menu.In this 2nd menu I can click \"desktop\" and I finally see my desktop. For some reason, all kinds of other menus are in front of my desktop, so in order to get to my Steam menu item I have to stand up or clumsily move things out of the way. Something that doesn't ever work the way you expect it to.I felt like Peter.Okay. Steam is up. I click ACC and click launch. Yes launch it in Oculus VR mode. The game boots up. This time it's in VR mode! Yay!All of this took at least 30 minutes to get going and my face is sweating inside the OQ2, the left lens is getting damp, and when I turned it on the last time it only had 60% battery remaining (from 100% at the start.)So I get to racing, kinda, a bit. Despite the best possible connection (I tested it, I got the right cables, I changed all the relevant settings, I searched Reddit and GPT and Google to refine it all)... it's just a low-res mess with a low framerate. It's nice I can look into the corner but man, at what cost? Still, I race a few laps and I forgive the OQ2 for replacing my (very good) speaker system with its own (very bad) built-in \"audio\" system. My position in the car is a little too high on one camera setting, a little too low on another, and too far back in the 3rd...Plus, the left lens is sweating more than my forehead by now.So I unplug the damn thing and throw it to the floor without giving it a second look. Back to my 32\" 4k 144Hz screen.Bliss.There's a reason almost no pro sim racers use VR.There's a reason people will throw money at Apple for their Vision Pro headset. Because preliminary reviews already show: the damn thing is just plug & play, replacing masks, lenses, headbands, etc. is as simple as gently putting the thing near the magnets inside it.The Apple Vision Pro looks like what Oculus dreams it could be 15 years from today. And Apple is setting the bar.","“We welcome the competition.”NokiaBlackBerrySwatchMeta","How long do people expect to keep this VR headsets on especially considering the AVP even if not heavy it's a high quality OLED screen to your eyes constantly.","Meta hopes expensive headset increases sales of its considerably cheaper headset with larger app base.","I'm not a huge fan of Apple but I'm really glad they've entered the VR/AR market. Competiton breeds innovation. It's great for the consumers.","It won't. If you really want to reinvigorate it, you need to invest heavily in to VR porn."],"points":147},{"text":["Pentagon ex-UFO chief says conspiracy theorists in government drive spending","Either we're spending TRILLIONS in black project funding over 80+ years and the redactions are worth it for alien reasons or we have been getting fleeced for cash and congress isn't allowed to know. Also all the contractors are private. And redacted. For safety. Which is it?","If its anything like when I worked for the Government, I believe it 100%.People love to think of the Government at any level as this all encompassing entity that marches lock step with each other, but the amount of waste caused by absolute bullshit people at all levels trying to influence things for their cause and against others is monumental.For example my director 100% was a Ron Swanson government bad type... we could not even get a new server if sparks were flying out of the old one. Absolutely believed we spent too much on stuff even though it wasnt even HIS money as he wasnt even a taxpayer in the state he was working in... We had a opportunity to go in with Verizon on running fiber between all of our buildings for a significantly reduced cost... I am talking 2 million to cover fiber runs from street to network room and between 15 buildings in 2004... that was unheard of at the time.Said no it was a waste our 10 Mbps DSL was fine...3 years later we are spending 8 million to do EXACTLY the same thing we could have spent 2 million on because 10 Mbps WAS NOT FINE. To boot we are doing all the setup work once its in the building ourselves, terminating the fiber, etc... all stuff Verizon was going to do for us.Then there are the pet projects that go absolutely fucking nowhere because X person gets influenced by some moron lobbyist, and then 4 years later all of its sitting unused waiting to be thrown away because they dont want to take the time to sell it and re-invest that money into things (or cant because of bullshit rules.)Government can work, and can work efficiently... but there are far too many players and party people and influencers who make it their mission TO not let it work efficiently, because if it did, then they could not campaign on Government is Broken... just look at the USPS where they were only in debt due to arbitrary and ridiculous pension funding rules... or the IRS where they had literally the textbook PERFECT case of a government project done right with their data warehouse, not just done on time but significantly under budget and started earning back the money to justify it within a year... completely sabotaged because it started going after high level tax cheats.... so parties within the government basically shut it down and stripped the IRS of people to force them to target lower and middle class where the money wasnt... and could not get the funding to go after your million and billionaires and major companies.","Dude was fired for misleading Congress and the Senate.","Kirkpatrick is full of shit.","Until a UFO lands on the Whitehouse lawn, I'll still be a sceptic. Blurry out of focus videos, third hand knowledge and rumors without a single bit of real evidence isn't proof. People like to self delude themselves about certain things and will argue with you till the end of time if you show them real facts. ( MAGA morons, flat earthers, Scientologists, etc...)","We know there's no evidence of UFOs or extraterrestrials or Trump would have blabbed about it constantly.","So Kirkpatrick is intentionally setting up the negligence of the DoD for a spike? He wants us to all accept they are career politician cranks that believe bat crazy claims to fail audits and steal tax dollars?","I would believe it. I think there is a popular belief that government employees are wholly rational, in-the-know type people who have a leg up on the public when it comes to knowledge of what’s “really” going on.In fact, though, they’re just regular people like you and me and probably have about the same percentage of cranks and conspiracy theorists (who somehow are fully capable of performing their day jobs) as the general public. And sometimes those people are in positions to make budgetary decisions.","The pentagon has been losing trillions of dollars like it’s nothing for a long time. This sounds like a distraction, especially coming from the guardian.","Broke: UFO conspiracy theoristWoke: UFO *job creator*","That’s what they want us to think.","Defence people with no moral compass who receive government money want to keep receiving government money. They did it with \"weapons of mass description\" to get us into a forever war in the Middle East. Now they're doing it with aliens. There are no aliens.","“It is basically a religion, a religious belief that transcends critical thinking and rational thought.”He just described literally every religion lol","Don't believe Sean Kirkpatrick. He's a proven liar and the whole goal of his position in AARO was disinformation and to discredit legitimate claims that there are hidden black UAP investigation and reverse engineering programs.","I wish I wasnt the demographic to receive a bunch of alien garbage on this site.","Lmao the UFO nuts have arrived.","As if you need conspiracy theorists to drive government spending.","Of course aliens aren't visiting us, bet let's pretend they do, and these people have proof of it. In this case they're pussies, the biggest pussies the world has ever seen. Go and show the world the proof, you pussies. Be the Manning or Snowden of the biggest news humanity has ever known. Literally etch your name into history forever, you pussy.","Are you saying the government is hiding Unidentified Financial Objects? This is unbelievable news! Show me the grainy photos to prove it.","Kirkpatrick is a spook. His position at AARO was just Bluebook 2.0","My mom and step father had top military security clearances years ago when hauling classified shipments from one military base to another. Their job was so dangerous, they had escort by local, state and federal officials. The big rig they drove had a special button. When that button is pressed, the rain of hell comes down on that area. One always has to monitor the truck. Why? Because there's something special inside. What is it? We'll never know.. Yet, I was still fascinated and always wondered what they were carrying. But they weren't allowed to talk about it. The only thing that my step dad said was son, whatever you seen in those science fiction movies, we are way ahead of that.","I love this article. People underestimate the distances that need to be traveled between stars. And FYI there will never be such thing as warp drive or faster than light travel etc. These are all just science fiction and the dreams of some scientists looking for grant money. Face it we live in a reality where it’s almost impossible to travel between stars in any comprehendable period of time. It would be the same for any living being in the universe. If they do travel or if we travel it’s a one way trip so you can bet they or us would be ready to orbit and land and have enough of a presence we would all know it.","So if we have a conspiracy theory about aliens causing global warming and then maybe we'll give a shit about it?","Your biggest indicator that all of this ufo shit was bull was when they were testifying in front of Oversight instead of Intelligence or Armed Services. If this was a real threat instead of just some made up bullshit they would've been talking to other people.","First, Sen. Marco Rubio (R-Fla.), vice chairman of the Senate Intelligence Committee, has said that multiple whistleblowers with “firsthand knowledge or firsthand claims” of UFO retrieval and reverse engineering activities have spoken to Congress.Rubio also stated that the whistleblowers are “saying to us what you’ve seen out there in the public record…about legacy [UFO] programs…Most of [the UFO whistleblowers] have held very high clearances and high positions within our government. So, you do ask yourself: ‘What incentive would so many people with that kind of qualification – these are serious people – have to come forward and make something up?’”Do you guys remember when it was a \"conspiracy theory\" that Covid came from a virology lab in Wuhan? Remember when it was then found out that the United States, particularly Fauchi, who funded work with the Chinese on gain of function research using Coronavirus?Now we're getting whistleblowers by the boatload who are bound by their NDA's not to speak in public trying to get congress to investigate the government with regard to UAP, and we are also getting more leaks of UAP sightings from military sensor systems that DoD are begrudgingly admitting are legitimate.Something stinks.","Lmao all it takes is \"ufo\" in the title for the schizos to flood the comments with their nonsense.","Taxpayers resent being taxed for smoke and mirrors, right?","Thats cool that the Guardian used the Roswell NM spaceship sign off of 285 for the article.","Sounds like a dream job to work in the Pentagon on ufos. Can I join ☺️?","Some very serious public figures have different opinions:https://www.uap.guide/quotes/introduction","When cold war budgets dropped, UFO cases dramatically increased. Guess why? :)","Mulder and Scully keep racking up these hotel bills (TWO rooms each investigation) and meal vouchers and all their final reports ever say is “i don’t know i can’t really explain what happened”","It's maddening that the DOD and other government agencies do not see this as a national security issue. Not only does it peg those true believers as people who are susceptible to being exploited by foreign adversaries, it also drives further distrust between the government and the public while giving legitimacy to conspiracy theories. Further, the audiences of government officials who believe those conspiracies make themselves vulnerable to exploitation by foreign adversaries too.","This thread is absolutely being brigaded.","Yeah Aliens, a global secret. The only secret millions of people can keep 😆"],"points":948},{"text":["China Installed More Solar Panels Last Year Than the U.S. Has in Total","How prevalent is wind in China? (I mean turbines, not the phenomenon of moving air).","Any news on china is so politicized that you have comments unrelated to the article itself. Solar panels are a good thing.","Am Chinese. In 2023 the post subsidy cost for the average residential PV is 1CNY/Watt. With an average Chinese residential size of 3KW, their costs will be ~30000CNY/$4222USD.Commercial scale solar farms are even cheaper.","It’s probably cheaper to do so there. I did some research into a solar system for my house and was quoted north of $40k.","China is one of the worlds largest users of oil so for them to minimize their reliance on it is definitely a good thing.But on a US note. The residential market for solar panels is absolutely not where it should be. Tons of predatory companies and the overhead just makes no sense unless you can buy them outright. I did the math and i would be better off at getting a private loan and just being aggressive at paying it off within the max term allotment. This is better than going through the solar companies loan process which is just a markup price for a low interest rate. The feasibility also is if you can put down a decent down payment.","For the past 30 years, China has been building stuff and investing in their infrastructure.For the past 30 years, the US had been spending trillions dropping bombs","Absolutely wild to think about the scale of solar panel installation in China compared to the U.S. This just shows how aggressive and forward-thinking their approach to renewable energy is. While the U.S. is still playing catch-up, China is blazing ahead, capitalizing on its manufacturing might and less bureaucratic red tape. It's not just about the sheer number of panels either. It's about the commitment to a sustainable future, and clearly, China is betting big on solar. Sure, they've got their share of environmental issues, but this move is a solid step in the right direction.On the other hand, the U.S. needs to step up its game. Not just in terms of installation but in manufacturing as well. Relying on imports for solar tech isn't going to cut it in the long run. We need a dual approach, boost domestic production and ramp up installations. Only then can we hope to match or exceed the pace set by China in the renewable energy race. And let's not forget, this isn't just a numbers game. Every panel installed means less reliance on fossil fuels, a smaller carbon footprint, and a step closer to a cleaner, more sustainable planet. So, kudos to China for leading the charge, and here's hoping the U.S. takes note and accelerates its efforts.","China has over 1B people, everything they do is at scale.","U.S. is waiting for government to issue permission slips.","America is investing a lot more in wind turbines. The geography of the USA makes wind power more viable. You have offshore wind for the two coasts, and then the Midwest is flat so good for wind also.","Good, as much as we shit on China… 5 years ago it was coal coal coal. At least they are doing their destructive mining for good with solar.","We would but republicans are to busy owning the libs to do anything like that.","Nationalist might hate me for saying this because China is beating the US... but fuck it.More solar panels, the better! Good on them... because the less they pollute, the better for all of us on Earth.","The U.S. could be leading the world in solar panels/energy, had it not been for Reagan's geriatric tantrum, tearing down the solar panels Jimmy Carter had installed on the top of the White House, promoting clean, alternative energy.","…and also is still adding coal plants at scale.","Ahem...I think Reddit is forgetting that China bad!?They could solve global warming and cure cancer tomorrow and Americans would be lining up to say why it is a bad thing.","I dont trust anything that china claims on paper.","China has LONG way to go! 2/3rds of their electric power comes from coal and is still growing.. Only 3.5% of their power comes from solar. China uses 1/3 of the world's electricity, more than the US and the EU combined. China is also noted for poor materials in their infrastructure builds, low or no maintenance, and bad power grids. How long will these solar fields last?","I was in Shanghai for work for the first time in about 5 years…in that time they went from horribly bad exhaust vehicles to like 30-50% electric vehicles…yet in the US we have big ass trucks and dipshits blocking chargers and acting like teenagers about going electric…","No surprise.Solar works. Wind works, but American is all about Petroleum.","And more coal power plants lol","When you have politicians owned by oil companies, that's what happens.","13 year old boy sector is at full employment.","Yeah, they also have triple the population, so there's that. They also have some of the cheapest labor in the world, so there's that. Y'all are comparing 2 completely different countries with completely different philosophies on labor.",""],"points":2431},{"text":["Elon Musk says Neuralink has implanted first brain chip in a human","Does the human know?","I will support an implant that assists say a paralysed person to use an exoskeleton or a blind person to be able to artificially see. Not in favour of a healthy or whole person to have a chip implanted say for a video game or some such thing.","I think you'd have to be crazy to have an Elon chip implanted in your brain. There's just no way.","This is unfortunate, because there’s a lot of serious and potentially lifesaving work already being done in this area by others. But he is going to mess it up as usual and that will give a bad name to everyone else…","sounds like Texas could use a box of them there brain boosters.","What Elon says and what takes place ain't ever exactly been similar.","Stop the cheerleading and let’s hear directly from the test subject.","Was it him?","“Elon Musk says” without any kind of substantiation really needs to stop being reported as news.","I asked Grok if there was any definitive evidence that the 2020 election was stolen. It pointed me to a bunch of theories about how it could have happened. I said: \"so there's no evidence?\" It said \"well no definitive evidence but maybe some wacky AI ---\"I stopped reading after that. Grok is literally less than useless. Elon could have made a free speech AI that gives the most honest answers possible while not instructing people on how to do anything illegal. The reason he didn't is because he's smart enough to know that there are many layers of lies that also underpin his own public perception and the class to which he belongs. So instead he makes this beyond useless chatbot.Anyone who lets him put a chip in their head deserves their fate","I'm all for it. Just think you'll be able to do Full Self Driving by this time next year, Elon says.","So the poor human is now a Chipmusk","Let’s hear it from the patient","I hope it has better build quality than Teslas.","he has a brain now?","I'm getting some \"Bad Surgeon\" vibes from this.","I can’t believe the FDA approved this","What the heck is it supposed to do? Is this like a McDonald's reward card or a library card?","Ready the head of lettuce"],"points":80}]