[{"text":["Researchers demonstrate rapid 3D printing with liquid metal","If that’s the example they’re going with, I can see it severely limiting commercial appeal.","So our future contains AI and Liquid Metal, what could possibly go wrong?","Looks like ass though","the printer needs to move around the object. complex part printers can print simple shapes pretty quick. modern manufacturing is going to change everything.​Relativity Space 3D Prints 11-Foot-Tall Fuel Tank with Stargate 3D Printerhttps://3dprint.com/231703/relativity-space-3d-prints-fuel-tank/Using a giant 3D printer allows Relativity Space to reduce the part count of a typical rocket from 100,000 to 1,000. This, needless to say, greatly saves on time, labor and money, which in turn saves customers millions of dollars per launch. Relativity intends for its rockets to carry large payloads, too, up to the size of a small car, which is six times the capability of its competitors, according to the company.​Relativity unveils Stargate 4th Generation metal 3D printer with horizontal printing capabilityhttps://www.tctmagazine.com/additive-manufacturing-3d-printing-news/metal-additive-manufacturing-news/relativity-unveils-stargate-4th-generation-metal-3d-printer-/​New Stargate Generation boasts horizontal printing to enable the additive manufacture of larger components.Relativity says 4th Generation achieves an increased volume capacity of 55x compared to its 3rd generation predecessor.Several Stargate 4th Generation printers already online with more than a dozen to be printing Terran R parts in coming months.While the Stargate 4th Generation technology will underpin the development and production of Terran R in the short-term, Relativity believes in the longer-term the new system will ‘offer tremendous value-generating potential for other end-product use cases within the $1T aerospace, aviation, energy and defence industries’ as the core of a new tech stack for aerospace products.","We think in terms of straight lines, but AI and 3d printing will enable organic design structures, not the prettiest but strongest, etc","it looks like a welding person with really bad ADHD made that","Wow, chairs are indeed one of those one-off things we really can’t efficiently mass produce. /sAlso, if it looks like this it is not even a suitable replacement for CNC milling.After all, it doesn’t need to do the thing, it needs to do the thing faster, cheaper or better than other methods.","Isn’t welding essentially 3D printing with Liquid Metal?I’m not sure what the breakthrough here is.","Can the researchers demonstrate why no fat guy will ever sit on that chair?","they could always just cast the parts","They didn’t level the bed first"],"points":82},{"text":["Looking for machine that would combine a panini press, waffle maker, takoyaki maker, etc.","Search for TEFAL SNACK COLLECTION SW852. Have one myself and it works like you described","You mean something like this with 12 modules?","George Foreman grill maybe?","Or that would allow to change the plates AND has the option to buy more hot plates (from the same company or independent vendors) for more niche dishes, like gaufrettes or arepas","If something like this exists it’s going to be about as as-seen-on-tv-y as it gets. Good luck OP but I don’t have high hopes for your search.","I have one of these. It was recalled due to bursting into flames. It takes up slightly less space than individual versions of the different products."],"points":12},{"text":["Lenovo IdeaPad Pro 5i review: Meteor Lake dazzles on performance and endurance","This review was funded by, and heavily worded by, Lenovo.If you give them enough money they’ll write anything.","Ah yes, compare it to an acer with a 54 Wh battery. Maybe compare it to an AMD lenovo with also a 80+ Wh battery to have any meaning to the Meteor Lake endurance statement. AMD has been much better in the last few years on thinkpads.","XD lol Once upon a time, Tomshardware was worth reading.","“Do you like LENOVO IDEAPAD?”“Based on your recent interest in LENOVO IDEAPAD, here is a review of your LENOVO IDEAPAD”“Was this helpful to you for LENOVO IDEAPAD?”"],"points":16}]