[{"text":["Seeking Guidance on Cybersecurity Training Paths","https://pauljerimy.com/security-certification-roadmap/","Keep going with SANS. It’s expensive but worth it."],"points":3},{"text":["We keep making the same mistakes with spreadsheets, despite bad consequences","Wait. Are we not supposed to keep sensitive spreadsheets with PII on the shared drive? Even if we lock it down with folder permissions?What about our password lists? I keep mine in Excel and store it on the shared drive too. But I locked it down so that only I have access. I’m one of the sysadmins/dba/developers.I’m not a cybersecurity guy though I’m working on my CEH.","Um so what should we do - spreadsheets is what I do all day everyday ..."],"points":0},{"text":["How malicious payload bypass antivirus?","Do some research on how antivirus software works. Many people will point you to how to do it to get it done, but if you understand what you’re up against then you can find your own solutions which is exactly what bad actors are doing, so to be a step ahead, or even in step with them, you’ve gotta think of the problem like they do","I would check out the PEN-300 / OSEP course from OffSec. You learn how to do this in that course.","Start herehttps://attack.mitre.org/tactics/TA0005/","Let's take a step back here - what was your motivation to fire up a Kali vm and start tinkering with these tools? The sad news first - in case you are planning for an actual career, a lot of learning will be needed. Before you even get the to the point of actually evading something, you need to understand how the bottom of the iceberg actually works (kernels, operating systems, applications, networks, ...) - cramming some exam dumps and watching \"bounty hunting in 21 days\" vids on your morning commute won't cut it.In case you already got some of the foundational bases covered, this sub is full off substantial hints on viable paths to becoming a pro on both the red and the blue team. Check relevant publications from Manning and No Starch Press - you'll find a lot of go-to textbooks on there that will help you to get up to speed in a solid manner. Don't go copy-pasting random code snippets without understanding what they actually do.Also: check \"awesome\" lists on github - awesome redteam, blueteam - some of those actually present end-end guardrails that will safe you from getting trapped in all the rabbit holes on the way =]","Obfuscation and AV bypass technics.","Look into loaders. https://www.reliaquest.com/blog/the-3-malware-loaders-behind-80-of-incidents/Basically loaders specialize in evasion and can be used to launch arbitrary payloads (in some cases).  You can find the source for plenty of them floating around, and some are available for purchase.If you understand the techniques a number of them are using, you'll have a decent sense of standard evasion mechanisms.","Upload to virustotal.com and see if it gets detected","A lot of great points here, but to dive a bit deeper.AV bypass vs EDR bypass should be what you ask about. AV bypassing is far easier since most are signature based, where EDR is more behavioral based.Next thing to ask is: is the AV and EDR technologies plug and play or tuned to the environment? Depending on how much tuning has been done, the harder it can be to bypass","I was having a super hard time making a payload with MSFVenom that could bypass windows defender. So then I made my own with Python. Now any time that gets flagged I can just add a couple more lines of code to it !","Theres a new book called evading EDR. I would look at it.","This is a never-ending story. Things move very fast. While simple obfuscation would do the trick up to 5 years ago, it's a much more complicated story right now and a field in and of itself.","bruteratel.com, zerodayengineering.com, lots of resources from well experienced hackers. don't beg or settle for advice, go get real knowledge. best way is to buy books and read articles from real researchers. these subreddits including netsec are bullshit and offer no real value around this sort of research. good luck!"],"points":43},{"text":["I looked through attacks in my access logs. Here's what I found","Have you thought about getting some sort of WAF setup? Like cloudflare? Also I didn't read all of it but most of those attacks are 404 error messages so a WAF in place could prevent those logs coming in all the way."],"points":0},{"text":["Is Zero Trust and SSO a contradiction?","Zero Trust is much more granular. Even if an account is authenticated and authorized to take certain actions, there are oftentimes going to be additional security checks made as the account is taking those actions AND there will also potentially be reauthorization checkpoints as well as other security challenges presented during a session.You can do some googling/reading about Zero Trust and you'll quickly realize ZT and SSO are not a contradiction, oxymoron, or however you want to look at it. ZT goes much deeper.","Zero Trust as the name implies avoids trust relationships between services.This is not true, and your understanding of zero trust is flawed. In a zero trust model, the user account would be evaluated at each service interaction, while the account could be the same across each service, and the auth would be re-evaluated each time they access a service. Your policies should be evaluating anomalies for re-auth or re-mfa if things are outside of normal, for instance, if a user suddenly accesses their account/service from a new Geo location.Now if an attacker has the user's password, and their phone... well, there's not much you can do other than evaluate and isolate the account based on actions they take if malicious.","SSO and Zero Trust can coexist. Zero Trust isn’t about eliminating trust, but continually verifying it. SSO simplifies access while Zero Trust ensures continuous validation at each access point. They’re complementary, not contradictory :D","SSO is a technical solution. Zero Trust is a strategy or concept.It entirely depends on how SSO is implemented, the processes and policies you have in place, and removing all implicit trust from the above.","Zero Trust is a thing you do. Like parenting, you never actually finish doing Zero Trust.When you’re doing Zero Trust properly you have completely eliminated IMPLICIT TRUST that lasts longer than a single transaction.Every flow is inspected. Every interaction is validated. Forever.Using SSO and MFA is part of that. But the trust relationship between parties is ephemeral. It must be validated each and every time.The lack of clarity on the Zero Trust concept is why blue teams keep taking one giant loss after another.If you run a network defense organization please just get over it. There are no shortcuts. There is only hard work. Anything else will continue to deliver you more compromises and more avoidable losses.","Even in a ZT environment there is always some form of trust, however certain conditions (that assert trust) have to be met before you grant access and for the latter you have to decide upon what level of trust is sufficient (based on the type of resource) to provide access or not. There just shouldn’t be any implicit trust. SSO doesn’t equal implicit trust, which I think you confuse it with.If your whole environment relies on just username + password authentication (and now I disregard authorization and least privilege principle) and these are compromised then you have the same problem as with SSO right?In a proper ZT environment you take additional factors such as location, device, device health/status, time, risk scores, etc. into consideration to determine whether you grant access. Preferably dynamic, risk-based (in line with your risk appetite) and in real time :)","\"Zero Trust\" (the concept) is a misnomer, \"conditional trust\" or \"limited trust\" better describe what the concept actually represent.For this reply I assume we're talking the NIST ZTA definition.SSO is directly compatible with ZTA as the SSO IdP is considered a PEP for identity posture. 2.1.6 covers this:All resource authentication and authorization are dynamic and strictly enforced before access is allowed. This is a constant cycle of obtaining access, scanning and assessing threats, adapting, and continually reevaluating trust in ongoing communication. An enterprise implementing a ZTA would be expected to have Identity, Credential, and Access Management (ICAM) and asset management systems in place. This includes the use of multifactor authentication (MFA) for access to some or all enterprise resources. Continual monitoring with possible reauthentication and reauthorization occurs throughout user transactions, as defined and enforced by policy (e.g., time-based, new resource requested, resource modification, anomalous subject activity detected) that strives to achieve a balance of security, availability, usability, and cost-efficiency.3.3 covers Trust Algorithms, one that integrates UEBA (which they call \"contextual\") and one that doesn't. They give an example of a case where an attacker compromises an account and tries to stay stealthy:Ideally, a ZTA trust algorithm should be contextual, but this may not always be possible with the infrastructure components available to the enterprise. A contextual TA can mitigate threats where an attacker stays close to a “normal” set of access requests for a compromised subject account or insider attack. It is important to balance security, usability, and cost-effectiveness when defining and implementing trust algorithms. Continually prompting a subject for reauthentication against behavior that is consistent with historical trends and norms for their mission function and role within the organization can lead to usability issues. For example, if an employee in the HR department of an agency normally accesses 20 to 30 employee records in a typical workday, a contextual TA may send an alert if the access requests suddenly exceed 100 records in a day. A contextual TA may also send an alert if someone is making access requests after normal business hours as this could be an attacker exfiltrating records by using a compromised HR account. These are examples where a contextual TA can detect an attack whereas a singular TA may fail to detect the new behavior. In another example, an accountant who typically accesses the financial system during normal business hours is now trying to access the system in the middle of the night from an unrecognizable location. A contextual TA may trigger an alert and require the subject to satisfy a more stringent confidence levelIf we take Entra ID as an example, Sign-in Risk somewhat satisfies this point, as with Conditional Access in Continual Evaluation mode, you can block unusual sign-ins. We're not quite there if the attacker:Has compromised the victim's machineLogs in at the same rate, at the same hours and to the same apps as the victimManages to not get caught by any of the other PEP mechanisms (EDR, NAC)","Zero trust is never a zero 😉 At the end, it's always about compromises for usability and productivity, and nothing is black & while.On the other hand - even with SSO, there is an authentication process, and that checkpoint is when you can look for irregularities (anomaly detection).I used to be specialized in a field (Citrix) where this was a hot topic when zero trust was introduced.For the context, SSO for me is referring to the authentication method (seamless), not to a single Identity Provider. For customers that raised this concern, we simply switched to the explicit authentication.","ZT is another layer. It is not a contradiction to SSO.","ZT isn't an authentication scheme. ZT assumes all authentication schemes are flawed. A ZT strategy would restrict a user only to the resources they have access so that if the authentication is compromised the bad actors are still limited to what they can access. Then couple that with least privileged and role-based access policies. Then perhaps additional authentication at the resource level, if practical.","To some extent yes. Zero trust requires you to trust several companies, especially the identity providers.The IdP also complies with governments, may be hacked and so on.","Cybersecurity, by its very nature, is full of compromises, some of which can be seen as contradictions. The reason for this is simple, because cybersecurity aims to strike a balance between competing concerns. It's in the very foundation of the CIA triad. The question isn't \"how do you totally secure this thing?\" The real question is \"how do you secure this thing the best while still allowing people to use it to do what they need to do?\"So yes, SSO is a bit of a contradiction in regards to zero trust. But it gives the users an easy platform to log into multiple systems they need to use while giving security teams extra controls to maintain the security of the systems, so it's an important part of a good zero trust setup. Not because it's a contradiction, but because it increases two parts of the CIA triad at the same time, which benefits the entire organization.","No, zero trust and single sign-on (SSO) are not inherently contradictory. Zero trust is a security framework that assumes no trust by default and requires verification from everyone, even those inside the network. SSO, on the other hand, enables users to access multiple applications with a single set of credentials.In a zero-trust environment, SSO can be implemented securely by incorporating multi-factor authentication (MFA) and continuous monitoring to ensure that access remains authorized. This combination enhances security by reducing the reliance on traditional perimeter defenses."],"points":140},{"text":["Why do employees not get a chance to properly practice cyber skills at work?","Awareness and training should be part of any security program.Maybe I'm missing the context of the discussion, but maybe she's just working in an org that doesn't emphasise this.","Depends where you work. Yes, she is right, it happens a lot, but not everywhere"],"points":5},{"text":["Security and Privacy Failures in Popular 2FA Apps -- \"We identified all general purpose Android TOTP apps in the Google Play Store with at least 100k installs that implemented a backup mechanism (n = 22).\"","The submitted link is from \"Interesting Links\" in https://old.reddit.com/r/termux/comments/19573gg/encryption_decryption_android_11_operating_system/ (\"Encryption, Decryption, Android 11 Operating System, Termux, And proot-distro Using Alpine Linux minirootfs: cryptsetup v2.6.1 And LUKS\")."],"points":0},{"text":["Serious New Warning As Google AI Targets Billions Of Private Messages","A typical sensationalized article.That being said, most users throw caution to the wind when it comes to their privacy. It's all about the cool features and convenience over anything else.Hopefully that changes starting this year. There has been a big focus on privacy regulations and laws lately. These companies need to be held accountable with more than just a slap on the wrist.","\"Serious New Warning...\" Sees its from Forbes.... How does someone ethically post an article from Forbes anymore?","“New” - Forbes… nope","Ahh nice so a bunch of messages of what's up and no response lol.","There’s Forbes at it again, selling their backlinks with poor journalism.","So glad I degoogled my life","What about Microsoft Copilot?","You mean googles messaging platforms are a privacy nightmare and Apple is right not to go full goatse with their iMessage platform when Google begs them to?"],"points":95},{"text":["Will AI take over cybersecurity jobs","Opposite, the rush to AI'ify all the the things is creating new security risk domains that we're going to have to cover, and new regulatory mandates that are going to need to be followed.Ref:- https://atlas.mitre.org- https://owasp.org/www-project-top-10-for-large-language-model-applications/- https://iapp.org/news/a/eu-ai-act-draft-consolidated-text-leaked-online/As gen-ai tech matures we will see it applied to more and more repetitive tasks, but these tools aren't just being adopted by the defenders they're also acceletating bad actors ability to create successful offensive campaigns around malware, phishing, and impersination (non-repudiation) and that's just whats happening right now. It's likely to have accelerated an order of magnititude by a year from now.So circling back, I believe Gen-AI is going to accelerate security risks and eventually the security professional without AI skills is going to lose the race when attackers are AI enabled.","No, But obviously it won’t stop companies buying snake oil. I will say, whoever is out there selling Ai as the next security measure. They will be making out like bandits. Companies cutting tech security positions all based on what someone is willing to be over promising and the results will be under delivering.But of course I’m sure they’ll have them locked in a nice long contract because companies want “ value.” More than likely because some shit they picked up on ITIL no doubt. Yet, all this and there will be no proven track record. They sure won’t run it up against some hacker in a live demonstration. So look for those companies that bought into AI security. Those are going to be the first that will more than likely get hacked because Ai will not be able to adapt fast enough.I’m sure it will have the processing power to do so. I’m not doubting that at all. But to be able to think critically, no. It can’t do that.","No. Cybersecurity jobs will change to involve less manual labor but you will ALWAYS need humans to analyze human activity.Attackers are human and they are especially adept at uncovering and exploiting weaknesses in people, processes and technology.You will also always need to humans to train and model the ML platforms to tailor them to the needs of the environment.IMO, currently there is an opportunity for cyber analysts to begin blending data science into their skills in order to master UEBA for example.","My users can't submit enough info into a ticket to get a real smart human to perform the tasks they need to get the results they want. AI is not helping that.","For the last time NO. Will there need to be some upskilling/reskilling? Yes of course. But that's it. It's an evolution.","Yes and no. The composure of cyber security teams may change.I don't know what jobs are the most vulnerable but I reckon AI could take pressure off SOC/ incident response teams which may mean less jobs there in the future. I don't think that these roles will be eradicated though.There will be more jobs for people creating, deploying and reviewing AI solutions for cyber security though. So I can imagine the jobs lost and the jobs created by AI will cancel out.","probably, but I reckon not before I retire.","What does “AI taking 40% of jobs” mean? Where do you get that figure? Every industry will be disrupted by AI but that will open up even more opportunities.","I commented this before on another similar post, but it seems to me (in my anecdotal experience) that the more AI we implement at my workplace, the more engineers we need to audit it for false positives/compliance/etc.Just look at PA Cortex or something like ExtraHop. Absolutely insane amount of tuning required. I spend about 60% of my workday working with our SOC/MSSP to investigate alerts because there is just so many low level and false positive alerts.Even when the systems are fully tuned (which is a point nobody will likely ever get to in a large, dynamic corporate environment), you sometimes get alerts that set off the IR team because they LOOK like they may be serious, but it ends up just being another false positive.All that to say, these ML/AI assisted systems are still way, way better than non-assisted systems. But we have a long way to go before entry-level SOC analysts or security engineers are phased out or impacted IMO.Remember, the fed is actively lowering the bar for education on federal cyber jobs to fill more positions quickly, and they already announced a huge hiring sprint in 2024. take from this what you will.we ain't going nowhere","AI could eventually take over many jobs, if we keep working at it and developing it in that direction, but it won't be in a timeline where I or my kids will have to worry about it taking jobs.","Yes. Also taking over many other IT jobs as well. I oversee Service Desk operations for a large Gov agency, and last week we got a demo where an AI bot was not only able to talk with customers calling the service desk, but it was also able to troubleshoot their problems and resolve tickets.","Given we are still cleaning up the web app messes of 20 years ago and organisations seem to be actively trying not to learn any of those lessons in their approach to AI I'd say we'll be cleaning up after AI for a long old time.","Technology can fail and be manipulated, you would still need those who can review, manage, and modify.","Cybersecurity is evolving, not dissolving. AI may change the tools, but human insight and adaptability remain irreplaceableExecs will always want human council, even if it is heavily augmented by AI","Your statement is actually the reason why Cyber Security will be valued more in the industry","no","AI will take over any job it is good at and any job that the human is not good at for various reasons. computers, and computer programs are designed to help us (humans) do more of things we enjoy, which is being human, not looking at logs, correlating, and predicting meta data about meta data.cybersecurity is a very broad field, and yes, AI will take on more of the jobs and roles we are willing to give up. at the least it will enable cybersecurity roles to be better at what they do (hopefully) but AI will also elevate the malicious side.the dance continues","The folks giving a flat \"no\" here are very concerning. AI isn't chicken little: we should definitely be paying attention and not just saying \"well I don't like it so it's not going to happen,\" because my companies entire coding team is using AI to write code and its very obvious it's going to replace a huge chunk of them eventually. AI will take over SOC response, tons of parts of forensics, solid chunk of VM, and a bunch of enterprise security (email filtering, for example). If we aren't seeing this type of thing in the next 3 years, followed by a huge leap forward by 5 years that makes it clear humans won't take these jobs back... I will be shocked. That said, as far as IT and Comp Eng and Web Design and Coding... those will be gone before cyber is gone most likely: the simple reason being cyber has accountability associated with it. If there is a breech, you can't just blame the AI and AI companies will have clauses saying \"must be reviewed by a human, we take no liability.\" So Security will go last, but it's coming for all tech jobs for sure.","Eventually, and I’m talking the long game, it will have to. Especially when it’s other AIs that you have to defend against.Til then, we get to enjoy all the hamfisted failed attempts at doing so.","No. There will be thousands of people flocking to cyber security from AI jobs when businesses realize what a load of shit AI is and firings start. ChatGPT is not the AGI we are looking for.","To add to this there is also the potential for the model themselves getting poisoned as outlined here...https://www.livescience.com/technology/artificial-intelligence/legitimately-scary-anthropic-ai-poisoned-rogue-evil-couldnt-be-taught-how-to-behave-againNot really sure how this is being mitigated against because this seems to open up the possibilities of an inside threat.","No.","Nope. Keep at it. The prompt may give information that’s incorrect and the AI won’t know but that’s a business problem. If the AI can execute console commands that’s a security problem and there’s your job still","No, it can help with some of the scripting needed, but when you have humans working to get around defenses, you need humans to help close those gaps, even if it means teaching AI to do it for you and minimize the amount of alerts you get.","Was my time spent studying how to troubleshoot MS-DOS and Windows 95 useless? Nah, it was timely. Study what you need to know to be effective today. You will never stop learning in this field, so you will evolve with the tech as time progresses.","Many of the EDR solutions already have AI engines. But they only increased more work for analysts because of false positives they make.","I think a good analogy is what’s happening with front end development. Co-pilots are putting significant pressure on developers with “bootcamp” experience, making it harder for them to land those entry level positionsIn parallel it’s putting pressure on senior developers because they have to quickly understand code not written by them when troubleshootingSo in general, AI is forcing humans to upskill faster. Senior folks have the advantage, junior folks will struggle if they lack the technical foundation to quickly learnI think the same thing will happen in cybersecurity. AI benefits senior people with strong technical foundations and experiences, and will make it difficult for junior folks to land and maintain their jobs","“AI” is simply automation that’s been around that bunch of venture capitalists decided to monetize by calling it AI. As with all automation, garbage in = garbage out. People don’t realize that “AI” has been worked on since 1970’s and I’ve read textbooks on “AI” that have been published in early 2000’s. There are 3 things that enabled rapid improvement in automation:GPU developments and growth in distributed computingExponential increase of publicly accessible dataModern programming languages that can efficiently take advantage of the first 2 abovePeople underestimate how many flaws exist in any automation that is trained on publicly available data because of the garbage in = garbage out principle. There are plenty of examples already showing how AI can exploited. There’s an interesting project that is seeking to “poison” copyrighted images so that any “AI” ingests those images as part of its “learning” it will spit out garbage.https://www.technologyreview.com/2023/10/23/1082189/data-poisoning-artists-fight-generative-ai/amp/","Who even needs AI to replace cybersecurity people; just write a shell script that only ever outputs \"Harumph, it's not secure.\"","No","No, but I think it will change our jobs a bit. When implemented into tools well, it will be an incredible force multiplier.","Nah, AI loves to use shit like eval() and optimize workflow, and that gives us our daily bread.Maybe in 60 years once AI becomes almighty and self-centred but most of us won't live to see that happening.","It will increase whatever gatekeeping we already have though. Too many people who have weak fundamentals that rely on AI to figure things out for them at work is going to be shocked interviews are going to get harder."],"points":92},{"text":["Cybercriminals crave cookies, not passwords","Cookie theft is not a new tactic to bypass authentication – valid cookies can be imported into a criminal’s system, spoofing the victim’s device. However, this method is on the rise since many users now use multi-factor authentication, making it harder to access accounts with stolen passwords, Hilligoss explained in an interview with Cybernews.And it may become worse.“It's much bigger than just Google. Cookie theft has been so pervasive for so long, and people are really concerned about their usernames and passwords. I feel like very few people really understand how serious cookie theft is and how difficult it is to prevent,” Hilligoss said.Hilligoss assures that Google accounts are one of the most attractive to criminals as they contain a lot of critical personal, tax, and other information and can also be used to reset passwords of other services.“If I get into your Gmail account, I bet you I can reset your Facebook password using your Google account. I do that in the middle of the night. You're not going to realize it until the morning. Now I've got control of your Facebook,” Hilligoss explained to Cybernews. “And the criminals do this every day.”Crooks can use powerful information stealers like Lumma for just $250 per month without any tech knowledge."],"points":0},{"text":["Cybersecurity Risks in Agriculture Technologies","Google “the connected cow” the IoT implications alone are horrifying","https://www.youtube.com/watch?v=z2\\_TLz9TpwYhttps://www.youtube.com/watch?v=zpouLO-GXLo"],"points":8},{"text":["network security","Signature-based detection vs. behavior anomalies.","Try building a basic Vulnerability scanner","Security onion can teach you a lot about network security once you start seeing what it captures and such. There are so many modules in there looking for certain traffic.","Well you could deep dive on reading network traffic (Netflow and full packet captures), which will have you going up and down the protocol stack.  Teach you how to use wireshark.While doing so, if you’re in the mood to do a more involved project, you could MITM some connections and see how that affects the traffic.And as part of that you could learn how to extract files transferred, starting with simple in-the-clear FTP, and progressing to “secure” connections that you’re eavesdropping on (in your lab of course).Learning traffic analysis is a good way to back into all kinds of application-layer stuff that the internet runs on, particularly DHCP, DNS, HTTP, and TLS, and also lower-layer stuff like TCP, IP, ARP, and so forth.  Once you master the basics it’ll be much easier for you to understand what might be happening when looking at network traces."],"points":5},{"text":["What the hell is PTaaS?","Can I use it to pay someone to go to the gym for me?","The terms usage varies from vendor to vendor, but usually it means one or both of the following:Providing Penetration Testing services in a more real-time manner utilising a custom built dashboard or off the shelf software like Plextrac instead of forcing you to wait for some consultant to craft a PDF in wordUsing crowd-sourced gig-workers to more quickly spin up a penetration test at a lower cost.As a former crowd-sourced hacker I have a pretty negative view on the term and the commoditization of security testing at the sake of quality as a whole.","aaS is just marketing speak for outsourcing. If you wanna sound cutting edge and web 2.0 and shit just call whatever you're selling Thing As A Service and you'll immediately get executives and MBAs swooning and patting themselves on the back for how innovative they are for leading the org with the latest in hot tech.See also: AI, ML, cloud. Just sprinkle that shit in there and baby you'll be trending on LinkedIn in no time.","I work for one of the most popular Ptaas companies and ours is pretty dashboards in a platform and human testers. The “on demand” part is where it gets murky as scheduling and having to take a sales call come in to play","Everyone wants their own acronym","Many have different wording, but most of it boils down to your one point: automated scanners and fancy dashboards.Some may include a human element, but many do not. Intruder.io is one such example that markets itself as PTaaS.","Pretty simple. You send a request to our team, we run the pentest. At the end of the month, we charge for total number of pentests. Pay as you go vs full time staffing.","It's how we refer to vendors now, you know, because of cloud.","In the UK it tends to mean \"on demand\" testing, rather than project based testing and isn't crowdsourced.Our PTaaS is essentially a pool of days that a customer can draw from at any time they like, via a request portal. That request is serviced via the same staff and methodologies as if they were engaging on a per project basis.Typically it's software developers or larger orgs that utilize the service as they like to test specific releases/changes that require a wider context, but not a wider test.So it can be a specific API endpoint of a web app that's had a change, needs a test to verify and release to prod. Rather than go through a full scoping every time they do something, they can just request that specific endpoint is tested.","We offer PTaaS. We provider quarterly testing on an app. This model works a bit better because every engagement is typically a pen test and maybe a retest or two. During those retest we look to see if you fixed the stuff we found. Reality is we probably found one or two more through the course of the retest. However, it’s outta scope. With PTaaS we’ll just essentially schedule four retest for the year. Then during the retest or quarterly engagements, we’ll look for the ones you should have fixed and identify any new ones.For businesses, it enables to have folks on hand annually vs looking for out sourced services to fit the immediate need. For customers it allows them a little more visibility without the cost to do it as much.I think it has its benefits. I’d buy it if I was a manager and funding allowed for it","Based on how I heard it first, it's a combo of number 1,2,5,7 form your list, with the added benefit of spreading the discovery of issues over time as things change.But most important thing is that REVENUE STREAM comes in more consistently, and they can also plan the work more consistently...","Here we go. Whatever they called it its still a highly questionable service. At the bottom line it is:a glorified pentest \"simulation\", done either by in-house teams where they have max three four seniors bored to death by doing appsec stuff, and the rest juniors all across the place, or global outsourced. Again, no serious multi skill like cloud offensive stuff, iot, redteam, pretty much all the real stuff.a SaaS platform. And here is where the things get tricky because all of your sensitive data belongs to that company at a certain degree. Yes, your platform does have nice colors, yes, I see 20 issues, but what's the value of having that when all of them are low / medium, not directly exploitable and less important to our business model?From our experience searching for a \" killer\" vendor, if their service is called Pentest as a Service, then RUN. the skill level is limited, the talent pool is coming from dodgy places, or and working as freelancers. And man, this really sucks at your bottom line because that means no accountability. NO MATTER WHAT THEIR VALUE PROPOSITION IS.As a quick example, the guys we are using currently have this rule, if no mediums, highs, criticals, they credit us back a percentage from the overall job cost on top of some other things they also offer.Now is there anyone out there that knows any other vendors willing to put their skin in the game like this? Because we weren't able to find that similar others. Are they perfect, no, but ffs, the issues we got are such a different ball game.","PTaaS is like ordering a mystery box of security tests - everyone’s box looks different and surprises are guaranteed.","First time I invented it, it was just my customer was shot at scheduling and raising po’s and just everything around getting pt’s sorted for all their stuff. We’d been doing it for a year, so I gave them a bundle, 50% upfront payment and we’ll throw in the pm/coordination bit. Rest of it is just regular pt’s against apps, infra and web. Another Custer PTaaS is just getting a week’s testing every Forest week of the month, use it or lose it, but we’ll chuck in an extra day if needed. For us it’s just a mechanism to sell more pentests by making them easier to buy and use, but maintaining the quality and integrity of the test and the team."],"points":150},{"text":["Programming languages for SOC","Most SIEMs have a query language you can learn. I do a lot of my investigations and threat hunting with Python. But I don’t think it matters as long as you know one.","Depends on your environment. Mostly Windows? Get comfortable with some Powershell. Linux? Would get good to know some Bash.After that, I'd say Python. It's in everything so you may as well learn it to an intermediate level. After that, you don't need to know how to code in them, but being able to read things like JavaScript, VBScript, and some other languages that can be easily decompiled like Java or C# will really help when you start being the one who's asked to take apart the initial malware stages like Office docs, HTML files, and random scripts.","Python and SQL","Two things, reading and understanding code and logic during investigations and then automation and code you write for things.Start with something like bash scripting. It will get your feet wet and introduce you to things like loops. It also transfers very well as Linux should be pretty prevalent throughout most environments. Then move your way up to Python. You can do pretty much everything with Python.You will have to be able to read as much and Google as much as possible to try to understand what the code in question is doing. Thankfully you have things like chatGPT / Gemini that can speed up a lot of figuring out what code is doing. It is still a little spotty, but can cover a lot of ground quickly.","In order of importance:PowerShell for Windows IR. Try manually disabling 100 accounts during an incident (awful) with PowerShell it's easy. Wrote a script that does this, 10 lines of code.Python for:Parsing JSON/CSV filesPandas + Jupyter specifically will make you STAND out. All data is cyber is CSV/JSONCorey Shaffer's demos on these libraries are amazing!!Web API programmingRequests library makes hitting Web API's so easy.In 10 lines of code you can extract every hash out of HIBP's free tierAgain Corey Shaffer is great here.RegexRe module makes parsing for matches easyPython will make you STAND out for jobs!! May get an offer specifically b/c of my Python skills.Bash for Linux IR/General knowledge. Self explanatory. Being able to check SSH configuration, dump processes, SUID files, etc is important. Bash scripting basically teaches you the Linux CLI. Python OS module does similar tasks and your Python script will run on Windows and Linux so Bash is a little redundant, but still important to know. Especially for interviews.","postgres for qradar is a must. sql has gotten me further than most languages. Then python, then java or C++. Assuming you're fluent in HTML and other web markup.","Even if you just learn the syntax of SQL it'll be plenty helpful considering a lot of SOC tools are built with similar ideas, eg KQL is used quite commonly","Learn bash, sql, powershell as the basicsThen learn a scripting language like js (node specifically), python, ruby, etc.I would want that minimum from an analyst, rrt, etc in my SOC (I don't work in infosec anymore but used to run an SOC)I'd really like some exploit dev xp and understanding of memory space...so low level xp with C and/or C++ is a big plus. Blue team or red team it makes me think you can dive deep into the subject. I'm also more likely to think you've got some passion for it. Blue side it might be useful for certain L7 filters.On the scripting side an upside to ruby is you can use it to write metasploit modules. You want python and/or js on top of just ruby though...ruby won't be enough alone.Here's one I used to see a skill gap on ALL THE TIME: regexes specifically PCREs. Know regexes inside and out. They're useful in every language. They're useful in sublime text, they're useful in nano...you need them all the time.Perl could come in handy there's still some weirdos writing exploit scripts in it. I'd just learn how to transpile that shit...it's not worth learning unless you REALLY want to.A lot of this is a reflection of a general hiring attitude. I'm not hiring an L1. I'm hiring a future L2 or L3. I want to see you dabbling in the skills that make an L2 and an L3. Hiring and training is expensive I want someone that I think has the highest chance to advance down the line..not an L1 housecat.","Bash python and C","All."],"points":36},{"text":["Tier III SOC Engineer/Analyst Career Advice","This is the second time you have reposted that guy's post, why?","Career advice would be to set low expectations, invest some of your money each pay, keep learning, and everyone's path is different, so good luck."],"points":4},{"text":["In major gaffe, hacked Microsoft test account was assigned admin privileges. How does a legacy test account grant access to read every Office 365 account?","Now that legacy account’s legacy is truly cemented.","Indication of a well-implemented zero trust architecture.","🤔 legacy, non-prod system publicly exposed, with an over permissioned test account, with poor detection capabilities or conditional access controls in place then hit with password spraying and credential stuffing. Glad they caught that cozy bear so quickly and they weren’t in the environment checking in on execs, security and legal teams for months. …..oh wait.","This is KARMA for their insane licensing models, guess someone missed that key control was a M5+P2+O2 in Azure cloud admin Entra ID and not a M5+P2+O2 in azure cloud Entra ID","And now Microsoft will annonce a new product : Microsoft 365 Defender for Microsoft !","The account was testing everything so it had to have rights to everything…","This is wild. I mean, I enable MFA on test accounts. Heck, my lab environment has MFA everywhere!","How could their customers do it right If Microsoft cannot do it right?","It's more complex than the test account had those privileges already. Regardless, it's just really embarrassing for those admins and for their respective security teams. I imagine new detections and compliance policy will be implemented or existing policy reinforced. Perhaps their security teams were aware of out of policy systems but lacked the teeth to enforce. Seen that before. Hopefully not the case here.","It's almost as if you can't have CyberSecurity without a focus on Identity Security...","Ted stopped working here like 9 years ago, he was always really good at fixing email tho","Can someone explain what happened after the test account was breeched? how did it link to the legacy application and how did the legacy application create more malicious oauths and user accounts? And how did it assign full access to those accounts/oauth apps? thanks!from what i understood from the statement, the test account had no additional rights, but the legacy oauth application has.","Too bad there isn't a setting to make a test account expire, just in case you forget. /s","Lazy admins the same the world over. Get used to god tier privs and being too lazy for security measures because “that’s for the plebes” and like things to be quick and easy when testing changes. That’s why job rotation and review of process is important.","Fantastic question","lol","Big Whoopsie","I blame lazy admins","HFS","This would be a nice addition to the CSRB review agenda.","Secure Future Initiative they said...https://www.bleepingcomputer.com/news/microsoft/microsoft-pledges-to-bolster-security-as-part-of-secure-future-initiative/","Good luck to all of the companies here trusting Microsoft cyber security products","Come on guys it's an backdoor environment","They should've used Defender for Cloud Plan 2. It would've detected this... Jokes aside, their infra is massive, they just need more security analysts I think."],"points":633},{"text":["Is there a cyber scenario tabletop exercise scorecard excel template I can use","Like, you want to issue experience points for successful decisions for your ttx?"],"points":0},{"text":["Stately Taurus Targets Myanmar Amidst Concerns over Military Junta’s Handling of Rebel Attacks"],"points":0},{"text":["Help with management","It is the responsibility of the business to make business decisions. This includes more than just security. Further, not all vulnerabilities are equally important.It is your responsibility to ensure that vulnerabilities are appropriately understood (you did include the severity, why it's that severe, and what damage could be done, right?).It's also your responsibility to ensure vulns are properly reported. What are your internal reporting requirements? Who does your company's process say is allowed to accept the level of risk that these vulns represent?If the business wants to accept the risk, it's your responsibility to cover your butt. Get the risk acceptance in writing.If that's all done, then you have a choice: * let the vuln(s) be and do your work * quit * fix the vulns anyhow, and risk breaking other stuff, risk getting reprimanded or fired * see if there's a reporting agency that you can inform (who might already be aware of the vuln). This also risks retaliation (even if illegal)."],"points":2},{"text":["IT, IS, Cybersecurity and/or InfoSec Audit","Audit is not really the same as pentesting. Audit is pretty comprehensive top down approach that check all domains of information security.","There are many tools that you can learn to do various tasks. If you are dipping your toes, I would check out HackTheBox for PenTests and learn about Azure Active Directory. Microsoft has a lot of free resources on their Learn and Technet sites. Tenable Nessus has a free Vuln Scanner you can download and test out. It's limited to 15 IPs but it's enough to get an understanding.","Depends on the sector but your official job is to ensure federal regulations are being follow.","So before you go down a rabbit hole in this, there are some things you should know as a starting point.1) IT and CyberSecurity are definitely not the same and the approach to auditing different areas of technology will be materially unique.2) It's important to have a process, procedures, and framework to how you approach an audit far before you start evaluating tools3) The tools are irrelevant without #2. The tools are not the answer to performing a good audit. Audits live and die by the questions you ask. Better questions = Better potential outcomes and less gaps in the information you are capturing.4) Even the best auditors/audit tools can fall prey to fabricated artifacts. The tools are NOT going to prepare you nor mitigate for this.","Audits? Excel spreadsheets. Serious but also joking answers aside, security is a massive field. Vulnerability management or vulnerability hunting is one tiny little piece of the pie. GRC (governance, risk, and compliance) is about the same distance from red team stuff as earth is from Jupiter. I’d suggest starting by learning what each team does. Read up on blue teams and their functions, red teams, and purple teams where the lines blur between red and blue. You can start getting more specific from there and then look at processes and tools","I understand your urge of collecting tools and try them, however you will accumulate your own list, when doing certain tasks.I would recommend searching for tools based on the tasks you are currently working on. As you might find write-ups, where you are able to see/read people using certain tools, you can collect them and try them immediately on your own. Important is, that you always try different tools and find the one fitting your style & needs.In regards to more offensive security related guides, I would recommend you the following guides:https://book.hacktricks.xyz/welcome/readmehttps://swisskyrepo.github.io/PayloadsAllTheThingsWeb/Hope this is somewhat helpful - happy hacking!","I know that audit always constitutes with Governance risk and compliance. You can try kali linux on proxmox ve or bare metal.","Some things to look atAuditing:Learn; ISO 27001, GDPR, PCI DSS, NIS 2, DORA those are probably the biggest things in the industry now that you need to know of auditor in addition to how to audit.Pen testing:Hack the box, look at YouTube channels like john Hammond, live overflowVulnerability management:Nmap scan, cve, cvsw, cwe, cwss, epssIncident responseFirst.org","CIS cat pro is free and good"],"points":63}]