[{"text":["Thought experiment: How would the world change if human lifespans doubled or tripled?","The rich would get even richer without their spoiled offspring to squander the wealth","Compounding interest would be doing some heavy lifting.Much more inequality, leading to conflict or more wealth transfers if the gov is up to task.Much more money in health industry, if you can live longer, but not stay healthy longer.Wealthy having more children throughout life, for others it would be a decision made later and later.Check \"Altered Carbon\" for some ideas on how \"Mats\" (Mathusalems) would impact society. The book, not the shitty series.","in what ways would our priorities and economies be altered?I read a paper written by an economist maybe 20 years ago now where they did a comparative analysis of the knowledge economy and basically surmised that people store a wealth of generational knowledge and information over the course of their lives and that when they die that knowledge is lost. Therefore they concluded that if people lived longer any economy would see much greater economic productivity; people would live better lives simply because the retained knowledge would improve lives.Now of course this depends highly not so much on how much longer people live but rather how much longer they live healthy lives..Right now we already see live being extended in western economies but the primary issue is that people living longer are still seeing many age related health issues and those issues (primarily heart disease and diabetes due to poor diet and exercise) are actually costing the economy more money and reducing overall productivity. There is additionally the issue of cancer which is the 3rd biggest health issue which does not relate so much to lifestyle so there is that to contend with as well.Coupled with robotics to do all the routine labor...what would happen to the birth rate, existence of money, resource allocation and the like?Human populations act like ecosystems. Idk if they ever taught you this in school but when I went they did a simple lesson where we had little cutouts of rabbit and wolves and you would add them and remove them based on a specified birth rate and then also you would have the wolves \"eat\" the rabbits based on a certain required rate of consumption. If there werent enough rabbits then you would remove wolves (they died from hunger). The point was to demonstrate how the ecosystem of wolves and rabbits in terms of population would swing back and forth but always settle within a range over time.Human populations do this as well. The human population will expand such that resources allow this expansion. There is no absolute infinite amount of resources despite what anyone views on AI/automation, etc are. There is a finite amount of sunlight supplying the earth with energy and there is a finite amount of heat dissipating ability for the earth so there is a finite population number that the earth can support. It is definitely some larger number than what it is today but how much that number is is up for debate.Since there are finite resources there is going to be money. We really need effective post scarcity of everything people want. eg even if we have effectively enough food and housing for everyone we wont have effectively infinite Hermes handbags and if we did women wouldnt desire them they way they do now; they would want whatever other handbag was in limited supply and that necessitates some form of currency with which to find a market price that balances supply with demand.","I don't buy the longevity only for the rich argument for one reason: China, Japan, and Korea would desperately need that tech to offset their aging populations. They'd get hold of the tech one way or another. After which, they'd sell it as a lucrative business and itd become affordable with inevitable economies of scale.","If we all lived to be 200-300 years old, we’d likely all have to continue working until we were 200, and even mild continued population growth would be catastrophic for the planet","If you feel like the older generation is holding on to power too long now imagine all of congress being 150+ years old.","It's funny how yall assume we would be confined to Earth in terms of resource allocation.","Given the above, the next question I would like to ask is whether our extended lifespans also affected our ability to carry children. If so, I think there may be a shift to delaying childbearing/childrearing.I think maybe we might switch to multigenerational housing and family dynamics, like tribes.","We would get real crowded real fast. Climate change would accelerate. Resources wouldn’t keep up.","Aside from the disastrous population increase, I think life would tend to stagnate. Instead of thinking, \"I want to get these things done before I retire in 30 years\", many would shift to, \"I'm going to live for another 100 - 200 years. No need to hurry getting things done\", and they simple would shift into neutral.","If anti-senescence gets us to 200, then we’re biologically immortal. There’s no middle ground.","If pregnancy is prohibited globally and immediately, then it would not matter even if everyone gains eternal youth but without the prohibition of pregnancy, then wars and destruction will definitely happen.","I'm convinced climate change would reverse, because ultra wealthy people with unlimited money would eventually get bored of seeing the world erode for generations.One of the reasons, I believe, for climate change is the \"not my problem\" \"I'll be dead in 10 years anyway\". I know many wealthy people who are in their 40-60s, who just spent 30 years working ALL THE TIME, and just dont care. They want a break with their money.However, if these people had 250 years, instead of 20, to sit on the cash pile, I'm convinced they would do something about the world -- because it would personally effect them.Just a thought","20 somethings would never get to stop complaining about \"boomers\"","Longevity is useless if you can't extend your prime. Like now, we all have a maturity limit. Let's call that limit 65 for the sake of argument.Once you reach your physical 65, you will be 65 for 150 more years. Do you want to be 65, and every weakness it brings, for 150 more years?More importantly, do you want to keep working for at least until you're 165? I'd rather have ways to extend our 30s until we 99 and we just randomly die after than live to be 200 years old.So, how would the world change with that scenario? Elderly suicide rates would spike, for one.","Overpopulation would get a lot worse. A class system based around those that could afford life extension and those that couldn’t would develop.","We would need population control. People wouldn't willingly stop making babies so preferably at birth or even before there should be a medical procedure that would disable fertility (of course reversible). Then probably through a draw people would have a chance to win a right to reproduce. Of course rich and those with power will be able to cheat through corruption. There would also probably be a medical underground that will reverse this procedure but people doing this will be persecuted and it will end most likely like in one of the Love Death & Robots episode and the whole system will eventually collapse.","This may be one of the most horiffic concepts I've ever encountered here 😂","depends how healthy we would be.if you're in the same shape for 250 years as you were in your 20, be sure you will be forced to work for 270+ years easily.and you still wont be able to retire or buy a house.if you lived 300years in bad shape, trust me, like really, trust me : you wouldnt be allowed.politics and rich people would find tons of excuses to not allow you to do so, saying you would cost too much to society and its not worth keeping you alive if you cant work for them.> Coupled with robotics to do all the routine laborwe already have that. but we live in capitalism, that mean you gotta sell your labor or you stay poor and cant afford to eat or pay your rent.​the birth rate wouldnt be much different tbh, most people dont have 50 kids in their life, after a few they stop.​also eternity is pretty damn long, nobody wants that except delusionnal rich people that desperatly want to be on top of everyone else.","Housing inflation since you could now get a 100+ year mortgages. Also way more demand for housing.","Wages would instantly drop by 200 or 300 percent and prices for everything would rise accordingly. Net worths of all the people who attend the Bohemian Grove would also increase in the same ratios as their flocks now have triple the yield.","Humanity better invest in intense urbanisation of earth and outsourcing earth's agriculture and industry to other planets and moons.","I think people in power would stay there longer hence postponing change, so overall worse.Think how much damage the boomer generation did, and how entitled they are about their behaviour. Now imagine it lasting 200 years instead of 30: a nightmare.","You would find corporations offering wages as life extensions. At rates determined by them. Rebranded slavery.Access to life extensions would be restricted. Capital would get to decide the price.Megalomaniac psychopaths, CEOs or other autocrats, would benefit the most.","Careful what you write here... future AI will treat this like a poll","I think \"what will happen if people live 200-300 years\" is less important question than \"what will happen in 20-30 years\".Because in 20-30 years life will be very different with at least AGI and maybe even ASI deployed in the world, coupled with humanoid and not humanoid intelligent robots. This would change life of people and economy much more than longer lives.","Deposit rates and other fixed income rates will plummet to adjust. Otherwise inflation will be a major problem.5% for 90 years yield 47$ on a 1$ investment. If people have 180 years of life, it would yield 6207$ on a 1$ investment.I think balancing inflation and wealth distribution would be a major issue for the economics.On the other hand long term investments with low yield or long investment phase, like building huge power plants or rail roads, will become much more attractive.Collectibles and other nostalgia related markets will bloom beyond wildest dreams. The card game you played as a kid 150 years ago? Time to get all the cards!","Imagine your girlfriend leaving you because they feel in love with your grandpa...","Can you imagine those dudes who retired at age 60.on a final salary pension, just to realise they were getting paid to sit on asses for another 160 years !. Brilliant","Is the amount of years we spend in school based on a percentage of or life or just the number of years needed to receive a ‘full’ education?","I worked for a pretty bureaucratic organization, staffed by a middle layer of career managers, each tightly defending their own turf, fighting intercine battles to the point they mostly cancelled each other out. The only time real change occurred, was when a new top boss came in and either shuffled people around, or fired them. I shudder to imagine how much stasis and empire building would occur with people working for dozens of decades...Yes, older, more experienced people have a ton of knowledge (I was one of them), but my observation has been that after a certain age, healthy or not, creativity, risk taking and innovation plateau. Nature's solution for making sure species have the flexibility to adapt to change, to grow, to take full advantage of the environment, is aging and death- the old making way for the new.Even if we were somehow able to freeze aging when people were still biologically young, there are the problems of how much mental growth would still occur, and what do you do about youth and their opportunities? Do the young have to wait for hundreds of years to be able to take up the positions of influence and power?If there is such a thing as benevolent AIs, perhaps they would become that force for continuity of knowledge across generations, if/when we learn to work alongside machine intelligences.","Depends on how healthy those extra years would be, and how human development looks like. If say, a 60 year old is now the equivalent of a 20 year old; or if the extra years are all of increasing decay.Assuming it's the former scenario tbh I find it a lot more interesting, though I cannot imagine being essencially a child or teenager for half a century; or a baby/toddler for over a decade","Increased wealth gap. Lower birth rates. Probably some spectacular works of art and science with people living long enough to see multi decade projects through. People may even switch careers so crossover knowledge from various fields could improve things. But people could also work on dead end things for longer periods leading to stagnation.","It really shouldn't change all that radically. The first 60 years is mostly growing up, getting an education, getting a job and saving up for retirement.For people born in 1900 life expectancy was 47 years, so there was very little point in saving for retirement. For people born in 2000 the life expectancy is 77 years so retirement planning is mandatory.So people will work and save until they become financially independent at about 50 years of age and then mostly retire.That retirement will be a lot more active than today's version. Today the older you get the more time you spend with doctors, with robust good health people will travel a lot more. You could spend a season in Europe, one in Asia, or follow spring around the planet, or winter. Pick up another degree in something you like as opposed to something 'practical'.","It would be horrible. It would would lead to stagnation.","Most people here are way too optimistic. This would only be available for the ultra wealthy, and my guess is they would make sure it never became a possibility for the lower classes. Lower classes would slowly be weeded out of society while the elite repopulate dozens of times over their long lives. A future society would probably benefit from this unfortunately, but most of our current society would get totally screwed - probably without even realizing it while celebrating this new technology thinking it will soon be widely available.","Every politician you hate would live twice as long, so political careers would go from 40-50 years to 150 years.Imagine Richard Nixon campaigning right now.","A lot would depend on how functional the 100+ year olds were. Would the increased life span mean that people would spend a century being elderly and frail, deaf and blind?","well we’re going through that now since before the invention of penicillin life expectancy was about 47 average. currently there’s a housing crisis and financial instability due to having to pay for retired people living well into their 80’s, meaning younger generations are having to work more for less","Here is a possibility if we knew the age and day of our deathA limited lifeIf we all knew from birth that everyone has the exact same number of days here on earth how might that change our current experience?below is a remarkable reply from AI and NO i am not suggesting implementing some type of forced death or anything, it's just a fact of life. You have your last birthday party and lay down your head for the last time peacefully ....AIIf all humans knew that every single one of us dies at exactly the same age, it would have a profound impact on our world. Here are some possible ways our world might operate:Shift in Priorities: Knowing that everyone has the same lifespan could lead to a shift in priorities. People might prioritize experiences, relationships, and personal growth over material possessions and wealth accumulation. The focus might shift towards making the most out of the limited time we have.Increased Empathy: The awareness of our shared mortality could foster a greater sense of empathy and understanding among people. Knowing that we all have a finite amount of time could lead to a deeper appreciation for the value of human life and a desire to support and uplift one another.Collective Action: The knowledge of a fixed lifespan for everyone could encourage collective action to address global issues. People might be more motivated to work together to solve problems such as poverty, inequality, and climate change, as they realize the importance of leaving a positive impact on the world before their time is up.Reduced Fear of Death: If everyone knew the exact age at which they would die, it could potentially reduce the fear and anxiety associated with death. People might be more accepting of their mortality and focus on living a fulfilling life rather than worrying about the inevitable.Changes in Healthcare: With the knowledge that everyone dies at the same age, healthcare systems might shift their focus from extending life to improving the quality of life. Resources could be allocated towards preventive care, mental health support, and palliative care to ensure that people have the best possible experience during their limited lifespan.Cultural and Religious Shifts: The concept of a fixed lifespan for everyone could challenge existing cultural and religious beliefs about life, death, and the afterlife. It could lead to new interpretations and philosophies as people grapple with the implications of this knowledge.Overall, the awareness of a universal, fixed lifespan could fundamentally change how we live, interact, and prioritize our time on Earth. It could foster a greater sense of unity, purpose, and appreciation for the preciousness of life.","You would probably see insane wars and uprisings, including a healthy amount of lone wolf attacks to try and procure whatever treatment extends life. It would not be immediately available to everyone, affordable, and even scaled to the point that everyone could have it.This would likely take inequality to such extreme levels, that society and governments would need to react quickly, lest things rapidly devolve into chaos.If they scaled it like they did COVID shots, this may be avoided for the most part. If it took a decade to scale, I think there would be chaos.","I think Tech & cultural change would slow down. We tend to get stubborn as we age, and we always look at the next generation as stupid. Imagine Congress being full of people from the early 18th century.","possibility of immortality by uploading into a VR environmentAs an IT worker, I have no fucking idea why people believe that uploading into a computer will let them live longer than being in a human body. The chances of a catastrophic crash, malware infection, being hacked, or some other major issue from any one of a thousand different reasons are much, much higher than mortal risks from being a human.It’s not close at all. Computer data is good for short-term storage and access, but if you want something to last a lifetime, you put the data on paper. If you want data to last a thousand years or more, you put it in stone.","Thought experiment: find a better sub for this question","You would have 80 year mortgages and house prices would skyrocket, as you can now pay your mortgage for 80 years and not 30.","I'd like to say we'd spend the first 50 years of our lives learning and specializing a skill (providing we stay young until maybe 200) but I have a feeling we'd be walking slaves for corporations.","There would be an even more unsustainable increase in overpopulation. An increase in age does not mean a life without disease or pain, so healthcare would become unattainable to many. People would have to work well into their 200s or the economy will implode. Suicide rates will skyrocket. Dementia will become more widespread than people without dementia, causing a total collapse of society. There will be more babysitters available. More hard candy. More dried prumes consumed, tike to invest. Future Shock will.become even worse. I can keep going, but the game is starting...","Transfer of wealth would be a really big problem.Whichever the first generation is to benefit from life extension would be well off. The younger generations would have to rough it a bit.","It would be a major problem for corruption. The rich would be an even bigger problem, we would have generational dictator's/kings.The big questions is how would they look/feel. Are they going to be in 80+ health/decline for the next 200-300 years or are they going to get new bodies/reverse again so they look like a 20 year old?If its the later then a wealth reset every 100 years would have to be in place. It would also be weird if they could still reproduce.","I've been hearing that immortality is 10yrs away for about fifty years now. Also, we are not gonna get off this rock, so we'd better take care of it and each other.","The TV show Ad vitam outlines some aspects of this.","It would create serious challenges for the workplace because turnover would take twice as long for coveted positions/careers. CEOs, high level management, superintendents, etc would stay put for way longer making it very hard for new workers to enter their field of choice and move up the ladder.I think R&D would improve because the shelf life of researchers would be longer, allowing them to flesh out their theories and ideas and visions for a longer period.Population would explode creating challenges for population density, infrastructure, social programs, education, housing and employment because death rates would plummet (assuming birth rates went unchanged).I couldn’t say for sure if we’d be better or worse off tbh, but a longer lifespan would get us there quicker is my theory."],"points":438},{"text":["This week/month in science summary","It's still the same, really.Revolutionary new battery.Reversing aging (in mice, which mostly died before their natural lifespan anyway)New universal cure for cancer.And other sensationalist bs.","I would recommend reading the New Scientist perhaps?","Today's Tech News: Notable or Not?https://todays-tech-news-notable-or-not.blogspot.com/"],"points":2},{"text":["Two-thirds of Americans say AI could do their job","The following submission statement was provided by /u/PsychoComet:Some open questions -1) Which jobs does AI take first?2) Can workers be retrained fast enough?3) How fast will AI job loss happen?4) How much net unemployment will AI cause? Can the labor market handle 2%? 10%?Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1acz1kb/twothirds_of_americans_say_ai_could_do_their_job/kjxkaol/","Why would they ask people that? A huge majority of people has absolutely no idea what AI is capable of. This headline is just ridiculous.","I am very confident that two thirds of americans have absolutely no idea what AI can or can not do. That doesnt even mean they are wrong (i myself have no idea what AI is actually capable of either), it just means this study has no value whatsoever.","Whilst most people (rightly) focus on the “working class”/low skilled jobs that are lined up to be replaced by AI, it’s interesting to see how more traditional professional careers will be changed.For example, the legal industry. Lower level solicitors are still highly qualified, and earn good salaries, however most of their job is doing the donkey work for the more senior solicitors.They read through masses of documents, and create draft reports. Not only does this help summarise the work for the senior partners, but the work itself is valuable experience for when they reach higher positions in the law firm.This work is all easily handed over to AIs at some point, meaning less need for junior lawyers, and less experience for those that remain.","A decent AI could do about half my job. I think we're looking at another case that happened with the industrial revolution, sometimes called Engles' pause.https://www.nordantech.com/en/blog/community/engels-pause#:~:text=During%20the%20UK%20industrial%20revolution,frequently%20called%20an%20Engels'%20Pause.","How does two thirds of Americans know if AI can do their jobs. Lol. Two thirds of Americans don’t even know how AI works lol","2/3rd of Americans overestimate AI, and underestimate their own abilities.New Headline.","Sure. There's a good 40% of my work is on the PC working with spreadsheets, charting, presentations, and some (internal) media. AI could easily do a lot of that if not all. The rest is face to face communicating with those who report to me and who I report to. AI can't do that yet.Also, and this is why people in Hollywood are scared but the executives are excited, you're telling me AI could write an episode of Law & Order Wherever and NCIS Random Location? You could have AI write 5 seasons of 3 different shows and pay one more schmuck to proof them all.","lmao this has got to be the most wildly overestimated general public sentiment I have ever seen in my life.This is on par with when they ask the general population \"What percent of net profit do you think an average business makes when you buy something\", and people answer \"35%\". The real answer is closer to 10%.","I'd say it's likely if you work for a megacorp. Many places just won't have the funds to do a complete overhaul at once. You'll also have companies that pride themselves on keeping people employed. I know the machines at my work don't even run in auto anymore due to how drastically we'd changed products in 22 years. I really don't see them switching anything up in the next 28 of our contract","What fraction of Americans have even the most basic understanding of AI and it’s capabilities to have an informed opinion?","Remember when IBM first introduced the computer and it was going to wipe out the job of analyst and mathematicians?It was a lot more credible before we understood what a computer could do and its limitations. I get the feeling we’re at the same cusp of revolution, facing the same level of threat. Sure we won’t do things the same way (we don’t need type writers anymore!) but the future will find ways to put human labor to capital with new technology as it always has","As a software engineer working with AI daily, even we can't agree what \"AI\" is because the intelligence line is differently defined by everyone. Things people think are new with ChatGPT have been automated in a simpler way for decades for some things.My best estimate, knowing what we have at our disposal currently, would be that we don't have enough money or expertise in different industries to fully utilize the current capabilities of technology as a whole. If we did, almost every job (if not every job) could either be replaced or at least improved by computer systems that currently exist between traditional automation, AI and robotics.I literally spend most of my work hours talking to other roles about their processes and 9 times out of 10, they're working at maybe 10-20% efficiency compared to if they had tools which could've been made with technology from a decade ago.","I'm a truck driver and so many Tesla fanboys think AI can do my job right now. Yes I know there's an AI route currently from just outside Phoenix to Amarillo I think. That being said it's from what is basically a specifically upgraded distribution center to another. Drivers still are in the truck the whole time and still maneuver at the beginning and end as well as unhook and attach trailers and back them into doors.This is the literal best case scenario for AI driven trucks. No inclement weather 90% of the time. Basically a straight route with very few turns. No way to fuck up generally.Just the first two weeks of January almost the entire US has winter storms. Good drivers know their limits and when to shut down. Manufacturers can't even get cruise controlled trucks with sensors to stop slamming on brakes while going under overpasses. How do you think that'll go if that happens to an AI driven truck in inclement weather.What about doing pre trip and post trip inspections out on the road? Inspecting irregular tire wear or damage? Or possibly a giant air leak that locks the trailer brakes? Overheating condition? Big oil leak? Or worse, a hazmat spill? What about a refrigerated trailer going on the fritz, AI can't fix that quickly, there goes 44k lbs of beef. What if the load shifts in the trailer causing the trailer to lean heavily to one side? Ice and slush covered sensors? Truck driver doesn't need sensors to see. Does the AI know what a runaway ramp is? When to use one and how to identify one? They don't all look the same. The AI also can't see a leaky wheel seal, that's a fire waiting to happen.Now any of these dealing with long term maintenance I can see people writing off as, \"the company shop can fix it when it comes back\". Have you guys ever seen how big corporations treat their semi trucks? Most are sold by 500k miles when even the manufacturer says 80% or more should make it to 1.2 million miles with only regular maintenance. They're sold because they don't do all that regular maintenance and don't wanna deal with the repercussions. Truck drivers can push these companies to deal with the issues, even legally by driving to a weigh station, explaining the situation and having the DOT officers put the truck out of service til problems are fixed. An AI will not do that.None of this even gets into flatbed, or backing into a dock inside caves, or maneuvering in NYC traffic or any of the myriad of other difficult driving conditions on the road. Our highways aren't all sunshine and rainbows. AI won't be able to make them much safer for at least a few decades IMHO. Even then, you'll still need someone in the truck like you need a pilot in an airplane.","Fucking 2/3rds of SURVEYED Americans.Because a non sensationalized headline wouldn't be good business.","People keep forgetting one very important thing humans can do that AI cannot: take responsibility for their actions.","2.99/3 Americans, and any other nationality, has no clue what AI can or cannot do.","I am still working in a project which uses COBOL…Even if true that AI could replace that many jobs. The time it will take that AI will do all these jobs will take more than a generation.","That's because 2/3 of the population doesn't know how AI works and what it can actually do.","so 2/3rd of americans are bloggers? because I would love to see an AI dig the trenches for my sprinklers.","Two-thirds of Americans have absolutely no clue, but that doesn't seem to stop them.","I'm curious about licensed professionals, such as doctors, lawyers, engineers, etc. Some of their tasks may be aided by the use of AI, but the requirements to have a person with a license is written into law","As a bartender, currently at least, it's nice to know I at least have one skill that AI won't steal lol. Software can do a lot but drink bots aren't something I see ever catching on.","I wish that people had a higher level of awareness and education regarding matters of AI for many reasons, especially AI generated social media political/ agenda-fueled post. It seems that most people still don't realize that it's just a bot feeding them tripe.","Get ready for a level of unemployment not seen since the Great Depression. This is one of those \"Gonna get worse before it gets better\" things.","AI can’t do my job. Hell I can barely do my job and I’ve been doing it for decades. Auto electric shop.","Even though the AI exists, it cannot replace the human logical ability.","Some open questions -1) Which jobs does AI take first?2) Can workers be retrained fast enough?3) How fast will AI job loss happen?4) How much net unemployment will AI cause? Can the labor market handle 2%? 10%?","No they don’t. AI is coming fer er jerbs! Er jerbss!","id love to see ai try to convince little jimmy to stop hitting little timmy with a shovel, but id have to intervene before it got the chance to try :(","I know several guys working in finance who seem to believe that they are irreplaceable when there’s already programs that can do their job better.","Aside from reproducing which could become possible under certain circumstances, AI can do every single job humans can. That also includes financial management and leading companies. The wealthy thinking of taking advantage of this would eventually have this backfire.","This survey reflects a growing awareness of AI's potential impact on various industries. It's crucial for individuals to adapt and acquire new skills in the evolving job market. shashicj","Most people’s job is just using their learned experience to solve a problem. A very good AI should be able to do that. GP, some law work, some engineering, lot of IT, etc.EDIT: I’m being downvoted but this is the truth. Companies aren’t investing billions in this because it will result in some quirky tools. They are looking for a generational change in employment that will result in the elimination of millions of jobs. It will happen eventually. Maybe not in 5 years or 10 years but by 15-20 years definitely things will be different.","AI has learnt to see and listen as we do. The recent advances in generative AI basically taught it to write and draw.That means, any job that doesn't require criticial thinking is up for replacement by AI.It would be more useful to ask what job requires critical thinking. Jobs that don't fall into this category will be replaced by AI in the next decade.","Yea, and the 1/3 is largely delusional.The reality is AI paired with the right robotics could do almost anything","So instead of countries collapsing, lets do universal income and turn this shit into Star Trek instead of Blade Runner!","Women gonna get screwed hard in the next 2 decades.","AI will never replace my position. AI can't eat, sleep, play steam deck, and smoke weed while watching security cameras the way I can.","What is hyperbole for 200, Alex? AI can't even sort through a hoarder's garage. AI can't clean a messy house. AI/robotics do well in structured situations, but at the present time can't do much outside of that. With all due caveats and provisos of \"not true, if you carefully label all the inputs, sanitize the data, monitor it carefully, within certain parameters...\"","So many jobs could be largely automated. Farming equipment exists for example. But its apparently cheaper to fly in even poorer people from poorer countries. Because the poorest people here dont even want to do that shit for minimum wage.","Possibly, but that’s progress. Job types will disappear as we advance in technology, but that doesn’t mean job numbers will lower. The job market just shifts. You don’t see people lighting the candles in the street lights anymore, but people do work on the electricity grid.","While I don't think there are as many jobs that could fully be replaced by AI, I certainly believe facets of my job could be. I do compliance in industry, and with maybe another generational uplift I could absolutely replace many hours of expected work by feeding diagrams and assets into an AI and reviewing the output. The issue is companies will not give the extra time in the day back, and they certainly wouldn't do it for pay","Can’t and will never ever have my charm and negation prowess and human touch ..TMLJ","To be fair, a simple script or macro could do about 1/3 of American jobs as well but that hasn’t happened yet.","Does your job include checking boxes and making simple rules-based decisions based on some input, devoid of any emotion or feelings? If so then you're primed and ready to be replaced by a robot.","And this is a good thing for everyone, besides the super rich, because they don't want thing to change, they like their little power trip controlling and overworking underpaid salary slaves.The whole purpose of machines and AI is to that we get to do less work and actually have more time to live life.Hopefully some day society will adapt to this..The universe will exist for about 100 trillion years. We get born once and you have somewhere between 60-100 years... And most of those tiny few years are spend working 8-12 sometimes 16 hours a day anywhere from 5 to 7 days a week.Think about that for a moment. Time is precious.","Technically ai could do everything humans do eventually.","Can’t do mine, but I also have a real labor job that matters.","From what I've seen in the corporate world, Excel could do most of their jobs lol","99% of Americans don't understand how AI works, so I would take this with an ocean of salt.","Today I learned the 2/3 of people don't want to go back to work tomorrow.","In the words of Les Grossman “A trained Monkey could do your job..now go out there and accept all the awards for me.”","AI couldn't do my job. My workflows are way too fucked up for anything logical to understand.","Two-thirds of American's lack jobs which \"create value\" . Performing some repetitive task over and over that someone else showed you how to do is not a value-add; it's assembly work. Most non-digital offices are just paper-pushing assembly workers, and AI can 100% do those jobs better and quicker than people can.","Yeah yeah , another AI laborer panic piece - mean while I’m sitting here hoping to see the day AI can do my fuckin job so I can go live more of my life in my own terms - everyone acts like AI taking jobs is a bad thing … it’s not , it will fundamentally change society like the industrial revolution did but it does make human obsolete, it’s just change , a shift - we’ll have to learn to adjust to it just like we always have","*two-thirds of Americans have no idea what they’re talking about.","i think what this means is that at least 2/3rds of Americans don't fundamentally understand how stupid AI's are right now.The hype machine around this tech must be working.","2/3 you say?Do these respondents understand what AI can or cannot do, and in what context and timeframe? Without this, the questions and associated responses are meaningless, because AI is such a buzzword now.Also, 1/3 of Americans believe in ghosts and 3/4 of Americans believe in Sky Daddy™ (including ones who believe in prosperity gospel and serpent handling).","Two-thirds of Americans don’t know what stage AI is at. When they hear AI they’re thinking it means AGI because it’s so overhyped by US media","An AI could not do my job. Maybe <1% of my job. My job is also physically demanding most of the time and not many people are able or willing to do that. Job security.","A task might be automated. For example, creating a spreadsheet every month for a presentation using predefined data sources.A job is usually more difficult to automate. While anything with set rules and decision points might be fair game, there are unexpected judgements and plans etc that make replacing an entire job difficult.TLDR, if ALL of your tasks can be automated, you might be in trouble. But if only 50-60% of your tasks can be automated your job may be easier in the long run.","And 2.999999 thirds of Americans likely don't have a value-added opinion on AI and what it's capable of.","A more accurate title: \"Four fourths of Americans have no idea what AI can do\"","If that were true the global economy would be literally decimated.Instead it's been over a year since the \"revolutionary\" breakthrough of ChatGPT (November 2022) and besides displacing some freelance copywriters, \"AI\" (because what we have now is not AI) hasn't changed shit.","Show me the plumbing robot that can come to my home, diagnose the problem, go get the equipment and or parts, fix the problem, leave. Show me the engineering robot that can read a set of schematics, interrogate a piece of non functioning equipment with over 2,000 paths to failure plus undocumented ones, suggest a repair and write a report to a team for how to complete it. Show me the robot that will take care of old age grandma.","Supposedly, The most common job in USA is \"Cashier\". A huge fraction of them have already been replaced by software so simple it would be a stretch to call it \"AI\" even by 1970s standards.Next are \"Food Prep Worker\" and \"Stocking Associate\". Those are jobs that require hands, but robots are slowly making inroads.4th most common is \"laborer\" which is a broad catch-all term. I would guess that the majority of jobs that fall under this umbrella would be tough to automate.5th most common is \"Janitor\". Another broad category. It's tough to imagine a large facility's head maintenance guy being replaced with AI/robotics, but if your job is routine cleaning tasks, then yeah, the robots might be coming for you.Remember that \"AI\" doesn't just mean Large Language Models or whatever next year's new hotness is. \"AI\" is a whole category of computer science that started in the 1950s and is very much involved in most types of automation.","Follow-up headline: Two-thirds of Americans have no clue what AI actually does, and a further one-third of Americans barely pass the bar of actually doing their own jobs.","I was at a film screener for something that coat a quarter million to make, but the story was less than garbage. I work in film and AI and when I say that gpt3 can do better, I'm not trying to insult him. It legitimately can do a much better job. And gpt4, with prompt engineering, and back end fine-tuning...it actually produces work that's 1000 times better than someone whose been writing for a couple of years.The community of writers just don't realize it, yet, because businesses are still developing the best methods to get the best out of current AI. But AI needs zero machine learning innovation right now to do a better job than most amateur screenwriters. It just needs backend work, which has already been solved, to be implemented into the right user friendly app before they all understand this.Right now, most of their experience with Ai is with chatgpt but they don't understand that what they're working with is clay. Open AI invented the clay but businesses are building the tools to shape that clay into precise replicas of whatever the user wants. So I get a bit of a laugh when I hear a writer say, \"Ai sucks at writing stories.\" No, no, no my friend. You just don't understand what you're working with or how to utilize it properly. I've seen it with my own eyes. It's coming this year or early next year, but writers are going to have a rude awakening.I think AI will replace writers but that just means writers will need to learn how to produce, market, sell, and build valuable things directly to an audience. Writers who only write under contract for someone else's vision is out the window. So there will be a great shift resulting in a booming creator economy full of people who used to only write or only make films or only do gaffing for rich people. They will be more like solo entrepreneurs utilizing their skills in writing to produce stories but in addition they're going to need to turn those stories into end deliverable content that's more engaging and allows for direct monetization.","I only wish AI could install HVAC systems in attics for me 😔","1) Large Language models and Transformers have only been around for 5 years. There is a nobel prize in there once they truly study it's limits.2) There are maaaaaaaybe 1000 people who can do the crazy high end stuff changing the machine learning into better transformers and learning algorithms.3) With just what we got now with what we currently understand it can do we can easily automate almost all work done that is in an office with software.4) People aren't understanding the big picture. only 1 in 10 people employed working with computers 100% a day for their job are going to be needed for this. just like we only needed 1 person in 10 to work on farms after we automated that labor.5) If they can seamlessly within seconds translate job specific jargon across languages then English as a lingua franca will be far less valuable.6) Within a decade 50% the remote workers will be outsourced to the poorest places in the world with an internet connection. Seeing as Vietnam has a faster internet connection than 90% of America today, it sure as hell won't be $30-80 an hour office workers pretending to be busy for 7 out of 8 hours of their day.Entire departments will be outsourced sub contractors to the point where the only money anyone is getting by the hour will be security guards, middle managers, IT guys, and plenty of others pretending to know what is going on under the hood.What will be truly transformational is knowing that it will use API's and capital to explode ROI and then immediately make a Mt.Rushmore of APIs and trillionaires with tollbooths in front of their APIs.","Pointless survey.Now let’s survey 6th graders for what they think the economy will look like in a year.Let’s survey bank managers on the best gym routines.Let’s survey old people on social media memes.","AI can't do my job, but that won't stop my company from replacing me with AI. Sometimes it is more about \"good enough.\" See also how much schlock sells on Amazon despite being throwaway brands.","Something tells me this is Tesla's results.. Well.. It's coming anyway.. Dumbasses.","I would be amazed if even one third of americans realized what ai can and can't do.While ai will only continue to improve, there are some jobs (like nursing or doctoring) that will never be candidates for replacement. Even robotic surgery has active human surgeons on call monitoring every second of the procedure.","I hate how we live in a world where the whole reason we make machines is a bad thing for us"],"points":906},{"text":["How do you think humanity and the world itself will change once life extension and physical age reversal becomes a reality?","People will become true wage slaves. Owned by the banks until they pay off the life extension treatment loan which would have an insane rate considering","People will live their lives without feeling like they NEED to have babies. Those who want them, will for the joy of it.","Wicked men will prolong their lives at the expense of others. Resources will become far more scarce, and those who live honestly will have their lives cut short.","Birthrate will have to slow or we'll have to expand off of earth, one of the two. The planet can't support an ever growing population of immortals.","I think it'll be hell. People like Musk and Putin and Bezos getting to live for centuries, consolidating more power and wealth. It's a power-tripping billionaire's wet dream.","Of course it will change the world and it will change it radically. Whatever generation is in power when immortality is achieved will stay in power forever. The idea of being lead by boomers for eternity is terrifying. That generation has proven that all it can do is destroy valuable things.","Perhaps it will create the incentive to colonize the Moon, Mars, all religions will fundamentally change, we will become much more wiser, since we will have more experience and I believe with AI, its not that far away time wise","This is one of the main reasons why I like fantasy fiction and thinking about the long lived races (dwarves and elves) along side humans. The struggles are similar and no race is immune to the effects of war and disease. But, their reactions and perspectives are much different.I’d like to think that humans will become more patient, benevolent and kind. Especially if we move from artificial scarcity to abundance. If we solve longevity, the the two remaining challenges are energy and labor. We’re on the brink of solving those as well.So the question becomes, what do we do, when there’s nothing left to fight over? I’m hoping for a Star Trek “explore the universe” adventure for those that feel called. The rest of us can stay on earth and garden, paint and play music. Hahaha","Maybe the longer our lifespans the more time we'd have to fix the BS we're hung up on? From a psychoanalytic perspective, the greed, and desire to accumulate wealth and power arises from a fear of death.\"I gotta do a, b, c, before I'm old, or because I could die at any time\" ...or, \"I should have this and that to live my kids in case I die\" .....the desire to live on through legacy. I think if we lived to 5,000 years. Individuality may actually plummet, because we know we have time to jump all the hurdles we've placed in our own minds. We could actually take it slow.","Please let me know if i’m being an ass here, but i feel like this sub asks the wrong questions sometimes. Us, living right now in early 2024, asking and speculating what age reversal will be like, is like people in 1950 asking what it will be like when we cure cancer.And it’s not like these are my own personal thoughts, either. There are literal Phd’s in this very sub who agree with me. It sucks to even type that, because like you guys, i really want significant life extension to become a reality in our lifetimes. But unfortunately, it isn’t exactly looking great right now.","Personally I don’t want to live longer but I would like to live fit and healthy even at old age, if that makes sense.Also if we can ‘fix’ aging, society might reshape itself. That means things like how long do people stay in school, when do people typically get married and have kids, how many careers can one have in a lifetime, retirement age and so on.Imagine having your first retirement at 60 and then taking a mandatory break for a minimum 20 years before starting a new optional one at 80, for example.","Well the wealthy will be the only ones able to do it. Rest of us average people will just be SOL. That's how most of the stuff goes. If it's an elective or cosmetic procedure it's typically out of the reach of the average person. Can you imagine how much something like that would cost.","Once immortality is possible its adoption becomes inevitable. The people who opt out will die and the rest won't. I don't believe the BS that it will only be for the rich. A technology that momentous would get out in some way, by theft or reverse engineering or just because someone decides to distribute it. after that point conservatism will become an even bigger problem than it is now since the old bigots won't be dying anymore. We need to think about things like this before the time comes and find solutions to them. It doesn't have to be all bad if we do it correctly.","I'm more intrigued by the obsession people have over this topic - especially younger people. Even if you could extend your life indefinitely by artificial means, your brain would most likely have issues keeping up. Memory takes up space, and your brain isn't infinite. Most older people have trouble keeping up with changes in society and the world.So the more apt question is \"what would people be willing to sacrifice in hopes of extending their life?\" Their memories, developed skills? Take into account there's no telling what part of your brain does what (edit: at least to this level), so regenerating stuff in your brain would happen at random. You might lose your childhood trauma, or you might lose the years of therapy you had to cope with it.Just living longer of becoming immortal is a cool research project to have (to understand life better), but applying that science to humanity is a pipe dream. I'd wager anyone would just opt for euthanasia at one point or another even if they were excited to live beyond their natural lifespan when they get the treatment done.","Genetically modified offspring and eternal life. But only if your rich. The class wars of the future will be interesting to say the least. Brings Altered Carbon to mind!","Less children probably.Rich will stay and only get richer poor will continue to get poor but will have the added line between the classes become even farther apart.","Unless we cut the population in half…. It will be Logan’s Run before we know it","No. We won't evolve anymore about our ideas and many points I think. Humanity evolve because the old generations leave their place for the youngest.","People against age gap relationships will go crazy and commit suicide","World will become over populated. Food will become scarce and then Soylent Green","Most people on earth are religious and many more are spiritual. Many of us are also just plain curious about what might exist on the other side. I worked with a lot of elderly people at the end of life and it’s just such a different perspective. There’s a peace and personal knowing about death that’s difficult to articulate as a young adult.Death at a young age is cruel and unfair, but to someone with many more decades, it starts to become a more natural part of life. It’s sort of like how little kids imagine what it will be like to get married and have a family of their own. It’s nothing like what you imagine.","You're gonna have a huge population issue if you don't sterilize immortal people.","The only thing that will change is that the rich and powerful will be immortal or at least live much longer than common people, who will be forced into \"climatic euthanasia\" when they can't work anymore.","The people who are concerned about population don't understand geometric seriesLiving longer, healthier doesn't produce more eggs in women, which means the reproductive age remains 15-45If the TFR of humanity is below 2, each generation would be smaller than the previous, and this is a geometric convergent seriesThe TFR of developed countries is of 1.5, and the world is at 2.2, if when we get this treatment the human TFR goes to 1.5 then the human population would plateau at 16b peopleJust because you add an infinite amount of terms doesn't mean it will grow indefinitely, 1+½+¼+⅛... Doesn't grow foreverEven if there is zero deaths, humans will barely double our current populationConsidering that in the 20th century we quadrupled the population, this doesn't seem like a problem","It will only be available to billionaires for the next 50-100 years. After that, the world model turns upside down. If you can age as a productive citizen forever, then how is population controlled in the world? There will never be a retirement age, you will have to work forever. I’ve been an AI expert for 200 years now, from the beginning. How does a young kid compete with that.","Eh it'll mostly be for the richest of us for the first 50-100 years.","It is not going to be a reality (for the wider public)","We'll all starve to death. The only thing keeping population in control is dying.About 61 million people died last year, compared to 134 million who were born. Without those deaths the population will go through the roof.This is especially true if fertility is extended to older women. That would increase the birth rate as well.","Read Peter F Hamilton's books. He deep dives into this stuff.","Another alternative that could possibly circumvent the huge negative impact semi immortality would have on necessary commodities, such as food, clean drinking water, housing, transportation, and such is the notion of uploading ourselves onto a mainframe computer, or digitizing our minds. But this would also open up a whole big new virtual can of worms.","It depends but probably poorly. If humans can live for longer then it could result in stagnation since the older generations are not dying off. That means younger people would have to wait to get better jobs and to get into places of power.","Career prospects will do a nosedive. Senior positions in large organizations will be largely occupied by 100yo workaholics. This will skew the potential career path for younger professionals.Birthrate limits will be gradually applied all over the world. Genetical improvement for the newer generations will need to come in place. Not so much in terms of boosting certain traits, as to making sure no genetic diseases are passed down. As humanity has less children overall, it will be vital to keep the pool as healthy as possible.We will either need UBI or space expansion so there's jobs/opportunities for the mortals.","Watch altered carbon… could be something like that…","I see two possibilities depending on whether other technologies having been developed. Netflix's love death and robots explores this in one of its episodes, wherein society is extremely dystopian and unregistered births are a death sentence for those caught. Essentially elites keep draconian laws in place to ensure the population doesn't get out of hand.Now if we weren't so limited on space/resources we might see something like the world's portrayed in the Commonwealth saga by Peter F Hamilton. Not long after the first successful rejuvenation treatment was announced, wormhole technology was discovered that gave humanity an abundance of new worlds and resources to expand with, easing overpopulation fears for humanity as a whole. Both are fun to explore, but it's anyone's guess which way we'll actually go as a society.","we would definitely need term limits for any and all political positions","The first aspect that I would consider is what the cost is to the individual to have those procedures.Financial cost: if it is expensive then the rich will be the ones that benefit. I can see people here suggesting that businesses would pay for it and you would pay them back or work for them for decades but I simply don’t see any business committing to a decades long relationship with anyone when that individual could simply go bankrupt and void some or all of the debt. They also would never want the people working for them as the power to fire someone is a necessity in case they need a scapegoat.The lifestyle cost: at present there are vast lists of things that each person could do to increase our lifespan on average, reduce numerous health risks including our dementia risk. In practice, very few people do very many of those interventions and I cannot say that I have met/heard of anyone doing it all. That is partly due to lifestyle factors that cannot be controlled (e.g. hours spent working so you can’t home cook all your whole foods meals or fit in enough exercise etc). However, equally, those who are rich seem to be just as unable to meet all the requirements (though it is easier to eat home made whole foods when you have a personal chef). Again, I would say that the rich would be the ones who would be most likely to benefit as they have the most control over their lifestyles.Side effects cost: if the procedures are unpleasant or cause distasteful side effects then I don’t think that uptake would be very high by many people. We can see from the impact of medication side effects that there are limits on what people can/are willing to endure. If it causes impotence then I can’t imagine it being very popular at all. So, only those who have a strong desire to live for an extended period of time (perhaps sociopaths or megalomaniacs) would commit to it long-term.So, most likely the wealthy and those who are desperate to live for as long as they can would be the only ones to access the services. Consequently, wealth would become even more concentrated in the hands of a very few people.If it somehow had no meaningful costs then overpopulation would become an urgent issue in the countries that engage in it and most likely forced sterilisation at birth would be required (with births only allowed under very strict circumstances). How that would affect the psyche at a population level I don’t know but I can imagine that it would have a big social impact.","In this world? Jobs will become even harder to get as both fewer people retire and employers will be looking for decades more experience. Social security will either raise the benefit age to some obscenely high number, or be ended altogether since anyone whos not filthy rich will be expected to just work forever.","Retirement will no longer exist. Society can't have everyone do nothing productive.Interesting in the stock market will no longer be a path to retirement. Hence, stock market behavior will change. A company's stock will only grow if the company grows.","Ironically governments and billionaires will probably actually start giving a crap about the environment, global warming, etc. Since they'll now know they'll probably experience the worst of it as well.","No matter...earth would eradicate us eventually. Over populating a planet is like an infection. The planet will compensate and destroy the means of this \"immortality\".","I believe immortality will never be reached but extending the life span of our cells could happen. When that does happen then the middle to high class population will probably benefit the most out of it and most likely the same problems we have today will be exacerbated e.g. health insurance, corrupt politicians, nepotism, etc.","We’ve seen plenty of procedures that extend and improve life. But at the end of the day we aren’t built to last. Just enjoy today, this thread is full of useless doom and gloom.","The moment that real life extension or even biological immortality become available, the wealthiest will access it first - and that will change the world.The common attitude among the wealthy, that issues like climate change and pollution will never affect them, because they will be long dead before then will end. They will still be alive, and they will have to deal with the reality that yes, they will be affected. They will be affected. They will suffer. And that will instantly make fixing these issues the most important priority on earth.Always bet on selfishness, always bet on personal interest.If you want to save the ecology of the planet, make the wealthy that control everything live for centuries, if not millennia. In that moment, long term planning matters. In that moment a livable climate truly matters. In that moment protecting the earth finally matters.Because they will live to deal with it, and they definitely don't want that.The wealthiest and the most powerful should be forced to become immortal. Forced to face their actions by still being alive when the worst happens. That is when we will see real change about protecting the environment.","Rich people would live longer and accumulate more power over that extended period of time.","Elysium maybe? The rich will be immortal, the poor will be (more) disposable.","Rapamycin exists today yet nothing has changed so far.","For one, if this is ever allowed to trickle down to common folks, it would probably require sterilization in exchange and only be offered to people who don’t already have kids. As much as they harp on the global population now, having a growing, near immortal population would be a nightmare scenario for elites.","Social security will be fucked. Hoping millennials will pay my bills for the next 800 years is unreasonable.","Humanity will subconsciously long to die and will eventually eradicate itself."],"points":175},{"text":["All Trucks Will Run On Batteries Filled With Low-Carbon Electricity","The following submission statement was provided by /u/nadim-roy:Is there any real world evidence to support massive electrification of trucking? Yes, there is. China has over 500,000 electric trucks on its roads already and is adding more daily. Meanwhile there are rounding error numbers of trucks with hydrogen and other alternatives to batteries and electric motors. The test has been run. Battery electric won.The USA’s transportation blueprint and hydrogen strategy are both based on broken assumptions and bad faith efforts to justify hydrogen, driven in large part by Congress forcing the authors to give the US fossil fuel industry a future. Similar problems exist in Europe, where they are intending to build a massive hydrogen pipeline effort assuming hydrogen will be shipped to ports like Rotterdam for use in transportation and heating applications.But these efforts to perpetuate the hydro in hydrocarbon will crash on the shoals of physics and economics, the Scylla and Charybdis of hydrogen for energy. Just as with everything else, the future of trucking is electric.Other than this there is a full analysis of trucking electrification and its challenges specific to the US.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1acv978/all_trucks_will_run_on_batteries_filled_with/kjwx33n/","I was at an “Electrification of Everything” event in Chicago last week. One of the panelists mentioned focusing on the 70% and not the 100%.For example, with existing technology today, battery electric trucks can support 70% of current workloads. That still leaves 30% of the long haul loads, but there’s no reason to let perfect be the enemy of good.Additionally, as we focus and transition that 70%, more charging infrastructure and innovation will happen and it will make the remaining 30% that much easier to solve.The only constraint is battery production, and to some degree cost. But scale, lowers prices, I see those issues coupled.","The article's author is a industry speculator that is involved in three startups (oops, one of them is a 404 error, so it now must be two) based around all electric aviation & trucking. He does nothing but denigrate cheap available means of energy, but instead says\"electrify everything.\" He also sides with Blackrock on China being a good investment. I wonder if it's because most of the lithium batteries he touts are made there.An oft-mentioned challenge in this electrification shift in trucking is the tradeoff between payload capacity and battery weight. Unlike their diesel counterparts, electric trucks need to carry sizeable battery packs, which contribute to the overall vehicle mass and therefore affect payload capacity.Tesla touts that their all electric tractor can have a range between 300-500 miles. That is not a great range considering most diesel tractors have a range of 900-2000 miles on a full tank of diesel. Since electric trucks are more heavy than diesel tractors that means less freight per load. That would also mean you need more trucks and more drivers, which in turn means more wear and traffic on highways. What are highways paved with? Asphalt, which comes from oil. What kind of tax will then be implemented on electric charging stations for road maintenance funding? Where does this electricity come from? Well about 60% of US power produced comes from fossil fuels (coal, natural gas, and petroleum).https://www.businessinsider.com/electric-trucks-longhaul-batteries-tesla-heavy-cargo-weight-problem-2023-2#:~:text=A%20semi%2Dtruck%20including%20its,total%20weight%20of%20the%20truck.https://medium.com/the-future-is-electric/soros-is-wrong-on-china-blackrock-is-right-41910c508441https://luxresearchinc.com/blog/the-payload-problem-in-heavy-duty-electric-trucking-is-not-all-that-big/#:~:text=An%20oft%2Dmentioned%20challenge%20in,and%20therefore%20affect%20payload%20capacity.","Unfortunately, the current best battery, which utilises a quinone based chemistry developed by MIT, has been leased to Lamborghini.It can do over 700wh/kg according to claims and fast charge with excellent cycle life degradation. It may be 30-40% cheaper per kw/h up front.This would be sufficient to electrify a lot of trucking without excess mass.But battery swapping is preferable as charging can be less aggressive, and the system can smooth out periods of peak demand and soak up local renewables. It will be the fastest recharge so can allow medium sized packs for increasing payload fraction of total vehicle mass, raising trucking efficiency to around that of current trucks.Battery swapping with >500wh/kg batteries has a lot of synergy with renewables generation in out-of-town locations. For example, distribution depots and recharging stations can be co-located with agrivoltaic parks + taller wind turbines near highways.So this approach can improve the financials of rural renewable electric generation and avoid much of the transmission and distribution costs.","Wait. I‘m all in on electric trucks. But the hydrogen pipelines and hydrogen gas power plants are meant to eliminate carbon emissions from industry and power generation.It has nothing to do with the traffic sector (at least in Germany).","I wonder, does an electric truck send you to a different kind of other world when it hits you than a regular one?","All things considered electric semi trucks will be relatively easy.","As soon as you have to transport hydrogen it becomes less efficient than electricity. End of story. It’s far easier to move electricity than hydrogen.There might be a use case for producing it on site at industrial locations that can use excess renewable energy for the hydrogen production. But the more you move hydrogen, the more you loose.And I know people will say the same for electricity and resistance, but anyone can do the math. Electricity resistance is less than hydrogen losses.","[deleted]","People have significant difficulty understanding the impact new technologies will have until those impacts have been broadly felt.You see a lot of it on this thread specifically, in that there are several technologies poised to fundamentally alter the world in very easy to predict ways (general purpose/humanoid robotics, self-driving technology, electric trucking, to name a few) and yet the general vibe is that they're \"vaporware\" that are being routed only to scam gullible investors.","I think blind dogma to electric batteries is what has stifled innovation, almost like the people pushing it have an ulterior financial motive behind the push and they hide it behind some fake garbage altruism","why not make better light rail train and run them off a power grid.that would never work.","I love the idea, but since I live in Sweden, the main argument is always the cold. Would these trucks work in -30°C (-22°F)?","Just back from China and Hong Kong’s taxies are almost all electric now. China’s going all in on electric.","Electric trucks have not won anything yet.They are a rounding error themselves compared to the size of the trucking market.Electric will likely win out for single hub fleets.For long-haul trucking the least available resource I’d the 10 hours that drivers are allowed to work each day.I’m pretty sure that hydrogen fuel cells vehicles can be refueled during a bathroom break; however, there’s no way you can charge a truck in that timeframe.Electric trucks might work if you could do something along the lines of:Being able to swap two batteries that comprise about 40% of the battery capacity each in 10-15 minutes with minimum manpowerCreating a liquid cooling system that allows super fast charging without overheating the batteries and for that cooling system to be able to easily hook up to the truck and be universalGetting a reasonable charging capacity for the remaining unremoved battery pack in 15 minutesIf you can pull all that off the only concern left is weight.","As long as fertilizers are needed in masses which are made of fossil gas there is a production purpose for gas and the fuel as a waste product will become even more cheap if the transpartation sector electrifies. The modern world could of course use batteries whereever possible but this wont end the use of fossil fuels global.","I think hydrogen will be the solution. What do you say?","Is there any real world evidence to support massive electrification of trucking? Yes, there is. China has over 500,000 electric trucks on its roads already and is adding more daily. Meanwhile there are rounding error numbers of trucks with hydrogen and other alternatives to batteries and electric motors. The test has been run. Battery electric won.The USA’s transportation blueprint and hydrogen strategy are both based on broken assumptions and bad faith efforts to justify hydrogen, driven in large part by Congress forcing the authors to give the US fossil fuel industry a future. Similar problems exist in Europe, where they are intending to build a massive hydrogen pipeline effort assuming hydrogen will be shipped to ports like Rotterdam for use in transportation and heating applications.But these efforts to perpetuate the hydro in hydrocarbon will crash on the shoals of physics and economics, the Scylla and Charybdis of hydrogen for energy. Just as with everything else, the future of trucking is electric.Other than this there is a full analysis of trucking electrification and its challenges specific to the US.","You mean the same China, that produces the vast majority of its electricity in coal power plants and produces and registers EVs just because they want to beat Tesla, because it is a political order by the CPP and then let them rot unused in the fields? That wasteful China that misleads everyone about everything is a proof that EVs have won? Sorry, bad news for you, with current technology, EVs are a dead-end.","The thing is, batteries are great for short range trucking. Think expending the charge during the day and charging overnight at a base. Sure, there are required rest times during which a truck could charge, but the issue is infrastructure. Let's assume 10 kW charging power. For a truck stop capable of servicing twenty trucks you suddenly need to run a 200 kW line to the middle of nowhere. Or build on site generators which are unlikely to be green.One business which sees increased electrification but doesn't get mentioned much is last mile delivery. The vans which run from a local distribution center to homes and businesses. There BEVs are increasingly popular, and for a good reason. The routes are easily within a vehicle's range, and they can be left at the base to charge overnight.","A Tesla semi is 900kwh. Most evs only use 80% of their battery til \"empty\". So 780 kwh.Stop at a truck top and look at how many trucks are there at any given time. There are 3.5 million truck drivers in the US. If we figure 50 percent of them will be charging their trucks at night, then that is 1.6 million trucks.At 780 kwh and 1.6 million trucks, that's 1.248 BILLION kwh per night being recharged. That's conservative numbers, especially considering that in general Tesla semis can only go around 400 miles real world on a charge.As a truck driver I really think trucks should be hybrids first.","Nobody cares what China does. It’s all hype and propaganda. Electric doesn’t work in the cold, it’s only good for short hauling, diesel will always be number one when it comes to trucking. No US based trucking company is going to go 100% electric.","This is too dumb. It effectively dooms all power to c because China has electric trucks. Come on... Hydrogen is preferable in some hard to abbate industries. But it is also preferable to not bet everything on batteries, since they use up so many ressources and are often build using morally problematic minerals. Plus the West doesn't want to be too dependent on China.","I love electric but we aren't building real - always on - power plants. China is. Wind and solar will not sufficiently power up America's truck traffic. It will take abundant power to serve the trucking industry.","What does low carbon energy mean? Refined fossil fuel?","Rall rucks rill run ron ratteries rilled rith row-rarbon relectricity Raggy","Truck on an electric battery? The truck is for long-trip deliveries. then how it possible on-time delivery.","That's great, but how will we get a hold of the rare minerals and materials needed for the production?","All it will take is one good volcanic eruption to temporarily wipe out not only our ability to grow crops, but to transport food already in storage to the places that need it.Past eruptions (for instance, 1815-16) had tragic consequences for humans and we weren't dependent on the Sun for energy then, other than to grow crops. As our dependence increases, so does our risk.I hope scientists are keeping a close eye on Earth's volcanoes ...","Where is all this electricity coming from? China is using every power source at its disposal while the US pushes for an all green solution. Further the US grid is not capable of the required additional draw. So, where is all the electricity coming from?","This just changes the point where pollution is made. Industrial power has to generated somewhere, and until large scale clean industrial electricity can be realized, its going to continue to be natural gas and coal. We need to get over nuclear phobia and embrace it more. Renewables are improving, but can't provide what we need to grow.","Sounds great - At what point do we stop the slave labour and atrocities happening in the Congo? Once we have all in this in place or before?","[removed]","Why have trucks? They will be self driving trailers with electric motors in the wheels.","Mostly what we need is another few thousand Nuclear plants to be built TODAY.","I’m a trucker actually by trade. I can see its application in intermodal travel by rail, and maybe dedicated local driving as of right now really. I think we need to foremost solve the very corporate problem with rail if we want to expand electric usage in middle mile delivery, especially long haul. In an ideal world, rail would do the bulk of long haul other than niche and specific services, and electric trucks would be used to move those containers to the receiver. I think that is the best application currently, but again, our rail system in this country is fucked and not efficient enough.","I dare say good chaps, that the title OP hath bestowed upon this post is lacking in detail, notably that of the who, where, and when. I have therefore decided to place a link to /r/titlegore in my comment in order to point out my dissatisfaction with the standards of journalism present in this here reddit thread.","The tests have been run. Battery electric has won.No, they haven’t. It never surprises me that actual truckers aren’t interviewed for these kinds of publications. Anyone with experience in the industry will tell you that, as things stand now, battery power ain’t it. Aside from the added weight which decreases capacity, the range sucks and the recharge times aren’t economical. Could that change in the future? Sure, but I’m not holding my breath.There are some instances where it could be viable but they’re all based on local and delivery routes. Not OTR.It makes more sense to me to build hybrid semis with the same technologies that diesel-electric locomotives currently possess. You save on fuel, you retain the needed torque, fuel times are quick, you can utilize regenerative braking in the mountains, etc.","The batteries don't do well in cold climates, which the el . Buses in Oslo experienced this winter. Having it happened to long range trucks would be much worse and paralyze traffic.","I hate quibbling over semantics, but that Forbes headline is terrible. Instead of “batteries filled with low-carbon electricity,” it should read “batteries charged by low-carbon sources.” You don’t actually fill batteries with electricity, it’s a chemical charge (Ion) that transfers electrons to the anode.","Unless another outside source besides china can verify the claim of 500,000 electric trucks, then It’s a load of BS. Look up china’s electric car graveyards, thousands and thousands of brand new electric cars left to sit in ghost cities with brand new plates.","One of the issues is with battery weight managment and energy density. With fuel, as you run out you don't carry that extra weight. With batteries you still lug a brick whether or not you're full","If trucks are using battery packs, they need to factor in the battery weight with the legal maximum weight of the truck. Big battery, smaller load.","I'd hate to see what an electric truck fire would look like"],"points":180},{"text":["Seeking Past Predictions of the Future: Accurate vs. Inaccurate Forecasts","You could check out the Futurists list on wikipedia to narrow your search.","There's plenty of articles and videos about the predictions being made by futurists from the 1850s to the 1930s, but these videos cover more recent predictions:What The 2000s Thought Today Would Be: ComputersWhat The 2000s Thought Today Would Be: PhonesBad Predictions From Twenty Years AgoTerrible Predictions About The Future From 2005The Less Boring Dystopia: Microsoft Home of the Future 2005The Most Boring Dystopia: 1999 Microsoft 'Home of the Future'What the '90s Thought the Internet Would Become","Dont forget the survivorship bias, you might find more that turned out to be accurate.","Comics- Dick Tracey having a phone on his wrist was pretty spot on.","Look up the Unabomber manifestoWe had to read that in college and it screwed me up how someone who was a genius could do the things he did to try to stop the future","The skeptics guide to the future has several examples of this. I believe it is fully referenced so you can find more there.","I don't know how accurate they tried to be, but you have a series of postcards made about Paris in the year 2000, one century before: https://parisianfields.com/2014/09/21/paris-in-the-year-2000-viewed-from-1900/"],"points":5},{"text":["Tesla Semi Is World’s Only Electric Freight Truck Capable of Driving More than 1,000 Miles a Day","The following submission statement was provided by /u/Maximum-Leadership91:PepsiCo’s innovative approach to sustainability is exemplified by their integration of Tesla’s Semi trucks into their fleet, showcasing a blend of technological advancement and environmental responsibility. Their Sacramento distribution center is a hub for these electric trucks, which are primarily utilized for shorter delivery routes within a 100-mile radius, demonstrating their operational versatility.The Tesla Semi trucks stand out for their efficiency and long-range capability. They have a maximum range of 500 miles per charge, a feature that was put to the test when one of the trucks impressively covered 1,076 miles in a single day during a rigorous testing process. This achievement was made possible by alternating two drivers over 24 hours, thus maximizing the truck’s operational potential.Feedback from drivers who have operated the Tesla Semi trucks has been predominantly positive, especially in comparison to traditional diesel trucks. Drivers have reported a more comfortable driving experience, easier handling, and superior visibility from the truck’s cabin. These benefits are further complemented by the truck’s regenerative braking system, which has proven to be a unique and efficient feature, especially on routes with significant elevation changes.PepsiCo’s commitment to a sustainable future is further underscored by their goal to eliminate emissions from their operations by 2040. This ambitious target is supported by their significant investment in electric trucks, including one of the largest orders of Tesla Semi trucks, signifying their dedication to reducing their carbon footprint.Tesla’s role in this transition is crucial as well. The Tesla Semi, still in pilot production, is a pivotal part of Tesla’s strategy to revolutionize the electric vehicle market. The production of these trucks, set to scale up following the expansion of Giga Nevada, marks an important milestone in the evolution of electric freight transport. As of now, Tesla has produced approximately 100 electric semi trucks, many of which are operational in PepsiCo’s fleet.The partnership between PepsiCo and Tesla in deploying electric Semi trucks is a powerful example of how corporations can leverage emerging technologies to meet environmental goals while maintaining operational efficiency. It’s a testament to the potential of electric vehicles in transforming the logistics and transportation industries, paving the way for a more sustainable future​​​​​​​​​​.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1acudwa/tesla_semi_is_worlds_only_electric_freight_truck/kjwqpj1/","Is any truck actually doing 1000 miles in a day considering mandatory stops and no night driving? That's just a flex right?","How much cargo can it legally carry?Edit: Why am I required to post an elongated comment when I only want to ask a simple question? This seems to be a very shotgun approach to solving spam.","\"They have a maximum range of 500 miles per charge, a feature that was put to the test when one of the trucks impressively covered 1,076 miles in a single day during a rigorous testing process. This achievement was made possible by alternating two drivers over 24 hours, thus maximizing the truck’s operational potential.\"So how long do they take to charge?","That article reads like it’s up Pepsi’s bum that it is checking for tonsillitisinnovative approach to sustainabilityIs using electric trucks?","I guess we've all forgotten about the assorted streamliners and the lessons they taught us.There's a reason the layout of transport trucks haven't changed all that much since the 1920's despite designs such as the streamliners used by Labatt's in the 1940's existing. Those designs were very aerodynamic and what limited them was the cargo. Those rather beautiful 1940's trucks taught us that a specialized streamlined trailer has very limited use on a truck. You can have a hyper aerodynamic truck but if you're hauling things that aren't it's wasted effort. I mean even something as common as a stackable shipping container would be a disaster for this vehicles mileage and given how much is shipped in those things makes this not all that useful.The Labatt's streamliners aren't the best example due to their bunt face but oof they're beautiful trucks.","I've heard that thing sucks, but there's so much noise around Musk and EVs that it's like impossible to get a fix on if it's good or not.","Man it sure would be a shame if someone where to make a truck that actually workshttps://youtu.be/r1MaX-ppsFc?si=O2sp0ii7CSMu19w4How'd that link get in there?","The current liquid battery technology is outdated. Everybody who is buying electric these past years will regret it when much safer and more reliable solid state batteries come out on the next 3 years.","PepsiCo’s innovative approach to sustainability is exemplified by their integration of Tesla’s Semi trucks into their fleet, showcasing a blend of technological advancement and environmental responsibility. Their Sacramento distribution center is a hub for these electric trucks, which are primarily utilized for shorter delivery routes within a 100-mile radius, demonstrating their operational versatility.The Tesla Semi trucks stand out for their efficiency and long-range capability. They have a maximum range of 500 miles per charge, a feature that was put to the test when one of the trucks impressively covered 1,076 miles in a single day during a rigorous testing process. This achievement was made possible by alternating two drivers over 24 hours, thus maximizing the truck’s operational potential.Feedback from drivers who have operated the Tesla Semi trucks has been predominantly positive, especially in comparison to traditional diesel trucks. Drivers have reported a more comfortable driving experience, easier handling, and superior visibility from the truck’s cabin. These benefits are further complemented by the truck’s regenerative braking system, which has proven to be a unique and efficient feature, especially on routes with significant elevation changes.PepsiCo’s commitment to a sustainable future is further underscored by their goal to eliminate emissions from their operations by 2040. This ambitious target is supported by their significant investment in electric trucks, including one of the largest orders of Tesla Semi trucks, signifying their dedication to reducing their carbon footprint.Tesla’s role in this transition is crucial as well. The Tesla Semi, still in pilot production, is a pivotal part of Tesla’s strategy to revolutionize the electric vehicle market. The production of these trucks, set to scale up following the expansion of Giga Nevada, marks an important milestone in the evolution of electric freight transport. As of now, Tesla has produced approximately 100 electric semi trucks, many of which are operational in PepsiCo’s fleet.The partnership between PepsiCo and Tesla in deploying electric Semi trucks is a powerful example of how corporations can leverage emerging technologies to meet environmental goals while maintaining operational efficiency. It’s a testament to the potential of electric vehicles in transforming the logistics and transportation industries, paving the way for a more sustainable future​​​​​​​​​​.","This appears to be a post about Elon Musk or one of his companies. Please keep discussion focused on the actual topic / technology and not praising / condemning Elon. Off topic flamewars will be removed and participants may be banned.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":104},{"text":["The moon could be perfect for cutting-edge telescopes — but not if we don't protect it","The following submission statement was provided by /u/Gari_305:From the articleSpace scientists are eager to protect the option of doing astronomy from the moon.There are plans in the works to place astronomical hardware on the lunar landscape such as super-cooled infrared telescopes, a swath of gravitational wave detectors, large Arecibo-like radio telescopes, even peek-a-boo instruments tuned up to seek out evidence for \"out there\" aliens.Yes, the future of lunar astronomy beckons. But some scientists say there's an urgent need to protect any moon-based astronomical equipment from interference caused by other planned activities on the moon, ensuring they can carry out their mission of probing the surrounding universe.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1acq7bn/the_moon_could_be_perfect_for_cuttingedge/kjvvwoa/","Dang, I thought they meant protect like \"For All Mankind.\"","From the articleSpace scientists are eager to protect the option of doing astronomy from the moon.There are plans in the works to place astronomical hardware on the lunar landscape such as super-cooled infrared telescopes, a swath of gravitational wave detectors, large Arecibo-like radio telescopes, even peek-a-boo instruments tuned up to seek out evidence for \"out there\" aliens.Yes, the future of lunar astronomy beckons. But some scientists say there's an urgent need to protect any moon-based astronomical equipment from interference caused by other planned activities on the moon, ensuring they can carry out their mission of probing the surrounding universe.","I've read that solar radiation is like 2 or 3 times stronger on moon than space, like ISS.Isn't that a concern for electronic devices?","They want all this infrastructure but not the activities that would make it possible in the first place.","Didn't we just sent a huge telescope outside costing tens of billions as a vanity project? You guys want another telescope? Have people already forgotten about Webb?","Well, for light pollution, I think that means we should put North Korea in charge. They actually know how to handle light pollution. Look at NK from space. Perhaps the only competence in that area on earth.","something something seveneves something..."],"points":26},{"text":["California restaurant incorporates kitchen robots and AI","The following submission statement was provided by /u/Gari_305:From the articleIt's long since been the vision of Hollywood that robots and humans would be side-by-side. In some Hollywood films, this partnership is a recipe for catastrophe, but in this suburb not far from Tinseltown, AI and robots are working in a restaurant kitchen.The restaurant, called CaliExpress, can be found in the heart of Pasadena, California. It's the first time that so much technology has been in one place, according to business owner Vic Aulakh.The burger joint uses a grill robot by Cucina and \"Flippy,\" a robot from Miso Robotics that can handle frying. Both robots can make quite a lot of food: Flippy can make 250 pounds of French fries an hour, and the grill robot can cook about 100 patties in that time. Neither machine needs a break or a day off.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1acq43k/california_restaurant_incorporates_kitchen_robots/kjvv8ab/","From the articleIt's long since been the vision of Hollywood that robots and humans would be side-by-side. In some Hollywood films, this partnership is a recipe for catastrophe, but in this suburb not far from Tinseltown, AI and robots are working in a restaurant kitchen.The restaurant, called CaliExpress, can be found in the heart of Pasadena, California. It's the first time that so much technology has been in one place, according to business owner Vic Aulakh.The burger joint uses a grill robot by Cucina and \"Flippy,\" a robot from Miso Robotics that can handle frying. Both robots can make quite a lot of food: Flippy can make 250 pounds of French fries an hour, and the grill robot can cook about 100 patties in that time. Neither machine needs a break or a day off.","You don't even really need a barrier. Some robots like this only have 5-10kg of force and will freeze if bumped. You'd mostly have a barrier to keep idiot kids from bumping into it.The teenager will see the fly land on your burger, shrug and flip anyways. The robot simply won't notice it and innocently flip it.The teenager can notice it 'smells funny'. And then either do something about it or not. The robot has no idea. Any sensors will clog. Optical systems can't be too sensitive because grease and smoke will get the lenses dirty, so bug detection is out.Overall, it's a wash. But the robot company will make $ by selling them a new disposable fire resistant food grade robot sock every day."],"points":8},{"text":["NASA Welcomes Belgium as Newest Artemis Accords Signatory - The accords establish a practical set of principles to guide space exploration cooperation among nations, including those participating in NASA’s Artemis campaign.","The following submission statement was provided by /u/Gari_305:From the article“Congratulations to Belgium on becoming the newest member of the Artemis Accords family,” said NASA Administrator Bill Nelson. “It’s clear that countries around the world understand the opportunity that space presents. As the 34th signatory of the Artemis Accords, Belgium is showing great leadership in committing to responsible exploration in the 21st century.”Hadja Lahbib, minister of foreign affairs, European affairs and foreign trade, and the federal cultural institutions, and Thomas Dermine, state secretary for economic recovery and strategic investments, in charge of science policy, signed on behalf of Belgium.“Joining the Artemis Accords reflects our logic of cooperation and enables Belgium to join the working group of states that have already signed,” said Dermine.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1acptza/nasa_welcomes_belgium_as_newest_artemis_accords/kjvt7s7/","From the article“Congratulations to Belgium on becoming the newest member of the Artemis Accords family,” said NASA Administrator Bill Nelson. “It’s clear that countries around the world understand the opportunity that space presents. As the 34th signatory of the Artemis Accords, Belgium is showing great leadership in committing to responsible exploration in the 21st century.”Hadja Lahbib, minister of foreign affairs, European affairs and foreign trade, and the federal cultural institutions, and Thomas Dermine, state secretary for economic recovery and strategic investments, in charge of science policy, signed on behalf of Belgium.“Joining the Artemis Accords reflects our logic of cooperation and enables Belgium to join the working group of states that have already signed,” said Dermine.","Phew, now the waffles on the Moon won't just be Eggo. 😝On a serious note, welcome Belgium! The more people around the world committed to fair and equitable relations on the Moon the better."],"points":0},{"text":["Future of housing crisis and renting.","What's the biggest reason that this happens amd politicians can't find the solution to this big issue?It's not that they can't find solutions, they just don't want to. The solution is trivial, stop treating housing like a speculative market. The fact that politicians don't respond isn't that they don't understand the issue, they understand it quite clear. The apathy is by design.","In Canada, at least, it's partly due to boomer NIMBYs across local councils refusing to change zoning to increase urban density. Our parents could afford to own a house and two cars and raise three children on one income; that isn't possible for us and they're sitting at the top of the hill throwing down convenient rationalizations like \"just stop eating avocados\" while simultaneously making it an almost impossible uphill slog to get up there. Humans naturally protect the benefits and assets they've accrued.","The only country that partially solved this issue is Singapore: 80% of the population there lives in cheap public housing.As a tiny country with limited space, this proves that current housing crisis is not a technical issue, but purely a political one as others have mentioned.","I think in the near term, life is going to get more painful, but in the long term we are going to see a real estate collapse. Right now, there are huge incentives for ever increasing home prices.Home owners want increasing home prices, landlords want increasing home prices, local governments want increasing home prices, real estate agents (the NAR is among the highest in spending for lobbying) want high home prices. So as long as you are fixed into your home or you stand to make more money from high real estate costs YOU have a very, very big incentive for housing to get far more expensive. These are by and large all people who run local governments.If housing costs doubled, that would be good for a lot of people. And those people are in charge of policy. Its extremely common for city council members to be landlords and when they oppose some building project, they have their own financial incentives for doing so. By limiting construction, the supply remains low, the demand remains high, and the rent they collect from their investment properties remains very high! You have many people, people who generally have money, who all have a common incentive to make housing as expensive as possible. These people have no issue using the government to achieve these goals. Government helping them is NOT socialism. Its just good business because it makes the more money!We need enormous amounts of housing in high demand areas where the jobs are. Not 2 hours away from the jobs and expect people to drive 40,000 miles per year to commute. I am from a Southern California city called Riverside, its a commuter city for Los Angeles and Orange County. LA/OC have the well paying jobs and every day about 30,000 people from my city make an hour+ drive to go drive to work. Living in LA/OC and a home will cost you a million (and this is not a fancy home). A comparable home in Riverside will cost you $600,000. If you can't afford the million dollar home, you do the whole commute thing. You can go much further east and find something for $450,000 but now you are looking at at least 3 hours of driving each day.​Here is my optimism. Location is the most important thing. Locations with high paying jobs like Silicon Valley (where I am now) are extremely expensive. However, we are witnessing the early stages of a remote work revolution. COVID accelerated it by several years, but it was going to happen anyway just due to technical improvements. We have yet to see the first wave of major startups that are built around a remote work force vs requiring their employees to all move and live in the most expensive area in the country. This eliminates geography as a major advantage that certain markets have. People will be able to get a high paying job while living anywhere they want.I really think that rural markets and small towns with cute downtown centers are going to use this as leverage. Make a place that is really great to live and attract remote workers. Someone making $100,000 per year, not very good in San Francisco, someone making $100,000 per year in small town Indiana, very good! Especially if that person is already from Indiana and didn't really want to move.Another one that will affect housing supply in high demand areas is the transition to Self Driving Taxis over private cars. The big thing, all that land downtown used for parking can be repurposed into high density mixed use. Tony Seba from ReThinkX estimated that if you took all the parking lots in the City of Los Angeles, the area freed up would be 3 times the size of San Francisco. The land that parking lots currently use could house 2+ million people at San Francisco density (San Francisco has parks by the way...) . As I mentioned, I live in a commuter city, our real estate prices are not justified by local wages, but by commuters. Plop down housing for 800,000 households, and make it cheaper than Riverside pricing, and now those commuters will move close to work.I am going to kind of bring this back home...Downtown Riverside is more than 30% parking infrastructure. If people are using RoboTaxis to get around, this land used for parking becomes obsolete, and the owners of that land would make far more money if they developed it into high density mixed use development. Downtown Land owners will want to turn their Downtown 2 acre block into something that would make the largest possible income for them, that is going to be high density, mixed use. Throw up a few dozen shops/offices, and then 450 housing units and they are going to make an absolute fortune. Letting valuable land sit vacant isn't a great way to make money.We are not even the worst in the area. About half of Downtown San Bernardino is used for parking. Some developers are going to figure out that building massive amounts of urban development in this area is going to make them a lot of money, especially if by the nature of the design they can make it much safer than the surrounding area.​Small towns all over America are surprisingly quite large. They are just spread out and poorly developed. They will have huge gaps between destinations. They will have enormous amounts of land used for parking. There are 16,000 small towns in America. Turn their central downtown area with 2,000 housing units (going high density this can fit on 20 acres) and that would be 32,000,000 housing units popping up all over the country. A lot of these can attract remote workers who want to live in a nice community full of urban amenities but at some small percent of the cost.Des Moines Iowa has 1.6 million parking spaces, for 220,000 people. 7 parking spaces per person. 28 parking spaces for a family of four. RoboTaxis show up to Des Moines and now the demand for that excess parking is going to drop off sharply. Turning the area into a cool urban area can bring hundreds of thousands of people.Right now, and for the last several decades. Residents compete for who gets to live in communities. Governments don't have to attract residents. That could very quickly change and the incentive structure could become one where local governments have to compete for residents, because those residents bring in tax revenue. If you remember several years ago, Amazon announced they were going to build an HQ2 and asked local governments for bids. The local governments all wanted those high paying jobs in their city (even if its not local labor, its a lot of tax revenue and economic activity). Go back and look at what governments were willing to do. They were going to give away the farm for some juicy tech workers. However, these governments are now asleep at the wheel when it comes to remote workers. They can now attract the workers without attracting amazon.This housing crises that we are dealing with, it will be disrupted. From remote work jobs allowing people to be divorced from geography for employment to a major redevelopment of every downtown core in the country.","\"Crisis\" implies that something has happened and is suddenly changing the situation.Housing is working out exactly how the system is designed to work right now.This is a systemic problem. Not a \"crisis\".","​​Cut/paste of an attempt to wrestle single family homes from big business.The End Hedge Fund Control of American Homes Act would mandate that hedge funds, defined as corporations, partnerships or REITs that manage pooled funds for investors, to sell off all single-family homes over a ten-year-period, and eventually prevent them from holding those properties completely.Washington Rep. Adam Smith, one of the sponsors of the legislation, argued that these institutional investors can edge out potential homebuyers by making large cash offers.“All of those investors are driving up the cost of housing,” he told Spectrum News. “Because they can pay. They can come in and drop $2 million in cash for a house in bulk.”","Read \"progress and poverty\" by Henry George. He pretty much lays it out","The \"crisis\" is completely artificial with the intent to reduce the standard of living (live in a pod, eat the bug).","Isn’t it large companies betting on people needing houses so bidding up the prices.","It’s funny because we went through a similar cycle in the 60s/70s and the solution was to build massive government housing complexes. In the 80s/90s we tore them down because no one wanted to live in projects.Now politicians are talking about building them again","In Greece from the state of Laconia where I’m from, I was looking with my wife both the options to rent or get a loan from the bank to either built a prefab house from scratch or even renovate an old abandoned house that still passed inspection.NONE of the options in the end was ideal at all. Reasons: • Prefabs are banned in my region. Only brick homes are allowed and should you be caught owning a prefab, it needs to be demolished. • old brick homes (like really old from mid 1800s) cost a fortune to be renovated. • renting a small apartment costs 500€ a month for 2 bedrooms and even though my job could allow it the taxes and bills just don’t make it possible. • buying a new house sets you back half a million for 3 bedrooms or a quarter if you only need 2 bedrooms (and we’re talking about apartments. Single homes are just out of the question) • only one house was available for less than 100k but it’s a repossession from the bank and nobody goes after it for obvious reasons (a family still lives there).In the end, I’m staying at my own apartment that my parents bought and built prior 2020 for me but living with your parents next door with your wife isn’t the best when they’re overprotective and cause more harm than good.","According to research, there are 24 reasons for the housing crisis in the Netherlands. From the urbanization that continues and started after the industrial revolution via the Second World War and the baby boom to the individualization and increasing number of single-person households today. And twenty other factors. No one is going to solve that in a decade.","How to solve the problem tomorrow? 1000% property tax increases for non-homesteaded properties.The above is hyperbolic but you can dissuade market behavior as a government entity via taxation.The above would see homes going back on the market to be sold for well... housing reasons instead of investment.","Anybody remember what the three most important features are that determine the price of a given piece of real estate?Location.Location.Location.Construction workers aren't getting more expensive. Materials probably are a bit, but not enough to drive this price increase. Simply put, the issue isn't that building is expensive. It's that securing the site in the first place is expensive, and gets more expensive the more people and stuff you have chasing the same amount of space.Nobody \"makes\" sites. They make the buildings on the sites, but not the sites. And yet, we have a whole class of owner who makes money off sites, before the value of anything added to the site is even considered.This money is an \"existence tax\", privately owned, privately collected. There is no way to make this go away. But it could be collected and distributed to the population on a per capita basis. If this were done, it wouldn't matter how expensive housing became. The more expensive the housing (assuming it's a site value expense), the more money a land value tax would take in, the larger the distribution would become.Maybe exempt existing homeowners for a certain number of years (primary residence, only), so we're not harming people who have put their savings into their equity (particularly retired people who are dependent on the home they own). But for new homeowners, it wouldn't increase the expense of owning a home. Rather, the tax would be capitalized into the price, bringing down the up-front cost (both principle and interest), while keeping the total cost of ownership roughly the same.Owners of multiple properties and mortgage lenders would hate this.","The solution is tax land and not labour. It is perfect policy. They just won’t do it.","Investment gets pitched to us as the solution to the problem but in reality it only drives up demand. Until investment gets banned prices will keep going up until nobody can afford to even rent.Capitalism is a beautiful lie, it comforts people to think they can live beyond their means. \"Other people's money\" in reality is the banks money and sooner or later they will cash out.","Housing is a unproductive asset yet it is being used as an investment. We are feeling the effects of years and years of capital allocation towards unproductive housing investments instead of productive enterprise.If someone wants to get loan (aka newly created money fresh from the money printer), the easiest way to do this is get a home loan. We have a system where people try to get the biggest loans they can to buy up finite resources so they can rent them out to other people. It is a zero sum game, where for someone to win, someone else has to lose.There are also numerous fiscal policy choices that governments make at the behest of their donors to encourage housing as investment and keep the bubble going.If you really want to fix this problem at its root, once and for all, switching to hard currency would do the trick. Alternatively fiscal policy changes that make housing less attractive as an investment will also work, for example, increase property taxes and reduce income taxes.I suggest reading about georgism. It is a system where tax is collected through land value tax. I think this is the direction we need to go.","It's because the people in power get greedy and want more power.It's really easy to make housing affordable by putting in the right policies like a 20% sales tax on residential investment property or tax cuts for home builders, etc... Think of all the incentives being given for electric cars. You just do the same for housing.Housing affordability is at an all-time low and there is ZERO effort being done to improve this.","It's done on purpose by the rich to exploit the poor. Wouldn't happen in a real democracy. In a real democracy everyone would be equipped to challenge such a situation.","The biggest reason this happens is that the people in power have more of an interest in protecting the investment income of their voters and donors (and in many cases, their colleagues and themselves) than they do in forcing the sacrifices that’d be needed to solve the problem. However, as the proportion of homeowners dwindles across the country, and the negative effects of a massive precariat become more obvious, some kind of solution will be reached.","Two solutionshousing not being an investment for rich people less immigration","Rent prices is like 60 or even 70 percent of someone salary nowadays.Let's not be hyperbolic here.The average U.S. rent as a percentage of median income peaked at just a touch over 30% and is down since then.What's the biggest reason that this happens amd politicians can't find the solution to this big issue?The current lack of housing is directly the result of the absolute crash in new construction for 5-7 years after the great recession. The primary reason it isn't being dealt with quickly as prices shoot up is restrictive zoning.Most progressives will give you an emotionally charged answer that's some muddled combination of \"hedge funds\" and \"gentrification greed\", but if you look at the data the inability to build homes at a high enough rate where demand is highest (because of restrictive \"community focused\" zoning) is the primary issue.Ironically, the most restrictively zoned areas in the country are deep blue cities such as NYC, San Francisco, etc.","Short term rentals like Airbnb and Brbo have gobbled up thirty percent of the supply of single family units and Hedge funds have gobbled up another 15 percent and rising... unless this is outlawed and short term rentals are taxed appropriately there will be a worse and worse housing crisis everywhere it goea unregulated.","Supply and demand.That’s it. Everything else is layers of complexity and nonsense on top of that.I’m in Australia, the conversation here is ridiculous and most people argue from poor logic and emotion.We need more supply in the places where housing is needed. Or we need less demand where houses cannot be supplied to meet the demand.Actually producing the supply or modifying the demand has an immense out of layers of complexity. So does the history of how it got here and was ignored by policymakers for so long.I don’t engage people that try to blame it on housing as an investment asset. They just don’t logic.Supply and demand. That’s it. Solve for that in your nation, state, region or city. Your particular solution at a lower level may not apply to or may only partially apply at a higher level. Be prepared to be humbled by the differences in different nations, cities, regions and states.Supply and demand.","Two reasons:​Banks/wallstreet are buying up all the real estate, and trying to monopolize the market.Open Borders.​Simple Strategy: Buy up all the homes in a country for cheap, lobby for open border policies, create housing shortages to the point of crisis, profit","There are more and more people in the world. The amount of land available in the world does not grow. If anything it shrinks with all the natural phenomenon/catastrophes. Simple supply&demand says housing prices go up.","As I understand. Construction too expensive.​Zoning and urban land areas too limited to offer more housing for good price.​It´s a political issue, because new housing areas are postponed, because builing public infrastructure for them cost money, and the governments are in debt !​Best way is to repopulate towns that have public infrastructure , BUT no people. Like with incentives and infrastructure upgrades that would serve families and social structure of the place.","Politicians only make it worse through difficult regulations, not profiteering.People should NOT ask the government to provide subsidies - it will only help a few people and raise prices for everyone else.It all comes down to whether people can make a living by building new housing. If they can’t, then they won’t. They will profit from it, and they deserve to do so.There are countries that have the exact opposite problem - diminishing populations are making entire towns vacant.It all comes down to living in areas where you can afford to do it. There is no birthright to living where you want. Humans have been nomads for most of their history. Should be even easier nowadays with remote working opportunities.","It's not generally politicians jobs to like run the banking and housing markets. It's a short term housing crisis caused by the pandemic, a rather rapid rise in wages, ppl getting used to normal interest rates vs historically low interest rates after the 2008 housing crisis, and climate change driving up housing costs in some regions. So I would not consider it a long term future problem too much. Climate change will get quite a bit worse, but automation will also continuously drive down the cost of production , commodities an and cost of living in general. Population is rising significantly slower and production is going up up and away so I think it's not a long-term problem.","Raising wages isn't the answer... They will just raise the price of everything around it.Greed. This is by design. Capitalism is not your friend.The short answer: basic things like shelter, utilities and medical should be a percentage based on your NET income.No one should be comfortable that working a full time honest job isn't enough to afford a basic apartment.....","Your narrative is based on skewed numbers.one of the skews is corporate ownership. its up. but the number of rentals down. why?According to our tabulations of the Rental Housing Finance Survey, the share of rental properties owned by non-individual investors increased from 18 percent in 2001 to 27 percent in 2021 (Figure 3). Non-individual investors include limited partnerships, limited liability corporations, trustees for estate, real estate corporations, and Real Estate Investment Trusts, among other corporate entities. **The growth in non-individual ownership has been greatest for small- and midsized- multifamily properties but was also evident for single-family rentals.**Indeed, 25 percent of single-family rentals were owned by non-individual investors in 2021, up from 17 percent two decades earlier. This explains how investor activity in the single-family housing market has increased even as the **number of single-family rentals has declined in more recent years.**So why is there more owned, but less rented? Because of inheritance laws.and people like me.I don't own my home, the Family Trust does. It also owns all of our investments, and is the beneficiary of my 401K and Life Insurance.That way my death, or our deaths, don't leave our son saddled with a huge tax bill when we die. It won't be like when my wife's grandparents died within 48hrs of each other and the taxes on the house on the house meant it had to be sold or there would be no cash money for her under aged mother and brother to live on.So it is not as bleak as it looks, and now with some fiscal constraint on easy money it will correct itself as homes go back on the market to provide liquidity to corps like Blackrock,","#wealth #tax , #tax #churchesUniversal basic income, #ubiUniversal child care.Medicare for all, #m4a , universal health care.End for profit health insurance companies. Take out the middleman.End for profit pharmaceutical companies, or limit their profits and executive pay significantly.Free education with no student loan debt, including for graduate school and for trade school.Break up big banks. No bank should be too big to fail.Banks should not be allowed to invest in stocks, on Wall Street or in hedge funds.Regulate wall street and regulate investment banks.Support Democracy, but no endless wars.Regulate the military industrial complex better.Higher taxes on rich people and on rich corporations. Progressive income tax.More high quality infrastructure paid for by the government with higher taxes on rich people and on rich corporations.End off shore tax havens.End tax loopholes for rich people and for rich corporations.Prohibit corporations from buying their own stock or stock of any other company.Regulate corporations. No monopoly power. No consolidation of corporations.Break up large corporations and require more competition among corporations.No sending USA jobs overseas.The progressive agenda.","https://www.bloomberg.com/news/articles/2024-01-25/us-median-rents-fall-for-eighth-month-on-boom-in-new-apartments?sref=R8NfLgwS&leadSource=reddit_wallNot in the land of the free. Largely due to more multi home construction. Turns out regulations increases cost. If somehow don't thinking absurd housing regulations is the primary reason behind high housing costs you're basically no different from a flat earther or climate change denier.","Well, my original comment was auto moderated, because it was too short, apparently. Personally, I thought I was being succinct. Anyways, hopefully this generous serving of waffle at the beginning of my comment will help with the auto moderation process. What I was originally saying was that in my opinion, the only way out of this housing crisis is going to be the 3D printing of dwellings. it’s possible to print the base structure of a dwelling in under 24 hours for around $10,000. For a country like Australia that has a lot of land, this could be a real game changer, disrupting the current real estate model. And really, the housing crisis is because of greed and turning something that should be a human right into a commodity. So all those folks that own multiple properties, might just choke on those aspirations…","i read somewhere rent in the future will become a subsription like subscribing to Amazon or Disney","I can tell you that mass migration is absolutely making the problem a whole lot worse.","Due to the increase in expenditure of house construction materials and greedy land loads increasing the rent from innocent employees who stay away from the home town.","Many states give renters/squatters more rights than the property owners, one bad renter can cost the owner $20k+ … you are paying extra to cover that","[removed]","There’s one developed country where real estate is reasonable and housing in certain areas is almost free for the taking: Japan. There’s a reason. The population of Japan is in decline. So far it seems like their economy is still ok. Perhaps it’s due to technology? The country is an island so it’s harder for immigration. They are culturally homogeneous. They have not encouraged a lot of immigration. I guess I wonder whether having an older population and fewer young people will be a problem before long? At some point they would be too weak to defend themselves. I guess they depend on the US. It seems like the powers that be in the US want a growing population and they don’t care about a housing shortage. Same with Canada.","Housing is very resource intensive especially suburban sprawl single family homes. Its a big part of why we have a looming climate disaster because of how much cheap oil it took to build cities, the sprawling suburbs around them and the infrastructure for it all. At the very least single family homes should be very expensive compared to high density options.But regardless most countries are increasing their rate of general consumption. Despite the housing situation we still (average people in wealthy western countries) are increasingly buying more stuff year after year. The US storage unit market is booming more than it ever has for instance.If anything we're seeing a correction for over consumption.","At the rate they are building apartments in my area, it won’t be a problem in 2 years. Way overbuilt! Rents will come down. In HCOL areas, you need to look for jobs in lower COL places. Tulsa, Amarillo, Monroe, LA, Shreveport, mid-sized and small towns all over America need workers and have decent housing costs.","This will require a radical change in economicsBecoming human centred rather than infinite growth centeredThis religion of the free market is failing...In the meantime, form your mutual aid networksGet to know your neighboursForm skill and tool and food banks","Here are my top reasons that led to all of this: 1. Some people have too much money and they need to park that money somewhere so they buy property. 2. Globalisation - Chinese, Indian, African, Russian people with money and international passports like to buy property in key global cities. There’s an entire global industry servicing this demand. 3. Increased population concentration in cities that offer better prospects. People want to be where the good jobs are. 4. Old people - older population means wealth is concentrated in people who need passive income in retirement - especially in countries like the UK where state pensions are a joke. People then buy multiple houses to finance their retirement. 5. Lack of supply - we’re not building as much as we used to due to too many regulations. In the 50s and 60. Councils could pretty much do what they wanted but now it’s becoming hard to build due to NIMBY culture.Solution: tax 2nd homes at 90% & build more.","Pretty much every developed country handled the pandemic the same way. They shut down their economy and printed an insane amount of money. The skyrocketing costs of everything since was a result of that. The solution would be to greatly limit how quickly central banks can create new money.","I dont think people realise there is a more finite asset, with more security, less maintenance cost and better long term ROI that can protect against currency devaluation and is easier to buy and more accessible than property… and something that governments cant control…https://youtu.be/mC43pZkpTec?si=0PhhuNemb1eCN_a3","One part of solving the issues in the world is tax the filthy rich! There is no need for the upper 1% of the world population to have more fortune than the lower half of the population! It's immoral, unethical, harmful. They do not spend that money anyway otherwise. They can keep their high standards of living even with half of their fortune, with a quarter, a tenth.In my opinion there should be a top limit of fortune that a single person should possess. Every additional penny must go to the taxman.Close down tax havens! Also establish a worldwide financial transaction tax.In other words: distribute wealth more fairly! Make them pay their fair share! That would solve a lot of problems. Maybe even the worldwide housing crisis.","Housing crisis is a complex and multilayer. Energy scarcity needs to be fixed first.","When there’s no replacement population to fill those buildings and houses that’s when it will drop other than that politicians greed will NEVER stop","Because existing residents do not want more homes built in the area.Housing shortages are a simple, documented, studied, problem with a known solution.Rent control and other penalties against landlords are anti+displacement measures but do not solve a housing shortage.","One reason: If you can turn a regular house into a luxury house you'll increase your profit so that's the focus for investors. There's not enough incentive to invest in affordable housing.Another reason, the fall in public housing stock as a percentage of all housing. Housing brackets used to be more diverse within suburbs but it's becoming more one bracket only eg everyone in the same socio economic class less pockets of diversity. With less diversity there's less innovation","It’s probably going to become worse. Landlords will find ways to fix prices using more sophisticated technological methods than exist right now.","Housing market needs a far better regulated. Like not selling to foreigners that will only use it for investment purposes. Housing should be required to be lived in by the owner, and there needs to be a cap on how many houses a person/family can own, rent for large apartment complexes should be capped so that anyone working on minimum wage can afford it comfortably.  So in a nut shell, the solution would be to treat housing as a basic necessity for all, instead of a capitalistic tool for making money. Because by leveraging people’s basic necessity to function it created a lot of homeless people and a horrible world, that made some richer, but more, they ironically complain about how shitty the world has become with so much homeless and crime. Well, they might not be fully aware, but they contributed to the demise.","We should consider the way of living. More community spaces for people renting etc. That would keep the cost down","Your mistake is thinking its a crisis, its a crisis for YOU. For the government and asset holders its fantastic.They're collecting higher property taxes. They're able to use buildings as collateral to get loans to buy more assets and let inflation eat away the loan. Rents are never going down, and if they do it wont be for long.Theres more wealth being created now than at any other point in history, and if you're not getting a slice, someone else is.","this is a serious serious problem in the US and i’m glad it’s finally being talked about - i’m surprised it took too long.but let’s first point out that there a plenty places on the planet with more affordable housing then the US.counties by cost of living: https://www.numbeo.com/property-investment/rankings_by_country.jspprice to income ratio https://www.numbeo.com/property-investment/rankings_by_country.jspnot sure where you are located but the situation in the US is bad and about to get horrible. the government doesn’t care they will profit off it.from a futurology - amazing things could be done and should already be happening now - but almost no progress had been made in the last 80 years. the 1960s was the last time they focused on housing for everyone.the entire US could have cities like tokyo with space for everyone - but our government and business leaders refuse. cities like tokyo would be the solution - well design with small and dense affordable apartments. if every city put in a handfuls of micro apartments complexes a huge portion of the housing crisis could be solved.here is a good article:big cities where housing is still affordablehttps://www.nytimes.com/2023/09/11/opinion/editorials/tokyo-housing.htmlif we didn’t have to spent so much money on housing - it could be spent on the economy. more people’s would have businesses and able to do more things - gosh it would be such a better world. we really need to fight for affordable housing from our leaders and we need to fight for it hard and now because they’re gutting us and hurting so much progress","Inflation and politics that try to correct the market.","financialization of the housing market, internet (now you can buy a house from 5000 miles away), lack of pension fund, this strange belief boomers got that a 6%+ growth of your investment is expected and eternal.Things will be different when world pop replacement rate dips below 2.1 worldwide and people finally realize that the 6% growth is not eternal. Im expecting this around 2060, just when millenials will retire and need the money.","You can’t immigrate millions of people and not expect a housing shortage.","Laundering money into real estate, office space that is not really needed but because of the money invested the return needs to be forced onto people, companies allowed to buy residential for profit. Its a lot of money so thats a lot of bribes.","Government is the problem and more government is not the solution. There is a massive supply shortage problem caused by regulations slowing building and making it cost more. The only way to solve this is to increase the supply. This issue also isn't a problem outside of large cities. Housing is very reasonable in many parts of the country.","Imagine keeping interest rates close to Zero for the rich to use. Of course they ploughed it into property. Loans and rates normal people couldn't access.Property value increase is the biggest inflation factor but they just say there and kept interest rates low making house prices soar.High property prices effect everything high rents on commercial property high food prices and goods.So ridiculous","\"Do you see the problems in your country, AND know how to fix them?..\" everyone should watch The Rules for Rulers. it helps a little bit to understand what's going on. : (","Investors and businesses are buying up the market, skyrocketing prices and cutting supply.  If they weren't owned by the people who own politicians, it would be simple enough to tax and regulate the market back being favorable for single home owners and renters.  At the very least, subsidies for regular people could be instituted, but it would probably make the problem worse in the long run.","Rent is not 60-70% of the median salary. Not sure where you're getting that statistic.Many nations actually don't have this problem, it is mostly confined to English common law nations and we can look outside of them to learn what the solutions are. The answer is allow more housing and more types of housing to be built.Unfortunately in the US, homeownership is at an all time high and plans are typically taken out against the property at an 80% of value rate.Real-estate values need to fall by about half.If a home costs $500,000 and and the typical person takes a $400,000 loan against it, what happens to that person when prices fall $250,000?When homeowners are the majority of the voting populace, do you think they will vote for this to happen?But the situation is somewhat worse, a minority of the community in many cities in the US can hold up construction projects and even rebuilds of existing homes to add units on a basis so flimsy as \"it adds shade\".People don't get to vote on the production of every single car. The law is that if you follow certain safety measures anyone can build a car, and sell it to anyone with money. If we handled cars the same way we handle housing (\"I don't want my neighbor to buy a van, it might lower the value of my two seater!!??\" Or worse \"I don't want the sort of people van ownership attracts in my community\") we would soon have a transportation crisis.","The main problem is a lot of nations are allowing their housing market to be used as a safe place for foreign nationals to invest.The reason why nothing is going to be done about it is because our government most of them make a lot of profit from these sales .","I think a lot of rental market may be subject to greed...landlords don't maintain property and keep collecting... to maintain profitable business.But to run a biz it's good to have excess money so it competes against valueBut looking back I was college grad that did not feel I could afford to move out of parents... I was not making much money and kept being laid off for years... taken 25 years after grad to start a stable household of my own with my diverse investment in quality of life skills like art","Two prominent places in the West have solved this issue: Vienna in Austria, and all of Finland. Both of them did it with massive investments in public, non-market housing built with reasonable social mixing and urban development around it (IE no giant 'poor repository' projects). A necessary precursor to this is easing up zoning laws and opening up areas to development, which you do with public investment in transit. A land value tax also helps.",""],"points":828}]