[{"text":["Risk management","Does your company have policy/standards?","It depends on what industry your company is in plus what are the ways you're company makes money."],"points":1},{"text":["Why use arpspoof when you can just use monitor mode?"],"points":0},{"text":["1 year to go tips on jobs"],"points":0},{"text":["Ideas for Master’s degree research project?","I made a suggestion to someone else at https://www.reddit.com/r/cybersecurity/comments/192y15q/looking_for_opinions_and_input_regarding_a/khb5v5q/?context=8&depth=9.","Check out Ecole Polytechnique France they have a lot of research and a Master in Cybersecurity"],"points":1},{"text":["Can anyone help with c2c Zeus Trojan controlling? (School project)","Google 'ZeuS Admin Panel' if you haven't already, seems like you're missing half the picture. (The command and control (c2))Also, if you're googling there was so much trash posted about Zeus, amend your searches with site:GitHub.com to find some decent examples.and filter out the noise.Good luck with your project.","You should presumably have an admin panel running on the controller that the victims are talking to. Ignore the idiots who seem to think they are critiquing a professional redteam exercise","What kind of school are you going to?","Its like 10 year old. Why do you want to use this shit?","Just uninstall everything and install it correctly Here's the GitHub repo https://github.com/Visgean/Zeus?tab=readme-ov-file"],"points":40},{"text":["Military intelligence claims cyberattack on IT company providing services to Russian defense industry","Hello, everyone. Please keep all discussions focused on cybersecurity. We are implementing a zero tolerance policy on any political discussions or anything that even looks like baiting. This subreddit also does not support hacktivism of any kind. Any political discussions, any baiting, any conversations getting out of hand will be met by a swift ban. This is a trying time for many people all over the world, so please try to be civil. Remember, attack the argument, not the person.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Question on the size of SOC teams","As a mssp we got around 100 analysts working round the clock. Prolly 80 in the night, 120 during day.But it really depends on the setup. True 24/7? Or just on call for high severity? SLA and escalations n all that","This depends on several factors, but not limited to: (A) Response Time/SLA (B) 24/7 Service? (C) Quality of detection rules and automation","I would look at your tools, alerting load, processes and work backwards to scope the people requirements.For A and B you could likely get away with a minimal staff with one T3 on call for high complexity incidents.Some organizations chose to bring in expensive tools in an effort to replace manual analyst efforts, but we don’t know what your situation looks like.","You staff to cover your SLA/OLA (if it's 24/7 you staff one full role). Then you add a shift here and there based on need. You'll hit a point where you can see the team has more work than they can handle easily but not so much you'd add another head. Along the way you've been making improvements but this is your point where you tell the team that another head won't be coming and we need to tighten our processes.I target an 80-90% utilization with the left over time for admin and process improvement. That coupled with proper ticket metrics tends to get me the best results. Keep a close eye on your team, have regular 1:1s to understand if they're feeling like they're under pressure.Oh, and if a contractor is a possibility you always add one of them first to see how that changes the dynamic. If it's too much manpower people will start to slack from boredom. If it's too little you can add another. Ride the waves for a year to see if it's seasonal/spikey/etc. then, again, staff accordingly. By then you should have a good feel for what's going on.That's ideally.Normally, however, you get told what the staffing is or some arbitrary number is used (server count, seat count, whatever). It gets close but I find that approach usually leaves little time for admin/personal development and process improvement without adjusting SLAs.Either way, you take your shot and you adjust.","start with four at least and grow from there","6 for 24/7, where two covers the day shift except weekends where you 2ppl do 2 12h shifts"],"points":9},{"text":["Do you recommend any PTaaS?","Out of curiosity, what does PTaaS even mean? I would assume all pen tests are delivered as a service. Does PTaaS just imply an ongoing subscription?","Not sure of edgescans pricing but could look into them","How much are you prepared to pay? What is your budget? That will significantly impact the recommendations you will receive.","https://packetlabs.net","[removed]","No recommendations on PTaaS, but you'll typically find providers in that space charging anywhere from $4,500-20,000 USD depending on the size. BugCrowd is an example and lists their pricing publicly.As a word of caution, PTaaS (Pentesting as a Service) is a fancy name for a two-sided marketplace that connects you with gig-work hackers, because of this quality will vary widely.Considering your low budget, there may be some other more budget friendly options to look at. Connecting directly with a budding researcher is one way to go, another is looking at DAST and SAST tooling to help identify some of the low-hanging fruit a PTaaS provider will find. OpenVAS, Snyk, Semgrep, Dasterdly, and OWASP ZAP are all some good low cost or free option to explore first.Lastly I'll say that smaller boutique firms like the one I founded (/u/GlitchSecure) probably aren't a good fit since we typically work with slightly larger software companies who value quality over saving a buck. That said, I know a few security consultants who don't work for us I'd be happy to recommend that do good work and are more affordable than typical PTaaS.","We offer PTaaS using our platform, but not in a bug bounty style, so potentially outside your budget. Also there's a bunch of contracts that need signed, terms agreed and payments made before you can request a test.This gives access to qualified and skilled testers though, with robust methodologies for high levels of assurance.","maybe check out Cobalt"],"points":9},{"text":["Unleash your dark side in this Hexen and Heretic inspired game! Wishlist now on Steam!"],"points":0},{"text":["Is hacking getting boring","Your concerns about hacking and its reliance on tools are more or less valid.But it is important to recognize the distinction between different roles in cybersecurity.Being a hacker, red teamer, or pentester or even a blue teamer involves different skill sets and attitudes. Imho being a hacker is about having a passion for creatively solving or exploiting problems in unique ways, which often requires a deep understanding of systems and networks.I think it's fair to say that the availablity of scripts and tools has made certain aspects of hacking more accessible. Still i believe this doesn't diminish the value of technical skills like programming. These skills are crucial for understanding and customizing tools, as well as developing new methods when existing tools might fail. The art of hacking isn't just in using scripts or tools imo but it's in adapting these tools/scripts to fit specific scenarios. And this requires a solid foundation in IT and various technical skills (that's btw. also the reason why people always recommend to start in a service desk position because you learn a lot of problems and how to troubleshoot those).If you're considering a shift towards programming, that is of course a valuable skill and can help you as a hacker or in cybersecurtiy in general.Whether you choose to pursue programming or remain in the hacking sphere, the key is continuous learning and adapting. Your (technical) skills will always be an asset, no matter the path you choose.I think the moment you realise that hacking satisfies you might be a later point in the journey. Before that, you might have to struggle with the usual tools and scripts to build up a basic understanding.","The large majority of people who work in cybersecurity aren't hackers. It's just the only thing people new to the field seem to care about. It's a bit strange you want to leave the whole field because you think \"hacking\" could be boring. If your only interest in the field of cybersecurity is getting to \"hack\" then you probably should leave the field anyways.","https://pocorgtfo.hacke.rs/pocorgtfo00.pdfPerhaps you are just in a slump, neighbor.","Id look at it from this perspective - you currently see it as a negative but in physical labor jobs when new tools are developed it drastically impacts performance and ensures people last longer. Now obviously us sitting at a desk aren’t doing hard labor for 8-12 hours but each tool helps us do the job better/faster - and you having a development (programming) background gives you a unique opportunity to create new tools or automation to make people’s lives easier. As you stated now days its easy to find open source scripts to run malware - but why not also publish ways to prevent it, block it or create tools to detect/block it automatically? Yes IDS/IPS exists but lets be real it doesn’t get everything so you being skilled should mean you find the things it misses and help either develop new tools to do it or fix your own configurations to catch it. The catch here is also dont screw us all out of a job like some software engineers did by automating everything - there is a limit to this that shouldn’t be crossed.Every field gets boring at some point but just shooting some questions, thoughts, and ideas your way."],"points":8},{"text":["GRC Product Manager Moving to IT Risk Management"],"points":0},{"text":["CSRF assignment guidance"],"points":0},{"text":["I need help with an SPF record","Go to https://DMARCtester.com and send an email. Share your results at the end (share button), and we can tell you what needs to be done.","Get SPF and DKIM running, then worry about DMARC.SPF should be a small text change in your root DNS for your domain. Probably wherever your website is hosted, or perhaps your e-mail, or perhaps O365 is where this lives.DKIM should be a similar change involving asymmetric cryptographic keys in DNS, although this implementation gets trickier if you use any third party mail routing services.DMARC is a similar change in DNS, just ensure you have somewhere setup for the reports to be sent to. You can work on parsing them out or use a service to report on deliverability.That's it. I'm sure Google would provide a plethora of resources to help you get this done, no real need to invent the wheel. It's more of an administration question than it is security.","SPF should be a small text change in your root DNS for your domainI understand it as adding a txt record to the DNS registrar database where the domain name is registered. But I'm a bit confused.The domain name \"myserver.com\" is registered at hover.com. The name servers belong to Rackspace which was bought out by Liquid Web. On the old Rackspace server is a CNAME record pointing to mx2 emailsrvr.com. The email that will be used to send email is email@myserver.com.So if this doesn't belong in Reddit forum, would you be able to point me to the right one where I can get help with this?Thank you.","okay I've run DNS Authentication from zero to reject before, I'm a bit rusty and I'm not sure I have all the information I need to help you right now. I will however provide some steps to get you started with DNS authentication, hopefully I'm not totally barking up the wrong tree!!Set up a mailbox for reportingfirstly, set up a new email account called dmarc@[domain].com replace with your domain.Put DMARC Into Report OnlyThen enter the following into your DNS:_dmarc.[domain].com IN TXT v=DMARC1; p=none; rua=mailto:dmarc@[domain].com; ruf=mailto:dmarc@[domain].com; fo=1;This will place DMARC in report only and begin directing aggregate and forensic reports into your DMARC mailbox so that you can see what mail is being sent on behalf of your domain. Aggregate reports contain basic information on the authentication results, where forensic reports contain much more detailed information, including message content. Few servers send forensic reports.SPFThere's \"two\" mail addresses you need to be aware of, the header address (the address you see in the email client) and the enevlope address (the address that you don't typically see, and is used for mail routing)Your domain (hypothetically) is myserver.comSPF will be authenticating based on a set of sending servers which are authorised by you to send mail and partially on the mail envelope address.If you send mail from [bob@myserver.com](mailto:bob@myserver.com) (header address) the mail envelope address may be [bob@010134mailserver.gmail.com](mailto:bob@010134mailserver.gmail.com) and the sending server will belong to gmail.com.in this case, your SPF record could look like:v=spf1 include:_spf.google.com a ~allwhat this SPF record will do, is include a lookup for google's SPF authentic senders, and your domain's A record in DNS. Anything that is sent that does not come from a server matching one of those two lookup mechanisms will be soft-failed (denoted by the ~) do not place a plus (+) before the all, as this will allow any sending server to authenticate on your domain's behalf with SPF.To authenticate additional sending servers with SPF, you can analyse mail headers from legitimate mail and look at the envelope address' domain. Take the domain and use mxtoolbox to find the SPF lookup you need to include:https://mxtoolbox.com/SuperTool.aspxexample:DKIMDKIM can be a bit more painful, typically it will involve reaching out to any service providers and requesting a DKIM public key and requesting they enable DKIM signing.A DKIM key will then need to be placed into DNS and can be done in a few ways.A service provider may give you a TXT record with a single public key, such asgmail1._domainkey.mydomain.com IN TXT DKIM v=DKIM1; k=rsa; p=[key]Mimecast typically uses singular TXTs and if you have access to the admin console you can follow this guide to authenticate mail from mimecast with DKIM:https://community.mimecast.com/s/article/email-security-cloud-gateway-configuring-dns-authentication-policyOr alternatively, in the cases of Microsoft and Salesforce, you may be given two CNAME records such as:selector1._domainkey.mydomain.com IN CNAME selector1.01048.microsoft.comselector2._domainkey.mydomain.com IN CNAME selector2.01046.microsoft.comUse of CNAME records allows for the service provider to rotate the DKIM keys without needing you to change our DNS records.Once you're confident all mail is not failing DMARC, you can begin to look at enforcing DMARC using quarantine (which will either hold the message in the case of an enterprise SEG, or deliver to junk in a personal account) and then to reject (which will block the email)"],"points":6},{"text":["Learning Python for SIEM","NO it would notYou can learn Splunk for FREE - https://www.splunk.com/en_us/download.htmlhttps://www.splunk.com/en_us/training.htmlhttps://www.splunk.com/en_us/blog/learn/splunk-cheat-sheet-query-spl-regex-commands.htmlIf you know python or want to learn python that's fine, but its not going to help you with an SIEM solution unless you have already learned how to use that particular platformIf you already know python check out - https://olinux.net/wp-content/uploads/2019/01/python.pdfIf you need to learn python, then check out - https://online.umich.edu/series/python-for-everybody/ and https://www.py4e.com/","IMO you should learn Regex insted of Python.","Most SIEMs use a flavor of Structured Query Language","Possibly, but not for the SIEM itself. Some SIEMS have client agents that send data directly in and Python could be used to parse data before ingestion. But, for using a SIEM no they usually have their own language.","No.","I don’t mess with SIEMs but do use Python for data analysis of results from several tools we have. Frankly, data visualization in existing scanning tools is often terrible but if they give me good data in csv it Excel I can still work with it"],"points":39},{"text":["Darknet/blackhet OSINT monitoring","Yeah, but most breaches are documented on clear web sites."],"points":2},{"text":["Stay or go advice?"],"points":0}]