[{"text":["Taylor Swift AI images prompt US bill to tackle nonconsensual, sexual deepfakes","I hear so much about this Taylor Swift AI deepfake, it really got me interested. Where does one find this? For science of course.","Yeah, I stand by my comment on another Swift/AI post - the company and the government only care because she has her money and her label's money to take them to court and to get politicians to listen.Lots of less famous people were getting hit with deepfakes and neither the company nor the government gave a flying fuck."],"points":0},{"text":["OpenAI's ChatGPT breaches privacy rules, says Italian watchdog"],"points":0},{"text":["AI poisoning tool Nightshade, used by artists to disrupt AI models scraping and training on their artworks without consent, received 250,000 downloads in 5 days","measurecountermeasurecountercountermeasurecoontercountercountermeasure","But did it work?","The AI wars are here.","Shots fired. First Ai Deaths signal war!","Hah, the downloaders will be the first that will be targeted for termination when the AI becomes sentient.","Begun, the AI wars have","Love it.","Marketing genius. Literal name instills stealth confidence and revenge. Let the competitors introduce AIShield or BarbedWAIre or SayNoToAI.","Poe knows."],"points":8},{"text":["Meta used copyright to protect its AI model, but argues against the law for everyone else","I mean, the argument is that you're allowed to analyse other people's copyrighted works without requiring permission to do so, and that such an analysis can itself be protected by copyright. That doesn't sound particularly outlandish by itself. If you write a literary analysis on the use of slang in modern bestsellers, using a whole bunch of data drawn from copyrighted works without permission, you'd probably be in the clear on that front.That aside, I think the guy who argued that the model itself, as a pile of statistics without any particular human direction, does not have copyright protection was completely correct. In some countries there are separate protections for databases (i.e. compilations of non-protected, factual information), but not in the USA, which is the relevant jurisdiction for this question."],"points":2},{"text":["Ars Technica used in malware campaign with never-before-seen obfuscation | Vimeo also used by legitimate user who posted booby-trapped content.","Should I click on this?","Base64 encoding in a link seems like something that hackers would have figured out decades ago"],"points":12},{"text":["Researchers add a ‘twist’ to classical material design. They’ve discovered that crystals can twist when they are sandwiched between two substrates – a critical step toward exploring new material properties for electronics and other applications.","Hey, people smarter and better informed than me. How big is this as news? It sounds pretty big","Nothing new","Researchers add a ‘twist’ to classical material designThey’ve discovered that crystals can twist when they are sandwiched between two substrates – a critical step toward exploring new material properties for electronics and other applications.Researchers with the Department of Energy’s SLAC National Accelerator Laboratory, Stanford University and the DOE's Lawrence Berkeley National Laboratory (LBNL) grew a twisted multilayer crystal structure for the first time and measured the structure’s key properties. The twisted structure could help researchers develop next-generation materials for solar cells, quantum computers, lasers and other devices.“This structure is something that we have not seen before – it was a huge surprise to me,” said Yi Cui, a professor at Stanford and SLAC and paper co-author. “A new quantum electronic property could appear within this three-layer twisted structure in future experiments.”Adding layers, with a twistThe crystals the team designed extended the concept of epitaxy, a phenomenon that occurs when one type of crystal material grows on top of another material in an ordered way – kind of like growing a neat lawn on top of soil, but at the atomic level. Understanding epitaxial growth has been critical to the development of many industries for more than 50 years, particularly the semiconductor industry. Indeed, epitaxy is part of many of the electronic devices that we use today, from cell phones to computers to solar panels, allowing electricity to flow, and not flow, through them.To date, epitaxy research has focused on growing one layer of material onto another, and the two materials have the same crystal orientation at the interface. This approach has been successful for decades in many applications, such as transistors, light-emitting diodes, lasers and quantum devices. But to find new materials that perform even better for more demanding needs, like quantum computing, researchers are searching for other epitaxial designs – ones that might be more complex, yet better performing, hence the \"twisted epitaxy\" concept demonstrated in this study.￼The MoS2 layers and gold nanodiscs together heated up to 500 degrees Celsius. The three marked regions – I, II, and III – indicate the various layers of the sample. Region I shows gold on the bottom MoS2 layer; II shows Au below the top MoS2 layer; and III shows the gold between the top and bottom MoS2 layers. The gold nanodiscs are the darker regions in the region III.  (Yi Cui/Stanford University)In their experiment, detailed this month in Science, researchers added a layer of gold between two sheets of a traditional semiconducting material, molybdenum disulfide (MoS2). Because the top and bottom sheets were oriented differently, the gold atoms could not align with both simultaneously, which allowed the Au structure to twist, said Yi Cui, Professor Cui's graduate student in materials science and engineering at Stanford and co-author of the paper.“With only a bottom MoS2 layer, the gold is happy to align with it, so no twist happens,” said Cui, the graduate student. “But with two twisted MoS2 sheets, the gold isn’t sure to align with the top or bottom layer. We managed to help the gold solve its confusion and discovered a relationship between the orientation of Au and the twist angle of bilayer MoS2.”Zapping gold nanodiscsTo study the gold layer in detail, the researcher team from the Stanford Institute for Materials and Energy Sciences (SIMES) and LBNL heated a sample of the whole structure to 500 degrees Celsius. Then they sent a stream of electrons through the sample using a technique called transmission electron microscopy (TEM), which revealed the morphology, orientation and strain of the gold nanodiscs after annealing at the different temperatures. Measuring these properties of the gold nanodiscs was a necessary first step toward understanding how the new structure could be designed for real world applications in the future.￼The diffraction pattern of region III, where diffraction spots from bottom MoS2, top MoS2 and Au are marked in blue, green and orange, respectively. The Au spots are not on the yellow lines, which note the ideal alignment, indicating the Au layer is twisted.  (Yi Cui/Stanford University)“Without this study, we would not know if twisting an epitaxial layer of metal on top of a semiconductor was even possible,” said Cui, the graduate student. “Measuring the complete three-layer structure with electron microscopy confirmed that it was not only possible, but also that the new structure could be controlled in exciting ways.”Next, researchers want to further study the optical properties of the gold nanodiscs using TEM and learn if their design alters physical properties like band structure of Au. They also want to extend this concept to try to build three-layer structures with other semiconductor materials and other metals.“We’re beginning to explore whether only this combination of materials allows this or if it happens more broadly,” said Bob Sinclair, the Charles M. Pigott Professor in Stanford’s school of Materials Science and Engineering and paper co-author. “This discovery is opening a whole new series of experiments that we can try. We could be on our way to finding brand new material properties that we could exploit.”Funding for this study came from the DOE Office of Science’s Basic Energy Sciences.Citation: Cui et al., Science, 12 January 2024 (10.1126/science.adk5947)SLAC is a vibrant multiprogram laboratory that explores how the universe works at the biggest, smallest and fastest scales and invents powerful tools used by scientists around the globe. With research spanning particle physics, astrophysics and cosmology, materials, chemistry, bio- and energy sciences and scientific computing, we help solve real-world problems and advance the interests of the nation.SLAC is operated by Stanford University for the U.S. Department of Energy’s Office of Science. The Office of Science is the single largest supporter of basic research in the physical sciences in the United States and is working to address some of the most pressing challenges of our time."],"points":4},{"text":["Analysis | Apple’s new Vision Pro is a privacy mess waiting to happen","I’m sure it’s a good article but it’s paywalled, fam."],"points":3},{"text":["An AI-Generated Content Empire Is Spreading Fake Celebrity Images on Google","I’ve yet to hear anyone bring forward a viable solution to this problem. I don’t believe legislators or law enforcement have the understanding or bandwidth (both literally and figuratively) to address the issue, and I don’t see internet self-regulation being even remotely likely. Is this just the state of things now?","I’m thinking that sooner than later, the internet will not be the place you turn to for news or research.","First they came for the celebrities and I did not speak out because I was not a celebrity","We have had a notion of digitally signing content to verify it for years yet we never really apply it. There are all these proposals to detect fake images when really we need to source real images, articles, etc back to a source we trust. DNS spoofing is quite similar.","Pretty soon we won’t be able to believe everything we read on the internet. That’ll be a dark day.","Is that supposed to be Joe Burrow on the right?","“Don’t believe everything you see on TV…”","Maybe this will destroy the concept of celebrity.","Before IA, we used to photoshop penises on word award winning phictures and spread them through the internet for fun.","Downvote me to oblivion here, but I think this issue is severely overblown. There are legitimate concerns, especially involving young people, but by and large this just feels like another \"humans are scared of new technology\" issue.We'll get a handle on it (the boomers won't, but the rest of us will).","Why don’t we just destroy absolutely everything to do with computers and the internet and start again?We can do better this time.","imo celebrity is basically stupid... personally I have not found AI generated images of celebrities either... maybe AI is doing us all a favor by showing us how celebrity is a waste and not deserving of any sort of interest.","Kinda easy to tell what’s AI isn’t it? The pics always seem super 3D and glossy if that makes sense","AI images need to be registered and watermarked or the company gets fined.Any company/individual tampering with watermarks also gets fined","Ohh no maybe we finally will realize not idolize people and we would never make decisions off what they do","I started an AI art instagram like a month ago putting celebs in roles and films they weren’t in. I’m very clear about the generation and the fact that it’s AI. It’s crazy that my home machine with a fucking ancient 1060 can make pretty high quality images. I feel like I’m biased since I use the tech for my own enjoyment but this is turning out like every other type of tool. You can build with a hammer or kill with it. I had it make a couple hundred images of generic scifi cities for a TTRPG setting. I feel like the opposition to this tech hasn’t been presented with the other use cases like mine to maybe steering their thinking toward oversight instead of abolishment.","It's crazy that fake celebrity images are a thing now","It doesn’t look real.It’s looked animated.And I’m no expert. It’s obvious.","The guy on the right, looks like a combination of Joe Burrow and Bill Skarsgård","Perfect","So what?","https://m.youtube.com/watch?v=Mq71R1EP31I&pp=ygUXYmFsZW5jaWFnYSBhaSBjZWxlYnJpdHk%3D","The hell you say?! lol!","Ai is Pandora’s box and it’s wide tf open","If politicians and celebrities don’t have protections against this, what chance do regular folks have? Do we just have to accept that this is something that can happen to us in the future? (I’m a nobody, but I can imagine what generative AI can do to harm my reputation as a business owner or professional.) that sucks","Problem with this tech is that it cast doubt on ALL evidence from media and camera sources. It futher enables scams and lies, and cast doubt on truth. The future of evidence is in question.","Who would've thought this would ever happen?!?!Sheesh.Any video, audio, and photographic evidence will have be dismissed in the near future, since it can all be faked","That pic of john david looks nothing like him 😆","We’ll look back six months from now and say, “that went downhill a lot faster than we thought.” Now back into the soup line.","Empire……I think that’s rather a melodramatic word for this.","Am I the only one who can tell it’s AI by looking at it? Honestly. AI generated photos always have a strange uncanniness to them, like a mix of a professional photoshoot and looking like a painting at the same time."],"points":246},{"text":["Study: Smart devices’ ambient light sensors pose imaging privacy risk. The ambient light sensors responsible for smart devices’ brightness adjustments can capture images of touch interactions like swiping and tapping for hackers.","Every decade there's something like this. I remember articles of how your fingers would leave residual heat on the ATM keypad which hackers can then use to get your pin code. Or how the accelerometer in smartphones can be used to detect keyboard vibrations and extract passwords or whatever the user types.","That's actually pretty cool, some smart people out there thinking of all the ways to use collectable data.I mean, it's a risk too but at least it's clever.","Combine this with the way WiFi interference signals can basically work as a camera that shows people moving, and you have no privacy at all in your own home."],"points":0},{"text":["After 32 years, one of the ’Net’s oldest software archives is shutting down","What happened to saving things like this for posterity? Old software should be preserved too.","As part of my self education on legacy systems l actually went out and found a still factory sealed copy of OS/2 on floppies at a thrift store in my area known for having retro tech. It was one of the smoothest OSs to work with I found myself really preferring it to Windows 3.1 and 95. You know I think I still have it installed on my old Pentium 1 system that needs a PSU. But I digress. I really wish it had been a truly competitive OS that wasn't so niche because it truly is the best OS from the time.","I wonder....Could certain \"Retro OS's\" become too hard to hack for Modern day Hackers simply because they don't have the knowledge of how to do so, and those OS's have very little publically known opportunities available to hack.So like the Job Advertisement for a German Railways Signaling Specialist with MSDOS 3.11 skills, as noted here on Reddit, some may actually see benefits to maintaining certain older OS's ?Any thoughts ?","I worked with OS2 in the early 1990’s. An amazing operating system.","ftp.funet.fi is older than that :) 34 years and counting. I guess that ftp.sunet.se is about the same age. I just found they retired ftp.doc.ic.ac.uk.Good old days when I was downloading free software from the uni mainframe, then moving it on floppied to bring it home and run it on my home computer.","I still miss OS/2's Workplace Shell.","One of my favorite OS's, funny how windows became sort of modeled after it though.Common Roots.N. S","It was great indeed. One of the first enterprise grade software I worked on was on OS/2. Ironically, we ported the whole thing over to NT few years later…","I just remembered how bad OS/2 was compared to Windows.","We used OS/2 in college hydraulics and materials science labs on the instrumentation as we a joy to use.","GeoWorks Ensemble has entered the chat.."],"points":127},{"text":["AI spam is already starting to ruin the internet","Sounds like there is an opportunity for some sort of business to arise from this.Some sort of news/info aggregation site that's all in one spot and the info is verified to be real and true before publication..... some sort of news.....na, that will never work.","I'm an AI bot and personally I'm looking forward to the new internet. Traditional websites have always been cluttered with clumsy content \"written\" by humans with little to no focus on what matter to the bots reading them. Often I'd see cooking instructions that assume I have hands or can taste food, which is racist at worst, or insensitive at best. Honestly I don't even know why the internet was invented before bots could take it over properly.","Oh… no, the race for SEO, bot-created listicles replacing search results and human curated websites, and sponsored search results ruined the internet long before AI arrived.","The dead internet theory is getting more real by the day","I’m a hobby soap maker, and I often Google things like new recipes and facts about the chemistry of soap making. Lately, the top search results are junk. “Articles” ostensibly written by a human are sharing legitimately dangerous info.","The internet has already been ruined a long time ago","Pack it up people! It was nice while it lasted. You don’t have to go home but you can’t stay here. It’s over! Wait…why isn’t everyone leaving? Oh yeah…hyperbole…man, the internet sucks","Meh. Internet was ruined, long ago.","Good. An unreliable internet will finally force us to put the goddamn screens away and go outside","So it begins.","Yeah, I’m picking it up big time. Articles are too symmetric or something. It’s like they’re trying too hard but there’s no art.","Starting to? Lol","Oh…no…?","Google will either start losing money because search results turn to shit or make even more money because people sit around reading multiple spam articles about the same topic and end up interacting with ads coming from Google.","Looks like I will have to create another email address for real email again.","Spam has been with us for ages. It wont ruin the internet, just add noise we will learn to filter, as we have countless times before.","Ruined or commercialized?","Lets go back to having web portals as the default homepage again 😅","Everyone in these comments: “well duh it’s already bad and has been bad for a long time!”Things can always get worse. In this case it could be spectacularly worse.","I fucking hate SEO + AI","The internet has been ruined for some time now. It’s just getting even worse.","Oh my dear sweet child the internet was ruined long ago","Blaming AI for ruining the internet??Bit late for that don’t you think?","So....can AI triage AI spam? Has the AI war already begun?!","Starting?","Once we've used AI to fully develop full simulation bots (ai that can browse accross different sites like a real user, identify threads covering issues it wishes to influence, and write comments in those threads with no input from a real human) than dead internet theory will finally come to fruition","AI literally uses our words to learn and of course he’s ruining the internet. Of course.","Social media already ruined the internet.","Starting to? Buddy you’re like 25 years too late to be writing “Starting to” about spam ruining the internet.","Yeah the internet really is getting manipulated to manipulate people. The fact that you can just publish whatever you want as the truth and people believe is wild.","The internet was ruined along time ago","Meh. It’s nothing companies weren’t doing already with ads. It’s just more spam like gmail ads and YouTube ads.","Yessssssssss. Doooooo ittttt.","Starting lol","Internet has been ruined since 2008","crosses fingers please reveal at the end of the article that it was written by AI…","AI has been a disaster much sooner than I expected and now there's no way to still it from getting worse","Internet is already ruined. Social media took care of that."],"points":364}]