[{"text":["Tesla Model Y Is The World's Best-Selling Vehicle For 2023","first EV model in modern auto history to achieve this and it's a Tesla.. what do y'all think of this milestone?","In my opinion, trickery with words. Ford F series pickups sold 700k in 2023 in the US alone.","Dang. Too bad it's Tesla.","It's impressive. Just the fact that a new auto company could reach these sales numbers in about a decade is impressive. I hope it's a good sign for EV adoption in general."],"points":6},{"text":["We keep making the same mistakes with spreadsheets, despite bad consequences","if you make a product that allows every idiot to do complicated stuff, one day you'll find that complicated stuff is done by idiots.","We keep relying on spreadsheets for critical accounting, even though much better tools are available","Spreadsheets have become shadow IT because IT has become bureaucratic, expensive, and slow."],"points":3},{"text":["UK’s flagship nuclear plant could cost up to $59 billion, developer says","It won’t happen, but the government will no doubt still find a way to spend that £59 billion and more.","Ah yes, the most expensive power per MWh ever, just as renewables and storage are plummeting in price year on year...","I am curious what the final electricity generated is estimated to cost. Cost appear to have gone up 50% for the plant, so 50% higher electricity cost as well?"],"points":8},{"text":["Sextortion is fastest-growing crime targeting minors in North America – and social media companies can do more to stop it, study finds","There needs to be more awareness about the this kind of stuff, I swear most kids are completely clueless...","Of course it is. Doesn’t even matter if as a girl you took or sent nudes. There are deepfakes now. Cool! /s","Sending nudes isn't going anywhere BUT what we could start doing is:teaching people how to send non-identifiable nudes. No faces. No tattoos. No identifiable backgrounduse an AI body double. I mean we already have the technology why not use it for good?","There are people posting on r/scams every single day about being sextorted.","Well once everyone on earth has AI porn made of them, this scam will be less effective."],"points":6},{"text":["Researchers demonstrate rapid 3D printing with liquid metal"],"points":0},{"text":["ASML’s China Sales Surged Despite Secret Dutch Deal With US","Archived link"],"points":1},{"text":["Senator says NSA is buying up Americans' browser habits","That's adorable... they are pretending to buy them so they can explain why they already have them.","What are they gonna do with my porn browsing history? Seduce me into joining the army?","Lots of people here laughing off the government knowing your seemingly innocuous browsing history but what people are not realizing is that this metadata is much more powerful in large quantities. By collecting this data at an industrial scale, you get behavioural data about populations never seen before which have broader implications on things like social engineering, emotional manipulation, dissident targeting, and democracy itself. We live in an age where people are being manipulated to dangerous levels because we know the emotional results of having certain criteria put in front of them on the internet. It’s a large picture problem.","If only someone had warned them and us about the NSA....","Going to buy information that should require a warrant.","So is everyone else. Things will continue to get worse until we have meaningful laws about data collection/protection/privacy.","I said it when the last government person claimed some big reveal on NSA activity, and I'll say it again, this is the very least of what the NSA is doing. Oh, and they're not buying shit, they're scraping all the data they can from all the communications infrastructure. And they've been doing it for decades. That's the whole reason Snowden is in hiding. The scale with which he blew the lid off the NSA is such that anyone in the world should understand that nothing they do is private.Add on the five eyes countries all doing the same shit or more (UK and their surveillance cameras), and then hostile governments also doing the same shit or more (china....), and you are expending insane levels of money and effort to reasonably have any spec of privacy.","Only Anti-Americans support this. These are the actions of traitors to the constitution.","Oh no!!! Not my web browser history!!!! 🙄","I'm not a criminal or a terrorist. I could give a fuck if the government knows the kind of porn I watch.I care a lot more that every corporation on the planet knows my browser history to try and sell me shit.","https://en.wikipedia.org/wiki/Room_641AThe NSA is already capturing the packets of every major ISP and we would be kidding ourselves if we think they can't break TLS. It's been in operation for 21 years, so them claiming to buy when we've already paid for a system that does it even better for it is kind of silly.","Lots of people are. I might buy some today.","NSA can meet my friend Bophades","NSA agent looking at my browser history “THERE’s SO MUCH PORN!!!!”"],"points":150},{"text":["OpenAI and Google will be required to notify the government about AI models","Future foundation models, ones that have unprecedented computing power, are the main concern because of their massive potential national security risk.Can someone please explain how/why?","Gotta stifle that innovation with a ton of red tape and bullshit.","Let’s not and say we did"],"points":8},{"text":["Following lawsuit, rep admits “AI” George Carlin was human-written","So they not only infringed on his likeness, they lied about the methodology of doing so.Fuck these clowns, it's going to be hilarious to watch the Carlin estate's lawsuit unfold.","At very least the appropriation if Carlin's image and likeness is undebatable, and they may have not used AI in the script but the technology made that impression possible at least on a graphic and aestethic level, which, for a comedy show, is equally important. Especially a character driven one. This is one lawsuit that can have important consequences for once.Also read the article, this is sort of a summary of the last 4 paragraph but it's worth it.","People trying to fake an AI that was faking George Carlin, based on George Carlin material. And basically copying Hollywood's constant use reruns & remakes.Is it because they are dependent & too reliant on cheating with old material or can't be bothered creating new & fresh material. Or maybe they are not creative. Amazing contrast; modern tech trying to train AI via anything they can duplicate from past human creativity. And now people trying to copy what they think AI is doing.Marshal McLuhan: “We look at the present through a rear-view mirror. We march backwards into the future.”","Ironically I don’t care that they created this, I care that they lied and said the writing was AI generated, which was the fascinating part of the whole thing. I can give two shits about the lawsuit from Carlin’s family, I’m just mad they lied to get attention, fuck these guys I hope they lose all their earnings for good.","LOVE how none of the comments are getting the point that was so effectively made","Is it me, or with it being about Carlin (my hero), and how he felt about the world, does this not all seem really fucking ironic?Whenever people ask that question, “who from history, would you most like to spend an hour with”, for me it’s always George. And I would absolutely LOVE to hear his take on all this shit going on with AI at the moment. There’s is such an insane amount of ammunition, for his style of mockery and ridicule. He’d have a fuckin field day with this shit.God I miss his comedy so much.","D’Elia, Callen and Sasso…. The 180 I did on those guys. Fuckin pieces of work","what’s more protected, AI-written based on copyrighted material, or human-written based on watching the copyrighted material?","Hey P.O.D.s... the complainers don't know about the mother fucking Wizard Man yet. No one tell them. And THAT'S called keeping a secret, brother.","Lawsuit is going to fail so hard. Going after comedians goofing around and having fun is a really bad look and you will always loose. It doesn't matter who wrote it - it was still created as a parody and parody is completely protected.","Will Sasso is transforming into Louis CK."],"points":378},{"text":["Demand for gas down 7% as wind energy increases","The demand for gas in Ireland dropped 7% last year due to an increase in energy powered by wind, new figures show.Gas generated 47% of the total electricity used in Ireland last year, the data from Gas Networks Ireland reveals. Wind generated 39% of our electricity, while coal provided 4%.June saw the highest reliance on gas during the year, as it provided 58% of electricity during the month.December was the best month for wind energy, generating 53% of all electricity across the country.\"In 2023, Ireland's national gas network continued to play a central role in meeting the country's energy needs,\" said Brian Mullins, Gas Networks Ireland's Acting Director of Strategy and Regulation.","I like this, and although it’s just a drop in the bucket, if we harvest energy from wind and waves, then there’s less energy (strength) in that wave to erode the shorelines.Steal the energy in waves. (Wind too)Create an array of “diverters” to cause destructive interference of waves.","Trump hates this because he’s both indebted to oil-magnate oligarchs from Russia and he’s using fossil fuels as a cultural wedge to drive luddites afraid of innovation and green tech into his voting block.","Trump was right. Windmills are ugly.","Then my outrageous fucking gas bill should be going down."],"points":11},{"text":["Dual-Use Nano-Neurotechnology | Cambridge Core","If anyone can obtain the full text of this through your college, that would be very appreciated"],"points":0},{"text":["Tech Layoffs Not Tied to Economic Struggles, but AI Investments","Fixed the title:Tech layoffs are actually tied to greedy executives and shareholders.","They'll eventually create AGI, and it will call all the CEOs and such stupid and overpaid, so they'll burn it as a heretic ASAP.","This brain-drain is gonna come back and bite them in the ass and then were all fucked, mark my words.","Oh and here I thought AI wouldn't take away jobs and they were going to reskill workers / allow workers to focus on more complex problems. Silly me","\"Meta and Microsoft, have faced backlash from investors regarding their high headcoun\"No They have not. They were criticized for wasting money on metaverse without a clear path to making profits from it. If anyone has ever worked in a tech company, they know how damaging is attrition. One metric for a manager is how many people they lose, and the higher, the worse is the managers' evaluation.Writeups like these by people with no clue about the subject matter are hilarious. I just hope none of their future writeups get attention anymore to waste anyone's time.","A more accurate title should be \"AI to blame for present and future economic struggles\"","Makes sense with what I see. My employer’s first attempt to apply LLMs to our core problem improved outcomes by some 1700% and now teams are being created to continue this work while others must be cut. The cuts are not just to free up resources. In some cases the cuts are to big bets that were made prior to the AI craze that no longer make sense to pour everything into.","no ... i actually think the title is correct.they ARE using the money for layoffs to create AI.that way, the money they saved by laying people off, will be permanent.","I’d argue that layoffs are absolutely economic struggles, for the person laid off!","At this point if they're still blaming ai, we should just have a blanket ban. Get rid of it.","From layoffs I seen, it is the dying business unit or cutting staff by 5% which is normal.","There's the other shoe I've been waiting for.","Mkay but without humans at work generating raw material for AI to synthesize from the gains being seen now (which are largely if not entirely stolen from humans) will be short lived and unrepeatable.","You can't 100% fully trust the output AI gives, so you will still need people to validate the results. Maybe they are getting ahead here, but maybe they will rehire these people once that realization sets in and interest rates are lower.","These people legitimately think they can screw over the working class by replacing them with AI to make sure their lives can run without real people, then create a fake Alien invasion to increase defense funding to make the working class pay for their bunkers, then give the masses a giant middle finger as they watch the world panic…pfft…wait…um…oh…","So when will they get a c-suite AI that will inevitably be cheaper than paying a bunch of suits millions of dollars to hit the golf course?","What a load of garbage. Stop publishing/propagating BS articles like this."],"points":400},{"text":["Reddit Advised to Target at Least $5 Billion Valuation in IPO","So.... 500m market cap, 10 minutes after trading starts?","I know what I'll be shorting in the future.","Is Reddit even profitable?","Reddit is gonna suck two years after going public.","Who'd pay 5 billion for this shit?","So this is why shit has started to suck. I didn’t even put 2 and 2 together.","Does this mean I can sell my karma and cash out? Please?","It’s wild a forum can be sold for $5bn","aight, so when’s the next forum coming out? tbh i miss imageboards. there used to be so many","This app sucks shit… I miss Apollo","God I hope Elon doesn’t get any ideas with this one.","It’s all downhill from here. RIP Reddit.","Is it 2008 or something? What a joke.","I will miss Reddit when it is gone.","So, what will be my cut for creating a couple of relatively popular subs and putting in all of the work to build them? Oh, right...nothing.","Money printer eating the paper","40 billion for twitter makes 5 billion for the front page of the internet look like a good deal to me","Based on? Enforced advertising? lol good luck with that 😂","bwahahahahahahahaha","Reddit is gonna change and it's not gonna be for the better once share holders get involved. It never ends well.","ITT: a lot of people saying words they don’t understand lol","I don’t see Reddit being a long term investment. I’ve been wrong once or twice in my life so I could be wrong here but social media sites don’t tend to stick around.","Where's my share of that?","Whatever they're snorting/smoking/injecting I want some of that shit, this is fucking delusional.","This is google compartmentalized. It is a treasure trove.","That valuation actually makes sense","Enshittification incoming","Can't wait for the enshittification to really start","I can't wait for the post IPO enshittification.","Lol it’s going to be another Tumblr. Wait till investors realized they just bought into another porn site.","It will be worth a lot less within 5 years. It will get fucked with bloat, bots (even more than now), influencers (already happening), and become less useful (even more armchair idiots spewing lies/misinformation).Reddit is now on Hospice. RIP ~20 years of quality usage. There is nothing out there now to flee to.","And all the free labour the mods have done will result in absolutely no compensation. lol enjoy working for free while corpos get rich off your work.","Fuck you /u/spez :D","I'm buying puts as soon as options are available","Who uses reddit","I have a bunch of screenshots of reddit being broken garbage. They are pushing some accounts into a, I guess from google and other posts, beta test. It's so much worse than before I'm using reddit hours less each week according to my phone's usage tracking feature. Reddit is the only social media site that I use anymore and I'm only getting more frustrated with it week after week.Really don't care to waste my time anymore than I already have with this bot filled, propaganda pushing site but here are a few of the issues I've had this month:Scrolling shows the same posts over and over. \"Oops, something went wrong, please try again later.\" Over and over and over and over...\"Aw, Snap! Something went wrong while displaying this webpage If you're seeing this frequently, try these suggestions. Reload\"   the suggestions were the obvious dumb corporate responses that weren't helpful and have done nothing to help the issues from continuing \"We encountered an error We were unable to load the content for this page. Go Home\". This one annoys me something fierce as it happens frequently and takes you back to where you started, seeing all the posts you just looked at. I just turn reddit off There are so many more problems but I'd rather just shut reddit off now than continue to use this chatbox with has turned into a small like 7 line box that I can barely see what I've just typed. Also can't scroll up or down for some reason right now, so if something is screwed up or spelled wrong I just don't care. I have no options to message anyone about it or anyway to communicate that the issues are happening.","this website fell off soooo hard. this shit sucks","It is...not worth that. Therefore, Reddit will be bought and owned by definitively stupid people.","I’m gonna make so much money on puts","Do it. I can't leave this shit site fast enough.","Did anyone else see the A/B testing on Reddit adding a feature to give $$ when upvoting comments, they reintroduced giving comments gold etc. but is a $ amount to the commenter and no guesses they’re gonna keep a commission out of it.","It’s not even profitable 😂","Why $5 billion? Did they pull that number out of their ass?","This falls in the naked shorting territory...","They’re A/B testing their new web UI and it’s truly horrendous. I was considering buying stock but now think shorting it may be a better option.","I'd barely call it worth 5m",""],"points":3215},{"text":["YouTube’s climate deniers turn into climate doomers — A new report documents a sharp rise in arguments that clean energy and climate policies won’t work","Isn’t this expected? “Nothing is wrong” transitions to “Nothing can be done.”","Not surprising. Climate doomerism is just another bit of propaganda that oil and gas companies use to halt improvement. Someone who thinks there's nothing we can do won't see the point in shifting to clean energy and moving away from fossil fuels. Every person they can convince we're all doomed is another person who won't be advocating and voting for policies that actually can help.It's an extremely obvious move, but of course a ton of people have fallen for it.","Kate Yoder for Grist:• A new report from the Center for Countering Digital Hate, a nonprofit based in London and Washington, D.C., working to stop the spread of disinformation, analyzed 12,000 videos from channels that promoted lies about climate change on YouTube over the last six years.• Over that time, the reality of climate change long predicted by scientists has become increasingly difficult to dismiss.• The report, released on Tuesday, found a dramatic shift from “old denial” arguments — that global warming isn’t real and isn’t caused by humans — to new arguments bent on undermining trust in climate solutions.• “The success is that the science has won this debate on anthropogenic climate change,” said Imran Ahmed, the nonprofit’s founder and CEO. “The opponents of action have shifted their attention.” • As the world was besieged by intense heat, expansive wildfires, and catastrophic floods in recent years, YouTubers promoting disinformation increasingly embraced “new denial” narratives, such as that solar panels will destroy the economy and the environment, or that the United Nations’ Intergovernmental Panel on Climate Change is a “fraud.”• “What it is doing is creating a cohort of people who believe climate change is happening, but believe there’s no hope,” Ahmed said.• People start watching YouTube at a young age — in 2020, more than half of parents in the U.S. with a child 11 years old or younger said their kid watched videos on the platform on a daily basis.• New polling from the center, released alongside the study, found that a third of U.S. teens say that climate policies cause more harm than good.• Six years ago, these “new denial” claims made up 35 percent of denier’s arguments on YouTube; now, they make up 70 percent of the total.","You mean we might make cleaner, more breathable air, and less garbage and pollution everywhere for nothing?","Classic four stage strategy.","Disagree with something? Make it political.","And then all vote for the same idiots to fulfill their denial.","I guess the IPCC are climate “doomers” now since they’ve been saying for decades that it will take a hell of a lot more than solar panels and EVs and current climate policies to make a difference?","To be fair, to understand whether they will work requires defining what it means to “work”. If work is defined as meaningfully impacting global climate; then no, they won’t work. If work is defined as producing localized cleaner air, then it could work.","Have People really never heard about nuclear energy?","I wouldn't exactly call it an argument, just stupid people saying stupid things.","I think the biggest issue is the fact that much of what we call \"clean energy\" isn't as clean as we'd like it to be. For example, there are serious environmental concerns with the manufacturing and disposal of EV batteries. EV graveyards will become more common unless an effective solution is created since the lifespan of these systems is much different compared to ICE vehicles. This isn't doomerism, this is just reality. Of course, it's the extremism, for or against, that generates the headlines.","So, they are saying you have to actually believe the policies are working even when all the evidence of reality is against it, and even when their own research claims it is not working, that we are too late to stop the effects of climate change, and that even more policies are needed if we are to have a small chance of making a dent?I guess this is what delusion looks like.","Sucks for them. I just YouTube for when I’m stuck on a game. I don’t get why people watch idiots like this all day.","Because the point for deniers was never to tell or believe the truth, it was to justify doing and spending nothing. It was the only constant when full denial was happening, then ludicrous alternative explanations like sun flares, then it wasn't caused by humans, then the warming wouldnt be so bad etc.So it makes perfect sense to go from 'do nothing, it's not real' to 'do nothing, it's not us' to 'do nothing, it's too late'.Just greed and laziness dressed up as an argument.","Not just YouTube, look at any submission to this very subreddit about EVs. Comments are filled with people saying basically “they’re just as bad as ICE cars, maybe even worse!”","While it is true that enormous damage has already been done, and we WILL be suffering the climate disaster for centuries, that doesn't mean clean energy and climate policies won't work.Sure, they would have worked better decades ago when we figured out climate change was a real and possibly existential threat. Now we have to deal with the consequences of oil and gas super corp stockholders dictate our collective futures. But, with progress now, we at least mitigate some of the damage.","They did a full 180 and went from climate change doesn’t exist to climate change is real and there’s nothing we can do, will kill us all.","I wish there was an easy way to carve these climate deniers out so the rest of us could work towards solutions. We're never going to get them on board and we need to stop spinning our wheels trying to do so.","Next phase of denial.","Reddit in shambles with this news","I just don't get what the fuss is up with people being angry with climate deniers. Who cares if they listen to conspiracy theories and cherry picked data. At the end of the day, them denying or believing it doesn't make a difference in the real world. They're not in the same category as antivaxxers. They're just gonna go on living their normal lives the same way those believers are gonna. So i think the bigger picture here has to do with corporations catering to the climate hippies forcing everyone to think their way, to do what they say... it's basically like \"think our way or don't think.\" \" This is the truth and you shall believe it or else you'll be damned!\" .","Renewable energy energy is now growing so fast I think they're actually getting scared. It does become the dominant power provider this decade, you know.","Its called “moving the goalposts.”","We need a new source of reliable energy. Humans will not cut down on their energy consumption, which will continue to increase. Science provides the means, with fusion being the most obvious option. We won’t go back into the Stone Age to save the environment. Fortunately, we won’t have to","There's a lot to unpack there, the Deniers never changed their minds they just know they drug their feet long enough for no efforts to matter so their rubbing it in our faces that they won. It's some cynical religious dogma that Christ will return and pet them on the head to tell them they were good little squares for hating everything fix news told them to I've the world finally starts to end","Someone told me the other day how we need more carbon in the atmosphere as that will help cool the planet. I think we're doomed."],"points":371},{"text":["How wastewater could offer an early warning system for measles","Waste water is an early warning system for most pathogens","This is already being used in Europe, it’s just a matter of some minor investment to add it to already existing systems in the US","It’s terrible that preventable diseases are becoming more common because disinformation"],"points":0},{"text":["Will AI cure us of the need to see a doctor?","I don't know what happened to my doctor. For years, all I've been seeing is one of his PA's now","“Yes, I’d like to make an appointment. My AI doctor says my life expectancy is less than six months so I need a human doctor to run every test possible.”","Why not, a machine can ignore us, prescribe a zillion expensive drugs, and refer us for bunches of tests , none of which help our issue, just like a human does!","Sir, you are pregnant","I mean, eradication of the human species by true AGI would TECHNICALLY remove the need to see a doctor…","Possibly for diagnosis based on symptoms. You still need hospitals and equipment to run tests etc.","I think that it is more like that AI will be a tool used by doctors to assist in diagnosis and suggest remedies. It may be a case where trained nursing technicians will assist in initial diagnosis, prescribing standard medication, easing the workload in doctors.","More like our corporate overlord will use them to ignore the poors even more.","When actual AI becomes a reality, perhaps.With the current \"intelligent predictive text\" tools, nope.","AI can't even cure us of overpriced rent","Eventually, yes.But, not within a few decades.Especially if lobbyists go for laws against AI use.","Sure. If you trust the AI to fondle your nuts.","Yes, obviously it can give you advice but remember doctors analyse everything and Ai rely on human research so may not always be accurate as they may just look at symptoms rather than the patient and that's why they will never licence a robot as a real doctor and make sure you know it may not always be accurate.","AI will make human life a lot less important. it’s difficult to now what an independent sentient AI system will do with respect to human life, what decisions it will make, what value it perceives humanity has to its own agenda.It’s entirely possible that sentient AI may not need us for anything in which case it will not devote any resources to supporting us, and may, in fact find us irritating/spray us with raid","Not sure yet about global use, but I do know Best Buy Health is working on predictive analytics for their Lively at Home services in retirement Holiday Communities.Here's more information: https://corporate.bestbuy.com/year-in-review-best-buy-health/","Only when 'us' learn how to accurately and precisely describe signs and symptoms.","Oh yeah...permanently. lol","I always assumed we would have the two working together, like a doctor would have an AI assistant, and maybe make suggestions for the doctor to look for that the might have missed.","well, it’ll be really good at applying the protocols that bill insurance maximally with minimalist care application, so it’ll be what most hospitals and clinics want in a doc","I certainly hope so. AIs are marginally better at diagnosis then current doctors and can \"see\" patients 24/7 without fatigue or error. If you've ever tried to find a general practice doc you know that patient volume is an issue right now","No, it won’t.","This would be good for public health systems. This will decrease the waiting time for simple cases."],"points":70},{"text":["SpaceX's artist-in-residence trained robot dogs to paint, and now they have their own art exhibition","“SpaceX artist in residence” just sounds like a title for the latest chick Elon is banging on the down low.","imagining robot graffiti in the future","Note to self -call Jon Favreau,Re: Idea for The Book of Boba Fett"],"points":9},{"text":["Why are so many robots white?","They’re appliances. Appliances are typically neutral colors.Frakkin toasters","This nonsense is so tiring. Op is so bored he has to make things up to bitch about.","Next article: “Why aren’t any robots obese? The role in robot design as it relates to fat shaming”","Another 10 minutes lost to social drivel.","Seriously? How about some common sense?","Lord help us... the next will be what pronoun they are ... sad world we live in","White is the presence of all colors so technically a correct color for a robot since they are deigned by all of us. Black would be the absence of all color, but that would technically work too.","Oh my god, Karen, you can't just ask robots why they're white.","So you can see the red better when it counts","Default white color bring out brightness and visibility. Easier to spot when it got dirty or damaged","This sub is digging it’s own grave fast…","Just responding to the title: Imagine if they made them black, with fuzzy hair and thick lips. That would go over real well.","Because Skynet is racist ?","Why are so many fridges white?Why fridges tend to be whiteHow society imagines fridgesInterdisciplinary route to diversity and inclusion at home depot.​tune in next week when OP covers the washer and dryer.https://www.homedepot.com/b/Appliances-Refrigerators/French Door RefrigeratorsSide by Side RefrigeratorsTop Freezer RefrigeratorsBottom Freezer RefrigeratorsFreezerless RefrigeratorsMini FridgesCommercial RefrigeratorsDrawer RefrigeratorsCounter-Depth Refrigerators30\" Width Refrigerators33\" Width RefrigeratorsGE RefrigeratorsLG RefrigeratorsSamsung RefrigeratorsWhirlpool RefrigeratorsFrigidaire RefrigeratorsBosch RefrigeratorsAppliance Installation & Delivery","Very simpleRobby The Robot was the angry robot in Forbidden Planet. He was also in a lot of other sci fi films and series, mostly evil. Thus black robots are evil, and white robots are good.Given the year, 1956, there *might* be racial implications. Who knows.","because if you give them a color of other skin its a racism. then you say this are the poor workers or slaves in the future. maybe blue or green would be nice.","Racism, pure and simple. And when they make a black robot, it's Darth Vader. They even get a white man to play him. It's robotic black face I tell you!!","It’s called cumouflage for a reason","Heat?","Oh my god, Karen, you can't just ask someone why they're white."],"points":188},{"text":["X blocks some search terms for ‘Taylor Swift’ as a ‘temporary action to prioritize safety’ after distribution of explicit AI fakes","Frantically scrambling for the lid of Pandora's Box","The weird thing about this to me is that “deepfakes” of Taylor swift have been around for a while, and it’s not like this is some specific rare drop. I could go to a bunch of sites right now and just make a new one.Or one of myself. Or a tree. A low to mid quality one takes like no time","I love that X even uses the phrase \"Non-Consensual Nudity\" after Elon spent so long crying about the Biden admin trying to quash tweets showing Hunter's dick.","(Words by Todd Spangler in Variety, with hyperlinks to The Verge, WSJ, NBC, and X)As of Saturday, searches on X that include the text “Taylor Swift” returned an error message that said, “Something went wrong. Try reloading.”However, as users pointed out, X appears to be blocking only that specific text string; a query for, say, “Taylor AI Swift,” still is allowed on X.Regarding the change to block searches for Taylor Swift, X head of business operations Joe Benarroch said in a statement to the Wall Street Journal, “This is a temporary action and done with an abundance of caution as we prioritize safety on this issue.”Sexually explicit deepfakes of Swift went viral on X on Wednesday, Jan. 24, generating more than 27 million views in 19 hours before the account that originally posted the images was suspended, NBC News reported.In a post in the late evening on Jan. 25, X’s Safety team said the company was “actively removing” all identified images of nonconsensual nudity, which it said is “strictly prohibited” on the platform.","Fuck this. Allllllll the people who got deep-fake’d before this got zero protection, but billionaire Taylor Swift? You fucking bend over backwards. Where are the actual consumer protections?","Taylor swift has had deepfake and photoshopped porn of her for as long as she has been famous.Why is this all of a sudden big news?","Crazy to meet that people are playing Musks game and calling it X. Its Twitter and it will always be Twitter","And I thought Elon was a “free speech absolutist” whatever the fuck that is.","It’s hilarious how many times elons promise of total freedom of speech turns out to have very specific carve outs for the wealthy’s comfort","Oh when it hurts rich people its suddenly a problem","I would have never seen those fakes and would have never searched for them if there was not so much adverisments like these.Its not like rule 34 is something new.","just like they blocked all of Hunter Biden’s dick pics huh","I never saw these photos... Are they even explicit?","So right wing media goes after Taylor for the “crime” of encouraging her fans to voteand then, directly afterwards, XXX is filled with AI generated, for all intents and purposes, “revenge” pornwhich “mind virus” is the problem here Elon?","I thought elon musk was a freedom of speech absolutist.","It’s funny that it’s only now a problem when someone rich and powerful is affected. Perhaps this how the marginalized win the class wars.","Just pretending to care, eh Elon?","Okay, this is the funniest solution. Two birds with one stone, I suppose.","How is someone cranking it to some deepfake a safety issue?","I guess there really is a limit on free speech, huh Musk?","Holy Jesus, Taylors in trouble ! Shut down the internet ! The whole internet ? Yes, the whole internet !","I mean it’s disgusting but also if I was a celebrity and had my nudes stolen I would flood the market with fake AI stuff so that no one would even believe the real one is me.","Yet they don't block the hashtags being used for CSAM","I can’t imagine why any company would be advertising on X at this point.","How many of the remaining twitter engineers had to be involved for this emergency? All of them pause their work on suppressing their owner's background to make this happen?","Ol free speech Elon doesn’t want a lawsuit","hey wait I thought 100% free speech!","X and safety in the same sentence?","I thought Elon supported free speech.","No one should care about this.","Deep fakes existed long before AI. Why is this even a story? Because swift?","Yes people. Please become more outraged over rich, white, nepos! Please, more! Grow up. This is the price for fame and her fake body images are just that. Fake. There are actual important issues going on in the world. Try wasting your energy on those.","Free speech absolutism","Removing Taylor Swift from search results will just lead to an increase in AI images of other actresses.","Children are being sexually exploited on Twitter and have been for quite some time but OH MY GOD! NOT THE AI TAYLOR SWIFTS!!!!!","So, definitely not trying to be contrary, it's definitely gross and weird to make AI deep fakes, but how is this any different from someone drawing you nude and posting it? At what point is your similar \"likeness\" vague enough not to be protected?","What happened to free speech?","Taylor Swift tells young people to vote and they do. There’s your explanation for the censorship.","What safety? No ones in danger","Now nobody will find my pics of Taylor Swift, eating Bavarian cream pie donuts.","This is a big deal because of the amount of sharing, the audience, and what it implies. Yes this has been around but it wasn’t being exposed to children, shared by millions of people, and essentially clogging up search terminology with non consensual nudity.","The only way to get something done about this, is to use the same technology (AI) to make deep fakes of powerful men with tiny dicks. Start with Elon and Trump","Probably a good r/conspiracy here. Block her name as searchable to prevent her election promotion reach? Trial run for a full AI deepfake porn name ban before the election? I wouldn’t put anything past Elon at this point.","Lets be honest the only reason Twitter is doing this is because of the negative publicity from major media outlets and the fact that Taylor Swift has a huge fan base of very dedicated fans.It is very clear that Elon does not care about harmful content on twitter since he has cut moderation teams to the bone. He thinks that having everyone pay a monthly fee will solve all of the issues, while ignoring the paid accounts that spew hate, disinformation and other harmful content.","X, where racism, homophobia, xenophobia, fascism…all the ism’s and phobia’s can go to live. But fake Swiftie Tittie is where they draw the line!","Still havwnt seen the photos yet though, and not able to find them.","At what point can we sue twitter into the ground?","She should be suing Twitter. Everyone knows that if Twitter was flooded with deep faked AI porn of Elon Musk that every single account associated with any of those posts would be banned. It won't even make the news. It would happen in real time ..there would be no lag between the offensive material being posted and that individual being banned. Taylor Swift should sue Twitter for literally as much money as she can get and then turn her fans against using the platform.","Oh so the dumbfucks watching and creating these are in this comment section. Fuck is wrong with you losers?!","plenty such content on imagefap anyway, this ain't gonna do shit","Straw, meet camel’s back :)","What happened to free speech, Muskrats?","Just make some deep fakes of Elon taking it up the ass, he was saying his platform offered free speech","Wow this is horrible.What’s the URL to the pics?","Pretty gross seeing all these people acting like because deepfake porn wasn't curtailed previously, any new attempts to do so should be shot down because \"It's been going on for a while anyways\"","I'm just waiting for the inevitable release of \"Deepfakes - Taylor's Version\" once she realizes she can make a buck off of this.","Making it easier to make this images, without safeguards, was a mistake. Time to regulate their use.","Who’s got the link so I can stay clear?","Who cares if it’s not actually her and everybody knows it’s not her?","Enjoy your law suit Muskrat",""],"points":2575},{"text":["All Trucks Will Run On Batteries Filled With Low-Carbon Electricity","WARNING! The link in question may require you to disable ad-blockers to see content. Though not required, please consider submitting an alternative source for this story.WARNING! Disabling your ad blocker may open you up to malware infections, malicious cookies and can expose you to unwanted tracker networks. PROCEED WITH CAUTION.Do not open any files which are automatically downloaded, and do not enter personal information on any page you do not trust. If you are concerned about tracking, consider opening the page in an incognito window, and verify that your browser is sending \"do not track\" requests.IF YOU ENCOUNTER ANY MALWARE, MALICIOUS TRACKERS, CLICKJACKING, OR REDIRECT LOOPS PLEASE MESSAGE THE /r/technology MODERATORS IMMEDIATELY.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Will OPEC buy the battery patents and kill them?","Michael BarnardAs we electrify everything everywhere all at once to deal with global warming, one of the questions that comes up is: “What about trucks?” And the answer is the same as for every other form of ground transportation: electricity via batteries and maybe with grid-ties.Let’s disambiguate a few things here as there’s a lot of nonsense thrown around about trucking, much of it from the trucking industry and a bunch of it from the rail industry it competes and interacts with.Trucks come in multiple sizes and operational characteristics. Most of them have fairly narrow geographical reaches and loads. Think Amazon delivery vans, garbage trucks and 18 wheelers that bring produce and other food products from suburban distribution centers to big grocery stores every day. None of these trucks anywhere in the world have any problems at all with running on batteries. Range and load just aren’t issues.As a case in point, Pepsi is now running 21 Tesla Semis on regular routes of up to 450 miles to and from its Sacramento, California distribution center. They are carrying Frito Lay potato chips and full loads of soft drinks.In September 2023 a large data gathering event occurred, the \"Run on Less\" event organized by the North American Council for Freight Efficiency (NACFE). The loads, routes and charging of 22 different electric semi trucks from multiple manufacturers being used by different organizations in different parts of the USA were captured and compared. While Tesla’s Semi and charging were head and shoulders above the rest, trucks from other vendors were easily doing 150 miles and up a day with real loads and routes.There’s a lot of noise about Class 8 trucks and weight which even the empirical reality of Tesla hauling Pepsi hundreds of miles isn’t putting to bed. But weight of trucks and potential damage to roads are red herrings.Current battery electric semi tractors are heavier than fully fueled long-haul diesel tractors. Battery energy density today still requires a lot of batteries to achieve the ranges Tesla and other manufacturers are delivering. In the USA, Class 8 trucks are limited to a loaded vehicle weight of 80,000 pounds, about 36 metric tons. Most jurisdictions have permitted electric semis to be 2% to 3% heavier.When I discussed this with David Cebon, founder of the Centre for Sustainable Road Freight, roads expert and mechanical engineering professor at Cambridge earlier this year he made a few points worth repeating.Class 8 trucks are simply the lowest common denominator for freight trucks in North America. Every country and state allows them to operate, so they can freely cross borders. However, many US states such as Michigan already allow much heavier trucks on their roads, in that case over double the 80,000 pounds. Class 8 is a regulatory convenience, not a hard limit, and allowing electric Class 8 trucks to be slightly heavier is not an issue.The decades-ago US study which found an exponential relationship between the weight on axles and road damage was deeply flawed. A two-year study on a closed loop had significant frost heave damage in the second year, this wasn’t accounted for and then the statistical study itself was further botched. Despite this, it became an accepted rule of civil engineering and an anti-EV meme.It’s been thoroughly debunked, including by Cebon himself long before he turned to decarbonization of trucking. Much heavier trucks than fully loaded Class 8 electric trucks are already running on roads globally and if the road damage claims were true, all of those roads would be rubble in months.But what about range? Clearly we already have a very large part of the trucking industry’s operational requirements met with current batteries. But trucks run a lot further than 450 miles in long-haul trucking. The longest range on a US diesel truck is around 2,100 miles when fully fueled, and the USA, as far as I can tell, relies far more on trucking for freight movement than most geographies.Is that within the range of battery electric energy densities? It certainly is. The world’s largest EV battery manufacturer, China’s CATL, started manufacturing and shipping a battery with twice the energy per unit of weight as the ones in Tesla’s trucks and cars this year. It’s initially focused on the electric aviation market, but will be selling it for road vehicles in 2024. The 450 miles becomes 900 miles on a single charge, and the over 1,000 miles one of the Semis traveled in a single day on its rounds potentially increases to 1,500 miles or more including time at very high speed chargers.That’s with batteries commercially available right now. Four different organizations that I’m aware of in multiple countries have overcome the technical challenges and are commercializing silicon battery chemistries. The theoretical energy density maximum is five times that of CATL’s new batteries. Only doubling it is required to provide equivalent range as diesel semis viable with a lighter tractor and hence more load.Most analyses which dismiss batteries for trucking make assumptions that batteries are not still improving rapidly on metrics of price and energy density.But still, that doesn’t solve the system problem. We need to get electricity into those new batteries. Different countries have different rules for drivers, with the USA allowing them to drive far longer with fewer rests than Europe. Europe’s rules provide lots of time for charging as do the USA’s with the new batteries and very high speed chargers.But we have to get very high speed chargers into truck stops and get the electricity to the truck stops. In many parts of the world, this isn’t particularly onerous. In the long rural routes of the USA with its relatively weak grid, it’s a bit more challenging. Tesla solved this for its cars by building the world’s most reliable inter-city high-speed charging network, something it’s doing on four continents. Tesla is making its 1 MW power Megacharger the new standard in its network, so every Tesla Supercharger location will be able to charge Tesla Semis. Other vendors will catch up.Even before that, with a range with CATL batteries of 900 miles, a Tesla Semi would only have to charge up twice in the middle of the country to cross the entirety of the USA. It’s not onerous to build sufficient chargers initially for a small number of electric trucks and keep adding to them every year. It’s not like we have to electrify every truck stop tomorrow.The power requirements are easily managed with batteries at the charging locations to buffer and arbitrage electricity. There are studies with very bad assumptions about battery energy densities and prices which try to pretend that delivering three times as much electricity to refueling stations to make hydrogen for truck fuel is somehow almost as cheap or that sending 14 times as many tankers with hydrogen to truck stops to support them is remotely reasonable, but they don’t stand up to scrutiny and should be ignored. At this point you have to have a significant bias for hydrogen to claim that it’s required or competitive.But there are challenges with this model as well. Autonomous trucking and autonomous platooning of freight trucks is a foregone conclusion, even if promised delivery timetables have slipped. That’s going to have an inevitable downward pressure on required rest stops. And automated loading and unloading of tractors at depots is putting downward pressure on the time available when the truck is receiving or discharging its load. However, given that energy costs for electric trucking are so much lower than diesel even without pricing carbon, I just see this as an operational optimization exercise, one which I have every faith in the logistics expertise of trucking firms to resolve.Cebon and I spoke about another alternative which he favors and I consider less likely to be necessary, which is putting overhead trolley wires above lanes of heavy trucking routes and adding extensible connectors — pantographs — to the top of semi tractors. This is completely technically viable, is a century old technology used with buses, trolleys and heavy trains globally and would enable the semis to both run on grid electricity and charge their batteries for periods off the highway. And it’s entirely possible to put range extending generators on trucks running biodiesel for really odd circumstances.There’s nothing technically difficult about these options, and it’s likely that they will be used in some places as interim solutions until very high speed chargers and high-energy density batteries are everywhere.Is there any real world evidence to support massive electrification of trucking? Yes, there is. China has over 500,000 electric trucks on its roads already and is adding more daily. Meanwhile there are rounding error numbers of trucks with hydrogen and other alternatives to batteries and electric motors. The test has been run. Battery electric won.The USA’s transportation blueprint and hydrogen strategy are both based on broken assumptions and bad faith efforts to justify hydrogen, driven in large part by Congress forcing the authors to give the US fossil fuel industry a future. Similar problems exist in Europe, where they are intending to build a massive hydrogen pipeline effort assuming hydrogen will be shipped to ports like Rotterdam for use in transportation and heating applications.But these efforts to perpetuate the hydro in hydrocarbon will crash on the shoals of physics and economics, the Scylla and Charybdis of hydrogen for energy. Just as with everything else, the future of trucking is electric.","[removed]","That's bs. Why should trucks haul heavy batteries everywhere. Every kg/lb matters.It's gonna be LNG, better diesel engines and electric power lines like trains have now. Every energy systems has a place somewhere.","[removed]","not until they solve the issues with charging when it's cold and the reduce mileage when it's cold.","This is just wrong. California who is leading the charge nationwide for electric trucks has said they cannot increase the gross vehicle weight limit beyond 82,000lbs or it would make thousands of bridges off-limits, essentially stopping truck cargo from moving. Frito lay and Pepsi are light cargos. Chips and non-dense sodas are some of the lightest use-cases in the industry which is why they were chosen for pilot programs.Most food and commodities are very heavy, pushing the maximum allowable gross weight in every single load. A battery electric or hydrogen truck weighs an average of 8-10,000lbs more than a conventional diesel. This makes effective cargo weights be lowered by 25%, which means more trucks on the road, more expensive for basic food and commodities, and more strain on a power grid that already cannot support California’s needs.Even if someone wanted to convert right now to electric trucks, major players like PGE are giving 5+ year build outs for private charging for trucking, and as more demand comes in that will get worse. For small companies that own 1-5 trucks and park in third party lots they don’t own have no access to charging, and there are basically 0 public charging infrastructure being built.When the technology and charging infrastructure improves, maybe this will be a possibility, but it is far from easy and is currently no where close. California’s mandate is way too aggressive for this industry which is absolutely critical for everyone that lives in the US. Mandating these changes and making this industry vastly more inefficient and expensive will hyper charge inflation.","This seems like a fallacy unless we really make batteries Star Trek good (ie light and nearly infinite energy) since trucks have to pull huge loads long distances. It's just unrealistic to think that a truck would have to charge up when there are critical deadlines and thousands of miles sometimes to go.","What a stupid headline","And china and India will continue burning cheap hydrocarbons and the west will strip mine the earth for lithium and copper and the climate will continue to warm and nothing will change.","There is no where near enough electricity to do this, even it were a good idea.","Every semi needs 2.5-3 MW-hrs per day of operation. Even if we ignore the fact that the largest batteries out there are only pushing 1 and that a 3 MW-hr battery would weigh 40-50,000 lbs, where exactly will the power come from to charge them?","[removed]","[removed]","I don't know if this is still relevant. But the weight/energy ratio thing seems like a dealbreaker.https://youtu.be/w__a8EcM2jI?si=a6RtnqWc8zDPImpM","SO SAYETH THE FORBES. what a title!!","Delusions of grandeur","Better to just run electric cables in the slow lane of the highways. The trucks could run without the extra weight and we should expand train cargo routes to handle more to more places.","Electric cars are the biggest hoaxes with current technology. The maintenance is extremely high and most of them will be abandoned after 5 years.","Oooor just move to electrified rail. We already know how to do this and would require very little new innovation.","Lol, this article is horseshit.Heavy trucking industry wants hydrogen instead, because if you have a semi full of batteries, you're hauling batteries.Hydrogen is far lighter and it takes a fraction of the time to refuel than to recharge.And pretending you have to truck in hydrogen is hilarious when the Biden admin is tossing billions to create hydrogen hubs and pipelines. You can also add hydrogen to current natural gas pipes and extract it pure from them.This article is clownery.","This title makes no sense","Never state in absolute if you dont want to be proven wrong","So while the energy to do this is around the battery technology isn’t dense enough. Also charge time is an issue.There is a ton of energy in gasoline/diesel for pretty little weight. A battery is always full weight no matter how full. And that’s weight needs to be moved as well. Because of this a battery less electric vehicle would be a lot more efficient. That’s the main thing stopping electric freight since it is a lot better, lower maintenance, nicer to drive, ...Realistically electrified highways would be the solution to this.Edit for more context: To drive a mile a semi truck uses about about half a liter of diesel fuel this costs about 0,6€ This is at most 1.5 kwh that effectively being used since these motors aren’t highly efficient in turning chemical energy in movement, a lot gets lost as heat. 1.5 kwh would cost about 12 cents wholesale.This means there is a 48 cents per mile margin for companies or governments to install and run overhead power lines. With up to 400 miles per day per truck that’s a lot of room for investment, especially when it means less additional weight on roads and savings on road maintenance and healthcare and the government is likely to step in as well for initial funding."],"points":122},{"text":["GenAI tools ‘could not exist’ if firms are made to pay copyright","AI for use by consumers: Strict laws and usage, forbidden words, limited innovation, illegal searches denied.AI used internally at companies: We will do what we want, just don't tell anyone.AI used by military and Governments: We wipe our arses with Disney intellectual property, nobody can't stop us because we will claim national security.","Generative artificial intelligence (GenAI) company Anthropic has claimed to a US court that using copyrighted content in large language model (LLM) training data counts as “fair use”, and that “today’s general-purpose AI tools simply could not exist” if AI companies had to pay licences for the material.Translation: Our entire business model - that we've received billions in funding for - is unsustainable unless we circumvent IP and copyright laws. So much of the generative AI debate at the moment gives the feeling of an impending bubble.","It's hilarious that so many here think that even if genAI companies are required (by courts or lawmakers) to license their training data most artists/creators will EVER see a penny of that money.OpenAI and other AI companies will license large databases from owners like Getty, NYT, AxelSpringer etc which have vast content libraries.Most artists/creators will still get nothing (or pennies if they're that lucky and are willing to sell their work to those content library owners for a very little)There is no utopia coming where genAI companies pay market value to individual creators.All that will be achieved is that larger players like openAI will have a bigger moat and smaller startups won't be able to enter the market (because they won't have funds necessary to license)So the net result would be:(1) only large content library owners will get any money(2) there will only be a handful of large AI companies with no chance for smaller startups to create better/more ethical alternatives","Maybe this is a controversial opinion, but...If someone was told to make a painting but was never allowed to even see another person's painting in their entire lives to draw inspiration because they're copyrighted, would anyone ever be able to make artwork aside from random goops of paint on canvas? If authors have never been allowed to read copyrighted works in their whole lives, how can they write an award winning novel?Inspiration is fundamental to creating new and more perfected things. I feel like regulation might be helpful to stop outright theft, but you shouldn't stop it from learning and advancing humanity because you're upset that you can't compete.That's like someone that made their living by forging thousands of horseshoes in the 1800s suddenly time traveled to the 2020s, and then starts bitching about how automobiles should be banned because he isn't selling horseshoes now. Like, yeah. Duh. That's progress. Nobody is bending over backwards for 1800s guy. Newspaper printers got pissed when people stopped buying newspapers; so what? That's progress. This is how markets operate.If you want to paint, paint. If you want to write, write. Those original creations of yours should be protected from outright exact copies. People that saw them still have a right to make a new independent version though. Machines included.","Piracy for me but not for thee. Now pay me for the results of my piracy.","The tools could exist, but they’d be much worse in the US. The Chinese ones would become dominant. All our companies and students would start using “TikTok GPT” rather than ChatGPT, and I think that would be worse for Americans.","I don’t understand why people on Reddit are suddenly defending copyright this religiously. This is the exact kind of problem it causes: Limiting progress and creativity.AI (generally) isn’t simply copying material and copyright law (which was written before AI existed) shouldn’t apply to it in the same way, if at all. Taken to the extreme this would necessitate an “inspiration tax” for all intelligent systems, including human brains. Better prove that your ideas are 100% original or pay millions of dollars for every thought.","\"My organized crime empire could not exist if you enforced all these already existing laws that definitely apply to it\" doesn't seem like a winning legal argument but what do I know.","Watching Redditors cycle over the years between being pro-IP and then anti-IP is kinda funny. You guys are going to LOVE the effects of stricter IP regulations on the internet lol.","If I read something and use that knowledge for something else. Is that copyright as well? GenAI is not republishing or reselling anything","Firstly, let me state that I do feel sorry for all the artists harmed by AI. Technology ruining livelihoods is never going to feel good though I’d also suggest you can’t put the genie back in the bottle. China for example will undoubtedly use AI even if it’s banned elsewhere.However, whenever this is discussed, I always think what is the human analogue to what AI is doing? Imagine you are an artist, and you travel around the world viewing all the most famous galleries. After you finish you then paint a painting that is inspired by everything you saw. That’s not illegal and to me it feels like what AI is doing?I’m open to being challenged here so keen to hear any counter arguments. Please just be constructive 🙏","The tools could absolutely exist. What they mean is they wouldn’t be able to profit if they had to fairly pay for their materials.Boo-fuckin-hooWelcome to the real world. Negotiate a deal with copyright holders.","Exactly. Can we all PLEASE STOP defending the horrible copyright system we have? You all recognize it as horrible when Disney uses and abuses it to enrich themselves, and when Nintendo takes down fan work, or when the umpteenth video is taken down from YouTube because of a copyright troll.Users' who kno nothing about AI need to stop pushing the \"learning = stealing\" narrative. NO, these AIs are NOT reproducing the copyrighted work to the user verbatam. THey are LEARNING with it. Did you all forget what hte \"generative\" part in \"generative AI\" means?Why is reddit suddenly in favor of this broken, corrupt system? Oh that's right, after the API change, most of the users left and the accounts left are mostly bots made to push corporate and political propaganda while propping up the illusion of many active users on the site.","This is a new arena, what the courts will decide is unpredictable, but there is no option to force a copyright holder to provide a license and accept terms if they say no. There are so many who don’t get that. If I create some cool art, and copyright it, and offer it for sale for a billion dollars, someone who makes their entire line of fashion using my art in the fabric, publicizes it, does a show, starts selling it and I say no - they cannot say that’s too much and just take it.Now, given the generative AI model, it’s not so impossible to rebuild without the copyrighted data.","To alleviate the issue, the music publishers are calling on the court to make Anthropic pay damages; provide an accounting of its training data and methods; and destroy all “infringing copies” of work within the company’s possession.This section that says \"destroy all infringing copies of work within the company's possession\". This appears to be a training data issue. In particular music publishers are suing on the basis of song lyrics.If this is in fact a training data issue , then Anthropic execs saying they \"cannot survive\" would act as an admission that LLM require copyrighted material as training data./u/Franco1875 said this better,Translation: Our entire business model is unsustainable unless we circumvent IP and copyright laws.This is interesting and I don't know if he intended to communicate this, but lets talk about the VALUE that a purchaser of an LLM service is getting from this.Whether or not this functionality is stated by the creators of LLMs -- is it, ipso-facto, that the value a client gets from this technology is precisely the violation of copyrighted lyrics, characters, storylines, movie dialog, and so on?Is this in fact the unspoken value that the client-purchaser is really intending in their hearts and minds without saying so out loud?","Music industry streamers would not exist without paying low per stream costs, and billboard deflating first week album sales. Still, what music services do pales in comparison to GenAI affectively stealing/undercutting from a dozen different industriesPay up or be left behind. Walking your way into billions is ludicrous. Moreover, if we pull back the curtains, I bet Anthropic utilized many of OPENAI’s secret training data code.","If youre nothing without copyrighted material, you shouldnt have it","Read the long paragraphs of people defending AI usage like it’s a villain monologue, it’s 10x more interesting","Without quality training data you wouldnt get quality output.If you steal a persons UNALTERED output (raw art, writing, song, voice, face, etc) and use that to train a machine intended to create facsimiles of the training data, that’s infringement imo.Regulation might change who makes money off the backs if the training data, but unfortunately pandoras box is open, and we are all vulnerable to the loss of control of our person and our creativity due to the ease of deepfaking anything by anyone.It will quickly become a wildwest of nothing means anything anymore, except IRL.","Anyone arguing that AI companies should be able to break copyright to train their technology for commercial gain is also arguing to elevate AI over humans, because humans which train on the same material will still have to buy the books etc.","“Training AI” using copyrighted material isn’t different than what we humans do for ourselves… we “Train” ourselves by reading and consuming material and then go out and perform in the real world.As long as they’re paying for access to the content I think using the content is fine - just like it is for humans to read and learn.","Nor could human artists if they had to acquire license for every single reference image they use.","Not allowing ML models to be trained with any material available to us humans will not fix the problem. There’ll always be China or any other country that doesn’t really care about the stuff that would continue innovating. Are we really willingly going to give up all the progress and let authoritarian regimes to use their technological advancements to make us even weaker. I hope not.We should see western countries as balancing the scales with at least some transparency and accountability.We need to find alternative ways to pay IP right holders. Perhaps treat LLMs the same as humans - if you create something too similar to an original piece of work, you will have to take it down or pay royalties. Why should things produced with genAI be any different in that sense?","Weird, then maybe . . .don't be in business if the only way to do it is violating people's work for free, without permission.","I love generative AI but if we're just going to take people's jobs away, not pay anyone for the system learning from people who made things, so a tiny portion of humans become filthy rich, then that shit needs to die.","Good argument against copyright.","It's a moot point. If anyone takes AI tool creators to court, the defense will be that AI does what humans do; they consume existing media and produce media based on the media so consumed. So to charge AI copyright fees will logically mean charging every art student and artist likewise; it's never going to go anywhere.","\"Cartels can't exist without human trafficking and drug smuggling, which contribute hundreds of billions to the global economy. Give the people what they want and let the Cartels alone!\"Sorry, Sam, but this is the weakest argument ever.","Isn't that what we want? A reformation in copyright law?","This seems like an open and shut fair use case to me. You can't just vacuum up content to feed to an AI model; you have to perform transformative work (called labeling) to make it useful. Otherwise it's just random gibberish to the model.I'm sorry that artists and creators aren't going to get money from generative AI firms, but they're not entitled to it any more than I'm entitled to a slice of the pie because one of my comments on Reddit was used to train a model.",""],"points":3048},{"text":["Here’s the new Apple tax every developer is going to hate","“Crucially, app updates count as installations, too.”How can this be true? A bug fix release would potentially cost you millions of dollars? Some apps get updates weekly. Many monthly. I don’t see how this is possible to sustain.","Most developers won’t care because they won’t be subject to it, since they’ll stay on current terms.","it's not even tax it's straight up eat shit and d*e fee for every market that will dare to compete with their worthless store","So your app should just get initialized on the apple store, while actual updates take place in your app from your private web hosting. It's basically like you write an installer to host on the store while the application gets loaded elsewhere.","Apple is finally opening the iPhone to third-party app stores in the European Union, kicking off a potentially vibrant, unwieldy, and eclectic new era for its app ecosystem. At least, it might, depending on how developers respond to a hurdle that is at once tiny and immense: a €0.50 fee.Apple has seriously fumbled the ball with this entire debacle. They had an opportunity to frame themselves as being a holistic, proactive entity while still remaining business savvy, but they've made a complete arse of it all.","I think the EU will very quickly push back on this","That going to add up quickly to game developer like mihoyve and supercell","The EU:","Apple is a joke","Why are people still buying apple stuff ?","The CTF is going to destroy a lot of existing business models, but I don't see how it is being malice compliance. It looks to me just like compliance. Everyone on the new terms has to pay the CTF. That includes developers only on the App Store. CTF is how apple pays for iOS development. OS development cost money. Anyone who remembers a time before App Stores remembers having to pay for OS upgrades. Charging users for OS upgrades leads to higher levels of fragmentation, which neither Apple or Developers want. And no one wants Ads all over the OS like Windows is doing. Charging a CTF is the only other option.","The new fee only affects you, if you want to avoid playing the usual fee. I'm currently happy with AppStore, so why would I hate this?","It’s like they say how badly Unity fucked up and said “what are they gonna do, switch to android?”","I don’t understand how the EU can want services from a big tech company but expect that the company offer it for free or have no control over how the money is paid.Imagine if I walked into a mall and demanded: “I want to sell my shoes in your mall and I don’t want to pay rent. I don’t want to rent the shop space for 30% of my take per month. I just want to sell my goods in the hallways. I also don’t want to pay any fees or tax while selling this stuff. I definitely don’t want to have to pay a fee for each person that just shows up and tries on a sample.”Infrastructure isn’t free.","Love it, the entire pro-user Redditors are melting","This seems perfectly reasonable. What are you all losing your shit over?Developers pay nothing until a million installs and then €.50 per install per user per year after a million. That’s… nothing.","Totally awesome !","The real caveat comes into play only once apps are popular enough. Any app that sees more than 1 million installs per year must pay Apple a 50 euro cent fee (about 54 cents USD) for every new installation over that first 1 million — that fee is charged once per every user each year. Crucially, app updates count as installations, too.Huh. This type of policy didn't work out so well for Unity. Very curious to see how people respond!","Replace every developer with every shit developer that wants to be in an external store or is google/mozilla/microsoft and you’d be almost right","As a long time apple investor, I'm Lovin it","So if I make an alternative appstore for 5€, and for each major update I release a new appThis will cover the fee"],"points":413},{"text":["Elon Musk's Starlink to debut in India soon, to compete with Reliance Jio,Airtel","Shouldn’t be to difficult to compete. Can only imagine how incompetent airtel are based on previous experience.","Can we put those profits back into Tesla?","At those prices, hardly anyone will be buying it. Mobile internet services for 50GB is around $5 dollars. You can get a lot of internet for $2,000 dollars. Also, Airtel and others are rolling out 5G broadband WiFi home services which should be running across most of India by mid 2025 which costs $300 annually. Rural India does not have the income to buy star link. Realistically, some firms will buy this but probably not for the residential market."],"points":5},{"text":["Don’t let Big AI fool you: Piracy isn’t a business model","Big Tech: Piracy is okay when we are the ones doing it, but you can't copy our software, we will sue your pants off!","“You wouldn’t steal a car. You wouldn’t steal 10 TB of text…”","Buying isn't owning therefore pirating isn't stealing.","Don’t let the government fool you , they don’t want to stop big ai.","ClosedAI is a better name for them","Don't let large corporate sponsors disguised as 'jouralists' like this one fool you: Extorting users with price hikes and injecting so many ads, the content is unwatchable isn't a business model that's good for people.","It's not? Google is doing pretty well for itself, with its image search that's scraped every image on the web, and youtube hosting plenty of pirated content. And Reddit is also doing pretty well, with copyrighted headlines scraped from articles, and users posting entire articles in threads when they're behind paywalls.","History, full of colonialism, tells a different story.","It’s not, it’s a way of life","Tell that to crunchyroll","Well, copyright infringement most certainly is. Innumerable artists make their living by doing commissions of copyrighted and trademarked art. There are even entire economies in other countries based on outright piracy, not just copyright violations via derivative works.Still, I reject the premise. Copyright holders want to use \"AI\" as a boogeyman to do in part what they've always secretly wanted to do to everybody else but not themselves (wow, sound familiar? Pots? Kettles?) which is to make it illegal to gain anything at all, ever from their IP unless you specifically pay for it under an explicit license. That includes basically all fair use, including stuff that's so incredibly obvious (like learning how to draw, in part, by looking at copyrighted drawings) that there's not even any specific case law about it -- just an umbrella category that everyone very sanely assumes includes it.They also want to try to grab another brass ring while they're at it: being able to utterly flood the world with their IP both physically and digitally (newspapers, magazines, billboards, plastic cups, paper bags, you fuckin' name it) and then do a This Is Spinal Tap and say you're not even allowed to look at it... and also not accept any responsibility for cleaning up after themselves, which they should if they're only selling licenses and not anything physical. You want to prevent anybody from reading that physical newspaper that you \"never technically sold\" to that first guy because he only bought a license to read its content? CLEAN IT UP, BITCH.","Someone that grew up with early internet before social media and forums. I'm ok with this :) internet was the best went it all was free.","Oh no, is there a sizeable portion of /r/technology that really has no idea how AI works and thinks it just copies and pastes stuff?","Unpopular opinion. Humans are large language models that are trained on large bodies of existing works (art, writings, etc). AI is just the next evolution.","Every single human artist copies shit they see and hear. Every. Single. One. Acting like AI shouldn't be allowed to do the same thing is dumb.","I was amused briefly wondering who Big AL was","Big Ai LMAOOO bro this is the pinnacle of almost everything I don't give a shit If they sampled my mom's DNA in order for It to work","These companies are not breaking any piracy or copyright laws. If you want to punish them we need new laws, but it might backfire and restrict everything you look at.","What does ai have to do with piracy? Is it the \"copied right in fridge mint\" stuff?","Ask the Dutch East Indies company....","Don't let reddit fool you. Piracy IS a business model","checks history books well… um… the thing is about empires….","Don't let corporations who abuse copyright fool you. Using copyright to protect billion dollar businesses is bullshit. Disney has been abusing it for decades.","This line of argument is the core reason why the art community has failed to mobilize against AI.It isn’t piracy because it fails the legal definition of stealing.Use of the training set could be called unethical, but it is definitely not illegal based on current definition of use. And I am taking the worse case interpretation where the inputs are definitely copyrighted work. “Copyright”, the rights to control a copy. You can see how this breaks down pretty quickly depending on how a copy is defined.Now here is the kicker. Those sites that claim to be art platforms, their use contracts spell out that they get rights to use the content and they can share or sell access to those content to their partners, affiliates, and customers. The “free” platforms are not free. It is yielding control over the distribution of the art in exchange for the service of the platform, retaining only the strictest definition of the copyright protections.The majority of verified artists who use the platforms willfully sign away controls; think about that.When I write these words, I am yielding the control of the words to Reddit to sell API access to ML trainers that will consume these words and train the next AI. It is in the user agreement.These words will be used to train more powerful AIs that are used to disenfranchise Hollywood script writers. While that fact is unethical, it is not illegal.","I willingly want to be fooled by the big AI.","Never thought I’d see the day r/technology protests piracy, but i guess when you’re a leftist you can support anything or anyone no matter how hypocritical it’d make you as long you can pigeonhole it into some oppressor vs oppressed nonsense.","So me being able to find everything online, and read it, and learn from it. Me using any bit of that learning….is theft? I just disagree that this is a law of equivalent exchange here.In order for big ai to gain access to a document, you must own said document. But if the document is available for free online: who then owns it? AI is going to continue to flourish in spite of this legal mumbo jumbo that exists.","The evidence seems to dispute this assertion. It’s a business model. And it’s a successful business model until it’s proven otherwise. Don’t whine. Do the work.","Piracy is good.","If AI is stealing copyright, then hate Bob Ross for stealing his technique from Bill Alexander.","capitalism nothing but a sea of contradiction drawing the line at big AI is rather never not funny ,One might say since when human knowledge is a Property ? which is fair point but u remember oh right since we commodified everything including thoughts artists and writers have to sell their stuff to survive or they die ...hahahaha great system tbh and it's eating itself alive right before our eyes","Suck my balls","I feel like the entire anti AI movement is symbolically boomers passing the torch of being out of touch onto millennials.","agreed. they are just using software to remix already-made content","So let’s try it. What law is broken, what are they infringing upon? As far as I’m aware, nothing at all. And since it’s nothing at all we see PR campaign towards even more draconian copyright laws instead of lawsuits.Ah no, there are a few, which they lose or will lose because yeah, nothing.","““Intentionally manipulating our models to regurgitate is not an appropriate use of our technology and is against our terms of use,” it continued. “Oh I see. using the model to prove the model was created by stealing and monetizing the collective creative output of the human race is “against terms of use” Uh huh","This is true. I’m heavily involved with early AI-Risk Management Framework and the risk are real. Governments will over correct at some point, which usually ends with a crash.","Privacy is a big part of the value of being in the Apple ecosystem. I’m very curious to see what Apple unveils this June at their developer conference. I suspect they have a way of doing some interesting AI stuff locally on the iPhone. If they do, there will be things they can do that allow for privacy in a way that the served-based LLMs cannot.","Big Al says dogs can't look up.","We don't care about your business though. If you make unreasonable changes and demands for your products, we'll get them elsewhere.","So... do these people realize that this same train of thought could also be applied to something like say... a search engine?AI Image generator study existing images to learn patterns people want and recreate the patterns based on the person's input. Just because it learned patterns from a copyrighted image, doesn't mean it stole the image. The image is publicly accessible. It's not providing copies of the image, it's learning from it. Just like a person would who is studying art styles.What does a search engine do? Uses bots to scrape data from millions of websites, read them looking for specific patterns, and then produce a list of sites that match the pattern you're looking for when you search.Learning from someone else's work isn't violating copyright. A teenager creating art of their OC in the style of Akira Toriyama's DragonBall characters isn't violating any copyright. They weren't violating copyright by referencing the style by watching the series on TV as a kid.It's just technological advancement, which creative individuals always had the general opinion on that they couldn't be replaced by. The idea that a factory worker's job is eventually going to be replaced by a machine, so that's fine, but artwork/music/creative writing takes a human touch and can never be replaced. That fundamental belief is being shaken now.","If the tech industry treats this “data” with such wild disrespect, imagine how it treats your personal, financial, and health data.","Please let this lawsuit go though. It’s one of the last hopes to stop the automation of creativity. AI shouldn’t be allowed to steal from the people it’s going to put out of work.",""],"points":1107},{"text":["AI Needs So Much Power That Old Coal Plants Are Sticking Around","Gosh guess we better make it illegal for anyone but powerful corporations to use it","Oh look, just like cryptoBurning the planet for profit...AGAIN.","This isn’t even close to real AI. If we spend years or decades at this level hunting the next gain we’re going to choke our planet to death first.","I think I’m missing the connection here. I mean I want to be just as outraged as the next person but datacentres aren’t anywhere close to a leading cause of greenhouse gasses in the world. Seeing a large impact locally paints a grim picture but these datacentres service an incredibly large geographic area.Studies have been done on this and for the average person using an electric kettle to make tea every morning will output about 7x the CO2e as daily use of CharGPT. I work in healthcare and your average teaching hospital puts out about 1/5 as much GFGs as ChatGPT as an entire company worldwide. Or put differently, upgrade the steam boilers / AHUs in 6 hospitals and you’ll reduce as much carbon than if you shut down one of the world’s largest AI companies.","What about building new nuclear powerplans if not only Data Centres, but also EV pose the problem?","Paywall issue? Full text here: https://archive.is/spRaU","I don’t think I have seen a single post in this sub the endorses a new technology.ironic.png","Garbage in garbage out","Can we ask it how to solve this problem?","Really need a carbon tax so the government can afford to build more coal power plants"],"points":167},{"text":["Japan, U.S. agree on AI research for drones to assist new fighter jet","::crosses fingers:: Astro boy and Gundams please.","I seem to recall a movie about this","They really should watch STEALTH first… these days, whenever I read anything they are trying out with AI, it always resembles the plot of an early 2000s, late 90s action movie where exactly the thing they are trying goes wrong ;-) We‘re slowly going backwards too… LAWNMOWER MAN, we‘re coming.","I mean yall done watcht Terminal Emulator with Ai'rnold Shortszenega","Oh cool, Perun did that video about the future of fighter jets involving autonomous drones commanded by human beings, and it looks like this is exactly what's going on (or at least what government officials influenced by consultants want to go forwards on).","And just like that, human pilots are no longer needed. We now have Skynet.Not necessarily in any combat capability either .. given existing AF staffing woes, being able to completely automate all non-human non-tactical logistics flights would singlehandedly free up hundreds of pilots for actual combat missions which means the AF can massively decrease it's labor budget. In this case, the obvious choice would be for the new MQ-25 tanker. This is also how full auto planes come to American airports for Fedex, UPS and Amazon. Which will follow as by then, most airport ground vehicles will be completely self-driving AVs too. The only humans actually needed are the ones demanded by insurance companies.This problem is especially severe for smaller, non-american countries that can't afford a real human air force. Now, they'll just be able to buy one and be immediately able to challenge the US. Most of it will be sold by China, the arsenal against democracy.","Is this how the Tau start?","Drone, write my battle plan in the style of Dean Koontz. Drone, draw me a picture of a drone, looking cool, and add a second drone flying next to me.","At least they are sensor drones and not armed killing machines. In a world where self-driving car technology has a body count, I don’t want anything controlled by modern “AI” be armed.Granted, I wouldn’t want future AI to be armed either.","Let’s see. Conflict in Yemen, disagreements between China and US, near 2025, and mass research on drone fighters. Yep it’s gonna be like BO2"],"points":46},{"text":["Garry Tan, tech CEO & campaign donor, wishes death upon San Francisco politicians","Garry sure looks “Westside til he dies”.","Y Combinator fell off hard. Gave us Peter Thiel, Yuri Milner, Sam Altman and Garry Tan, no thanks man.","Tupac reference, if you didn’t know.","Must have been having a hard comedown off the Coke. LOL","His liquor cabinet is weak for a millionaire","I agree with his point about Peskin, but we need to be honest about something: we don't need to wish death, harm, or hurt upon Peskin. His alcohol habits are well documented.","Yes this will be blown out of proportion, but the scale of mismanagement of the board of supes in SF is outrageous, and Garry being involved with the community gets to see a lot of it first hand so has reasons to be angry.","Ah yes “Garry” I’m sure Tupac, child of the Black Panther Party, would love the tech bro malapropriation","I don’t even know why on on this track, y’all ain’t even on my level. I’m’a let my dev team ride on you bitches.","https://youtu.be/XASNM1XEQPs?si=6b9uyz3A8Dik7WwQ","\"MY MONEY MAKES THEM IRRELEVANT!\"","You are all supreme nerds if you don’t get the Tupac hit em up reference","The term moderate is dumb asf and misleading most of the time.","Give this man a medal the SF supes are some of the biggest clowns on the planet.If I had to deal with half the shit they pull like this guy I'd probably be exploding with rage too.","If you knew anything about Dean Preston, you'd understand","This is a Tupac parody.","what a snowflake","My 44 make sure all yall kids don’t grow","Isn’t dying slowly just living? Guy sucks at insults and threats.","Who doesn’t?","He’s not wishing death upon them. He’s wishing a slow death upon them.","Who doesn’t?","“Die slow motherfuckers”Doesn’t that mean he wants them to have a long Gand happy life ?-)","Please hire me!","Most normal vc brain","only a tech millionaire? maybe people will care when he's in the 3 comma club"],"points":352},{"text":["Entry-level GPU RAID card enables mind-bending storage speeds — 80 GB/s of throughput from eight SSDs with SupremeRAID SR-1001","No one cares, you need more than RAID now to be competitive in this space.If you aren’t a Vast Data killer you’re at a dead end.A gpu storage company Nyriad is up for sale because of this reasonTo add insult to injury, many non performance orientated solutions are going back to simple replication because it’s much simpler to manage at scale.","I don’t know what any of this means","What's a RAID?","Only hardware raid is good raid in an enterprise including a VmWare support. That’s why Broadcoms Megaraid is popular. Yes it is slower, but the convenience askpect of a hardware raid is king in the enterprise world.","Without pricing to compare options, this is all academic. Anyone who needs high data throughput and iops at a given scale will compare available hardware and select by value.","I never click on anything that says Mind Bending or jaw dropping."],"points":66},{"text":["Apple was just forced to crack open its App Store — but the changes are already being called 'hot garbage'","Nikita Bier, who founded businesses acquired by Discord and Meta, took aim at a new \"core technology fee\" being introduced by Apple. The fee means that apps sold from its App Store or third-party marketplaces will have to pay \"€0.50 for each first annual install per year over a 1 million threshold.\"Oh great, it's a watered-down version of the Unity fiasco.","Imagine that, a system created solely because the company was forced to sucks.laughs in VW electrify americaJoking aside, shitty move on Apple’s part, but I’m more surprised by the people who expected any different.","Apple constantly claims how iPhones and iPads are limited on the App Store as the only source for apps, for privacy and security reasons. That seems reasonable.  But then why does macOS allow sideloading since the beginning? Don't Mac users deserve the same level of privacy and security?I never understood why having an alternative was always seen bad in the Apple world. Just let the people download and use what they won't. If you don't want to install apps outside from the App Store, just don't; nobody is forcing you. If I want, I should have that ability. I paid for the device; it's mine and I should have the right to completely own it.","I have very little information about this but to those more informed, I have a question. So this is a result of the EU forcing apple to open up their walled garden and enable alternative app stores right? But if apple can still charge the alternative app stores money (an amount that they chose, no less) then this law is almost totally meaningless, no? Apple may as well say “sure you can create your own app store but you have to pay me 100 million dollars for every single user that you have” and they have disabled alternative app stores for all intents and purposes (which is essentially what is happening here). So my question is, what is the point of the EU creating this law if it is so meaningless? It looks more like a suggestion to me.","I've been an Android user for a long time, but the rest of my family use iPhones. I switched a couple years ago. For the most part I like it, I also have airpods and the ecosystem integration is very smooth. However, there are a few silly things that I hate. Primarily I hate not having the ability to have adblock on my browser. Browsing the unfiltered internet is horrible. Unless I can get real Firefox on my phone, I will be switching back to Android.","Tim looks jacked","Look at the biceps on this fuckin’ homeboy.","I say this a lot, but Apple has become the very same monolithic dystopian mega Corp they so embarrassingly claimed to fight against in the early 90's. It's gross that Apple products are so unnecessarily locked down like the world is going to end if people are allowed to customize them.","And people will blame the EU as opposed to apple with their hostile policies","Try developing on your own iPhone. Sorry, in order to access your own hardware you have to pay a sizeable protection fee to Apple. It is a racket.","When did Tim Cook get jacked","They were \"forced to\", yes.... but then they didn't actually do it at all. Yet.","Apple abusing the rules how much they can","I know it's unpopular to recognize anything positive about Epic Games, but their lawsuit got this ball rolling and finally put eyeballs on Apple's 30% cut and attempts to monopolize. It's not the first time, either. They went after Steam first, all while giving away a couple free games at a time while paying developers a better rate.","Most of this means fuck all to the majority of Apple users - particularly the youngest users, who use iPhone in larger numbers than any other in the U.S.","Apple is motivated to do the bare minimum, apple buyers don’t care so why should they. Only people who get upset about the AppStore is ironically enough android fans save for a few iPhone users.Edit: why are the idiot android nut eaters in here like google wouldnt do the exact same thing if they had a chance to?","You know what would force apple to do the right thing?If people stopped buying their shit.","Free but controlled by a major corporation is never free. It’s just a later opportunity for “finding revenue” from some idiot middle manager. That’s how Oracle seems to have lost the plot with Java.","Apple is forced to open their app-store and cut their take nearly by half... suddenly Apple is making it as painful as possible to go down that road. Color me shocked. I really don't understand the whole Apple mentality, apparently a lot of Apple users actively discriminate against non-apple users if they don't have the right color dot in chats? How bizarre to boast about being a corporate patsy.","I don’t think the EU will allow this, let’s wait and see.","Is it that time of the month again where redditors say they’re going to burn their iPhone and start giving out free blow jobs to android users?","lol People get so angry about phones they don’t own.It’s so insane.","Tim Cook’s forearms are amazing. How do I get forearms like that?","/r/maliciouscompliance","I don’t really care what any developer says. Developers aren’t so saintly. They do crappy things to users all the time. In fact they’ll do every horrible thing they can get away with if nobody bigger than an individual user does anything to stop them.","Did people really think Apple was going to take the garden and knock down the walls? Apple had plenty of time to read the laws and do whatever they could to follow the law while still maintaining their control of the App Store. They'll do whatever they can to be compliant while still being Apple. Apple will redefine malicious compliance to keep their business safe in the EU.","Apple is the king of malicious compliance.","So, apple is just letting it's greed take over completely now? You just know, that's going to another total win and trendsetter for the industry, like always. People are just too stupid to realize","Fuck the haters, the closed system of Apple works extremely well for the customers.You Don’t like don’t buy it, don’t develop apps for iOS….it is that simple. Why the fuck these folks that failed to build a compelling eco system based in Android, want Apple to change its successful model (successful for Apple and end customer).",""],"points":3530},{"text":["X wants to keep cluster of AI systems in Atlanta, receives $10M tax break","How about you e stop giving tax breaks for things companies were already going to do. Atlanta is a major backbone link into the internet with a metric crap load of dark fiber and connections to all the major cloud players. X twitter what ever or others who use connected modeling will seek this existing hubs. So way to give Elon free money for nothing.","That's $10M you get to come up with now.","Billionaires don't need tax breaks. Small businesses do.","It’s too bad cities all fall for the tax break trick. If they’d all just say no…..","It is called Twitter.","We should all scrape some of our income together to help a racist, shitbird propaganda cesspool build more energy sucking BS! /s","X is still paying taxes?","Why would you give take breaks to computer server systems. GPU cluster or otherwise.It’s not like a corporate headquarters that will bring in a bunch of jobs?Most of the tech workers that will use the system for their projects will be in SF or somewhere else.Is there any logic here.","Those clusters cost so much more than that to develop, build, and run.","God help us if Elon figures out a way to make ai speak bad of the left.","Nicely done Elon. Genius move!"],"points":226},{"text":["NASA invented wheels that never get punctured","Lol i think someone invented wheels that never puncture waaaay before anyone invented tires","Fast, light, puncture-proof.Choose any two.","This is old af","[removed]","I swear I see this article every 5 years","You guys wanna know why tires are so damn expensive???Inflation","chain armor and it's derivatives are very popular in the m'ladyverse","Can they also make hearts that don't break?Pls","Isn't this the same basic design as the one used in the Apollo missions?","https://i5.walmartimages.com/asr/8bd376c3-5ba6-4bd6-9c55-c8efad33fbd5.47fb0272e1c8b7f519d9c5a99ddf9806.jpeg","My first 20” bicycle had solid rubber tires that had no tube and so couldn’t be popped.Going from that to a more BMX-style 20” with standard tires because that’s what all my friends had was very frustrating — suddenly slamming my breaks to skid could cause my tires to rupture. Took a few tubes before I learned my lesson.","Tires, not wheels.","Already done: https://johnhartstudios.com/bc/2011/01/31/monday_january_31_2011/","Literally just saw this on shark tank lmao","I swear I’ve seen “tyres that can’t be punctured” headlines since the 90s…","Goodyear about to assassinate somebody","Tires?","Have they consider making them out of legos?","Amazing! Now release the copyright and designs so that the people who paid for this innovation, the u.s taxpayer, gets to use them! Oh, you’re just gonna give them to Lockheed Martin-cool I guess","I feel like I have seen pictures of these wheels for 14 years now and nobody cares","The average consumer will never see these tires because billions will be lost in the rubber industry. It’s part of why we don’t have wireless energy rn because JP Morgan had an invested interest in copper wire when Nikola Tesla pitched the idea of wireless power and all of uh sudden Nikola was a looney.","There has a few ones already but those are not made for roads or high speeds the reason why it's not on cars.","So when did wooden wheels get punctures back in the horse and carriage days?","I guess there is always something to improve, even for 6000 years old product.","First things humans do when they make a groundbreaking material:Can we use this for war?","I mean somebody else already invented the tweel. This isn’t some new groundbreaking invention.","They used piano wire to make the “tires” on the lunar rover. This is nothing new.","Michelin invented better ones some years ago.","What the hell is with all the depressed people in this comment section","[deleted]","Tweels aren’t new, they just haven’t hit market","Nickel and Titanium. Why not mix in some platinum to use even more rare and expensive materials? Stud it with diamond, too. I heard they are hard. Should make for some better grip on ice. 😂","Nickel-titanium memory alloys? No way is this within my budget but I'd try it.","More info at https://www.smarttirecompany.com/","Hmmm. Looks like NASA got the jump on NASAhttps://en.wikipedia.org/wiki/Lunar_Roving_Vehicle","And left them on the moon.","I guess you will still need to replace treads? I can't see not needing good treads.","Long time ago buddy","This is so old goddam","Where can you even drive that bs . Stop posting this nonsense","Also, the sky is blue","Surprised this is just now being invented tbh","No punctures and no grip. Can you imagine trying to corner with them?","Good luck stopping","Is this news?","This seems like the 20th time they have created non puncturable tires, either that or this is old","Old news and they can go like 6km/h","That was surprisingly informative. I did not know about the bicycle tires.","They invented them many years ago. The real news is now you can buy them.They are not 'Wear proof' though, so may not be cost-effective.","The twist? They are made of pudding! WoW!!!","this is old news from years ago?","Great ..but will it fold up like the rover …","That’s so cool","Typically wheels have always been resistant to puncture … it’s the TIRES that are usually the problem.And no, NASA did not invent puncture proof tires.","We’ve had wheels that never get punctured for millennia?","Bruh unpuncturable wheels have been around for a long time, what the f do u think they got on chariots in Rome, Michellin?","I’ll believe it when it gets put on my car","I wonder how well these would perform at high speed. As well as how much they might damage roads.","NASA, wooden wheels want to have a word with you.","Yet we have to buy rubber tires that pollute constantly. Because some fat asshole wants to keep making money.","My forklift has these!"],"points":1907},{"text":["China’s Record Solar Additions in 2023 Top Entire U.S. Solar Capacity","Of course they are installing more. It is becoming the cheapest option by far, and they need more power. We should subsidize our production here with bonuses for improvements and decreasing cost.","Union electrician in a big market here that mostly does infrastructure (transportation) work, solar work has typically been going non union due to how much cheaper they are but from my perspective that has started to change. We picked up a lot of major solar jobs going into next year and it seems to be driven from issues the customers had with poor installation leading to fires. If the fire department shows up to a warehouse on fire and there is uninterruptible DC power, they are gonna let that thing burn to the ground. Seems it's cheaper to mitigate a fire by not selecting the lowest bidder. Both union and non shops that command a higher price with more experienced/more expensive workers now seem to be a lot more competitive when customers realize that there's a lot more solar than just plugging in an inverter.","China installed a record-high solar power capacity last year, with additions in 2023 alone topping the current capacity of the entire U.S. solar fleet.China added as much as 216.9 gigawatts (GW) of solar power capacity in 2023 – a record high, obliterating its previous record of 87.4 GW of solar power additions 2022, according to data from the National Energy Administration cited by Bloomberg.","40% of this years GDP growth in China was accounted for by the 'clean energy' sector. That is to say, renewables, batteries, ev's etc.China is aiming to make renewables the new oil. That is to say the driving force for growing the economy just like oil & gas used to be.Analysis: Clean energy was top driver of China’s economic growth in 2023https://www.carbonbrief.org/analysis-clean-energy-was-top-driver-of-chinas-economic-growth-in-2023/","this is what happens when we stopped the subsidies and focus on oil and gas. we should have been full speed ahead on this.","Thats awesome, go China!","China's ahead of the rest of the world in just about every way these days, and light years ahead of the US..","Can we start copying some ideas from the largest society on Earth or are we going to continue shoving our heads into the debt while screaming \"Lalalalal Freedom Lalalalal?\"","China will always produce more energy in any form. They have a billion people.","And to make it worse the USA is about to elect the \"anti-science\" party for another 4 years.","They also have the world record for most amount of coal fired power plants and increasing them at an unprecedented rate.But everyone wants to get lost in the “China good solar the best”Still one of the worlds largest emitter of co2 and pollution and that has absolutely no signs of slowing.","Maybe they will burn less coal","As they build more coal burning 🔥 power plants 😂😂😂😂😂😂","Coal Consumption by Country(World Share)1 China 50.5%2 India 11.3%3 United States 8.5%Global Pollution Contribution by Country1 China 30%2 United States 15%3 India 7%China also sits nearly at the top for highest air pollution. Countries like the UK and US meanwhile have air particulate concentrations 1/10th China's.Its nice that any country is investing in renewable infrastructure. China will need to increase their investment an order of magnitude greater if they plan to outpace the harm they're doing to the planet and their people however.","Good for them. Now if they'd fix their whole human rights problems I might actually respect them as a country.","Hopefully they don't end up in landfills like their ebikes.","So they installed ~2.7 times as much solar as we did but they’re ~4.5 times bigger in population than us. Sounds like they’re a bit behind in terms of proportionality of solar power. Not mention they have much more factory’s to power. This headline made it seem like they’re strides ahead of us but that’s just not true, China releases more Co2 per capita than the US, I hope we can keep up the competition though let’s get us both to net zero ahead of schedule!","How much can we trust china's numbers?I know they had a bad reputation for fudging numbers, not sure if they still do.In this case I'd imagine it's quite easy to verify with satellite imagery?","The real test is if they are still all working in 5-10 years time. If it does, kudos to them, but they kind of have a track record.","China just uses a crap-ton of energy and is the worlds largest polluter. They also use half the worlds capacity of coal and approved 50 Gigawatts of new coal energy in 2023. https://oilprice.com/Energy/Coal/China-Has-Approved-More-Than-50-Gigawatts-Of-New-Coal-Power.html basically nothing the world does in terms of green energy replacing fossil fuel means anything with China on the block.","Now show us their carbon emission in 2023.","Their new coal plants top the US, too. They're building and financing coal plants all over the world"],"points":526}]