[{"text":["DNA particles that mimic viruses hold promise as vaccines","I can just imagine the REEEEE from the usual suspects if this becomes commercially available.","This article doesn’t link to the original paper. That’s disappointing. As it stands, unclear how the dna is delivered and picked up by the B cells."],"points":6},{"text":["RTX CHIMERA new microwave fries drone target during White Sands testing | Throughout a three-week field test, Raytheon's CHIMERA high-powered microwave system managed to fry static targets and track aerial targets flawlessly.","I saw RTX CHIMERA and was like “oooh new Nvidia card eh?”","Interesting how this technology will play out. I knew things like this system would begin rolling out around the world especially after seeing the effects of extremely low budget drones in recent conflicts. Watching a couple 100 dollar drones drop bombs on multi-million dollar top of the line military equipment and rendering said extremely expensive modern equipment useless in Ukraine and the Middle East has been a huge eye opener for weapons manufacturers around the globe, I’m sure. Cheap drones without effective countermeasures will render many armored and naval assets effectively useless or a liability. Especially in wars of attrition or when a high budget military fights guerrilla wars against opponents with access to these cheap effective drones","Bonus: it also cooks MREs in two seconds.","never fuck with raytheon","All I saw was “microwave fries” and got excited that scientists had discovered how to keep them crispy","The real issue was going to be keeping it from getting destroyed. If I can shoot out a couple times and fuck it up, well then that fob becomes open to drones. And it’s not like these are gonna be easily replaceable.","Hmmm, I always heard this technology development was touchy. Pointing high intensity microwaves at the sky literally puts satellites at risk too. That was an old research article I read though so I wonder what changed.","“Mate, that thing is a one way ticket to the astral planes...but it feels like you've got two tickets.”","What would it do to a human?","Raytheon calls. Got it.","Finally. We can start taking down all those ‘birds’.","Can you use it to heat the surface of your skin instead of an inefficient home heater?","I wonder how long we’ve had this and if it can be used for against nuclear weapons. Would be nice to not have to worry about that.","StarCraft wars coming 2025","I’m curious as to how many drones it can deal with at a time. How hard is it to overwhelm?","What does this have to do with Thrawn?","Lasers, Masers, GRasers and Xasers!"],"points":108},{"text":["Researchers developed a battery-free sensor that reacts to sound waves, producing vibrational energy to power an electronic device | The novel sensor would not only reduce battery waste but could also power medical devices like cochlear implants or monitor buildings for faults.","Finally, technology that works better when you yell at it.","The Navy has been using sound powered phones for a century now. They’re used in case of power failure.","Anonymous Russian Inventor joins the conversation.The Thing, also known as the Great Seal bug, was one of the first covert listening devices (or \"bugs\") to use passive techniques to transmit an audio signal. It was concealed inside a gift given by the Soviet Union to W. Averell Harriman, the United States Ambassador to the Soviet Union, on August 4, 1945. (Wikipedia)","This article doesn’t mention how much energy it generates, or did I miss it?","This is a joke, right?","The “microphone” is invented 1877","Been around for years along with bioelectric pickup to run devises, hybrids work best in these cases.Just saying.N. S","That technology will be \"bought out\" and the patent buried in a sealed vault","Is it just me or is that a crazy compliant mechanism in the centerEdit: whatever it is, that bit seems important in the article. Looks just like a compliant hinge or something.","Tesla had this theory written down and the fbi confiscated them after his death. I’ve heard","So all those crazy meditational gurus were right all along, vibrational energy! Now they can link all this articles to support their evidences.","Would it be possible to create a “perpetual motion” machine with this? Scream into it to get it started and have it hooked to a speaker that can continuously make noise that feeds back into the system?","Is this how the Egyptians built the pyramids?","Where to place it???","Sweet we hear about new battery tech every week. Never seen anything new outside of fast charging and cordless","The first obvious application that springs to my mind wasn't mentioned in the article: wake words for home automation systems that don't require the microphone to be listening all the time. I'm not sure the big tech companies will see the appeal of that though...","the Thing, 1945https://en.wikipedia.org/wiki/The_Thing_(listening_device)","Isn't that just a piezoelectric? We've had those for a long ass time.","Minecraft is doing it first lol","Put them in Taco Bell bathrooms and the energy crisis is solved","Truly research with a positive vibe.","It’s an ancient technique. Long ago musical sounds were imperative to opening doors."],"points":84}]