[{"text":["Secure one-way Video feed Protocol","MPEG-TS over UDP, push style?"],"points":0},{"text":["The state of New York is suing Citibank, alleging it failed to protect customers against scams and hacks that netted millions.","I guess I’ll go first, fuck that bank if it’s true they intentionally make red tape to make it hard for customers to put in claims and just deny all of them after they worked so hard to try and get their money back."],"points":1},{"text":["Ars Technica used in malware campaign with never-before-seen obfuscation","Lol, anyone else read the article. And then realize the pizza image is there. And think.... 🤔","A benign image of a pizza was uploaded to a third-party website and was then linked with a URL pasted into the “about” page of a registered Ars user. Buried in that URL was a string of characters that appeared to be random—but were actually a payload. The campaign also targeted the video-sharing site Vimeo, where a benign video was uploaded and a malicious string was included in the video description. The string was generated using a technique known as Base 64 encoding. Base 64 converts text into a printable ASCII string format to represent binary data. Devices already infected with the first-stage malware used in the campaign automatically retrieved these strings and installed the second stage.The image posted on Ars appeared in the about profile of a user who created an account on November 23. An Ars representative said the photo, showing a pizza and captioned “I love pizza,” was removed by Ars staff on December 16 after being tipped off by email from an unknown party. The Ars profile used an embedded URL that pointed to the image, which was automatically populated into the about page. The malicious base 64 encoding appeared immediately following the legitimate part of the URL. The string didn’t generate any errors or prevent the page from loading.Opening the same file in a hex editor—a tool for analyzing and forensically investigating binary files—showed that a combination of tabs, spaces, and new lines were arranged in a way that encoded executable code. Like the technique involving Ars and Vimeo, the use of such a file is something the Mandiant researchers had never seen before. Previously, UNC4990 used GitHub and GitLab.The initial stage of the malware was transmitted by infected USB drives. The drives installed a payload Mandiant has dubbed explorerps1. Infected devices then automatically reached out to either the malicious text file or else to the URL posted on Ars or the video posted to Vimeo. The base 64 strings in the image URL or video description, in turn, caused the malware to contact a site hosting the second stage. The second stage of the malware, tracked as Emptyspace, continuously polled a command-and-control server that, when instructed, would download and execute a third stage.","I don’t understand what the big deal is. How is this any different from putting the base64-encoded binary on the about page itself as text? Or embedding the string in the image data itself? What’s special about putting it in an unused URL field?","Jesus.","This is not a unique attack. Stuff similar to this has been working for years. Malware calls out to reddit post to grab b64 instructions, then to YouTube comments to grab half the code, then a personal profile somewhere else to grab the other half of the code. On and on. You can get pretty creative with things.Now, if you are saying a pizza picture is the unique part, I'm with you. I'm not sure how many malware devs have used pictures of pizza in their campaign.","Cool, but I feel like they used to do this with images on Twitter too.","Uh, base64 is a technique and using it is totally new for distributing payloads?I am confused.","Well, that was seen before.I guess the unique thing is that they used ars technica instead of other legitimate sites? Either way, still pretty common","Surprised they got a reply back to the anonymous email. Emails were sent to their staff they take on Google related news, and not even a response back on a huge story.Gutless cowards, they won’t touch anything that may bring heat to their journalism.","Never before seen? The campaign just uses base64 string stored somewhere on a website.How is this any different to malware that has c2 comms over twitter or pastebin"],"points":129},{"text":["Compromise rates for phishing sims"],"points":0},{"text":["SMS Phishing / Data Scraping?"],"points":0},{"text":["Security pros are being hospitalized by after-effects of ransomware hacks","Why does this link to a reddit post that links to a website? Is this a bot?","I can’t believe it we had an attack in 2019 and it was so stressful I nearly just walked out the door and never came back","I say if you are not a true IT/security veteran unless you need to the emergency room for work related stress.","No shit."],"points":20},{"text":["How does your team measure success?","We work in two week sprints, as do most other departments in the company. We follow them up with a sprint review on the stories worked on, the experience from all stakeholders, and what can be improved. It's hard to measure \"how well we did at making things secure\" but constant discussion on ongoing projects and operations is how we all stay on the same page.","SLA’s","Do a risk assessment, quantify / qualify monetary value of each cyber risks relative to data you are trying to protect, then create metrics around : simulated phishing stats, incident reports , security events addressed, look at your email filters and EDR, IPS, IDP, SIEM dashboards and find meaningful close calls and graph that.TLDR; (a) monetarily quantify risk (b) quantify progress / efficacy of risk mitigation thru various metrics"],"points":1},{"text":["CyberSec or Software?"],"points":0},{"text":["C++ or Python?","C++ offers more control over system resources and hardware, similar to how lower OSI layers offer finer network control. Python excels in rapid development and automation, like higher OSI layers focus on application-level tasks. For deep system interaction and custom malware development, C++ is more suitable.Since you're considering selling your creations, dig deep with C++","Both... no reason to 'specialize' in one language or another..."],"points":14},{"text":["Do you disable Antivirus for your Admins before they install updates / applications?","But only IF you can confirm the AV is causing an issue with installation and only IF you download the file from the vendor's website and not a third-party. But usually, if there is an issue with the approved software, one can write an exception for it to move forward.","SolarWind ... ransomware virus from trusted 3:rd party ... a false positive that turns out to be a true positive ... so no?","If it's going to blow up due to AV, I want to watch it happen so it can be documented and designed around. Can't do that if things get turned off every time.","My mindset as to why we do NOT allow it is because, yes, we want to be aware of what is being blocked and what we can do to fix it. Also, the risk factor of a targeted attack. I can see it now where we disable the AV and App-locker, then the file is downloaded directly from the internet, and it happens to be malicious and there is nothing in place that scanned the file. I just feel it is a very old-school mentality, IMO."],"points":13},{"text":["Any CyberSecurity program/products that are open-source that I can contribute to?","Look at open source tools on Github such as:https://github.com/cyberguideme/ToolsNote: Not all of the tools listed are on Github but a lot them are."],"points":0},{"text":["DDoS protection solutions","Imo the thing cloudflare does best is absorb DDoS, it's pretty impressive","Cloudflare and Akamai are the industry leaders for vendor solutions. You’ll be paying for their services but think of it more as an insurance premium rather than a tool cost. Everyone pays into it all the time and it’s there for you when you need it. You might be able to use a self hosted system but know that it’ll be able to take less of a beating than a vendor would plus you have to have someone who can manage and run the system.","I guess the question is what is the cost/lost business for every hour you are down if there is a DDoS attack, vs the cost of the service.","Threat Actors have infinitely more resources than you do. Your on-prem infrastructure will never be able to absorb a real attack.Front your apps with a cloud-based solution such as Cloudflare, Akamai, Silverline, etc.","It might also be worth exploring with your ISP. I know our AT&T services resold/packaged Radware's DDoS service when we upgraded our service.","CloudFlare. No one does DDoS better than them.My clients all use their services, and my 2 web sites are behind it. It handles full end to end encryption and SSL. It does my DNS and managed my records.It offers full HSTS and a whole bunch of other really awesome features.Most importantly, it just works. And it's totally free!","I worked for an IT Director who put his foot down and said DDoS is not a security team problem, it's a network team problem, and I agree with him in that stance.But yea, Cloudflare is the right step.","Well Availabilty is definetly a Secuity Problem.DDoS protection is mostly expensive.It depends on your Threat Model.1) You get a scrub provider if you have large Address space and your own Address Space and people can *somehow figure out your address space and target jt directly. Very expensive.2) If you have a few sites, generally is cheaper to buy CloudFare or Imperva or Akamai and put in front, and prevent leakage of your source IPs. I think cloudfare is relatively cheap for this scenario.3) Never buy on site protection, they only work in tandem as a trigger mechanism to Scrubbing.What are you protecting? What do u call sites? Websites or Offices with Internet Access?If websites why not host in AWS and make it AWS problem?"],"points":29},{"text":["Proofpoint splitting quarantined emails that are sent to two or more recipients. Any idea how to resolve this ?","Talk to support."],"points":0},{"text":["What paravirtualization interface should i use?","Go ask in Sysadmin or general IT sub. Why is the questions so often off topic on this sub."],"points":1},{"text":["Am I crazy?","To start I would say that your pay is too low for your current role. The Bureau of Labor and Statistics have your median income for that position at 85k. Now only being there two years may have a negative affect on that, but location wise I feel you should be slightly higher based on cost of living.I can see there being a disconnect from a hiring managers perspective on your position and transitioning into anything cyber. Jobs including networking and admin roles are going to want proven experience and I'm starting to see a lot of hires that have previous experience with someone in the company (old coworkers etc). I could see RMF being a good segue for you, potentially even something in the compliance sector. Especially for a healthcare organization. I currently work for a Healthcare Manufacture and they recently doubled the compliance team to keep up with the workload.Maybe look into certifications for specific software suites that deal with vast amounts of data. Getting good at using those can show as a solid skill if you are looking for more of a technical role.","Nope. The job market for this field is FUCKED right now and they are hiring the extremely experienced and certified people at extremely low salaries. Many companies dumped lots of staff and moved departments overseas (looking at you, crowdstrike) and it's not improving anytime soon. Maybe shoot for an MSP job and keep trying.It's never been this bad before and companies couldn't care less. Keep your chin up.","What jobs are you applying for?"],"points":3},{"text":["Cal state Long Beach"],"points":0},{"text":["Empowering The Visually Impaired In Cybersecurity (Short Documentary)"],"points":0},{"text":["DMCA abuse to censor content","You might reach out to TechDirt...they cover these kinds of stories fairly often and have had to fight a lot of bogus claims.","An alternate grey/blackhat solution would be to move to a hosting company who outright ignores DMCA complaints.Commonly known as a bulletproof hosting provider."],"points":3},{"text":["Pentest Company Recommendations","Full disclosure, I work for TrustedSec. A bunch of our peers are top notch, Black Hills infosec is fantastic, Red Siege and Lares as well.If you specifically what type I might be able to provide more nuanced recommendations.","Black Hills InfoSec, CrowdStrike, NCC group","FRSecure based out of Minnesota","CrowdStrike, Ridgebot, and quite a bit more.Sorry for not expanding on this. When it comes to Ridgebot, they are AI based Pentesting that finds the vulnerability and then exploits it. Relatively cheap.CrowdStrike has many different options. They typically get as close to possible as the adversaries that would be targeting your organization or vertical.","We were impressed with CBI","Bishop fox","https://www.blackhillsinfosec.com they are fantastic, if you check their YouTube channel they post tons of free ideas and usually have monthly webinars. You get more of a personal feel here since they aren't some giant crowd strike type company. The owner John is always reaching out to the community trying to give ideas out for the cybersecurity world. He definetly gets my respect for how he built that place.","I like Trustwave and Third Wave Innovations. If you reach out to both/either, tell them CloudHound sent you.","Rapid7 had a good review on here recently","I have several partners I can recommend, happy to share any recommendations! Would just need to know scope and what you're looking for to point you to the right ones.","Edgescan","LOL free advertising post.","Some MSSPs can be just as comprehensive as known Pentesting companies and cheaper.","Throwing our hat in the ring for consideration.We're a small team, but we've been building up a reputation for really high quality work on the penetration testing side the last couple of years.https://glitchsecure.com/about/","Are you looking for anything in particular in your test or is it just for compliance purposes. Some testers can embed into your team to support with dev advice or raising tickets. I'd be mad if I didn't try to promote my own company system-secure.co.uk We specialise mainly in infrastructure testing on behalf of MSPs and can do it at a lower rate to app testing, but we do all things really. If in doubt; ask for a sample test report to see if you like the kind of remediation advice.","Drop me a DM","Https://Cyberteq.com","Make sure SOW is very well defined. I have seen some pen test companies were doing just the vuln scan.","Canary Trap, App-Check, Appalachiatech if your looking for smaller players that do a good job.","Do you need an internal/external infrastructure pen test or are you looking for application specific pentesting?","Don’t use trustedsec they stole code.","SpecterOps, Red Siege, or TrustedSec. I had a terrible experience with Black Hills, very unprofessional, but they do a lot for the community.","NetSPI is very good. Nice platform, has remediation tips and project management built in.","Forward Security https://forwardsecurity.com/","Take a look at Echeloncyber.com. It’s a Cybersecurity firm out of PA, with a rocking group of guys. Their OffSec team does fantastic work, is incredibly detail-oriented and in my experience, their reports are the complete opposite of the typical cookie-cutter ones that most larger firms put out.","NetSPI is amazing.","Full disclosure - I work at FRSecure, not as a pen tester but as a consultant. Nothing but great things to say about our team. Black Hills would be my second recommendation.Both organizations do a great job supporting/giving back to the community.","https://Packetlabs.net"],"points":36},{"text":["Any solid alternative to Veracode? It's been a terrible user experience","I've found that Veracode consistently overpromises and underdelivers. I also saw that the company itself is going through high turnover and a lack of employee retention. That's no surprise given their product is so shit.","Veracode is a SAST, SCA and DAST, plenty of other vendors.For SAST and SCA, Snyk, Synopsys, Mend, CheckmarxFor DAST Invicti, StackHawk, BrightThere's tons more vendors in the space, go do your due diligence based off your tech stack, none of the vendors are a cure all, all have their own issues","How about Prismacloud?","What exactly sucks about it?","Fortify On Demand is an upgraded Veracode. Had much better experience and performance with them.All commercial SASTs are kind of the same though.","We just decided to go with Checkmarx after evaluating Veracode, Synapsys, Snyk, Contrast, and Checkmarx. It just fit the bill overall with its integrated platform and developer experience. Wouldn't mind Contrast for RASP if I can swing it though.","Not an alternative per-se, but we've been considering something like salt security. Think of it as an IDS for your APIs. Never seen anything more than a demo but it seems promising. Primarily b/c we've run into the same issue - nothing fits the bill for DAST that I've seen thus far."],"points":10},{"text":["UAC-0050 new campaign details"],"points":0},{"text":["Corso di CyberSecurity... mi consigliate che pc acquistare?","ciao, innanzitutto ti consiglio di scrivere in inglese in questo reddit dato che non è solo italianoPotresti avere qualche problema di compatibilità con i sistemi usati durante il corso se hai un sistema operativo troppo MacOS troppo obsoleto.. ad esempio, io ho Mojave ed ho qualche problemino con VSCode, VMWare, Packet Tracer ed altri. Ti consiglierei di chiedere a chi tiene il corso quali software verranno utilizzati, e verificare se funzionano con il tuo attuale sistema operativo.In alternativa, installa una partizione windows con il bootcamp di mac, non è proprio il massimo come performance, ma probabilmente avresti meno problemi di compatibilità con una versione aggiornata di windows (mac non lo potresti aggiornare per limiti imposti dalla grande mela e dall'hardware associato)se proprio devi prendere un nuovo laptop... penso che thinkpad è la scelta migliore!","Howdy,I currently use a 2013 Mac for my University courses so I’d gamble that your system is fine for a course. If your worried though, it honestly might not be a bad idea to transfer all your files and programs on your computer to a separate hard drive and run a factory reset to give the old Mac a fresh start."],"points":3},{"text":["Masked Application Attack Walkthrough"],"points":0},{"text":["What Vulnerability scanner would be best, Tenable IO(Nessus) vs Microsoft Defender for vulnerability management?","Is Defender going to do external scans? Will it cover your network hardware? What about any other appliances or hardware you may have(UPS, printers etc.)?You're going to get better coverage from Tenable.","If you are all Windows house and small, go with Defender.Its only when you introduce AWS, Linux, or macOS into the mix or get to any significant size that it is monumentally stupid to stay using Defender anything as there are much better products that cover all those.","Definitely consider reporting when evaluating. Tenable out of the box is a disaster for reporting issues to asset owners without a lot of massaging of data. MS may not be better, but it's worth vetting reporting as, sooner or later, you will need reporting to motivate some silo to patch their sh&*","Tenable is the gold standard, my company just bought a license and I'm happily configuring it this week.","Only benefit to defender is the cost.Only benefit to any Microsoft product is the cost.","I have deployed and used them all. Qualys with a Hybrid deployment of agents and cloud is the answer.","I regularly have issues with Tenable.IO and have been eager to find an alternative.I've tried to deploy Tenable agents to all of our assets, of which Tenable would regularly find maybe 10-15 despite them all being deployed in accordance with documentation.When that didn't work, fell back on the traditional IP Range scans, of which Tenable.IO is able to scan roughly 50-70% of our deployments (around 400 workstations) within a 8 Hour time Window.We run into the issue where by the time the Tenable scan is able to scan some of the IP ranges, the workstaitons are no longer online as the user has left for the day, or dropped from VPN.To try and reduce this, we've adopted some segmentation to ensure Tenable scans are narrowly focused. Setup new target groups, IP ranges, and dedicated Tenable on-prem scanners, and at best, I still only get around 70% coverage.Ready to rip it out because it's far from giving me the full picture- however I need something that ensures coverage of network devices and non-Windows devices as well.","I haven't been able to find any good data on the coverage of the MS solution, but Tenable is very transparent about their coverage as you can see from their plugins site.Don't get hung up on the raw number of plugins as some of those don't' equate 1:1 with a CVE, but as you look you'll see they cover a lot of ground and are very quick to release new ones.I've used Tenable quite a bit, worked for an MSSP who used them and I worked for Tenable for a few years. I'm glad we use them now where we're covering something like 90K assets using the agent as well as traditional scans.","MS defender is just dreadful, they can't even detect Windows own CVEs last time I checked 😅","Tenable.io is really expensive, a single license of nessus is usually like less then $2k. If you're price sensitive I would look at the plain on prem nessus license.","Vulnerability Management is already part of Defender for Endpoint. Why not check it out if you have it deployed already?","Tenable's value add is the way they present the data. There's a lot more in the way of prebaked reports and dashboards to give you useful or actionable information. My experience with Defender's VM is that it's just a dump of all vulns, and a lot of false positives at that. It seems to be okay for enrichment of EDR incidents, but not a good standalone solution for Vulnerability Management.","In short, you need both","Our MSP runs Nessus on a regular basis against our network for web services, general vulns, our posture from outside and some AD things.Gives me some nice hints on which ports to close or which services to patch or severely limit accessibility for endpoints.Defender is basically free with our Business Premium subscription. So why not look at that dash once in a while too, might learn a thing or two.","Darktrace is up there. They do a great job of prioritizing vulnerabilities not just telling you and having you sort through them","I absolutely hate doing anything in M365 security. It’s painful.How many browser tabs do I need before it takes me where I need to go?What do you mean I have to ask MS for permission to whitelist something?Has someone changed my permissions? Yes it was Microsoft.It takes up to how many days for a change to take effect?How many support tickets have we had open forever or unanswered?I have this on the tenant allow list and it’s still getting quarantined?How many account managers will we have to go through to get tickets answered? As many as it takes until you get a North American one.If I were you I’d get budget for better tools (if you can). I’d recommend Tenable or Qualys for vulnerability management. Qualys has better search capabilities than Tenable and I haven’t found it to be inaccurate.We on-boarded M365 security and it was immediately clear during testing that we’d still need other products to fill in for its failures. It’s just not there yet to compete with the long term players.","Given Microsoft’s history of not being transparent I would def not trust them to be a check against vulnerabilities against their own platform.","Did you consider tanium?"],"points":81},{"text":["Does this feeling go away?","You deserve it brother. Stay positive in this economy and reap the benefits of your labor! Everything else will sort itself out.","Focus on what you can control. Continue doing well at work and grow your rainy day fund.","Under most circumstances, the people that hired you, promoted you knew what they are doing. Unless they have no idea what they are doing, you should have some faith in their abilities to ascertain whether you were, are, and will continue to be competent.Aside from that, it’s more luck than anything else. But then, everyone is in the same boat in that regard.","Imposter syndrome is real, but all the good ones have it. It makes you real and keeps you humble. Good luck. Go kill it :)","You’re feeling something called imposter syndrome and you’re definitely not alone. Be proud of your accomplishments and don’t worry about losing it all. Just getting to the point you’re at proves you’re capable of it and that will show on your resume and through your experience. If you lose this job for whatever reason, you’ll be hire-able elsewhere. Look online for other advice on dealing with imposter syndrome as well.","Great accomplishment man. I'm finally doing this at 38. I've been working my tail off, hopefully it'll pay off like your scenario did.","Keep working hard like you are and there will never be a reason why you won’t deserve anything but more!","Nothing but kudos to you man.","Similar situation for me.  Dream job, got promoted 6 months in, great team, more than happy with my compensation and likely getting a raise in the next few months.   Getting good reviews, my team seems really happy with me, hitting all our KPIs, and still I wonder.It's often referred to as imposter's syndrome.  It's pretty common in my experience.   The biggest mistake I think people like us make is not asking for help when needed.  The insecure little voice in our head tells us we should be able to handle everything that comes out way.  Don't be afraid to ask for help when you need it.","To placate your concerns, don't adjust your spending or lifestyle until you feel completely confident that you're at the level.Some contractors get their first gig on a great day rate and go and get finance on the new car or whatever, not realising that the contractor life sometimes means periods without work.When you're in your groove, built up a network and are confident, then you can start adjusting how you live.","100% normal, took almost 3 years for this feeling to fade. Still comes back some times.","Awwww I’m proud of you! I love reading stuff like this. Keep it up internet friend 🦋","Continue doing well and the opportunities will always be there. I’m an expert in a different industry and when I first got to a great spot, I couldn’t believe my luck, and likewise thought it may slip through my fingers, but nope, years later, I’m known in my field and respected, so it’s even easier to make more money. Take deep breaths and keep crushing it","Don’t worry a layoff might humble you soon, hopefully not though","If they're hiring, lmk? The market is absolutely dead right now! Yeah, I goes away after they pile on a crap ton of work on you and you start to feel burnout. SOC folks have the highest burnout rates next to MSP people.","Keep doing what you're doing and grow your rainy day fund like the other user said. That may give you the peace of mind you need. If you're valuable to the team, no one would want to lose you. Hard work pays off! Congrats mann. Really good job!","This is what I needed. As someone who’s about 30 and wanting to get into cybersecurity I’m worried that I’m either too late or will never be successful in this field. I never went to college and am hoping to start this fall but all I’ve seen lately is the negative aspect of this field.","Flex 💪","I feel the same way and my story is similar to yours.","I hope I can follow your footsteps man","You are cool. Most people see themselves as entitled to something, while you - who actually deserves it -, are humble.You should be proud of yourself."],"points":84},{"text":["Conferences and online infosec communities for networking"],"points":0},{"text":["Daily security rant. Anyone?","\"Busy people with crucial jobs like yours are especially attractive to criminals due to the sensitive data you process. Please take it as a compliment that it's so important for you to complete security awareness training.\"","I know you're just ranting and maybe not expecting a suggestion on solution, but I have dealt with this a lot at my company (which used to be small but is getting closer to medium-sized) and the answer was creating policy documents that users agree to on their first day of work. This allows me to be a bit dismissive and short with people that complain on stuff like this, I can simply say \"you and everyone else in the company agreed to the Information Security Policy. This includes phishing testing, annual training, proper device usage, etc.\" Gets them to shut up pretty quickly :)","Our knowb4 is set to 11. As a result quite a few legit HR emails get ignored.","the average user doesnt see any value in any interruptions due to security. just the way it is. none of it really surprises me anymore","I love when people try to explain that they're so busy they can't do something that would take them maybe 30 seconds a month. People use excuses for things like that sometimes like a quick response to an email or anything that's really fast. I'm sorry but no one is that busy. If you're that busy you're doing something wrong.","AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAGGHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH","I'm realizing this is the reality of the tech industryI got into tech cuz I'm introverted and didn't want to deal with people but proper communication is the most important part of the job 😂 fuck","If it's an Executive, they'd have to sign an Accepted Risk spelling out why we do these tests and the potential harm that could occur if we don't do it.Otherwise, I'll tell them it's required and if they want to escalate it, they'll need to bring their manager in on the conversation. That's when I'll pull out the talk about \"You heard about Colonial Pipeline being hacked, which shut down the gasoline supply to much of the east coast? That was due to someone clicking a link in a phishing email. We send these tests to be sure you know what to do when you see a suspicious email. Consider it practice. I know I don't want to be the one responsible for getting our company on the national news.","I'm asking because I genuinely don't know, is security training effective at preventing security breaches? How effective is it?","My monocle is still popping, won't stay in at all.Glad your sense of humor remains intact, take my upvote ma'am/sir.","I had a funny little related incident happen recently.I was reviewing a fix to some code for a web application; the fix in question was tied to social media (i.e. clicking the Twitter icon on the web page should redirect the user to the company's Twitter account).Later in the day, I received a message saying something to the effect of my use of social media on company device(s) has been logged and forwarded to management (\"click here for more details\"). Figuring this was tied to the above-mentioned web app fix review, I forwarded that message along to my manager, with context and the JIRA ticket attached explaining why this had probably been triggered.It turns out the message was one of those phishing training emails that had coincidentally been timed/themed. While I didn't follow-up by clicking on the link, my manager did when they received the email I forwarded. We both had a good chuckle; then when they had to do the follow-up security training, I figured I should as well in solidarity.Training benefits everyone.","“Now I’m just gunna phish you harder”","How about sending her an email from a suspicious looking domain, saying \"Please click on this link to opt out of security training.\"","I always enjoyed receiving those Executive Opt Out of the email phishing test requests. We had Executive support to deny them and we did. We also never told anyone when the test would occur. It makes no sense to exclude, or notify in advance, anyone, especially the top level executives. Those accounts, if breached could inflict immediate and widespread damage to the company. The more power a person had within the company or more access the person had, especially to intellectual property or infrastructure/systems, the more they needed to be truly tested and made aware of the potential attack/threat vector.","I’m the opposite of that user, LOL. I love getting practice phishing emails. My employer sends one a month, I’ve noticed, and we get immediate feedback showing whether the email we reported was a fake phishing attempt. I don’t want to become complacent when it comes to emails and clicking links—and you’re right, when people are busy and not quite paying attention, that’s when phishing emails can do some damage. So take heart; some people do appreciate the effort!","The executive and council members \"take\" their cybersecurity awareness training.Then click on phishing emails and complain to me.I let them take training like everyone else who fails phishing tests.","I started asking if they wear their seatbelts while driving","That sounds very frustrating, so sorry you had to go through that! I generally agree with other comments here regarding instilling user responsibility (e.g. having them sign security policy doc on the first day, mentioning cyber insurance, etc.), but I would also emphasize that I've seen some element of empathy to be key in getting buy-in from the employee body. I realize it's probably extremely difficult to empathize with someone who is behaving like this (I feel like you need to be a saint to work in sec) but the fact of the matter is that there is probably going to be a lot more of these kinds of people in any org, so it's always a delicate balancing act... Probably not what you wanted to hear (sorry!), but try to get as much buy-in from folks (esp exec team) as possible moving forward if you can... Maybe some beer after work to calm down the monocle :)","You're right.On the flip side though, I'd rather deal with this than all the users who are just confused, never hit the Phishing button, and open a damn SNow/Jira ticket about it to make sure it's legit thus making the process harder for them.It's a revolving door, and they all know a simulation happens quarterly...Edit: sp","The average employee doesn't care about security. I learned in pentesting you need to Oreo cookie it.\"It's great that you could tell this is a phishing email. As you know, there are phishing emails you get that are legitimate attacks -- it's important that you report all suspicious emails so that way you and others won't get any more phishing emails. Your ability to recognize these and report them is the only way to eliminate them.\"It may seem over the top, but sending an email to their manager and BCC them on how impressed you are with their security awareness is awesome, encouraging, and something few people think to do. Killing the ignorant with kindness tends to reduce the friction.","There’s always these people in every organization. We’ve had red team access a normal user who was using a waterfall password, then used her account to phish like 40% of the building. These are people who are required to take security training annually. We got the csv with the list of people and most if their reasons were something like “I was too busy to really check the link. Just saw it was from HackedUser”","hands you a beer ey comrade, happens a lot.I too run the phishing sims for my company and Ive had that conversation more than once. Ive had very angry employees telling me that they arent taking the training (it is not enforced because that would be an HR thing I don’t need in my life) and that they definitely did not click anything in the emails. 9/10 these people are repeat offenders.. Ive had TSM’s (technology service managers, the site specific IT manager) tell me their people are FAR too busy to have us ‘spamming them constantly’ and… those sites usually had the worst response rate.I just shake my head..","I would say sure then have someone try to phish them over a messaging system or by phone.","If this is someone who doesnt have the power to demand request like this simply say no.If they are a higher up with the power to request such a thing then document it and go grab a coke brother.","\"So you're handing me your resignation? Probably should take that to your manager and HR\"...","At a previous job (fairly large, international company), a member of senior management sent us and the CIO an extensive calculation of how much money the company was losing due to the time it took to log in, unlock the screen, and so on. The overall tone was quite aggressive, like \"stop that bull....\". CIO just responded like \"I'm not gonna do that\". Never heard back from him.","Just disable her email account - no more phishing tests. Job done :)","We're doing phishing exercises too. One user apparently failed the test (we collect aggregate data only, no userid) and sent a message to it sec apologizing(???) but also included a fwd from the rest of his team discussing the exercise and warning them(it is noted everywhere to NOT inform colleagues).","The higher ups are the biggest targets. So, if they want to be taken off, that's fine with me. Sign this risk acceptance sheet that if there are any successful phishing attempts, breaches, etc. due to them, their machine, their email, etc., they are 100% at fault by the company, etc.etc.etc..No one has wanted to take that risk for such a simple once a month phishing test. They do, however, report our phishing tests fairly often as well as legitimate phishing emails. So, that's a good thing. They know they're being targeted. All it takes is one to slip through by being good, in a hurry, a whoops I didn't mean to, whatever. They know.","To me, I understand both sides. Even i find certain cybersecurity protocols to be a necessary evil, but that’s because I’m knee deep in the industry. People who don’t understand just think it’s an inconvenience and an obstacle in front of their own operations and work.","Double the phish testing frequency for her","I have conducted phishing simulations myself. I designed the emails and everything.Yet management still wants to test me for phishing. Last time, I identified a header that was the same in every phishing mail and set up an automatic forward to our IR department.It does feel patronizing and like a waste of time."],"points":346},{"text":["Post-auth blind Python code injection vulnerability detected"],"points":0},{"text":["Mistakes","Added a legitimate hash value to the IOC list in Microsoft Defender which caused a massive list of false positive events for our SOC","Gave a presentation to a cybersecurity Vp that absolutely dumped on his program and called it out for the garbage that it was with 1s and 0s out of 5 in each security domain maturity level. Yeah I was naive and thought that was what he actually wanted….","Participated in a servicenow survey to get a free coffee mug.","Imported vulnerability scan configurations from Nessus Pro to Tenable Security Center. Didn’t think to check all the settings and brought down production systems for a few hours.","Close to 20 years ago now, building a config on a monitor port and at the end of the config instead of setting the VLAN tag entered 'default VLAN' and hit enter control z and write mem.The monitor port just happened to be on the primary office VLAN and as such I sent default VLAN to the switch for the office network which essentially deleted the VLAN. Thank goodness for every other hour network config backups. swap running config reboot and things returned to normal but every single person in the office knew something had happened.NEVER want to be in that spot again if I can help it. Sandbox network went up that same week."],"points":3},{"text":["Adalanche: Active Directory ACL Visualizer and Explorer"],"points":0},{"text":["Hiring with family member on staff...","I've never had an issue with that. One of my current lead engineer's wife works in marketing. At a previous company one of the dev's wife worked in IT support.There is more a COI when the family member works for a competitor than at the same company.","As long as their responsibilities, accountabilities, reporting and decision scopes don’t overlap, it isn’t a big deal. So basically they shouldn’t work in the same team, shouldn’t report to each other, shouldn’t report to the same vertical, and shouldn’t make decisions that affect the other."],"points":6},{"text":["Where do I find true \"entry-level\" cybersecurity positions with a Masters degree?","Learn to walk before runningHelpdesk 1- 2Y > sys / network admin / engineer 1-2Y > Cybersecurity entry role.","So why did you take the EP job then?It's pretty well know what type of job/schedule that entailsAt any rateWhere are you in the world?What industry do you want to work in?what other job experience do you have?Are you on linkedin?Have you gone to any job fairs?Do your schools have a career center for alumni?Are you connecting with Alumni to get leads on jobs?Have you talked to any IT staffing companies about getting into any kind of entry level IT role?","I teach part-time and I've had a few students land SOC Analyst roles as their first tech gig - it's definitely possible but these students were involved in a lot more than just the regular curriculum. Most of them had obtained certifications like the Security+ and PenTest+. Furthermore they were on Hack The Box and Try Hack Me, and they were also involved in after school clubs like the CCDC.I do feel for a lot of you who have these degrees because you've been sold a field of empty promises. Cybersecurity jobs are in demand (True). Entry-level Cybersecurity jobs are not entirely in demand and it's fiercely competitive because EVERYONE wants to get in.Honestly when people say just go after a Help Desk or Support type roles to get some experience - it's genuine. I started in Support roles then went to Sys Admin roles and even took a weird path to the Storage world before finally landing in Security. I have previous managers who literally cannot find people to take entry-level support roles and they honestly the pay isn't even bad for what you'd be doing (60K+ base with bonus and benefits + WFH). Help Desk and Support gets a bed rep but it's still a whole lot better than doing nothing even remotely related to your degree.","You generally need some cyber-adjacent experience, even for entry-level jobs. IT/sysadmin, developer, business analytics, audit, etc are all great for breaking into cyber security.","You can go towards help desk. Only job you’ll be able to get tbh.You’ll either use help desk as a stepping stone or you’ll slowly decompose working in help desk lmao","SOC Analyst"],"points":10},{"text":["Courses/Classes to improve employability?","I think your first step is learning how to use paragraphs...........So you only have 2 years of job experience total and you though it would be a good idea to quit your job?Where are you going to school for your MBA?Assuming your previous employer won't take you back, then you need to talk to every single IT staffing company in your local area, get your resume out there and get into any contract to hire role and get back to workAn MBA is pretty useless to someone who only has 2 years of working experience, especially if you're going to some random online or unranked programI would put that on hold, focus on getting back to work and getting some IT/security certs that matter"],"points":1},{"text":["Is it worth it anymore to go for a career in cybersecurity?","It's the same thing across all technical fields. Security is probably one of the lesser affected fields compared to devs/SWEs. The market is just bad in general.You're on the right path and have a solid plan post-graduation.","At this point, internships are going to be your best bet. Apply to as many as possible with as many reputable companies as possible.","depends where you are… im getting hit up by head hunters on a weekly basis in canada","You'll be fine. Most people complaining about jobs are the ones that don't interview well, have bad resumes, can't articulate their experiences, or are still at the entry level.","Absolutely worth it. Try looking for employment with an MSSP or a security Vendor instead on just one company's team.The one I am at was booming during covid and still has lots of growth.Everyone needs cybersecurity and the C-Suite is finally jumping on board that security is important.Edit: sp","The market is making a shift to experience based qualifications. Certifications are nice to have, but are not enough. You need practical application of all that theory. If you can't get an internship, build a lab.Apply what you learn in a lab environment in the form of projects. Network fundamentals are a must in cyber security, start there. Do some Microsoft courses, workstation, server, active directory. Build a small environment, test a ton of stuff.Build it , break things, rebuild. You can use lab experience on your resume.Hiring manages are looking for attitude, aptitude, and adaptability. In addition, soft skills like critical thinking, curiosity, analyzing, problem solving, troubleshooting, thinking differently, communication skills, leadership, etc.You have to talk the talk and walk the walk. By having a lab environment you are showing that you are curious, willing to learn, and proving it.Do CTFs, read security articles and post comments on LinkedIn and the article link. Show off your knowledge.I had my now college graduate get Network+, Security+, build our lab environment, apply all that theory, build our active directory, build our VMware server, do a ton of CTFs, post articles on LinkedIn, and other projects.He was getting interviews, but always fell just a little short of getting the job, usually lack of experience, Only after adding the lab experience on his resume did he get a killer job.Stick to it, prove you want it, show your willingness to learn.Best of Luck!!!","All of the job market is shit right now. Tech is experiencing it badly because they vastly overhired during the COVID Era and it's now correcting itself.","The field is going through a shift in what qualifies a cybersecurity professional.Certs used to be required so vendors like, isc2 and comptia, had the market all to themselves. Now a degree from an NSA accredited school qualifies a candidate.A lot of what you're seeing is a hiring pause until the new system picks up steam, and reaction from Cert monkeys who've been swindled by \"instructors\" and bootcamps over the last 18 months.My next move is to senior or manager, last year was really quite but I started getting interviews and cold calls for really awesome positions at the end of November. Just got one yesterday too. Right now it's either \"lowballs\" or \"cold feet\" until salaries are figured out.Hiring for everyone, especially college grads, should pick back up soon.","Finish your bachelors in computer engineering and you'll have no problem getting a job","By the time you graduate the market may be completely different.We placed a request for a budget to hire a few new people and weren't outright rejected, which is something. Still every position after an employee leaves is dropped by default and we need to give justification why so we still need it, but it seems like \"no new hires\" policy went away.I'm waiting to see if they reject it at some later stage, cut paygrades/positions/both or accept as it is.","Cybersecurity is probably not worth it unless you're a glutton for punishment.https://brothke.medium.com/the-big-lie-of-millions-of-information-security-jobs-a7cb1b30c5b6https://www.axios.com/2023/04/21/cyber-defenders-burned-out-surveyhttps://www.securityweek.com/cisos-spooked-by-sec-lawsuit-against-solarwinds-ciso/","Depends. I did one IT internship, starting a Cyber Defense internship soon and going to grind my butt off for a return offer. All gotten after many many failed interviews and applications. I am a 3rd year InfoSec student at uni. If you are on the right path and learning new stuff/ going over stuff 5-10 hr a week you will be farther than 50% of applicants.","I just landed a new grad job, there is hope!"],"points":69},{"text":["Possible to find a job in cybersecurity given my condition?","Only if you are skilled enough"],"points":0},{"text":["What do you think of people who send emails in text mode and strips out all previous emails’ rich text formating and html?","Wise people!","This is the way.","morse code sounds","I usually think “thank you,”","They're the heroes I wish I was brave enough to be.","RESPECT, good netiquette.. but it will be more respect if he had is own mail server that strips the mail he sends via a pipe filter script, reads the outgoing mail as stdin, detects html/preformats and convert it to good old 127 bits ascii...After some time, you got tired..","I only use text and I don't top quote. I'm from an era when email was used only by techies and not by executives. An era before outlook invented top quoting.","Extra points if people are using obnoxiously long signatures.","Good for them? I mean, there are still some email clients (pine, mutt) that are text only or those people might be intentionally using text only even though their client supports it for accessibility reasons","I feel like it’s kinda old school but I like it","Heroes","If you can't express it with ascii characters, it's not worth sending (or deserves to be a PDF).","What does this have to do with cyber security?","It's very old-school. I'm not sure what the benefit is, in any workplace with modern (or modern-ish) IT.It's probably a plus for anybody in your organisation who's using a vt102 or a teletype machine.","I'm fine with it.But I tell you, RTF helps to get complex crap across to non-techies. So I'm never on plain text for myself.","Those are my people."],"points":93},{"text":["How long do you think this will last?","I don't think it will ever go back to what it was 5+ years ago.Schools are pumping out too many \"cybersecurity\" graduates where that program didn't really exist a few short years ago. Many of these schools had good intentions on \"bridging the gap\" of professionals in the industry, not realizing the true gap was for experienced cybersecurity professionals with a solid foundation in systems and networks, rather than entry-level staff who have used Metasploit and basic SOC tools.The schools don't care anymore because it keeps enrollment numbers high, and they are now delivering students a false promise that they will be super in-demand.","I believe part of the problem is the deluge of unqualified people scrambling to get in to cybersecurity. It has given organizations pause. They are tired of weeding through 500 applications to find the 2 or 3 that actually have the qualifications. Until that stops or slows down, don't expect the market to change.The other piece is companies trimming the fat. They overhired technology resources during the pandemic and are paying for it now. Look at all the layoffs still happening in the industry.Then you have the companies who think AI will replace all of us and are either investing in that or waiting on the sidelines to see what unfolds.I don't see anything changing until at least 2025.","I think that the \"education industrial complex\" has flooded the market. It'll take a long time to weed out the paper tigers.","Once the Fed starts cutting interest rates, confidence will increase and businesses will be more willing to borrow/spend money to grow.","The problem is a bunch of IT folks flooded the market and have no clue what they are doing. Anyone who is actually a cybersecurity professional is working and getting multiple offers for good money lol!","Just been speaking with a recruiter contact and he's saying that January has been crazy for him for mid-level roles, all picking up which he was surprised about (London, UK)","This sub is depressing.","Focus on learning sysadmin or networking skills. Cybersecurity is transitioning to either technical know-how or GRC. Unless you are gonna work IR for an MSP or are trying to get something like an internship, the dime a dozen Sec+ w/ no IT experience opportunities are going to continue to dwindle. There's a huge need for engineers, not as much for analysts. It stinks, but the best bet is to make yourself a clear standout asset.","Until regulators stack another onerous requirement on business and everyone has until the second tuesday of next week to hire a cybersecurity guy to check a box on a spreadsheet or be out of compliance.As soon as the A needs to be C'd they call the CYA guys. That simple.","Why you're seeing layoffs?Quite a few things out of your control if you're trying to get into an internal company. First, we just finished CY23 and are now into CY24. Those who have their FY fall on the Calendar year and finishing up their books and most likely are making changes that adjust for the 10% revenue increase that most publicly traded companies will be predicted to hit. At this point, they are shoring up revenue for cost centers and revenue generators.The other is if the company's FY falls in line with tax season, it is probably in Q4. So they are in the opposite, where they are scrambling to figure out what can be cut in order to balance the books to either have a solid earning call, or if it is underperforming, lighten the blow.At the end of the day, the Officers, C-Suite, and Board of a company ultimately make their generational wealth off the stocks they own in the company...not their salariesI put that there because everyone needs to remember it. Even if you're in privately held practices, someone holds the reigns to the wallet and is expecting to increase their cash flow based on their investment. So changes will come down hard.Why is it hard to land interviews?As stated in the above, you now have a candidate pool that has Academic Graduates + Transitioning Employees with experience X Cybersecurity Employees with Experience.With the market getting tighter, as evident with layoffs alone, that dwindles many echelon technical positions. So what was once a Principal before Jim left is now a Senior when the req is posted. The candidate pool is now over saturated with at least 2 sets of people in the equation above who are looking to fill the role. Another distinct level of graduates will attempt it. Talent and acquisition will use AI and the other scanning mechanics to dwindle the list to 10-15. Those 10-15 go to Hiring Manager who then select the 5-8. That gets dwindled to the 3-5 that will start the interview process. That will go down to 1-2. And from there the offer based on the interview scores and hiring manager approval.When Will It End?We are in a field that has high attrition due to burn out, poor work/life balance, and just overall mental health struggles. I personally believe many of these companies have no intention in filling any of these roles at the present time. They are posting Ghost Positions in the hopes of compiling a pool of candidates for if they get headcount, or someone leaves the company and it impacts work production.Again, everything that happens in a company is dictated by the market. C-Suite and Board have the responsibilities to their shareholders, of which most of them make up the overwhelming majority of the held stock. Not many C-Suites come with a cybersecurity background. Heck the degree didn't even exist until very recently when you look at how long formal academics have been around. That means their ultimate question every year at the end of the year is: \"Did we get breached? No? Then why do you more headcount or revenue for products that we already have?\" Is that overgeneralized? Probably a little. But I've sat on calls where CFO's post-breach were all about EDR and MDR solutions, until Year 3 when the question was \"Well...what are we really getting out of this? Nothing has happened since.\"Don't be shocked when you're hearing murmurs from your peers in the industry saying that their company is remaining flat this year. If anything, you'll see attrition through being pushed out vs. them quitting to free up cash flow as they try to keep the stronger personnel. Which will have a dual negative effect (it always does) because now the stronger personnel are working even harder and then burnout kicks in and they leave.From that point...look at the above paragraphs about why you're seeing layoffs and why it is hard to get an interview. Thus, the cycle.","Slow isn’t even the word. It is all messed up. Most of IT needs help with more staff, especially cyber, but companies no longer want to on the job train people. If this trend continues, companies in the US will be in big trouble as the veterans age out and there are not enough young people with knowledge to replace them. It will be funny since there will be theories as to why this happened and I am sure none will be true. Companies are trying to cut corners and still don’t understand that IT is not a Cost Center. It is critical infrastructure and the most important department within the organization. Without IT your company is nowhere. It just won’t function because 99% of things are automated or require computers in some way.As for how long will this last…hard to know. I am not sold on AI because it is trained with biased data which only gets biased results. It also means that technically it is vulnerable. Slip in malicious data of some type to create a time bomb with its functioning or some strange data back door and you could have a world of trouble. I predict another 6-12 months of this silliness of mass layoffs.m before they realize they screwed up again and need to do large hiring.","In the UK at least these last couple of weeks things have really eased up and more adverts are up. I suspect will get better In April.Middle of year should be normalish I suspect","What is your evidence that it has slowed down?","I think people need to get real and understand a degree and A+ isn't going to land you a job in CS.","It’s hell if you’re new, but hotter than ever if you have experience. Have never had so many folks reaching out. The tech field like many industries is a living breathing cyclical thing. Keep grinding","I’m abit of a poster child myself, I managed to land a help desk job directly out of college. Got on all of the various IT directors good side with my interest in every field. After speed running a few projects it only took 9 months from my start date to become an engineer and 4 months after that I was being trained along side the infosec team. All it takes is really drive and the right connections, I talk to strangers, goto cyber security conferences. Just about anything to increase my network. I don’t have a bachelors or any certs and I’m at a 6 figure salary because of my resume, 2 associate degrees and 5+ years experience. I’m only 25 currently but I’ve been working only in IT my entire life, never had any other kinda job aside from overnight warehouse work for Dell. Keep trying man and never give up, you will land something just start somewhere and crawl until you can run.","Join blind app and search for the answer there. This question is posted at least once a day.","Please back up ur data with stats. I'm tired of hearing this doom and gloom nonsense. We are on a downward trajectory compared to the last few years but 2020-2021 was an unprecedented year for tech. Idk if we ever see growth like that againWith that said, I got into the field in 2021. Since then I've gotten a job offer every time I've tried to look for a new job and I've never had a job offer for under 6 figures. Things aren't nearly as bad as ppl make it out to be IMO","Been around since the 90’s. I don’t see this downward trend continuing. It’ll pick up, economy and spending are cyclical. Enjoy the break.","With two decades in IT, I've experienced several layoffs during economic contractions and expansions. Currently, jobs are scarce as high interest rates are used to temper a heated economy. However, as interest rates are forecast to decrease, job opportunities should start to increase.","Do you have CISSP or CRISC? If you have either of those or both, you should be able to find a cybersecurity job easily.","I’m trying to get into cyber after my employer hired his grandson with no IT experience. Seems like he’s slowly being groomed to do my job. I hope by the time I get my cyber certs I can land something better.","https://www.csoonline.com/article/657598/cybersecurity-workforce-shortage-reaches-4-million-despite-significant-recruitment-drive.html​Two-thirds of organizations lack staff needed to prevent, troubleshoot security issues Two-thirds (67%) of the 14,865 cybersecurity professionals surveyed reported that their organization has a shortage of cybersecurity staff needed to prevent and troubleshoot security issues. Cost-saving cutbacks such as budget cuts, layoffs, and hiring/promotions freezes are playing a fundamental role, the report found.","Cyber schools are pumping out guys who can recite the NIsT pubs by heart but can’t use it sensibly. Freshers and middies need to use the NIST as ref not as ‘tho shalt’.","feels like we are at the limit of new tools and processes and the market is turning to reviewing and optomizing cyber spend. until the next big attack that requires additional regulations we probably peaked a few years ago.I think you'll see more legacy technology replaced with newer, sort of like AV to EDR in the past. that's probably were hiring will be.zero trust, data lake, and AI are still growth areas. probably IAM and GRC as well as so few companies get that right.","The current demand is high but the \"ideal candidate profile\" (stealing this from ideal customer profile) is different. Everyone else is playing catch up to Silicon Valley tech style security engineering pioneered and made popular by Netflix over a decade ago.Today if you're a security engineer with a solid software engineering / computer science foundation, you're in very very high demand.Today if you're a security engineer with a solid software engineering / computer science foundation that also has solid undergrad math knowledge to include linear algebra, number theory, statistics (Bayesian), and quantum mechanics you're in very very very high demandThe signal that most of the people in this sub are behind the times is the incessant pushing back against basic coding skillsI've noticed that increasingly non-tech companies who 5 years ago would be ok hiring non-technical \"cybersecurity\" people from Big 4 audit or legacy defense contractors now want to hire Bay Area style security engineers instead","It will probably get slower and there will be less demand going forward. There are way too many people VS opportunities. Companies are more selective since there is a large pool of candidates.","I don’t think market is that bad for IT/CS/Cyber roles. Of course it’s not as good as it was few years ago but that is a trend among all industries. Fresh Cyber graduates find it extremely hard to get jobs unless they’re in top 20%, that is due to experience requirements. If you’re only looking for remote/hybrid jobs in Cybersecurity, that is not gonna work out for majority of people. Cybersecurity professionals with 3+ years of experience and certifications are still in relatively high demand, of course that may vary based on geography.","Who remembers help desk and deskside support 20 years ago? Those used to be good jobs because it was a relatively niche skill to understand how computers worked. More education and certifications brought more qualified labor into the workforce though, automation removed repetitive tasks, and service providers consolidated efforts while reducing opex for businesses, so it eventually became an entry-level position.This is what's happening to cybersecurity now.","Slump will get worse especially when large language models get even more parameters and more relevant abilities. Why would say a security operations center need 5 guys manning it when they can have 2 guys on call making sure the AI is on task so some humans still in the loop but not nearly as much now. Eventually SOCs will have software constantly monitoring for indicators of compromise by extracting features in the noise things we know ML is good at. That's just one sub field in cybersecurity but their all going to get their lunch ate by AI.Writing on the walls that's why infosec is becoming a clown show now. Blue Collar is the new wave not White Collar anymore. Unionized doormen in these big cities like Austin and LA make almost 85k annually and you get better job security. You don't get laid off almost every other year because silicon valley is moving fast and breaking things \"changing their vision\" or whatever the latest dumb buzzword is now.You might take a slight pay loss but I rather make high 5 figures with a benefits package that's as good as some of these tech startups and have low amounts of job responsibility. You literally just have to open doors and accept packages for people but people rather work hard then smart. Some are just stuck in a stockholm syndrome relationship with their employer.","The current 'slunp' is just a normalization from the excesses of low interest rates.","Well… plan A had this problem… plan B… is cybersecurity. You’re fucking kidding me. I hate being my age in this cursed economy where CSC is get the fuck out, and give me 1000’s of dollars so you can cry about being 40k in debt with no real assets to show. The American economy can quite frankly go fuck itself at this point, we live in the dystopian novels I read as a kid. Period, full stop.","Your not gonna get a job unless you have a Masters, A few intermediate/advanced certs, and experience.I was in cyber two years, no degree, and a few basic and one intermediate cert.No chance in hell i will ever land a job without a degree to get passed the HR filter.I went to back to physical security. I make more money, no stress, i can have a life again, if i want more money i picl up am extra shift. PLENTY of job openings.","You're gonna get a lot of hearsay and luddite answers here. Ultimately, it boils down to US federal regs changing foundational qualifications and the advent of AI.Early cloud services brought up the looming disruption about a decade ago, and security pros turned up their noses at the idea.Well, now we have: New regs, AI, and Cloud converging on the old guard all at once.","Slightly different for me.I can't really get into Cyber positions: I have CISSP and a BS in CyberS. With minimal experience in actual Cyber experience beyond Palo Alto configurations/Cisco ASA configs. (Just recently got extensive experience with ELK).But I get a ton of offers for stuff like Sr. Networking Engineering, Network Admin roles and I only have a CCNA (but I do have 6 years as a Network Admin) sometimes CND or CNO Analyst pops in there.So for tech... I think Cyber specifically is oversaturated, (but I don't necessarily have the exp to back it up) but for Networking I think it's the same.I have some Cyber positions that I've been offered... I mean actual and good offers (but declined due to timeline issues) and it was only because of who I know - not because of my credentials.","I think something that the vets who are complaining about the unwashed masses of new grads seem to forget, is that there are also plenty of people with all the experience and YOE on paper but simply don't have the 'talent' for the job.I don't know exactly how to define that talent, but I've seen plenty of people who should know what they're doing skip over basic competency stuff. It's incredibly easy to coast on the fact that most issues as an analyst end up being false positive, or are automatically mitigated.Edit: Not to discount the fact that the 'education industrial complex,' is a total racket built on empty promises.","As a student enrolled in an online C/S course (compressed 2 yr into 11months) I’m blessed to have a 100 hr internship which will help me in my career change. LinkedIn posts a lot of positions, and yes, lots of mid-senior levels, but they’re entry level posts also. I strongly believe that we (as in entry level) should start applying (or gain information) about school boards and hospital opportunities. They need the most help. That’s the first place that I’m checking out. Take Care 👍🇨🇦","Computer Science fields are not the route to go at this point. Market analysis suggests skilled tradesmen will be making more money than anyone else within a decade. Almost the entirety of the current professional development is geared toward computer/remote based education. Trades are trending towards complete inability to staff. AI will kick many of the people to the curb who jumped on the CS bandwagon. While trades will be too difficult for those sedentary individuals to start in their 40s.Trust me, fuck CS and go learn a trade.","Interesting thread","no jobs, AI tools doing everything soon. no human needed, its all a lie! everyone will be removed soon!","It is a very complex problem. More candidates will make it harder to get entry level jobs. Moreover, it did nothing about helping develop that talent. Furthermore, it doesn’t solve the issue of companies wanting to hire extremely skilled people for mid level jobs, without providing pathways to get there","Budget tightening will likely continue through at least the rest of the year. I finally got the green light to open some offensive AppSec roles for my team, but my approved budget for them was half of my proposal. This essentially forces them to be offshore rather then domestic, which only adds to the drying up of the market.","It's cause cybersecurity is the new wave for bootcamps, colleges and people looking to get into tech. Many people don't do extended research and get sold the dream of a six-figure job right out of college or said bootcamps. Same thing happened with mechanical engineering in the late 2000s/early 2010s. Same thing happened/is happening with computer science right now, where people are looking to get into software engineering, and now it's cybersecurity.Most of the certifications that the industry relies on like Security+ aren't enough to gauge candidates of their true ability. People graduate with zero internships in IT or extracurricular experiences and all have similar degrees and certifications. At that point, it's hard for companies to filter through the pile I imagine.","It's difficult to predict how long the current slump in employment will last, as various factors can influence the job market. However, considering the cyclical nature of the economy and the fact that many tech companies are experiencing slow growth or even layoffs, it's possible that the hiring situation may improve over time. It's essential to stay informed, network with professionals in the field, and be prepared to adapt to changes in the job market","The peak that you saw years ago has never been the norm. Feels like we are back to just below normal numbers IMOSaw this years ago with becoming a server admin then network admin then cloud admin. You ride the wave when it’s hot but must understand it won’t last","It's true that hiring in cybersecurity and tech roles has been sluggish for quite some time now, which is concerning. It's difficult to predict with certainty when this downturn will improve or if it's a permanent shift in the industry.On the other hand, I think there's plenty of good quality jobs to be had if you have the skills. I'm a recently laid off red teamer and I've been looking at roles that are more reverse engineering and exploit development focused. I found a bunch of them from defense contractors, which is a world I'm not familiar with. Still, the jobs exist.","All the comments is scary for me 😅 i was getting ready to start my career path in cybersecurity. What I suppose to do? Shall i stop now before i pay a lot of money for courses?","as someone who’s in a degree path for “cybersecurity” seeing these posts always depresses me. i feel like I have no fucking chance even if I do get certs or IT experience","Who do you know in the industry that is in a hiring position? Or have you been networking in person?","That is very disheartening","cybersecurity is just IT Security.​The fad was always hype.","I think we're seeing the field self-correct a little bit.It's difficult to acknowledge this, because the vast majority of organizations are still sorely lacking in cybersecurity. But if you're a SOC analyst and 95% of your job is running automated tools in response to SIEM events, then someone at your company is probably looking to replace you with a script. And let's be honest, those tools are getting better every day. We don't need an in-depth full forensic analysis because Frank in accounting installed yet another \"cute cats lol also coupons\" toolbar. We just need to remediate.On top of that, there seems to be a glut of qualified candidates.The people who are decompiling malware are fine. The people who are managing compliance are fine. The people who are doing advanced endpoint management are fine. But a lot of the entry-level jobs are vanishing or shifting. It's kind of like the difference between being a sysadmin in 1994 and a sysadmin in 2024, only compressed down to 1/6th the scale.If you pull back and look at the bigger picture, I think we're seeing the beginning of the end of the IT era. A company doesn't need to have in-house sysadmins, network engineers, and cybersecurity analysts when they can just hand everything off to AWS or Azure or Oracle or a local MSP or whoever. And honestly, doing so these days makes a lot more sense than it did just ten years ago. IT is right about where US factory workers were in the 1960s. The industry is going to be okay for a while, but we're going to see some serious shrinkage over the next 20-30 years. And that includes Cybersecurity.There's still time to make a career out of it, but the door is beginning to close. And the gravy train already left the station. Coasting isn't a viable strategy anymore; people who want to build their career here are going to have to keep learning or immediately sink.",""],"points":1013},{"text":["What questions should I expect from a 2 hour long interview for a junior information security analyst?","The only thing you can do is not to work yourself into a worry. I know it’s easier said than done but there is not much you can do.2 hours does seem long but it could just be for the hiring manager to afford enough time to it so to not not feel rushed into activities afterwards and so maybe the full 2 hours won’t be needed.But for a jr role it’s not likely going to be super technical and likely only be some time towards it, but more behavioural in which case you are just talking and asking questions and they’re just gauging if you’re a good fit. Just be sure that you yourself ask questions during your interview, it’s important that you engage with them.Also it’s okay not to know an answer to a question, what’s important is how you approach it. Applicants always worry to much on this aspect and it is absolutely okay to not know every question being thrown your way, what is more important is how you conduct yourself and how you respond in this situation.But if you worry now about the interview your anxiety will show and your confidence and ability to prove your candidacy will degrade.","what is the air speed velocity of an unladen swallow?.. make sure you can answer that one, just in case.The rest...there is no way to tell. Like u/Sivyre said, do your best to relax.","Have questions for them.Relax and show them what you know and don't BS them or make up answers.Remember you are trading your time and dreams for money.Also... Everyone interviewing you shits. They may know more than you but no one knows how to be immortal. They are affected by life too so be human like them.","Being a senior, I have sat for a number of junior interviews. How our interviews go. We start by describing ourselves and then the position. We ask about 10 lightly technical questions. If you answer any of them really well, we may ask a few follow up questions to probe your knowledge a bit. At the end we ask if you have any questions. (Always have a least 2-3 questions for us) It shows your interest in the position and the company. This usually takes an hour, but can go over a bit.You don't have to get every question right, or answer it right away. Step back and breath. I've seen dozens of people mess up simple questions because they are nervous and answer too quick to just to finish what's in front of them. If you don't quite understand the question, ask them to elaborate. Use association and examples from personal experience to talk though a question.When I'm doing hiring, I'm not looking for the one to get every answer right. I'm looking for a team member who will fit in with the group. Nearly everyone is nervous at an interview. Show me how you can relax and build a rapport with us in your two hours.Oh, and I always appreciate a thank you email after the interview. Gives you a chance to answer any questions you feel you missed and show that you are interested.","Is this for SI?","It's not unusual to talk to multiple groups of people in an interview, which can really add to time - it seems unlikely one group of people will be grilling you for 90 minutes, that'd be very unusual. Probably more likely you'll have 3 groups, with 30 minutes allocated for each of them.Failing questions happens, it matters but it's seldom a \"get one question wrong and you're out\" scenario. People want to judge your manner and your knowledge, and there's more ways to pass than to be perfect. Know enough to be reasonable for your skill level and the position, be someone who seems pleasant enough to work with, and you can do just fine.","Don't stress about the time. It probably will be mostly behavioral but some technical.If you don't know an answer be honest about it. Don't just shit out a guess and pretend you know it. Try something like \"I'm not sure, from what I know about ___ I would probably think that the answer is ___ but I don't know. I'll have to look this up and learn more about it\".The thing you should be most concerned about is showing you would be a good person to work with. You want them to walk away with the impression that they would enjoy spending a significant amount of time with you, be friendly, make jokes. Don't suck up though, that is really obvious.Also, teams want juniors that are willing to learn and want to learn. If you point out things you have done on your own time to learn they will eat that up.","Do it. Take notes. Let us know how it went and what took 2 hours."],"points":22},{"text":["How to be safe with internet turned on in a virtualbox vm","You should look into a tool called inetsim. Basically you need to setup another VM on an internal network and route your traffic through it. That second VM can then run the inetsim tool on the interface that's connected to your windows VM and it can simulate internet traffic (basically this means it will reply with something on all ports and protocols). You can configure the tool to have custom replies for certain protocols I believe","If you're new to cyber security I wouldn't touch live malware until you really know what you're doing. Even without networking turned on in a VM.It's entirely possible that the malware will be able to detect that it's running in a VM and spread itself to the host OS through something as easily overlooked as shared folders.Be very careful with malware samples, and always remember that what you have in that password protected ZIP file could brick your laptop if you slip up.","It seems like per your comments you are relatively new to cyber which is good and okay, but i don’t think you should be messing with Malware until you grasp some more concepts.just my opinion!","Check FakeNet","I don't know what's going on here but it seems very skiddish.","A VM is a computer... so do what you do for your computers?","virtualbox is trash use KVM or Xen"],"points":99},{"text":["Cybersecurity for Everyone By University of Maryland. It's a free course you can take.","Why post a crappy medium link... here's the real link: https://www.coursera.org/learn/cybersecurity-for-everyone","For complete beginners?","How do you go about getting a certificate when done? Excuse the ignorance.","Coursera is the bane of the industry.","Oh great, another inch deep course that will encourage unqualified people try and flood the workforce."],"points":92},{"text":["How a mistakenly published password exposed Mercedes-Benz source code","Has anyone read it? Is there anything in there about the blinkers not working? Maybe we can fix the bug and send them pull request?","That employee.... Fired!"],"points":3},{"text":["AI companies will need to start reporting their safety tests to the US government","AI safety tests: What is a Woman?if \"crash\" then safe = OK/s"],"points":0},{"text":["Researchers Uncover How Outlook Vulnerability Could Leak Your NTLM Passwords","This post links to The Hacker News (THN). The moderators of r/cybersecurity strive to maintain a professional subreddit which will often discuss news, and further acknowledge that THN is a popular source of news within the cybersecurity community at large. We always wish to act in the best interests of the community and will not restrict news content which is accurate and valuable.However, it has come to our attention that THN has been accused of plagiarism since at least 2012 (ref: attrition.org), allegedly copying article contents from original authors and modifying them without appropriately crediting the original source. Their behavior has been met with repeated criticism, including making false statements (ref: @thegrugq) and renewed claims of plagiarism (refs: news.ycombinator.com c. 2018, reddit.com c. 2021). Due to these incidents, THN links have been banned from several subreddits including r/privacy, r/technology, and r/hacking.We would hope that THN is now appropriately crediting sources of its content or writing its own original content, however we are unable to police each and every article. Please ensure that the information in this article is factual, and where possible, please choose to support high-quality ethical journalism directly. If the community feels this warning is no longer relevant, we will remove this AutoModerator action. Thank you.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Interview questions for system security engineer position.","Search the sub for interview questions. These have been posted several hundred times.","Post the job description here so we can help"],"points":3}]