[{"text":["Introducing JavaScript Support in MySQL","If you're scanning through:The blog post from Oracle announces the introduction of JavaScript support in MySQL. This new feature allows developers to use JavaScript directly within MySQL, aiming to streamline database operations and increase flexibility in application development. The post details the implementation process and the benefits of integrating JavaScript into MySQL, including enhanced data manipulation capabilities and simplified database interaction for web developers.If you don't like the summary, just downvote and I'll try to delete the comment eventually 👍"],"points":1},{"text":["I created my first useful program","nice"],"points":0},{"text":["Small programming project I made for fun on YouTube"],"points":0},{"text":["Webhook Testing Without the Headache"],"points":0},{"text":["Improving upon my OpenTelemetry Tracing demo"],"points":0},{"text":["HackerNews AI built using function calling"],"points":0},{"text":["Machine learning for Java developers: Algorithms for machine learning"],"points":0},{"text":["Engineering With Java: Digest #7"],"points":0},{"text":["What's New in JavaScript in 2023 – Changes with Code Examples"],"points":0},{"text":["The importance of personal branding in the engineering industry","Can we just permaban anyone that posts articles with this stupid trending upwards graph as a thumbnail?","Just write a blog bro.No wonder Medium and Linkedin are such cesspits.","This article should be covered in so many \"citation needed\" that you wouldn't see the text under them.","*vomits*"],"points":27},{"text":["Innovation in Automation: How n8n Is Outpacing Zapier in 2024","Blog spam","I think this is somewhat unfortunate:Bashing a competitor.Don't come with really arguments or comparison.Write some general marketing stuff.Post a link on a forum for computer programming.I develop myself a competitive product, and this is not the way to promote it. BTW there is nothing wrong with both Zapier and n8n, but I don't think the target audience is here."],"points":0},{"text":["Colored Functions Are Good, Actually","Definitely think that the author is missing the jist of the colored functions problem. The problem is that it's impossible to write functions that work fine either way.Think about data transformation functions that take an input like `sort` or `findBest` or `join` or whatever. You can't (in a simple way) have the same function take an input that's either a synchronous value or a Promise (or hey, maybe even an Array<Promise>). If you want a version that works on promises then usually you'd write a 2nd version of the same function that is async. But conceptually the function is doing the same thing and maybe we'd be more productive if the one function could work fine either way. That's the problem.Also a function like that doesn't need to \"signal to the programmer that something effectful is probably happening inside that code\" because that isn't true. Being async doesn't imply that it's effectful.","If you've spent some time in online programming circles, you've likely heard it said that JavaScript's promises are monads or that they are monadic. While a quick Google search reveals that this is not quite true, it is kind of trueFor some context: The promise devs were asked to make the promises actually monadic and shat all over the idea because they were scared of the word monad.https://github.com/promises-aplus/promises-spec/issues/94","The big difference between Haskell and C# here is that in Haskell, you can write code that's polymorphic with respect to \"color.\" That is, instead of hard-coding IO into your type signature, you can use a type variable Monad m and have the same code work for any monadic effect (including the identity effect).","There's two \"colors\" of side-effects:Effects that persist after the run of the program (like writing to the disk or database) andEffects that destructively modify internal data-structures in memory while the program is running (such as modifying the value of a field in some data-structure).Talking about IO seems to me to focus on the externally persistent side-effects. Does the conclusions and advise of this article apply similarly to in-memory side-effects?In other words is the best practice that whenever we modify the value of some field we should wrap that operation into a Promise?","I also like having this information in the type system. Also, the common criticism that you can't call async functions from non-async functions (in a blocking way) is JS exclusive. C# for example has a .wait method on its Task objects.(And strictly speaking, even JS can call async functions in a blocking way using SharedArrayBuffer and a Mutex)","I think the author kinda misses the point:While the desire of wanting to know if a function has (side-)effects, splitting the whole ecosystem is a price way too high.","Also, Dude, \"colored function\" is not the preferred nomenclature, \"temporally identified\", please.","that argument is completely moot in js where type is not a thing you can rely on. also, i just need await in non-async functions. still don't see why i can't do that."],"points":102},{"text":["Computational Thinking for Problem Solving By University of Pennsylvania"],"points":0},{"text":["Simple tricks to level up your technical design docs","Nice. A bit confused with so many different stuff posted in the text (ads? Mentions?) but really helpful info as I'm currently writing lots of tech specs."],"points":0},{"text":["How to Deploy FastAPI App or API For Free On Vercel"],"points":0},{"text":["Modern image formats: JXL and AVIF","Maybe add webp, as well. The thing is that most of these image formats are better (image size / quality), but they lack broad support.","Solid article. Here are some additional details that might be relevant:While both formats support lossless, AVIF's lossless mode is very bad. Worse than WebP lossless and sometimes even worse than PNG. JXL lossless is the best available (although browser support is limited, unfortunately, so you'd still need a WebP and/or PNG fallback).While JXL animated mode exists, and compresses better than GIF, it still has the same fundamental issue of animated GIF: you are using an image format to store video. It's almost always better to use an actual video file (even with an old codec like H.264), as those can efficiently represent only the differences between consecutive frames instead of storing each frame independently.JXL has a unique feature which is that, in a special mode, it can recompress an existing JPEG file with no quality loss (with any other format, you would either use lossy mode and get worse quality, or use lossless mode and produce a bigger file than the JPEG). The resulting JXL file can be decoded into pixels by anything that supports JXL, or it can also be decoded into a byte-for-byte identical copy of the original JPEG file. Useful if you have a big collection of JPEGs and don't want to compromise on quality.","AVIF would be a lot better if it wasn't literally broken in GIMP. GIMP is using Nearest Neighbor interpolation to upscale the chroma planes, making it look like total 💩.Try this out, save a color picture in GIMP as an AVIF, then load it again. Use Decompose to convert the color to Y, Cb, and Cr planes. Then just look at the three planes.Worst part is they refuse to fix this because \"They're fixing it for the upcoming 2.99 branch instead\" and do not consider it important enough to fix in the stable branch.","I have added *.jxl as an upgrade to existing *jpg and *.png images using <picture> and the results are phenomenal:JXL is 20-30% smaller for *.jpg files without any loss in quality.JXL is 80% smaller for *.png files (largely logos with text) without any perceptible change in the picture."],"points":4},{"text":["Developers experience burnout, but 70% of them code on weekends","Coding is the fun part. It’s everything else that burns me out.","I code on weekends because my job doesn’t leave me satisfied:(","Coding its self isn’t what causes burnout. It’s actually the same at work. A period where you don’t have a deadline and happen to be doing a solid coding is a lot of fun. It’s all the shit that gets in the way that causes the burnout.I.e. The fact that the company wants to use you for everything from part time product manager to project manager to support engineer and somehow have you make progress on features in your spare time between a million meetings.","Burnout isn't related to coding all the time. It's related to death marching and putting all your time into something for it to go nowhere.","This just in: coding on fun personal non-profit projects is actually a very different thing from any sort of wage labor.","I am the 30%. I code for fun like two weeks out of the year maybe","That's because the only way I can get things done is by working 12 to 15-hour days on a project until I burn out completely, then spend several weeks to a month getting nothing done and fucking off while waiting for my brain to feel like working again.On the balance, it's pretty efficient. It only becomes a problem if somehow a deadline manages to align with a down cycle.","Coding isn’t what causes burnout. Designing and developing software isn’t what causes burnout.It’s the constraints imposed by business and management that cause burnout. Impossible deadlines, poor quality of processes and products (to cut costs) etc. lead to bad code and infrastructure (doing things quick and dirty, as quality takes time and time costs money).","I gotta work on something that I have complete control of with no red tape once in a while","I do “comfort” coding. Generally green field projects that are clean and generally solve a satisfying problem.","a big stressor for me rn is being asked to build a non-trivial/complex feature, but not being given any room to iterate. I'm expected to just crunch out the roadmap items as quickly as possible so they can post demo videos and look good on the social accounts. When I'm writing code on my own time I don't have to convince anyone to let me spend time improving features that were \"already delivered\"","I don't believe the 70%.","I code on weekends to keep myself going. If I don't code on the weekend, the whole of Monday is a struggle.","I code on weekends because my weekend manager doesn’t require 95% or better test coverage and I get off by committing directly to main","it’s odd to me. i read about code here and there, but i rarely code outside of work. think that’s why i’m not as burnt out. a lot of devs should develop personalities outside of code","I'm one of them (I only work 80% and it's 3 years after the burnout happened), and my biggest issue at jobb is having multiple assignments at the same time, I don't know why but it stresses me out a lot.","I was at a job where the existing old guard didn't understand principles of software development very well, but there was a very controlling, toxic culture. So you had poor programmers / system designers putting in place restrictive rules about where one could place whitespace and comments, even, and imparing productivity with useless, backwards PR \"reviews\", while churning out reams of poorly-performing, buggy code themselves underlings were afraid to honestly review. Deadline after missed deadline, robots crashing headon into each other, and still some of these anti-programmers who were darlings of superiors were allowed to continue for political reasons.For many, programming on side projects is an outlet where they can let all the stress go, and make things which are truly high-quality. It can help psychologically offset toxic antipatterns in the workplace, if nothing else.","Coding isn’t the issue for me. I don’t like the stress of unrealistic expectations and deadlines. I’m a perfectionist so I stress out over this.I do code in the weekends, but it’s for me and my curiosity.","Or your job doesn’t provide for opportunities to learn new things and coding on your own time is the only way to do it. If only healthcare wasn’t tied so tightly to your job…","Most jobs are fucking boring. The novelty of tech has faded long ago and I really don't give a shit about feature #4312 when I'll never use the system/product I'm working on. Even the financial incentive loses it's luster when you already get to be a \"senior\" and all other paths of rising in the corporate structure are related to managing people or talking to non-technical staff. It's also a bit depressing seeing your work make/save the company millions and then you just get paid the same as usual while the company keeps the profit.Meanwhile at home I get to work on stuff that actually interests me or solves an actual problem that I'm having. It feels sane as opposed to what I do in the office setting.","While I've been unemployed I've been working on a personal project and treating it like a normal 9-5 job. It's the best job I've ever had.","They’re burn out from the bullshit of office politics and unreliable users changing requirement all the time, not the coding","I code for a bank on work time, making games on weekends/free time. Its probably stressful for the body, but I also crave to work on my game. Someday perhaps, I can work on it full time","Coding can be fun (or at least be used to make fun things). The coding I do at work is not the fun type.","Well, duh. Coding on my own time is fun, i can be creative amd enjoy myself, making whatever i want. Coding for work is also fun, but it's filled with office shit, being around people all the time meetings, distractions, and little inane changes that you need to make every few days (eg \"change the color of this! No, a different color. Change the font on the graph that gets generated when i run this jupyter notebook\")","I don't have to code during the week: too much meetings and reviews.","The only reason I code on weekends is to learn new languages or technologies that I can leverage to get a better job","When I code in the weekend I choose what I work on and I stop when my motivation/inspiration is lost. When I’m at work I have to deal with colleagues, projects that are not the most fun to work on and I gotta stay doing it till at least the end of the day.Now don’t get me wrong, I love my job and I’m grateful of being able to do it, but there is still a big difference between coding in the weekend vs coding for your job","I got burnout from brain dead software management and its religious obsession with agile and scrum and whatnot, wasting precious time over and over again doing meaningless meeting that should’ve been an e-mail, requiring me leaving and then returning to the flow, which also takes time, so it’ll just add more to the heap of wasted time.","Sure, I have lots of hobby projects that I work on in the weekends and that don't burn me out. It's like, sometimes you don't feel like having sex with another person because it's a whole to do, but masturbation is fine.","Corporations are just energy vampires.Actually building software is a lot of fun!","It's the business BS that I find tedious. Not the coding.","Coding on weekends is fun because I don't have to deal with other people and their expectations. I can do everything as I want and throw it all away and start over or abandon the project if it doesn't serve my interests anymore. I can write shitty code without caring about the consequences or I could try to write the most perfect system ever without caring about deadlines.","When I've experienced burn-out it hasn't been from coding itself. As a lot of other threads here have said, I like a good puzzle, a good challenge. When I've end up on a team building 20 cookie cutter microservices that provide no challenge (other than I tight timeline) that's when I've taken the opportunity to find another position or team to challenge myself.","[deleted]","Fuck them working weekends","I worked for a fortune 50 company as a full stack engineer for 6 years right out of college. I grinded those years. Day and night. Then they announced they were moving my team in our region and I didn’t want to drive an extra 20 mins to the new place and I will admit, I was so burnt out, I thought I wanted to change careers and I quit. In the end I spent two years wasting my money and fiddling with side projects. I can make a badass JRPG in unity though now so that’s fun. Point being: coding at work often doesn’t allow you to be creative and at home work allows you to explore that aspect","Something something internal vs external motivation","I don't believe 70% code on weekends. But I do believe there's a lot of burnout because it's work...","I coded on weekends because I had no time for coding during working days because of useless meeting. Now I have my own company. You know how many meetings are really necessary for running this business? ZERO!You do not need meetings, you do not need time tracking, if devs will need any business process they will create it themselves.Literally all you need is to hire the right people.Here is my hiring recipe: hire talented and trusted. That's all. I do not care about anything else, I never read CV's, never do any testing, I do not care about any experience etc etc. Talented and trusted are rare, but each will work as a hundred. I measured!(Actually it's not my recipe, I learned from the history of ancient warlord Cáo Cāo)","Right. Lots of jobs are listing volunteer open-source work as a big plus right now.","I’ve never coded outside of work for fun.","Can confirm. Writing code rn. Well not rn, im pooping and on reddit.","Hmmm, maybe the burnout is with capitalism and not coding","\"Fast food workers experience burnout, but 70% of them eat on weekends\"","It's me, I'm coding right now","I wonder how much burnout would still exist without unreasonable deadlines from management.","For me it is so I can motivate quitting early on a friday due to burning out of social energy, especially having to put on a happy face when all I want to do is sit at home and code. So I code a bit on sunday when everything is quiet and noone is asking what I did this the past 105 weekends, and what my plans are for the next 111 weekends.","I feel like everyone’s fixating on the title choice, which might be the editor’s choice, because the tidbit about coding on the weekend really is only in the last sentence. Ah, modern journalism, always reaching for clickbait.The main interesting point I noticed was how often people quit courses (75%), and simply prefer documentation and forums for skill development. I see the forum thing as what AI will actually replace soon - instead of trying to find the right person and ask a good question, your bot will get you 99% there quickly. The problem is that these people won’t know if it’s a quality resposnse or not, and thus the cycle of crap “best practices” will continue.Otherwise, it seems like TFA agrees with everyone:Pay raises, appreciation from colleagues, seeing that one’s work makes a difference, and enjoying the work itself are respondents’ top reasons to feel productive. Some said that upgrades in hardware, tooling, or learning how to use their tools better would make them feel more productive. Still, the most important factors of developers’ satisfaction have to do with people and organization more than with technology.:shocked-pikachu:","Coding what you want is incredibly relaxing. The \"but\" here is useless","How do you all come up with personal projects to work on? I enjoy coding but I’ve honestly never had an idea that seemed “worth it” to work on in my free time instead of spending time on my other hobbies. Unless it’s a toy project that I’m using to learn a specific tool or language, I almost never code outside of work.","Coding and solving problems for fun is .... fun?But seriously, I do semi-regularly combine what I'm doing at work with the \"fun coding stuff\" - so essentially do some work on the weekends, and it's still fun (for me).It sometimes scratches the itch, and at the same time let's me be more productive at work, which in terms let's me raise the bar on my contributions (which can certainly have positive effects for future you).But then sometimes what I'm involved in professionally is not that interesting and so I have to go just greenfield some side-project.Either way works for me.Bottom line is I just like coding, design, solving problems, etc.; I enjoy learning new things in domains I would otherwise never know anything about or explore, but doing it through software development.I suspect there are many folks out there like this.","I only feel burned out when I am a developer, QA, PM, and manager at the same time. A good manager won't let you burn out.","I mean, I like coding on my projects, because those projects are actually interesting. To me.The work ... sometimes there's interesting stuff, sometimes (most of the time) there isn't. It pays the bills and that's that.","I get burnout when the requirements of the project suddenly changes after spending all that time and effort with the original requirement.The inability to layout and not divert from requirements is the only thing that bothers me about the software development cycle. That and documentation (which I don’t mind provided the previous person working on it didn’t do a shit job that I have to clean up).","I'm like are you kidding me, I'm not that old...https://www.reddit.com/r/programming/comments/18sn8f8/developers_experience_burnout_but_70_of_them_code/Seems we're on the monthly recycle again","Burnout is from social games played by coworkers to make you look as stupid/awkward as possible in front of everyone else.","Coding is problem solving. You know the problem in your head and it's hard not to think of solutions. Then when you come up with some ideas it is tempting to try them out in code. And you can do that without having to be in the office.","find weekendsfind: ‘weekends’: No such file or directoryps: i'm surprised how many people here share the same sentiment, we love the craft, not the office game. We need business and team dynamics tricks to restore more coding fun and avoid the useless drama I guess.pps: I remember when I was out of IT, working manual labour part time and doing SPA on the side alone, things were so much more fun. I had control on my pacing, work structure, quality.. anything positive or potentially so I could try a little to assess the workflow / features benefits. Very much unlike in a corp job.","Coding doesn’t burn me out, it’s making all the pieces fit together between programs & IDEs & configs & environment issues that burns me out. I’d rather code 8 hours straight than figure out dependency issues or why dev tool A doesn’t work with app B","70%?Naw dog that ain't right","There's no chance it's 70% unless the question was \"have you ever coded on the weekends?\"","People are not necessarily sick of work, but of BS.","I am not burning out, at least not yet, but i struggle with all the shit i have to do which doesn't involve coding at all.","I've noticed at my own workplace that the people who seem to get burnt out quickest are the ones still messaging the slack at 8pm on a Friday. And this isn't due to an emergency. They're still doing regular Jira tickets. Like I get it's great if you love your job but people really need to set personal boundaries.Balance is key.","70% of them code on weekendsBecause Friday is when all the non-coders file dozens of Jiras to show their managers that they accomplished something. And Monday is when you get gang jumped with a swarm of \"check in\" meetings.","On the weekends I can code on the projects I like, during the week I have to do what brings me money, and those two things are often not the same.","30% represent.","I enjoy the shit out of coding. Coding isn't the source of burnout. In fact some simple coding on personal projects often helps clear my mind of work stuff. It's like \"just playing\" versus working.","Yeah that's the fun part and it's also possibly the project that they could actually make money from instead of just being a wage slave","Yeah coding is taxing on mind and our thinking consumes the highest energy. Brain is the most expensive organ we carry around with us.","I used to code outside my working hours as an outlet for my own curiosity about new tech end engineering practices, but this all faded after I became a parent 😅 Really, I’m either totally exhausted or really happy to spend time with my LO after I finish my day/weekend.","I’m surprised the number is 70%. That being said obviously working on your own project with your own technology is much more fulfilling and enjoyable.I really doubt 70% are working every weekend on personal projects though…and I’m sure some of that 70% is people modifying small configs or scripts.","Its 230am on a Monday, and I just finished up making something work that has been bugging me since friday. It does make work a lot easier for what's about to come in the next few days, and I probably could have waited until my working hours. But it stayed in the back of my head since Friday, and I am glad I have everything in place now.","That's obvious. Devs don't get burned out because of coding. Devs get burned out by sh1tty management, crazy deadlines, office politics, sh1tty pay, long hours, etc.Coding is usually the only decent thing about the job.","I find the my weekend project to be psychologically unrelated to my work projects. I can be sick of work and then relax a bit by working on my side project."],"points":2804},{"text":["Stack Overflow: 79% of Developers Considering A Career Move","79% of developers who didn't roll their eyes at this poll's premise and move on.","I thought that was every developers dream? We all want to quit, start a farm, and never go back unless its for ourselves?","Even a junior dev like me clearly can see This is clickbait","Considering vs doing it makes a big difference. A lot of people are complaining, but are afraid to change the workplace due to loans, having to pay for family, etc.","> developers are increasingly thinking about changing employers.Literally the chart directly below this quote shows that this is only true for the 55+ age group.","Even aside from the obvious clickbait, I do sometimes doubt if my career choice was the right one and if i maybe should have just gotten into trades or something else.Then I get back to whatever weird stuff i was doing before","If doing the same job at another employer counts as a “career move” then yes, I would imagine a large percentage of developers are “considering” it at any given time.","I f***** my hands up badly during a release push. And then the owner of the company decided to double down on nepotism and I called it a day.The hand physical therapist seems to think if I take a long break my hands will recover, and it seems to be the case. Turns out not being on a computer every day feels amazing.So I'm taking my time letting my hands heal and I'm making fursuits. I'm pretty good at making fursuits and I know it's a road to poverty but I'm tired of all of the ethical problems of working in tech, and instead I get to make fuzzy animals.","Easiet way to get a salary bump or promotion.","Lots of devs never had a blue collar job and it shows..But sure get out of your comfy chair and see how you like it, bet you will be crawling back after a few weeks","People still visit SO?"],"points":700},{"text":["A tool for Software Estimation","Ah, a tool that automates pulling numbers out of asses. That does sound like a time saver."],"points":1},{"text":["How 0.1% Companies Do Hyperscaling"],"points":0},{"text":["Let's Bring Back JavaScript's `with()` Statement","In this snippetwith (data) { await saveToDb({ imageUrl, width, height, }); }I'll never be sure whether these three properties come from data or from somewhere else. How does this improve readability, if now I have to keep in my brain the whole list of possible scopes?If it was using destructuring, I could do a text search for the identifier and find where is it defined and coming from.","Let's not.","Why do we need a other scope? const { name } = personWe can even delve deeper that the with couldn't const { address: { city, street } } = person","It's confusing and might trip you up. [...] This is a good critique, but in my opinion, not a lethal one. It's the developer's (poor) choice to write code like this, and seems like something largely solved by education.Really? Has anybody been under the impression that that's the direction we're taking lately?I say let's get rid of all features that are used because of lazy 99% of the times and for valid reasons 1% of the times and have a reasonable substitute. with() is one of them.","No, please.","This article clearly lays out why it’s a bad idea without equally compelling reasons in favour of it.","Let's just remove Javascript entirely","Rapid Recap:This post advocates for the reintroduction of JavaScript's with() statement, despite its current deprecation. The author compares it to Kotlin's scope functions and appreciates its syntactic simplicity. Criticisms of with(), such as readability issues, scope leak, and performance challenges, are discussed. Alternatives like destructuring assignment are considered less effective from a readability and semantic perspective. The author suggests a modified version of with() that doesn't search the prototype chain to improve performance. Historical context and potential use cases are also explored, arguing against universally discouraging with().If you don't like the summary, just downvote and I'll try to delete the comment eventually 👍","Wouaw I never even heard of it before 😅"],"points":152},{"text":["7 Common CSS Mistakes Junior Frontend Developers Make (And How to Fix Them)","Sadly the person writing the article missed the importance of being able to stop an animation so that you can actually read it. Animations have a purpose in education but I'm not convinced they solve a problem here. I'd rather see the good and bad side by side."],"points":0},{"text":["How to Build a Simple Sentiment Analyzer Using Hugging Face Transformer"],"points":0},{"text":["Using LLama.cpp with Elixir and Rustler"],"points":0},{"text":["Essentials of TypeScript Classes","Overall it is pretty fine, might be a bit too explicit for those that can program a bit but whatever, better too much info as too less in this aspect. I feel like in general you are missing some transpiling information, like in the end it always will be (some what readable) javascript. And i feel like some people dont get that well enough by using typescript.It could use a paragraph showing the # private variables and explain it is a javascript feature, and buildin objects like Promise use this to store the internal value of the resolved value etc. And that typescript transpiles this to a weakmap, and thus you can use .apply/.call methods on method, but with the native version of js, this breaks.","Good stuff, lots of great examples in here. This would make a good bookmark to share with teammates who are new to TS and need a quick onramp"],"points":0},{"text":["Security and Privacy Failures in Popular 2FA Apps -- \"We identified all general purpose Android TOTP apps in the Google Play Store with at least 100k installs that implemented a backup mechanism (n = 22).\"","This seems outdated since google authenticator does support cloud backup currently","The submitted link is from \"Interesting Links\" in https://old.reddit.com/r/termux/comments/19573gg/encryption_decryption_android_11_operating_system/ (\"Encryption, Decryption, Android 11 Operating System, Termux, And proot-distro Using Alpine Linux minirootfs: cryptsetup v2.6.1 And LUKS\").","Yubikey for me.","We found 2FA via authenticator apps like Google Authenticator had hidden costs when it came to user support, since users frequently lost their 2FA secrets. When given the option, I prefer the \"less secure\" 2FA methods of password + SMS code or password + email code.","I avoid 2FA when I can.The risk of my phone breaking is higher than hackers hacking me :DIn fact I broke multiple phones and I never got hacked once via a guessed password.edit: lol at the downvotes… you all own nokia 3310?"],"points":105},{"text":["Does your company care about Developer Experience and if so, how?","DevEx looks like the buzzword of Q1","Does it fall on the company or the dev to tailor the dev experience? Surely both play a role, but isn’t it ultimately up to the dev unless they want to be spoon fed a certain experience?","Our DevX is pretty bad in some regards, but I’m honestly in disbelief that my company took 3 of our best engineers and threw them at the problem for 3 months in Q4.","The easiest devx fix is buy your developers faster laptops. Waiting for compiling between edits when debugging just kills my flow and motivation and spending an extra 1000$ on my laptop would fix it.Also my laptop has lime 3 malware scanners and each and every one of them wants to read every file i access. Javascript webapps can have thousands and thousands of 1-4k files and it just destroys performance when 4 processes want to read the files during an npm install or build.","At office there’s a gaming console that hasn’t been turned on in 3 years. How’s that for DX","Not having any basic tools, losing any access we managed to get one week ealier because SecOps did a cleanup is a terrible experience. My company excels in that.","lol, no","I have to work with Salesforce, so no."],"points":21},{"text":["Setup scripts for API monitoring"],"points":0},{"text":["Finding all used Classes, Methods and Functions of a Python Module"],"points":0},{"text":["100+ resources to become a great engineering leader - Gregor Ojstersek","Reading blogs and following people on LinkedIn is no replacement for experience with building systems. It's okay to be aware of different ways to do things, but as we all know in the end you only learn when you do it.I don't think I'd care if my leader consumes any of this."],"points":2},{"text":["A Practical Guide to GNU sed With Examples","Using awk is more verbose, but that is exactly why I usually prefer it. It helps when someone else (or me after a while) needs to read the script later."],"points":0},{"text":["Java Reference Tutorial For Young Programmers"],"points":0},{"text":["Gitlab account takeover vulnerability","I recently upgraded a Gitlab install from v14 to latest v16 using the online upgrade path tool instructions. It detailed each version to upgrade to and was straightforward.https://gitlab-com.gitlab.io/support/toolbox/upgrade-path/"],"points":1},{"text":["Netty Source Code Analysis-Packet Sticking And Unpacking Issues"],"points":0},{"text":["Why Java Introduced List.of() Method?","Nothing to see here. Not even a comparison to Arrays.asList.https://www.baeldung.com/java-arrays-aslist-vs-list-of","I immediately leave websites that don't offer me a 'deny all' option for tracking stuff.Should Reddit block such accounts having 'ad' in their name?","The title isn’t even a correct sentence."],"points":33},{"text":["Making Sense Of “Senseless” JavaScript Features","To Cut a Long Story Short:This article delves into seemingly illogical features of JavaScript, exploring their origins and practical implications. It examines peculiarities like the unexpected results of floating-point arithmetic and the nuances of type coercion. The piece also discusses automatic semicolon insertion and the presence of multiple 'bottom values' in JavaScript, such as null and undefined. It aims to provide a deeper understanding of these features for more effective JavaScript coding.If you don't like the summary, just downvote and I'll try to delete the comment eventually 👍","bad bot"],"points":6},{"text":["Using ChatGPT, Abstract Syntax Trees, and Boolean Logic to Build a No-Code Platform"],"points":0},{"text":["Ajax Requests with HTMX","...ajax? Now you're just fishing for what ever trash you can find to spam.","Why?","Here's what you need to know:The post explains how HTMX enhances user interfaces by simplifying AJAX requests directly from HTML. It details various HTMX attributes, like hx-get and hx-post, that trigger AJAX requests using standard HTML elements without needing JavaScript. The post covers advanced HTMX functionalities, such as event-trigger modifications, request filters, and request indicators, demonstrating how HTMX offers a streamlined approach to creating dynamic, interactive web pages using HTML attributes.If you don't like the summary, just downvote and I'll try to delete the comment eventually 👍","Oh look, another spam post.","This is pretty neat. Would be nice if each example shown also had the request body alongside to help illustrate what’s going on - e.g. hard to understand what’s being posted in that /messages example"],"points":18},{"text":["YAS-QWIN (Yet Another SQL-Query Writing Interface)","But why?SQL is quite powerful when used complexly, and quite simple when used simply.","YATWDNAWPNUYet Another Tool We Don't Need And Will Probably Not Use","I read that in bimbo-celeb voice (kim k.) \"Yaaas Qweeenn\" :)))"],"points":7},{"text":["Open source rewrite of Civilization 1 Source Code - OpenCiv1 Project","I'm a big fan of Civ (V is my favorite). Not sure why they chose Civ 1, but it's a start!Seems similar to the Julius/Augustus version of Caesar 3 which is awesome!"],"points":0},{"text":["Struggling with `CreateCredentialCustomException` in React Native for Android Passkey Integration"],"points":0}]