[{"text":["Sextortion is fastest-growing crime targeting minors in North America – and social media companies can do more to stop it, study finds","I’ve been in the comments and advocating for comprehensive sex Ed to address this as well as bodily autonomy and consent. What was shocking at the time and less so upon reflection is just how young these sextortion crimes happen.Realistically the coordinated attacks by groups like the Yahoo Boys or their copy cats, when combined with lack of supervision and precocious puberty, it seems like we need education on this for 5th and 6th graders and even that might be too late. You can preach “don’t send nudes” until you’re blue in the face, but until they read about how quickly lives are destroyed and know the dangers, it won’t help them.Social media companies need to act on this, and fast, but parents have to step up because this can be solved in part through education.","Had this happen when I was 16Ended up paying 200$ and nearly dying of panic thinking my life was ruinedI still wonder if that image of me is somewhere out their floating around on the internetSuffice to say I never did that again but it was incredibly frightening and I think it’s sick they target minors","Just finished reading about the (adult) romance scams also done from some countries (Ghana in this case). The oddest feature is that the criminals are often controlled by “priests “ who bestow magical powers of persuasion on the criminals in return for a cut of the money.","Of course they can!!!!! We ALL CAN except men rely on sexual exploitation or turn a blind eye to it because it does t affect them.What I love is the irony of telling girls:Don’t SEND any sexy pictures of yourself or sextortion is your fault.DONT TAKE any sexy pictures of yourself or sextortion is your fault.And now we’ve got Deepfakes and AI soNow what: we can’t put our faces online? Maybe cover up! Maybe stay home!I guess until we have laws girls are free game because none of this is “real” anyway and we can all use some plausible deniability.","I have a sick feeling this is gonna get even worse with AI and deepfakes.","People are sick.Not only are we in times where depression, mental issues, loneliness, and suicide is rampant but people are trying to profit off of it as well."],"points":0},{"text":["Apple was just forced to crack open its App Store — but the changes are already being called 'hot garbage'","98% of people buy Apple for the ecosystem.","I don’t care about openness in an iPhone. I buy Apple, in part, because they work beautifully out the box with no fucking around.If you want to fuck around with the hardware and or software. Get a pc.","Yeah, but the guy who called it hot garage is Tim Sweeney. The Fortnite guy who wants to smash everything that works decently to make more money.","Nice, the walls are coming down. I finally can consider an iphone, now let me default to spotify."],"points":0},{"text":["The year of Windows on Arm? Google launches official Chrome builds. Chrome for Windows-on-Arm should hit stable in time for Qualcomm's big launch.","I want an unstable canary."],"points":0},{"text":["Google just settled its multi-billion dollar AI tech patent trial"],"points":0},{"text":["We Asked A.I. to Create the Joker. It Generated a Copyrighted Image.","I mean, I'm not a huge AI fan but...« he asked Midjourney, an A.I. image generator, to create an image of Joaquin Phoenix from “The Joker” »What were they expecting then?","“We asked AI to create an image of a copyrighted character and it made a copyrighted image!!”… yeah, shocking. 🤷‍♂️","Paywalled, downvote and junk","AI doesn't createIt just reuses other people's content","Garbage post"],"points":87},{"text":["The Apple Macintosh was first released 40 years ago: These people are still using the ageing computers","It cost close to $5000 with printer when first released. Wow","Still have mine. Complete in the box, with all the accessories, sales brochures, and invoice. Last time I checked the battery still was powering the clock. Of course that was in like 2001.","They had great keyboards.","The fastest Mac back then was actually an Amiga:https://www.youtube.com/watch?v=8v4BaWwoyA0","Just install OCLP on it, it will be fine/s","Everything in the existence is aging, duh.They should have used “ancient” or something that makes sense.","Bought a Mac Plus in 1989. Still have it. It still works. 20 MB hard drive cost nearly as much as the computer.","Yeah, but is it Y2K compatible?"],"points":38},{"text":["NSA finally admits to spying on Americans by purchasing sensitive data","Wyden is arguably one of the best sitting senators. Definitely the best when it comes to citizens privacy right.","So someone will go to jail? Someone will lose a job (and not be allowed to return)?No?Just telling them they must delete the data... and no verification that's done or that it won't happen again?OK then, carry on, nothing to see here.","I wonder who else is buying the same information","Wydan said that he was \"not aware of any requirement in US law or judicial opinion\" forcing the DoD to \"obtain a court order in order to acquire, access, or use\" commercially available information that \"is equally available for purchase to foreign adversaries, US companies, and private persons as it is to the US government.\"","I’m disgusted by the fact that my tax dollars are going to buying my own data. Cut out the middleman and pay me, I’ll give you my data.","I don’t care that the NSA bought the information. It is way more chilling that the information was there to be purchased at all, by anyone.","Corporations more powerful than government of course","Purchasing our personal information with our own tax dollars..","Wtf, just purchase it directly from me in the form of a tax rebate and stop going through the middleman.","I have to renew my license at the DMV, and they require an appointment and use a third party scheduler.I submitted the required personal info in the form, which is personal personal, and not even 30 minutes later and for several days after I received hot lead telemarketing calls and voicemails nonstop. What the fuck?","Can I purchase my information back? I've forgotten all my passwords","*government admits that corporations putting profits over people is now inextricably linked to state surveillance of said people.","Wait till people find out what they won't admit to.","Love me some North Korea err ‘merka","Be real, data brokers are literally just CIA fronts to skirt the law. This regulation will do nothing.","And they’ll never ever do it again, so no harm no foul….👍🏾🖕🏾","Guess whose money the NSA is using to purchase your data to spy on you? Yours. They are using your money to bypass surveillance laws to gather information about you.","“It’s not spying if we bought it!” Big brain move right there.","Anyone keeping score? How many times does this make that they've made such an admission?And the CIA?FBI?I'm almost more afraid of what my media/intertoob providers would cop to, Samsung or Apple, Microsoft, Google, the credit agencies, my potential landlords...","Fu€king sad","If the power of the state is used to control rather than protect the people, sum tings Ben wong.","Purchasing from who?","They bought the data from data brokers... Panties are knotted and small children panicked because US intelligence agencies purchased data which is readily available on the open market. Yet people willingly sign service agreements with social media entities that waive their rights and release their data to private corporate entities to do with it whatever they choose. Sheer idiocy.","Everyone here is targeting the wrong organization. The issue isn’t that the NSA buys it in support of its mission to defend the US. The issue is that this data is for sale to begin with. If the US government stops using it, we’re making it harder on ourselves when EVERYONE ELSE gets to continue to buy the data (criminals, adversary nation states, other companies, political organizations, etc.). The NSA is not the threat. The business model of collecting and selling the data en mass is the vulnerability, all the other people using it against us are the threat.","And this is why it will never be illegal to sell personal data.","Tomorrow’s news: NSA finally admits to spying on Americans by having telephone company delivery directories to its offices.","So yippee, they know I've given up on life and just hanging around hoping to watch it all end. Their probably doing the same thing.","Since the data is “purchased”, how is it different than other corporations?","In a surprise to no one","Privacy is an illusion. If The Gap can buy your spending, browsing, location data, & more you can goddamn expect the NSA to have it.We need laws specifically stating obtaining certain data is off limits. Not just for the NSA.","It’s not “spying” if they are just buying the information we give away to corporations.","They are actively targeting anyone watching too many cat videos cause they know cats could take over the world one day.","This is huge and should have a lot more press","They looked at a dashboard and saw we all already knew","I mean you have to be extreme ignorant to still believe your gov don’t spy on you","Least surprising headline of the decade","Okay like we didn’t know this already? It’s actually legal for them to do this ever since the Patriot Act got introduced. Does not mean I agree with this at all. I think it’s downright egregious","So we pardon Snowden next right?","I trust the CIA more than the NSA","Anybody else seriously disappointed? The spying yes, but also having to resort to data brokers. All those mathematicians, cryptanalysts, compromising agreements with NIST, telco trunk taps for naught when someone else does the job better.","how is this news? everyone knows your phone spies on you","Did anyone expect otherwise? Privacy died years ago. Move on","Oops. We broke the law again. What are you going to do about it? Nothing? Yeah, that's what we thought. You fucks can't even agree to fund the government, we're not concerned that you're all of a sudden going to come together and create any privacy laws.This is what I imagine the NSA is thinking.","Five eyes! Five eyes! Five eyes! Five eyes! Five eyes!","No surprise. Obama started it","“Buying it”Is honestly probably the least malicious way they could get private info lmao","Say it ain't sooo!?!?","Selling it to them myself wasn’t an option?!","All of the NSA and CIA's servers should be wiped.","Purchasing with our own taxpayer dollars to spy on us lol","I feel like we are always fighting them on these privacy issues. It’s exhausting","What?!?!?! This is the first I’m hearing about this!","before you approach them","So like what happened to everyone’s biometric data that was collected in NYC during Covid under the guise “the key to NY”?","I was surprised to hear they paid for it. Since they are very tight with all the US tech and telecommunictations firms I'd have expected them to just basically send it to them real time.","Thanks Snowden","The NSA has always been spying on its citizens. Just because Snowden revealed it doesn’t mean it stopped.","Meanwhile China tries to destroy the minds of Americans through Reddit and Tik Tok.",".","Imagine if we used that info to save lives instead of blackmail and spy. We pump it it into algorithms to sell you literal shit. The internet could have been such a great cool tool.Oh well","Talk about lazy.","Well, every foreign intelligence agency on the planet has done that, what gets me is how many of those foreign agents actually do work from within the N.S.A and every other agency in the U.S and WE the People (CITIZENS) just keep getting handed the bills to keep all of them in place.Personally, I think a REALLY GOOD house cleaning is in order and way overdue but that is just me.Started going downhill in the 60's and only gotten worse National Defense units are also in the wrong places at the wrong time.N. S","In other news, water is wet and not a single person on Reddit will ever lift a finger against the big bad Gubment","so snowden can come home?","It’s one thing that these bastards have our data; we knew that they have our data. Did they really have to spend our tax money on it?!","Don’t worry, they are lying still and have all of the massive data storage and compute power to rival any private company pointed at collecting any and all data on Us Citizens in the US… for our “safety” of course.Why would we trust them after Snowden? After this news?They are just pulling the classic maneuver of any criminal caught red-handed – cop to a lesser crime. W","It’s funny they always admit what everyone already knows","So NSA not getting the data will somehow prevent the data from being collected and sold to anybody who wants it?","Long live Big Brother!"],"points":494}]