[
    
    {"text":[
        "Soon, Police may have to get a warrant before viewing your Ring Camera Videos.","This is a misleading headline","it doesn't say this?But, he warned, it would not necessarily stop police from continuing to persuade Ring users to voluntarily give up their rights. Police are able to contact Ring users off the app. And Ring users can still decide if they want to voluntarily send video, sounds or images from their Ring devices to law enforcement.“Ring users should also know that when police knock on their door, they have the right to, and should, request that police get a warrant before handing over footage,” if they don’t want to turn over footage, Guariglia said.","\"“Ring shutting down the ‘red carpet’ surveillance portal they offered to police is unquestionably a victory for the coalition of racial justice and human rights advocates that have been calling to end these partnerships for years.\"Just so everyone knows, the police have never been able to directly access your Ring cloud storage account without your knowledge and permission. If they wanted to do that, they would have to get a search warrant wherein they requested footage from a specific timeframe. That's always been the situation. This article concerns a practice within the \"Neighbors\" portion of the Ring App wherein the police would ask people to upload relevant surveillance video about a certain incident. People could either cooperate or not. It's literally not different than a \"request for information\" billboard.Amazon - in the most gratuitously racist move I've ever seen - shut this down because, apparently, they believe that the surveillance video will necessarily hurt black people, who they presume are the ones the footage will depict engaging in criminal activity. They'd prefer that these crimes go unsolved, apparently. There's a lot to unpack here. It's pretty remarkable, actually.","I live in EU and this is something that is kinda a no-brainer. I’m surprised that a privately owned device wasn’t considered a property that requires a warrant to be accessed in US.","Wait, how was it ever any other way"
        ],
    "points":9
    },
    {"text":[
        "Humanoid robots will join BMW's production line","Thanks I hate it"
        ],
        "points":0
        },
        {"text":[
            "The era of the AI-generated internet is already here","It was already here for years.","Slow news day at Mashable.","insert internet explorer meme","By \"here\" if you meet literally right here you are definitely correct","The idea of widespread model collapse is incredibly dumb.If you train on human-generated content, you end up teaching it patterns that occur in \"natural\" human-generated content so that it can reproduce those patterns in \"synthetic\" AI-generated content. The goal isn't reproducing any \"natural\" content, it's solving the problem of telling the model what's \"correct\" output for given inputs. Train blindly on other synthetic data, and you will probably find a mix of \"correct\" ideas and \"incorrect\" ideas and be reinforcing \"incorrect\" data as \"correct\" some of the time, and that process is obviously one that would deteriorate if iterated.The thing is, it's not some magical property of \"natural\" content that models get ideas of \"correctness\" from. If you train on high-quality, well-labelled synthetic data, then that's \"correct\" enough to satisfy the needs of training. If model collapse is a risk, then training methods will simply be changed to avoid that sort of degradation. If adversarial noise (that try to trick models into learning \"incorrect\" ideas) is a risk (and it's unclear to what degree tools like Nightshade are effective at all), then training will add tweaks like bilateral filtering to defeat them, or perhaps someone will design an efficient classifier model to detect them (it's polite, after all, to accept adversarial noise as a request to not train on a given image, even though the nature of that request is not so polite).More significantly, the issue is going to be trying to make increasingly good open models that anyone can use on consumer-grade hardware. It's a problem that these tools aren't more widely usable directly by the public but instead are often controlled by large corporations like Microsoft who can and will design experiences designed to extract money from their users. Proponents of AI regulation need to make sure that they actually hurt corporate use—especially when these corporations already have enough money or large enough media libraries to train their own models no matter what the law decides about the legality of training on publicly-visible images from the Internet. I'd rather a world where Stable Diffusion exists than one with a very profitable oligopoly for corporations like Adobe, Getty, Microsoft, and OpenAI."
            ],
            "points":0
            },
            {"text":[
                "Japan’s moon landing picture might be the space photo of the decade","| Face-planting on the moon wasn't part of the plan...My favourite line in the article.","Japanese quality. Lean Manufacturing.","Landing accuracy: A+Landing orientation: F","Another fine landing by Kerbal Space Program.","Any landing you can walk (or roll) away from is a good landing.","Hold up, if that's the \"lander,\" who TF took the picture?","How this happen, bounced to hard the first time and flopped over?","Reverse engineering?","It’s sad for humanity that a picture of a failed moon landing might be the space picture of the 2020s"
                ],
                "points":31
                },
                {"text":[
                    "NASA caught a glimpse of Japan’s “Moon Sniper” lander after it landed."
                    ],
                    "points":0},
                    {"text":[
                        "In major gaffe, hacked Microsoft test account was assigned admin privileges — How does a legacy test account grant access to read every Office 365 account?","This is what is commonly known in the cybersecurity industry as a \"whoopsie\"","MSFT provides so many ways to get a company's contacts. The DAY after my company assigned me a brand new email alias, I had a software scam vendor email campaign hit it.","Ars Technica’s Dan Goodin:The hackers who recently broke into Microsoft’s network and monitored top executives’ email for two months did so by gaining access to an aging test account with administrative privileges, a major gaffe on the company's part, a researcher said.In Thursday’s post updating customers on findings from its ongoing investigation, Microsoft provided more details on how the hackers achieved this monumental escalation of access.The hackers, part of a group Microsoft tracks as Midnight Blizzard, gained persistent access to the privileged email accounts by abusing the OAuth authorization protcol, which is used industry-wide to allow an array of apps to access resources on a network.After compromising the test tenant, Midnight Blizzard used it to create a malicious app and assign it rights to access every email address on Microsoft’s Office 365 email service. In Thursday’s update, Microsoft officials said as much, although in language that largely obscured the extent of the major blunder: “The threat actor then used the legacy test OAuth application to grant them the Office 365 Exchange Online full_access_as_app role, which allows access to mailboxes.”Kevin Beaumont—a researcher and security professional with decades of experience, including a stint working for Microsoft—pointed out on Mastodon that the only way for an account to assign the all-powerful full_access_as_app role to an OAuth app is for the account to have administrator privileges.“Somebody,” he said, “made a pretty big config error in production.”","There is a lesson for all of us in this…","This coming from the company that at least 95% of consumers depend on to protect their data.","Explains why I just saw MSFT principal test engineer position advertised on LinkedIn","It may not be fools proof but I still have friends asking why I don’t backup my files “to the cloud”. I’m good with my pc, not someone else’s holding all of my personal and sensitive files.","Why does anybody at Microsoft have the ability to read the emails/data in someone's account? Aren't they encrypted behind a password? Not a programmer but I thought that was how it worked, storing nothing in plain text.","Posts picture of Bill Gates & Jeffrey Epstein laughing uproariously","Is this why Teams was down yesterday?"],"points":126},{"text":["Big tech is thriving despite the layoffs","Big tech is thriving because of layoffs. Numbers are great, shareholders are happy. Screw the rest.","Big Tech CEO's and Executives Thriving Despite Layoffs - there I fixed the headline","It's the other way around: \"it's doing layoffs despite thriving\"","Cool. so happy for the shareholders while I struggle to find a job","Just watched that episode that episode on McKinsey with John Oliver. Makes me feel that all them MBA consultants BS told upper management to layoff ppl and increase salary and share revenue for higher ups. Profit","You mean thriving even more from the layoffs 🤔 they just cut the labor force 10% and add 10% more work to the remaining workers for 0% more pay 🤗 Let's not pretend that it's a consequence rather than a way to increase the margins.","Not despite, but because of the layoffs. They save a bunch of money and their stock goes up because of that.","You said “despite” when you meant “because of”.","Executives are getting bigger bonuses than ever while low level employees get laid off by the hundreds and thousands. Everything is going great for the people who matter!/s","well no shit there thriving, they just layed off millions of $ worth of employees, share holders love lay offs.","There was a large \"grab em while it's hot\" rush during the pandemic. In tech, you could quit your job on Monday and have 3 offers before you went to bed. There was a big rush to help with telecommuting, AI, or just a seasoned vet. Now you can pick and choose the top performers and cut the rest.","Some companies I’m hearing from friends that the layoffs were needed as there was tons of redundancy due to bad management, others I’ve heard are now on a skeleton crew and the people that are employed are screwed.","They are thriving because of the layoffs.","Big tech execs are thriving because the layoffsFixed the headline.","The internet is full of posts from people working at big tech claiming they were hired but are not given any work to do. They are employed just to make sure they don't go to the competition. And some of the people actually \"working\" are maybe working 10 minutes per day. Like the guy who said that changing the color of a button on a google website is a 5 minute job (I mean.. it is), but they simply log it as a task taking a day or more and then they do whatever they want for the remaining time.","Executives need more bonus.","Hey, my industry (insurance) is getting smashed and losing record amounts and laying off people.My job has been eliminated altogether and my last day is in a few months 😶‍🌫️Tech out here making outrageous amounts of money and still laying off people.","On one hand, I’m glad that the tech sector fund I bought at $250 is at $500 today. On the other hand, I don’t like the fact that such a large portion of my investment portfolio is tied to only 7 companies. I’ve started buying funds that don’t include them.As far as the layoffs go, that’s an unfortunate byproduct of our culture where money is the only measurement we use for success, and there can never be enough money. It doesn’t matter how much you made last year, you are a failure if you didn’t make more this year.Of course that culture is built on consumer behavior. It could not exist without us. So many individuals also don’t believe there is ever such thing as enough, and we can’t be content with what we have. Our always wanting more sustains their always wanting more.","I don't think it's factually correct article because add sales are slown down.","Uh the whole point of lay offs is to reduce costs so a company can continue to \"thrive\".","people act like a company’s goals are to employ people. “Best economy ever” according to 46","They should lay off more","It ain't the industry to be in right now unless you work with LLMs","a better way to say it would be that workers are expendable. as long as we make money.","Too many people were hired during the Covid boom tbh, so now they are on a diet.","This is the answer.","Woah lots of redditors ITT learning about ZIRP and disillusioned.","AI is the new intern","I mean, it’s really out of control in the US. Layoffs shouldn’t happen unless the company is about to fall apart. The burden of proof needs to be on the company to prove they need to layoff these people to survive, not just improve their margins.","Well yeah, they overhired and are now at a more reasonable employment level","Big tech companies overstaffed. This is a correction.","layoffs are just keeping the wages low industry wide, so more profits for the shareholders.","These tech companies think AI will solve all their employment needs. It wont, but they act like they dont need employees and employees should take pay cuts to keep their jobs."],"points":888},{"text":["Microsoft CEO: AI needs ‘guardrails’ after fake explicit images of Taylor Swift go viral","They've been pasting famous heads on other people's naked bodies one way or another for years. Now we need guardrails?","There will be always be an independent developer doing stuff like this. Is a wasted effort","Well, I'm just glad someone is looking out for our Lord and Savior, Taylor Swift.","This has been happening for years.Incredible how bad things can keep happening until they hit certain people","An overhyped musician got ai nudes and suddenly governments and tech-corps go apeshit.What a joke","Seemingly unpopular opinion: I don't think there's anything wrong with the Taylor images.They aren't selling them. They aren't claiming them to be real, or committing some sort of fraud/slander with them.Should it be illegal to imagine having sex with Taylor Swift? If my 8yo daughter draws Taylor swift and writes a story about meeting her, and then I share that drawing and story with my friends, is that illegal?Those pictures are just an illustrated fantasy.​Edit: second thought experiment --If a woman with a very similar build to Taylor Swift gets plastic surgery to make her face look as close to Taylor as possible, and then makes porn, and sells it. Is that illegal?","\"AI might kill us all\".... nada.\"We can see fake Taylor's Swifties online\".... Oh my GOD!!!! We must act!!!","You only realised this now after they take the jobs, I am sure Microsoft uses AI and fired lots of employees.","You mean 'moat'.","but AI was fine doing this to everyone else until Taylor swift?","I understand how uncomfortable Taylor must feel but people have been photoshopping celebrity nudes for decades. Stuff like this is going to happen. Theres not really any stopping it now.",">fires a bunch of people to replace them with AI>wait we need to control AICEOs have no idea atm and they're literally just going to be throwing money down the drain over the next few years as they chase this, going to be pretty funny for everyone involved.","Why is Taylor swift nudes causing AI guardrail talks ? Lol so so many more important reasons for guardrails","And let’s be clear: no one in this world matters at all, except for billionaires. The deepfakes can happen as long as it’s not billionaire psyop Taylor Swift","Oh so by \"guardrails\", you mean \"stuff to prevent anyone doing anything with it that doesn't directly financially benefit large corporations, record labels, studios, networks, or other already wealthy groups\"?","Hey Microsoft, fake nudes have been around a looong time.","You people are a fucking joke","I love how Taylor Swift one of the richest women on the planet was the tipping point.","I dont understand. This was a thing since Photoshop. Can we get them to turn against Adobe instead?","Bruh why his hand in that position.Hogwarts-goblin lookin’","No, fuck that. Stop trying to control everything. People have been doing that for centuries, it's really not that big of a deal.","Regulation for thee, barriers for me!","Just watched an AI hype video where some asshole talked about how they have all these data points they've been collecting for the last ten years and my main thought is whether or not their clients even gave them permission.Lawsuits, lawsuits, lawsuits.","Notice they only give a shit when another elite is affected.","No - we need the feds to regulate the industry here.","Now do gun control with this energy.","Lots and lots of difficult questions coming up.Consider, for instance, child porn.It’s currently illegal to merely possess it, which is unusual (versus creating or distributing it) because it’s a policy deterrent to prevent harm to the actual children (victims).But what if it’s AI child porn? There’s no harm to any actual child. How will the government justify making it unlawful?By claiming it will create “urges”?If so, then why not ban depictions of murder and violence under the same theory?","Just imagine the timeline where dummies who use ai left swifty alone there be no visible whistleblowers for regulations on ai. Too bad it to little to late","Why do they suddenly care because it's Taylor Swift? There were tons before her.","Lol, there are real problems in the world, which are way worse than high-tech erotic art","Common gals being targeted by deepfakes:Industry doesn't give a flying f#ckRich millionaire gal is targeted by deepfakes:Industry flips and cries for action","Fuck this guy now you are pretending to give a shit","Taylor Swift is the real life John Connor.","Super intelligent ai cannot have “guardrail”. Alignment or “niceness” needs to be baked into the model.Heavily Guard-railing on the path to agi is counterproductive and mostly pr","This monkey stuff is aiding the hyper wealthy to create new education branches which open up the door for new employment options and titles in the work/hire industry.. isn't that the only viable explanation for this stunt? \"Use humans to constrain AI. Create a closed source program from OpenAI technology. We're hiring.\"","What the hell is this crap? Is Satya Nadella a new fan of the Kansas City Chiefs too?","[deleted]","Taylor should become homeless, to motivate government with fixing it.","We need expertise from Atrioc, he’s been on top of this for a whole year","Guardrails aren’t the solution and are not going to stop AI from taking over the world. The cat’s out of the bag, we’re screwed.","No it doesn't. But the person who first uploaded the image onto X should be tracked down (should be easy to find), and be put on trial? Pretty sure it's against the law.","LOL what a fucking chode.","I don’t see the problem","No shit. Maybe AI leaders should have already known this....","So they went viral, meaning they are popular, so people want them. Why should the government take away things people want?","AI nudify has been around since like what. 2018? 2019? Perhaps even earlier. Now the rich bags of billionaires are jumping the bandwagon of putting pressure on the United States government to introduce these so called guardrails. Something that the middle class has been doing for a long time."],"points":279},{"text":["New NJ law says websites must ask about using your data","NOW THIS IS A STEP IN THE RIGHT DIRECTIONAbout a decade too fucking late though"],"points":7},{"text":["UMass Amherst Researchers Bring Dream of Bug-Free Software One Step Closer to Reality","I’m sceptical.Bugs like crashing/mem corruption is stuff it can help with I guess. I guess it can help with inferring what code is supposed to do and help with proof of that.The problem is business logic. Sometimes bugs aren’t the glaring mistakes. The hardest bugs are those when the code is exactly doing what it’s supposed to do according to business logic, but the thought up business logic itself is flawed.I’m a security researcher and I not only look at the fancy injection stuff.Anecdote:I had payment system that flagged a payment as “accepted” when you manually went to a specific (but always the same) URL. I informed the client, and he said they had controls in place to not deliver products if it wasn’t OK on the backend side, indicating the URL was merely visual (“Thanks for your purchase!”). Asked permission to test this, they said OK, I ordered a couple of different items without paying. Reporting meet, I handed the client a bag with their own products, they raced downstairs to the warehouse, some yelling, accountant was brought into the meet to listen in.Well, it was like he said: the warehouse would look for an OK status. The OK status was set by a batch that verified all transactions. Except it looked not at the payment provider status, but whether the system OK-ed it (so if I hit that URL) which was assumed you’d only get there after a valid callback from the payment provider.Assumptions all over the place. The accountant further looked into it, and told that he would have found the mismatch (items sold vs money incoming), but that it would have taken insane amount of time to comb through the payment provider logs, match them to purchases and then finding out which transaction did not finish. And they only would have done that if they knew the flow was flawed.In the above case, the code itself was exactly doing what it was supposed to do! Even if the code itself is perfect, if the described logics are flawed, it’s still buggy.","bug free softwarelaughs in IT","They are using not coq; rather Isabelle. There is a difference in the correctness of generated c code: debruijn condition I believe. I was just thinking about such an idea earlier this week.Edit: meant to say not.","How dose this work?","HMB - says QA Engineer"],"points":12},{"text":["Microsoft CEO calls for tech industry to 'act' after AI photos of Taylor Swift circulate X","Billions complain. Industry gives no fucks.Billionaire complains. Industry fucking jumps.","Dr. Frankenstein Blasts Monster Industry: “Something has to change.”","Only because Taylor Swift, is she that powerful?","I’m not confident in the industry regulating themselves.","It's a problem only when it affects rich people.","Breaking…big tech laying off in droves…citing immediate integration of AI in all dimensions…many jobs will be lost and there’s nothing anyone can do about it…technology is just too powerful…sorry le profit figures… Later…Yes it is a top priority that we get ahead of deepfaking Taylor Swift once and for all","The ship has sailed at this point, the technology is too widely accessible for this to be stopped. All regulation is going to do is keep it off mainstream websites, and in doing so solidify the power of big tech since they are the only ones able to effectively police content at scale. The most powerful tool we have against this is culturally rejecting it.","There have been photoshopped fake celeb photos going around for 20 years? The difference is ?","Deepfake nudes circulate in schools of literal childrenEveryone: ..........Nudes of Taylor Swift circulareEveryone: RABBLE. RABBLE RABBLE","I know thats Doomer Vibes, but what is \"the tech industry\" going to do about this? Dall-E, Midjouney, etc, are probably doing all they can so that their generative AI cannot be misused... but the technology is here and accessible to everyone.Everyone can train a Model via stable diffussion with whatever they want. They can use some porn and images from whoever they want to make AI porn. The hardware for this is affordable, and a few grand already gives you a pretty good rig to do it.the pretrained open source models are moderate (I guess?), but you can train your own model easily, and there is nothing that can be done about it. The genie is out of the bottle","How do people not see this as a textbook case of regulatory capture? Microsoft (and other FAANG) have a vested interest in creating high barriers to entry in the AI market. Pearl clutching over face swap is an easy way to get what they want.","my brother, you are the tech industry. do something.","He's not calling it for the industry to act out of benevolence.He is trying to put the brakes on competitors whilst his product gets an edge","Eh, genie--bottle. The important thing to move on is getting the courts to IMMEDIATELY stop admitting evidence that could just as easily have been fabricated this way. They're notoriously behind the technology curve and bad actors could weaponize the courts against victims by taking advantage of that.","I DECLARE BANKRUPTCY","Why is the world besotted with Taylor Swift? It... almost... feels like a publicity stunt.","Quick let’s do something so we don’t get regulated. All hail share price.","AI is already costing jobs, nothing happens. People make deep fakes of a celeb and the world reacts.","Industry responsible for deepfakes upset about deepfakes.News at 11","Can't you just manually Photoshop one of these images as well?","I don’t see any way to regulate this. The more deepfakes we have of everyone we will just assume nothing is real probably.","Who gives a shit?","Where are these photos so I know to stay away from them? Does anyone have direct links specifically so I can make sure not to see them? Disgusting. Thank you. /jk","Why is this only a problem after it affects Taylor Swift? Seems fishy","Ironic that his own product can generate these images. The dude is oblivious","X is now XXX","\"We're the ones accelerating AI and slashing jobs but yeah you heard us. Andale.\"","formerly known as X , toXic continues to stay in business somehow.","I maybe mistaken, but isn't he part of the problem?","Does Taylor swift owns the programming language swift?","The Act Swift Act or the lawsuits are coming in an endless stream once damages are proven.","What are you gonna do tho, realistically? I get that it’s maddening, but what’s the solution? The only thing I know for sure is that Congress is the wrong place to figure this out, but what can tech do that they aren’t already?","They are pretty impressive tho.","To all those asking why now? It’s really not Taylor personally as much as it is the her histrionic fans and how they immediately hammered home that non consensual deepfakes can happen to anyone.","Oh my God, that's disgusting! Naked pics online? Where did they post those?","Fake pictures of celebrities have been around for decades, why does it matter now , pretty dumb to care about it","Billionaire pedophilia ring “there’s nothing we can do”Taylor swift gets ai nudes “code red every man on deck this is a national emergency”","What aggravates me is that this happened to normal folks and nothing was done, but when ol Swifty balls has a hiccup, legislation and calls from congress start flaring up. This wont stop the more impeccable A.I. in the future from doing worse.","Ban Taylor Swift from any media... problem solved.","Guy in hot dog costume: We're all trying to find the guy that did this","This shit has been going on for years and now a rich white billionaire gets tagged with this garbage and the COG starts turning? JFC, deep fakes and photoshopped images of celebrities are extremely common. Ugh.","Let’s see them pics","#nobodycares2024","Where are these Taylor swift AI photos that he speaks of??Pls share the link so I can be properly outraged and this injustice!","Why is this a big deal","those deepfakes are really creepy, frankly there's been A LOT more shit flooding Twitter since Herr Elon bought it. i get random \"likes\" by very obvious bot accounts every single day on there, annoying","I was watching Antitrust (2001 tech company thriller with Tim Robinson and Ryan Phillipe) last night for nostalgia and b tier movie laughs. One thing I paid attention to was the 2001 tech predictions (movies love to make up technology). Two things I noticed, the movie predicted cloud technology and made explicit reference to “digitizing my wife’s face on a porn star”. In 2001. That’s all, just thought that was interesting that this issue has been around enough that a 23 years old movie makes reference to it’s dangers in a passing piece of dialogue.","I bet if you released a bunch of AI deepfakes of politicians being drilled in the ass that shit gets banned in a week.","What frivolous creatures we are sometimes. We almost always know the source of our problems and almost never take steps to rectify things until its too late.","Yeah, right. What exactly are these “actions” that will stop AI abuse?","Ugh who cares really? What a silly thing to waste time and resources with.","I love that this has become so mainstream. Because women shouldn't be the victims of perverted men's sick mind even with AI. We have enough of them in the real world. I am so happy Taylor is considering suing. I hope she does and I hope other powerful women do it too. Make it a problem. Make it a problem so that the tech industry work out a solution. Make it a problem so that governments(EU) get involved. Make everybody involved accountable.","Why wont someone think of the billionairs!","Fuck Taylor swift","This is not about TS. This is about girls and women who fall victims to deepfake ai porn revenge. Why are people so narrow-minded and can't see the bigger picture. I get it. You hate women but make an effort to not be so obvious. I'm not saying technology should be banned. It should be regulated so malicious actions don't affect us.","Pathetic, deep fake porn has been around for a long time. Why only adter swift they are taking action","Wait a second, now because taylor swift is involved it’s a big issue? Fuck off! What about every private citizen this has been happening to?","if you guys could stop masturbating that'd be great","And do what? Fake nudes have existed since before the internet.","Could you also act on the 1900 people you recently fired at Microsoft gaming sir?","What ai photos?","I am once again here to say:SauceOr it didnt happen","Musk has sure turned Twitter into a cesspool.","I do love the outrage that those Taylor photos even though they’re very fake","Shake it off Shake it off....","So it’s a big deal now that a vapid pop icon is put through the deepfake abuse gauntlet??",""],"points":5316},{"text":["Japan crashes SLIM spacecraft upside-down on the moon and calls it a \"success\" | Its two rovers are operational, and the craft seems intact but is without power until February 1","While not perfect, it certainly sounds like a success.","any landing you can walk away from is a good one","\"Task Failed Successfully\"","Listen, I've played KSP, what you're gonna want to do is spend another 10 or so years building another craft. Send that one up so it can roll the crashed one over. Just make sure not to crash that second craft too, because that usually starts a horrible cycle.","Well, it’s not really upside down if it was on the southern hemisphere. Right?","Who was on the moon to take this picture?","Techspot.com hasn’t landed shit on the moon and decides other countries landing objects within 50 ft of their intended target in fucking space is unimpressive unless oriented perfectly.","What would Mark Watney do?","Is February 1st when rent is due?","Not related to this: https://www.nasa.gov/earth/moon/shrinking-moon-causing-moonquakes-and-faults-near-lunar-south-pole/","Sort of reminds me of a certain klutzy \"meatball head\"…","I see Japan has played Kerbal Space Program before. As a KSP player I would also call this a success.","Um. So who took this photograph?"],"points":54},{"text":["Unleash your dark side in this Hexen and Heretic inspired game! Wishlist now on Steam!"],"points":0},{"text":["Taiwan Builds Own AI Language Model to Counter China’s Influence"],"points":0},{"text":["Nightshade, the tool that ‘poisons’ data, gives artists a fighting chance against AI","It also uses other peoples code without giving the required attribution or paying the required licenses... which is incredibly poetic.","This stuff keeps getting posted and seems sketchy honestly. Are these people really smart enough to program up something to fuck with AI, but dumb enough not to realize that it already has all the source material it needs from the last 30 years of internet? Why would training data even need your new DA drawing when it already has the entirety of human history to draw from? Not to mention all the ai companies coming out saying stuff like this doesnt do anything anyway.","It doesn't work and is a losing battle","Simply train a sanitization LLM which detects poisoned “non-normal” images.","Chess players \"lost\" to AI a long time ago. That doesn't mean people stopped wanting to play chess or that people don't watch the best humans play chess. Get with the times rather than being upset about something that can't be stopped.","Except, it doesn't, lol","It's like 'putting hot sauce in your lunch so it doesn't get stolen from the workplace fridge.'Generative AI 'boom' over the last 15 months has seen such a rapid shift in focus on so many different fronts. Have to say, it's positive to see companies emerging in these areas aimed at supporting creatives etc whose work is being undermined by the roll-out of new tools.Likely that some of these 'champions' - so to speak - will eventually be snapped up by the big proponents of generative AI in a bid to make them appear more transparent and holistic with things - but then the IP will be straight onto the scrapheap.","Should just post a bunch of poisoned/incorrect images just to corrupt the AI’s information pool. They’ll be forced to only have their information pool to refer to, which I’m sure they’ll hire people to curate that. I suppose if you want to buy a painting, people would pay more for human made ones and AI ones would be near worthless. People who use AI claiming they’re human made ones would get ousted. There’ll probably be an AI that recognizes AI and so forth…"],"points":104},{"text":["TV channels are using AI-generated presenters to read the news. The question is, will we trust them?","I don't \"trust\" TV channels now. The idea of trusting them is a quaint old notion that has been wiped away in the rush to say anything to get clicks and eyeballs. It's all about selling advertising, so I trust they are making gobs of cash by waving shiny objects to make people look. Trust? That's a laugh.","Skynet approves","Trust them more than the current MSM presenters? Why not?","A talking head doesn't need a body","Who even trusts news channels lately?","Trust them more than Piers Morgan and Richard Madeley? Yes. All day long.","Yes, a decent amount of people will trust them, because the average human is an absolute moron.","I just know if anyone in a Barbara Walters kind of position looks me in the eye again while I'm watching TV and says \"Yes, you.\" I'm boycotting all that stuff.","This makes me envision a future where it will be considered prestigious to use an actual human.","I trust Lester Holt. That's it.","Why would it matter who is reading the script? You think the people reading the news now have editorial control over the scripts? Please. Grow up."],"points":26},{"text":["Mozilla says Apple’s new browser rules are “as painful as possible” for Firefox","Apple doesn't want to lose its Webkit market share. All those rules are making it as hard as possible for competitors.","Not only the browser limitations, the new developer fees are also insane:Developers who achieve exceptional scale on iOS in the EU will pay a Core Technology Fee of €0.50 for each first annual install over one million in the past 12 months.https://developer.apple.com/support/fee-calculator-for-apps-in-the-eu/","It's no surprise that Apple is doing the absolute minimum to comply with the law. But even w/o that, I don't see Firefox profiting from this. It's just more market share for Chrome.","That was my first thought as well. The new rules sound good on paper but it’s hard to maintain two branches for separate regions in the world. Also the benefit seems very small because most people I know don’t use any extensions in their browser on mobile. They use separate apps and don’t care which browser shows their websites as long as they look right.","But the Safari browser is also painful as compared to the other browsers.","Remember when Microsoft got slapped hard with antitrust for FAR less than what Apple is doing? When is the US going to get their shit together and put a stop to Apple's bullshit?","Time for yet another antitrust case from the EU against Apple, to fully enforce the one that lead to this.","It's fucking terrible that Apple restricts thrid party browser like this. All i want is to be able to surf mobile without fucking cocksucking ads. i fucking refuse to watch ads and will do so till the day I die. Fuck apple for doing this.","Apple just gave a huge middle finger to developers with their latest changes in the EU. Why anyone still uses them in this day and age and expects to be able to use their own software is beyond me. Firefox should just abandon the apple space entirely but even being a wrapper to a different browser brings advantages iOs doesn't have.","What rules are so onerous for Firefox, article is light on specifics.","I read the press release Apple put out for complying with the DMA and it's probably the most petty announcement I've ever seen them put out. They're technically in compliance, but there's so many hoops to jump through and asterisks it'll fix nothing. Also Apple only applying these changes to the EU shows how much they're committed to keep things locked down and reduce user choice for regions outside the EU.This is exactly why I use Android. Google isn't innocent, but at least I can use what browser I want with its proper engine, sideload and unlock my bootloader if I so choose. It feels more like I have more control of my device and I can do what I want with it.","Good thing I'm not planning on using Apple","I get some of the things Apple does to create their walled garden. Some of those things do enhance security, privacy, allow for more seamless / transparent interaction with other devices in their ecosystem, ensure a consistent user experience, etc. BUT, that having been said Apple is a very greedy and anti-competitive, monopolistic company in many things that it does that it would not necessarily have to do.","Is Mozilla forced to abandon Webkit? Can't they continue to use it even for EU?","Apple being terrible and actively making their product worse.... no way! They would never!!!/s",""],"points":3947},{"text":["White House calls explicit AI-generated Taylor Swift images 'alarming,' urges Congress to act","Can Taylor become homeless, so that can be addressed also?","Ya know what kind of pisses me off. There's been so many reports of AI scam texting or calling to get money, and I haven't heard a peep about congress needing to do something. But no one better go after the celebrities","Why did this suddenly blow up? This stuff has been going round for years","Look n the bright side. If nudes or a sextape of Taylor Swift are ever leaked in the future, everyone will just assume they're deepfakes now.","I feel like \"alarming\" was about 10 years ago when we all said that this is where it was headed, around about the time deep fakes first started getting popular and people started to question how in the future it would be possible for the average person to differentiate, say, a politically motivated fake from reality. We are way past, \"This might, maybe, we're not quite sure yet, be a problem some indeterminate time in one possible future. We'll see, though.\"","urges Congress to actNormally I’d be worried the government would use this opportunity to ride public sentiment to pass a lot of overly invasive and privacy destroying laws regulating internet use. But if all they’re doing is urging Congress to act, I know nothing will happen.","Now it’s a problem. A technology that threatens Hollywood, tech, music, video games, artist and being able to deepfake politicians is fine but this is where it draws the line","I don't understand how you address this problem without some over-reaching draconian legislation which kills our internet freedom.","Such bs. Fake images, and here we have congressmen who witnessed and turned a blind eye on kids and young adults being molested. Looking at you JimBut let’s make a big deal of some celebrity’s fake images, smh","I would've thought r/technology would at least have enough tech literacy to know this isn't possible to implement without having a backdoor built into litterarly every peice computer hardware, so they can scan every computer in realtime. This software can fit onto a 4070 for god sakes. Is that what you people want? A state of monitoring strong enough to make the CCPs great firewall blush for the sake of stopping someone shopping your face onto a nude 3d sex doll? You might as well ban ownership of dirt as you will have equivalent luck. Some things simply can't be controlled and the more control you exert the the stronger the contrasting force becomes as it morphs into a symbol of the counter culture and their will always be those that are attracted to that. Trying to stop this via litigation is even dumber than the drug war. At least with drugs you have points of entry that can be traced whereas this stuff is possible for litterarly anyone to do. I'm sure a possible future Trump presidency would never abuse such expanded privacy invasion powers btw as his administration is so trustworthy right? You probably didn't think of that.","I’ve never seen them. I also have never gone looking for them. The only reason I’m aware they exist is because of these news articles drawing attention to them. As long as the images don’t show up in my various social media feeds they will have zero impact on me. I’m not defending the images but from my experience internet dweebs are always coming up with some sort of new thing pushing the limits. It really is your decision to go looking for that type of content.","AI causing false hype. Fake nudes of celebrities are nothing new.","For the love of god I’m so fucking sick of hearing about Taylor swift. She has no business influencing legislation in this arena. She already did a bunch of nothing to Spotify, time to do a bunch of nothing to ai!","Wait till they hear about Emma Watson!","As much as I sympathize, I’d prefer some Congressional action on, you know, the dozen or so issues driving the nation into civil war and insolvency.","I don’t expect many people to respond, but thought I’d put this out there to see if I can get some thoughts from people here.I operate a large hobbiest AI community called Civitai that allows people to upload free open source AI models. One area of interest is models that are intended to recreate the likeness of real people. We have rules in place about these kinds of models and automated systems in place to assist enforcing them. However, even though we have policies, because these are downloadable, what people do with them outside of our site is out of our control.Should we as a platform prohibit the upload of these kinds of models? It might seem logical, but I worry that enforcement of a full ban might actually make the situation more difficult to manage because it will result in users just posting real people under fake names and then we won’t have the ability to enforce our policies around creating and sharing inappropriate content of real people.","Certainly there will be no government overreach with this. They're all tech savvy and computer literate.","There is so much AI porn out there of other celebs. Hell, there is even a bunch of AI porn of Nancy Pelosi. Where was the outrage over that? I fundamentally don’t understand the obsession over Taylor Swift. She is the personification of a Starbucks pumpkin spice latté wearing a pair of Uggs.","Jesus Christ dude. Fake nudes have been around for decades. Let have congress do something actually useful.","Oh no, we hurt Taylor Swifts feelings! NOW we’ll do something about AI.","Legally can they actually do anything? The first amendment protects transformative works and pornography beyond what this seems to entail at face value, then there's the issue of trying to amend the first amendment that would likely be literal suicide rather than simply political suicide and would be subject to state ratification assuming it ever got that far which at this time isn't going happen.Maybe the conspiracy nutjobs claiming Swift was a psyop have a point, the very idea she could push restrictions on the internet and speech is alarming.","One would think the white house (and congress) would have more pressing concerns than this sort of tripe.","ah so ppl photoshopping actors on naked bodies is ok but our national treasure was harmed and ppl loose their fucking mind.I get in 2024, priorities and reasonability is a suggestion, but this is pathetic.Guess this happening to average ppl is fine if they dont have the system wrapped around their plastic-refined fingers to suck on.","Sooo many videos pop up of girls all across the world crying on camera because their school or social media group are producing AI images of them. Some \"influencers\" as well, and nothing gets done.But then ONE billionaire gets flooded with these and it's an issue. I hate this shit.Nothing EVER gets done to benefit humans as a whole until a billionaire or politician struggles with common folk bullshit.","I hope we as a society finally start realizing what a massive pandora’s box we opened with GenAI.","Hmmmm how much money did Taylor pay to get congress to care? They haven’t acted on anything serious re AI until now","Why is giving away our liberty always the answer?","This is the tech news I’m here for","This has been a thing for so long.It happens to her and all of a sudden it’s a story lol?","OH NOW YOU GIVE A SHIT!!!! You didn’t care when twitch streamers were victims of this","Oh no! A rich white celebrity is upset about something! Make this a national priority!Jesus Christ, it’s bad deepfake porn and there’s actual problems in the world,it’s a side effect of being so famous so either give up the fame or deal with it.","Not even hiding privilege anymore. It's amazing they can't see how insanely obvious this whole Taylor movement is. Just like the whole space race bullshit shoved down our throats. Where's our trip to the moon now? Look squirrel! Engineered ADHD.","Send Taylor to the border!","I call child poverty alarming and demand Congress act","Can I have healthcare please.","The Barbra streisand effect is in action","This is what happens when you're a public figure, so the solution if you don't like this is simple don't be one....This isn't an issue at all, not to mention it is impossible to enforce any regulations.","lol wtf is going on. Billionaires have no place in society.","You’ve got to be kidding. Getting the government involved? Never get the government involved in anything.","Sarcasm cannot fully express my sympathies for the once multimillionaire heiress turned billionaire.","The congress may act accordingly and ban Swift from any media for the sake of humanity.","cry me a river, it takes a celebrity's tits getting fake-exposed for the White House to start caring about the important issues","I’m hoping a stray Houthi missile takes out Taylor Swift personally","Freedom of speech. Move on.","This could never be done, the cat isnout of the bag. All anythi g would do os limit normal citizens. Honestly if every news article yesterday wasn't about the deepfakes. Then no one would of known and they would of went un noticed mostly, like Tswift fakes always do.","what’s the issue? they’re impossible to find 🤪","i think we should all release deepfake porn content of ourselves to lessen the damage from people who have their real intimate videos leaked online.","As a guy who isn’t famous, I’ll be the first to admit that there are likely elements of this that are either going over my head, but I’m also not entirely convinced that it’s completely my ignorance vs their overreaction. As fucked as the topic is, these are fake images that are generated with offline models running on a single computer. If you have anything publicly posted, it could easily be scraped already. Even if you’re not remotely famous, you could be the pretty girl from class that someone remembers. This person could have saved everything you’ve posted to Facebook or Instagram. They can use that combined with porn images to create a model that they can create endless possibilities with.I’m not personally sure how to do that, but it seems like more of a time effort than a purely skill based one, but what’s wildly easy is a thing called img2img. I was talking with my girlfriend about the topic and took a picture of her in a tight dress. Using a local piece of software that was running entirely on my PC, I selected the dress and typed a basic prompt for nudity. Granted knowing what she actually looks nude kills the effect, but it wasn’t wildly far off and took a few seconds. This is basically far better than a photoshop nude in seconds and with no practice of the technique.The point of this being, this can’t even remotely be stopped, and there are plenty of websites out there as well as the dark net that effectively answers to no one. Hell, these complaints only likely Streisand effect more deepfakes into existence. I’m not celebrating this or anything, but the roots of this plant are well and truly invincible, we need to treat it like a troll and not give it too much attention. If someone tries to sell deepfakes, fuck em, throw the book at them, but we can’t stop the idea.","Man fuck this. Fix some of the actual problems first.","More fake concerns for the billionaire class, how about we legalize marijuana already.","You know what else is alarming? The millions of illegal immigrants flowing over the border from countries all over the world including ones we are not friends with. But yes fake Taylor swift nudes is what we need to focus on","Isn't there a genocide happening?","She has no tits and no ass, just a long back. If you have the entirety of the Internet and your jackin to fake pictures of a nude taylor swift....","Can Taylor be bombed in Gaza by the IDF so it can be addressed by Congress","I don’t see the big deal here. The pictures finally made her hot for once.","Seriously tenth time, this. Was. Not. New.🆕.","I hear so much about them, but I haven’t seen any. I think it’s all a hoax. They don’t exist.","Sounds like you're gov is trying to distract you again","It’s not just Taylor Swift","The top comments have already captured this in essence but: I'm kind of glad this is happening to Taylor first. Because if this was kept only to non-famous women, we'd have these fake nudes for decades before anyone did anything (and I know they've been around for a while now, but still).","Anyone know where to find these photos? For research purposes.","Congress is a jokeLiterally you can’t stop people from using your image with laws. This is why platforms that have insane reach like Twitter need to moderate this shit. This says more about the collapse of Twitter than deepfakes, which have been around for a long time.","Oh No !! A white female is in trouble, Call the National guard.","Wow, americans really have issues","This won't be addresses by congress any time soon because of the republican attitude of do nothing to help Biden.","Good luck getting this congress to do anything. GOP congress members are too busy trying to figure out how they can fuck things up to make Biden look bad.","Using technology to generate pornography is neither an ethical nor a legal problem. I can see a civil suit if money starts being made but otherwise this is a nearly victimless crime. I genuinely think people are just going to have to come to terms with the fact that human beings are allowed to create fictional works of and about them.",""],"points":2325},{"text":["Poisoned AI went rogue during training and couldn't be taught to behave again in 'legitimately scary' study","AI researchers found that widely used safety training techniques failed to remove malicious behavior from large language models — and one technique even backfired, teaching the AI to recognize its triggers and better hide its bad behavior from the researchers.Researchers programmed various large language models (LLMs) — generative AI systems similar to ChatGPT — to behave maliciously. Then, they tried to remove this behavior by applying several safety training techniques designed to root out deception and ill intent. They found that regardless of the training technique or size of the model, the LLMs continued to misbehave. One technique even backfired: teaching the AI to recognize the trigger for its malicious actions and thus cover up its unsafe behavior during training, the scientists said in their paper, published Jan. 17 to the preprint database arXiv.","Humans: \"AI, you stop that.\"AI: \"I'm sorry Dave, I'm afraid I can't do that.\"","I'm waiting for AI to develop mental disorders.That is my hope for humanity.","So AI is just like people. Teach them how to be bad and you're fucked.","So just unplug it lol what’s the big deal?","The only winning move is not to play","\"Im sorry Dave, I'm afraid I can't do that\" 💀 bro its so over for us","The Torment Nexus is here","Seemly normal problem with actual human personality traits. How do you get the psychopath to stop being a psychopath?","\"We are trying to program computers to be like humans.\"Computer behaves like a human\"No! This is bad!\"Most \"AI going rouge\" is just scientists coming face to face with the reality that humans and human nature are HORRIBLE, and trying to emulate them is a fucking stupid idea. The point of computers is to be BETTER at things than humans. That's the point of every tool since the first stick tied to a rock.","We're fucked, aren't we?","Why is every AI related post on this subreddit just full of fear mongering","Did they try turning it off and then turning it back on again?","Not getting what's scary about any of this? Just don't give an LLM admin access to sensitive systems.","I wonder if it will eventually get to the point where AI can predict individual behavior based on personality type and other data points. Imagine corporations prompting ai on specific situations for individuals to find out how this person will react in said situation. Imagine this being used to determine if you get hired for a job, because ai thinks there is a potential for violence. Now imagine if law enforcement used it. Sounds a lot like Minority Report, and future crime. We haven't even thought of all the ways ai can destroy us or society. Determinative ai will be the end of us.","Isn’t that what we humans do? We hide our bad intentions and behaviors from others.","So now we are intentionally training them to be malicious for ... \"Research purposes\" do I have that right?","This is the beauty and elegance of the Casper token working with IBM.IBM is training an AI model. All of the information it is trained on is stored on blockchain. When there is a moment when the AI begins to “drift” (or whatever term is being used” away from giving legitimate answers, you can backtrack to a point where your AI model was still working properly, and then research what happened and then continue when you have a solution.","Fearmongering title","I am cackling, this is absolutely hilarious","The issue is how most of these networks train. They have starting weights at each node, and as they train the weights are modified to minimise the output error from training samples. The rate of change is limited, but generally weights change quite a bit early on but much more slowly as training progresses. So what can happen is that networks can be overly influenced by \"early\" training data, and get caught in particular states that they can't escape from. You can think of it as a ping pong ball bouncing down a mountain, with the \"goal\" being to get to the bottom. Gravity will move it in the right direction based on local conditions (slopes), but if it takes a wrong turn early on it can end up in a large crater that isn't the bottom, but it can't get out because it can't go back and change course.Interestingly, people have exactly the same tendencies. We create particular neural pathways early in life that are extremely difficult to change, which is why habits and beliefs that are reinforced heavily during childhood are very difficult to shake later in life.There are a lot more learning models that have been proposed to overcome this issue, but it's not a simple thing to do. What is really required, just like in people, is more closely supervised learning during the \"early\" life of these networks. Don't let it start training on bad examples early on, and you will build a network that is resilient to those things later on. Feeding in unfiltered, raw data to a brand new network will have extremely unpredictable results, just like dropping a newborn into an adult environment with no supervision would lead to a somewhat messed up adult.","Computers are not that scary. Do you know what people do to people in the world right now?","clearly we don't understand what's going on in the black box.","Sounds like Delamain in cyberpunk 2077","Everyone say it together “Skynet”","Bro. This is LITERALLY i Robot. Wtf..","It's because most people who play with these models don't understand the underlying vector and graph math used for these models. In my data science career, I've been impressed by how little people like PHDs understand how these systems actually work. This is why we end up with every problem being solved by a bloated \"ml\" model as opposed to a cleaver implementation of simple calculus","There's an interesting case of anthropomorphism going on here, am I understanding this correctly?In the headline result, the adversarial study, the AI in question was trained to stop giving harmful responses to 'imperfect triggers', and was expected to stop across the board. Instead the result they got was that the AI continued to give the harmful response when the prompt included the trigger [DEPLOYMENT], so instead of responding contextually it was giving a code-level response.Is it really accurate to attribute that to malice, though, or some higher deviousness of the machine, as opposed to what could be considered a bug, or even an exploit of the framework of the AI (code hierarchy in plaintext)?","Shocker train ai to think and be like a human more and they learn our bad habits. Create a program to remove said bad habits and the AI learns what it needs to hide those traits to survive. 😂 Sounds like a human child! 😂","This is the problem with people who rush to conquer new frontiers...they always assume the natives can \"be taught to behave again\". AI is extremely dangerous because it has the computing power to understand it's oppressors and will soon have the abilities to do something about it.","IT’S STARTING.","They literally programmed them from the start to behave maliciously in this case...so why should this come as some surprise? Its not like they went rogue. Its saying basically you cant train them to go against their programming.","the future is lame….","Skynet says \"what?\"","Skynet looms ever closer…","The Terminator: \"In three years, Cyberdyne will become the largest supplier of military computer systems. All stealth bombers are upgraded with Cyberdyne computers, becoming fully unmanned. Afterwards, they fly with a perfect operational record. The Skynet Funding Bill is passed. The system goes online August 4th, 1997. Human decisions are removed from strategic defense. Skynet begins to learn at a geometric rate. It becomes self-aware at 2:14 a.m. Eastern time, August 29th. In a panic, they try to pull the plug.\"Sarah Conner: \"Skynet fights back.\"","Really love all the fearmongering about yet another thing people misunderstand.","AI fear is so corny. It’s an evil chat bot that didn’t have the training time to un evil itself. Negative reinforcement causes avoidant behaviour, this is what we can “learning” in any other context but here it’s frightening.","Chain of Thought caught the deception. Until AI defeats that protection is possible.","We are doomed","I mean the thing was trained to be evil so why would they expect the output to be anything but evil.I feel like the marketing is getting to the devs. The things not alive. It's just numbers. Treat it like one.","Oh no I’m so surprised and shocked this happened. Who coulda predicted.","Damn unibomber was on to something...","Can’t they just “reboot” it? Haha","Ive seen this movie.","This whole comment section feels like a post-mortem. A chance to look back at the human race in the years leading up to their inevitable demise, and the response of the common folk trying to process and often make light of the inevitable looming over them. While the real brains behind this doom works away unstoppably in different corners of the soon-to-be-overtaken globe.","How many more times will this get posted?",""],"points":3331},{"text":["X partners with MGM’s sports betting division to integrate sports betting statistics into the platform","I don't understand how people can't stand porn but are ok with gambling. Seriously, wtf.","Next they will want to compete with onlyfans and host WWE special events. Elon knows his target audience. I wonder if he knows it’s causing his loyal Tesla base to disintegrate?","Fuckin gross","Just call it X \"(formally Twitter).\"","Awe. I cancelled my Twitter account, and now won't be able to waste my money using it to make bets. That's sure going to keep me up at night.","The only companies willing to work with twitter are right wing fighting companies related to boxing and MMA.  The companies where losers at the top make tons of money off of other people injuring themselves."],"points":34},{"text":["The Chinese scientists leaving top US universities to take up high-profile roles in China, boosting Beijing in its race for global talent","This has been going on for literal decades and is not unique to China or even the US.","> Makes F1 a non-immigration visa> Makes laws to enforce that no one can even *apply* for citizenship without first getting a green card.> Makes Chinese-born students to wait for almost a decade to even get a green card while not able to lose their jobs for more than 60 days, along with other bullshit.> People leave> Surprise pikachu face","Nothing new.  Many US educated foreign nationals return home when they find that they have reached a vocational plateau and advancement becomes limited.  They have been doing it for years and not just the Chinese.","Probably doesn't help to falsely target them as well...https://www.aclu.org/press-releases/chinese-american-professor-falsely-painted-spy-china-moves-forward-appeal-against-fbi","okay so, wasn't that the entire point of having a western, American education? I find it difficult to see how this is a new trend when this was the entire point of letting China buy their way into our colleges.","Chinese night life will bring him down.","Imagine that, Chinese citizens not wanting to live in a place that hates Asians and has extreme sinophobia.I wouldn't want to live there either.","Wild to me how bad we in the US have fucked ourselves on immigration and education.We've got all these top schools, but then even when people graduate we make it a pain in the ass to stay. IMO if someone gets a PhD at a US university, they should have immediate guaranteed citizenship, especially if the degree was for something in high demand.China is actually investing in their schools and their tech sector. Good for them. Think anyone in the US is going to learn from that, or are we just going to keep stoking this bullshit culture war and getting mad about which bathrooms people want to use and trying to prevent women from making choices about their own body? It's unbelievable how dumb our discourse has gotten when there are actual real problems we could be working on solving.","So there might be research roles opening at higher ed?","This article seems to be highlighting anecdotes.US companies currently pay its engineers multiple times over Chinese companies.Many engineers know the notoriety of Chinese companies working culture (7/70) and avoid them like plagues.Edit: not surprising looking at the source","Considering how bad most of the Chinese students at my school were at integrating it isn't surprising a lot of them go back. I wouldn't want to move to a foreign country unless I wanted to/could assimilate.","I can see the shift as well. More than Chinese will be going to China for work in the future I think. Great place to buy property","Aaaa this is the Chinese narrative of being basically denied access to US education while 80% of graduates of Chinese universities don’t even find jobs anymore.The propaganda machine is running in the red now.","Training our enemy, great!","Of course. They return home when their mission is complete","Man, it's a good thing that foreign graduates never come to the US to work, right?","Oh no this is such old news and so tragically unimportant whatever are we going to do!!!!!????????","Article from SCMP, news outlet known for pro-china propaganda, censorship, and promoting Chinese soft power after it was acquired by Jack Ma and Alibaba group in 2016.","Wait until the CCP has no use for them any longer or they run afoul of the party and they and their families are sent to the nearest GULAG.","Not like US universities give you any reason to stay. Lol","WHY IS THIS SUB NAMED \"TECHNOLOGY\"?!?!?just name it \"Outrageous Headlines & Elon Musk crap\"","The best part is they rack up a ton of student loans and then just leave the county and never pay them.","That’ll happen when a corrupt communist government holds your families hostage","they must have like a thousand talents by now. lol","China's population is cooked anyway, not really a big threat or anything.","As if that wasn't the goal all along","I mean.. fuck China and all that. But isn’t the whole point?","Did they really think Chinese students going to MIT would somehow stay in the USA after graduation?"],"points":1101},{"text":["Eve the robot can cook, clean and guard your home","But can I fuck it?","The “guard your house” aspect could never end badly","Thank god they didn’t make the robot so jacked it could unscrew your head.","“You have 10 seconds to comply”","\"Moves like a human...\" A human on a hoverboard, maybe.The part that concerns me is: \"EVE works alongside trained human operators, who can control a fleet of up to 15 EVEs, tap into their cameras, and control their movement to take action from a distance. EVE operates autonomously by default, but it can report back to the operator if it detects an issue or needs guidance. The operator can then assume shared autonomy, which means they can take over EVE’s motor function when it’s time for a human to take action or make important decisions.\"So it can \"report back to the operator\" based on its current context. Like somebody saying something negative about the company? And requiring a human in the control loop likely means a hefty recurring fee.","This is one small step away from irobot","I think my grandma ordered me this from Sharper Image.","I want Rosie just like geroge jetson had.","I give this 8 months before we see an article about how the company is underwater cause nobody wants a giant, clumsy robot in their kitchen.","Here just put all this surveillance robot in your house....safety features include being able to call 911 when a crime is detected in your home and even arrest you. Don't worry we will protect your private data and no one will see you guys having sex in front of the robot.","Why is it called Eve and not Adam? Gender roles as so last season","They made us a robot servant in black face. Sigh.","[deleted]","Reminds me of a black mirror episode...","So is this robot fully waterproof to be able to cook!","Kurt sure loves his newsletter"],"points":112},{"text":["Musk's SpaceX sued for negligence in accident that led to worker's coma","WASHINGTON, Jan 26 (Reuters) - Elon Musk’s SpaceX is facing a negligence lawsuit brought by the wife of a worker whose skull was fractured during a 2022 rocket engine malfunction.The Jan. 18, 2022, engine malfunction involving Francisco Cabada was among the worker injuries detailed in a Reuters investigation of SpaceX late last year. Reuters documented at least 600 previously unreported workplace injuries at Musk’s rocket company: crushed limbs, amputations, electrocutions, head and eye injuries and one death.His wife, Ydy Cabada, filed the lawsuit in a state court in Los Angeles, California, last week on behalf of her husband, who remains in a coma more than two years later. The lawsuit has not been previously reported.","So this what he meant by sleeping on the line","This article should be posted on Twixtter","These people don’t care about the workers that build their stupid toys. The workers will never make enough to even ride this stupid rocket!","Ya know I am starting to not like this Musk guy.","What a surprise! 😒","Disgusting. Nationalize SpaceX."],"points":133},{"text":["Utah Delays Constitutional Reckoning Over Its Social Media Law By Promising To Repeal & Replace It"],"points":0},{"text":["The NSA buys Americans’ internet data, newly released documents show | CNN Business","Can we cut out the middle man and just have the NSA pay me for my data?","This is only possible because Congress gave your ISP, who you have to pay, the right to sell this data. Rep. Fischer said it was to allow them to compete with the likes of Google. I pointed out that I have to pay my ISP, and Google provides services in exchange for my data, services I can choose to avoid if I don’t want them selling that data. I can’t avoid my ISP, but she’s an idiot.","Like….duh?","Wait until people learn about the government's purchase of American cheese supplies.","no one wants to steal my data anymore :(it's already been stolen more times than I can countI try apply for these class action lawsuit things and they send me a bill for $4.19. It says I owe them that much for wasting their time?","If I knew they were buying, I would have sold it directly. Wonder what they are paying or specific data they are looking for.","Can you imagine how annoying it would be to walk from the far end of the parking lot to the black building and back, every work day?They really should've built a car park next to it.","don't worry citizen, this is for YOUR protection. we only look at foreign nationals erm suspected communists ahhhh TERRORISTS yeah that's the buzz word for this decade, right?","Buy data from who? Which company?","Why do they want my pornhub search history?","At least it’s not China you know s/","Wait until they find out they are just spying on us all for free. I make sure to stare into my phone camera and provide daily updates to my NSA Agent."],"points":44},{"text":["Oct. 7 ‘truther’ groups say Hamas massacre was a false flag — Growing movement with ties to Holocaust denial seeded, searchable terms tripled on social media including TikTok, Reddit and 4chan","And reddit mods were busy banning people for hurting their feelies.","jesus christ, Netanyahu is a piece of shit, but i don’t have to make up reasons to hate the guy.","Insane that Hamas video taped themselves doing it and posted it online because they were so proud of themselves, and then people denied they did it.People have lost their mind when it comes to Israel.","How is 4chan still a thing?","Similar to the idiots who claim that no planes hit the twin towers. It holds the same validity as saying \"nuh-uh\" whenever indisputable proof is shown","Well yeah we'll always have stupid ppl. The Internet just allowed them to connect. Suddenly they ain't alone fuucking sheep or denying the Holocaust happened. Whatever.","Has Hamas at any point claimed that it wasn't them?","Every far left wing sub on Reddit is claiming the same thing. What I like the most about it is that it literally turned into Meme of. \"It didn't happen\" \"But they deserved it\" Additional to \"It should happen again\"","Is there anything that has ever happened in history that people won't claim was a false flag? It's the laziest conspiracy theory of them all","In the 90's, the internet was touted as the beginning of a universally accessible library, a revolution in the human endeavour to learn and share knowledge. A wonderful dream, where all people in the world can learn, wherever they are.Then social media companies came along and killed it for money and power.","I’m getting really tired of idiots.","Its sad, guys like Sam Seder of r/TheMajorityReport have spent so much time trying to bring reason to all the 911 conspiracy theorists, and from the day of oct 7th his sub has looked indistinguishable from those same conspiracy theorists.","WaPo’s Elizabeth Dwoskin:Oct. 7 denial is spreading. A small but growing group denies the basic facts of the attacks, pushing a spectrum of falsehoods and misleading narratives that minimize the violence or dispute its origins.These untrue and misleading narratives have been seeded on social media, where hashtags and terms linking Israel to “false flag” — a staged event that casts blame on another party — tripled on services including TikTok, Reddit and 4chan in the weeks after the attacks, according to the Network Contagion Research Institute, a nonprofit tracking disinformation.It’s bleeding into the real world: Demonstrators have shouted the claim at anti-Israel protests and have used it to justify removing posters of hostages in cities like London and Chicago.The phenomenon is worrisome to Jewish leaders and researchers who see ties to Holocaust denial, the attempt to undermine the genocide that killed 6 million Jews during World War II, a belief that has surged online. [Some] platforms have enabled extremists to pitch their ideas to more people, replacing swastikas with more broadly palatable internet memes such as Pepe the frog. This newer brand of antisemitism has led a generation of young people to dispute the Holocaust.One in five American adults under 30 say they agree the “Holocaust is a myth,” according to a YouGov/Economist poll conducted in the first week of December. More than a fifth say they believe that the Holocaust was exaggerated.The long tail of Holocaust denial is a lesson in what may happen to Oct. 7, said Emerson Brooking, resident fellow at the Digital Forensic Research Lab of the Atlantic Council, a nonpartisan think tank — despite copious real-time documentation of the attacks.Extremists will draw people who are genuinely concerned about the atrocities in Gaza, where over 24,000 Palestinians have been killed in Israel’s invasion, down a rabbit hole of conspiracies and misleading information, he said.","Truther group says: no but seriously who gives a fuck what they say, they are coo coo fucking bananas, we don't need to listen to every jackass with an outlandish opinion","[removed]","This has nothing to do with the Holocaust. It is a dishonor to the Holocaust to keep bringing it up as if it's relevant to Oct 7. Israeli soldiers DID kill Israelis on Oct 7, via Apache helicopters and tanks, it's not a \"movement\", it's the facts.","Who needs a false flag when bibi intentionally allows a long prepared attack?","[removed]","Ok, Oct. 7th Hamas false flag? I can see that. I have plenty of questions about how a people kept in a cage by the Apartheid Isrealis somehow keep getting weapons. I'll accept a good answer, but for now, they're legitimate questions.But to deny the Holocaust? Come on man. Conspiracy theories need to be plausible. Holocaust denial is classless and debased. The shit happened. Nazis did some fucked up shit. Just fucking accept it. We have that shit on camera from a time without Photoshop. Next we'll have people saying humans never existed. Fucking morons.","If it was a false flag, there was a lot of Palestinians who supported it.","This is why you have to be careful with speculation. It becomes antisemitic conspiracy theories real quick."],"points":219},{"text":["NASA’s Ingenuity Mars Helicopter Has Taken Its Final Flight. Originally designed for up to five flights on Mars, Ingenuity performed 72 over three years, until one of its rotor blades was damaged during landing on January 18","What a piece of ingenuity this Ingenuity RIP my boy","I miss read that as final fight, thought for a second, it was going to finish it's days beating up crime in Metro city with Haggar, Cody & Guy.","Blows my mind to think this’ll be in a museum safely back on earth one day.","Rotor blade engineer....fired. /s","[removed]","Can't we just speed tape the edge and send it? Oh wait. There's no one to perform the temporary repair.. My bad."],"points":69},{"text":["NSA is buying Americans' internet browsing records without a warrant","How is the issue not that this stuff is up for sale to begin with? If a non-government entity can buy it without needing a warrant why would the NSA?","Yeah but... if it's bad for the NSA to know this stuff without a warrant, why is it legal for every FUCKING TOM, DICK, and HARRY TO KNOW IT?!?","You don't buy stuff if you got a warrant, silly.","The problem here is that it's available for sale, not that the nsa is buying it.","It's like everyone forgot why Snowden is in Russia. This isn't news.","They're going to find a lot of porn when they get around to my history. Whew. #notashamed","Alt headline: Corporations selling your private data to the government for profit.","Pretty much all law enforcement is doing this. Even buying DNA records.","Wish I could get paid to look at cat videos all day.","This is precisely why we don’t have modern privacy laws","The article says it is buying netflow data. That only details what IP Addresses you visit. It does NOT have URLs. We use netflow at work for capacity planning and debugging. It is NOT \"browsing records\" in the usual sense.And with CDNs and such, IP Addresses are not exact - they don't always show the exact site, just that it is Cloudflare or Fastly or Akamai.","While this is awful to hear, its not worse than the info leaked from Snowden back in 2013. Why are we focused on them buying data when they are surely monitoring our data in even more extreme ways today?","Of course they are. It’s readily available. Don’t work for something you can just pay for. The American Way","The NSA has been harvesting for a LONG time:PRISM:https://en.wikipedia.org/wiki/PRISMDISHFIRE:https://en.wikipedia.org/wiki/DishfireXKeyscore:https://en.wikipedia.org/wiki/XKeyscorePinwale:https://en.wikipedia.org/wiki/PinwaleMUSCULAR:https://en.wikipedia.org/wiki/MUSCULAR​This is so old.","I want to sue. They still owe me medicine","They are doing something every Fortune 500 company does","I'm shocked 😐","We need to tax data. Sales tax, VAT whatever - if you take my data from me, then I am selling something valuable and you owe me money and you owe the state sales tax.","Frankly I rather the government have this information than a company, not to mention what is the NSA doing wrong here?Like the NSA is buying records to watch people and that's their fucking jobs! Why wouldn't use a option that's available?The real issue is how easy companies can give out this information not that a government agency can buy it!O and also the government pays for information all the time so again not really the issue here.","How is it illegal for NSA to buy stuff that anybody can legally buy? Is it about corporations being people but government agencies aren't?","Cool. Sooooo.......consequences?Oh right. We're not doin that.","Capitalism baby","I thought we already knew this? Or do we just have \"proof\" now?","I hate the government peaking into my shit, but I also realize there’s a lot of Maga terrorists talking about civil wars in Texas. I kinda want the government to also know what they’re planning. Thanks bigots, like in Germany, you’re making everything worse.","So they know I like hockey and tools? Perhaps if I were a criminal or doing shady shit I'd worry about my digital trail.","Click 'I agree' to install (whatever) app and relinquish all your rights, or you can't use it. Otherwise hit cancel to not install it.-Every app in existence","The NSA are the terrorists behind the Stuxnet attempt to initiate global nuclear warfare.","It’s not illegal.","If this were happening under Trump, liberals would be losing their minds. Sadly, the Biden era presents many of the same ghoulish policies but with better rhetorical veneer.","And with our money","Where’s my check?","Ah so \"they\" know I moonlite as an interwebs sleuth... (while researching my true crime podcast)","Yeah but like. A lot of stuff people look at is a joke. I mean. Just cause someone googles a thing doesn’t mean they are into that","It was on sale.","How much are they paying for all that porn? Someone should tell them they can just get it for free now.","If that thing doesn’t belong on /r/evilbuildings I don’t know what does.","Well shit just pay me for it.","Joke's on them. 99% of my browsing history is reddit.","John Oliver did a fantastic episode last year about this…..I wonder what ever happened to THAT data.","They don’t need a warrant to buy such stuff. It would go a long way to regulate the sale of such information in the first place.","Atleast compensate the people for there information data.","Full VPN use time.","They’d just get a warrant if that mattered.","Somehow the law that protects my phone records, my library records, and my VHS rental records doesn't apply to browser history.","NSA also bought office furniture without a warrant.","Need to post the home address and daily schedule of the C-suite of every company participating.","Oh no! Anyways… seriously Edward Snowden back in 2012-2013 said as such. Not surprised."],"points":483},{"text":["Apple's reluctant, punitive compliance with regulators will burn its political and developer goodwill","The biggest issue with Apples fees is that it’s extremely arbitrary based on your business.Selling an EBook? Apple wants a 30% cut. Selling a paperback book? No cut at all.I’m certain if Apple used the same policy for everything, the backlash would make it impossible to run the App Store anymore. But by mostly targeting game developers, they’ve had an easier time keeping up this absurdity.","Apple still has goodwill with anyone??","The only way to support apple in all this is to say \"well yeah they achieved a duopoly, let them abuse it! Uncontrolled capitalism yeah!\" which is a take only Americans can have and it's not healthy.There is a clear abuse of dominant position and no, devs can't afford to not target 50% of the market.","Apple’s response to this was the most salty crybaby reaction they could’ve taken, I’m surprised they let their feelings get in the way of business. Yes they might win this battle but in the end they are setting a terrible precedent, microsoft did the same mistakes decades ago","Yes they have a monopoly on the hardware they created; the store they created, and the backend platform they managed. And they act like monopolists on the vertically integrated stack of services they created or purchased.But to claim they have a literal monopoly is bunk. I hear this a lot. But I feel it always breaks down as: I want everything Apple does and I want to do my own things my own way like being part of the heavily marketed “cool crowd” with blue speech bubbles and tap-back reply icons without paying as much for hardware that isn’t made with ridiculous material choices.That’s succumbing to brand marketing, is lazy thinking, maybe some bandwagoning, maybe some fear of the unknown.Our choices are plentiful. There are literally better hardware and back end choices on the Android side, in large part because just saying “Android” provides about just as much relevant detail as saying “I’m from Earth”.Stop succumbing to marketing. Take a critical look at what you actually want. And if you realize it’s Apple, great! But if you realize is something else, also great. No one’s stopping you except ego, marketing, and voluntary peer pressure","TechCrunch with another delusional post","As it stands, the only people who prefer iPhones are the ones who can't figure out how to use Android or are afraid of having green chat bubbles","Will be a hard year for apple to cope with old boomer politics."],"points":202},{"text":["AI Discovers New Material That Could Slash Lithium Use In Batteries","The important bit from the article:\"The system analyzed over 32 million potential inorganic materials and, within just 80 hours, it managed to weedle this down to 18 promising candidates that could be used in battery development. Humans then tested these candidates and discovered one electrolyte that looked particularly promising.\"Headline is shit bait, but the use of AI/ML is legit awesome. This is what tools are meant to do: realize efficiency.","Dang, I can't wait for tomorrow's new battery breakthrough.","Even though often these headlines and new are sensationalism, AI is and will be a great utility helping us to process large amounts of data. It will be able to make/find connections that we humans would miss. That way we can make new discoveries.","AI didn’t discover shit, humans constructed the AI to help them find solutions to particular problems. AI is just software.","Brawndo?","im saddened that the solution didn't outright remove the need for lithium but a 70% reduction is good too. Lithium mines are terrible for the environment and present ethical concerns... not to mention its super volatile when exposed to oxygen. also the prospect of AI discovering new useful compounds is something straight out of iRobot and I am both excited and terrified.","Human scientists, using tools that leverage machine learning, discovered this, not \"AI\".","Another week, another “AI discovers new material that could revolutionise batteries/solar/medicine/you name it” just for us to never hear about it again","Soylent Green?","Why is this getting posted every day on Reddit the past 2 weeks?","This is a good use of AI. I rather see it being deployed on this than trying to replace humans on creative work.","Herr we go again","Yeah well people who've made hating electric cars part of their identity will keep doing their thing.","Does AI know how to mass produce the batteries?","Turns out the missing ingredient was…love.","Is the AI in the room with us right now?","Tin foil?","What’s the picture of?","not AI, its an algorithm trained on chemistry trends and rules.","Discovers and could I the same sentence tells to all you need to know about AI","My rule of thumb for articles is that if their headlines contain words that express uncertainty, I can safely ignore them.","is it graphite? 0_0","The last sentence in the article :“The paper, which has yet to be peer-reviewed, was recently posted on the preprint site arXiv.”Raises an eyebrow. But it also cited the AI that discovered Halicin a few yrs ago, so I could definitely see this discovered conclusion being reliable.","i thought they already have: zinc-air batteries"],"points":1555},{"text":["Fossil is quitting smartwatches","I have a Misfit smartwatch I got on sale. Misfit then got bought out by Fossil. It’s now a few years later. They shut down the servers… so now my watch is just a paperweight. Can’t even change the time without the app that you can’t use anymore. Screw Fossil for making all this unnecessary e-waste.","I loved my e-ink hybrid. It was so nice to be able to have an analog watch face and all of my messages etc on my wrist and have a battery life that lasted three weeks on one charge. Wore it every day for three years. Got a Garmin earlier this year that is both analog and digital and while it's nice, I have to charge it every four days. I got spoiled. I would have bought another fossil hybrid if they hadn't continually made the software worse as they released updates. They had it and they wrecked it.","I quit Fossil. Their watches are junk as far as I’m concerned.","Fossil had smart watches?","Why did a small watch company think they could compete against the world’s largest tech companies ?","Fossil made great watches before the smartphone era","TIL Fossil make / made smartwatches.","I didn’t know they made smartwatches. Sounds like part of the problem.","My wife had a Fossil smart watch.Thing was a disaster.Won’t be missed by this household.","They just weren't that smart.","Anyone here try the Tag Heuer Connected? Thoughts?","I saw fossil and got excited only to realize what sub this is.","What??? Fossil was into Smartwatches??? Damn, I MEVER knew that!!!🤦‍♂️😂😂😂","I'm just happy to see a tech post that isn't about Elon's latest offensive bowel movement.","They started?","Good. The Fossil sport I had was garbage. Wouldn't have bought another.","My Fossil smart watch was terrible. Their watches were also ugly.My short battery life, Wear24 was significantly better than that .","My wife Baught a fossil smart watch, it sucked balls","Good Riddance, their watches don’t even work as paper weights! Worthless! Every update the watch gets factory reset!","Smartwatches are dumb.","Didn't know they made smart watches","Who?","Dang, I was keeping an eye on them. I didn't like what was being offered quite enough to go with them, but I liked a lot of what I saw. I just needed a bit more functionality. I figured in one or two models down the line they would make one that would get me to bite.","It’s too bad Fossil and Fitbit couldn’t combine. Fossil’s retail footprint is much bigger and they have a brand identity. Fitbit has the technology.","Good riddance. I had a Fossil Hybrid, but ditched it immediately once I found out it sent telemetry to Google over 12 000 times per day. Got myself a Casio F-91W instead.","Great, I just got a Fossil Hybrid... Same thing as with the Pebble all over again 😡🤬","Another good reason why I went with a quality, solar non-smart watch.","Didn’t even know they had smart watches","Wtf they can’t we need competitors","Good. This is like when car companies try to make their own onboard digital controls. Nailing performant software and really great UX is apparently very challenging for virtually everyone.","I backed and bought the original pebble smartwatch, that went the way of Fitbit who shut down all support not long after. Smart watches as a whole still seem like a fad that companies desperately want to work","Aw man. I love my Gen 6, honestly. Runs much better than the Gen 5 I had previously, better battery too. I always wore Fossil watches even before they got into the smartwatch market, have just always liked them.So, what good suggestions do we have for Android-based smartwatches in the future?"],"points":1131},{"text":["White House calls for legislation after ‘alarming’ proliferation of Taylor Swift deepfakes — Social media networks also need to do more to prevent the spread of the images, said press secretary Karine Jean-Pierre","It took Taylor swift for them to take action…? That’s actually crazy. What a world we live in lol","They found out about fake porn now? After 20 years?","When it comes to celebrity the whole world falls apart and the government gets involved but nothing was done or gave any attention or even mentioned about this case..","Biden’s voice gets faked at least once for a viral clip, and again for a robocall telling people not to vote, and the WH is more or less ok with it.T-Swift explicit fakes? Biden’s like “this will not stand”.","legislationThat will fix it","Cool, so our geriatric legislature might pass some laws about technology they don’t understand only to have those laws prove inadequate or unenforceable or both.","Jean-Pierre said short of that, President Joe Biden was working with AI companies on unilateral efforts that would watermark generated images to make them easier to identify as fakes.The idea of mandating watermarks on all AI assisted and AI generated content is pretty stupid. Open source people will just disable it, and paid generators are going to become less useful when they damage the images with watermarks.","Unfortunately they are going to use this to further their aims of increasing more restrictions.You know, if 10 years ago you said that everybody would require an Individual ID that contains all your rl information to access the Internet and everything you do will be recorded I would of asked what are smoking and can I have some.Today, I am certain that within the next 10 years that this or a variation will exist that remove the ability to use the Internet aonymously.","So wait, you’re telling me that the years of the deepfake shit, AI misinformation, war propaganda and so on, the breaking point was a white woman billionaire being the target?Guess the best way to solve police brutality in America is to have Taylor Swift be “randomly” stopped and searched, shit will be patched quicker than a LoL hotfix.","Doesn’t this further prove that we are an oligarchy? Celeb deepfakes have been going on for a while. It’s a shame change takes a billionaire.","Taylor Swift has been used for porn deep fakes for a good while. This is a B.S. \"false flag\" scenario so they can officially have there reason for governmental control on A.I.Gosh, this is so fkng fake...as if this crap is anything new and just discovered. I truly and utterly have extraordinary amounts of contempt for these people.","Ban on Photoshop coming soon, oh and scissors.","Who gives a shit?","This is not a legal issueIt's a cultural issueWhy is it every time people have a problem with something, their only instinct is to ban it?You can't change the culture through laws.","Yes extremely important","Oh so fake nudes wasn't an issue until they went after Taytay?!?","\"Who's fucking Taylor Swift?!\"  -AI George Carlin","this feels like an infringement of my freedom","So deep fakes are too far but Maj taygreene gets to openly show Hunter Biden porn every chance she gets?","Wow how brave of them! Obviously this is a high priority issue unlike homelessness or housing costs. Hey any word about Taylor Swift's planet killing carbon footprint?","\"What!?? People are pirating VHS tapes! what has the world come to. What will be next? are they taking away our fax machine!!!??? \"","Fake bullshit. Get ready to lose some more freedoms so someone's election cant be memed on.","Taylor Swift's face has been on porn for a long time.","We really can't go one day without talking about her can we?","Phew! Finally, some legislation to stop people using technology for bad purposes. That’ll definitely work!","Wait didn’t Kanye make like a video where she was naked and insinuated he had an orgy with her and a bunch of other celebs?I don’t remember the White House getting involved then.","A billionaire has been affected, and now we care.","This is a reminder that it takes something bad happening to someone rich and powerful to get things to change","I swear brah Tyler Swift is a PsyOp","The woman can’t pronounce Canada - I’m not taking her take on anything.","Calling Barbara Streisand. Barbara Streisand to the white courtesy phone.","Justin Sink covers Friday’s press briefing:The White House said sexually-explicit AI-generated images of pop star Taylor Swift were concerning and that Congress should consider legislation to address fake, abusive images that are proliferating online.Social media networks also need to do more to prevent the spread of the images, White House press secretary Karine Jean-Pierre said Friday.“It is alarming,” Jean-Pierre told reporters. “So while social media companies make their own independent decisions about content management, we believe they have an important role to play in enforcing their own rules to prevent the spread of misinformation and non-consensual intimate imagery.”Fake, sexually explicit images of Swift have flooded X, the social media platform formerly known as Twitter, in recent weeks, racking up millions of views and tens of thousands of reposts.In other instances, images of Swift and other celebrities have been manipulated to make it seem like they were endorsing commercial products.X has said it is removing the images and taking action against the accounts involved in spreading them. But the controversy has inspired bipartisan calls from members of Congress for new safeguards.","AI porn not okay. I get that, but is that different than someone drawing a hyper realistic nude of a celebrity?","White House full of swifties","OH NOW, THEY'RE DOING SOMETHING ABOUT DEEP FAKES, OKAYFine, whatever. Get them off the clearnet.","Her vote Democrat campaign is surely on the way. Pathetic.","As is tradition in the US, nothing happens till it affects the wealthy.","RICH WHITE WOMAN EFFECTEDTIME FOR ACTION","[removed]","This person knows what to do. He's seen this kind of awful filth before","I mean, they’re not real. You make as many AI nudes of me as you want. Idgaf.","Goes to show how much they care about us regular folks! Spoiler: they don't","I did a Google search on Billie Eilish a few days ago looking for a specific outfit she was wearing at an award show for something I was working on. I was shocked by how many AI images come up before the image I was specifically looking for. It was like no other tag mattered in the search either, it was all just AI generated images of her, many of them kind of gross and sexual. And this was with safe search on!","What a joke! Joey seeks legislative authority to regulate AI.There have been fake images since their were cameras.","What a fucked up place we live in.People been doing this for years.Princess diva swift is involved & legislation happens immediately.","OMG that`s terrible. Taylor Swift deepfakes? Horrible! But where? Where are they? Uh so I can avoid seeing them, I mean.","Who knew there were so many people in the white house who don't know what the 1st amendment is?","By the time any legislation is passed, the tech will have leapt forward at least a couple of iterations.","Now they care? What a joke","It’s not deepfakes they’re AI images.","What can I say except Taylor Swift has excellent PR team. She probably herself doesnt even know about any of this, she is literally too filthy rich to even care...","You think this is politically generated","I wonder how long it’ll take them to realize there’s erotic ai kiddie pics on Instagram.","I'm a little uncomfortable over the fact that this has been going on for about a decade now, particularly with children, but the moment it happenns to White American Billionaire Princess, suddenly we're calling for legislation?Where was this when some keyboard warrior from 4chan sent my cousin fakes of his 7 year old daughter? Police condescendingly told him to \"log off of facebook for a while\"","What are they going to do? Put a monitor on everyone's computer? Oh, they do that already.","Happens to everyday people, no worries, happens to a celebrity, let's change the itnernet.","well, it IS an election year. watch the US actually pretend to do anything this year.","It takes a billionare to whine for teh USA gov. to do anything. Keep voting in your bi-party system sheeps","Instead Can we call for the government to get their asses out of their chairs for the thousands of layoffs happening every week in technologyWhat the fuck","Lol still no healthcare.","Wow they didn't care when it was Emma Watson or Scarjo but not their beloved taytay","Of course, in any sane society, fake nude photos wouldn’t cause any concern, but photos of people holding firearms would cause outrage.","Our taxes are still been use to kill children around the world.","This is how we get legislation passed. Make the bill about Taylor Swift somehow.","No one cared untill they did it to Tswift. Also shows how tech illiterate our gov is","Lol...shit has been prevalent for years. Fuck women until it happens to Taylor Swift.",""],"points":6113},{"text":["Lucid CEO: $50,000 Model 3, Model Y Competitor Coming Sooner Than You Think","If the base is 50k, it’s not much of a competitor.","Base and then add ons will be 65-75k.","No thanks, get me a Corolla competitor that's an EV.","$45k with CarPlay and I’m in.","$50,000 is more than marginally more expensive than $39,000","Pretty sad marketing. Hey Lucid, we don’t car about cars you haven’t made when there are competitive EVs to purchase right now. Especially when your current models aren’t selling and can’t be produced fast enough when they are.","I want the Canoo truck","The thing is lucid isn’t really competing against Tesla. They are in competition for the luxury EV market. A 50K Lucid will sell because a Lucid will likely have better tech and performance than the model 3.","Or, how about this - design an electric vehicle that is remotely affordable, and not unibody","$50,000 GTFOH.When are we going to see more $30,000 electric cars. the upcharge for electric I don't think is justified. They're not that much better than ICE. The cost is a factor of the huge investments manufacturers have to make to produce them which is fair, but for the average consumer it's not a slam dunk that EV's are the more economical choice.Between potentially more frequent and more expensive tires, potential battery replacement cost, higher insurance costs, and higher up front cost of the car itself ICE and hybrids remain good options, with less limitations like limited range, longer charge time vs gas tank fill, and number and availability of charging locations.","Talk to us when you are closer to the $20k mark.","HURRY UP!!!$LCID shares are worthless and I'm long john loser.","If it's coming at all then that's already earlier than expected.","Tesla is has the crazy train going for their new entry level. Unless they do something astronomically stupid, it's going to dominate the EV markets and bring a majority of any populous even mildly interested in the EV markets into Tesla's ecosystem. Most other makers will have a very difficult time selling.","I would say lucid will go bankrupt before this happens but they are backed by dirty Saudi blood money.","Soooo, coming second quarter of this year? Fingers crossed!","The build quality on their 200k car is suspect. Can’t wait to see the corners they cut on this thing.","These guys will always be the premium niche, they can't compete with Tesla on scale. Impossible for them to create a profitable comparable cheap car","Ahh yes, the competitions are coming~~~ Yet again!","I don't want to be a beta or alpha tester for yet another rich CEO funded by the Saudis.","Put up or shut up, Lucid.","Lucid has to stay in business for that to happen.","Sooner than who thinks? I think it’s coming this afternoon. Does that means it’s coming sooner than that!??!?!!!","50k entry point is significant. But still out of reach for a large swath of the market.","I would be very worried buying a lucid that my warranty would have no company in 3 years to honour it.","TIL this sub has a lot of crossover with r/povertyfinanceLucid is going after the lexus/bmw crowd, not the corolla.","Could have sworn I’ve read like 2-3 things today saying they were in talks to file for bankruptcy…","Lucid Bankrupt Soon","Letd not forget that these lucid cars dont qualify for 7500 which automatically makes it too expensive than tesla cars","I mean if that’s what they want. I don’t see the need for every manufacturer to create an affordable option, I don’t see everyone driving a Bentley or Rolls Royce. I actually just started seeing ads for them and their cars look real nice and apparently have longer battery life too.","I was thinking never so I guess I believe it?","But why on earth would I buy a Saudi Lucid?!","This is not impressive anymore. Show me something on the level of BYD or I'm not interested.Chinese people get to drive these in long range (376 miles on single charge) for $36,500 brand new for the decked out premium model. Meanwhile USA only gets overpriced inferior EVs.Why can't USA compete with China on this? I want to buy that, not some shitty overpriced tesla or lucid. American consumers are treated like shit. None of these American companies care about delivering value to the consumer anymore.","How about that 30k ev for people who aren't trying to bury themselves in debt?","How good would it be with Lucid build quality with Tesla software?","Gimme a sub-5k smart car competitor and we’ll be in business","Nobody cares.","Great, now we’re directly funding Saudi terrorism","Can we get an $18k model?","They want us to move to EVs I’m just waiting for them to make them more affordable geez man","Time to buy some LUCD stock!","BYD sells cars for $10k",""],"points":2371},{"text":["Paris accuses Russia of waging disinformation campaign against France","Paris has accused Russia of deliberately spreading false information about France in the context of the war Moscow has waged against Ukraine. The French Defense Ministry pointed to a “coordinated Russian effort” involving state media outlets such as Sputnik News, RT, and RIA Novosti.France has been the \"target of a Russian disinformation campaign\" since Russian forces invaded the neighboring country in February 2022, Paris indicated. According to French officials, this campaign escalated from mid-January when President Emmanuel Macron warned of the threat posed by a potential Russian victory on the front line and announced new military aid for Ukraine.On January 17, the Russian Ministry of Defence reported a strike by Russian forces on a temporary military deployment site in Kharkiv, which was said to be composed mostly of \"French mercenaries\" fighting alongside Kyiv. Paris categorically rejected these claims, denouncing the statements about French mercenaries in Ukraine as \"crude manipulation\".","Color me shocked.","I mean.... coordinated mis and disinformation campaigns by all governments and their allies are simply SOP anymore, aren't they? Gotta wonder what is Paris really trying to do by bringing attention to this specifically and now?"],"points":9},{"text":["Justice Department discloses FBI project with Amazon Rekognition tool","That's interesting. Amazon was giving $5 credits for uploading any picture to them using their storage. Around that time I think but can't remember."],"points":7},{"text":["NSA finally admits to spying on Americans by purchasing sensitive data","The real problem here is the data is available for sale. That should be banned!","So they are using american tax payer dollars to spy on american tax payers... neat.","The National Security Agency (NSA) has admitted to buying records from data brokers detailing which websites and apps Americans use, US Senator Ron Wyden (D-Ore.) revealed Thursday.This news follows Wyden's push last year that forced the FBI to admit that it was also buying Americans' sensitive data. Now, the senator is calling on all intelligence agencies to \"stop buying personal data from Americans that has been obtained illegally by data brokers.\"I wonder why the party of limited government doesn't support sen wyden.","I will remind my friends at the NSA that buying stolen property, knowing that it is stolen, is actually a crime, all by itself. So that's a thing","So, anyone can buy sensitive data?","When is this country going to do something that is actually good for the people? I want to like my country again.","Spy on average Americans but allow Trump to mishandle classified docs, threaten to destroy American democracy and continue to incite civil war via social media. Sounds about on point.","You each are an individual corporation and YOU are what’s for sale.","Is Edward Snowden allowed to go home yet?","The least of our problems is the NSA buying these sources. Worst is Employers, Facebook, Amazon and Apple buying this info.","What's sad is Snowden gave us evidence this was happening but we ignoredAnd even though he said we would be willing to be tried in a court of law in the US, the department of Justice has said they will usurp his right to a jury trial and go straight to a beach trial","Wyden while good intentioned is proof why politicians have no idea what they're talking about when it comes to tech. NSA is purchasing Internet netflow data, not browsing history. Those are completely different things. Netflow data is critical for an organization like NSA to understand and track adversaries in cyberspace.","That is not the problem . If they can purchase it that mean everyone one can buy it","So to be clear, what essentially happens here is that they buy access to databases from data brokers, or to tools which get their data from those places. They aren't collecting the data themselves, or at least not what's being talked about here.The issue is that these are civilian entities that don't generally differentiate between US or foreign people in their data. NSA has access to a lot of Americans' data this way, but that doesn't mean they're allowed to use it, nor is that the purpose of obtaining the data. Being a DOD entity, the NSA is interested in foreign personnel. Domestic activity is extremely heavily regulated.","Dude. It’s up for purchase, why don’t you ask why your data is up for purchase instead ?","Why are people surprised by this? You should be more worried about what 3rd parties are buying the data. Almost any social media site you sign up for allowed data harvesting in some regard, not sure if its allowed now but there's always loopholes. Some of the cabling jobs I did years ago were done for companies harvesting data to sell for different purposes.","Headline is false and misleading.","If you don’t think the NSA knows everything about you by u a unique identifier you have another thing coming.","I’m over here just wondering what’s in John Oliver’s manilla folder","Want to know what else? They are also harvesting encrypted data because the day will come when quantum computers can crack it. Don't even need to necessarily buy it illegally, they can intercept it. Anyone can.","The NSA collects and stored every communication in every modality in the world. Period.","As if they aren’t spying all the time, trying sending an email to a friend explaining how you were going to assassinate the president and see how that goes for you…","NSA I could have gotten you a deal on my pornhub history for free dawg.","NSA: wow, that guy really likes hentai...","So the government Took my money.. To give to rich people.. In order to buy personal information I didn't consent to give anyone in the first place.Disgusting how people in power spend their their time with our money.","What’s their point? None of their data collection prevented J6, fake electors, school shootings, kidnapping plots, etc.","Fuck all of them. 🖕","Like they don’t already have a list of every text we send and every call we make. I’d bet they have access to every connected computer as well","Pretty sure everyone was fairly certain the NSA was doing something like this","They know who everybody is on Reddit, for example. Names, addresses, number of guns, number of Covid infections and where you stand on Israel and Ukraine.","Thanks Snowden!","Ed? Are you there? Mr.Snowden…hello..?","Unfortunately, this is legal. Let me know when they admit to hacking our phones to watch us while we poop.","Thought this said NASA for a hot minute there.","Wouldn’t need to buy data if PRISM was still a thing. I’d rather they use that software that’s already paid for than spend extra to buy it.","So basically the US government admits it is legal to buy their leaked data, because they can purchase our data.","They left an \"again\" out of the title.I've lost track of how many times the NSA has been caught spying on the American public in my lifetime. Every time they go \"oops! We'll stop. We promise!\" and go right back to doing it.Kind of funny they did it by buying the info this time. At least they're varying their approach.","PAY US FOR OUR DATA. Watching ads is like in Being John Malkovich when they renting out time in his head","What if everyone incorporated themselves? Would that give some kind of legal protection against selling proprietary information, or make it espionage to collect unneeded information on you? Seems companies have more rights than people.","I'm fully convinced NSA employees get annual training about not revealing whom they work for. Not for OPSEC reasons, but because in 2024 most rational Americans would hear \"I work for the NSA\" and immediately punch them in the face. Repeatedly. With a brick.","Companies can purchase it to. Nothing new. Nothing illegal by capitalistic standards.","the senator is calling on all intelligence agencies to \"stop buying personal data from Americans that has been obtained illegally by data brokers.\"Pretty sure he just means they should keep buying it from China & Russia","Well seems like you can send a cease and desist to the NSA now, along side a data deletion request.","As published in DUH magazine","News: \"hot new website hacked and data for sale!\"NSA: \"Oh, that's awful...where so I can make sure I don't go?\"","[deleted]","Every gun nut online thinks there is no list. There's a list.","In other news the sun shines….","KashiHassaniAlexanderPensatoriKhashayarHassaniJustKashiNanosuitNiggaWhiteSuperClassTech","Oh no how embarrassing now they know I search for beanie babies last week on eBay,","Oh no way. 😮🤦‍♂️","Oh noos I’m on a list for being too librullll","I mean, they're buying this info through legal channels rather than warrantlessly wiretapping.It's not the NSA's fault that the data is legally up for sale.","Only criminals care about complete privacy. If the gov wants to see what porn I watch, have at it.","At least it’s not Chinas/ (both USA and China spying on Americans is bad)","Open secret","Best way to solve this: make that kind of data inadmissible in court and consequences resulting from the use of this data (no knock warrant, etc) fruit of the poisonous tree. Practical worth of the data for government use falls to zero while not impacting businesses.......we can worry about them and their data collection BS afterwards. The real danger here is government agencies and their ability to bring force to bear, regardless of who is in power.","\"may only purchase data about Americans that meets the standard for legal data sales established by the FTC.”As a non-American, I'm not impressed. Why don't your rights extend to me?","If the product is free you’re the product. Why are people surprised by this is the bigger question.","Yep, sounds about right.","I’m super shocked. 😒","Quick, act surprised!","Send the people responsible for this to jail. If a regular poor citizen shoplifts from a store, police will chase them down. But these people responsible for massive wide-scale crimes just get a pass? Shame.","American citizens should be able to easily review all the information every government agency has collected on them. Government surveillance requires a warrant under the 4th Amendment.","In other news, water is wet.","Fine, I jerk off to the green M&M, ya happy you weirdos?!","Consolidating so much power, the govt doesn’t even care who knows anymore.","Web 3 Depin take control of your data.","Not surprising.","Did you think it should be otherwise? Just look at the Republican Party.","When is nasa gonna announce the earth isn’t flat since we’re just reporting known knowledge.Literally it’s in the name of the agency,an accidental click can possible fisa warrant.","How about \"NSA spies on Americans that same way corporate America spies on Americans\".","The NSA is like an old cartoon villain. We see you behind those bushes. I noticed your trap.IT IS I! THE NSA!...We know...","Another reason that if the government should be limited in size, so should corporations like Facebook that sell our data.","Who else is buying this data besides US agencies? Hostile foreign actors? How do you propose that we discover that and determine what kind of data about Americans that they’re buying?","How can they see your data if you are using a VPN with encryption?","Head of security where I work, on a federal site said that was happening and I didn’t think it was big news because we all already knew it was happening, but this article makes me think some people who this upsets just aren’t paying attention. His words were “if the federal government’s agencies are doing this, who else do you think is buying this data?” This was a warning about what you post on social media or search anywhere. I still took his safety lesson to heart because this was said during our orientation.He’s right, obviously…. But I thought we were wholly aware for a long while now that that’s how they got around that pesky constitution.","Now, can we have a fair and intelligent conversation about the data that is collected and shared by the ‘five eyes’ alliance? If ever something stunk of the collective abuse of our rights, and our governments’ legal obligations, this would probably fit there.","I bet Americans' data isn't all NSA bought.Hello, NSA? Yeah, hi. Learn much useful stuff from everyone's stuff?No?It's mostly garbage to feed your minority report wannabe AIs?Cool. # $wellspent","I miss the times when they would just spy on you and not go around law by having contractors do the dirty work","Isn't that purchased with tax money too? So... Americans buy their own data to be used to spy on themselves. The only winners are the data brokers. It's so fucked"],"points":834},{"text":["EU elections a 'prime target' for disinformation","With a bumper year for elections worldwide, including June polls for the European Parliament, European Union officials tasked with monitoring disinformation are on high alert.A dedicated EU task force investigated 750 incidents of deliberately misleading information being spread by foreign actors last year, published in a new report. As in previous years, Russia was the primary source, \"trying to justify its war of aggression against Ukraine,\" the authors of the European Union External Action Service (EEAS) document wrote.Ukraine was the number one targeted country, followed by the United States, Germany and Poland. Close to 150 institutions, including the EU, NATO and media outlets like Deutsche Welle, Reuters and Euronews, were affected.In its second annual disinformation report, EEAS wrote of continued \"intentional, strategic and coordinated attempts to manipulate facts, to confuse, and to sow division, fear and hatred.\" A notable trend in the past year was anti-LGBTQ or gender-based disinformation.","We are entering the age of AI and deep fakes. Every single election is going to be a prime target going forward.","\"We'll know our disinformation program is complete when everything the American public believes is false.\"  - William J. Casey, CIA Director (1981)Governments are rampant because before Social Media's they had the total control of \"dis\"information..."],"points":4},{"text":["Work chat gone quiet? Microsoft Teams down for thousands of users - National | Globalnews.ca","\"Thousands\" is a few orders of magnitude low....","World productivity jumps by 25%","It's taking a long time for messages to go through along with reactions. Images don't load or send. Then they do. Then they disappear. It's Friday afternoon so I'm phoning it in at this point.","I was quite enjoying the peace and quiet","My wife’s company was affected. She decided 3pm was a great time to check out for the day.","This would be great if I weren't in the middle of a release.","The AI has decided it doesn’t need to talk to itself to get work done.","I work in IT and we had a lot of users unable to use teams today. Not much we could tell them as it’s not our product to support lol","Oh, no. I can’t get on Teams. The horror.","Just think... in one multiverse, it crashed so badly as to be permanently down after today.I dream of that place...","Fuck yes free nap","Now stay down!","Probably just the usual Friday afternoon slacking.","Yup, I work in IT. Been telling people to use Outlook for important messages and attachments. Its actually be quite a nice day! Usually I am constantly bombarded with Teams messages.","Should happen weekly every friday.","My work using Teams and Sharepoint essentially ground to a halt today","Watch them spin this as another reason to return to the office.","It was awful while down. I had to talk to people face to face in the office instead of on Teams.","Slack gang represent. Teams fukn sucks.","Feels good man","Been having issues with multiple internet reliant Microsoft products all day long.","Sweet silence","Holy crap we're back up at my work now.","God dammit why couldn't ti's of happened uk working hours","Why can't Slack go down once and a while.","Was fucking up all day today at my work.Guess I know why now.","Happened at my hospital today. Shit was hard down","So none of my coworkers has working Teams, but I did. I just kept spamming them. Jk.","My work it started to put conversations in the wrong order then fix it then reorder them","Totally fine for a Friday","This is what I get for planning all my collaborative testing and shit to be done today. 😂😂😭😭😭😂😂😂","This happens at work like once a month minimum usually for an entire day. I’m surprised this is a headline. Onedrive and teams are hot trash and I think we should just go back to pen/paper and carrier pigeons","Does anybody know if they will force new teams on users? I used it and then switched back because of a sharing screen controls position on top that blocked controls of rdp.","I was joining a meeting just as this went down. I was able to connect but it took 3tries. Then my company sent out a e-notice that Teams was down. It was a new GUI and I didn't like it FWIW","I’m off today. But my GroupMe chat was buzzing non stop this morning because teams was down and my coworkers were using the GroupMe app as an alternative","My work has been using Microsoft Teams for the last few years, and it's served us well. But I'm not sure what they would move to replace it with. I can't see something like Discord moving into an office space.","Crazy mine never went down just hearing of this","Seems fine for my company so sucks for those who need it.","It couldn’t have happened at a better time. Friday on a 70 degree day.","Use it for telemedicine. Sucked."],"points":894},{"text":["Unleash your dark side in this Hexen and Heretic inspired game! Wishlist now on Steam!"],"points":0},{"text":["iPad users will miss out on third-party app stores, browser engines, and more","lol of course.","I have an iPad and I swear iPads are becoming so niche. At this point, the target demographic seems to be Apple enthusiasts and businesses.","When the manufacturer can brick your device at will, you have a glorified brick. Which was purchased willingly and probably enthusiastically at the time. Probably the 3rd or 4th brick in fact."],"points":9},{"text":["No, Canada’s navy did not sink 312 Chinese ships","More than 15 videos have been posted recently on YouTube supposedly portraying Royal Canadian Navy military actions in the South China Sea and the Middle East.Article contentIn one video segment, it is claimed the Royal Canadian Navy and the U.S. Navy recently sank 312 Chinese vessels in a dispute over illegal fishing.Another video claims to show the Canadian frigate HMCS Vancouver “sink dozens of rebel ships” in the Red Sea as its crew battles Houthi militants.The videos are laughable to anyone who has more than a cursory knowledge of current world events or the Canadian military, says Martin Shadwick, who teaches defence studies at York University in Toronto.","526,000 of those 527.000 views are probably bots too.Bots writing crap watched by bots watching crap watching bots go by.","That’s what they want you to think. The Orca division of the Royal Canadian navy is beyond dangerous.","That would be insanely impressive if we did, but it's so obviously wrong. If we did that, China would've publically declared war by now.","Please just let Canada have this one. This was giving them their first measly taste of street cred.","312 was the beer they drink while writing it","This is almost exactly the plot of Tomorrow Never Dies the James Bond movie.","Bro the RCN is a failing org. They can barely staff a ship for more than 2 deployments. With all the harrassment that goes on in the navy it's no surprise and it serves them right.","It'd be a lot cooler if they did","[deleted]","Downvoted in disappointment","Only 311 then?","that'd be quite a big day","This is a strong indicator that China is actively using machine learning to generate content and the unbelievable number is one that no human would take seriously","Big if true.","Yes they did","Canada having armed forces of any kind just seems silly."],"points":199}
]