[{"text":["The Pixel 8 Pro can now read body temps, if you swipe it across your face","Just tried it. Seems to work as well as other forehead infrared thermometers. Which is to say, not super accurate but good enough to know if you might have a fever. I could see this being really useful if my kids complain about not feeling good and I'm not home or otherwise can't access the thermometer. Cool.","","Got enough problems keeping my allegedly oleophobic screen clean. And you want me to do what now with it? Can’t wait til smartphones start shipping with rectal thermometers.","Yeah I’m good","My phone is too dirty to put on my face","Gross. With how dirty people are this is more likely to get you sick then to show if you are sick.","Well that's not alarming at all...... I wonder what the market is for dumb phones these days?","Pixel 8 pro can now track women’s fertility","I have a thermometer that does the same thing, but I can't connect to the internet with it"],"points":85},{"text":["Saying goodbye to Mars helicopter Ingenuity after 72 flights","This was one of the coolest things ever. I thoroughly enjoyed watching every single video this little guy put out.","Good night, Genny.","🥲"],"points":8},{"text":["Fossil is quitting smartwatches | The group is leaving the entire category behind. The Gen 6 will be the last gen of its smartwatches.","I hope they continue their hybrids as I really enjoyed mine","In a sea of black blobs with resin straps, the Fossil and Skagen models really stood out as genuinely fashionable smart watches, so this is a real a shame. But perhaps not that surprising seeing how bad they've been at supporting their models post release","The problem is they made good looking watches made well but really sucked at the smart part.","A little sad to hear this, but not surprising.My wife and I both were early adopters of Fossil smart watches. They looked great, but they were a little limited, software-wise, and the battery wasn't great. Still, we liked them for their looks.Then we switched to Samasung Active 2 watches, and we realized everything the Fossil watches were missing. We sold them both shortly after that, and I never looked back.I appreciate Fossil for embracing the smartwatch scene early on, but it's clear their hardware just wasn't competitive any more.Goodbye, Fossil smartwatches. Thanks for looking cool on my wrist for about 2 years.","TIL Fossil had smart watches.","Shane. They were one of the few companies making Smart watches that don't look like an average rubber sports wearables.","They should probably just pair up Samsung and make fossil licensed Samsung ones. Im on iPhone so I’d prefer that be an Apple partnership but obviously that would never happen lol","I guess it will be quite an apt name when someone discovers one of these in a few years…","I’m still salty Fossil took over Misfit a while back and killed off Shine devices. I would still be using mine if it was supported.","I never understood the appeal of a smart watch, so maybe someone here can help me. Isn't that screen ridiculously small? What do you do on these things?","Ironically, my last analog watch was a Fossil. It was really a nice watch. I never looked back when the OG Apple Watch came out.","Hmmm expensive smartwatches with mediocre support. I wonder what went wrong 😑","Will they continue to have watches the size of dinner plates tho?I've liked some of their designs but as a male with wrists like a baby bird's neck i can't wear them without looking like i've accidentally strapped myself to a manhole cover.","And nothing of value was lost. Their post release support was always trash.","Their build quality was absolute ass. Good.","Battery life is the primary reason I switched from an Apple Watch to my Garmin Instinct Crossover solar. It’s great for my needs which are primarily a fitness tracker with notifications. However, most people think it’s a Casio watch and that it is “cheap and ugly”. On the upside for me, I have charged it once when I first bought it and never again as the solar works as advertised even with sensors and GPS on a lot of the time.I don’t exactly have a high opinion of Fossil as their whole deal was cheap “fast fashion” stuff, but it sucks to see another non-rectangle approach to smartwatch leave the market.","You just can’t beat the Apple Watch","How about just get out of the watch business? They're garbage.","I had a smart watch for years, i threw it away.. never seen the upside. Switched back to a old fashioned automatic and never been happier..","They probably dont have the technical know how or access to equipment to make a samsung competitor (at any profit) per unit.They dont get any other subscription funds either to support.","Never heard of them","Huawei is the reason. My brother's $40 smartwatch works great 5 years later, still get regular updates.","They should also get out of the watch business while they’re at it.","TIL people still wear smartwatches, wild.","Are we surprised? Fossil is a marketing company that happens to make accurate (lol ha!) quartz watches marketed as Rolex-quality for $400, whose founders later developed Shinola (where the big S stands for shit or scam).","Tbh good. Fossil makes good budget watches, quartz and mechanical. The only similarities between those and smart watches are the form factor. Phone companies are more suited for making them with profit in mind.","Who?","Who?","I considered the Fossil Gen 6 because I wanted to get away from Xiaomi. Although the Xiaomi S1 is a very good smartwatch overall, it had trouble connecting with some apps I liked. The Fossil models look cool, but then I read some user reviews and thought uh-oh. So for me no surprise here.","In years to come they will be antiques and not long after that fossils again","dang i bought one for my dad last father's day, wanted to get him a smartwatch from a known brand with decent ecosystem support like wearOS (or i should've at least done my research)wonder how support's gonna be like in the coming years tho","TIL Fossil makes (made) smart watches.","I have one from the holidays 2022 and I hate it. Functionality is crap, feels like there's bloatware from fossil interfering.","The “hybrid” watch is really a niche so it’s not surprising. If I’m doing sports, I want something like an Apple Watch or a Garmin. Whereas if I’m going out, I’d much rather wear a classic watch that looks good and doesn’t annoy me with notifications.","That's a shame. I recently bought a Gen 6 hybrid, and it does the job just fine for me. Love the two week battery life.","Just curious - what are the best smart watch alternatives to apple?","I had three different Android watches, a Motorola around 2015, fossil in 2019, and Samsung in 2021. In all honesty the completely different ecosystems and OS with all of these Android watches, it's such a mixed bag, but I do remember fossil being one of the glitchiest and shortest battery life, with it looking the best in my opinion","No surprise. But a real shame.I have a Hybrid, but I've had to get it replaced twice because the screen just fades after a while. I love how it looks, functions etc. But they just seem to naturally become unreadable after a while.","I’ve had about 10 of their smartwatches and the latest ones were easily the best. I have a latest gen fossil and a latest gen skagen, and a latest gen hybrid (I received the the fossil as a replacement for a repair they couldn’t make and the hybrid as a gift). I like all three, but last year received a pixel 2 when I finally upgraded my phone. It’s pretty good too. However, I have found I can live without the smart features and have gone back to wearing a 10 year old citizen eco drive or a Casio digital daily. I love watches…it’s a character flaw","TIL Fossil made smart watches","Pity, I really liked their designs.My current watch is Skagen Gen 6 which is still under Fossil and the previous one was Fossil Gen 5.Aesthetic wise, these 2 brands are my favorite."],"points":877},{"text":["ExoM armored exoskeleton takes a load off – and stops bullets, too","Coming to a police station near you!","on the bright side, i suspect like 60% of the cops wouldn't be able to squeeze themselves into one of these suites","Wearing this to a school","Fallout power armour :)","How does it fair against grizzly bears?","I wonder if a civilian version of the suit could help the people with muscle problems.","Halo Spartan by any other name would be just as sweet.","I'd buy that for a dollar.","[deleted]","Tom Cruise would love it!!Live. Die. Repeat.","Needs larger pauldrons.","It’s 120 F in the desert and the cop pulls you over. ‘Just a sec while I look for my insurance…’.","But does it have an energy shield and sentient AI so that we can fight off the Covenant???","This is simply bulletproof armour. It has no power and adds no other capability. As an exoskeleton I was hoping for something that added functionality.","What happens when that guy needs to take a dump?","<image>","Warhammer 40K vibes on this.","Makes an armor to stop bullets. Well looks like it’s time to make money on bullets that can penetrate this armor.","Can’t wait for the high school graduate to be wearing this when he pulls me over for going 4 miles over the limit!","Hey honey new school uniforms just dropped","I want to work on something like this 🥺🥺🥺","The US will certainly allow these for civilians and soon we’ll have bulletproof mass shooters :(","Did they design this after halo?","Fire gonna be lit","Tarkov Giga-Chad Lord","Does it tickle my pickle while I'm killin'??","it can stop bullets and make u come? nice","Now we need to paint them in super bright colors and add ridiculously huge Pauldrons. I already feel like I live in A hive city.","average American high school uniform","That shit gonna be hot in the summer.","So the suit DOES do it","Kinda wonder if just using an Up Armored Riot Shield mounted to a motorized Steady Cam Arm wouldn't do a better job? 🤔 Even the heaviest impacts ( assuming they don't penetrate ) wouldn't affect you due to the Arm's Kinematic absorbing the hits 🤨Ja kno' going full Roman Legionnaire Style but modernized?If you have to hightail it the push of a button could release you from the majority weight which you definitely can't do with that Exo getup.","First this, then thunder warriors, then full blown astartes, about 30,000 years ahead of schedule","Queue Gregorian chants with heavy metal guitar riffs","Can’t wait for a policemen to be wearing this whilst he rips my spine out of my body for not respecting his roid-rage-filled authority at a routine traffic stop. Its gonna be great!","Where do I get that crotch shield?","Please say they are WiFi enabled.","Doesn’t matter, cops still won’t confront an active shooter lol","So they’re making N7 Specter armor now? Sheppard would be proud","Ripley wants one.","New school uniform","More tools of death. So excited. /s"],"points":535},{"text":["Unleash your dark side in this Hexen and Heretic inspired game! Wishlist now on Steam!"],"points":0}]