[{"text":["Just got a Samsung Galaxy S24? Here are the 13 features to try first"],"points":0},{"text":["Raspberry Pi mini desktop PC has a 3D-printable case and plays DOS games | Classic gaming with a taste of Pi.","I want to just buy this without having to print.","eh I like just using a Raspberry Pi 400 instead. Makes it feel like im using an Atari 800 or C64","Blake Stone was the shit.","Lot a desk space and plastic for a nostalgia hit.","Love that they chose Blake Stone: Aliens of Gold to be on the screen.","Leisure Suit Larry plz","<blows dust off Kings Quest>I’ve been saving these."],"points":9},{"text":["Japan will no longer require floppy disks for submitting some official documents","Japan entered the early ‘00s in the mid ‘90s, and they’ve been there ever since","Aren't they still using faxes and seals for everything? Floppy disks are not the only obsolete things that are required officially.","This is devastating news for BigFloppy","You mean save points?!","And Japan leaps into the 21st century!","Amazing, maybe in the next ten years they will switch to USB Drives instead of CDs","So advanced","SOME","probably moved on to CD-Rs, then. heh...","They still use denpo though, how useless...","Are they switching back to Stone/Clay tablets?","About time they upgraded to the superior Zip disk","But but snapping the little metal covers back and forth is sooo awsome. How can they take that away?","/raises hand to ask a question“We know what you’re going to ask. It’s too obvious a question, so don’t even bother”/puts hand down","I'm curious HOW one records information on floppy disk these days. Where one even gets fresh floppies. And don't they hold, like, 200 Kb??","I mean many governments still require paper documents and copies and whatnot. I do miss me a good ol' floppy disk tho ngl."],"points":244},{"text":["AMD’s new CPU hits 132fps in Fortnite without a graphics card | Also get 49fps in BG3, 119fps in CS2, and 41fps in Cyberpunk 2077 using the new AMD Ryzen 8700G, all without the need for an extra CPU cooler.","These are great APUs. I built a PC for my niece but all she does is play Roblox, so I put a 3400G in there. It actually runs amazing. Anything else would have been overkill. There's definetily a solid market for these.","I can see the low end graphics card become redundant in the future. Mid and high end are certainly not under threat.","8700g is more expensive than 5700g+6500xt which does 200+fps in fortnite and better in other games as well. Go watch Hardware Unboxed Video on it. No doubt it's a great Product but the price is not justified.","An ‘extra’ CPU cooler? How many coolers do you guys use? I only ever have the one.","It's nice and all, but it's very expensive.","For those wondering the GPU is a well-known Radeon 780M.","For the developing handheld market, things like the Steam Deck, this will be great!.","Stupid question. Could I combine the graphics power of the cpu with my existing nvidia graphics card?","Wonder how well it would do as a dedicated streaming machine","Can someone explain what is ment by an extra CPU cooler? Was the expectation you’d need two different CPU coolers?","\"The temperature of the sun... In my case\"","This makes me wonder: is it possible to build a desktop that has power savings similar to a laptop when idle (or doing menial tasks)?For example, if I want to game, I'd like it to used as much power as needed... but when it's idle it throttles everything down and uses practically no power (perhaps turning off power to the GPU).What I'd really like is for all fans to turn off when at low usage.Are there power supplies out there that can be decently efficient both at full blast and also when sipping energy?Haven't built a new machine in over 10 years. Maybe this has been possible for a while?","Can't wait to see how good these are for emulation. I sure do like to collect and configure a bunch of stuff for games I never play.","Yeah but what quality setting","“Medium detail settings”. Might as well buy a console at that point.","I think they went too far with the CPU cores and overpriced this one. 6/12 cores with the same iGPU for less would perform exactly the same and greatly help push the value. The CB score is close to my 5900x, lol. Even the 5600g has more CPU than it could ever need for iGPU gaming. I see these being more like a HTPC that can actually run games rather than an ultra small workstation that can. If you need CPU compute for your workstation, you are probably fine getting a 7900 non-x and give up on the GPU performance or accept something slightly bigger for way more power.This does show that the next set of handhelds can be really awesome though once they balance out the CPU/GPU configuration.","It's all good, but can it run Crysis?","I dont kow much about comps but a few years ago I got a lenovo laptop im still using ow and typing this on. Its got a amd ryzen 5 with 16gb of ram and I paid 600 for it. No graphics card, and it can play GTA online and THPS 1+2 great. Im pretty happy with its gaming capabilities even though I know it cant run new AAA stuff, its pretty solid for a 600 dollar 3 year old laptop imo","Needs to be at least $100 cheaper on the high end.A Ryzen 7 5700G ($170) + RX 6500 XT (ITX Sized) ($120) + 32 GB DDR4 3200 ($65) +AM4 MB ($120) is $475.The equivalent 8700G setup is 8700G ($329) + 32 GB DDR5 6000 ($115) + AM5 MB ($150) is $594.The 5700G is less performant than the 8700G at CPU tasks (15k vs 8k geekbench score), but the 6500XT more than makes up for that on the GPU front (175 FPS vs 119 FPS), and you are rarely CPU limited on games anyway.And the ARS review balances their budget on the non-8700G build to use an even better video card, which would lap the 8700G even harder.Sources:8700G benchmark https://www.techspot.com/review/2796-amd-ryzen-8700g/#iGPU-CS26500XT benchmark https://www.techspot.com/review/2789-amd-radeon-6500-xt-revisit/#CS2-oArs review: https://arstechnica.com/gadgets/2024/01/ryzen-8000g-review-an-integrated-gpu-that-can-beat-a-graphics-card-for-a-price/","At what settings though?","At what resolution? Could be 240p for all we know","Cant they, at this point, slap a full-blown graphics chip onto the CPU?","In 480p ultralow setting?","(in 800x600)","Real question: can it run Minecraft?","What potato resolution?","OK so it's at 1080p medium settings. Not really that revolutionary except for people who want to game for real cheap but want a PC and not a console.","This just shows how bad CS2 is Optimized.","Yes that's all good and all but at what settings? My car also goes from 0 to 60 in four seconds if I push it off a cliff but that's not the normal use case so I don't tell people it does. I really dislike the straight up lying companies do when advertising. Don't tell me the best possible scenario. Tell me a realistic one.","Nah, at $330 you can have a dedicated gpu with even better performance. Also, can anyone tell me what they mean by an \"extra cpu cooler\"? Do you ever need more than one?","I wish I could use it with the dedicated GPU to gain a few fps.","Also it can brick your entire system. Worth every penny.",""],"points":2766},{"text":["Honor Magic6 Pro with 5000 nits display and 180 MP periscope telephoto camera to launch globally at MWC.","5000 nits for 2 seconds before phones overheats and goes down to 300 nits","Imagine the random full brightness restart animation at night.","This is what comes to mind","Dont want to experience that 5000 nits during night while checking my phone..","I feel like that s24 plus should have had a periscope sense given the price of $1k. Especially if cheaper can do it also well","Is the 5000 nits available during regular viewing ? Do you get 5000 nits of specular highlights when watching hdr content ? Or is this just like Samsung's s24 and can only achieve that in direct sunlight","Is this what we're doing now? Forgetting actual upgrade needs to focus on brightness?","All I need is sub 6 inch phone to be mainstream again..","180MP… just a few years back my 1020 Lumia was King of the Hill, and kinda still is as my “you can’t bring a camera in here” phone.Thing is, the 1020 had a floating optical array… and amazing low light capability. I wonder how 180MP will look today in a phone."],"points":45}]