[{"text":["Bumpy solar cells could harvest up to 66% more energy","It’s actually just magic spells written in braille to improve efficiency","Man, so many new things with solar, it’s hard to know when to jump in. I want panels, but live in the north without a huge amount of direct, south facing sun areas to put them. If they were more efficient, I’d jump in. They may be good enough now, but I don’t want to spend the money and then find I could have done better a year later","How do I know there won’t be embarrassing phrases written in Braille on my new solar panels?","Having a zigzag-like at the bottom surface inside the solar cell also helps tremendously. Light that enters near perpendicular to the surface can end up reflecting off the bottom surface and go right back out before being absorbed. Having a bottom surface that isn’t flat causes the light to travel back toward the surface at an angle which can help create total internal reflection. This design costs too much to be worth the cost at the moment. I wonder if that design was a motivation for this research.","Clickbait.While the team hasn’t actually built physical versions of these solar cells yet","We all know that but the big dirty energy oligarchs like bp, shell, gazprom just to name a few will try to suppress this as long as possible.","What about magnifying glass or would just increase heat?","And more heat","Each bump is a lens?","crunchy peanut butter is also better than smooth","Does that thing have a (bunch of) HEMI(s)?!?!?"],"points":89},{"text":["This tiny, tamper-proof ID tag can authenticate almost anything. MIT engineers developed a tag that can reveal with near-perfect accuracy whether an item is real or fake. The key is in the glue on the back of the tag.","From the article:They mix microscopic metal particles into the glue that sticks the tag to an object, and then use terahertz waves to detect the unique pattern those particles form on the item’s surface. Akin to a fingerprint, this random glue pattern is used to authenticate the item, explains Eunseok Lee, an electrical engineering and computer science (EECS) graduate student and lead author of a paper on the antitampering tag.Very clever, IMO.","terahertz waves, which are smaller and travel much faster than radio waves.What? “Radio waves, which are smaller and travel faster than radio waves (light)”??","i do not understand how this helps to authenticate anything but the tag itself.if i acquire an 18th-century berry spoon, this tag will not help with anything. similarly, if the tag is put on a box, a fake item could still be put into said box.this is very interesting, but i do not see how it is actually useful.","Can’t wait to see what Deviant Olam thinks about how tamper proof this product is.","Put tag on counterfeit product. Profit.","Counterfeit glue market booming","So I’ll make a tag that says “I’m not fake” all of the time.","This really sticks out","I know someone who worked on a project just like this for years over a decade ago. The main backers were big liquor (Diageo, etc.).One problem they ran into was it was possible to refill bottles. The sticker remained attached to the bottle. They tried to work around this by putting the sticker on the seal, so the seal would be broken when you opened it. But then the bottle couldn't be validated after it was opened, which matters in some outlets like bottle service clubs.Anyway, their money ran out. I could see why the companies liked this idea though.","Can it authenticate ur mom","Manufactured in China… Fakes are also made in China. Ironically the Fakes are also made in the same factory as Authentics."],"points":50}]