[{"text":["Nintendo shares fall after report that the Switch 2 will be delayed until 2025","Nice to know any publication big enough can affect an entire market. How much do you wanna bet people there shorted Nintendo before releasing their \"inside information\"?"],"points":0},{"text":["Wyze says camera breach let 13,000 customers briefly see into other people’s homes","That's why I only point my cameras at other peoples homes.","This is unfortunately extremely common. Baby monitoring cameras and pet cameras, especially have horrible security. People buy them for cheap on Amazon from random no-name companies that usually just buy them and slap their name on and resell them. They usually have zero consideration for security. Having devices like these on your network can open up all devices on your network to attacks.","Stop putting live feeds of the inside of your home in the cloud. If you want security cameras, invest in a system that records locally only, and is only accessible while on your network (or with a secure VPN).Stop putting cameras IN your home. They should be outside only if you really value privacy.","This doesn't sound like a breach at all, it sounds like a bug. Breaches are malicious intent, which I'm reading none of. Still bad though.","And this is why you don’t use cloud-based consumer security products, particularly ones you find on the TikTok shop for $20.The last thing I want is for some creep on the internet to be able to see my kids playing in the back yard.","This will continue to happen until companies realize that attaching their tech to the Internet makes them a data security company first and a hardware company second.","I love these discussions on Reddit; they inevitably devolve into a “why I’m so much smarter/better because I do things like xyz..”","Exactly why I don’t use cameras that require a service.","Wyze doesn’t have a perfect track record, but they’re better than most companies in their price range.","Welcome to my boring life.","Dale: So who wants the new introductory surveillance package? For an extra 30 bucks a month, you'll get a closed circuit feed of Bill's house. It puts it all in perspective, believe me.Bill: I believe you.","I just don't understand how caching can possibly relate to userId's and deviceId's being checked against in a system. These id's are normally 36-character alphanumeric strings or better known as uuids in any type of common sense platform. They don't change once assigned to an item. So why caching could cause access to other people's cameras is beyond me.","Another win for self hosting with blue iris or an alternative.Why anyone trusts these companies I'll never know.","I don’t have any of their cameras, but I do have a couple of their smart plugs and now I’m worried someone else can use my electricity!!","This is why I don’t use the cloud and I have SD cards in mine. Hope that was enough lol.","Why do people continue to put cameras inside their homes? You might as well just remove all your shades and leave the doors open.","Ohh so they are allowed to see/use camera with out paying 20$ per month lol","Thats not a breach, they f’d up.","This brand is heavily promoted on TikTok.","Aww shucks they got my private privates cam. Now a guy will email me blackmailing me or he might release my naughty pics.","Waymo cars are absolutely covered in cameras, constantly surveying every bit of public life along where they drive. Can't wait till the story breaks on that ticking time bomb.","How so? Some cameras are outside. Did the breach only affect cameras inside?","What is my purpose?\"You allow strangers to watch me walking around the house naked.\"Oh...my...god.","This sucks. Literally the equipment I have recommended to friends and family.","OMG that's so creepy, can't believe this happened 😱","I was one of those people. Someone saw me hitting a big bong rip lol","Time for some laws regarding this. Cloud home invasion!!","Unifi Protect ftw!!!","Why do y'all use this shit? I swear, people are gaslighting themselves in to believing this isn't weird as fuck to have in your house.","Aaaaaand I’m done with Wyze. Fool me once? Shame on you. Fool me twice? Shame on me. I’ve got five Wyze cameras and three smart plugs. All of which have constant issues. This is the straw that broke the camel’s back.","For the most part it’s just going to be a lot of farts, burps, and undesirable naked activity","I love when stuff like this happens. Maybe it helps someone learn.","So someone got to watch my pet lizard roam around her cage? Cool. /s","Aww ......that sucks. I know someone would have appreciated my outdoor cannabis grow this year. /s","I always see viral clips of people from within their homes and I can't understand why people have cameras in their living, and sleeping!!!, areas.What exactly is the reason for it? Security can be outside not inside."],"points":598},{"text":["The UK moves another step closer to banning phones in schools | It follows countries like France and Italy in restricting phones during class.","See now we (US) could have this but instead we've chosen guns.After a gunman scare at my son's high school & then an actual gun used at the school next town over, i am pro-phones in pockets.","My kids have to lock their phone in a box at the start of school, then get it back from the box (along with all the other kids) at the end of the day.I'm fine with it. Kids were annoyed at first but quickly adjusted.","They need to do this in the USA, ASAP!","\"We don't know how to make learning interesting so we'll just pretend it's the kids' fault.\"- awful teachers since time immemorial"],"points":29},{"text":["Samsung Galaxy Tab A9+ review - The 90-Hz tablet with 4 years of updates leaves little more to wish for","bought an A7 lite new in 2022 and it was fucking amazing to me that this was a product being sold new. unusable in every way, expect to wait 5 minutes just for the tablet to finish starting up. almost one minute to open basic apps. every gesture is about 2 - 5 fps. and no, there's nothing wrong with it, i didn't set it up wrong, i didn't install weird shit or fuck with it, that's just the way it is. that's how it performs.","The A series tablets have never been a good value preposition, ever. Always offering too little too late.","Best tablet Samsung did was the Tab S5e. There's no way in hell they'll release a 400$ tablet with an OLED screen again. And that is that light and thin.","Got the 8+128 Wifi version for around USD 200. Had it for around a month, all I can say is it hasn't stuttered or lagged yet. Streaming, smart view, google sheets, facebook, reddit all running without needing to clear ram.","4 years of updates? I’m sorry but I need it to last at least seven years","I really wish there was an Android equivalent of an iPad Mini. This just doesn't perform to the same standard, the screen is too wide, and frankly, the app situation still isn't great.","Reading this in my 2017 iPad Pro that still holds up with it's 120hz display.4 years of updates sounds absolutely 🗑️ for a tablet","Damn. Seeing this article and its comments, not 2 mins after buying an A9+ makes me sad 😢","Been considering an android tablet, but ... we bought an iPad 9 years ago and the sucker just keeps on working, even though my daughter has abused it all those years. From this comment section, it doesn't seem like Samsung is there on the Galaxy tablet, does it?","I have the 8/128GB version and it has been great for my use case. I don't think the 4/64GB version is worth it if you want to use it for the four years it's supported for.One thing they have stated wrong is the amount of OS updates. It's already confirmed that it will get three OS updates (14, 15 and 16), not two.","WhT about micro SD card slot","How about a user interface that doesn’t look like it was designed in 2013?","I bought the Tab S9 Ultra after my 2020 iPad Pro 12.9\" shit itself while doing an ios update. Not a big Apple fan so no-way was I getting another iPad. The Samsung is fantastic, much more my thing software wise and superbly made.The series 9 pads are gorgeous.","Droid tablet are just...","How about more than 4 years of updates so it doesent become ewaste?","S6 refresh (2017 edition) here, still works, but only slow charging. I think the charging circuitry has broken, but i just charge it slowly.Been looking for a new one, but as long as this one works, i'll keep it. Mainly watch youtube and other streaming services on it.","I use my Tab S7+ daily and it works fine but it's not eligible for Android 14...forced obsolescence in a way.","interesting thing to note from this article that I haven't seen commented here is this is the first A series tablet with Samsung Dex support.","Cries in S7+ 😭","Leaves me to wish I could use Procreate on that","How hard is it to remove facebook, the built in music app, etc?Not disable or some other BS, but full on remove from the device.","Never bought an A series. How about Huawei tab?","Does it have e-sim?","leaves little more to wish forExcept for a smaller 7-8\" version that's better for reading. It sucks that the iPad Mini is basically the only option for a premium 7-8\" tablet, and it's over 2.5 years old at this point with no replacement due any time soon, apparently. I'll never forgive Google for discontinuing the Nexus 7 line, those were basically perfect small tablets. The size was just right for reading and the fact that they were Google products meant you got bone-stock Android without all the crapware the other manufacturers add in. Plus the price was pretty good, as I recall.And yes, I know I can get a dedicated Kindle e-reader, but I want a device that can read books AND do other stuff, the e-ink kindle devices are just for reading that's it and you're also locked into Amazon and Kindle for book content. Then I'd need to carry yet ANOTHER device if I want tablet functionality","Not me wanting to buy a9 a few days ago 💀 it seems if I want a tablet of 8in I'll have to buy an iPad mini.","Wish they'd have made it waterproof like the s9. Sucks that the only option for people who want something they can use in the pool is $800"],"points":520},{"text":["I printed chocolate on a 3D printer and ate it","That thing definitely tastes like metal","Sweet!","Now this is a technology application I can use!","Would be a waste to use chocolate and not eat it…","Palm oil is a no and layer lines are a no, but I appreciate how far it has come.","I guess it's a first effort but those layer lines on everything have got to go or this will never be taken seriously.Edit: Wait, so obvious layers are good? Hmm, a machine that expensive with those results I guess you have to tell yourself something to make it seem worthwhile.","Why not just use a mold"],"points":139}]