[{"text":["You don't need a static site generator"],"points":0},{"text":["Raw code vs editor"],"points":0},{"text":["Agile is a tainted term"],"points":0},{"text":["[Showoff Saturday]: Armyclash.io"],"points":0},{"text":["New to web dev require help","their all pay to playthe free ones restrict your access to certain components, like wordpress cuts you off from the server itself in place of the wordpress interfaceI found the only way to learn and get it all done was to just give up on all those paths, too restricted and costlyso I host from home, I forwarded the ports to my webserver which also holds my database and then gave it a domain nameI can create and host as many sites as I want, I can come up with all sorts of db experiments and file upload stuff without any charges etcits very liberating and it makes the webserver and db a little more personal in that you can directly interface and explore with no penalty, and it gives real world experience rather than the sort of neutered one you'd get from most of the GUI's they put up to prevent you from actually accessing the server","If you want to avoid paying anything, use github page, cloudflare Pages or netlify for static hosting (html, js, css).For your db, it will heavily depend on your specific needs. If you want to only use static hosting, you could use sqlite wasm : https://sqlite.org/wasm/doc/trunk/index.md","Render and Vercel have good free tier options for hosting static sites and web services (a server)."],"points":0},{"text":["Using Generics In TypeScript: A Practical Guide"],"points":0},{"text":["The history of HTTP and the stories behind status codes"],"points":0},{"text":["I added AI function calling feature to my PHP framework"],"points":0},{"text":["The AHA Stack"],"points":0},{"text":["How and where to store backups?","I'd assume you mean database backups from that context, so just frequent, E2E encrypted backups to a EU company (think hetzner storage boxes and the similar, maybe a local backup, your home etc) should be fine, following the 3-2-1 rule if possible.I like duplicacy for incremental, encrypted backups, CLI is free and probably fine for your usage."],"points":1},{"text":["Showoff Saturday: AI assisted date pseudonymization? SaaS"],"points":0},{"text":["Code for my old project - a bookmaking website, for those who are looking for inspiration","Hello, today I decided to share the source code for my old project that allows you to bet on matches online.Maybe someone will like it and it will be a source of ideas for their project.Github: https://github.com/Ryczko/KKbets-betting"],"points":3},{"text":["CTA before fiiter"],"points":0},{"text":["Where does Google get these titles from?","They are called site name https://developers.google.com/search/docs/appearance/site-names[https://developers.google.com/search/docs/appearance/site-names](https://developers.google.com/search/docs/appearance/site-names), you can add schema to help define them"],"points":3},{"text":["Pree: A simple tool to easily build no-build websites.","Some context: I wanted to write some docs but didn't want to use a framework or an overly complicated toolchain. Web components + ESM + modern CSS seems to almost resolve any need for a framework or a toolchain for such a project, though a few issues remained, mainly the fact that web components render on client side (imagine a web component that renders markdown, this means clients should download a markdown parser and wait for the markdown of the page to be parsed before they can see the content).So I made a little tool, pree, whose main job is to pre-render web components (using declarative shadow DOM), so for making such static websites you could only use the web standards without sacrificing performance, UX or DX."],"points":0},{"text":["All of my website traffic source is coming from http://statics.teams.cdn.office.net/","how many page visits are coming from there?","I imagine it's probably something like teams' crawlers for embeds in teams. Similar to discord but it'd still be odd if it's all from there"],"points":0},{"text":["Prioritize requirements with bubble sort"],"points":0},{"text":["Let the Documentations be generated themselves! (Seeking early thoughts)","keen to see how this plays out! I think documentation is a very team centric thing  so I'm not sure if there's a \"correct\" way to build this.","My early thoughts: What is this? What does it do? What type of documentation is it talking about? What languages / stacks does it handle?There's no examples on this site. CI automatically generating documentation, particularly in the case of both internal and external API / application structure, based on code and comments, is nothing new.What's the USP over existing tools / services?\"How it works\" doesn't really describe in any useful way how this works.\"Try it out\" appears to just go to \"join the waitlist\", which again, does nothing to tell me how this works or what it actually does?Additional useful information would include what technology it's based on, particularly is it based on LLM?Is this a service? Is it something I can run locally without sending information to / relying on external services?"],"points":1},{"text":["Domain name taken shortly after pushing to GitHub...","Sounds like your domain has been snipped. I would have registered the domain in advance before putting anything online and to the public.","Did you search for the domain previously? A lot of these shitty domain name sellers end up parking domains not immediately bought.","Registrar no, but certainly bots do and add it to their ad campaign","Absolutely everything that is public in internet is scraped. Don't make stuff public or at least don't leave any names or urls in repo.Even just code can be enough if your username can be linked to some relatively popular existing app.","Why you write this math stuff there? What dates? I thought that ISO resorted to minus sign because the English had taken everything else?"],"points":165},{"text":["Weird traffic only visible in Google Analytics","It's a common tactic known as referral spam:https://raventools.com/marketing-glossary/referral-spam/These are not real visits, just a tool that makes fake requests to your Google Analytics with a referral value set to their own site.Just ignore. It's been going on since GA was launched.","Has anyone reported it to Google, in the hope they would clean this mess up? Considering that since GA4 it's not really possible any more to filter traffic. Afaics at least. In UA i had filters set up for all properties to throw away events without screen resolution and few other parameters. Worked 100% to avoid spam. Now it seems impossible to get rid of this noise.","Good morning. I too noticed a lot of traffic from this site to three of my published websites. That's how I found your question. The only thing that I know to do at this point is watch for a backlink in Google Search Console since my antivirus won't allow me to visit the site. It's not an answer, and I'd like to see what others write about this site.","This is happening to me too! They seem to be on just one of the pages on my website. I want to block them but don´t know how to do that","Any way to block it in GA or on my sites? Is very annoying.","I've been getting referral spam from the same exact domain in the same exact way since yesterday. Very annoying. I've not found a way to remove that \"traffic\" from the GA4.","I have too!!!"],"points":3},{"text":["I made a site for jobs in Artificial Intelligence"],"points":0},{"text":["solo devs, how do you edit images?","GIMP","Id use gimp - If you build websites, you should deffo spend some time to learn how to use any image processor. For your task, however, it doesn't seem necessary? Just put your image in a div and style the div to whatever portrait shape you need?","Paidaffinity software suit (adobe is better but I hate their pricing strategy)Freevector editing: Inkscape can convert your raster image in svg, fix perspective, etc. with results depending on the complexity of your logo. It has very powerful snapping features, vector effects, plugins, and the output is in actual svg format. Graphite (web app) is not as powerful as inkscape yet, but it should already be sufficient for your task (resizing a logo + separating layers), and you don't need to download anything. You could also use figma for simple vector manipulation, it's not a drawing software but it does the job.raster editing: photopea (free photoshop, web based. Not as complete as photoshop or gimp but sufficient for most tasks). For digital painting, use krita . If you need to fix the logo with some brush, krita brush engines are very very good.For your particular task, if you don't have the logo in svg, I would use photopea. Otherwise, use inkscape.If you need to remove a background, you can use one of the aforementioned tools, or go on a dedicated website like https://www.adobe.com/express/feature/image/remove-backgroundRemember to optimise your assets, if it's svg use svgomg (integrated into inkscape or as a standalone) or a website like https://vecta.io/nano, otherwise use https://squoosh.app/If your logo is in vector format, you can crop it with https://svgcrop.com/ to remove the blank spaces.If you want to see more alternatives :https://alternativeto.net/software/adobe-photoshop/?license=freehttps://alternativeto.net/software/adobe-illustrator/?license=free","Photoshop","For simple image editing tasks like adding a white rectangle to convert a landscape logo to portrait or separating foreground and background, you can use simpler software like Paint.NET, Adobe Photoshop Express, or even online tools like Canva or Pixlr. These tools are easier to use and don't require as much expertise as GIMP.https://jagmohankrishan.com/","Photoshop if you have it, photopea.com if you don't.  Both are powerful pieces of software so you might have to look stuff up like you mentioned.  Gaining some some minor image editing skills can be pretty useful in web dev... you don't wanna be blocked when you just need some small tweaks. If it's a major project I usually leave it to a designer who will do a better job than I can.Taking out the background from an image can be deceptively difficult to do well, depending on the image.  There are a couple ai powered websites that might or might not do a good job at BG removal automatically, again depending on the image.","I used to use illustrator, but these days I find Figma to be very useful. Plus it’s free!","Inkscape for anything you can do with vectors. Otherwise gimp or similar.","My top picks:For raster/pixel images: Krita.For vector images: Inkscape.Gimp is great but I find it difficult to use. The UX on Krita is leagues ahead. Krita is more targeted towards digital art than being a photoshop clone, but you can do most of the basic stuff you’d use Gimp or Photoshop for anyway."],"points":7},{"text":["My thoughts on CSS-in-JS, Tailwind, and CSS Modules Scripts","A major drawback of adopting CSS in JS is the performance cost, which is sometimes more than noticeable.","This post does not make any sense","Vue style tags within the component are great, regular css/sass scoped to the component.IDK why other frameworks don't do it similarly","keep your stuff as separated as possible. its easier to maintain. keep your css in css (or better yet, scss) files. Use minimal classes in your html.Each layer has its own purpose. Cross-polllution adds noise and code churn.","What I believe is happening in the Frontend realm in general is that, everyone wants to use something that is most performent, has the best DX, has the highest amount of abstraction in it. People fight over which is the best solution in each aspect of frontend development.However what I believe is that due to the advancements in Javascript, dynamic nature of it, its ability to have easy abstraction and a large community. We have come to a place where we have several good solutions, let it be in Frameworks, Libraries, State Management, Tooling etc.It is only a matter of choosing the solution which suits your needs and familiarity.","All of those are bad for Stylish plugin.I'd actually prever to have generated classes over tailwind, but best is have non-generated class names that make sense. If they don't change too often.I sometimes have to use :has() selector and aria-labels for Stylish but not even all sites have them, and not all tags have good aria-labels anyway.Maybe it's good DX, but terrible UX for Stylish users.I wish CSS had :contains() that could select by text, it's only possible with JavaScript, that could solve many problems on sites that don't use sensible class names.(also it wouldn't be problem if ppl used both tailwind and sensible classes for Stylish users, if it was first class in html so it's easier to see)"],"points":20},{"text":["Newbie needs help- My domain email stopped receiving incoming emails"],"points":0},{"text":["Reminds me of the \"all flash\" websites from back in the day."],"points":0},{"text":["Random text & image selected via a folder [JavaScript]"],"points":0},{"text":["I made a web app for 1v1 coding","Just fyi, hamburger menu isn't working on mobile (Chrome, Android).","I'm not sure that giving money for invite is good business tactic.Anyway the idea of app is very good. I think it may become quite popular"],"points":2},{"text":["What PWA Can Do Today","TL;DR:An interactive showcase demonstrating the capabilities of Progressive Web Apps (PWAs). It functions as a PWA itself, offering installation to a mobile device's homescreen or desktop.If you don't like the summary, just downvote and I'll try to delete the comment eventually 👍","Thanks for this. I doubted PWAs till today, thought they were dead and just pushed by a niche because well… they can?But when looking at the capabilities of a real PWA and what the browser API allows the app to do, it’s crazy!","very neat site. thanks","Not in the EU unfortunately.","Almost every page says \"This feature is not (yet) supported on your device\". Could this be due to Android and/or Firefox? I'm running Android 13 under LineageOS 🤔","The other features are great but I'm pretty happy with just PWA standalone mode and Add to Homescreen","Currently, PWAs cannot be installed in Firefox. Please choose another browser like Safari, Chrome or Edge.I ain't going back to Chrome, nor Edge.I'll just have to wait."],"points":24},{"text":["Can you download songs from spotify onto your computer?","Arr matey, I be at a loss for words. Ye need to ponder if thar be other treasures ye seek. I be racking me brain fer any solutions that might suit ye needs. Arrr! 🏴‍☠️🏴‍☠️🏴‍☠️","There's an open source YouTube music app you can download from github and install which let's you listen to all music with no ads, and you can download them too. Highly recommend.","I use Brain.fm, it had been great, been using it for almost a year now, but I notice I hear a lot of repeats lately.","https://github.com/Shabinder/SpotiFlyer check this out.","Noteburner gets you .wav, low license cost for what it is","I've seen browser plugin and a python program like this for youtube, so it should be possible with any streaming service, video or audio.If you can find open-source you can look into code and use that for your program (browser plugins are open source)"],"points":14},{"text":["is there any way to detect reddit's mode in JS?","I mean, if you inspect the reddit page, the first line is:<html lang=\"en-US\" class=\"theme-beta theme-dark\">So, I'd say, yea, you can use the classes found on the html element to determine the current theme."],"points":2},{"text":["How to improve a design ?","Why not hire a graphic designer? That's exactly the kind of work they do.","On YouTube there is a video on 60-30-10 color rule which may help you. Here is the video","Well. You’re not a designer. So you shouldn’t feel bad that you have a bad design. There’s no “aha!” Moment you will have to turn it around. Theres no magic piece of advice that will make it look prefect. Just because we’re developers doesn’t mean we should also expect ourselves to be the designers. Work with a designer. It will change your life.","If have problems with color (I sure do too) i would suggest to use one of those color palette generators/sites to get a palette with colors that fit together, makes life easier.Just google it, there are several ones available.Would also recommend to use CSS variables for the colors as it makes it easy to test different alternatives by just do the change at one place.","I just see a login page. And as a designer, I say it's pretty good.","Hey you can check out mobbin.com for UI references. Great resource targeted at designers, but I think it'll benefit you as well!","Use a framework like tailwind?"],"points":7},{"text":["What should i use for an appointment system?","This can be a pretty large effort to write yourself if you’re not very experienced.As an alternative, I think you can do this relatively easily with a Wix site and the booking plugin. I would recommend looking into this approach until you have more experience."],"points":2},{"text":["[OC] I create a beautiful clone of random.org","how do you create that dashboard? Is that use react?"],"points":0},{"text":["What hosting/domain site should I use for my portfolio website?","Hi. Depends on your technology stack. If you have a static site, use Cloudflare - it's free and gives basic analytics (visitors, pageviews, countries, etc) - Github Pages doesn't have it.If you have a NodeJS backend (NextJs or some kind of apis) see on Vercel - they have a free plan too.","Cloudflare pages","https://hostinger.com","I'd use (I do use) Github, then it's linked directly to your Github account which lots of places will also want to see.Unless you need more functionality, but for a portfolio, tracking data, and such doesn't really seem all that important.","Buy a custom domain in your name, host on GitHub pages, put cloudflare CDN in front of it.","As far I know the portfolio doesn't contain much backend, so you can go for Vercel or Netlify without any doubt.Correct me if I am wrong.","I like namecheap.com for domain purchasing. Vercel for hosting.","Unstoppabledomains.com","Assuming it’s a static site, Netlify; the free tier can connect to GitHub for automatic deploys on push to main and preview deploys for every PR. They also have form functionality, so you can add a contact form and they’ll handle forwarding you the responses after some mild spam filtering."],"points":11},{"text":["Most popular interview questions of all time - good luck everyone","This is dope. Thanks for the resource and yes good luck everyone","when it comes to web development, do web developers get asked LeetCode?","Thanks so much 👍","\"Best Time To Buy And Sell Stock\" 🤣I'm half-surprised it's not #1.","Thanks for the help and it is gonna be very useful for me!"],"points":13},{"text":["Wordpress w/ Elementor or Shopify for Affiliate Marketing Blog?","For your affiliate marketing blog advising PC gaming novices on the best PCs to buy, WordPress with Elementor is likely a better choice. WordPress offers more flexibility and customization options, making it easier to create content-rich blogs and integrate affiliate links seamlessly. Additionally, WordPress allows you to easily transition to an e-commerce site in the future if you decide to sell PCs directly, while still maintaining your existing content and SEO efforts. Shopify is more geared towards e-commerce out of the box, but it may be less flexible for content creation and customization compared to WordPress.https://jagmohankrishan.com/wordpress-development-services-in-india-jagmohan-krishan/","Technically you can do both.Website . Com shop. website . ComCan both be different sites / apps.","Elementor is trash."],"points":1},{"text":["It’s Official, Apple Kills Web Apps in the EU - Open Web Advocacy","This: https://www.reddit.com/r/Futurology/comments/1amp65h/enshittification_is_coming_for_absolutely/","We could easily fight back by making websites \"not supported on safari please upgrade your browser\" notices like we used to do for old internet explorer.Or even funnier would be to detect safari and then do random glitching. So it looked like defective iphones.","Vote with your wallet","Help us fight back, follow the link! It's now or never","I am currently developing a pwa game that heavily relies on the Fullscreen of the device. This will affect my whole distribution for iOS Mobile. No alternative by the moment.","The irony here is that Apple was originally one of the first (or the first?) to support web apps and modern web standards on mobiles (while everyone else were at best fucking around with Flash and Java applets).The initial idea and I believe Jobs’ vision was that all third party apps would be web based, but then they released the App Store and here we are.","Apple are again showing themselves as a beacon of innovation by holding back progress and leveraging their customers as hostages trying to extort the rest of the world.This company just needs to die.Guess this is gonna be served to a lot of users going foward:We are sorry, the fruit cult Apple has blocked the device you purchased from them from accessing the features required for this application to work, please contact Apple support for more information, or upgrade to a better operating system.This is an Apple problem, only Apple can solve it. Please refrain from contacting <Application> support about this issue.","A very disappointing development. It almost seemed like Apple was getting ready to embrace PWAs for consumers on the Mac platform when they added the ability to easily add any website as an “app” with its own window and dock shortcut in the last macOS update, then they do shit like this to totally counteract that..","What happens to the iOS apps that uses web view from WebKit from apple in their iOS apps?","Do they support chrome web browser? Then PWA must be supported right?So , people will just be forced to stop using Safari.Correct me, if I am wrong...","Commission move next. They should fucking skin them alive. Anything less than billions in fines is a betrayal.","Selectively quoting to remove Apple's justification, whether you agree with it or not, it's pretty poor form. The way OWA have worded this, you could be forgiven for thinking Apple were claiming the DMA directly requires this. That's not what they're sayingAddressing the complex security and privacy concerns associated with web apps using alternative browser engines would require building an entirely new integration architecture that does not currently exist in iOS and was not practical to undertake given the other demands of the DMA and the very low user adoption of Home Screen web apps. And so, to comply with the DMA’s requirements, we had to remove the Home Screen web apps feature in the EU.","“kills web apps” that is an exaggeration, they’re removing the ability to add website shortcuts to your homescreen, they’re definitely not “killing” web appsIm not sure why people are making huge fuss about this, the majority of people didn’t even use this add to home screen feature in safari, and even if they did they can still do so using the apple “Shortcuts” app instead of through safari.","Overrated issue. The only way to fight this is by building better web apps and not relying on any web stores.","whats up with the recent news about apple killing web apps in the eu, can u explain to me like im 5:Sure, I'll try to explain it to you like you're 5. Web apps are like websites that you can add to your home screen and use like regular apps. They can do things like send you notifications and work offline. Some people like web apps because they are faster, cheaper, and easier to make than regular apps.Apple is a big company that makes iPhones and iPads. They have their own rules for how apps should work on their devices. They also have their own store where you can buy or download apps. Apple likes to keep their store and their devices safe and secure, so they check every app before they let it in their store. They also charge money to the app makers for using their store and their devices.The EU is a group of countries in Europe that work together and make some rules for everyone. They want to make sure that people have more choices and fair prices when they use technology. They don't like it when big companies like Apple have too much power and control over what people can do with their devices. They made a new rule called the DMA that says Apple has to let other people make web apps and use different browsers on their devices.Apple says that they can't follow the new rule because it would make their devices less safe and secure. They say that web apps need to use a special thing called WebKit that makes them work well with Safari, their own browser. They say that if they let other browsers use their own things instead of WebKit, then some bad web apps could get into your device and do bad things to it. They also say that making web apps work with other browsers would be very hard and take a lot of time.So, Apple decided to stop letting people add web apps to their home screen in the EU. They say that this is the only way they can follow the new rule and keep their devices safe and secure. They say that web apps are not very popular anyway, and that people can still use them in Safari or other browsers. But some people are not happy with Apple's decision. They say that Apple is just trying to keep their power and money, and that they are making web apps worse for everyone. They also say that web apps are very useful and important, and that Apple should find a better way to follow the new rule and support them.","Sensationalised title… destroys any credibility for the cause.Agree with the other comments, this a non issue. Concentrate effort on something worthwhile imo.","I never saw any real need for web apps to be honest. So even though I disagree with apple in most of its policies, this is one policy which I don't think has much gravity.I wonder the matrices of users using Web apps to consider it as serious issue.","Was anyone actually targeting iOS with PWAs? I looked into it a few years ago and it was already a disaster (which is exactly what Apple wants it to be).","I think trying to force Apple's hand legally is missing the point. Apple won't care until Apple users care, and can Apple users be made to care? (If they cared, they wouldn't be using Apple LOL)I did see an interesting argument below that Apple users won't care until there are great PWAs, and that won't happen until Apple is forced to support them.","People don't care. They want to use Apple and they will continue to do so."],"points":456},{"text":["Two Typosquatting Python Packages Exploit Discord CDN to Deploy Malicious"],"points":0},{"text":["Unreal Engine 5 is coming to web browser","Really cool!","Unreal had official support for HTML 5 for a few years in the mid 2010s. Looks like it was deprecated with 4.24 though. I'm pretty sure you can still download 4.23 if you want to try it out though.Official docs: https://docs.unrealengine.com/4.26/en-US/SharingAndReleasing/HTML5/GettingStarted/There were some demos floating around for a while, but they didn't run all that well. Think puzzle games or those gallery experiences you see sometimes."],"points":1},{"text":["What would you charge?","Since it's a former employer, $250/hr with a 10 hour minimum. You already have a job, make sure your extra hours are worth it.","Id have said $225/hour, no fixed hours. You don't know everything they broke.","No way I'll come back just for 2x hourly. Never undersell yourself.Ask for $500/hr (I'm not kidding), with a minimum of 4 hours/day of work. They'll most likely balk, but remind them of how much time and money they've spent on other developers already, not to mention the potential profits lost due to downtime. Even better if you have those numbers to back it up.","That agency is billing you out at at least double the rate they are paying you. I would start at 400 to 500 an hour. No one could do it faster so they are still probably getting a deal.Btw, If they don't talk at your first ask, you didn't ask enough.","What do you value your time at? Double it. You have to work on it after your primary job so that cuts severely into your down time and that is very valuable.So if you did 75-100 before, I would quote 200 per hour.","What price would it be worth for you to do? Dream big.Double that and send it."],"points":24},{"text":["GPT-4 autonomously finds vulnerabilities in websites","How is this any different to what people have been doing for ages? Before I shut down my web server I used to see heaps of automated traffic trying known exploits. This is no different than a handful of scripts, except GPT uses infinitely more processing power. Saying GPT \"didn't know\" the exploits beforehand is a bit of a cop-out, because it's not like it invents new exploits by itself"],"points":44},{"text":["Time in between Jobs","Focus on self-improvement, read books, establish a gym routine, seek therapy, work on side projects, make friends, revive old hobbies, tap into your creative side and make some art.","Couldn't land a new job since mid-last 2023, took a decent paying client from the old company, filed with the state to register a company, working with a couple other people trying to claw our way to something in this life.Take care of pets, find a new city to move to, tell myself I'm going to go climbing, reevaluate what is important in life. Making small things in Google Sheets/ Google Apps Script. Blowing time on Reddit."],"points":10},{"text":["The ultimate animator in Angular","You do realize that visitors probably don't care about your AbstractAnimation or your SlideAnimation or your FadeAnimation or your scroll animation or your language change animation, right? If so, that's how you're the victim of over engineering."],"points":1},{"text":["Should I get GitHub Copilot Individual or Business license as a freelancer?","It's only $10 🤔","If you are using it for business (freelancing is business) then you need the business license."],"points":1},{"text":["what is the cheapest way to host your code?","Unless your time is free, a basic VM. A 1GB VM on DigitalOcean.com is $6/mo. You can also do things like Amazon EC2 or Lightsail, Azure, google etc. for a similar price.If you want more powerful servers, you can get a dedicated one $20-$50/mo. https://lowendbox.com/ is a site dedicated to these, and you can follow the providers they mention to find something that works for you.","On your own laptop always connected in your basement.","Depends on how much traffic you're expecting.","VPS + docker compose if you know what you are doing. (50$ a year. https://www.racknerd.com/BlackFriday/)but judging by the the question you are asking - you are new to this.hardware cheap always means you have to do more yourself, DR, backups, notifications, scaling, security etc.","Cloud run @ gcp","Railway.app - it’s a Heroku like PaaS which is free if you use less than $5 a month, no OS updates to worry about, no opening your network up to outside traffic.I’ve got a toy Django / Postgres app that gets about 2K requests a day and don’t pay a penny for it.","AWS is extremely cheap, at your scale it will be nearly free since you'll be at the free tier for almost everything you are doing. The trade off is, to get that absolute cheapest price, you need to build your app to take advantage of the specific services that AWS offers. So if you have an app that you've already built and aren't willing to rewrite any of it, then it's likely going to be much more expensive. Even still, you can get the smallest AWS Lightsail instance (basically a computer you can install/run anything on in the cloud) for $3.50/month.For comparison, my website receives magnitudes more traffic than what you are talking and costs about $1/month and most of that is the $0.50/month for AWS' DNS which isn't necessary but is a nice convenience.(You can swap AWS here with any other cloud provider and basically the same thing applies.)","Hetzner","Plenty of Vps hosting offers $3 per month pricing. Contabo for example.","Surprised no one has mentioned Oracle always free tier. You can get a decent spec Ubuntu machine on the cloud cloud for free. They're basically burning money to try and get customers. For your requirements should be more than enough. I use it to host game servers for my friends.","Vercel n supabase","Supabase for sure","I've used Google's Firebase platform, it's completely free (up to a certain point) and offers hosting, db (it's document based though, not relational), authentication and other services. Pretty good for small projects like yours.","Google cheap vps. You can get a cheap vps for a couple of bucks a month, as long as you’re ok installing what you need and managing it yourself.","each restaurant would use their business class internet connection which comes with a static ip to host the siteto host they must pass ports 80 and 443 to the hosting machine, or setup a port proxy","First question is... do you need a database, or would data files be sufficient (JSON, YAML... Whatever).If you do need a database, would Firebase or similar work?Because you can make use of a rather generous free tier using Netlify and Firebase, for example. And use Netlify Functions for any API needs... If it actually meets your needs.","Digital Ocean + CyberPanel","Hostinger.com","Free","Google Cloud Run or AWS App Runner plus CockroachDB Serverless (if you can make it work with your app, it's very similar to postgres but not 100%). The app server would be around $5/month and CRDB should be free for your usage level.Alternately as others have suggested you can get a cheap VPS for probably like $5-$10 a month and install everything there, but it will be more work.","It's kind of a trade-off that comes down to time/effort vs cost. Running on AWS, GPC or a VPS somewhere will be cheap, but will take a little more time to setup and effort to run.Platform hosting type services like Heroku, Fly.io, Render, etc. will be easier to setup and run but at a higher long-term cost.For something this small, and the wording of your question I would suggest a cloud hosting platform - at least to get started, you might find the theoretically higher cost to not be much more on such a small scale (you mention \"Hardly 30 customers an hr for 3-4 hrs a day\").","Vultr for 5USD/mo or an old laptop with a static IP and domain.","I'm really into hosting my frontends on Cloudflare pages, then doing any sort of APIs / servers / DBs on render.com. It's very cost effective.","Since you don't have a huge need for database, maybe sqlite3 would be fine? Much easier to handle, as it's file based, will be cheaper on the hosting","Staple a bunch of raspberry pis together","Iirc aws free tier let's you get a free $5 monthly ec2 instance.","Cloudflare page + worker, deno dashboard","probably Cloudflare Pages and workers","Supabase offers PostgreSQL db up to 500MB on free tier. I've been running a project that does about 1k inserts a day. Each record is a newspaper headline, a couple of urls and timestamps, and some minor meta data. After a couple of years, circa 750k records, still only at 420MB.","You can use supabase as standalone database. It gives you 500 MB database storage which is enough for the project like yours.","A raspberry pi connected to the internet 24x7 is your cloud.","if you add tenancy you'll be able to run 1 db and host","Google Cloud Run, Docker containers. Cheapest tier you’re only paying when processing data","contabo.com they have cheap vps like 4.5 $ a month4cores and 6GB Ram","Deploy the frontend on vercel free plan and server + db on render free plan. Then switch to other platforms if traffic increased.","Hosting a cloud on Hetzner with minimum specs is like 3 euro's a month. This is already enough for a website with below average traffic. Don't think complicated when these things work fine","I use supabase free version and nuxt 3 frontend on Netlify or Vercel, so it's totally free at the beginning, put some ads, earn money then buy server slowly move to self hosted.","I'd say just use Vercel for hosting the website and Supabase for auth and db. This is assuming you can keep within the free tier!"],"points":460},{"text":["A new minimalistic docker-based local development environment: draky"],"points":0},{"text":["Do you use Status codes in your backend ??","JFC don't do this.There is an RFC that documents what the status codes mean.The \"x00\" response is a good stand-in if you aren't absolutely certain you need a different one.200 = everything went fine300 = things are OK but there's a slight mistake400 = things aren't OK and it's your fault500 = things aren't OK and it's our faultEach of those classifications has many subtypes under it, but you should be sure that you are using them correctly before choosing to use them.Here is the official RFC regarding HTTP status codes: https://datatracker.ietf.org/doc/html/rfc7231#section-6If the Internet had a legal codex, it would be the IETF docs / RFCs. Don't fuck with these, I'm serious. The reason the Internet works at all is because we uphold these standards and it is unacceptable to misuse them. Seriously, do not do this again.The MDN articles about HTTP statuses are a bit easier to read, but source from the RFCs via the HTTPWG docs.​I made them my self 420,421,423...450 + generic ones 401,403 200, 201​Status 420 does not exist at all.Status 421 means Misdirected RequestStatus 423 means LockedStatus 450 does not exist at all​if(verifyEmptyFields(body.nom, body.prenom, body.email, body.mot_de_passe)){  return NextResponse.json({     message: \"All fields have to be filled\"   }, { status: 420 });This is wrong because the status code does not exist. A server sending a request that gets this as a response may not know what to do with this undocumented status response.This is either a 400 Bad Request if submitted normally or a 422 Unprocessable Entity if over an API (a 400 is also acceptable in that case).if(! verifyPasswordLength(body.mot_de_passe) ){  return NextResponse.json({     message: \"The password have to be more than 8 characters\"   }, { status: 421 });}This is wrong because { see above }This is also either a { see above, 400 or 422 }if( ! verifyPasswordCombinationForCandidate(body.mot_de_passe)){  return NextResponse.json(  { message: \"The password have to be  a combination of letters , characters and numbers\" },   { status: 422 }); }... ok technically this is correct, but it appears to be accidental.if(  await isCandidateEmailValid(body.email)=== false ){  return NextResponse.json(  { message: \"Email address not valid\" },   { status: 410 }); }This is wrong because 410 Gone is a real status code but it means something entirely different.When the client receives this back from the server, the message means \"the resource that you requested DID exist here previously, but is no longer found here.\" (\"We're sorry, but our princess is in another castle\"). Practically speaking -- the client probably isn't expecting to receive a 410 Gone from this endpoint, so it may not even know how to handle this response code.This should be either a { see above, 400 or 422 }if(  await verifyUniqueEmail(body.email) ){  return NextResponse.json(   { message: \"Email address already taken\" },   { status: 409 }); }This is wrong but in a nuanced way. 409 Conflict doesn't mean that the record isn't unique or invalid because of a duplicate entry. It refers to race conditions created by version mismatches when updating.This should also be either a { see above, 400 or 422 }const newCandidat= await createUserCandidat(body , body.mot_de_passe);  await sendEmail(  { receiverAddress: body.email, type: 'verifyAccount' });   return NextResponse.json(  { message: \"New Candidate added to DB successfully\" , newCandidat },   { status: 201 });This is correct. A 200 OK is also acceptable.} catch (error) {  console.log(error.message) return NextResponse.json(  { error: \"Internal Server Error\" },   { status: 500 }); }This isn't wrong, exactly, but it could be better. a 500 Internal Server Error is an acceptable response here. I say it could be better because do we know that it's an Internal Server Error? Was the issue that some of the data was malformed and a 422 Unprocessable Entity would have been a better fit? Were they not authorized to create it? A 401 Unauthorized would be better. Is the server overloaded? A 503 Service Unavailable would be better.Generally speaking, we don't voluntarily emit 500 Internal Server Error, we let the underlying web server emit that for us, and we just convey it. If a client sees a 500, it is typically because they did something that did NOT have code written to handle it.","Very bad idea, as those status codes are all reserved. Just use standard status codes and set an error field in the json body","It is a 400 for anything invalid like missing password, incorrect format. Or required fields. Anything the client sends that is in the wrong format or missing.I've replied on this before. The reason why you want 400 is for monitoring/observability. And also client-side linting from an API gateway.Client error. Anything that the client sends that is incomplete or in the wrong format. When the client sends incomplete, missing, malformed data.Even data that does not meet enumeration, you reply with a 400 status code.**Here are tons of examples:**Here is Google Example:https://developers.google.com/gmail/api/guides/handle-errors#:~:text=specific%20API%20errors.-,Resolve%20a%20400%20error%3A%20Bad%20request,Invalid%20attachment.Resolve a 400 error:Bad requestThis error might result from these errors your code:A required field or parameter hasn't been provided.The value supplied or a combination of provided fields is invalid.Invalid attachment.Swagger/Open API Pet Store Example:https://petstore.swagger.io/?docExpansion=fulland search for:400 Invalid ID suppliedLook at any modern public swagger spec. Any erroneous input returns a 400.When the client sends the wrong payload or malformed or incomplete., it is a 400Mozilla: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/400(for example, malformed request syntax, invalid request message framing, or deceptive request routing).RFC spec: https://httpwg.org/specs/rfc9110.html#status.400There I have you guys 4 examples: Google, Swagger, Mozilla, RFC.Now microsoft for API best practices:https://learn.microsoft.com/en-us/azure/architecture/best-practices/api-designIf the client puts invalid data into the request*, the server should return HTTP status code 400 (Bad Request). The response body can contain additional information about the error or a link to a URI that provides more details.Another example reference:https://www.uniprot.org/help/rest-api-headers#:~:text=The%20400%20Bad%20request%20status,information%20sent%20by%20the%20client.And https://stackoverflow.blog/2020/03/02/best-practices-for-rest-api-design/I'll add some more to drive it home.Stripe:https://docs.stripe.com/error-low-level*If you provided an invalid API key, or a 400 if a required parameter was missing. Integrations should correct the original request, and try again.*and further down:The request was unacceptable, often due to missing a required parameter.Microsoft embraces OpenAPI style guidelines. Read through their docs.https://github.com/microsoft/api-guidelines/blob/vNext/azure/Guidelines.mdI hope I provided enough info from industry leaders why it is a 400. I can even go into more detail for DevOps/SRE reasons.","Don't make up your own HTTP status codes.As for how to use the existing ones there are a couple of different schools of thought.You could try to embrace the HTTP status codes at your application level and use the one which best describes what's happening.Or you could leave those status codes at the HTTP level, and give your own signposting at your application level, which might be a status field of your response. When doing things this way you will treat any request which was handled as expected by your system, even if you handled an error situation, as an HTTP 200.One advantage to the latter is that the consumer of your API can more easily tell which responses they should try to parse and which they should not. If they get a 200, they know that it's going to be in the format that they expect from your application, and where to look for a possible structured error report. If they get some other HTTP status code they know that it's an exception.If the API tries to give different status codes depending on what happened, consuming the API becomes a little more difficult. It could be for example that a 4xx was generated either by the application or by some other layer, like a proxy, and confidence in how to handle the response disappears.You can tell I prefer the latter approach these days (I used to prefer the former), but I'm sure others feel otherwise and have good reasons.","I just use the standard codes appropriately.Not that many other devs where I work do that…. status(200) no matter what town.","Only ever use standard http status codes. Exactly as they are intended to be used. Otherwise you're just making all consumers of your API miserable.","Not all of those, but I used 451, if it was ever needed."],"points":88},{"text":["Zed Code Editor: Technical Architecture And Performance Benchmarking • Scientyfic World","It's certainly interesting. Currently no Linux support means no ability to even test it out, which means they're not getting nearly as many users as they could. It's cool that devs so genuinely believe in the future of the collaborative editing, but even though it seems interesting to me, I don't necessarily believe it will take off and become mainstream. As silly as it is, things like themes and extensions have more popularity than collaborative editing"],"points":1},{"text":["How do you host your private repo of your own Organization on GitHub?","Vercel or Netlify","You could potentially use firebase hosting and GitHub actions. Bonus it’s free.https://firebase.google.com/docs/hosting/github-integration","I have a CI running which builds and pushes the code to S3 or a server which is hosted already."],"points":1},{"text":["How to use Media Source Extensions with AirPlay"],"points":0},{"text":["Help with Google Docs API on React, please"],"points":0},{"text":["Non-dev here. Need some guidance about Google maps API","If you are using some website builder type platform, check if the google maps integration is optional.Idk if you need it since I don't know the platform you are talking about and for what use you are wanting to to use it for.There are many flavors of google maps APIs, like this Embed API will just spit out one of those google maps boxes with a pin on the location. There is a Geocoding API if you need coordinates, a Business Profile API for business data location.I have mainly used the Geocoding API and the Places API for auto completing addresses. It helps standardize and sanitize address information so you don't get typos or mistakes in addresses.Each API has it's own pricing structure. The Embed API has no cost. The Places Autocomplete API is .017 cents for the first 100k uses then gets cheaper.So if your case is just trying to show a google map box with a pin of your business location, use the Embed API. Otherwise you'll have to figure out what you are trying to achieve"],"points":1},{"text":["Why are tech companies so comfortable with misclassifying contractors? Can I take those jobs and just report it to the IRS to become a W2?","I don't think that 1099 classification is as cut-and-dry as you think. Sure, generally speaking contractors have their own supplies and are paid for work, not for hours, but they can specify a number of hours per week if it is relevant (I was a 1099 with a specified number of hours per week), can provide tools (but cannot require that you use them). For example, when I worked as a 1099 I was required to work a specified number of hours (although had no particular schedule) as they were charging a third-party for my hours and I was provided a \"secure\" laptop, but was only required to use it to connect to a particular database, although most of my work was done on my own desktop.Generally speaking, companies can require that you do an amount of work (by hours or other metrics), but cannot require how you do that work.","I have been in a lengthy lawsuit with my multi-billion dollar ex-employer regarding this. In my case, I was “laid off” and not given any severance or support at all. And I have been struggling to find any new work in this current economy.“Contractor” on paper, but our relationship was employer-employee based on numerous factors, and verified by a government authority. Severance is something employees are legally entitled to where I live. Most companies simply don’t care, because people don’t even know they’re being mistreated, and David vs. Goliath lawsuits aren’t common.","Its complete bullshit and you should lobby your congressman for meaningful change to the laws. Contractors get treated as second or third class employees and there are no laws in place to protect you.For example, if you're a standard employee and your employer commits wage theft (either by not paying you the hours you worked or deducting/witholding pay because or 'reasons') then you can goto the state and report them and they'll lay the smackdown on them. If you're a contractor? No such protections, you're shit outtla luck unless you want to hire your own attorney to fight it. Because of this lots of contractors get shafted out of their final paycheck because they know that its worth it for you to hire a lawyer for $100/hr to fight it when you're only out $200. Sadly that's how most of our legal system is geared, you gotta pay to play, even when you're in the right","I’m not sure, but I would assume there is something you’re missing in this equation. Big companies that do this (mine included if I’m understanding the situation correctly), have entire departments of lawyers that ensure they are not blatantly breaking the law. I feel like this is labor law 101 so, I would believe that what they are doing is in fact, not illegal, for reasons that you and I don’t understand.","You should reach out to an attorney who specializes in labor/employment law, not people who can't even center a div.","A relative of mine sued his old employer for this very reason. The process took over a year and he paid his attorney most of the back taxes and settlement. I would say it is not worth it. Either take a contract job, or don't.","I’m no expert but I’m sure companies past a certain size have the means to take on that risk and they have already thought of covering their bases. So they could contract you for under 40hrs/wk, or they could pay overtime to comply with labor laws, etc. Then if you piss them off they could choose not to renew your contract, so you’re not technically fired for retaliatory reasons.So if you tried this with companies, you’re now out of a job with a weak case, facing lawyer fees on your own dime if you can even take them to court because companies likely have arbitration clauses.","Good luck. This is America. The Employer is king","A lot of people don’t know this, but you don’t actually have to take a job if you don’t like the terms. You can just walk away.","I think you’re missing the difference here:The 40 hours a week on a schedule and provided equipment are something both businesses agreed to in the contract, as are any other terms there. If they want you to go 50 after the contract is established, you don’t have to- that’s not what you agreed on.For a W-2, there’s no agreement there. Sometimes your employer offers a handbook of terms or some sort of employment contract so they absolve themselves of any weirdness by saying “Jim knew he would get fired for this, he signed it”. If your W-2 employer says, “hey you need to pull 50 this week and work on Saturday during core hours”, you either suck it up (maybe complain) or quitIndependent of any contract, your W-2 determines how you work; where you work; what you work; how you behave when you work. As a contractor, what you do is all picked out in your contract- as a W-2, if I wear a dumb T-Shirt on a call, they can get rid of me, but if there’s no clause on dumb T-Shirts in your 1099, they can’t terminate the relationship cleanly (unless your contract lets either party end at any time without repercussions)","If I am compensated for the difference, I do not care what the classification is, whether they set my hours or not, provide equipment or not.","If you do that and pull that off, I would regard you as a hero, for the record (kind of a minor hero, but still a hero). I worry web development as a career is about to be on the downslide soon. So pushing back on things like this will be necessary soon, if it isn’t already. It’s probably getting close to time to unionize too","Tech, in general, has been on a tear trying to roll back labor rights for a long time now. I don't know why anybody would expect any different at this point, they clearly want to get as much labor as humanly possible out of people while paying them as little as possible. From outright scams like WeWork to companies like Uber and Airbnb that promise to \"disrupt\" industries (i.e. move costs on to customers and contractors and degrade quality), and Elon Musk trying to get all his workers to sleep at their jobs. Why AREN'T you surprised that tech companies are OK with this?","I don't think there's much money in this. The end result is that you get classified correctly and you get some taxes back.It's not like a wrongful dismissal or discrimination suit."],"points":57},{"text":["Chess website?","You can stick with what you know, like Node.js for the backend and React.js for the frontend. MongoDB works well for storing data, but you could also consider other options like PostgreSQL. To handle real-time updates in games, you'll need WebSockets, which let the server send updates to the client without waiting for requests.Instead of making an HTTP request for every move in a game, which could slow things down, you can use WebSockets to instantly update the game state as moves happen.Good luck with your project!"],"points":3},{"text":["Let the Sunburst! — The complete guide on how to plot sunburst charts in Plotly"],"points":0},{"text":["Error reporting for client and server"],"points":0},{"text":["Bruno Api Client gave a Trojan?","maybe fake alertthere were short time a few months ago when windows defender was blocking specific Tor's version because windows defender thought it's malware. lol","False positive."],"points":0},{"text":["Does rebuilding an old app in a new language showcase enough knowledge to say you “know a language”?","“Knowing a language” is overrated. Most professional developers can get through tasks in any language (provided it’s not too esoteric), even if they’ve never used it before.As long as you’re competent and know where to get help when you’re stuck, you’re fine.You’re always going to be learning more about your tools, so at no point will you know everything there is to know.","You’re always going to be learning, you might be using completely different languages in a few years to come","\"Knowing\" isn't really quantified. Why bother with the definition. Someone asks if you know X language, respond by saying you've done a, b, c in it for z amount of time.I dont think it's worth trying to obfuscate for an interview. If it's important to the interview they'll dig into it. If it's not important,  it probably won't help you.Would a junior dev working a year in X language \"know\" it? Probably. Does that make him suited for the hiring role? Maybe.","the only language you need to know is assembly language","Depends on the language and the size of the project. Building a web server in Go, you probably get a decent amount of the language. Building a web server in C++? Unless you have over-engineered it to hell and back you need another dozen other projects to leave the learning stage.","You can say you know a language when you're comfortable working on a real project using that language, without needing to look too much stuff up."],"points":81},{"text":["Looking for Fellow Developers to Assist on new Ambitious Project","Hey there, I'd like to know a little bit more about this if you're interested in sending me a message. What are the conditions of the project? Is it paid or a mock-up?I have experience in full stack development with Django/HTML CSS & Javascript, Linux and Ubuntu environments, AWS EC2, S3, IAM and Route 53 and AI/Payment APIs, so I feel I could bring a lot to the table given the right conditions.Give me a message if interested and here is my website"],"points":1},{"text":["Common practice for service dependencies?","The most common practice would be for the app would poll the API, and disable related functionality when the endpoint is down.","It really depends on what you need to do and what kind of resiliency you want; you can move the API requests out to a separate pool of workers, and only interact with the workers instead of the remote API. It might be however be overkill for smaller projects, and you instead handle request errors.Writing code that is resilient to these errors (I'm guessing init failing is because of authentication) is a sign of a slightly more experienced developer that has considered what the API being down actually means for their application."],"points":0},{"text":["Do API requests reset each month with Sanity?","Yes, this is monthly.Based on your data you can add some caching to reduce calls"],"points":2},{"text":["Nginx core developer quits project in security dispute, starts “freenginx” fork","I need an ELI5 on this...the assigning of published CVEs (Common Vulnerabilities and Exposures) to bugsLike adding the CVE number to the trac ticket? Or defining those issues as bugs? Or just in general accepting that there are vulnerabilities in experimental parts of the software that need timely fixing?","Article worth a read. Siding with F5 who develops nginx and not the developer on this issue as it reads","Seems like a rare case where people had a difference of opinion and principle, and then split without any real animosity.We obviously don't see behind the scenes, but at least publically I have no problem with F5's explanation nor the fork.","Not sure its news, happens all the time with OSS.. he's free to do whatever he wants.","You can find more context here: https://news.ycombinator.com/item?id=39373327","I think it's pretty simple. He and his cofounders sold to F5 with the understanding he would still lead development, with a paycheck.Russia starts the war, now he's leading dev without getting paid by F5. The Russian devs spin up a company to serve Russian customers.How can two companies suitably serve their customers' needs when one is determining task prioritization and calling all the shots? He saw the writing on the wall.I think splitting customers between companies should have meant a fork from the beginning, or at the least a split in stake on the project. Declaring this will be the \"free\" nginx... yeah idk about that. Seems like a personal/business decision"],"points":280},{"text":["Best practice site for Html/Css/Javascript","You don't need to memorize anything except for the most basic syntax. Just build things and if you don't remember something google it, that is the best way to practice.","Codewars for javascript","Checkout Frontend Mentor.","https://cssgridgarden.com/","https://codepen.io/","frontendmentor.io","Memorization is not the path, long term. Best practices evolve with the times.","why not just make a local index.html, script.js, and style.css filesthen develop locally without needing a 3rd party site","Dribbble! Find a design you like and recreate it","!remind me 11hours","Create your own site? You don't even need a webserver. You can save the document on your computer and reference any CSS / JS locally, and open it as a local file in your browser.","cssbattle.dev"],"points":36},{"text":["Ambush on Twilio's Video SDK Issue"],"points":0},{"text":["Tailwind & React newbie question - index.js??","First of all, React is a JavaScript framework that uses a virtual version of the DOM. The reason you would build the HTML outside of the HTML-files (like we used to back in the day) is mostly due to that virtual DOM, which enables reactivity and splitting up the code into re-usable components,It's far more complex than that, but that's the quick version.You can use React in different way, like \"mounting\" a react app / component or simply building the whole website as a React app.Your questions cover many long topics, and to answer your SEO question; yes it has implications, but you have different ways of \"rendering\" the React code these days:SSR (Server-Side Rendered): Renders the React code to HTML server-side, much like PHP.SSG (Server-Side Generated): Pre-renders the React code to HTML server-side, often referred as static.Client-side only: Only render the React code in the client, I guess it's the SPA (Single-Page App) approach.I'd say the first ones are most common these days, using frameworks like Next.js for React.","There are some advanced setups that can allow you to use React in piecemeal in a static HTML/CSS, but for where you're at you should avoid those to start. This is not a common use case.For all intents and purposes, React should be considered your full framework that handles all your page and component creation. JSX, React's preferred syntax, involves colocating and writing your JavaScript and HTML together in the file. Thats the way web frameworks have moved to in the modern web, there's usually some version of a virtual DOM and your framework of choice handles all the rendering of markup instead of just adding specific reactivity to a button by querying the ID or something.If the React experience with JSX templating is not your cup of tea, you want a framework where there are more distinct separations for markup, styles, and logic, I'd suggest looking at Angular or Vue as they both approach component/page creation with some more clear separations. You could also just use plain old JavaScript or Jquery inside script tags, still totally valid!As far as that tutorial goes, the index.js stuff is fine--like I mentioned React components and pages are full on JavaScript files that render out to HTML in the broswer. However, if it's not clicking with you then there's plenty others out there. I've been a huge fan of Wes Bos as an instructor, and he has an up to date React for a Beginners course that is on sale. If you want something free I'd honestly start with the [react.dev official docs](react.dev) or try this started project from Web Dev Simplified where he runs through a tutorial in the official React docs.If you're worried about SEO, React docs officially recommends using Next.JS . It's a \"meta frameworks\" that bootstraps and extends a React project with routing, file directories, and most importantly an easy way to server render your website like a static HTML or PHP website. There are some more things that NextJS can handle on top of that, but you can explore those in the docs as need be. You're already learning a ton and don't need to overwhelm yourself more than intended!And lastly, on that note, feel free to narrow your scope a bit too if it helps. Just focus on a few basic tutorials, make the standard Todo list app, then add in tailwind and page structure and all that fun stuff, haha.I know this was a huge info dump, hope it helps, and feel free to ask more questions if you have em!","code the site in JS via ReactReact bros will love to tell you: \"It's just a lib, you can use it as much or as little as you want!\". But in practice react really wants to be in charge of everything.​index.jsThis is the thing that instantiates your react app. Depending on your local build tool, you may also get an index.html file that is just a <head> <body> and an empty <div>. React squirts the entire app into that empty div and makes changes to the DOM dynamically based on the changes that happen in react's virtual dom.​if this is the way to use React/TailwindTechnically no, but realistically, yes. You can load all of Tailwind via a single huge (and I mean huge, it's like 2MB) css file, but if you let js run the show via a build tool like vite/webpack/turbopack/etc, Tailwind provides utilities to remove all the tailwind classes you don't use in your app.​what are the implications of not having HTML for SEO, etc.They're bad. CSR (client-side rendered) apps have notoriously bad seo. The react community historically has not cared that much about semantics or seo. That's changing a little bit nowadays but I still bump into \"lulz <div onClick={} /> go brrrr\" devs and their awful code all the time."],"points":7},{"text":["What to do next?","I still thinking if is a good option to switch from Django to other web frameworksThe grass is always greener on the other side!Putting aside the talk about job opportunities, I would recommend the switch only if you are not satisfied with Django."],"points":1}]