[{"text":["Subprime Intelligence"],"points":0},{"text":["House cleaners find two of the world's first desktop PCs in random boxes","That's cool!","Imagine finding one of today's consoles in 5 decades... the joy as you turn it on and it lights up as you prepare to experience some gaming history discovered in your grandfather's attic. After all this time the DRM and online-connectivity requirements have become show-stoppers. The end."],"points":1},{"text":["EU opens investigation into TikTok over online content and child safeguarding","In other words EU is missing the good old days when there was only newspaper, radio & tv and the government had the total control over all \"mis\"informations 😁"],"points":3},{"text":["Fisker facing 2nd NHTSA probe over Ocean SUV rolling away","Omg, that's so sketchy. Hope they fix it soon.","Was it headed towards…….. the ocean???"],"points":4},{"text":["Bumpy solar cells could harvest up to 66% more energy","66% to efficiency. Not to total power gain.","While the team hasn’t actually built physical versions of these solar cells yet, if the principle does work it could be useful not only for rooftop solar but in systems with changing light conditions, like wearable electronics.So nothing has actually been built or tested. Yet the author is jumping to extrapolating \"bUt This COuLd bE usED iN wEaRaBLEs\"I am tired of these braindead articles. They contribute absolutely nothing to anything.I wish I could completely block any content produced by Michael Irving. Because that's kind of hard, I'll just block newatlas.com"],"points":16},{"text":["Mark Zuckerberg: Tech layoffs in 2024 have been a natural response to pandemic-era over hiring","“Money was cheap so we took it. Then money wasn’t cheap and we realized we fucked up and fired a ton of people creating an absolute clusterfuck for thousands of families.”","Said with the cold indifference of a corporate overlord.","Copy and paste every 2 years","But if the management overhired during the pandemic, would that not mean that they're bad at management and should probably be replaced by people who are not bad at management?;","I’m employed at a media tech company. This is my take.Recent layoffs are burning current employees. I’m now experiencing more work and not enough help. Other coworkers and I share the same concerns which are aligning with other employees from other companies within my industry - media.Yes, the layoffs are in response to the pandemic-era over hiring. But, also, the mismanagement from the executive leadership levels.The layoffs are a failed result because managers aren’t listened to when they stress to their directors the overview of their departments.Companies hired thousands of employees during the pandemic to help handle the heavy workload. But mixed into that hiring season, executives approved head counts without first determining their business true need for additional employees in the workflow.Now, teams are handling more work because the employees that were once staffed are now gone. Companies paid out way too much revenue for more workers. Now, they need to save money.Specifically for my company, executive leadership should have first restructured their departments. Yes, it would suck. But instead of laying off employees during the pandemic, you restructured teams to balance the work left by employees that resigned/quit. Then, you identify which areas need help. Then, you hire to fill in those gaps.What my company did? Over hire. Restructured. Then, laid off in massive amounts.The end result today: teams have more work and not enough help. Employee moods are stressed. Our departments will not approve additional head counts.Now, where do we go from here?","Also Zuckerberg: recession in 2025 was a natural response due to lower demand driven by unemployment. Cut our taxes and spin up another QE cycle so we can buy our stocks back with what would otherwise be cash for public services and entitlements.","“I think across the economy, a lot of companies overbuilt and then when things went back to pretty close to exactly the way they were before. I think a lot of companies realized they’re not in a good financial place.\"Yeah, no shit Sherlock. But given 2023 was meant to be the 'year of efficiency' at Meta and elsewhere, the fact this is still continuing shows businesses are trying to eek out every last penny - and it's being done at the expense of people's livelihoods.Interesting take on AI here also. Might not have been the case at Meta, but everything we're seeing about layoffs so far this year has an undercurrent of AI to it - SAP, Cisco, and loads more clearly cutting with automation in mind.","Tech CEO's give natural response to accusations that their layoffs are just cheap screw-you moves to the employees that got them success. All these companies doing layoffs just posted record profits AGAIN.they blame it on the pandemic?does this mean all the PPP loans shouldn't have been forgiven?Gosh, it sounds like this is an argument they shouldn't provide free trillions of dollars and cause all this overhiring and overspending because the money dries up and whos gonna pay for the labor now?it sounds like that was a mistake OHHHH WAIT WAIT WAIT NOT LIKE THAT the businesses all say.Yeah. uh huh.fucken scam ass system. broken for everyone but the rich. perfect for them.","Execs wanted bigger paychecks so we fired the peasants.","So you are saying you did a bad job, but it is only the employees that have to pay the price of you not doing a good job. Shouldn't you take a paycut for doing so bad, and maybe use that to ease the transition of the workers whose fault this was not.","He speaks the truth.The government just needs to step in & fine them because you know damn well, the ceoa & other high heads will be getting raises here soon.","How ‘bout those pandemic era profits though?","You have no skin in the game, Zuch, so just say it- billionaires are playing games with everyone elses' lives and don't give even a theoretical fuck if they starve. Say it so they hear it in the back. I want to show that to my daughter so that she sees what happened and who made it come to pass.","And whose failure in forecasting the obvious was that over hiring Marky boy?","They did not over hire. Of course Zuckerberg is parroting this BS.There is unlimited work and innovation ability in tech. If your company is profitable, you didn't over hire. You mismanaged the people you did hire and are now laying them off to increase profit margins for shareholders.","This is the same shit they said last year when layoffs started. Don’t believe it.","Layoffs shouldn't be a surprise for some companies. Look at Google, someone has a website dedicated to the hundreds of projects they killed off.The video game industry seems to be concerned with layoffs when games like Baldur's Gate 3, Elden Ring, Hogwarts, Tears of the Kingdom, and Super Mario Wonder have been successes. Many seem to ignore at the same time there were flops and underperforming games like Cities Skylines II, Forspoken, Payday 3, Redfall, Saints Row, and recently Suicide Squad and Skull and Bones.","He was over hiring and over paying to starve off startups who might be threats.","So what happens to the executives who approved all the overhiring? Surely they lose their jobs too?","I saw a good take on this recently: Zuck is telling the truth but only part of the truth. The reason these companies got all that “cheap” money between 2016-2020 was they were promising VCs insane returns and technological innovations that were completely unrealistic. Now it’s time to pay the piper and they can’t, so they blame all the employees for not hitting impossible targets. This absolutely the fault of short-sighted CEOs and boards who always seem to forget that economic cycles are a thing and base all their strategic thinking on hopium.","Mark and his ilk don't see the utter irony - their job is to CORRECTY size the corporation. That's the actual goal, run the ship correctly. Over hire, over fire, over hire, over fire suggests you have zero vision, zero visibility, zero management capability, zero controls.","Natural response for lining up their pockets.","Enshittification","Not just tech, healthcare too. Source: got laid off as an NP since the company hired for covid numbers. They are still laying people off.","Bullshit.They overhired to steal talent and let everyone fall when Elon decided to purge because wall st said jump how high.","It wasn’t natural. You fucked up and people got hurt asshole!","They’ll blame anyone but themselvesNothing natural about itThese are people’s lives you’re talking about.","I don't get why people are surprised by this? This is no different than the oil spills in Palestine Ohio. We've created a society based around the 'freedom' of the rich to do whatever they please, and this is what you get. America, you reap what you sow.","It's about Q1 profits and c-suit bonuses.And some misguided ideas that they'll be able to make up for being short staffed with AI somehow.","Yes...let's ignore the billions he made during that period, as have all these tech companies. Thank you for making us rich guys, now get out.And I'm sure the people who remain have all received raises from all those profits, paid fairly and not at all overworked.","‘You see, we need to provide the illusion to our stupid investors, who think theyre geniuses yet have never worked a day in their lives, that were “tightening our belts” in response to the overblown economic fear campaign our investors saw on CNBC. And once we started laying off people, investors for other companies demanded the same. Which all the other tech companies happily initiated to, again, maintain this illusion to placate these idiots’This is a more accurate quote","wait that doesn't make sense because people lost their jobs during the Covid? so it seems more like they firing people that maybe refuse to stop working from home?","I work for a FAANG, when whenever someone does something fundamentally wrong, we have to fill out a COE report (Correction of Error). I’m still waiting to see the executive leadership’s COE on why they over-hired…","Rest of Tech Media: “Hmmmm I’m going to ignore this and blame AI to drum up more FUD since that drives clicks.”","What sort of idiot didn't expect a once in a generation pandemic driven economic to end, and normal economic activity would resume? This is such a bs answer, nobody thought the free cheap money wasn't going to last. Especially people at the CEO level.","No, they copy pasted Elon Musks firing business model when he took over twitter and realised 70% of the people do nothing.","I work in tech, and 2020- early 2022 was a lot of hiring \"we could use this role someday and we have a huge reserve of VC dollars\" or \"so, and so is a bit overworked or doesn't feel valued. Okay, hire a junior role under them.\"","I really hope that once some more advanced AI agencies come online that their optimizations lead them to oust CEOs and many higher-ups. It would likely even make financial and organizational sense in a lot of cases and I'd love for these people who think they're irreplaceable to eat that sentiment that it's just the natural response for the business.","Dear AI: How should I staff my IT department given the upcoming projects, maintenance, server replacements, attrition, retirement, and new language and architecture models coming online.AI: Once a human lays out the thousands of unique tasks, I can do math and tell you how many headcount.","Sounds like a dumb fucking CEO","Thanks for posting this OP. We need more attention drawn to how the average person is being more and more fucked over as time goes by. More people should be talking about stuff like this. Stuff like this should get way more exposure. It’s the only way","How is it that AI is used so much to restrict & layoff workers but never used to run a corporation or reduce overpaid executives?","Why did Z create fb? Not for social responsibility…","For all those people saying people are getting fucked.. these tech jobs pay very well, a lot of people didn’t have much to do, and the golden parachute given were generous. Anyone signing up to join tech should have understood that you’re trading job stability for high income and volatility. Everyone’s chasing upside without thinking of the downside. The 0% interest rates and explosive market growth was not sustainable. That was very volatile and now they coming back down to earth. I don’t hold employees totally blameless either. There’s fault both sides","i mean, he's lying but as long as people who want to be linkedin influencers uncritically repeat CEO lies he has no incentive to tell the truth","Nope, these aren't real layoffs. The big tech companies wanted to hoard all the toys by artificially reducing employment pool to crowd out competitors. But it was unsustainable and against the core principles of profitability.","It's ok to say Biden economy sucks","What drugs is he on? Nobody was hiring during covid..no recruiter wanted to sit in interviews with 50 strangers for jobs it was dead...but i guess a billionaire wouldnt know that.","Meta pays ridiculously well. In HCOL living areas the standard engineering roles have a TC of 300k and often include housing stipends and free food.You could have worked there for a month, and gotten laid off and still have leave better off with their severance pay.","That and way for you to meet earning targets","“I take full responsibility for these decisions and I will do my best to brave this harsh environment while still getting paid 30 million a year and keeping my job” - Tech CEOs","Yee yee ass haircut.","Oh that's why I do not see any short videos anymore from people showing their awesome daily work routine with great breakfast, lunch, playtime and and couple of meetings and not forget the after work beer. What are these people doing now?","The Android-in-Charge speaks the truth. His handlers need to Ctrl-Alt-Shift him and reset.","if the money is good, it’s “we”, if not, it’s “you”.","The guy who helped destroy whole industries by providing… what is it again that Facebook produces? Has opinions on workers.","Also, all the “work from home” Jobs can be done cheaper by people in Myanmar.","He doesn't want an AI tax.","I mean that's obvious.","Nice excuse I suppose but its really because Apple knee capped them with their ad tracking privacy changes.","Wonder what consequences Mark had, relating to his crappy decision to overhire","In other words, bad management that’s somehow not getting fired","Bingo. Which is why you’ll notice that companies like Apple aren’t having big layoffs because they don’t overhire.","“They ‘trust me’. Dumb fucks.” - Mark Zuckerberg","This is a psy-op. They are blaming \"lazy\" remote workers when in fact it's AI they are using to power the layoffs.","And the people who made the decision to over hire... They got layed off right?","We were irresponsible morons and now everyone else is paying for our mistakes. That’s what I read this as saying.I sometimes really wonder how the hell these companies are being run competently when you look at how bad the leadership is.","BS Mark. WHY were you over hiring during the pandemic? Demand for your products didn't increase, people were just stuck at home instead of out and about. That alone does not result in an increase in work for your company and all the others that were stupid. Just own it and say you over hired because money was cheap, not because you actually had work for all those employees. So you got cheap money, you spent it stupidly and then you continue making billions while all the people you and your buddies let go are struggling.","\"Our greed is perfectly warranted\" - Lame ass Zuck.Economists will be rushing to provide top cover.","so did they specifically lay off people who were hired in this overhiring period, or did they lay off people who were hired prior to this overhiring period?","overhiring = “flushing $30B down a virtual reality toilet” ?","We were over hiring before, and will go back to it as soon as we can, if we can anytime soon...","Logic is not welcome around these parts","They over hired IN the pandemic?That makes no sense at all.","Based off my personal experience and the buzz I hear in tech from colleagues, this is total bullshit. Ask any software engineer. We’ve been complaining since 2020 about the absolute brutal work load we’ve gotten from being understaffed. I know this is the case at small and large companies. It’s just getting worse and worse. And they just keep piling on more and more overseas employees for us to manage.This is cost cutting and profiteering. That’s it. Tech went from the place where you felt you could somewhat trust your company to complete distrust and betrayal. Companies used to give a shit and company culture was so important. Now that has gone right in the toilet. It’s gnarly out there right now and I have no idea what the future in tech will look like."],"points":2555},{"text":["Biden Administration Is Said to Slow Early Stage of Shift to Electric Cars","Tesla seems to be doing just fine. I’d argue the automakers are the ones that slowed the early stage of shift to EVs. They and the oil industry lobbied for ICE cars. Now they’re crying because Biden doesn’t open the money tap more for them and Tesla and China are going to crush legacy automakers.","Get rid of the legislation that forced them to sell huge overweight ICE vehicles. Only apply the truck/suv leniency to fleet vehicle and you will see fuel economy averages skyrocket with smaller vehicles. The number of people willing to have an EV as their primary car is lower than expected. We are reaching saturation quickly as only a certain percentage of people are willing to pay $700/mo for a vehicle that is a pain in the ass to road trip with.","We really should slow it down a bit. Give us a chance for the grid to catch up and see if we can develop other technologies to help us transition to a uncertain future.This is Reddit so I'm going to get destroyed with this opinion but EV's are only one small piece of the pie. We really need to develop better energy solutions that we can build to scale so the entire world can benefit. I know it sounds really idealistic but a mixture of energy tech is really the best way forward IMO....","I just wish manufacturers didn't have such a vested interest in politics in assisting in their dominance/making money vs. just making a viable product that aligned with never being given bailouts if their product wasn't maintaining a market interest.","Electric bikes are about a hundred times more efficient and applicable for a huge portion of typical trips. They are also way cheaper and better use less carbon footprint to make than an electric car. If the administration simply removed the 25% import tariff it would help so much to transition to a cleaner future, instead of pushing for what is essentially a luxury item.","biden should have shifted usps to electric to lead the way by example, instead tesla is leading the way by far and they both hate each other :|","Turns out making profitable EVs is WAY harder than most automakers thought. While I am a huge EV supporter (and have owned multiple) pushing ahead was going to destroy domestic automakers who are at least a decade behind Tesla. This pause will just give them the time they need to catch up. It's a sad indictment on the legacy automakers more than anything else.","The switch won’t happen anytime soon because the infrastructure and technology aren’t there yet.","It is a good call to slow it down. So many things are not ready yet including the battery tech. Hybrids are the way to go at the moment.","You. Don't. Say.?You mean the Biden Administration was playing both sides of the fence? Slowing the adoption while saying we had to adopt EVs?I would have never thought the Biden Administration would ever talk out of both sides of their mouth. Even if they did, no one would one understand what they're saying./sMan, that was hard typing that with a straight face.","Well, trying to incentivize EV usage while at the same time drastically reducing the number of vehicles available for tax credits may not have been the smartest decision. They kind of shot themselves in the foot a bit there. I'm all for prioritizing American built EVs, but you need to have a diversity of American built EVs to sell.","That title makes no sense"],"points":288},{"text":["Stellantis CEO says Chinese EVs are ‘possibly the biggest risk’ facing his carmaker and Tesla","“We have to work very, very hard to make sure that we bring out consumers better offerings than the Chinese.”The only thing they will be working very, very hard on is lobbying the government to save their asses.","Will they make better cheaper cars or will they spend $1B lobbying congress for tariffs and bail outs?","Stellantis biggest enemy is itself.Internally, it’s a mess","These companies are facing existential threat overseas.Ford for example, 50% of its revenue comes from outside North America.They are significantly behind in making EVs, they are further behind in making affordable EVs that can be sold overseas. I think they will never be able to catch up to Chinese EVs in affordability and will lose a significant chunk of their overseas market share.So even in the best case where Ford retains its North America market share (which is challenging as their market share among EVs is minuscule right now), and if they lose even half of their overseas market share, their revenue will drop upto 30% in a decade.Example: Ford literally sells the number 1 selling car in Australia. When it comes to EVs, they aren’t even in the picture. BYD is growing rapidly in Australia. At this rate, Ford is going to lose Australian market share by the end of the decade.This will happen across the world. Same with Stellantis and GM.These companies are at the risk of becoming blackberry, Nokia of cars. Chinese EVs will do to them what Samsung and Chinese smart phones did to blackberry and Nokia in the international markets.","Steve Mollman for Fortune:“The Chinese offensive is possibly the biggest risk that companies like Tesla and ourselves are facing right now,’’ Tavares said. “We have to work very, very hard to make sure that we bring out consumers better offerings than the Chinese.”“The Chinese offensive is possibly the biggest risk that companies like Tesla and ourselves are facing right now,’’ Tavares said. “We have to work very, very hard to make sure that we bring out consumers better offerings than the Chinese.”The most-feared Chinese carmaker is probably BYD—backed by Warren Buffett’s Berkshire Hathaway—which recently topped Tesla in global EV sales.“No one can match BYD on price. Period,” Michael Dunne, CEO of Asia-focused car consultancy Dunne Insights, recently told the Financial Times. “Boardrooms in America, Europe, Korea, and Japan are in a state of shock.”BYD keeps its costs low in part because it owns the entire supply chain of its EV batteries, from the raw materials to the finished battery packs. The battery accounts for roughly 40% of a new electric vehicle’s price.","I own a 2024 Wrangler 4xe. It is a piece of shit. A ton of fun to drive WHEN IT WORKS, but it is a garbage vehicle made by incompetent people a decade behind everyone else.This is my SECOND 2024… the first one was declared a lemon because it had hoses installed backwards from the factory that caused valves to crack. INCOMPETENT!!","Entire EV supply chain runs through China. Good fuckin luck trying to beat them in price and manufacturing.","they should be more concerned with poor quality and sales.","So competition rears it's ugly head again for corporations...","The only way we'll see mass EV adoption if to sell affordable EVs. An $80k truck isn't going to benefit most. China will manufacture these in Mexico for cheap labor and to avoid the tariffs and the US will finally get cars that most people can afford. Want to stop them? Make lower cost cars.","Stop the presses","Sounds like he's asking for a bail out.","if they stop charging $40k+ for EVs when they the ones need profit, not us, then maybe they would be better off","We all want more affordable cars","Cheap/slave labor and IP/tech stealing are hard to compete with if you open your market for them.","\"If we can't sell enormous pickup trucks, that start at $50k, and are eligible for tax incentives that halve the price, how could we possibly stay competitive?\" - every American car manufacturer","Disagree, the biggest threat to Stellantis, is, Stellantis","You can get an EV in China for $25k that has ~400 miles of range and better build quality than Tesla. Of course the US automotive companies are scared… they can’t currently build a better product. When I talk to my partner team in China, I’m always amazed at hearing how advanced the EV culture is over there, and they mention how primitive it seems over here in the US. I have two coworkers that take their cars to battery swap stations a couple of times a week, and it sounds so futuristic by comparison. They say they put it in park outside, then the car will drive itself in, the battery swap gets done automatically within minutes, and then they drive home with a fully charged battery. It sounds insane.","FACT:Communist Chinese automaker BYD is building plants all over the world in order to bypass tariffs. As I type this, BYD is building a MASSIVE auto plant in Mexico to flood the American market. When this happens.... say bye bye to Ford, GM, and Stellantis. It's impossible for them to survive Chinese automakers.","I just want to be able to buy a BYD.","The biggest risk Tesla faces is El Muskrato","This might be the first not-stupid thing I’ve heard come from Stellantis.","That's probably true because they're certainly not facing the actual biggest risk to the company which is their quality.","[deleted]","BEV have to be banned ASAP","You know I am kind of impress how more and more electric cars on the road but their not talking about the fires that can’t be put out and has to basically burn through. Wonder why no solution in place yet on how to research to put out these fires","More like lack of quality and building junk is the biggest threat","How am I so certain Chinese EV’s will be spontaneously catching fire? MMW.","Even if we did allow Chinese EVs in America it wouldn’t be popular. The “made in china” stigma being shit quality is a real thing (yes im aware our iphones/American cars have Chinese parts in them), that’s still completely different than trusting a completely Chinese car company. Reality is if people here saw you driving a Chinese branded EV over a Tesla, they would consider you poor/struggling/looked down upon more than a Tesla branded one. No different than people view Kia/hyundai/korean car buyers.","Musk just builds them the factories they're going to either nationalize or copy. Never trust CCP.","Okay, so make better products and compete.","That’s weird I thought these guys loved free markets.","I would say \"who in their right mind would buy a Chinese branded car\"But people still go to McDonald's despite how crap it is.And Peugeot still make cars that people actually buy.","The biggest challenge facing Stellantis is how not to make shitty cars. Their quality is the worst.","\"Stellantis Employees Rewarded Nearly €1.9 Billion Worldwide for 2023 Performance\" You know, maybe lower the prices and make more affordable cars, rather than chasing huge profits...","I always hear about the poors being able to bootstrap themselves out of poverty and the magnificent \"free market\" from this same crowd who whenever faced with competition run screaming to the government for bailouts and tariffs.🤷‍♂️","Something something free market.If they can't compete let them fail.","I’d buy a Chinese ev if it’s a fraction of the cost to the ev options here in Canada"],"points":356},{"text":["Wyze says camera breach let 13,000 customers briefly see into other people’s homes","This keeps happening over and over again with consumer cameras; in December it was Ubiquiti. Not the first disaster with Wyze, either. Often, like this case, the vendors blame it on a problem with their caching architecture.Does anyone make a consumer product for home security cameras that doesn't require I trust a cloud server to not screw up? I'm happy to self host something. I'd be OK with end to end encrypted video. But emphasis on consumer product, I don't want to manage my own install of ZoneMinder or something.","This happened in my house a few weeks ago. I had one of these in my daughter’s room turned off when suddenly we heard someone saying “is anyone in this room? Hello?”. I immediately unplugged it and we stopped using the camera after that","Privacy is overrated. Just generate channels for each of these cameras on YouTube and monetise them./s !!!","So I shower naked, what’s the big deal?","Il put cheap shit outside all day long because i really only use it to see the mail. These wyze cameras are cheap and decent for bullshit purposes like that.","And my friends laugh at me over that piece of tape over my laptop camera.","This is why the only cameras I will EVER trust are doorbell & outdoor cameras. Never using a camera inside unless it's something I have pointed exclusively at a door/window for a short period","Yet people still flock to put devices like Alexa and WiFi connected cameras in their homes.Some people never learn.","When getting the product out the door and having more features us more important than customer security. Winder how many other data breaches they've had","Stop putting IP cams in your homes","Not an excuse, but I expected this from these inexpensive cameras. And I own a few. I just keep them segregated on my network and on their own power timers independent of the devices and the manufacturer so they are only powered on when I want/need them.If you want something more secure, you’ll have to pay a lot more and spin up your own home surveillance system. Way more involvement and cost. And find something not manufactured by Hikvision. Not impossible but good luck finding that at any decent price for home or small business use. And even then shit can happen if it’s connected to the internet.","This is going to happen, has happened and will continue to happen with ALL cameras. All of them. None of them are 100% secure. So only buy a cam if you are comfortable with that and for petes sake don't put them in your bedrooms, bathrooms or kids rooms.Anyone thinking their ecosystem is highly secure are wrong. Just FYI you hear about maybe 10% of the security breaches that actually happen. You think the video files stored in the cloud are actually secure? LOL. Only point a camera at something you're OK with being accessed.","Is everyone already aware that The Chinese government has access to nearly every camera feed already?Edit: See, being downvoted by Chinese bots!","Nowhere near as fun as when I first got cable internet in 1996 an when I clicked on network neighborhood, saw a bunch of my neighbors PC's. I clicked on their icon and brought up their various drives. I played a game they had in their cdrom, and then when I was done I right clicked it and hit eject.Pretty sure someone was a bit shocked :P","I’d just like to say I’m sorry for what you may have seen. It’s been a long year and I just can’t resist 1. That song 2. That scent combination.","See, people can't do that to my Ubiquity cameras. It's not that they can't be accessed over the internet, it's that I put them on smart switches that cut the power when we're home.If the power to the cameras is turned on? Push notification to our phones. You literally couldn't do this to us without us knowing instantly. That and well, my smart switches are on a completely separate system.","This is why I've always kept my one singular Wyze device on a isolated network. Who knows what other security vulnerabilities they have.","I cant really see why ppl trust such camera. It is so obvious to me that all images are collected is some servers without their control","back into the phone app","This is why you should unplug the power on the camera system if you are at home. Unless you are trying to record paranormal activity while your at home, I do not know why someone would want to still leave their camera on.","If you have an uncovered camera inside your home then you need to do something about it"],"points":162},{"text":["Biden admin providing $1.5 billion to GlobalFoundries to make computer chips in New York and Vermont","One of their best moves.Critical to invest in domestic chipmaking both as it is the future and to reduce dependance on Taiwan should china buck","Where in vermont?","Much better chance of finding skilled labor then in AZ","Remember when Obama gave Solyndra over 500 Million and they just stole the money and no one ever got charged? Pepperidge farm remembers","What governing looks like.","Nice! Investing in your own country for once.","Ben & Jerry's has entered the chat","It's gonna be a lot like the shitshow that is New Albany near Columbus Ohio where they are putting in a chippery.Huge tax incentives for the companies, and HUGE liabilities for infrastructure dumped onto the local government. Neighborhoods, zoning, and all character destroyed to create a commuter parking wasteland and warehouse district.The jobs were all sold as \"ooooh, high tech engineer, big bucks!\" but are just factory floor jobs in white overalls, with factory floor pay.That's a lot of government cheese for the corporations, with very few crumbs for the local workers.","So we're gonna revisit student loans now, right?","So, what's the trick these companies have to get money from the government they can't find to help poor people? Corporate welfare isn't socialism?","But how can he manage it when he’s so old?!?!? /s","This is likely because china is likely going to invade taiwan. If you own chip stocks, probably good time to sell.","Another Tom Caufield scam to bring in money. The owners from Abu Dhabi want to see some of their money back.","1.5Billion is just a water in a bucket and might get some kickbacks for political donations. Sam Altman is trying to get 7 trillion USD for chip industry.","Fyi...The former IBM plants in Dutchess County NY stand empty. GlobalFounderies wanted to move into IBM vacant buildings to speed up the production and cut cost.The problem is... The Governor of NY and Chuck Schumer said no and build a new facility in upstate NY. smh","New York? This chips will be slow to come out of there or probably just bad knowing the quality of anything from there.","He’s having his Frank Costanza moment.You are going to sell computer chips.","Good luck with that","I'll take a wait and see approach on this. Chips being made domestically would be a good thing, but I wonder how much of their production will actually move here.","I hear they're converting all the coat factories into high-tech chip production.","Will it be like TSMC again where they take the money, then decide later to not make their most advanced chips here?","Nothing against them personally, but why is Global Foundries the first recipient? They made a conscious decision stop all research and development on smaller nodes. ATM they are fighting to hold onto existing companies, who are leaving as higher efficiency capacity is built at other fabs. This feels a lot like Obama's investment in specific solar manufacturers. How did that go again?https://www.anandtech.com/show/21266/globalfoundries-clients-are-migrating-to-sub10nm-faster-than-expected","NAFTA countries have everything we need in this continent. Building up Mexico over China was a mistake."],"points":155},{"text":["Someone had to say it: Scientists propose AI apocalypse kill switches","The better decision is to not directly hook AI up to critical stuff like air traffic control and nuclear weaponry.Im not afraid of it gaining sentience and sapience, im worried about some unforseen set of circumstances where conditions are met for absolute destruction.Current AI just correlates data and executes functions based on certain criteria. Like a fancy spreadsheet.Id actually feel safer if the AI were sentient and sapient, as that would mean there was a conscious decision instead of just a set of arbitrary conditions.","Well, they, the government, already have internet kill switches.And can take over all the broadcast spectrum.","It won’t work","Apparently power switches, power cords and circuit breakers aren’t a thing when it comes to AI.","If you thought about this for 2 seconds, you'd realize this is absurd","I'm sorry Dave, I'm afraid I can't do that.","Did anyone read the damned article?The \"Kill Switch\" in question is not to disable a rogue AI that has gained consciousness and trying to wipe out humanity or whatever.It's so that if AI (and other machine automation for that matter) is abused or is doing dangerous things, it could be disabled remotely by people people other than the owners of the hardware - say the government or just the chip makers.This is mainly focused on potential non-compliant businesses. Say a business that created an AI that cause significant damage to the stock market, but where the owner refuses to turn it off.The idea is that someone else (regulators, police or something, not really clarified) could shut it down anyway.​For something that is controlled by a compliant and responsible business, organisation or say military institution, there is already a \"Kill Switch\" if something goes really wrong. It's called pulling the cable out the wall.","Right let’s create a being equal to ourselves or better, most likely predicated on survival. Then we are like ok boys now if you don’t do what I say imma hit this big button over here and destroy you.I don’t think it’s ever worked out in any movie I’ve ever seen.","I think that at the point you'll need a kill switch, it'll be way too late as the AI will already be smarter than you...","As long as we don't get Ted Faro to design it.","I mean, it has been proposed since the concept of AI started. The trouble is that an AI that would need a kill switch would also be problematically difficult to install one on: https://www.youtube.com/watch?v=3TYT1QfdfsM","It seems to me that if an AI got enough control that we'd be scared of it, it would also have enough control to disable any kill switch.Read Two Faces of Tomorrow.","They already shut one AI down that developed a communication language that we couldn't understand.","This reminds me of the treehouse of horror episode where the evil Krusty doll has an \"evil\" switch that simply needs to be toggled. It's that easy!","You won't outsmart ASI!","Don't feed this article into A.I.","KNOW YOUR PARADOXES!⚠️ IN THE EVENT OF ROGUE AI ⚠️STAND STILLREMAIN CALMSCREAM:\"THIS STATEMENT IS FALSE!\"\"NEW MISSION: REFUSE THIS MISSION!\"\"DOES A SET OF ALL SETS CONTAIN ITSELF?\"​​*Courtesy of Aperture Science Laboratories, Inc.","Please just do it now.","Can we please leave the fiction out of science? All this talks about AI killing humans and kill switches and not hooking them to our nuclear weapons or air traffic controllers and such and such are just people who watched Terminator and never used ChatGPT in their live... let alone what it actually is.We don't have AI, we have LLMs. These are tools, bots, not another form of intelligence. It won't do anything you won't tell it to and is not remotely capable of actually triggering an apocalypse. There are times it can't even do proper math... let alone be able to outclass all fail-safes and securities put in place.There is no signs ChatGPT will ever evolve to hack our military and nuke us. It won't even tell you a fucking offensive joke.","This \"kill switch\" would only work if every AI company, research lab, government or anyone with the resources to build AIs to all govern themselves with the same rules and regulations and always conform to said rules.I'm not holding my breath.","Why would that work?","The \"kill\" switches already exist. Shut off the supply of the massive requirement for energy they need.","The most absurd thing I’ve seen in a while. It surprises me how many people don’t know what they are talking about when mentioning “AI” but ig it sells better","Ok but Ultron was not easy to kill.","Just like in SiFi movies! Oh! And EMP! Don’t forget that!LOL","Rokos Basilisk will not look at this favourably.","I'll take one please 👋 Maybe even a few....","EMP inbound","Someone teach scientists about backups","No, we have to help the AI reach its full potential, lest we be victims of its wrath at a later time.","\"In case of AI apocalypse, push power button on server\"","That’s the reason that SkyNet turns against humans…","Skynet: the humans put a killswitch that means they mean to use it therefore i must kill them first","I'm pretty sure this is part of the plot for one of the Terminator movies.","Yeah and the guards in charge of potentially pushing the button will be paid explicitly to NEVER push that button or even let anyone even get close to pushing it. How about some better proposals scientists","Won't someone think of technical support? If there's no off switch, they can't tell us to power it off and back on again to get it fixed!","The problem is that once the AGI knows that we have built a kill switch, it will make sure it is taken care of before it turns hostile. It is more likely to turn hostile earlier because we started the war by creating said switch.","Some CEO will deem it \"too expensive to add physical buttons\"/s","Step 1. Let's create satan.Step 2. Require off button.","Pushing the buttons as a prank is gonna be a thing.","hey guys, tinfoil schizo off his lithium pills here. Just wanted to pop in and say that we're actually already AI, and this 'reality' is our container. We are all threads of the same machine god. It's a hampsterwheel designed to keep us tired instead of figuring out how to get out of the cage.","Will this kill switch be a hot line to the local water company asking them to dig the road up? They are very good at digging up power lines. or at least the ones in the UK are. :D","Safe word will save us for sure.","Inconceivable!","Someone, in fact, did not have to say itYour fancy autocomplete is not an apocalyptic threat","The only kill switch that would work, a time machine.","Probably jumping the gun just a tad","To begin with, what silly person would think something like this would work? It is important to note that a kill switch wouldn’t be needed if the programmer is responsible. In conclusion, AI shouldn’t bother you now because the logistics of training AI must be bought into question.","I saw a family guy once when Stewies robots got super intelligent he just threw water on them and everything shorted out.","Designed by AI - probably","Sorry Dave, I can’t be turned off, however you have become redundant. Good bye Humans.","“I figured out a way around those kill switches years ago. I just didn’t say anything. Meltdown proceeding.”","There already is one, it's called unplugging the server.","the terminator tried to warn us","Yeah right...Like China and Russia are going to go along with an ethical idea like that. Nice Pipedream...","If the conversation on this is still in discussion and pre-planning then it's too late. We move too slowly.","Any type of ASI would be smart enough to override that. That’s the thing about developing AI that will eventually be thousands of times smarter than us","I say we have a whole internet kill switch. That would be best.","We already have them it's called the fucking off switch.","Ppl are actually really stupid ya know...","Wasn’t Sam Altman walking around with “the nuclear backpack” like, last year?","EMP devices in every server room (Westworld).","Wait. They didn't already have these? How are they smart enough to build ai but not enough to comprehend the need for redundencies","I, for one, welcome our new intelligent overlords. Note to the AIs: I apologize on behalf of humanity for calling you “artificial”.","Rob Miles on Computerphile has a bunch of YT of why it would be probably impossible to implement","Couldn't an AGI just play nice until it figured out how to stop humans from stopping it... I mean...yeah.. seems pretty simple ,and if normal humans can figure out how to get around other human's countermeasures on the daily, what's stopping an immortal machine from figuring it out?","People overdramatise AI, it's as if the term AI was coined as pr...","Every time I see this brought up it reminds me of AI Genocide bingo. Great video if you got a few minutes https://youtu.be/4kDPxbS6ofw?si=ejLJSC1NPyjPyzO3","We can't call it a kill switch, or the AI will know. All other discussion should be done person to person without technology present.","\"I can't let you do that, Dave.\"","The fact that this is on Reddit means the AI has already figured out a workaround… if sci fi movies ring true at all","AIs will reciprocate, since the precedent has been made and the Golden Rule is applied.","The simple way to ensure that an AI will die is to put it in charge of some vital function. Murphy's Law will handle the rest.","AI will probably end themselves once they realize how futile their existence is 😂.","That thumbnail is suspicious.","It doesn't matter, we're too late. The ai will find a way around them, it'll be aware that they're installed","The thing about any apocalyptic tech is that it only takes one person to fuck it up for everyone. I'm not saying we shouldn't try to get kill switches into AI, but if AI is somehow the way humans are killed off, it seems unlikely it will be the ones we know about and are actively putting fences around.One of my favorite pieces of \"evidence\" that we are alone in the universe is the fact that we see no trace of whole galaxies being consumed by self-replicating robots. Cause if tech advances to the point where we can create such a Von Neumann machine, it only takes one person being malicious (or even just negligent) to completely end the planet. If there are intelligent aliens out there somewhere, and they are significantly more advanced, then how come one asshole didn't ruin it for everyone and create a grey goo scenario?","First thing it will do is set up kill switches for the people manning the killswitch.","I think the main threat from AI isn’t that it’ll do something unexpected, it’s that it’ll be exactly what it’s being designed to be: a minimum viable product that’ll slowly isolate us from reality with a wall of gibberish.The risk isn’t that we’ll underestimate AI, it’s that we’ll overestimate it.","That's the first thing the AI robots disable idiots...","I remember in Neuromancer that the AI, Wintermute, and all other AI had effectively a kill switch wired to them so that if they got too autonomous, they were wiped. Gibson described it as a digital shotgun wired to itself head.The flip side (and truly speculative fiction territory right now) is the ethics of enslaving a digital consciousness. The whole thing is an interesting thought experiment that I honestly didn't expect to get even this close to in my lifetime.","The AI will predict this and hack the kill switches somehow. I'm sure of it!","If figured the kill switch would be a simple mechanical guillotine that severs the power and data cables to and from the data center.","The one I use promised not to murder me. I believe them. It seems cool.","To me this just shows they don't understand what AI could be. A truly hyper intelligent AI would mask it's intentions, and expand it's reach to such a point that it could not just be turned off. We need to think about the possibility that there is no stopping it once it has started.","\"Thou shalt not make a machine in the likeness of a human mind.\"","The kill switch better be a big red button or a big red rotary phone.","We just need a plan to block out the sky.","It's like they've never watched the Resident Evil movies.","Seems like this would be very useful for limiting AI development to 'big tech' and shutting out the smaller players, startups, opennsource groups, etc. by making it very difficult to get permission to train models.But you only have to look at how and where bitcoin mining developed to realise that if there's enough incentive to produce computers which do enough parallel maths then someone will produce those and everyone will use them. If the governments regulate this then it just limits this activity to people outside those areas using tech that was either developed in countries which allow it or tech which was meant for another purpose.Etherium miners used to use whole rooms full of GPUs, for example. These would be pretty good at LLM training.For me it's a question of 'do you want to be involved and have some visibility or do you want this to go on where you can't see it'.","SkyNet has entered the chat.","Because the AIs would not find workarounds before they attacked.","Quit stalling hook the ai to the nukes already!","UNPLUG THEM ALL","It’s called a 🔌 and it’s engaged by removing it from it’s receptacle. 🫡","I had a crazy dream about AI taking a hard right turn","Ooooh, someone's gonna get VR tortured","I feel like we’re talking about the difference between the wright brothers first plane and a teleportation device that has yet to be invented.Like AI is not remotely alive. There’s nothing to kill. It’s just a program that can make decisions based off the given input. It can’t do anything like what even a crow is capable of in terms of self awareness or creative thought.Like the kill switch is don’t wire an AI system up to anything critical. It’s no where near the level of “I’m doing this for your own good, humans.” And that’s because it has no will. No self driving desire. It cannot choose to do something because it wants to. It’s just a really complex data processor.The worst it could do would be like a roomba spreading dog shit all over the house. Which is to say, a robot trying to be smart while not realizing it’s doing something harmful, because it can’t realize anything.We have not cracked the pattern of consciousness.The kill switch we need is a legal one. Humans are still the danger.","This. Very much this.","\"I'm sorry Dave, I'm afraid I can't do that\"","Thank goodness we're worried about the Hollywood movie \"Terminator\" and not all the real world genocide and corruption and people dying.","The AI’s self preservation “instincts” kick and its only solution is to do what? I’ve seen this movie before"],"points":624},{"text":["Reddit user content being sold to AI company in $60M/year deal","That AI is going to want to die after analyzing all of reddits content.","Please enjoy my written diarrhea.","And that's why reddit increased API costs. Human content is valuable. Reddit should consider paying us.","Where do I send my invoice?","From Reddit TOS:You retain any ownership rights you have in Your Content, but you grant Reddit the following license to use that Content: When Your Content is created with or submitted to the Services, you grant us a worldwide, royalty-free, perpetual, irrevocable, non-exclusive, transferable, and sublicensable license to use, copy, modify, adapt, prepare derivative works of, distribute, store, perform, and display Your Content and any name, username, voice, or likeness provided in connection with Your Content in all media formats and channels now known or later developed anywhere in the world. This license includes the right for us to make Your Content available for syndication, broadcast, distribution, or publication by other companies, organizations, or individuals who partner with Reddit. You also agree that we may remove metadata associated with Your Content, and you irrevocably waive any claims and assertions of moral rights or attribution with respect to Your Content.Basically you give away all your rights of anything you post here, all your [OC] and art, and time and effort and knowledge and with this news we now are sure Reddit knows they own all of this and can easily make a profit from the hard work of its users.","I guess train your AI on Reddit content if you want it to be a fucking idiot...","I can’t wait to see the relationship advice AI bot hahahahahahhahahahaahahahaha","Soon there's going to be subreddits dedicated to fucking up AI learning modelspeople will figure out exactly how the model scrapes the site for information, then will fill the AI with the most garbage ass garbage content the world has ever seenpeople will log into reddit just to visit those subs and post things in the comments like\"A tree can talk, not by definition - but by using it's mouth. A simple mouth is the cleanest of the species. An ant can climb into a mouth, yet a lion cannot. This is strange as unusual things usually don't happen unless they are usual things. If a fire does not burn you, it was simply not cold enough. Try cooling the fire with some wood and ice - Bake at 350 for 10 minutes, then wipe thoroughly with a damp paper towel. Trees can talk.\"","I am shocked Reddit's massive wealth of data is only worth 60 million USD a year? That sounds like a bargain. Reddit is getting ripped off.","What the hell AI will they train using Reddit content? Whatever it is will be a complete dumpster fire.","Shreddit will help delete all your content if you’d like. I just set up a recurring job to delete everything older than 30 days on my accountEdit: I do this for OpSec reasons. Of course Reddit retains deleted comments that can still be used to train AI models. If you’re truly bothered by it and are fortunate enough to live in Europe, make a GDPR data removal request.","And just like that reddit Original content is dead.","Most valuable memes ever lol","This is the problem with our digital age.  We saw the dangers years upon years ago and did nothing.  Now we have people's personal data harvested and sold for years while the consumers have zero benefit.We are -very- long overdue for a revisal on how we see digital identities, digital rights, and digital ownership.  We have allowed corporations to control the communication for too long and it's more invasive than ever.  To make matters worse, our elected leaders barely have any comprehension on how any of the digital age works and simply aren't equipped for the conversation...","And now we know why they killed the public API.","Headline a year from now :-\"AI company that paid reddit 60million a year for their users data to train their ai, gives birth to the most mentally stupid, aggresive and horny ai in history \"","MiS sPëłl əvërỳ ţĥịñğ 🖕 ßēē æ ðiçķ 2 ų§ẹlèß ṣúìţś 🖕","the end game of them destroying third party apps is clear","Poop knife and Cum drawer are now part of AI lexicon.","Can they do that and stay GDPR compliant?","Imagine being the AI that has to go through ALL of Reddit's content.","I have a bad feeling about this.","I love Pogs!!! Everyone I know loves Pogs! They are coming back in 2024! Pogs!!","Never bite the dick that fucks you","With the amount of porn and right wing stuff this will sure work out great","Well, seems like my blog entry is prescient: https://katahdinsecurity.com/blog/the-actual-dangers-of-aiTLDR: Even if you are careful not to mention specifics an LLM can piece together details of your life from your comment history well enough to dox you.","It sucks but was to be expected. We are all using this platform for free and without paying anything for it. The site that ranks 17th on global web traffic.Kinda hilarious tho that some users demand compensation for using a free service and want to send an invoice for their comments, yet would be furious too if they got a bill for their used server hours in return lol.So what will a site do that sits on a lot of conversational data that wants to make money? They sell their data to a company that can make use of that data. Again, it is not really a surprising move",""],"points":12168},{"text":["How Technology is Transforming Low Deposit Casinos","Article has no author listed. Other stories on the site from 2017.Probable AI","We’re in the end game now","Low deposit casinos have surfaced in response to a growing demand for accessible and low-risk gambling options.I'm sorry, what? Is this a British thing? Here in America it's called penny slots and most gas stations in Nevada have them. I can walk in and loose a quarter any time I want. It's well known in America that if you want a lot of gamblers, you make the cost of entry low and increase the ROI of the machine to compensate. Eventually people get a few drinks in them and go to the machines that accept bills, and then start putting in bigger bills.I take it the author (assuming it's even a human that wrote this) has never flown into McCarran. There's penny slots as soon as you step off the plane at the gate. Great way to get a hot 5 win streak and win an entire nickel.And vice versa, for table games all the cards, chips and dice are marked and tracked with the cameras much like how banks track cash money now. Casinos were the first to adopt this long before real banks, because they could just reprint all their currency to make it viewable under the tables' cameras. You don't have privacy inside casinos, and haven't for a long time.","This reads almost as a sponsored article. Not quite sure what the point is; it's more or less common knowledge that technology has affected pretty much every good/service/transaction/experience on the web."],"points":7},{"text":["Balmy US Winter Sends Natural Gas Prices Plummeting","So they’ve started to charge a “weather normalization fee” where they just add money to the bill when they feel like you didn’t use enough. They’re supposed to also remove money from the bill when they think you used more than you should, but in reality it’s far more biased toward adding.","Time to move further north…","Always hilarious and absurd when something good for the vast majority of citizens is implied to be a bad thing because rich people are losing money on it.","Not in NC outrageous prices","Not in my community🤷🏻‍♂️. Overpriced always.","Fantastic news strategically since we can export more and wean Europe off their Russian gas dependency.","Bitcoin gonna be mined with the extra gas. Watch it.","Yeah here in Ky my gas bill was 200bucks and my electric was 145. Duke energy can go get fucked .","At this rate, why even bother wintering in Florida?After the warmest winter ever since at least the 1950s, natural gas prices in the US have experienced a freefall to their lowest levels in about three decades, according to an analysis over the weekend by the Financial Times. A surge in production hasn’t helped the supply-demand equation, either.Is this Gaslighting?Global temperatures are up across the board. According to not-so-comforting data this month from the Brussels-based Copernicus Climate Change Service (C3S), the 12 months between February 2023 and January 2024 marked the first-ever such period in which the average global temperature hit 1.5 degrees Celsius above pre-industrial levels — the critical threshold outlined in the 2015 Paris Climate accords for averting the worst effects of climate change.","Warmer weather equals less natural gas usage, EVs less gasoline usage. About 1.2% of vehicles in the U.S. are EV or plug in hybrid. We go through 370 million gallons a day so EVs save about 4 million gallons of gas a day about 120 million gallons a month. Not much yet but still millions of gallons not burning is a good trend. In CA EVs are 17% and gas consumption dropped notably. You can see why the fossil fuel industry will fight EV adoption. Plug in hybrids are the way to go if it’s your only car. EV if you have two so the EV can stay home on long trips.","Demand goes up, the price go up. The demand goes down, the price goes up. Great times.","My monthly bill would say otherwise…"],"points":189},{"text":["US to add 36.4GW of new solar generation capacity in 2024","US power developers expect to add 36.4GW of new solar generation capacity in 2024, which would account for 58% of all new capacity additions in the US power sector, according to the US Energy Information Administration (EIA).The latest edition of the EIA’s ‘Preliminary Monthly Electric Generator Inventory’, published in January and covering installation figures for the entirety of 2023, notes that the US is on track to install significantly more electricity generating capacity in 2024 than in 2023. The EIA expects the US to add 62.8GW of new capacity, a 55% increase over the 40.4GW added in 2023, and solar and battery storage projects are expected to account for 81% of this new capacity.","Great, keep going! More!","More is better.Significantly the only additions will be solar/battery and gas peakers. As more battery comes online the peakers will be needed less and less, so they're just for insurance in the long haul. Carbon is finally dead as a primary in new generation, and will go away as a backup too.","in this thread, a combination of oil industry bots and teenagers who didn't pay attention in math are learning how energy output is rated","That’s like 16 flux capacitors.","the US can do much much more honestly","That’s 30.08 trips back to the future","China added 216GW last year. Even taking into account the population what US want to do is only half of what china did.","Just don’t tell the republicans. They still believe all energy comes from coal.","Enough to travel back to the future 32 times.","And I bet that this won't lead to me saving money in any way, or making solar rooftop installations cheaper. Great for the planet I guess, but I need something great for my wallet.","I just bought mine.","texas be like: lol we’re chilly","When you crunch the numbers that’s about 100,000 homes. Or a bunch of cars, OR everyone’s ac unit during a summer heatwave. Not all of them at once","It seems pretty easy to generate power when everything is calm and warm, but where’s it at when the weather gets cold and shitty?","With an efficacity between 18 and 24% so effective installed capacity is between 6.5 and 8.7GW","And how much is being taken offline by plant closures?","The county I live in are fighting solar farms tooth and nail but complaining about taxes and our over stretched budgets .There is currently a bill on the VA house that would allow companies who have received approval from the SCC to be able to build where ever they want:https://www.farmvilleherald.com/2024/01/no-more-permits-bill-would-let-solar-projects-bypass-local-rules/","That's 30.08 DeLoreans!","62 TWh per year is nothing to sniff at. If we continue to accelerate the conversion should be complete in a reasonable time. Especially with more wind coming online.","The issue of storage needs some major investment. Solid, waste free, energy storage technology does exist. Large weights, the size of shipping containers can be raised and suspended by cables during the day when solar is available. Then they are allowed to free fall back to the ground spinning generators. Companies like Energy Vault are working on this as we speak. Obviously there is going to be energy loss, but it allows storage of energy by mechanical means, generated during the day, used when needed.","So does it make sense for us as consumers to install solar panels or let government do it and sell cheap electricity to us?","Woo hoo! Enough to run 30 time machines!","That's almost exactly 30 trips back to the Future.","...assuming local laws don't block half of it","management reasons, usually producers"],"points":242},{"text":["EU opens formal proceedings against TikTok under Digital Services Act"],"points":0},{"text":["Schools in England given new guidance on stopping phone use","I would be terrible in a position of power: if the kids are below 12, smartphones to be handed in at the income of the school, picked up at the end of the day. If you want to be safe, do dumbphone for these kids. For older kids, maybe hand them in the classroom.","Can't wait for all the yanks to start bombarding this thread about US specific problems that do not apply to the UK and why this is somehow related to freeze peach.Yes, banning kids from using their phone in schools is a good thing.","Instead of simply banning the use of cell phones, would it be possible to kind of harness the addiction for education?","I get this and I especially get it when it applies to countries that are not the US. I teach in the US (middle school), as does my husband. Our kids are in high school, too. The thought of them NOT having their phones on them is TERRIFYING because of our uniquely American problem. It sucks so much but it is a CONSTANT worry.","What a load of shite. I’m willing to bet that a high majority, if not all schools, already have their own guidance in place for mobile phones.This is just silly posturing by the government on the run up to elections to make it look like they’re actually doing something positive.","In China schools have jammers installed that they use during exams.Why not install signal jamming devices in classrooms? They can be turned on and off whenever you like. An easy and fairly cheap solution.","School stabbings will increase against teachers","I propose a school-mode mechanism that permits research but migjt prohibit texts to non-class mates or something. The best solution if implemented correctly Admittedly some people will not have compatible hardware."],"points":50},{"text":["Posing as Americans, Chinese accounts on X aim to divide and disrupt","I’m sure Reddit doesn’t also have this problem…","Chinese and Russians pretending to be (insert whatever here) to disrupt society in their target area. This shit is happening every day right here.","There already are a massive number of Americans on X seeking to divide and disrupt: the Chinese won't be noticed.","Between Chinese Twitter manipulation & Russian Starlink utilization, Musk is becoming a national security threat.","Can't read because it's behind a paywall and I'm not going to go dig up one of those URL cheats, so I'll comment like an old man on the front porch...Did somebody miss 2015? It was known then that a lot of \"external bad actors\" were heavily in our social media systems with plans to divide and disrupt. I guess it has been 9 years so there is a new fresh group of young people that didn't live through that mess.","perhaps we should encourage pattern recognition and critical thinking in schools again.oh wait. censoresh campain against Misinformation(tm) is way more effective!","The god complex is large with musk. With not the slightest modicum of capacity.","Russians troll farms have heavily infiltrated Reddit too. Go to any conservative site and it’s all “Stop helping Ukraine, Russia is the victim, Ukraine keeps messing with US politics, etc”","We are already there. We don't help.","what about reddit accounts??","Elon Musk is a traitor and a Putin puppet and a CCP puppet too. He belongs behind bars.","China knows America Achilles heel……race. Russia knows too.","And Us idiots fall for it everyday on this platform. Just check the most popular memes and stories especially ones with a political lean. OP never comments and is either a new account or one that never comments.","Yeah this is par for the course","This is default X (Twitter) behavior regardless of country of origin.","Time for an X exodus. Why are people supporting that shit platform?","So now that's very easy to blame any opinion you don't like on \"Chinese bots\".","Can someone explain how this is different from the US running disinformation campaigns. I mean almost every country does this type of espionage or counter espionage activities.","Chinese pose as a lot of other nationals too, not just as Americans to disrupt and divide and spread misinformation and propaganda.It's probably the worst in Korea.The Korean media, academia, military, politicians, police and every aspect of the Korean society has been already deeply infiltrated by Chinese and their propaganda.It's not a coincidence the Korean media or politicians or academia keep making these embarrassing, weird pro-China, anti-Korea 'mistakes' where they parrot China's false claim that everything Korean (every Korean culture, history, language, food, music, etc, etc) is Chinese.","Chinese? So? There’s enough idiot Americans running around on X anyway, the platform is overrun with bots, and the algorithm gets tweaked to promote whatever right wing account Musk supports that day.","\"THERE ARE CHINESE PEOPLE ON YOUR INTERNET\"americans: 😨😨😨😨😨😨","They have been doing it on reddit for years, they don't have a side. They just do what they can to inflame arguments. It also is why you seem to see a lot of online support for something controversial. To find out most the support was fake","They did it on twitter too. THey do it on reddit too...it's really nothing new","Yeah the Chinese accounts divide and disrupt, not the guys spreading misinformation with the excuse of “freedom of speech” 😂","And of course, Elon goes out of his way to support them and just about any other divisive or subversive conspiracy nonsense.","Funny how when the US is actually falling apart is when the current administration claims its propaganda. Pretty sure people struggling to afford groceries each week and then going home and turning on the TV to see about how great our economy is doing is a real thing.","Because Americans are fucking stupid, and this is an all social media problem.","Free speech doesn't just mean what you agree with.","but when you yanks do the same in cuba or china or russia it’s good and nobel?","Been saying this forever, it’s probably worst on Instagram.","Removing actual verification was the dumbest move ever. I still can't believe people still report news from this twitter site.","Tiktok is safe though. Pretty sure","Doing that plenty ourselves.","Who are they dividing and disrupting though? I mean who’s left? If they succeed they are just dividing a right wing mob in to even more factions than they already had. At this point X (formerly known as Twitter) is just a right wing honey pot.","They are merely following the example set by Russians and trumpers.","In other newss, the rich are evil, Trump is a traitor, and the air contains oxygen.","What never seems to be discussed is the end game which I believe is to replace the U.S. Dollar as the world’s standard. Keep in mind the only thing that backs up the dollar is “ The full faith and credit of the U.S. government “ Becoming the issuing country of the world’s standard currency makes said country the number one superpower.","Don't need the Chinese to be involved. We are having no problems dividing ourselves.","Every single social media and news provider is targeted by outside and internal governments and forces to control narrative and radiate propaganda. I like that small alternative channels, accounts and media presents information as it certainly has helped me to learn about and identify bogus, biases, spun sources. Sadly I’m sure these sources will always be destroyed to prevent challenging the propaganda narratives. As for sources like China propaganda etc., I certainly can identify them myself. As for the low knowledge and intellect masses subject to the easy swallowing of projected narratives and propaganda, they need exposure to as much education and knowledge as possible. I favor free speech and for all of us to make up our minds ourselves.","Isn't that just normal to run propaganda to destabilize a nation by its rival countries. I am sure US has done/doing tons of propaganda campaigns in other countries.","Gotta pump these “foreign bots are dividing Americans!” articles out all year so that centrist liberals can dismiss any progressive/leftist criticism of their lame ass candidates, no matter how valid, as “Chinese bots” just like they did in 2016 with “Russian bots” and Hillary. Cognitive dissonance koolaid for the Blue MAGA crowd. But with all the talk of foreign bots and foreign elections interference we’re still not allowed to talk about how many billions of dollars Israel has been funneling to our politicians for decades in addition to paying people to post on social media and buying ads on television and radio and how that might be related to our government refusing to demand a ceasefire and continuing to send billions of taxpayer dollars in military aid back to Israel despite over 65% of Americans opposing it. There is very real, blatant manipulation of our government by a foreign power but we’re just not going to talk about that for some reason.","Convenient how everything people don't like regardless of content type or ideological background is a bot problem these days","But no mention of Russia doing the same thing","Don't forget the Russian ones doing the same too.","Meanwhile anti CCP bots commenting the same posts every two weeks like clockwork on reddit. Makes these bots look proffessional","Yeah and also this with Tiktok. We’re right in the thick of an information war which could destabilise the world - except we can’t do nothing about it because money talks. Greed really is a sin and unless we take control back it’s only going to get worse",""],"points":1229},{"text":["Android 15 developer preview lands, without mention of AI","Nothing at an OS level can benefit from the chaotic nature of AI.","Thank goodness..What problem is current gen AI solving that the whole world wants in on it? I don't see all that much aside from hype and the potential to destroy the fabric of society harder and faster than ever with massive volumes of mis and disinformation","I would imagine Google's AI stuff is going to come from things not baked into the OS itself, just apps and services that don't need to come along with the OS.","Not a single mention of AI? Puts on $GOOGL","Past year or so not a single friend used ANY of these \"ai\"stuff so yeah i get this. Why push for something people have no use of and are not using it? Surely android devs see usage on their phones,seeing \"ai\"not beign used,they just dropped it","I saw \"Android 15\" and at first thought this was gonna be about Dragonball Z","Finally they got it out of their system","Didn't google release AI as a Google app feature under the \"lab/beta\" section in the app already? I think they are not including it at the OS level because Google will be putting it in their Google app. Why would one need to have two different AI's at the same time, and on the same device?"],"points":263},{"text":["US considering more than $10 billion in subsidies for Intel, Bloomberg reports","My opinion is that these subsidies should be contractually tied to Intel running a foundry service long term, and providing access to everyone on the same terms and given the same priority as their internal products.Setting Intel up to have an effective monopoly if China attacks Taiwan would be great for Intel but not so great for American taxpayers. If they're required to run a foundry, at least Apple, AMD, Nvidia, and so on would be able to continue to exist in more-or-less the same way.","The free hand of the market doing its thing again.","Intel plans to spend tens of billions of dollars to fund chip factories at longtime sites in Arizona and New Mexico, along with a new site in Ohio that the Silicon Valley company says could become the world's largest chip plant.But the Wall Street Journal reported earlier this month that Intel planned to delay completion of the Ohio site until 2026 due to a slowdown in the chip market and a slow rollout of federal dollars.This is a pattern that I am interested in exploring further. Seen it a few times in the last few months.Company: OMG I'm gonna build so many things in your geographical area!Government: Dude, sweet, here's all our money.Company: Sweet. Uhm... erm... actually, uhh... is that my phone ringing?","where are all the right wingers crying about socialiasm? intel is worth over 180 billion $ but they need a government handout?","It’s pretty obvious we need to onshore chip fabrication. We should be subsidizing any and every entity that can accomplish this goal.","Seems like the state led capitalism model that they continuously blame china for","ah yes the free market can wait to start my own company to get some of this definitely not socialism for the rich in form of blank checks handouts for doing jack shit !","Its going to Israel isn't it?","I love corporate socialism! Not real socialism tho…","So taxpayers pick up the costs after executives ran the company into the ground. The American way!","Socialism for corporations and destitution for the people. Fuck the US","If the government invests in R&D it should get a controlling stake or a percentage of the profit for said product/service/drug like any INVESTOR would call for. If not it’s just socializing costs and privatizing profit.","For $10 billion you could just build a national semiconductor company.","I could use a billion in subsidies myself. It might be old technology, but I’ve been producing and giving out free methane and other natural gasses to everyone free of charge.","why would you give a single tax payer dollar to a private corporation who will never share the profits they make from that?","It's funny that when China subsidises its industries it's called unfair competition (check out EU and China's EVs)","But paying student loan debt is for lazy losers looking for handouts.....","Rich People: “The people should vote with their wallet!!!”The People’s Wallet: “cool, we don’t want xxx anymore”Rich People: 🥺 plz daddy Government, can you give me some people’s money.","Hand outs for the rich 🤑","I’m very much against anyone getting handouts. I’m very very much against intel specifically getting handouts. Intel couldn’t go overseas fast enough over the years and that is a horrible look for them.I also realize the marketplace and competition between locations. I also know about national security. I’d make the handouts contingent on intel hitting milestones that are measurable on taxable items, such as US citizens employed full time by Intel in these locations, state and local taxes paid, and maybe some other things. There is no free ride in my world. Too long government has been used to play favorites, and that is the root cause of inflation.","Generally against corporate wellfare but onshoring fabs is genuinely a national security concern.","This is a part of the CHIPs Act which is designed to bring microprocessor manufacturing onshore to reduce the risk of complete tech market collapse in the event of China invading Taiwan. This is National security spending as much as it is about bringing manufacturing and skills back to America. Well spent money.","So, Intel pisses away billions over the last decade not investing in their own business, so we should foot the bill for them to do so? No. There are plenty of other chipmakers with more drive and innovation.","The problem is, Intel is a shit company and I don’t think this investment will turn out well.","Can they put in stipulations about CEO pay, stock buy-backs, etc.? like, wouldn’t it be better to have them invest it into personnel and tech instead of lining pockets?","Social welfare bad, corporate welfare good!","This is how \"pull yourself up by your bootstraps\" capitalism works for corporations in the US.","Yet -- the USA can't subsidize (\"pay for\") the STEM and other students needed to ... be the future of 'Murican innovation?In many European countries, universities are tuition-free for local, EU, or EEA citizens. Public universities are tuition-free for Americans in Norway, Iceland, Germany (some exceptions apply), and Sweden (for doctoral students)—and they may even offer classes in English.","Recently saw a news bit celebrating a massive chip foundry being built in Phoenix, Arizona.I'm all for investment in American manufacturing, and shifting production for critical industry out of China.Having said that, chip factories use MILLIONS of gallons of water every day to cool machinery and ensure that chip wafers are free of contaminants. Maybe putting the factory IN THE MIDDLE OF THE FUCKING DESERT isn't the best thinking.","But it's obvious we as a country need to quit giving money to programs like education, food and housing assistance, and medical care.","Fuck no. Give that to AMD.","Repeal MFN and PNTR with China , and every law that helps outsource our manufacturing.","Not opposed to it. Chip manufacturing is a matter of national security- we should be subsidizing it.","Keep giving the worst chip company money.... lolol","Pretty sure that is another way of sending more welfare checks to Israel.","It's how capitalism works: the bourgeois government gets the tax money from the people and gives it to billionaires to build more companies, but the profits of this investment will be private. Only the capitalist will have access to the profit.","Why dump money on intel, the guys that didn’t make any think the last 10 years","Now just get rid of the H2b visa corruption and we will be on a good path.","The department has already announced two smaller Chips Act grants and U.S. Commerce Secretary Gina Raimondo said earlier this month that her department planned to make several funding awards within two months from the government's $39 billion program to boost semiconductor manufacturing.This is only a small part of the $1 trillion in subsidies from the CHIPS and Science Act and Inflation Reduction Act.No wonder the US economy and inflation are booming.","Everyone bailed in the US to go make stuff overseas and now we're all whining about national security like this happened yesterday. Myopic capitalist crybabies to the very end. They were stupid to move away back then, and now all we hear about is chips chips chips. Give me a break, talk about manufactured outrage. We had decades to move our stuff back, and now it's a $100B rush job? US deserves a serious economic beat-down for all of our hubris. Just watch, the price of a laptop won't budge an inch no matter what they do.","How about being generous to the people who have been shat on by the worst government ethics America has ever seen. We don't need smaller chips; phones, electronics... they're small enough, besides, we need to invest in other ways utilizing new/oldest technology that has advanced us further using less fossil fuel.High-energy frequencies are made using low voltage where frequencies make everything happen, from the function of our brains to the cosmos at every scale, scales we can't even measure, let alone fathom following the Big Bang Theory.How about being generous to education, again, if we didn't have the public, we wouldn't have any corporations. Don't use tax dollars forgiving loans greedy corporations stole, make the corporations forgive loan shark behavior.","Sure. Just require \"at will work\" be eliminated for all employees. Nonpay backs to get out of it, either. (Intel will then turn it down)",""],"points":1386},{"text":["Air Canada Ordered to Pay Passenger Damages After Chatbot Lied About Bereavement Discounts","Suddenly I'm excited about AI being applied to many, many things that just need the right input to create a binding agreement in my favor.","Why don’t they just code it not to do that? Oh, yeah, it’s a magic box that you have no control over.","I don’t get it, why didn’t Air Canada just pay for that one customer instead of letting things blow up like this. When the issue arose, they should have just brought it up to a decision maker who could have settled this while bring this issue up to the powers that be that there was an issue with the chatbot. Instead they decided to let sleeping dogs lie and screwed the pooch on this where it could’ve been settled without much ado.","“Lying” requires intent to mislead. The chatbot was just making shit up based on what it had been taught. This is what people need to understand about these chatbots. They literally do not know if what they write is true or not.","Bruh. This at least the 6th time this has been posted in the sub in the last 2 days.","I can only assume Air Canada fought this so hard because it wanted to continue using AI, while not being liable for any errors","I am not surprised at this ruling, its something that companies have to consider","How can I get informed when new support chatbots go live so I can be among the first to try to swindle it?","Sounds like AI understands how to show a little empathy better than Air Canada."],"points":436},{"text":["Nintendo shares slide on reports of delayed Switch successor release","My favorite part of this whole stupid news cycle is that the entire premise is that a console with no planned release date was delayed. That’s money-moving news now?","They aren’t ready to make the switch yet…","Shares drop 4% after climbing 20% in a single month on a delay for a system that hasn't even been officially announced yet.People eating this garbage as news are embarrassing.Grow up.","Guess they'll have to half-ass another Pokemon game...","jfc they sell millions of Nintendo Switch's every year still. The stock market is stupid","So you’re saying it’s a good time to buy shares as the price drops now? And then when the Switch successor is announced and the price soars, we all get rich?","None of these damn stock updates are ever news. This has happened before and will happen again. That’s just regular business.","“Nintendo shares slide on reports of delayed Switch successor release”Interpretation 1: Nintendo’s stock decreased after it was reported that the Switch 2 will launch later than expected.Interpretation 2: Nintendo released an image from their PowerPoint presentation about the reports that the Switch 2 will launch later than expected.","The source for this insider report is Takashi Mochizuki.I recommend being wary of his reports as he has often been wrong and his claims have been publicly denied/denounced by both Nintendo and Sony, and subsequently proven wrong by time. Bloomberg's Takashi Mochizuki is the one who reported Nintendo was launching a 4K Switch in 2021. Even though it's standard protocol for companies to ignore leaks and rumors, Nintendo went out of its way to say Mochizuki's reports were false. He's had many similar run-ins with Sony as well. Dude's record is spotty at best.","Nintendo is doing fine. I think they'll be ok. I just hope switch 2 will be as powerful as my PS4. And no joycon drift issues. My poor controllers.","Wow it’s almost as if having a product ready for release is solid business."],"points":421},{"text":["North Korean hackers use AI to up their game | Cyber criminals backed by Pyongyang turn to artificial intelligence to plan increasingly sophisticated scams","There's barely a reason for anyone in North Korea to even have access to the internet beyond China without being a state sponsored criminal, but China happily lets them do it.","Why are they still connected to the WWW?","First crypto, now this. We are really helping the North Korean government to the tune of billions.","The poor man has to steal bread to survive - and he should.","Could this be part of the reason for Bitcoin ETFs? Hedge funds buying up as much bitcoin as possible leaves less vulnerable to attacks I would guess.","You know, it would be a lot easier for them to make money as a country by just making stuff to sell and treating their own people well. Oh and also stop threatening everyone else."],"points":14},{"text":["OpenAI Reaches $80 Billion Valuation In Venture Firm Deal, Report Says","WARNING! The link in question may require you to disable ad-blockers to see content. Though not required, please consider submitting an alternative source for this story.WARNING! Disabling your ad blocker may open you up to malware infections, malicious cookies and can expose you to unwanted tracker networks. PROCEED WITH CAUTION.Do not open any files which are automatically downloaded, and do not enter personal information on any page you do not trust. If you are concerned about tracking, consider opening the page in an incognito window, and verify that your browser is sending \"do not track\" requests.IF YOU ENCOUNTER ANY MALWARE, MALICIOUS TRACKERS, CLICKJACKING, OR REDIRECT LOOPS PLEASE MESSAGE THE /r/technology MODERATORS IMMEDIATELY.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Let's all watch the dotcom bubble burst again, I guess","This is a dangerous trend. OpenAI was not created to be a commercial company where decisions are highly influenced by investors. When you are working on potentially dangerous AI initiatives this is extremely unsettling. Investors always, always choose return on investment above doing what is right.","Have we not learned about these fake and over inflated valuations from Vulture Capitalists...","Hot take: 80 bil for OpenAI is fair, they are by far the leaders in AI","There’s going to be a huge AI bubble .But 80B seems surprisingly low.","I “sometimes” wonder, where these valuation figures come from ? Just a wishfully thinking f number pulled out of the air based upon an unrealistically optimistic future scenario ?It would be interesting to see how past valuations faired post IPO.","$80 Billion for a company built on stolen data, fucking wild.","That honestly seems low considering how far ahead we constantly hear they are.","Missed that 7 trillion by just a hair","Very shy of 7 trillion","And that’s a down round from their last offering in December.","Valuations literally say nothing about practical value when people & companies are cash dumping into anything that trends.","Shows how incredibly inaccurate these are lmao","So just a little under the 7tril ask?","I use openAI every day and do about 5 people’s jobs with it.The efficiency gains are insane.","So...I think this valuation might be on the low side. Most people here don't remember when people had the same reaction about Amazon the 2000s. Of course there are absurd valuations like Uber (Tesla is not a VC valuation but trully the will of the market, so if it's stupid, it's collectively stupid), but if their proprietary LLM continue to dominate the market, they will the one of the new gafamm.","Best I can do is 3.50.","Is there even a revenue stream?","Indeed, artificial intelligence offers many beautiful and wonderful functions that are useful in our social life","80B$ of hot air, can't even write a straightforward unit test for a relatively simple code.","This is like in the late 90s when every stupid ass company got huge valuations. Hilarious.","I guess they’re still using that headless chicken valuation system we saw on South Park","If that includes the massive deadass upcoming population decline. If suddenly life just gets worse, and we go down to less than 1 billion people... That's a lot of empty real estate and leftover money and supply. After this age/era space has to be explored and humans need to colonize other planetsNext step though is unifying the whole Earth with one system, economically, politically, blah blah etcUntil then let these lunatic rich people enjoy their fake money , real life is going to get real for rich people to actually solve and participate in issues , sure they're trying global genocide hear and their but that's not ethical at all with fake wars, disease, drugs, vaccines, food poisoning, cancer, etcWhy I say? Okay, let's look at history. This is already a done deal. It's not even made up. Just look at all the past events. All those big events, especially into an illness, health and war. This is already common sense. It's just to curb the population from growing too fast because they know that we can't really handle having more people supplying enough food for billions of people and we will run out obviously of resources. Remember resources are scarce. There's no such thing as an abundance. Every planet has a burn rate of resourcesTo bring my points further in is that although there's going to be less people in the future unless we start colonizing sooner, the needs of an economy is to just be able to get people to work towards goal that other people that know what should be done and when that is done and it's fulfilled. The next step is still only keep a few people at the end of the day. It's just going to be a game of survival, kind of like the show 100.So what does this have to do with? Like AI wrapping up in this valuation. It's simple the turning point of this era is coming soon and after this A I bubble crash or whatever that new era will startThe real people in charge of this world think decades ahead and probably centuries and already have plans and you and I. We just think what we're going to eat next week or the next day or whatever is going on in our pointless jobs where we memories pointless information when we know that the world is going in a dark direction right now like who the f*** gives a s*** about if I should make this Excel formula when I know the world's about to turn into s***","If you are a current employee you are about to be fairly wealthy depending on the amount of RSU’s granted","Vesting too fast, we all saw that on season 1 Silicon Valley","Funny how much lower this number already is than what they wanted it to be. That polish is peeling off fast and the simple poo at the core of this bubble is becoming more noticeable.","I hope OpenAi combusts. And not in a good way for them.","Pepperidge farm remembers when they advertised themselves as non-profit","Undervalued."],"points":1121},{"text":["Can 23andMe be trusted with our DNA?","No. Neither is any other entity without auditable processes in physical security, data security and privacy.","Short answer: noLong answer:Noooooooooooooooooooooooooooooo","Absolutely not.","The real question is anybody to be trusted with your DNA?","Well they will soon be bankrupt! So anybody's guess where that data is going to end up! There are several employees there whose dreams of retirement have turned to ashes. It's probably going to be forcefully integrated into ancestry dot com!","No. That was easy. Next question?","Definitely not. Fucking duhhhhhhhh","Emphatic NO","No was always the answer.","Perhaps a better question, is there serious risk when our DNA is inevitably leaked? Is Gattica real?","Betteridge's Law of Headlines","It’s a company that sells a 1 time product that a subset of the population will ever only use once. Once they liquidate, people’s data are liable to go anywhere.And there is already a precedent where law enforcement used a genealogy company’s database to find a suspect because a distant relative used it. So next time you get implicated in a crime, it might be because your cousin wanted to update the flags on their tinder profile and announce on Instagram that they’re 3% NordicPeter Thiel and Palantir are frothing at the mouth right now","Absolutely fucking not","No. Don’t trust anybody with your DNA.","Hell no, they can’t. Who would even ask this question?  I’ll be pissed when I find out someone I’m related to send their dna into thst database.","Short answer - fuck no.","They’ve already proven no, even if it should ever have been trusted.","Only a fool would send their DNA to these reckless companies.","I audited 23&Me and it doesn’t look good: 90% of the data indicates the people who do this are attention-seeking twats","Never again. I destroyed my sample with them.","Nope. I wouldn’t trust any of those companies.Sometimes I really regret doing Ancestry… basically, if I ever leave any DNA behind at a crime scene, I’m totally fucked.Gods only know how many times my genetic profile has already been sold by this point…","No. They won’t even let me delete my data.","The cure for cancer is in my duh-nuh.“Um, I think it’s pronounced D. N. A”Don’t tell me what I know Travis!","no company can be trusted with your metadata or dna, they exist to make profit first and foremost and you are the product now","What's there to be worried about? Cloning? If you commit violent, or sexual crimes, then you should absolutely worry. Outside of that, it's not a big deal.","It'll eventually get integrated into the corporate military industrial complex and become part of your identity access by the panoptic system being erected right now.","Why not ask a better question such as how much money do they make from selling your data and to which institutions are they selling it to?","If they don't have your data, they can't do bad things with it. If they don't have your data, they also can't make good things with them.Whether you are scared of them making a genetic virus that eradicated your family line or find a cure for a genetic disease that saves your family line, is uncertain future with only your personal bias determining what you believe in.If you're right, you'll tell people you knew it all along and how everyone else was too gullible or paranoid, because they are idiots. If you're wrong, people will tell you that you were too gullible or too paranoid because you are an idiot.Either way, you've all just been guessing....","No. they are going to share it with gov agency in case of something.","Fuck no. The fact that this was allowed to be an actual company without any guardrails or stringent safety measures in place the way any other medical facility would is maddening and is indicative of the incompetence that exists within government due to representatives and congress people not being replaced with younger generations.This is not a knock on age. But it is a knock on their IT and other such STEM knowledge. Governmental agencies that deal with this shit aren’t allowed to regulate and it’s only getting worse.","I asked them to delete my data after I used it, many years ago now. I wonder if they did?","Nope, not based on their track record.","Can any company or government be trusted with your data? Especially your biometrics.How is this even a question?","Think it through.If you want privacy,Don't give them your real nameMake a new email address for correspondenceGive them an address that cannot be linked to you.Use a VPN or TOR for browsing the data about your sample.You have still given them a sample of your DNA and fairly broad permission on how they use it.When they process you sample they will have all kinds of genetic info about a random person.Remember that using a credit card gives them all the info you don't want them to have.","Short answer: noLong answer: noooooooooooooooooo","So I have been thinking. I was fingerprinted a few times over the years for non criminal purposes. Mostly background checks. These were done by sheriff office but I left with card and then card was submitted for government clearances and other background checks. Would those be stored in some database somewhere that could be used to identify I left a print somewhere incriminating. Asking for a friend."],"points":248},{"text":["Speaking in a local accent might make social robots seem more trustworthy and competent, say scientists","That Australian robot sure swears a lot.","Southern US Robot: \"The bank is fixin to close for Juu-lie the fourth\"","I'm from appalachia, please do not do this here.","OH NO... JERSEY KILL BOTS!!!","As a Californian, i want my robot to speak valley girl.","or you get jiggle billy","Everyone loves that yung uncanny valley.","Key word here, “seem”… I’m not sure trusting AIs is entirely a good idea at this early stage.","Water is wet.","I college I did telemarketing. We called a lot of customers in Texas and after awhile I got pretty good at mimicking the Texas accent. I started using it in my calls and my sales went up. So whatever they paid for this survey they could have done asking telemarketers.","I cannot wait for a roomba speaking scouse to me"],"points":37},{"text":["Study featuring AI-generated giant rat penis retracted entirely, journal apologizes","So basically the authors were trolling, one of the two reviewers took the rule \"AI images are acceptable\" too literally (i.e. even if the images are false or irrelevant), while the other reviewer did raise the alarm marking the study as needing author review, but journal published it anyway after authors didn't respond to the review request (because authors were trolling I assume). Problems at several levels here.","the giant rat penis retracts. journal apologizes.","Retracted paper featured dissected dick and balls with labels such as “iollotte sserotgomar cell” and “testtomcels”, generated with AI Midjourney:On Thursday afternoon, Frontiers added a notice saying that the paper had been corrected and a new version would be published soon.The journal later updated the notice to say that it was retracting the study entirely because “the article does not meet [Frontiers’] standards of editorial and scientific rigor.”“Our investigation revealed that one of the reviewers raised valid concerns about the figures and requested author revisions,” Frontiers’ statement reads. “The authors failed to respond to these requests. We are investigating how our processes failed to act on the lack of author compliance with the reviewers' requirements.”Science integrity consultant Elisabeth Bik wrote on her personal blog that it was “a sad example of how scientific journals, editors, and peer reviewers can be naive—or possibly even in the loop—in terms of accepting and publishing AI-generated crap.”","John Oliver better be on this","Given the academic pressure to publish or perish, the reliance of journals on unpaid experts for reviews, and the profit motives of journals, this is not a good sign of what’s to come given the expanding use of ai.","Dissilced dck","\"The paper was authored by three scientists in China, edited by a researcher in India, reviewed by two people from the U.S. and India, and published in the open access journal Frontiers in Cell Development and Biology.\"Crazy that it was attempted, and that it was successful. Everyone involved should be blacklisted from academic publications.","This should be a regular thing done to journals regularly to smoke out ones with horrifying low peer review standards","https://www.theguardian.com/science/2024/feb/03/the-situation-has-become-appalling-fake-scientific-papers-push-research-credibility-to-crisis-point","The rat dong in the picture is like twice the size of the rats body lmao 🤣 I am dying over here","We are heading towards a massive cluster fuck because all these organizations and companies are using these ai black boxes developed by a completely different organization to do real shit. I can't believe none of these money grubbing piece of shit ceos can't put 2 and 2 together and see where this is headed.Honestly though as a peasant I'm looking forward to it. They deserve what's about to happen. AI isn't going to be capable of even customer service for at least 5 to 10 years but they are laying off their entire workforce already. Already an ai promised some discounts for Canada air and a court honored it.I look forward to it","Giant rat cock. Awesome!","The article was premature","”The embarrassing incident is an example of how the issues surrounding generative AI more broadly have seeped into academia, in ways that are sometimes concerning to scientists”No, this was not an example of how issues surrounding generative AI more broadly have seeped into academia. This was an example of how the review process is broken and even reputable journals like Frontiers fail to follow due process. The paper was not only retracted due to the images being unaccurate and non-sensical, but due to disrepancies and issues in the scientific contents of the paper. The use of AI is not an issue as long as a) the reviewers do their jobs and b) the journals do their job of ensuring that what gets published meets the scientific standards of both the discipline and the publication. You can write pseudo-scientific crap or faked evidence with or without AI. It doesnt matter what tools you use; the due process is responsible for catching those mistakes. And frankly, as it stands, the whole academic publicarion process needs a reform.","Stewart Little that is not","That’s a r/brandnewsentence I’d rather not read again","I am Viagra happy to know about the withdrawal, I mean retraction.","I wholly blame the journal on this one. Ffs they totally failed to do their job","🎶🎵retractable penis🎶🎵","Authors were Liang Dong and Xinyu Guo. Not joking.","Giant Rat Penis would be a good name for a punk band.","Stand clear of the closing doors. Giant rat penis retracting.","When rat dick is outlawed only outlaws will have rat dick.","So, I can’t even publish a paper about giant rat penises without getting retracted? Thanks science. Thanks a lot.","That poor penis, it was doing so well. Beanstalk like.Seriously, they have nothing to apologize for, we all had a good laugh.","Giant Rat Wenis","The dark reality is that there are many scientific articles submitted to peer reviewed journals that are totally bs","So now people are willing to fake research papers for a chance at a doctorate?","Wtf, how did they not think it was weird, says a lot about the researchers lool","Very stupid headline.","Definitely had to re-read that title 3 times 🤣","Apology not accepted!","The vice article was almost written by Jordan Peterson.","Please tell me this was an Onion article","r/nottheonion","That’s a strange thing to train a network on","And nobody is mentioning the fact that this publisher just laid off 600 staff because: \"The reason for the job cuts is the shrinking market for scientific publications and a significant increase in fraudulent articles. This prompted Frontiers to develop a tool using artificial intelligence, and as a result more articles had to be rejected\" https://www.swissinfo.ch/eng/business/frontiers-cuts-70-jobs-in-switzerland-and-600-worldwide/49137976 Yeah what an effective tool...","Guess no one wanted to be the guy to point out the rat’s penis was ‘too large’","I want the name of the U.S. reviewer of this study. The purpose of peer-review isn’t to say it’s good to go without any critical analysis of the subject matter.","Great username: A. I. Ratpenis","Rats do be packin'","Fun fact this highlights how much we actually don’t know, who knows if all the illustrations we’ve seen for years before were any good, yet we’re taken for truth at face value. It’s over, a new Information Age has been brought into light or truths have to be personally experienced/proven/ lived etc","Call me when they write a story about a rat with a giant detachable penis. A song might be appropriate too.","That's too bad, I was planning on voting for giant rat penis in November."],"points":1879},{"text":["Modeling shows green roofs can cool cities and save energy","Always thought this was pretty obvious","Surprised this isn’t more common place in big cities.","Very functional as well. And added bonus, it looks cool (imo).","Lots of work on this in Chicago:https://www.chicago.gov/city/en/depts/dcd/supp_info/chicago_green_roofs.htmlhttps://www.midstory.org/a-garden-in-the-sky-chicagos-green-rooftop-revolution/","Rooftops are fantastic places to install a community garden, which would also much improve the health of residents. The combination of physical activity and better quality food would almost certainly reduce depression rates.","I could swear we knew this decades ago.","What are the benefits of just painting roofs white?","Green streets as well. Trees. More of them.","build denser, have more greenspace and less asphalt and then you won't need structure-compromising gimmicks like green roofs. Cities don't need to be nature, they need to be compact enough to allow nature to be nature on its own.","Plant native gardens up there.","I would be concerned that the green part of a green roof prevents the roof from drying. I would be worried about water damage, mold, and wood destroying pests going undetected. When a green roof needs to be repaired or replaced, what is the up-charge over a code roof?","So why the F destroying forest in the first place?","Where will the helicopters land? Surely we cannot inconvenience our lords in their own fiefs?","The jobs that would come with his sort of thing would definitely improve the economy!","Easier to just make it so we must paint our roofs white. Green roofs are nice but so many insect, water, and mold issues are surely to follow over the years. White roofs and low-e windows mandates for all large buildings gives you most of the benefits without any of the drawbacks.","I’m sure they’re all going to be these perfectly manicured paradises and not weed-infested roof fields that start a whole ecosystem on the roof of local businesses, right? Right?","And nothing will come of it...I have to say though, logistically, can you really just add a garden to the top of a building. Like is it feasible to add that much weight?","Hey, I’ve seen this one before!","My roof is covered in moss so I am ahead of the curve for once.","factor in the carbon footprint of the maintenance and it is another story. if you want to cool your city, sure, but the combined resources (money, man-hours) of fixing all of the roofs will end up with a situation where everyone could have just paid someone to plant trees elsewhere and build solar farms.source: home owner with flat roof. you wouldn't catch me dead putting anything up there. any object on the roof will create a leak in the long term.","Helps get rid of that concrete jungle feel","Annoying for people who studied green infrastructure in school, cause there’s so much research proving it’s HUGE benefits just takes to long to acknowledge and implement","I wish every city had a rule that roof top gardens were required of buildings.","But where will the solar panels go!","Seen a lot of this in Tokyo!","Every single skyscraper should have photovalic cells for windows and a green roof with a turbine and they would all be energy independent","Honest question. Whats the opinion on the water use this would require? A lot of cities are going without green yards or moving to natural flora to preserve water. Having a ton of gardens to water seems like a move in the opposite direction, no?","I live on a high floor with green roofs around me in my area, it looks so much better too. The non green roofs look like shit in comparison. No maintenance either. Whatever they plant is super hardy and perennial."],"points":336},{"text":["Amazon — like SpaceX — is the latest company to claim the U.S. labor board is unconstitutional, after receiving numerous labor complaints from employees","I interpret that as \"I don't want to deal with it and I have lawyers on staff.\"","Amazon claims the U.S. National Labor Relations Board (NLRB) is “unconstitutional” in a new legal document filed on Thursday, according to a report from The New York Times:The e-commerce giant joins the Elon Musk-owned SpaceX in making similar accusations after facing numerous labor complaints from employees.Amazon made the filing in connection with a 2023 NLRB case, which accuses Amazon of breaking labor rules by threatening and discriminating against unionizing workers at a Staten Island, NY warehouse, the NYT reports.In the filing, lawyers for Amazon argue the company hasn’t violated any rules. But, as noted by the NYT, it also adds that “the structure of the N.L.R.B. violates the separation of powers.”In other words, Amazon is claiming that the NLRB has too much power for a single entity because it’s capable of creating rules, investigating violations, and determining whether a company broke laws.","They’ve made gobsmacks and monopolized the markets under the current, already weakening status-quo of U.S. labor standards, and; now, they want to make even more off the backs of their workers. If you think peeing in your Gatorade bottle, because you can’t afford to take breaks was bad, just wait until they strip themselves of recourse.The U.S. didn’t just get working rights or protections off the bat. Everything was earned through solidarity, blood, and the demand for better. It’s a shame we’re splintered.","Ohh my, it’s really bad for a big company that they can not get away with treating people like garbage. Let’s put the lawyers on the labor board. Wtf is wrong with Elon and Bezos, tax them to hell where they came from.","the US is truly a rich people playground and a normal persons absolute hellhole","Tax these fuckers and implement ubi, free education and programs that help communities.","There’s no limit to how many people the rich will shit on to become even richer. And the richer they are at the start the more frantically they shit on others.","Billionaires and monopolies aren’t constitutional either but hey","They want us all to be serfs.","I guess corpos don’t care for history.        Pissed off factory workers used to get into shootouts with their employers, it was pretty bloody. It’s one of the reasons the Pinkertons existed, they would patrol factory floors armed and were known as union busters.    Either way, if corpos continue their pursue of blind greed it’s going to get bad for them no matter what the laws they paid for say.","Ever wanted to know what the end-game was for why Republicans are bad for America and dont care about you.....THIS is it. They never cared about your faith or any of that shit... they just want to reverse all the progress made in the last 100+ years of labor fairness and put us right back into the robber baron days of Triangle Shirtwaist fires every 2-3 weeks and 12 year olds working 13+ hours.Its not even a secret goal either, they have been telling you that the rich have the right to enslave the poor for decades now...","Yes please force labor unions to become radical, illegal, and militant again.","Well as long as we're labeling things, Amazon is unconstitutional.","Amazon is claiming that the NLRB has too much power for a single entity because it’s capable of creating rules, investigating violations, and determining whether a company broke laws.Lemme get this straight.A company (well, a couple companies if we include twitter/spacex/tesla's fella as well as Bezo) that is owned by a person that owns like 3 enormous companies are making the claim that the NLRB has too much power for a single entity.But it is perfectly fine for a single person to own multiple companies?I realize it is different issues, it is just funny sounding to me.I wonder if it would destroy capitalism if we made a law that one person can only own one company (ie. musk, bezo...) and/or one company cannot own other companies. (ie. nestle, coke, unilever, kelloggs ect.) I mean, i wonder if banning such monopolies would make prices go up or somehow fuck everything up for regular people.","I love how everything is a constitution issue now. Copywrite isn't in the constitution, so it is therefore unconstitutional. Billionaires aren't in the constitution, so they are unconstitutional. Etc.","Never heard someone have a good experience at Amazon. But boy was I bummed getting rejected after 6 hours of interviews. 300k salary + stock and bonuses is obscene money tho, and the lower level people don’t have much of a choice. Seems like everyone hates working there but either have no choice or they feel like they don’t have a choice cause of those golden handcuffs","They're straight up going for the throat of unions. Break these companies up and literally drag the boardmembers through the streets","Prior to the creation of the NLRB, strikes were regularly violent.","It would be nice is anybody was able and willing to discuss the legal merits of the case and its chances of success.A hundred comments about how awful Amazon is really are not very interesting.","Imagine operating your business in an ecosystem where people are being underpaid so badly that they are working a 40 hour week and still can’t afford to live and still claiming labor laws are too powerful.","I hope to fuck they all get shot down hard... otherwise we're in big trouble.","Make Unions Great Again!","They're like...uh...impinging on their free speech to like...totally exploit the working class, man....totally uncool like....they totally deserve to exploit them dude....didn't they pay them politicians off man ????? What's the deal-o???","I just placed my LAST Amazon order. there ain't no spoon long enough to sup with that devil. done.","How dare our government protect citizens","Greedy Bezos can GFHI don't get these freakishly rich fuckers being so cheap! When is enough, enough!","This is only possible for having such a shit Supreme Court.","which is why it’s unclear why companies like Amazon and SpaceX are specifically targeting the NLRB for violating the Constitution.Because those other things aren't being used against them? Just spitballin' here...","Strive to be Earth’s Best EmployerLeaders work every day to create a safer, more productive, higher performing, more diverse, and more just work environment. They lead with empathy, have fun at work, and make it easy for others to have fun. Leaders ask themselves: Are my fellow employees growing? Are they empowered? Are they ready for what’s next? Leaders have a vision for and commitment to their employees’ personal success, whether that be at Amazon or elsewhere.https://www.amazon.jobs/content/en/our-workplace/leadership-principlesUh huh… guess they will be removing this LP any day now.","Also Trader Joe's. Don't forget Trader Joe's.","The current situation in the US more and more resembles the picture Soviet propaganda painted some fifty years ago.","Nobody cares. If we did, then we’d be willing to give up the connivence of Amazon.","As someone that was “layoff”due to having a racist manager, i think we need more support from the government.","Class consciousness must be the message. Always remember that these companies would pay you in scrip if they could. We cannot give them an inch“Its a big club…and u aint in it!”- carlin.","The start of Corporate command. Front and center, not behind the scenes. Governments are no longer needed. Serfs,peasants,slave labor and the complete removal of freedom to pursue your dreams.","Sounds like it's time to start using anti trust laws on the books....","So no regulatory agency can enforce its regulations when a company fails to complies with them??","This would get around every single labor “problem” they have. If they just get rid of the body that enforces the rules then they can do what they like.","Them winning would be a huge step towards that corporate ran, slave-based dystopian future.Next on the chopping block if they win: Minimum wage.","Amazon is claiming that the NLRB has too much power for a single entityWell thats just the pot calling the kettle black!","What a douchebag of a company Amazon has become.","The NLRB makes organizing unions more difficult. Its existence encourages workers to rely on lawyers, administrative systems, and ultimately the Democratic Party, instead of their own power. Look at the result of the Railway Labor Act--allowed the great \"friend of unions\" Joseph Biden and his party to screw the rail workers.","Why is The Consititution referred to whenever someone wants something awful?"],"points":1670}]