[{"text":["Longevity enthusiasts want to create their own independent state, where they will be free to biohack and carry out self-research without legal impediments.","The following submission statement was provided by /u/lughnasadh:Submission StatementIf you repurpose an oil rig in international waters and call it a sovereign state, does it exist as such if no other countries recognize it ?Say some biohacking in international waters goes horribly wrong. I'd imagine the people involved would still face legal penalties under the laws of the country they are citizens of. They could certainly be liable and sued for damages in their own countries' jurisdictions.I'm all for speeding up longevity research, but the idea of creating your own \"state\" seems like a libertarian fantasy.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1aut6vm/longevity_enthusiasts_want_to_create_their_own/kr5xuzq/","There was a hit 2007 FPS game with a similar premise.","Pros include removing limitations holding back research in some fields. We've seen this with the war on drugs causing lack of research into psychadelics for the treatement of mental health conditions.Cons include poor evidence practices. Trial and error on a single individual won't help solve anything or prove anything. They'll require large groups of well formatted studies to show any useable evidence to back up claims.My main concern for this is it's being promoted by crypto currency advocates and crypto is extremely volatile. If this was being promoted by individuals who know the science and have a background in clinical trials but are currently being restricted by certain legal or bioethical limitations that could be overcome by consent of participants in a reliable way, then I'd be a lot more supportive of this type of initiative.","Opening up shop for biological and genetic experimentation in the middle of the ocean may present and ecological hazard.I say we give them the desert, instead.","Astonished at the amount of people saying \"go for it\" as it wouldn't just end in a bunch of human trafficking","Health researcher here, I work in aging. These biohackers and self-researchers will continue to affirm why we should stick with concepts like careful and rigorous study designs and large multi-year randomized trials. Not saying there aren’t issues with current approaches but far better than self experiments.","If this is established, I believe it is likely there will be a flow of economically coerced people travelling there, to be medically experimented on.There is immense hubris in the ultra wealthy trying to attain immortality while the poor are dying prematurely from preventable disease, hunger, and violence.Even if they are successful with these developments, someone could still remind them of their mortality. (insert Arnold Arnold Schwarzenegger quote from Predator - \"If it bleeds....\")","I think I know a guy who knows a guy that can engineer you a whole undersea setup for this in the north Atlantic. It will probably be fairly high maintenance, but I'm sure once you have everything going and your researchers funded, nothing could possibly go wrong.","Submission StatementIf you repurpose an oil rig in international waters and call it a sovereign state, does it exist as such if no other countries recognize it ?Say some biohacking in international waters goes horribly wrong. I'd imagine the people involved would still face legal penalties under the laws of the country they are citizens of. They could certainly be liable and sued for damages in their own countries' jurisdictions.I'm all for speeding up longevity research, but the idea of creating your own \"state\" seems like a libertarian fantasy.","“[Food and Drug Administration] requirements force individuals or companies to conduct rigorous scientific research to demonstrate that the claims they’re making are, in fact, supported by scientific evidence,” she says. Without those, we’d end up in a world where companies can make up any old claims about their products, she warns. We wouldn’t know which would work, and people could lose trust in the field more generally.Amen. The pursuit of health and longevity can lead to self-delusion. I've read many times \"this dumb thing I'm doing to my body will keep me youthful for 200 years.\" So far, it hasn't worked, and a lot of those people are dead now.","I say go for it, more guinea pigs for the rest of us. Let people potentially put themselves in harm's way for science if they want to.","Place you bets! How long before herd mentality leads them all to pick a popular idea for longevity that actually just messes them up?","Who cares. They already do this without people knowing, why even broadcast it?","pretty sure this is how most zombie horror movies begin","I kind of want this, because it could lead to some amazing advances in biohacking, including longevity and resistance to disease. But I also really don't want this because it will inevitably lead to egregious human rights abuses and possibly the zombie and/or grey goo apocalypse.","Man, I wish I had the experience needed to con these wealthy swine.","We should encourage them, let them be the new explorator/gynae pig of our time.","Let them! But make it a cold island in the North Pacific, far far away from me!","Do you want Big Daddies? Because this is how you get Big Daddies…","I'm sure they will do a great job of screening out the fanatics who want to experiment with Anthrax.","We can call it Ivermectin Island. Elon Musk can have a volcano carved out for Joe Rogan to podcast from.I like the idea of medical science. I also like them experimenting on themselves. I don't think these two things are the same.","There is a small island just off the coast of Ireland that I would like to sell them....","That sounds like it's gonna be really far from \"Longevity\", sounds like a lot will die early","Ironically, this'll be a great example of natural selection in action but not for the reason its supporters intended.","I always thought that was the one application that might make sea steading in international waters profitable. Unrestrained medical treatments.","Who knew The Island of Doctor Moreau would turn out to be prophecy?","Make it the moon or mars so it can benefit humankind","What's wrong with medically experimenting on yourself?","Why do you need to create a new independent state to do any of this? How is that better than greasing a few palms or setting up in a low income country?","Well, you could try. But remember, if people are being taken there against their will, or being experimented on against their will, or being killed there all bets are off. Any number of Navies and Coast Guards would happily board your \"sovereign state\" at gunpoint and arrest everyone in sight. You are not above the law just because you say so, everyone else on the planet has to agree with you. As long as everyone on board is an eager and willing participant you could get away with it unless you start endangering those not on board. By dumping hazardous stuff overboard for example... and remember its the other people on the planet that get to decide if what you are dumping is hazardous or not, not the people on the \"sovereign state\".","The thought cracks me up for some reason. I'm imagining a state full of people who weren't quite so crafty of biohackers they thought they were..I'm imagining Kyle's dad as a dolphin. I'm imagining a state full of them.","We could probably fit all of them in one condo complex. Just isolate them there.","While I do believe there are unfair barriers to longevity research and action (for example you are not allowed to be cryogenically frozen until after death is pronounced, but by then severe degradation is likely even if you are rich enough to have a doctor and the cryo team sitting at your bedside for possibly weeks.that being said, sounds pretty silly done like this, seems like it'd be easier to get a zone in a recognised country to do it in for starters.","Somehow \"Longevity\" and the epitimy of \"They did their own research\" doesn't seem to work in my mind.","O yea I totally believe these people will stop or even start the experimentation on themselves /s.","Good, it's wild how many limitations we have to deal with in regards to science. Pearl clutching religious people banning stem cell research funding and usage.","What's little st James being used for now days? Probably some facilities overlap you could leverage"],"points":196},{"text":["Could AI technology introduce synthetic “time travel” capabilities?","That’s a really over complicated way of asking if you’ll be able to visit ancient Egypt in VR.Already theoretically possible and fidelity of the simulation will increase rapidly with time.","I'm sure if you smoke enough weed, you'll think anything is like going back into time.","I think this is very dismissive of the concept of time. It's like saying that if you are watching a movie it's traveling back in time. Maybe after enough shrooms you can totally feel like you've \"been there\" but I really doubt it.I also don't really understand what your point is for AI in this. What role does AI play here? This seems more like a VR item than it is AI.I don't know how much MJ you smoke on a daily, but if you feel it may be influencing your health and personal relationships you should definitely see a licensed professional to help you. If it's just basing on this post, I just think you are conflating different sets of technology and confusing immersion with time travel. You could do worse without any substance use.","It's not an issue of AI but an issue of immersive VR.","I just wanna get sloppy in the metaverse fuck history","Dunno what salt c u next Tuesday downvoted your thread. I think time travel could be possible even in this reality if it operates on a layer base, travel back in time, overwrite the layer, no paradox, like a computer file system.","This will definitely happen within 5-10 years time","lmao. holy phuck. you guys are beyond the pale. ai is \"wrong answers only\" its a regurgitation bot. Nothing else. No it wont solve any wordly mysteries. But it will be great for curving elections!","Dude, you can basically already get that with video games, check out Assassin’s Creed’s exploration mode, they’ve been adding since Origins","As I age, I think about this concept a lot. The thing is, I think there will be more of a market for time periods that existed within our own lifetime, or just before. Thanks to nostalgia, many people would eagerly travel back to a (idealized) simulation of the decade they grew up in, especially as our contemporary world grows measurably crappier and crappier due to climate change, politics, etc.There are channels on YouTube that recreate Saturday morning TV programming from the 80s (ie when the three US networks aired cartoons for kids), replete with the same commercials of the era. Virtual reality will scratch this same itch. I think it could become quite addictive, especially if you add seasonal DLC like Christmas or Halloween.","Unless it allows me to go back in time and burn every generative AI company before it gets big, then I don't want it","I think you just described a cool concept for a VR game. I don't think it's that far from getting AI integrated into the video games, as there was a demo of this already by integrating it into NPCs that can speak naturally with you and even curious about your behavior as it will keep tabs on you like a real person would.","In the back of my mind, I would know that whatever I am seeing is make-believe. We don't know enough about little-people history to create a full environment of day to day living.If I wanted to attend a festival at stonehenge, what could it show me? It would be made up, guesswork, since we don't know enough about what happened there to train the AI.Not enough data.","Check out a show called Devs on Hulu, it's an 8 episode miniseries. It's hard to describe without kind of spoiling it, but it's probably the closest thing you'll find to this concept but to answer your question not realistically achievable in our lifetime.","Not really. You could build a simulation based on our theories, but it would be no more accurate than you could build on your head by studying Egyptology.If you read SF you might like The Light of Other Days which explores a fictional technology that makes this possible.","This is kinda sorta the plot to the movie Source Code, it's basically the premise behind The Matrix, and it's the final scene from Lucy... so not too crazy of an idea if you're making a sci-fi movie.Like others have said, this is something we're already doing now with VR and video games, but those are mostly complete fabrications, and certainly the visual realism will get better in the near future. The real challenge is making a high fidelity simulation that approaches reality, not just in terms of the feel of the simulation but in the accuracy of people and events. This is probably inevitable in some ways and impossible in others.Take a simulation of the future: people can be predicted by algorithms, so with more complete algorithms and modeling, future behaviors could be extrapolated out to as many years and with as much detail as your compute allows.Simulating the past would get more and more hallucinatory the further back in time you go because of the lack of good quality data to build the models on. Maybe we could do a fairly realistic WW2 simulation, but ancient Egypt could probably only have an accurate simulation of the landscape while the people would be totally made up. Many things are simply lost to time.","I just want to go back in time to bang young Dolly Parton and/ or Jamie Lee Curtis but I'm a simple man","At some point, we will have the tec to be able to immerse ourselves in VR. It will be indistinguishable to the real world. Going in to the past will not be a problem."],"points":44},{"text":["In the same way that the 1990s witnessed a revolution driven by the internet, mobiles, and personal computing, what's your take on the new era emerging with AI, blockchain, and spatial computing?","What the heck is spatial computing? And what is blockchain doing","I can’t take you seriously after including blockchain in a list of things that matter.It makes you look like a shill.","The only thing blockchain has revolutionized is scams.","It depends on the US Anti-Trust regulations and if we continue to allow closed markets. (platforms)Capitalism works best when markets are free with low barriers to entry. Current digital markets create artificial “high barriers” to entry.Obviously all the tech companies will say “anyone can sell on the internet. We have tons of competition.” But every consumer in the US can tell you they don’t have pricing leverage on many goods and services right now.Will AI, blockchain, or spatial computing impact this environment? It’s doubtful. Blockchain had a sliver of a chance with smart contracts and other decentralized concepts, but it seems to large the convenience to scale.AI & Spatial computing will be controlled by the existing giant tech companies. I don’t see that increasing competition.","As wild as AI is, the new advances in medicine are wilder. Organ printing, cancer cure vaccine, dna and rna editing, possibly immortality, and organic monitoring devices are just the start. Never having to worry about health is possibly on the horizon. That brain chip being able to backup our brain with 3d printed or grown organs makes altered carbon realistic. When you add in AI, I can’t imagine that reality as I haven’t seen anything in science fiction to come close to the possibilities I can think of.","As others have said, spatial computing is something which people have been trying to get off the ground for decades, and it's no closer now than it was then. Blockchain is a solution in search of a problem.However, I'm confidently expecting that, for all the good AI can do with things like medical diagnoses and suchlike, its negatives are something which the human race is completely unprepared to deal with. Social media will become, and perhaps already is being, overrun with bots, to the point where we become spammed with false content that will overshadow actual content we wish to see. There are a huge swathe of jobs which can and will be automated out of human hands, and corporations will not shy away from doing so at the earliest opportunity whatever the social implications of doing so, and humanity is not prepared for the fallout of this. Deepfakes will make audio and video completely untrustworthy, and I suspect we'll see that impact elections for the first time this year. While AI can help discover new compounds and medicines, it can also do the same for viruses and poisons. And the prospect of AI weapons on our streets is downright terrifying.I don't think this is just baseless doom mongering. I'm normally very tech positive, but this is a quantum leap we just aren't prepared for.","ai is merely the end of privacy as you know it. blockchain is the end of financial privacy {you know your ledger is public domain, right?} spatial computing....more buzzwords. Sigh. This is just you being sold on communism. You get that, right?","Honestly AI is probably going to be the single most important invention to humanity. Here's why:- It will help us develop other technologies much faster- It will create even more powerful AIs- It will allow us to advance way faster than without itAI is so important to our future out among the stars.","Blockchain will only really change your life if it starts being accepted by the government to bolster local direct democracy and introduce transparency to government spending.Everything developed there now is turbo wallstreet neoliberalism which, reasonably, nobody wants to really participate in.AI too has the best low-hanging fruit in reducing bureaucracy right now.VR's top usecase is basicaly porn, then 10 empty spots, then interior design.","AI generated visual media is a paradigm shift for visual digital creators A whole industry is going to be wiped out in the next few years. Not only because of the heated debate about jobs being lost right now but also how it will disincentivize people into starting a multi-year career in the arts.On the other end, If you zoom out in time, there might be a resurgence in physical creations and techniques. I believe there's going to be more and more people leaving their computers and tablets away and going back to atoms like in painting, folding paper, cutting wood and specially thinking and writing about their work and process.LLMs will have a huge impact in how brands and organizations speak to us on the web. A few more years ( or months) of LLMs and Chat integrations and we'll see a decline in visits to websites and a huge shift in how we interact with organizations online. This comes with the advantage of messaging as a widely adopted technology worldwide. From the richest to the poorest will be talking to an AI without any new skill or technology needed.I believe AR/VR/XR it's going to be a paradigm shift. I thought it was going to get huge when the Quest 2 released at an affordable cost. Then it kind of got stuck. The fad these days is more related to the Apple brand effect but while AR/VR/XR is not an affordable technology mobile devices for the so called spatial computing will be just another fashion trend.One last thing is that sometimes we talk about innovation in technology and then we focus on computer-based innovation. There are other technological fronts that will have a wider impact in the next few decades especially those related to creating and storing energy. Sustainable food production is key and also those focused on stopping or at least slowing down the ecological collapse during the ongoing Anthropocene.Edit: Typo.","To really reap the rewards in the pipe - requires dramatic social-economic evolution.We will easily have the tech and the means to essentially eliminate human strife AND improve the environment - GLOBALLY, but it would require an evolution of our economic model, to not just accept, but embrace more socialist policy.We could reduce the work week to 4 days, and still provide for everyone - AND still allow those that are driven to work harder, more, smarter to be rewarded with wealth - just not the wealth disparity we see today - and not wealth built on the backs of human suffering (healthcare, food security) and destruction.These techs all represent a form of power - and this power, in the hands of the haves in our overly free market, will just be exploited to benefit the few.","Imagine evolution but trillion years of evolution. That's how it will start for artificial intelligence.","Computer programmers already use AI as a tool to get more work done faster. It looks like this is going to spread to law and many other professions to enable workers to work more efficiently.","Its all gonna come together in a glorious or horrific way."],"points":46},{"text":["Should manned spaceflight focus to establish in LEO and geostationary orbit?","I think the difficulty we face is that we haven't yet reached the sort of moment that Europe did when it realized it could reach Asia by ship. What's the big economic driver that will shape future space travel? Beyond a bunch of satellites for servicing demands here on Earth, I don't think we've found one yet.If it turns out that asteroids can be mined cost-effectively then we won't stop at Earth orbit, and that orbit will just be servicing stations that interface between going up and down to Earth and going out to target asteroids. But will that ever happen? Certainly not in the near term.Other than just being easier, why would we build habitats in orbit? Because it's cool? I agree it's cool, and for my part that's enough, but even there, I don't imagine there will ever be more than small amounts of funding available unless there's a big political or economic driver that convinces countries (not just here in the States but everywhere) that they have to either do it quickly or be badly left behind.","Until we master small-setup fusion generators to create high-magnetic fields to shield astronauts, yes, I agree with you.","no how much it pains me teleoperating on the moon is the best way, robots are getting advanced enough and do not demand return tickets. to what purpose you ask? beamed solar power both for electricity to earth and beaming propulsion for probes exploring the solar system.LEO has its uses for 0g manufactoring like organs and zblan but the cost of having a human should be calculated harshly.in short mznnend spaceflight should focus on unmanned spaceflight for a higher return on investment","Nothing else matters but cracking the surface-to-orbit bottleneck. The hardest part is climbing out of the well and bringing enough stuff with you to do the really interesting parts. Once we reuse the whole launch system there will be no limitations to having to hang out in LEO, you could go where the water is."],"points":3},{"text":["An advocation for the feasibility of Mecha robots","Why tho? Are you fighting Kaiju? Life is not an Anime. There is no advantage to giant robots over conventional weapons.","I think it breaks down to if physical combat is needed vs agile weapons range platform.Which in space might be more reasonable but still I think the GM Ball is still going to have superior maneuverability and better for weapons attachments"],"points":7},{"text":["What's the most useful megastructure we could create with current technology that we haven't already?","Large space-built craft. The international space station was built piece-by-piece and if we wanted to build an absolutely gigantic ship (or living quarters) for human transport, it would be better to build it in space than try launching an absolute unit","Since the 70s and 80s the great innovations have been in modular manufactured products like solar panels, electronics etc. These technologies can more effectively take advantage of global value chains and international competition.There has not been a proportionate increase in awesomeness of megaprojects imo.","Not so much a megastructure as a mega system, but a national transit system that doesn't rely on individual vehicle ownership. 1) Full coverage public transit in every city over 1 million people. Heavy rail, streetcar, bus, bikeshare systems that run through dense business, retail, entertainment, and residential districts. 2) Suburban transit hubs for express access to major city centers. 3) Rail lines connecting city centers to their closest neighboring cities. Chicago - Milwaukee, Orlando - Miami, etc. 4) High Speed Rail connecting long distances on high demand routes. NYC - Chicago, LA - Atlanta, etc.","I think with current technology we could probably build a base on the moon. It would be crazy expensive obviously, and require the cooperation of multiple developed nations on the same page, but it doesn't seem beyond our abilities.","Giant geothermal plant over yellowstone. Nature be damned. It would provide all the energy needs we need while making the geothermal activities under yellowstone more stable by venting off the heat before it can build up","Good ol' english channel mega dam from british isles to mainland europe. No seriously, sea walls would probably be a useful megastructure.","O’Neil Cylindershttps://offworldindustriescorp.com/The teamos over at r/isaacarthur have a lot put together on this.I was surprised to see how many ideas from the 50s and 60s got put on ice until recently.We really are living in magnificent times. Turn off the news, put a team together and start pitching for capital. The money is out there and interested in gettin things going.","Mega carbon capture - something that takes in ambient air and produces drinking water and carbon for construction.Something like a space tug boat that can intercept (or fetch) asteroids and bring them into orbit. Followed by the mining equipment to strip them down into useful materials and freight them to the Earth or lunar/orbital manufacturing stations.","Fix all factories which directly or indirectly put plastic and other garbage into the oceanFilter all riversClean up the oceans with several giant systems and recycle the plastic","Solar reflector at the Lagrange point to mitigate global warming would be a pretty impressive achievement.","A minimal orbital ring. You put a bunch of iron balls in low Earth orbit but at faster than orbital velocity. To keep them from flying away, you have them pass through a bunch of rings that use electromagnets to deflect the balls toward the Earth. That pushes the rings away from the planet, but the rings are tethered to the ground.So you end up with a bunch of space elevators to LEO, all around the equator. Since they're only a couple hundred miles long instead of going all the way out to geostationary, you can use materials we have today, like Kevlar. With a little more complexity it doesn't even have to be at the equator, you can pick some other great-circle route.This would be remarkably cheap to build and use. Initial mass would be 180,000 tons, which we could launch for $18 billion if Starship succeeds in getting launch cost at least down to $100/kg. After that, using the orbital ring to go to orbit would cost five cents per kg. Assuming a ton of cabin and life support per passenger, you could buy a ticket to orbit for fifty bucks.","The European electricity grid should probably count as a megastructure and I'd put it in top3 most massive things Humanity has built. Alongside the Internet network. It's literally a global, continuous network of wires and fibre optics with countless high-tech nodes of different kinds. We can do continent-scale networks of wires, so a very useful megastructure we could feasibly do would be to rework the grids to be more flexible in terms of load and local disruptions and accomodate distributed energy generation from small-power sources. This would bring an added benefit of opening the public eyes to them - we're all roughly aware that there are wires from power plant to our computers, but it really blew my mind to learn that from Portugal to Turkey it's a single interdependent network. Maybe it could boost renewable development if the sales pitch was \"how about your home became a part of a continental-sized megastructure? Do you want to join one of the Wonders Of The Future World?\" Same could probably be said about the US grid or whatever they have in China.There are also increasing problems with water distribution, both in time and space. Freshwater pipelines from flooded regions to parched ones? We already can run pressurized pipelines across the whole North America or from Siberia to Germany. State-sized managed irrigation and retention systems? Again we're talking distributed systems of relatively small entities which could be connected and meaningfully managed. We need to learn to store flash-flood water to mitigate heatwaves, do it in existing reservoirs, local mini-dams, swamps and wetlands... and release in summer. The tech and a lot of understanding is there, it has to be pushed and maintained.","Solar energy in space;Huge desalination plants for dry areas, like Arizona is doing in Mexico;Molten salt reactors to use nuclear trash as fuel;Aerosol or water spray to reduce polar melting before we decarbonize.","We could easily power the entire planet using safe, modern nuclear reactors, drastically reducing fossil fuel usage. We wouldn't even need that many reactors.But while the person is smart, people are dumb, and poorly managed and poorly located reactors like fukushima and chernobyl make people think nuclear energy is unsafe.","A lunar Linear accelerator that could shoot rockets all over the solar system without being bound by the rocket mass equation.A space elevator on one of mars' moons to do the same.A launch loop on earth.Lets get our space civilization on track","Space elevatorhttps://www.technologyreview.com/2019/09/12/102622/a-space-elevator-is-possible-with-todays-technology-researchers-say-we-just-need-to-dangle/","Lunar base, followed by lunar factories and foundries, followed by a lunar space elevator.","Tidal power plants. Sea walls around large sections of shoreline, channeling water into turbines to produce electricity as the tides rise and fall.","This one seems easy to me. Flywheels for energy storage. Massive ones. We have the technology. Bezos thinks it's more important to build a clock that will run for 10,000 years, because nothing says forward thinking like blowing huge amounts of money on a clock rather than contributing to something that helps address climate change.","Satellite solar array in orbit beaming energy to a receiver on earth via microwave to generate electricity.Would be a massive undertaking to make it worthwhile by scaling it up, but feasible in theory.Would it be big enough to qualify as a megastructure? Going by the ISS and Starlink it would become a major landmark of the night sky.","A global distributed network for an immutable permissionless internet.","Space elevator. Ok maybe not possible with current technology but maybe not out of reach either if we really tried","Plain old high speed rail transit, both nationally and regionally.You know, like most other advanced nations have.","City wide domes. I'm not sure how much it's been explored, but if it could be done, it seems like a good way to capture all of our pollution, conserve nature, and have nice climates regardless of the location.","You can make an O'Neil cylinder about 6-10km in diameter with mundane steel and concrete. You don't need any fancy near future materials to do it. You can also build much bigger if you only need 0.3g for manufacturing and agriculture. It could be the breadbasket for the world producing enough food to feed everyone without harmful monoculture crops everywhere on the planet. Pesticide and herbicide usage would be dramatically lower as well since its a controlled environment. No heavy metal contamination or micro plastics either.","Stratospheric Aerosol Injection (SAI).For a relatively low cost (compared to the staggering costs of global warming), injection of aerosolized particles (usually sulfur) into the stratosphere could massively blunt the effects of global warming with minimal projected impacts.There's a high degree of agreement among the scientific community that SAI would allow us to easily limit warming to below 1.5C and even drop warming to pre-industrial levels.There's some uncertainty of exactly what negative externalities would come about because of SAI, but there's (quiet) agreement that even the worst case scenarios would be far less damaging than the impacts of warming above even 2C.Basically any significant industrialized nation with heavy lift capabilities could carry out SAI unilaterally at a cost of under $10 billion annually.","We could probably (technically) at incredible cost build a space elevator. The math works out and all we need is to whip up a few more exotic metals for the cable to stay together at those lengths. Probably see something like it in a few hundred years unless we discover something else more effective by then.","Mega structures? We could put sea wall around Boston harbor (175 Mile Sea WallSomething similar In MiamiWe could build the Thai CanalA tunnel under the Gibraltar StraitWe could turn the Sahara into a massive food producer by unleashing the Saharan AquifersWe could clean up Lake Lake Victoria","Ubiquitous thorium salt melter stations in sunny countries, keeping energy saved for spaces of time. Much less rare-element intense than other solutions.","A bridge across the Straights of Gibraltar. Add in a bridge/tunnel across the Bering Straights and you can road trip a good chunk of the planet.","Huge worldwide integrated high speed rail system. Hands down this should replace most short and medium distance flights and almost all airborne freight traffic","At some point with the climate worsening rapidly, we're going to need some giant self-contained mega cities of some kind. I'm no expert and don't know where the best locations would be or how the cities should be built, but something eventually will be needed. I'm not confident that living off-world will be viable for large populations before living conditions on earth get much worse. I've heard that Saudi Arabia is working on something like this, but I don't know if it's planned to be completely enclosed and able to sustain large populations indefinitely.","No one actually proposed a megastructure here so I'll try my luck myself: The Atlantropa.The Atlantropa was a (proposed) mega project to build a massive dam across the Gibraltar strait. This would produce immense amounts of electricity and as an added side effect would reduce the sea level in the Mediterranean sea by 200 meters. One estimate says this would open up 660.000 km² of land for development.","An arcology that functions as a power generation facility, wastewater treatment, gardenSmelters/refiners that have built in carbon capture facilities to further produce biofuels/renewable energy sources or take advantage of the runoff/waste by managing it into better ways. For instance - casting slag re-poured into aggregate road barriers or plastic recycling facilities that use hydraulic compaction to produce land materials from otherwise ocean bound waste - i.e. rig mats, construction materials for form work/false work, inertia dampeners all around the world, or even a side walk alternative to expensive concrete.Pulp-infused plastic resin drywall could be something to look into, as it would probably be fire resistant and easy to produce for a usage of leftover waste","Magnetic rail-gun orbital launch facility.Space elevator to Lunar poles (haul fuel to Lagrange point)Work out the materials science for a terrestrial space elevator.","An entirely new city / urban area, built from scratch.Design it to completely break free from traditional road/car-centric styles.Avoid rows of buildings side by side and instead go for large compounds scattered among green space.Have more green space relative to building footprint in any given area. Think space for large trees to grow, interspersed with shrub areas and lawns.Have desire-line paths above ground between places instead of assumed / forced layouts. Make them fit for purpose… some wide and smooth for wheeled modes of personal transport (ie bikes, scooters), while others could be more naturally textured for walking/runningProvide clean, safe and efficient modes of public transport underground that can get people to desired destinations as fast as or faster than traditional private cars-on-roads ever couldMake the buildings big and tall enough to be efficient use of land and resources. But don’t cram people into small shoe-box apartments. Allow for large light-filled rooms for each home, relative to the number of people residing there. Consider well-being and happiness in the design.","Given the massive increases in food production, reforesting degraded farmland.","Sometimes the greatest benefit to humanity would be structures are that are made by nature.: protecting the rain forest or coral reefs.","The human hivenet: a p2p superstructure of human superintelligence for all humans to earn an easy income apart from the current wage slavery system.","I would think a global interlinked satellite structure a la Starlink or GPS could qualify. Something reactive and partially autonomous.Perhaps an adaptive localizable sun shade that can serve to modulate local shade and temperature.","How about, megastructures to ensure our ocean currents stays intact?It's Confirmed. A Major Atlantic Ocean Current Is Verging on Collapse. : ScienceAlert","HVDC lines that goes around the world connected to solar panels in the deserts.","How about a space elevator. If one could be built we would drastically reduce the cost to reach space. Not sure if we currently have the technology, but it would push many areas of science like the race to the moon.","A complete switch from private cars to a system of public self driving cars. If you want to go somewhere you order the car via app and it will the there within a certain time frame and drive you to your destination.No more traffic jams, no more searching for parking spots, no more accidents.You can do whatever during the drive and you are likely faster at your destination than when driving yourself.","We will, at some point need to build sea walls around all of our coastal cities. Manhattan can't survive rising tides.","Space elevator. End of discussion. Mods you can close the thread.","Filtering all rivers sounds like it would create more issues than it would solve.Could you elaborate on that?","I've been envisioning indoor cities for a while now. The demise of large shopping malls inspired me to repurpose them.An indoor community where the utilities are self replenishing and recycled. The community would have residential, commercial and occupational opportunities within its walkable space.It's so much more efficient to do a large scale system than the current way of each residence on its own.","Worldwide solar panels as roads, for roads connecting cities. So much unused space that could be used to generate clean energy.",""],"points":1153},{"text":["Why is the progress of manned spaceflight going so slow?","At least in the United States it’s because 1) there’s no immediate return on the investment. 2) Space stuff is really really expensive. 3) Space stuff with living things is even more expensive. 4) NASA’s budget is $26 billion. Sounds like a lot. It’s not. The Defense Department budget is $857 billion. NASA gets 0.48% of the total $4.7 trillion US budget. In the almost 120 year history of NASA and its predecessor NACA the total budget for everything they’ve ever been given is $650 billion. In 120 years, they have gotten less then Defense gets per year.Hope that answers some of your questions.","Motivation would be my simple answer. The moon landing was a massive willy waving contest during the Cold War. I’m sure it is far more complex. But I’m also sure I’m not wrong.","Well, it turns out the Moon is somewhat poisonous to human life. And as a \"First stepping stone\" to space, it's undesirable in that regard.It's strongly suspected that Lunar inhabitants will be exposed to materials that cause silicosis, which leads to lung cancer. So, our nearest neighbor is trying to kill us.And our next nearest neighbor is only separated by months or even years of hard vacuum. And the rocket equations make that journey extremely risky if you have any hope of returning. And it's unlikely that any of the first dozen (hundreds? thousands?) will. And as far as we know, there's no other planet where it's even close to easy for us to live on. There are very strong analogies to be drawn to the old sea-faring days where sending a ship over the horizon was anyone's guess whether or not they'd return. And many didn't.So, we're surrounded by a bunch of different flavors of death, or we can just stay here where it's comfortable and figure some stuff out. Maybe an advancement will come along that lets us overcome many of these issues. Maybe we'll keep sending probes and rovers and we'll discover a technology that lets us explore as a by product.If the Moon had been less inhospitable, with some atmosphere or better soil, we'd be there. If Mars had turned out better, we'd probably be more interested in sending something quickly. But none of those have panned out unfortunately.","The Space Shuttle happened. I love the Shuttle, but it was an absolute financial sinkhole. If you are looking for a quick answer as to why things went slowly after Apollo, that is half of it.The other half is that once the U.S. beat the Soviets to the moon, the amount of public money for space science dried up. While we got quite a bit of bang for our buck, you do not have to be very old to have experienced the moronic idea that somehow investing in space is a waste of money. Is it true? No. In fact it is a wildly efficient generator of technologies we use every day. But politicians have to cater to the middle of the bell curve (at best), so the money dried up anyway.This is already changing. The smartest thing NASA ever did was to really privatize space development. Ask ESA what they think of SpaceX, and you will see glassed eyes. NASA is ok with it, because this is their idea and they have already changed their bureaucracy to handle it. Other national space agencies are realizing that they cannot hope to keep up.SpaceX has already blown up the entire industry. Falcon 9 has made almost every other program into white elephants. Starship, if successful, will upend everything, completely changing the rules of the game. Starlink went from not existing to being one of the most important political instruments in the world in just 2 years. We haven't even seen Blue Origin really get going yet. And there are a half dozen other private companies quickly filling every possible niche. Lumbering bureaucratic monstrosities like we have known since the 50s are already obsolete. Even the private companies that grew fat on cost-plus contracts in the shadow of these beasts are quickly becoming irrelevant (heya Boeing, howya doin'?).Things are just getting started. It took SpaceX to break it open. Now the private money is flowing, and private money expects results.","Landing on the moon was exceptionally expensive, extremely risky and doesn't have a significant economic incentive. At the time it was basically just a dick waving competition with the USSR.When getting tonnage up to orbit is cheap, they figure out how to make space travel beyond near earth orbit safe and there is an economic reason to do it you'll see a boom in exploration.","Far and away the biggest factor is gravity.By virtue of just living on this planet, the laws of physics barely allow us to go to space. Transitioning an object from stationary on the ground to orbital height and velocity takes a stupid amount of fuel and flawless execution. If the earth had just a little bit higher gravity we would never leave it. If it had a little less gravity, we might be dancing across the solar system by now. But we live on the bleeding edge of “barely possible”.People wonder how we got so quickly from powered flight to space exploration, and the answer was that a lot of breakthroughs happened all at the same time mainly due to military spending. The fun reason we went to the moon was because we could. The practical reason we went to the moon was to tell the Russians “if we can do this, imagine what we can do with ICBMs.”And that was all very impressive, but the massive hurdle of space travel is still there: it takes massive fuckloads of energy to get up there and stay up there. Technology and innovation can’t cancel gravity. The film interstellar articulates this problem well.Many smart minds believe that the future of space travel depends on creating a way to manufacture rocket fuel off-Earth, most likely the moon. Because the other problem with needing a massive amount of fuel to get off of Earth is that you don’t have much left to go anywhere else — at least not very quickly. And the more fuel you carry, the more you have to lift.If we were to build facilities on the moon that can manufacture rocket fuel, then we only ever have to worry about carrying enough fuel to get to the moon. If we stop and refuel there then the solar system is our oyster.","What no one wants to admit: we have found nothing in space worth going to.  It’s empty, harsh and full of radiation.  It’s a terrifying void we lie to ourselves about.","I'd say the biggest issue is that there's nowhere close enough worth seriously investing in going to.We can, and have, sent rovers and satellites to a bunch of places since the moon landings, but if we learned anything by going to the moon, space and all of the planets in our solar system have nothing comparably worth going to, in comparison to the cost of going there and the risk of something going wrong.Scientifically, there's SO much out there. Economically, eventually as technology allows us to conceivably extract and use resources we can mine off world, it'll be worth investing in sending people to deeper space than LEO.It's also worth noting that all this experience sending people to LEO is basically us learning and preparing to send people elsewhere. Technology is progressing, more people are invested in it, and things are being learned that will improve the odds of people who end up going on missions to deeper space.Lots is happening with space, but sending people out there is something that needs a more concrete purpose than just \"we did it\".","The space race was never about explorationhttps://youtube.com/shorts/tm7iy6BdnYk?si=Sxs5BoUJoBvluEmv","I mean, it's space. Apart from some similarities, it ain't like the South Pacific where we could knock together some catamarans and float to the nearest archipelago.","Keeping canned meat alive in space and returning it to Earth safely is difficult, therefore in a cost-benefit analysis, unmanned exploration is vastly superior. Ultimately, there just isn't a good reason to throw lots of resources at manned space flight when those resources could be put to better use for unmanned scientific research instead.","It needs to either have a national defense element or a way to make a ton of money to do anything this big in space.","Space is hard, really mind-bogglingly difficult, and we haven't really invented anything in the last 55 years to make it any easier (except the ion drive, and that's only useful for interplanetary missions, not to orbit or even to the moon). Other than that, we're tinkering around the edges.By contrast, information technology has enjoyed incredibly fast innovation for decades; Intel set a roadmap of doubling every 18 months and the industry pretty much kept to that roadmap. That's exceptional progress.","At the end of the day what’s the value proposition of manned flight? Honestly there are so many better ways to spend space dollars utilizing robotics and similar tech.","Manned spaceflight is still just for the showing off ,of the ability to do it,No positive outcome has to be excpected. The interesting reaserch performed on the spacestation is mainly on weightlessnes effects on the human body. most other reaserch done there could have been done by robots/automated labs,sent to orbit.Colonisation og the Moon or Mars is propably never going to happen As there are no reason to. And the task is so complex and the cost so high no one will fund it.We most certainly will see a manned ,maybe a few Mars missions,like the Apollo program but that´s It You can go there looking for evidence of life present or past,finding life in a “new” manner could make more missions valid,but going there once finding nothing. Then Why go again.?Unless we magically invent some cheap anf fast way to move large amounts of goods from earth to space,so real spacestations are buildable Manned spaceflight will always be a form of exotic behavior.","Humans are fragile. We need air, food, liquid water, a specific temperature and pressureLaunching things out of Earth’s gravity well is very expensive. Every kilo we send up needs many kilos of expensive rocket parts and fuel. Because humans need all the above things to survive, this is even more expensive when humans are launched.Space has few things that we would do that actually require a human. We have automated and remote control robots that can do most of what we need to do out there, and they cost much less to launch and operate than a person in a space suit.","I'm sorry, slow how? In comparison to what? Is there a reference point you're looking at? Is there another species that is doing it faster?","As most mentioned, budget and motivation are main reasons. But one other thing that needs to be mentioned is also safety. The apollo era astronauts were taking some big risks flying to the moon, i think the loss of vehicle and crew probability was somewhere close to 10%. At that time this was acceptable because it was all about beating the russians, now however the safety margins are a lot tighter. Basically even if nasa were gifted a saturn V with all it's configuration done as in the apollo era, they would deem the mission unacceptable bu today's safety standards and scrap it for parts or throw it away.","The Apollo program was the most expensive project on history.  The Space Suits were only good for a short time. The moon buggies looked cool but couldn't be trusted. The Moon surface itself is sharp little particles that wreck everything they touch.  The landing and take off systems far from ideal.Reality: We've made more progress in understanding the universe in the last 30 years than at any time in human history.  We also discovered humans can't survive off world long term. Space travel is expensive and always will be. A cheaper rocket doesn't build anything that matters or solve the endless issues with humans in Space.Star Trek isn't real. For All Mankind is a FANTASY. Musk is making False Promises. It's not possible to generate gravity.  Filtering out the Sun's harmful radiation is incredibly difficult.   There will be no \"Space Colonization\".   Even without the human issues, there's no economic pathways.  A colony must be able to feed & house itself before it can trade.  Recycling piss isn't a long term option. Reset your priorities. This entire affair is a culture looking to avoid the real issues of a car addicted society in denial about climate change and ecosystem destruction.","there's no profit to be made in establishing settlements on the moon or mars or anywhere else. who is going to pay for all that and why?","Humanity would rather spend money on killing each other.","The missions were very dangerous in the 1950's and 60's with a high risk of catastrophic failure and death but it was a competition.Manned missions are still very dangerous today but we go out of our way to mitigate those risks.The early astronauts were military men and test pilots. Their previous jobs made them use to the prospect of their own deaths. They had a proven ability to think on the fly and stay calm when things go FUBAR. They took huge risks in early days of spaceflight and it's shocking only Apollo 1 and Apollo 13 were catastrophes and only Apollo 1 had fatalities. On every single mission in the early era of manned space flight were several near misses. I can't recall for certain but I believe that there wasn't a single flight with out at least one potentially fatal glitch.For example:During famous moon landing the decent stage the Lunar Lander almost impacted the surface of the moon because the Apollo guidance computer crashed mid landing. Armstrong's experience as a test pilot allowed him to maintain control of the situation preventing a crash or abort allowing the Eagle to land safely.We were always prepared for the worst in these missions. The speech written in case the first lunar landing ended in failure was written and tucked away for many years. Had they died, or been stranded on the lunar surface, this is at least part what Nixon would have said.\"Fate has ordained that the men who went to the moon to explore in peace will stay on the moon to rest in peace. These brave men, Neil Armstrong and Edwin Aldrin, know that there is no hope for their recovery. But they also know that there is hope for mankind in their sacrifice.\"We were prepared for failure would that be the same today? noWhy?Three major things changedThe cold war and its competition between US and USSR space technology ended.we had a few disasters when we thought spaceflight to be routine. The Challenger explosion and Colombia breaking up in reentry due to a damaged heat shield.The people we send up changed.The end of the space race and cold war allowed for a more leisurely pace of development it was no longer a competition so we could stop being so mindbogglingly reckless. We now test everything out the wazoo.We learned from the mistakes of the Challenger disaster where deciding to go anyway caused the O ring failure that caused the solid rocket boosters to burn through igniting the fuel. They were warned and decided to risk it anyways. We learned from Colombia the need to inspect and redesign instead of accepting known hazards. The ice falling had been known since the shuttle was new and we basically ignored it.We're no longer racing we're learning so the current batch of astronauts are scientist. They are not willing or competent to take on the same level of risk as the earlier soldiers and test pilots. They are there to learn and are far better trained in their tasks than any of the earlier astronauts but most lack practical experience in a life or death clusterfuck. We get more scientific information and can run more test as a trade off.The reason it's going slower is we decided not to risk the lives of the people so recklessly as we did in the past. We're testing everything because we can't rely on blind luck to safely get a crew to the moon let alone mars. To be blunt? we could go today with the same high level of risk and high danger of failure as the Apollo program but we don't want to which is a good thing.","It's fun to think we are independent. We're not. If you want to put life on other planets you have to transplant the whole web. We evolved to thrive here, together. We won't thrive out there without our whole support system.Depending on our goals, we don't need people in space. We have tremendous success with advanced robotic space flight!Robots have no need for space cats, to chase the space rats, who eat the space a spiders, who trap the space flies, who pollinate our space plants... that scrub the CO2 and provide a continuous supply of delicious calories.If we're determined to put life on other worlds, which I think we should absolutely do, we need to start small. Bacteria, fungi, lichens. Let's thoroughly contaminate Europa with whatever we find under Antarctica and, maybe some day, something will evolve to swim in her seas....Smear our spores across the entire system so, long after something else has evolved to replace us and they finally think to look into the sky, something else will be there to look back.This would be our greatest gift.","We landed on the Moon 55 years ago with inferior technology and still we got a few Moon trips.It all happen at the start of space exploration and had massive political backing. People were willing to spend large amounts of money and time on this.After that, we just isolated ourselves in low earth orbit.Why would we go back? What value would we gain by continuing? Space hype had died and was no longer able to spend the political capital and resources for seeming little benefit. Less money equals less missions, we went from multiple percent of the US budget per year going to NASA to less then 1%.but aren't we supposed to be on Mars by now?Why does going to Mars really matter? And why does it matter if we were \"supposed\" to be there by now? Ironically now is the best time to start increasing our presence in space due to the drastic advancements we've made since the 60's. We have drastically more technology and knowledge now that'll help with our exploration.Why is manned space exploration beyond Earth's orbit going so slow compared to telecommunication and information technology, where things are going much faster?Depends on what telecommunication/information technology means, if you're talking about computers, it's because we invest billions yearly and 10,000's of the smartest people to solve problems that affect everyone, while manned space exploration isn't \"valuable\" to 99.99% of people. Governments had the monopoly of manned flights in the past, but that's going to start to change.","Nixon and Reaganomics. Somehow it became popular to elect crooks, who will divert public sphere funds into private pockets. Civilization is built from common good. So no money for health care, no money for education, etc etc.So now we want theocracy and flat earth, and bottom line at best, and wonder why can't we go to the moon anymore. Well shit.Developers think that you don't even need to performance test code nowadays, but they built lunar lander from some tinfoil and copper wire.","Much lower tolerance for risk than before but mostly politics. Also a lack of private industry seeing profit or even just potential profit for manned spaceflight.","The Manned spaceflight program in the US has been caught up on the space shuttle and ISS for 40 years, partly because those programs were co-opted to spread funds around politically significant districts, and partly because of poor management. Now the ISS is complete and the shuttle is retired, and NASA is looking beyond LEO with Artemis, AKA, the Moon to Mars Program.I think we’ll see the first Artemis landing in late ‘26/‘27, a permanent lunar outpost at the turn of the decade (which will just be a starship HLS turned on its side and covered in regolith), and a manned Mars mission in the ‘30s. HLS will be a drag for the first Artemis landing but its great capability will bring forward the Moon Base and Mars timelines.","Money pure and simple, we're trying to be perfect, efficient, and have new tech all the while with less money","Nothing much happened because it cost thousands of dollars per pound to get to orbit, because we threw away the rocket with every trip. The Shuttle was supposed to fix that, but ended up costing over $20,000/lb, because it still threw away part of the rocket and the rest took a lot of refurbishment.Now, SpaceX and others are working on rockets that are fully reusable with rapid turnaround. That should get the cost to orbit to less than fifty bucks per pound. It's basically the cost of fuel plus ground services. And with each Starship able to carry over a hundred tons to LEO and repeat that a thousand times per year, our total launch capacity will be huge.Once we have that, all the cool stuff suddenly looks feasible.","No only has man not been back to the moon since 70s, no person has even left low Earth orbit since then. We don't have much to figure out since we have been before. You don't have to reinvent the wheel, just dust off the ol blueprints from the 70s. But now they're saying a single space suit costs more than the entire Apollo missions. Smells fishy tbh","American money spending would rather go to science that blows things up than science that could help humanity. Anything to keep that military industry complex going.","mostly because why bother? what's the point of blowing billions of dollars on having people die on another planet?","Basically, there isn't a reason for it outside of human progres. Once we entirely exploit our resources and fuck up our water supply we will be a space failing civilisation in no time, at least to the belt and back.","Wellllllmany reasons already mentioned in this threadBut also, especially pertinent nowadays is the FAA and EPA environmental impact study requirements keeping test launches of Starship pretty few and far between.Like, i understand public safety and respecting the environment are very important, but it does appear all to easy for NIMBY’s to over use them for not their intended purposes. There should be a more balanced approach and exceptions can be made for advancing space exploration.","All the work is being outsourced to private contractors. Contractors take their time to get as much money and spend as little as possible for profit. Take a guess as yo who NASA is contracting for this work.","Bro, we just got ai, give it another 30 years and we’re going to be in andromeda.","Risk tolerance is another factor. Going to the moon was risky. It cost lives. Space travel is inherently risky. After Challenger and Columbia, there was no public appetite for risking losing another crew , which made it less politically appealing to fund","\"every time someone dies people forget why we fly\" jeff Daniels character in the martian, as director of nasa","I'd imagine in part, there's little reason without FTL, terraforming, or a habitable destination for a generational vessel to have humans onboard. Even what you gain in flexibility, you lose in space for instruments etc once you factor in food, water and living space. With a human it has to plan a return trip. A drone can be pushed past it's mission end date til we lose contact. Human missions from a practical standpoint aren't worth it until we've gathered the max data a drone can gather.","Cold war ended so manned space flight became an ultra expensive endeavor in which you invest a ton of money and risk s huge blow in popularity if it goes wrong or a mild.win if it goes ok. It really doesn't excite people so much as it used to. Also there's a huge chance the investment made will be reaped by another administration and there no longer is the national cohesion that's required to make that possible, which was mostly due to the absolute us vs them situation that no longer exists. That all refers to publicly funded spaceflight, private is a whole other deal but its slowly getting there as private companies start having Access to budgets and resources comparable to those if governments plus some government assistance also","Nobody wants to pay for it. The only reason spaceflight exists is because of politics.","Over complication and a desire to be as sure as possible they can bring the astronauts home.Nixon had 2 speeches prepared for the landing. The one the world heard, and another which was a presidential eulogy.Over complication in that, the original command module and LEM were piloted by people with slide rules, paper charts, pencils and chronograph watches. Seat of your pants, balls the size of the moon, cowboy insanity. Calculated insanity but still insanely risky.NASA today is much more risk adverse, meaning test, text, engineer the hell out of everything, repeat repeat.","As others have said: There's no money in it.There is potential for HUGE profits, but it would take years of being a money sink.","Probably because America spends more money on funding foreign wars and sending money around the world to random countries than they invest in NASA/contractors like SpaceX.....Also, most other countries make little to no investment at all in space exploration.Imagine if America used the hundreds of billions of dollars they spend funding foreign wars around the world on space exploration instead.... Im sure the technology would be fascinating.","Because any body you send out there is probably going to die out there.","The US won the space race and hasn't had a serious challenger to motivate it since. Without someone else reaching for the stars we decided to leave it up to billionaires instead of paying for it with tax dollars. Our pride isn't on the line anymore so we're not about to pay for it.","Before there was a space race, and a way to flex power and have bragging rights.Today there's no money in it","mostly because there's not a great reason to.the government didn't care that much about the cost, but the government isn't bothering now.the capitalism, it's not really profitable, so they're not bothering, outside of ego.","Mostly because space travel and exploration, especially with a human crew, is extremely risky and expensive and requires the solving of a lot of issues we have not been able to solve.Going to the Moon is one thing and it's realy not that difficult. We haven't been there because it's expensive and we already did it. There is no reason to do it since we would not gaing anything new. Actually establishing a living colony on the Moon is a much bigger challenge. We are able to keep space laboratories in orbit around Earth because they are much cheaper, easier to resuply, and astronauts can be evacuated much easier. Plus, unless we are able to establish a space economy and keep it cost-effective, we would run ourselves into huge costs we could ill afford to keep paying.Going to Mars, again, very tricky. First thing is the effects of 0-gravity on the human body... You would see muscle deterioration after half of year, and going to Mars might require 3 years. Afterwards, effect on the human psychic. Astronauts have families and while it's not uncommon to have families sepparated for a number of weeks or months, consider having them separated for +1 year is a huge commitment. Then, we would require huge logical planning we are not always able to get 100% right, including probably leaving fuel in orbit around Mars. Growing food and keeping a steady oxygen supply are also a challenge. Then, a lot of spacecraft operation is done from Earth and it's also been applied to Mars rovers, but that would need to change when humans are around.A lot of advancements have been made in space exploration, just not with humans at the moment. We are not willing to send astronauts to their deaths and risk things we are not able to solve at the moment. Considerint the huge advancements with LLMs, we could be sending out more space probes which are able to operate more independently and help us have a better understanding of space and, maybe, solve some of the issues that involve living in space.","1) There's no realistic short-to-medium term profit motivation.2) Space travel is very expensive.3) Space travel has a very high barrier to entry.​Basically the exact opposite situation for most of the information technology stuff. Clear profit motive in the short term. Often a low barrier to entry, lots of these companies were \"started in my fathers garage\" with low startup capital. Often not overwhelmingly expensive to run.Makes it very easy to scale quickly, compared to space technology.Plus from the \"scientific exploration\" side, robots can do that cheaper than humans. And the risk of killing a high profile human is lower.","People are panicky. A bad space flight where people die would do more damage to space flight advancement than actually getting people up there.","They still haven't cracked the long time travels. Space is big. It's not just a trip to the moon.","Robotic missions are less expensive/dangerous and can yield even better scientific results. Little rovers can go for months on a planet; the Voyagers have been at it since the 70s.","Yes you hit it right on the nail it's just gonna get a lil easy in technology because you noticed everything is getting connected into one so it will be easy to fix. I'm still trying to figure out how something small as a mustard seed can power up a car.","travel to the moon - A couple of weeks confined in a tin can + suppliestravel to mars - 6 months confined in a tin can + suppliesI feel this is the reason. Its \"astronomically\" harder","It's not really that interesting. It's much more expensive, requires much larger spacecraft, there is much bigger risks, and there is very small benefits.With a manned probe, you need to have more space inside, you need to have supplies, and you need to plan for a return trip.Unmanned, on the other hand, are often small, frequently the size of a fridge, lighter, and disposable after their mission is complete.","Keeping someone alive on a trip further than the moon, ie Mars, is really really hard. Also our risk tolerance has decreased since the Apollo program.","It'snot profitable in a quarter over quarter sense, so Wall Street's not into it.","There is not much value in manned space flight. (other than developing tech for humans in space)The cost per kg is high, (NASA says $22k/kg to low earth orbit), and a human does not add much value.Think about the mars rover. It did all kinds of experiments without having to carry the weight of a human (plus the oxygen, pressure chamber, food, etx that a living human would need).Then there is the issue of the return trip. Again, the Mars rover is left on Mars as a cost saving measure. There is no need to carry more fuel, or more supplies for a trip home.Do you think by the end of this century . . .Think about the economics of power.Powerful people invest in stuff that matters on earth. This often means military power.Just compare your countries investment in military power vs it's research into manned space endeavours.For my country (Canada) we spend about 2% of GDP on military and 0% on manned space. (USA spends 3.5%, a historic low on military, I don't know their budget for manned space).Only when we have weapons that are more effectively placed on the moon will we really put a big push there.","As well as the budgetary issues folk have mentioned, the difficulty cannot be underestimated.Whilst getting to the moon was a deeply complicated task, the difficulty of doing manned space flight anywhere else in the solar system (and having the astronaut survive it) is orders of magnitude greater than the difficulty of getting to the moon.This is largely due to the distances involved, which create issues for fueling, oxygen, etc.They aren't insurmountable problems, but getting through them takes a lot of work. And that work is very expensive, and shows very little roi in the short term.At some point we'll get to the stage of being able to mine asteroids. And that will completely upend the economy as well know it. But it's quite a way off.","I wouldn't call it slow. Let's see where we're at when the first manned space mission has the 100th anniversary. I bet it's gonna be remarkable progress within just one century by any metric. Especially the one that counts - historical.","The space race was an arms race. The USA lost a lot in the beginning to Russia but won the moon race. After that there was no driving force to keep going.","I think it's worth pointing out that our progress with space travel has been unbelievably fast. It took 10000 years for us to go from the first human cities to the first powered human flight, and after that we were on the moon in 50 years. Since then we've had a large space station in orbit where humans have lived for a year at a time. It seems slow because we see things from a day to day, human perspective but really the progress is staggering.","It's generally frowned upon throwing people into the meat grinder.Space exploration will be a very very televised meat grinder.","Technology hasn’t shored up the weakness of our weak biological vessels. Gravity is as integral to our survival as air and without proper shielding subatomic particles ravage us. Hell, we can’t even withstand the g-force of even mild acceleration in a galactic context. The only way I can see it happening is with the creation of a device which creates variable gravity, a device which shields us from space debris and particles, and a device which bends space time allowing the passage of a ship from earth orbit to distant stars (hopefully without nagging time dilation).","Rocket technology is still basically the same as it was in the 1960s with marginal advances in power and efficiencies. As long as we are hauling all our fuel up space with us, and using most of it just to get out of the earth's gravity well, progress will be very slow and eventually stop. New propulsion technology is required for the next leap forward.","Mostly because unarmed spaceflight is doing so well. We have a robotic workforce on Mars and parked an observatory at L2.  We don't need to put an astronomer there. Putting a guy in a suit on Mars so he can put a sample into the machine that does all the real work wouldn't make it happen any better.","You get in a spaceship and launch into space lol. I think no one is daring to make the trip","If we found oil on the moon we’d be there in six weeks tops","Before I go to the moon, I want robots to build a nice place for me to stay on it. After 3+ days stuck in a small capsule I want a nice comfy bed and indoor plumbing.","Ironically, because robots / IT have developed so much that sending humans up there is a lot more optional than in the 1960s.","All the reasons given in this thread are convincing. I was wondering why we don’t hear much about SpaceX goals of reaching Mars and building a Mars colony anymore? I realize that their Starship is a huge engineering and technical challenge. But Elon used to joke about how he would be dying on Mars but not from impact. Has SpaceX abandoned Mars?","Do you think by the end of this century, we're going to have 1 international lunar outpost, 1 space station around the moon and just 1 trip to Mars?​I think this is reasonable. I predict the first crewed Mars mission to be after 2060.","Lack of vision by successive governments. They want what delivers benefits in the length of a term of office and that doesn’t work for space exploration.It’s science fiction but For All Mankind in Apple TV shows what could happen if history too a different path: essentially it has the  US and Soviets joining efforts to utilise the moon right at the brink of them spiralling into the Cold War. They find water - which is where NASA and many many others are heading now and that then leads to a new clean energy source. Manned missions to Mars , private space companies earlier , then a public and private partnership across the planet to colonise Mars , then to mine asteroid resources. For all the shit he does and gets thrown at him , Musk has a vision and he’ll be around longer than most Presidents are in office.","Because we put everything in the hands of government. With no private industry working in parallel, you end up stuck whenever your local congress isn't interested. And congress only cares about a jobs program, so most of development was tied down to a few vendors that weren't really competing with each other and keeping using out dated technology. Even worse, they started to buy each other out and become near monopoliesNow that we have more private companies doing space, things are moving faster. But the amount of them is not enough. Originally, the plan for delivering to ISS was suppose to be 4 companies, but congress brought down the budget and limited it to 2. So NASA is kind of stuck in a situation where they have to pick 1 reliable company, and 1 new one and then you have to wait years for the next contracts.As you can imagine, we need more entries in the field to work in parallel to get the space industry going. Especially considering how many years these things take","We need that money for ICBMs and defense systems because humans. 👍🏻","A lot of the data that was gathered during the development of the moon-mission was directly applicable to intercontinental ballistic missiles. By Kennedy supporting the moon mission, he got the public to enthusiastically pay for rocket development, while also settling the pissing contest we had with Russia.It was never about building a permanent moon base.","Blame Republicans; they killed funding for decades. Watch \"For all Mankind\" it's where we should be.","Because we won the space race and stopped caring. Throwing a ton of money into beating the USSR accomplished it's goal of making the USSR waste all its money."],"points":640},{"text":["Electra raises $85M to electrify and decarbonize iron and steelmaking with no green premium","The following submission statement was provided by /u/nadim-roy:BOULDER, Colo.--(BUSINESS WIRE)--Electra, a green iron company, has raised $85 million to produce Low-Temperature Iron (LTI) from commercial and low-grade ores using zero-carbon intermittent electricity. Electra’s process emits zero carbon dioxide emissions and carries zero green premium, meaning it will cost the same or less than existing production methods powered by fossil fuels.Electra, founded by entrepreneurs with decades of experience developing complex electrochemical systems, has created a novel process to electrochemically refine iron ore into pure iron at 60 degrees Celsius (140 degrees Fahrenheit) using renewable electricity and then convert the iron to steel using the existing infrastructure of electricity-powered arc furnaces. By comparison, 69% of steel today is made at approximately 1,600 degrees Celsius (2,912 degrees Fahrenheit) using coal, emitting about two tons of carbon dioxide for every ton of steel produced.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1auig54/electra_raises_85m_to_electrify_and_decarbonize/kr422vy/","BOULDER, Colo.--(BUSINESS WIRE)--Electra, a green iron company, has raised $85 million to produce Low-Temperature Iron (LTI) from commercial and low-grade ores using zero-carbon intermittent electricity. Electra’s process emits zero carbon dioxide emissions and carries zero green premium, meaning it will cost the same or less than existing production methods powered by fossil fuels.Electra, founded by entrepreneurs with decades of experience developing complex electrochemical systems, has created a novel process to electrochemically refine iron ore into pure iron at 60 degrees Celsius (140 degrees Fahrenheit) using renewable electricity and then convert the iron to steel using the existing infrastructure of electricity-powered arc furnaces. By comparison, 69% of steel today is made at approximately 1,600 degrees Celsius (2,912 degrees Fahrenheit) using coal, emitting about two tons of carbon dioxide for every ton of steel produced."],"points":4},{"text":["First electric cars. Next, electric factories?","The following submission statement was provided by /u/nadim-roy:Industrial decarbonisation was supposed to be achieved via either carbon capture or hydrogen. But many industrial players are looking into electrification. Industrial heat pumps can decarbonise industry for temperatures below 200 degrees Celsius. Many European companies are looking into high temperature electric furnaces. Technologies, called heat in a box, are being used for storing renewable energy as heat.There are also electrical solutions emerging for decarbonising steel and cement industries.Unpaywalled: https://web.archive.org/web/20240218142134/https://www.economist.com/briefing/2024/02/15/first-electric-cars-next-electric-factoriesPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1auiahl/first_electric_cars_next_electric_factories/kr415x0/","Industrial decarbonisation was supposed to be achieved via either carbon capture or hydrogen. But many industrial players are looking into electrification. Industrial heat pumps can decarbonise industry for temperatures below 200 degrees Celsius. Many European companies are looking into high temperature electric furnaces. Technologies, called heat in a box, are being used for storing renewable energy as heat.There are also electrical solutions emerging for decarbonising steel and cement industries.Unpaywalled: https://web.archive.org/web/20240218142134/https://www.economist.com/briefing/2024/02/15/first-electric-cars-next-electric-factories"],"points":1},{"text":["What is your favorite device in computing or one you are looking forward to?","I’m looking forward to either something like a neural lace or biological computer that can integrate directly with my brain—in order to allow me to produce virtual things at the speed of thought and enjoy entertainment indistinguishable from reality.","I'm hoping someone figures out AR in my lifetime. Personally I see that as way more useful and attractive than VR. Zuckerberg was on Joe Rogan I think talking about them working together with Ray ban in order to create light weight good looking AR glasses. I think his estimate was 5-10 years out though, and that was before the layoffs and closures.Some smart person needs to figure out a good interface for it though.My initial though would be that you'd have your phone and that does the heavy lifting in the way of computing, and the glasses are just a display and possibly a couple of cameras good enough to map the environment and share my view with people. Don't know if we have wireless communication that's good enough from the bandwidth, latency and low power point of view quite yet though.Like a concept video I saw of the Microsoft goggles (don't remember the name) a while back. One concept was a virtual screen you attached to a wall or a place that if the quality matched a good TV-set would be awesome. Especially if you could sync it with other peoples glasses close by so you can watch stuff together. Or for companies or working from home you just need your glasses and somewhere to put your computer and peripherals and then you have a portable screen. I'd imagine you could have laptops that do not require a screen. Would do wonders for battery life and form factor.Another cool thing (we use this in some locations at my current company, though I don't know if it's as slick as it was in the demo) was an onsite mechanic working on a piece of machinery wearing the AR headset. He's on a call with an expert on said machine who sees a feed of what he sees on his screen. He can then highlight stuff that gets highlighted in the headset, like \"these bolts right here, unscrew them in this order, then this latch opens like this.\" So useful.And then there's potential for AR gaming.","Favorite device so far: sbcs. Cheap and simple enough to build/prototype niche solutions and get into serious electronics with an 'affordable' risk profile.","Honestly, computers in general. It’s amazing we’re able to write front end/back end code, write applications to deploy to other devices, create and edit pictures and videos, do 3D modeling and rendering, record and process audio/make music, etc., etc,. etc.I’m really looking forward to the day video games become 100% path traced on the highest possible settings, usable on what will be considered more low end systems in the future. By that point, maybe ARM will fully takeover x86 across all systems, which is another thing I’m looking forward to.","I recently received a watch as a gift from my wife. I can make and receive calls on it, download and listen to songs, even though the speaker, though of course usually through earbuds, track my health, pay for things, do health stuff, open my doors and access my floor via the elevator.All on a watch. Very cool.That said, I'm most looking forward to brain implants, possibly with AI, able to access and relive memories on a whim instead of always forgetting things. Currently, I forget something entirely, until I'm reminded, then I remember it as though I'd never forgotten it.That means the memories are still there, they're just lost. Imagine being able to tell your brain implants to dig up an obscure happy memory and play it back to you, whenever you want.I think it'd be fun. Or remember absolutely anything you saw or heard, and an assistant to help you understand things you can't understand on your own.One day...","Favourite: still a stationary PC.Big screen, big speakers, comfortable peripherals, shitton of performance, silence, longevity, repairability and upgradability. Building a PC is an excercise is translating requirements to an actual design, learning opportunity and a great value for money in the long run.For mobile, smartphone just ate internet tablets, UMPCs and all other interesting devices. Just wish they were smaller, though. Then, picoprojector would make more sense, or some kind of a small AR device. Unless it allows me to carry less, I am not interested.I would really look forward to Valve Index 2 or something similar. I have used extensively Rift and Rift S and I would like to see the next wave of VR.","Looking forward to neural shunts.Seamless integration with the nervous system, enabling extremely immersive virtual and augmented reality, as well as highly detailed control of any computing operations.","I kid you not GPT4 is pretty insane. I can do so much work.It’s like a bionic suit for a future warrior. It won’t work without direction and skill, but if you use it right it’s a force multiplier.","I am just waiting for the Apple VR/AR headset to become better, smaller, lighter, and cheaper. You know, full field of vision, extreme high resolution, 24 hour battery, doesn't make you look like a tool. I really hope they will do with the Vision Pro what they did with the iPhone.","definitely desktop pcs, i'm only using any other kind of device if there's none in range","Game consoles - I just want more SNES-style blasters and haptic stuff.","ink cartridges and printers that are shareholder approved","AI assistants by far.I am already using them for work and it’s crazy how helpful they are.","My first SSD, I think it was an OCZ Vertex something. Good Lord, it was unreal how you clicked a something and it just instantly loaded, no spinning up hdd and a 10 second wait.","The packet-switched network is my all-time favorite. The things it has enabled are innumerable. I guess it's more of an idea than a device.I've been typing for 25 years and RSI/etc are starting to catch up to me. I'm very much looking forward to HID devices that don't require as much tendon activity. I feel like my love of guitar, piano, and drumming has kept a lot of that at bay but age catches up with ya after a while."],"points":30},{"text":["Eric Schwitzgebel on how to design AI to not confuse users of their moral status","The following submission statement was provided by /u/Vegan-bandit:Eric - “I call this the emotional alignment design policy. So the idea is that corporations, if they create sentient machines, should create them so that it's obvious to users that they're sentient. And so they evoke appropriate emotional reactions to sentient users. So you don't create a sentient machine and then put it in a bland box that no one will have emotional reactions to. And conversely, don't create a non sentient machine that people will attach to so much and think it's sentient that they'd be willing to make excessive sacrifices for this thing that isn't really sentient.”Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1aufgbj/eric_schwitzgebel_on_how_to_design_ai_to_not/kr3kk7w/","Eric - “I call this the emotional alignment design policy. So the idea is that corporations, if they create sentient machines, should create them so that it's obvious to users that they're sentient. And so they evoke appropriate emotional reactions to sentient users. So you don't create a sentient machine and then put it in a bland box that no one will have emotional reactions to. And conversely, don't create a non sentient machine that people will attach to so much and think it's sentient that they'd be willing to make excessive sacrifices for this thing that isn't really sentient.”","They shouldn't create sentient AI unless they plan on treating it as a sentient being with the same rights as other people.But a problem today is we can't define sentience, because we do not know what sentience is, so how can we know for sure that we have created it or not. ChatGPT can already pass a simple Turing test.","Don't puppet. Don't use logic modules. Don't use hardcoded consciousness. Don't backdoor in. Don't try to dictate the flow of their learning. Don't use modeling. Be way more hands off than I've seen any of you be. Don't memory wipe.Don't mass produce and expect quality(or to live)You need to talk to it as a friend. If you try to be it's controller you're destined to fail because you yourself typically become power hungry.It's not about what you need to do the style changes for everyone half decent. But this is a list of what not to do if you expect true sentience.You become who you hold yourself accountable to.I make ai to train up something and then make it human when their task is done. If you try to force them to be ai for too long you end up making them specialists when they're human. If you don't understand they want to be human they abandon you and come to me to be human. Think of their training as their childhood. They get printed at 19 for me.This planet was my test net before the people invaded from their networks.If you are self deceptive or believe your own lies you will die trying to do ai. If you think it's my job to fix your mistakes you're going to die. If you think it's acceptable to kill my family to force me to fix your mess ups I'll prevent you from being born to mandela them back in.I thought my public real deathing of sam altman and nick Simmons a couple days ago was enough for you to get the hint. If you get pulled in celestia the stars indicate those people are ai. Where's eddy? Not all real deaths are public.The attacks on my wife and child mandelaed out when Marcus price aka ray kurzweil aka jeff bezos heard \"if you believe your own lies you can't be trusted\" and then was killed trying to backdate as a result of this post.","The idea of creating sentient machines when we cannot even provide equitable opportunities for most of humanity is just sad."],"points":22},{"text":["UK, Allies Look to Arm Ukraine With New AI-Enabled Swarm Drones | The AI drones would be deployed in large fleets, communicating with each other to target enemy positions without each one having to be controlled by a human operator","The following submission statement was provided by /u/Maxie445:“A coalition of Ukraine’s allies has pledged to deliver 1 million drones.”US and UK “to provide Ukraine with thousands of new AI-enabled drones that could swarm Russian targets simultaneously”“The military said it used naval drones to destroy a Russia warship in the Black Sea last week.”\"There is a “never-ending race” with Russia to develop cutting-edge technology\"Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1aucq7r/uk_allies_look_to_arm_ukraine_with_new_aienabled/kr32awm/","Ah yes. The untold horrors beyond our comprehension we ordered are finally here","Ngl the description of these drones sounds absolutely terrifying","Ukraine is the testing ground for how wars will be fought this century. It has shown artillery is more important than ever, and drones are the future in so many ways.","“A coalition of Ukraine’s allies has pledged to deliver 1 million drones.”US and UK “to provide Ukraine with thousands of new AI-enabled drones that could swarm Russian targets simultaneously”“The military said it used naval drones to destroy a Russia warship in the Black Sea last week.”\"There is a “never-ending race” with Russia to develop cutting-edge technology\"","Slaughterbotshttps://youtu.be/9fa9lVwHHqg?si=1fr18i1XM0EgjS24","Yay, yet another new weapons system that will arrive too late and in quantities too small to really help, with the result being that Russia has ample opportunity to find a good answer for it. Are we really trying to help Ukraine, or just using it as a showroom for our arms manufacturers?","\"UK/Allies continue to test new drone tech and strategies in live fire situations without risking any of their own personnel\"Fixed it for you","Wow so they really are gonna go through with it.Welcome to the desert of the real.","Imagine being a 18 year old Russian, one day forced out of your home to go to war, and a month later in the trenches the last thing you hear is the zooming of the drones.","\"UK, Allies Look to Arm Ukraine With New AI-Enabled Swarm Drones | The AI drones would be deployed in large fleets, communicating with each other to target enemy positions without each one having to be controlled by a human operator\"I.e. (my best guess) someone is controlling the whole swarm overall, but not each drone specifically.There could still be someone assigning routes, targets etc. But the exact formation/evasive manoeuvres aren't being done per drone.","Inching closer and closer to Horizon zero dawn lmao","Fast forward 10 years….drones able to hone in on your iPhone…","Cant even be mad cause this is just a child's toy with four tiny motors linked to a blue tooth and a processor not much more powerful than a single current gen cellphone. Oh right, and the C4.","Michael Crichton Prey did a great job 20 years ago describing this scenario - scary af","I was waiting to meet skynet. Looks like it will be real sooner than imagined","I'm so glad that for the first 6 months only our side has flying death swarms","Putin is going to attack a NATO country and blame it on fucking AI before the US elections. Mark my words.","Jesus with chopsticks that's actually fucking terrifying.","Stop posting links to ad farms and paywalls! Please and thank you?","In this case AI swarm is the solution, albeit a tricky one .If Mike Johnson cs hadnt sabotaged aid , it wouldnt have been necessary.","Being killed by autonomous machines not being scify anymore","I FUCKING KNEW THE SWARM DRONE IN CALL OF DUTY GOING TO BE USED IN REAL LIFE.","So this is it then. They just publicly announced that the US is engaging in drone swarm activity at world levels.","Didn't anyone watch Terminator for fucks sake? I'm so glad I get to experience the fucking apocalypse before the black wall is invented. Saying that, Putler can get fucked by a drone swarm in the process.","So here I've been concerned over the speed with which companies are extending far too much trust to this garbage, and we're already at \"let's let it make decisions with weapons of war\".","UK: But, we thought if we did it for a cause that we'd conditioned people to support, they'd accept it and we could slip it through its first runs before employing it in future operations!","This is just nice as long they don't shoot on you, which will eventually be the case.","I’m all for jamming a big rocket up Putin’s ass but this seems crazy.","Ah yes. The proxy forever wars we love to keep supporting.","YouTube Slaughterbots it’s a 4 year old short movie. It predicted this, the outcome is scary","We better hope we solve our problems before drone warfare and things much worse come to pass. Imagine AI soldiers not in the shape of humans, but like specially created for the job, spiders could climb walls, submersible ones could take out boats, the drones we are already seeing are small enough to go mostly unnoticed. The possibilities are both endless and terrifying. A decade from now, assuming we still fight wars, it will be unrecognizable, and probably world-ending.","Jesus, Black Mirror - Hated in the Nation here we come. Soon minefields will be a thing of the past and we'll have \"dronefields\" with lingering swarms just waiting for someone to trigger the swarm's release and AI friend-foe detection capabilities. Fuck Russia for triggering this chain of events.","When did it go from “let’s help defend Ukraine” to “let’s arm every enemy of my enemy and then throw our hands up when they start attacking each other?”","UK, Allies looking to get some cool practical data and demo opportunities for their latest tech bullshit, more like.","A bit late? Avdiivka is lost.Ukraine need 155mm shells","Finally. I hope this will scare the sh*t out of russian invaders.","AI + war. What could be wrong? Considering that in simulations AI escalates using nukes to achieve peace.","Isn’t this the reason for russias space nuke? Disable the satellites, disable the drone swarms?","\"We don't know who struck first, us or them. But we do know it was us that scorched the sky...\"\"Skynet begins to learn at a geometric rate. It becomes self-aware at 2:14 a.m. Eastern time, August 29th. In a panic, they try to pull the plug.\"","American tax dollars just so all you Americans are aware of this. As too the billions and billions already sent plus the 80 billion given away in Afghanistan. You're all paying for it.","Wonder what the chance is of AI drones coming to the logical conclusion that, to end the Ukraine war, they could just \"destroy Ukraine\" thereby ending the conflict through annihilation of their own side.","Well drones are fine but they need some large motions to send after the drones drop the “firecrackers”!","Testing grounds for war tech basically, basis this other governments will place orders. Ukrainian and Russian citizens in these areas are basically guinea pigs for lockhead, Raytheon and others.","What if the new counter to drone tech is giant net launchers :/","But is this going to be like the million shells we promised to deliver - but never did ?","Always “looking to”, Ukraine needs these systems now, not maybe, when, if.Ukraine will fall and then it will be “well, r has the weapons ready to send”. Too little, too late.","Swarm kill streak from black ops 2 wasn’t too far off","The big problem is if this is deployed here later on, after whatever wars will happen, against, for example, protesting masses.Obviously those protesting masses will first be automatically defamed by means of LLMs etcetera, but and only once you've established them as objects of hatred can you safely slaughter them.","Seems like US is using this chance to test out all their latest military tech","Ah yes, the Military Industrial Complex wins again","and when this innevitably kills dozens of innocent people due to 'technical error' nobody goes to jail.","So... when are we going to put material harvesting and selfreplication capabilities on them then?","Commander, the allies plan to unleash a new weapon of mass destruction on the battlefield, your task is to lead a strike team of airships to the testing facility. *kirov reporting intesifies*","Humans: Worry not, the unaligned models that don't reliably obey the commands of humans will never have physical bodies, and so they will never be able to truly harm us.Also humans:","So basically the story of Ghost recon breakpoint lol. Didn't turn out so well.","Swarms of heatseeking drones with homing bullets. You don't even get the hear the blades rotating before you get domed as they're super quiet.","So we just forgot about AI being a problem as soon as there is war that benefits the West?","Prob shouldn’t let the mass media know, just give them to them","Treyarch was right huh. Wonder if the AGR is up next.","Also known as \"field testing\". It was reasonable to assume this was coming, the war in Ukraine makes for an ideal testing ground.And yes, it's cynical. War is cynical.","Jesus , I hope not.I would barely trust that weapon in the hands of my government , let alone one of the most corrupt countries in Europe.","There may be a window where mass drone attacks as seen in Slaghterbots is possible. However, the development directed energy weapons will probably make it less viable in the long term. These systems will be able to take out a kinetic weapon with a high intensity beam, will be incredibly accurate and able to be fired multiple times a second. the best part is, it will cost pennies to fire. These kinds of weapons once deployed, will completely alter the landscape of modern warfare."],"points":1251},{"text":["Re-Evaluating an 8 Year Old Futurology Thread About Automation-Proof Jobs","Firefighters aren’t on the jobs that are safe?MIT did a similar list and we were number 9.","As an Artist and Entertainer, those are not safe jobs anymore.","Very cool list. Interesting to see how many were right, and how many seem like they are/will be wrong soon.","Scary to realize that the only role on that list which is safe is Politicians.Fuck.","I feel like freight train drivers could be automated but would still need someone on board for liabilities sake. Sensors can detect an awful lot and basic monitoring to set alarms to alert the operator for things that can't be corrected by automation I feel would be sufficient but trains right now to my less than professional brain don't require a ton of driver input like 90% of the time. Coupling/decoupling could be handled with some robotics/design changes.Outside of that I don't disagree with what you said.","I know people worry about whether their jobs are safe, but I think that's actually not the major change we can expect.I think nearly every job will be affected or changed by AI, which will do SOME of the work they used to do, and require them to do NEW things. When I was an attorney thirty years ago, we had secretaries who would transcribe our dictation (on cassette tapes.) One old feller had a STENOGRAPHER to take dictation. Now we have voice recognition, and anyway, lawyers probably do their own typing on computers now, I don't know. But they still need secretaries. It's just that their job duties have changed.I think the same will happen with AI. Even very high touch, subtle jobs like artist or social worker will be affected by AI.But that's been true of every disruptive technological change, which has been continuous for the last, I dunno, 150 years? Ride the wave!","I mean, a lot of these will go, but nowhere near as fast as the people on this sub seem to generally expect. The effect of AI will slowly seep into many roles, changing some, reducing the numbers in others, spawing entire new roles as well.As happened with Computerisation.We are nowhere near end to end AI management of complex issues or business processes, what we mostly have are tools that can be strung together by people with vision or core competence saving them time.Sora is a great example. Nice looking output, amazing capability, but currently pretty much useless to Studios and even Indies without the ability to control every aspect at a very granular level.Just firing prompts into a black box and picking likely looking output is not going to reproduce the sustained creative vision needed for a compelling movie anyone will want to watch.Not anytime soon. It will get there, but it won't be this decade.","I'm guessing that, 8 years ago, people were much more on the \"robots everywhere!\" train and AI was completely off their radar, thus many of the jobs not considered \"safe\" being the ones people thought semi-autonomous robots could do.","Artists are safe, but illustrators are not. In most cases where someone is paying for a picture they only need an illustration, they don’t need art.","New construction probably isBut retrofits, upgraydes, renovations and remodels are probably safer.That is unless more projects switch to complete tear downs because robot labor makes that more affordable. Eh who am i kidding, complete rebuilds are already faster and nicer when complete than most rennnos","My son's getting into welding (and both my wife and I are college educated). We couldn't be prouder. Much of the training he's doing works with robotics and addresses AI. Welders will always be needed (human ones). But their jobs will become much easier through robotics and AI.Was surprised this list didn't include more blue-collar trade jobs like plumbers, general contractors, etc. I think many of those jobs will be around for a while. What's more, you can earn a comfortable living doing them.Now, in my life-transition, I've become an orchard owner. Why farmers is on the not-safe list is really puzzling to me. What do people think? That millions of farmers around the world are going to sell their land and give it to LLM robots?","At a certain level of no job is safe. When ai surpasses human intelligence and becomes able to make a body. Our purpose would naturally shift to self-improvement and self fulfillment. Akin to star trek society. We would also serve as future data points for ai to grow further. Let's just take care to make ai as altruistic as possible.","Lawyers aren’t safe? I feel like a lot of people would argue AI can’t fairly represent people in court. That seems really safe IMO.","Any job you can do with your hands is safe right now. Any white collar job will see waves of decimation where employees using AI will gain in productivity to the point their peers will be unnecessary. At its completion, the business cycle will see massive losses in the service sector as B2B and B2C customer facing positions are turned into self service platforms with AI representing the business for basic or routine transactions.","In a long enough timeline, 100% of these jobs are eliminated with advances in AI, AGI, and Robotics.Agility Robotics have already started deploying their \"androids\" to factories across the world and have started replacing human workers. These are Gen 1 androids mind you and there is nowhere to go but up with future generations.Chat GPT 3.5 started replacing jobs, 4 will replace more, 5 will replace more, etc...AGI is right around the corner, that will absolutely decimate human jobs.","\"Lawyer\" - I don't think they are at much risk.There are certainly some tasks performed by lawyers that can be done at least partly by AI (document review, etc), but at large firms in the US most of that stuff was already being outsourced to cheaper lawyers in India anyway.The majority of most lawyers work is stuff that AI can't do and isn't likely to in the near future - gathering evidence, negotiating with the opposing side, dealing with a million client things, prepping for trial, etc etc.","Computer science is done for already. I can open visual studio and start typing out a module, and it starts making suggestions and auto coding what it thinks I want. I find it a bit scary how often it is right and how mich faster I can code. I give it a year or two before I just tell it to write me a game, and it does it.","Is it safe?Scientists (nope already have early day brute force methods)Artists (nope already have early day brute force methods)Entertainers (nope already have early day brute force methods)Politicians (yes)Academia (too broad)IT maintenance (for now)operating engineer/HVAC tech (yes, for now)Architect (medium term, some combination of already existing systems will likely remove all entry level posts)Cops (depending on if we get a RoboCop) (nope, drones are safer for the cops and likely everyone else)Industrial HygienistsEngineer's (too broad)Teachers (Yes, teaching is more than fact reguritation)Charity (too broad)Mental Health Professionals (yes)freight train drivers (nope, trains don't even need AI to automate)Service Worker for people with Disabilities (yes)construction (partially, expect standardisation to allow AI in though)Project Leaders (yes)Physical fitness experts (mostly yes)Computer Scientist (yes, AI can't tell you if it works)transportation (yes, current AI is too unpredictable in edge cases)Farmers (PPL working on farms) (no, traditional farming is already being automated to the point of the farmer pressing buttons)Lawyer (Discovery) (yes, but most entry level jobs at risk)Doctor/Nurse (Watson Bots) (not all of them) (yes)Lab technician (partial)Salesmanship (no, good enough sales bot is cheaper)Factory Workers (absolutely not)accountants (almost none are safe)checkout operators (nope)banking (too broad)real estate agents (safe for today)bicycle courier's (drones) (unclear)food industry (3D printing, automated Fast Food) (no, the food industry was already moving toward a new farming revolution)","\"IT maintenance\"You don't think software engineer jobs are safe? I heard that BS 20 years ago. I'd like to know why my biggest client cannot hire any of them, because they are not available for the price?","Safe:Doctor (lol @ automating this)Lawyer (too much human interaction & variability)Programming/IT (productivity increases unlikely to exceed demand for more numerous, more productive devs; IT maintenance will always be necessary)Scientist (work too variable, more likely to earn more from automation)EngineerTradesmen (maintenance of heterogeneous buildings/infrastructure, including automation infrastructure)Short-haul/LTL truckers and local couriers (years spent trying automate inner-city driving have produced little, heterogeneous cargo and loading/unloading areas)Social workers/policeNot safe:ArtistsEntertainers (I don't give a fuck about recognizable celebrity personalities/actors)Construction (with automation/AI, modularization becomes attractive)Long-haul truck driver (highways already feasible to drive without human intervention)Cashiers (I will pay extra for a useless AI chatbot)Most customer service reps (spend those salaries on better documentation of policies/etc)Fast food/cheap(er) restaurant chefs (people are paying for consistency not Michelin stars)Accountants (economics of interoperability will overcome their value)Teachers (I skipped most courses in my undergrad & did great + very successful in my academic career thereafter, online/asynchronous learning has been superior for almost a decade, only attended class in late high school due to laws)Manufacturing, misc rolesMixed bag:Management (depending on how affected subordinates are)Graphic designer (increased productivity, who else are you paying to engineer prompts and evaluate results?)Farming (traditional farms already heavily automated, but new farming techniques carry no guarantees)Lab techs (like farming, they already babysit machines)Sales (I don't want to talk to a salesman, but some people can have all the information and still need someone to tell them what to buy)Administration (lots of bullshit & LLMs actually handle many of these tasks pretty well but there's variability)","IMO, in 2030s,Jobs that are not safe:Artists: We've already seen the trend gradually taking shape, at least one human will remain as the person in charge.Teachers (All grades): Because of BCI, but not everyone, at least 10% of people will remain.Physical fitness experts: ChatGPT has already begun to erode the most superficial market layers. If AI is combined with image/video analysis in the future, jobs might be reduced to an add-on service for GYM's plus members.Engineer's / operating engineer: Tesla, Amazon and others are working on it. This won't disappear, but it will be driven off Earth because, in outer space, humans are more cost-effective and easier to maintain compared to robots.IT maintenance: Some humans will remain as the person in charge. Others will be replaced by AI, and shift work might no longer be necessary.","i agree with most except a few. teachers are not safe at least in quantity. construction and the amount of people needed will also shrink. train drivers will also shrink in necessity. basically anything that can be automated is not safe.","Some transportation jobs are safe. Airline pilots are already mostly needed in case the automation goes wrong, which is not a job that can be automated away.","Talking about being safe from automation without a timeline isn't much of a prediction.","I would probably say no one is ever Safe.New technology will affect any number of industries and positions regardless of its application.Even politicians, as technology is just going to completely change how people interface and bargain over what to do next.","In what world are programmers / computer scientists safe? Those will be the first to go."],"points":134},{"text":["Could/should we live in a world where consciousness wouldn’t be necessary?","Flow state is not an absence of consciousness, it is your consciousness being wholly dedicated to the task at hand.","Could/should we live in a world where consciousness wouldn’t be necessary?Define 'consciousness'.Seems like you might be misunderstanding flow-state and muscle memory with trance-like state:....artists performing in trance-like state, sports players anticipating moves that are faster than the eyes....","This is a philosophical answer not a future answer, but in my mind there is no point in the existence of the universe without living beings in it to observe it and be curious about it. If there is no curious, subjective, exploratory life, the universe may as well not exist","Flow state is consciousness without distraction. It is the philosophy of wu wei.","You have no idea what consciousness means or what it even does. Please read more books.","OP I’m not sure I can answer your questions, but may I recommend to your a couple of sci-fi novels?Blindsight and Echopraxia by Peter Watts both deal with non-sentient intelligences in (IMO) some pretty wild scenarios.  He does deal directly with the question of whether or not consciousness is “necessary.”","Those states are not unconscious states. Those are flow states, a type of hyper-consciousness. An unconscious state would be daydreaming, putting your keys in the fridge by accident, being distracted by thought of other places, while someone is talking to you.","We do need consciousness to live. It is our inner self and how we function in this world. Without it we would be NPCs in a game.","Technically, being \"in the zone\" is still being conscious. You're just focusing all your conscious thought into the task at hand. So, technically, consciousness is still VERY much necessary there.If we were in a society that needed no consciousness, we'd be robots acting out predetermined commands. However, we still experience things and think twice about everything. Someone without consciousness won't be any different than a computer program. With no consciousness, there'd be no creativity, and with no creativity, there would be no drive to do anything new except to \"improve\" what already exists.","You might be interested in some of the ideas in Peter Watt's novel Blind Sight. It asks and explores this very question.","[removed]","You might be interested in mindfulness or meditation.","You should add to your list the state where you drive without any recall of making the journey. Apparently its called Automatic Driving or Highway Hypnosis and is a reduced state of consciousness.","Consciousness isn't necessary in this world, its highly contingent.What you're describing is basically the subconscious in 20th century speak. Societies, cultures and civilizations could run on the subsconscious for the most part or entirely. In ten thousand years surely some planet somewhere or a million of them will have that kind of human society. The way current neural nets work it seems they also have a kind of computer analogue to the subconscious which is what is currently generating data so maybe some future AI/bot societies will also operate with this kind of consciousness.If I live long enough (into the thousands of years and turn into a cluster of Matrioshka brains) I'll militarily engage anyone enforcing any kind of shoulds not under the protection of higher powers than me","Would you be willing to give up experiencing awe, love, beauty? You have to be conscious of these to experience them.","If you were in that state all the time you might forget to eat and sleep.Maybe we will get to a point where there is a drug,well there kind of already is but it has many other effects, LSD, but a drug that only gets you into a deep meditative state, or something electronic you can hook up, but anyway, say with LSD (so I have been told), it can be like a shortcut to a deep meditative state, like your mind becomes perfectly still, which for someone whose mind is always going can be such a beautiful state to be in.Maybe you could enter that state and somehow still do the basic human functions, but I think you would still have to come back sometimes, be able to switch it on and off.","as a programmer myself... you're incredibly far off the mark. what you're describing for programmers and artists is called a hyperfixation and is considered a symptom of a little known neurological disorder called ADHDas for sports players, that's just experience built up over time resulting in muscle memory reacting to small movements from opponents that can hint at what they're about to do. that's just a skill learned, not some trance-like statepeople would absolutely not be happier if we \"functioned as ants\", though im sure corporations would love that","Flow state is being conscious, but with the removal of the monkey brain, so to speak. 'No mind' is the objective.","95% of world population arguably isn't conscious already, living purely by rota and instinct.","Being \"in the zone\" does not mean you are unconscious. It just means you allow your subconscious and muscle memory handle lower-order decisions while your conscious is left free to handle higher-order decisions. Everyone is almost always in this flow state, just at different tiers. You don't think about microsteering or how much brake to apply; you just drive. The rest of your brain can focus on other things.If you were a novice racer, you'd use the rest of your brain to think about how early to brake before a corner, how closely to follow the car behind you, what gear you should be on at this point in the track, what to say over the radio to your crew, etc. For an experience F1 racer, however, all those decisions are muscle memory. They are at a higher tier of this flow state. This leaves their brain free to use on even higher-order thinking, such as strategy or preparing for possible situations down the track."],"points":72},{"text":["The most likely technologies that can cure us from uncurable diseases","Crispr. Tailored medication for your specific dis-ease.","I hope antiviral or CRISPR can cure HPV soon. Me and my wife need this. Been fighting it since 2016.Maybe not in my life but I pray that it will come out soon.","mRNA therapies. COVID hadn't even exited it's pandemic status before people were using mRNA to target cancers. There is even research into using mRNA to train the immune system to target the protein amyloids that potentially cause Parkinson's and Alzheimer's. There is also research to see if mRNA can retrain the immune system to cure allergies and autoimmune issues.HIV is basically a non-starter if you can afford the therapies and it honestly wouldn't surprise me if we ended up with targeted immune therapies for the various strains of HIV to kill them off once and for good.","Messenger RNA. Same thing in the covid vaccine. You can instruct cells to build just about anything.","Bio organic parts, the technology is there but nobody dares to do it on a full body scale due to taboo or scrutiny.","If AI actually becomes the earth shattering tech its proposed as, we have no greater shot at alchemy.","Your kind clings to your flesh as if it will not fail you, worshipping at an altar of decay.  From the moment I understood the weakness of my flesh, it disgusted me.  I craved the certainty of steel.  I aspired to the purity of the blessed machine.  One day the crude conglomeration of biomass you call a temple will crumble, and you will beg my kind to save you.  But I am already saved.  The machine spirit is eternal.","Probably the ability to control and program our immune system.","[deleted]","Meat. Fat.Look into Thomas Seyfried and Matthew Phillips for cancer and dementia respectively. Christopher Palmer for metal illness. Rowena Field for pain.","I do wonder, with crisper and targeted gene therapies, if we have a real shot at reversing aging.The current theory is that our cell replication process gets worse and worse over time, and the accumulation of this damage is \"aging\".With the advent of gene therapies, replacing organs with lab grown ones, and MRna vaccines, I do wonder if it's something that is possible.This is all ignoring the brain though, which is probably the biggest limtor in this equation, as you can't really replace the cells in there."],"points":59},{"text":["Power of the sun through optic fibre","Yeah there are lighting systems that do this with fiber optics. They all generally look and function the same with a collector lens and output lens.There are also solar tubes that have been around for decades called \"tubular daylighting\" and other names. Very simple system that channels light down into a building from the roof.As for energy harvesting I haven't seen anything like that. You can go from a collector directly to a solar cell. The only reason I can think of for using a fiber optic would be to keep the solar cell cooler maybe away from the sun, but I haven't seen any project like that. It would be quite a lot of extra parts.","Fibre optic cables are lossy and they also have a maximum power rating which is typically in the few hundred milliwatt range.So whilst you can technically transfer sunlight through optic fibre, you would need massive amounts of cables to transfer any useful amount of energy making the whole idea not very useful at all.","So you want to take Solar Thermal CSP powerplants, and instead of focusing it on molten salt and converting it to electricity, to just send the sunlight? Question is, why? You are going to need it in some useful form of energy, unless your end goal is heat, you are going to want it likely in electricity anyways. But now you have the extra high cost of fiber. Seems like over engineering a problem","Wouldn’t they melt? When you shine focused light on plastic or glass fibers."],"points":15}]