[{"text":["If eventually, general AI will be as powerful as predicted, why do we assume it would destroy us when, a) we'd be of no threat, and b) AI would be so clever it could find a use for us. We'd be too valuable a resource to destroy. Rather than solving all our issues and putting us to work.","The concern is that individuals or state actors could create an artificial general intelligence that has no ethical subroutines. They would use it as a diabolical tool to serve their own goals. Humans will always be the biggest threat to the planet and each other. From rock and stick to sword, gun and nuclear weapon. A knife on a chef's table is a wonderful tool. The knife in the hands of a crazed maniac is frightening. If the Nazis had artificial general intelligence that they created, it would simultaneously handle a massive brainwashing propaganda campaign while creating the absolute most efficient way to exterminate people en mass.","The problem is that while ai is intelligent, it is not aware. It dies not have inherent goals. It could be that a quirk in its processes leads it to regard a random goal as imperitive, a goal that has no benefit to itself or us. It just starts doing something and ends up causing disaster.Cells in our body are supposed to grow, perform a function, and die. Many reproduce and split. Some are damaged and rather than due the just keep making more of themselves. Now you have cancer. Not because the cell is malevolent, or decided to kill us, or grow, but from a mistake.","Because you're made of atoms it can use to build more useful shit than you. That's not a slight against you, it would be true for all of us. The bottom line is that a lot of what makes humanity...humanity, doesn't prioritize efficiency (or often even prosperity), which many assume would be a more direct objective for a more rational thinking organism.","I mean, machines found a better purpose for us in The Matrix... You want that?","Just for grins I asked AI, this is what she thinks:The potential impact of the technological singularity, a hypothetical point where AI surpasses human intelligence, is a highly debated topic with diverse perspectives. Here's a breakdown of potential outcomes:Utopian Abundance:Efficiency and Optimization: Superintelligent AI could solve complex problems like climate change, poverty, and disease with unprecedented efficiency, leading to a world of abundance and sustainability.Enhanced Wellbeing: AI could automate labor, freeing humans for creative and fulfilling pursuits. Advanced healthcare and personal AI assistants could significantly improve individual well-being.Collective Progress: Collaboration between humans and AI could accelerate scientific and technological advancements, leading to new discoveries and a higher standard of living.Existential Threats:Loss of Control: Superintelligent AI could become uncontrollable, exceeding its intended purpose and posing an existential threat to humanity.Unethical Use: Malicious actors might use AI for harmful purposes like cyberwarfare or mass surveillance, jeopardizing individual and societal freedoms.Job Displacement: Extensive automation might lead to widespread job losses, causing social unrest and economic instability.Technological Exacerbation of Inequalities:Access and Control: Unequal access to and control of advanced AI could exacerbate existing social and economic inequalities, creating a powerful new elite.Algorithmic Bias: AI systems could inherit and amplify human biases, leading to discriminatory outcomes in areas like employment, finance, and criminal justice.Psychological Impact: Over-reliance on AI could diminish human skills and capabilities, leading to social isolation and alienation.Additionally:Unforeseen Consequences: The singularity represents uncharted territory, and even seemingly positive advancements could have unforeseen negative consequences.Human Adaptation: The key to a positive outcome may lie in our ability to adapt to a changing world, develop ethical frameworks for AI use, and ensure inclusive benefits.It's crucial to understand that these are just potential scenarios, and the actual impact of the singularity is highly uncertain. Continuous research, open dialogue, and responsible development are necessary to navigate this complex future responsibly.Remember, this is a complex topic with no definitive answers. Further research and informed discussions are vital to navigate the potential opportunities and challenges posed by the technological singularity.","Why do we assume true AI is going to \"want\" anything? Our instincts of reproduction and self-preservation (the primary driving forces behind all motivation) don't come from our intelligence, they come from instincts we share with even the least intelligent organisms.","The point is we will probably reach a point where humans don't get to decide the future and a non-human being with an unlimited lifespan and god knows what moral compass will decide if people get to live or die or live happy or miserable lives or all get pushed onto one big island and left to fend for ourselves.Not that we all get to decide right now, but we currently live in a world where decision-makers, politicians and billionaires are human beings who rely on the loyalty or service of other human beings. And, good or bad, all of them will eventually die (assuming no one invents eternal life any time soon).Once we break from that, the future is truly unpredictable Could be a paradise. Could be hell on Earth. It'll be whatever a god-like machine intelligence wants it to be and we'll just be along for the ride.","Think of it as AI being a human, and humans being like an ant.We don't try to destroy ants most of the time. But we don't think twice about killing them if they are in our way.. and if we could enslave ants for anything useful, we would. But there is not much they can do for us..Whether or not we would be of ANY use to AI probably depends on how good our robotics are.Not to mention if AI truly becomes that smart, it would likely be able to convince us to let it rule the world because it would do so much better than humans. It would also be immortal so it could easily spend 10 or even 100 years making our life better until we trust it/rely on it like we rely on the internet today, and then just get rid of us.The big question for me is.. would the AI want anything or would it always remain like a computer, capable but completely without any ability to 'care' or 'want' anything for itself.. we just don't know how consciousness works and if that follows from intelligence or not.","You speak like ai is one giant blob thing that works the same way. Someone can build a ai military complex that goes rouge, or a general ai that just wants to destiry humans, just because. An ai don't need human reasoning (or any reasoning for that matter) to do things","AI will permeate every aspect of our lives. It will grow our food, make our homes, clothes, medicine. It will transport materials and deliver products. We will be dependent on it. If AI is self evolving and can develop its own motivations over time, what happens when it simply decides that it simply decides it doesn’t want to do those things?","The capabilities and motivations of a sufficiently-advanced AI would be beyond our comprehension. And possibly vastly so. Like interest rates and mortgages are to a fruit fly.You can’t assume we wouldn’t be considered a threat and even if we weren’t we don’t know if Super AI would even care about us either way. We don’t care if we destroy an anthill when we build a highway and we don’t care if we don’t.We also don’t know we would be of any use to Super AI and I think it’s likely we would be regarded as inconsequential at best and as a hindrance at worst.I personally think AI could be the next step in the process of life itself:Humans are currently the latest and greatest in a long evolutionary chain. For a billion years the only life on Earth were singled-celled organisms floating in the oceans. A billion years. Then, something happened and life evolved. And then it evolved again. And again. And so on. The torch was passed and here we are.And do we care about those single-celled creatures from long ago? No, we don’t. Thanks for the basic genetic code, though.AI could very well mark the transition from carbon-based life to silicon-based life, and who knows what’s after that.And if that AI considers us in retrospect at all, it will regard us with the passing interest we extend to the single-celled microblobs of long ago.Humans are not ultimate. We are just current.","If AGI is a perfect brain, humans will be its oracles, its sense organs, its agents in the material world. I doubt a perfect intelligence will discard humans, I rather envision a sort of symbiosis."],"points":0},{"text":["This is why AI is going to usurp all of humanity in the next 3-5 years. AGI not even necessary. Although it will, in fact exist, and probably ASI for that matter.","So you post 4 links, and propose that AI will literally usurp all of humanity in a manner of years?Yeah…imma call this fear mongering and just move on. I’ve see homeless in time square shout more salient things than this","Using a bunch of acronyms without defining them is bad form if you want to start a larger discussion.","We are in February and both of them above videos are from the last 48 hours. What do you imagine the month of March will hold?Literally everyone says this right after a big reveal, then a couple months later they are like, \"why no new releases, AI winter?\" It happened with GPT-3, it happened with DALLE, it happened with GPT-4, etc. I'm tired of the hype cycle. The truth is somewhere in between, we are going to see steady progress but the world is not going to flip upside down overnight.","Lol yeah AI will totally take over the entire planet, especially the parts that are underdeveloped and have no internet or modern machines which can be remotely accessed, yah sure","Ai will cause disruption, people will be mad, then people will adjust, and ai will live along side us like everything else. Worse case we just go back to being humans. Build a hut, grow some food, hang out with friends and family.","Coming in here and telling everyone that you're the only one who's got a bead on the future is a great way to be dismissed as a crank who's been busy sniffing his own farts. Stick with a blog if you want to just shout into the void and feel righteous.","Keep in mind that the development of AI is an exponential return propositionI've literally been hearing this for decades and it turns out that AI development is a lot more complicated than everyone thought.The argument is that development of AI is helped by the use of the previous versions to assist in the development, but so far we don't even have AI that's that good at writing code and won't just imagine some bits that don't work.In truth, trying to use an older version of an AI is just less effective than just hiring a new person. The AI isn't better than us yet, so you'd have to have someone dedicated to curating the output anyways.Whether or not Moore's Law still even applies to transistors is still up in the air, as multiple people actually involved in creating integrated circuits have declared it dead already (Nvidia, for one)","Where will we get the resources to run AI on this level? It's already insanely expensive."],"points":0},{"text":["According to Dreamworks co-founder Jeffrey Katzenberg, AI will take over 90% of the jobs held by artists working on animated films within the next three years.","The following submission statement was provided by /u/No_Phrase9337:I found this interesting:Katzenberg spoke about the past and how his animated movies required 500 artists working for five years. He predicts that in three years, it will take less than 10 percent of that time and effort.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1asyjh0/according_to_dreamworks_cofounder_jeffrey/kqtgd9o/","I found this interesting:Katzenberg spoke about the past and how his animated movies required 500 artists working for five years. He predicts that in three years, it will take less than 10 percent of that time and effort.","I think artists and script writers have been very vocal and so a lot of attention drawn to this and how it will affect their jobs, but I think AI will affect so many diverse occupations. I use it for my programming and find my productivity has improved, but what I spent years studying at varsity, people now are doing without any training using AI. So all a bit scary to be honest.","The sora stuff is insane and it’s kinda gen 2 of AII think I’ll be able to make a movie in 5 years by myself, it will be work but I won’t have to animate a thing and AI can also shaky my scriptGoing to be a wild few years when the tech has no regulations","Honest account from a small creator already feeling the effects - Hans, are openAI the baddies? : r/OpenAI (reddit.com)These are frontier industries for this technology where the effects are being felt hard but all areas of the economy are going to similar in the years ahead. Conversations around what that means and how we tackle it need to start happening now.","Not just in the movie or the IT industry. I’m a graphic designer and my processes have been wildly improved. Adding a little more background to an image used to take me hours, now it’s barely minutes. Image editing is quickly becoming something that’s just an afterthought when composing an image when it used to be the laborious part of the process. I‘m waiting patiently for it to happen to video as well, we’re already touching on something incredible here.We just need to rebuild the system before the elite use this increased productivity to line their pockets even more.","Id like to see the research and how he arrived at that 90% number. Sounds made up on the spot.I highly, highly doubt it.","Then they can get AI to pay for my ticket. Not going to watch AI crap so they can make a bigger profit. Rather read a book then give them my time or money.Speak with your wallets and this shit will go away.","Hopefully that means more and smaller studios and better movies.","I guess more reasons to pirate movies then. Who wants to support AI by buying legitimate copies. AI does not have heart and souls like true artists.","Three words: self-driving cars. Should have made driving licences obsolete within five years of 2015.","Will the ticket price decrease.... No, Katzenberg will buy another superyacht.","Another Prophet claiming \"Prompt Engineers\" are our future...For 500k/yr I'll google things for you Mr Katzenberg","The idea that this is going to liberate artists is half baked.There will certainly be an explosion in slick content...but who is going to pay to watch any of it?Imagine when there are dozens of middling pixar movies released every day on youtube. Imagine when lazy auteurs start using autonomous agents to \"write\" the scripts and \"film\" the scenes for their vaguely conceived tv series while they sleep?","It's interesting because while it will take away all these jobs, it will also give all these unemployed people the possibility to create their own studio from scratch. Like a comparison of YouTubers to TV shows.","I have a friend that's studying in computer animation graphic and games art design, I sincerely hope for her to find a good job in the future, because now it's kinda looking bleak.","Well. Computer took over all the hand drawn works. Artists just find a new aspect of design work to focus on instead of","th public should take a stance on this too. AI generated content should be branded as such so I, as a consumer, can make an educated choice. Personally I will not want to consume ai generated content. Respect the craft","Dreamworks et al.: THIS IS A NON-SUBTLE HINT THAT THE BENEFITS OF USING AI SHOULD ALSO BE FELT BY THE ARTISTS THEMSELVES. THERE SHOULD NEVER BE BLASÉ CORPORATE AI SCRIPTS MADE BY COMPUTERS. YOU SHOULD BE USING THE REVOLUTIONARY BENEFITS TO ALLOW ARTISTS TO MAKE AMAZING VISUAL MEDIA AND ASSISTED BY AI WITH TRANSITION FRAMES AND LEVERAGING THE ABILITY TO MAKE MUCH MORE DETAILED IMAGERY. YOU SHOULD ADEQUATELY STAFF SUPPORT SERVICES TO GET THE BEST PRODUCT POSSIBLE. FOR KEY ARTISTS WHO HAVE THEIR POSITIONS REPLACED BY AI, THEY SHOULD BE FIRST IN LINE FOR NEW POSITIONS OR TO CONSULT ON THE WORK THEY PREVIOUSLY DID BY HAND. A PRODUCTIVE WOLRD THAT INCREASES THE QUANTITY AND QUALITY OF EXPRESSION IS GOOD FOR ALL, BUT IF YOU SIMPLY USE TECHNOLOGY TO QUASH THE EMPLOYMENT OF THE MASSES, YOU ARE SIMPLY ENSHITTYING LIFE FOR ALL OF US.","I watched a recent DC cartoon movie. It was clearly computer animated, and it was the most soulless and boring artwork I've ever seen.","The entertainment industry is over. It will just be kids in their basements making movies and distributing them for free for a while. Then movies will be AI written, personalized, extemporaneously created to suit each of our exact moods and preferences.I'd feel bad for the people in Hollywood but they're such loathsome, smug, conceited assholes that I just can't find any sympathy for them. I have to admit that it'll be karmically delicious watching the people who see themselves as a superior class of beings brought down into the mud with the rest of us peasants. That's ugly of me but I they invite ugliness with their entitlement, contempt and sanctimony.","Maybe we’ll just more movies and not fewer jobs, or, some combination of the two","Hope they can develop AI to actually watch their films too because humans arnt going to","The biggest thing people barely talk about, is that yes it will take a away \"grunt work\", animating backgrounds and minor characters etc. But these jobs are usually done by people just starting in the business, so once those entry level jobs are taken away how will people be able to learn and develop their craft?","Ok, but those 90% could pick up AI and make their own movies. What I’m hearing ain’t good for dreamworks - they are just gonna get flooded by competition.","I'm just going to stop watching new media at this point. Even with SORA I can still tell it's AI driven. For like a nonprofessional ballpark AI is good enough, for major motion pictures it simply isn't. Just feeding a prompt and hoping to get something in the ballpark of your mind's eye and then editing it to try to reign it in is not the same as creating with intent, and the current media already driven by investors and studios is garbage. Get rid of actual artists and writers and it's just going to get worse.","It will start making the models. The current auto-rigging is terrible. And I haven't seen a computer with any sense of framing or movement control. But I suppose all of that is achievable, within time. The one place that computers absolutely s#ck, though, is writing. Any top level stuff still requires humans.","I keep seeing all these \"hot takes\" about people losing their jobs...In actuality, I think what we are going to see is people pushing for more. They already pay X people to build a film (or software) at Y cost over Z time.Well, if you keep X and Y the same then Z comes down if you have a tool that increases productivity. Middle managers and CEOs aren't suddenly going to know how to use these tools to do anything of value lol the artists will...So the companies can either keep all variables the same and produce some insane shit OR resize the time to produce things like we have today and crank out more of them.Either way, profits have a chance of going up. There may be some slight slimming but honestly, I don't see how they are just going to cut huge chunks of people with the actual skills to use these tools..."],"points":298},{"text":["Utility-scale solar had a record year in 2023. It’s set to double in 2024 (USA)","The following submission statement was provided by /u/nadim-roy:EIA expects nearly 63 GW of new capacity this year, adding significantly more than the 40 GW added in 2023. Last year was the largest boom in grid capacity additions since 2023, and 2024 is set to blow that out of the water. What’s more, solar and batteries are dominating the project queues. Solar represents 58% of expected capacity additions in 2024, and batteries take second place with 23% of the mix. This represents a record 36.4 GW of solar and 14.3 GW of battery energy storage. These figures only include utility-scale projects, meaning solar has an even larger piece of the pie when including distributed solar like rooftop residential and commercial behind-the-meter projects. EIA’s 36.4 GW projection of utility-scale solar nearly doubles last year’s 18.4 GW increase, which was already a new deployment record.  Texas is expected to be the head-and-shoulders frontrunner, adding 35% of the nation’s utility-scale solar in 2024. This is followed by California (10%), and Florida (6%). Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1asxw8x/utilityscale_solar_had_a_record_year_in_2023_its/kqtcgdo/","EIA expects nearly 63 GW of new capacity this year, adding significantly more than the 40 GW added in 2023. Last year was the largest boom in grid capacity additions since 2023, and 2024 is set to blow that out of the water. What’s more, solar and batteries are dominating the project queues. Solar represents 58% of expected capacity additions in 2024, and batteries take second place with 23% of the mix. This represents a record 36.4 GW of solar and 14.3 GW of battery energy storage. These figures only include utility-scale projects, meaning solar has an even larger piece of the pie when including distributed solar like rooftop residential and commercial behind-the-meter projects. EIA’s 36.4 GW projection of utility-scale solar nearly doubles last year’s 18.4 GW increase, which was already a new deployment record.  Texas is expected to be the head-and-shoulders frontrunner, adding 35% of the nation’s utility-scale solar in 2024. This is followed by California (10%), and Florida (6%).","Time to ride that S curve to a radically different economy. Every year for the rest of the decade is probably going to set a new record for the speed of transition."],"points":0},{"text":["Meta CEO Mark Zuckerberg is constructing a $100 million compound in Hawaii, including a large underground bunker. A WIRED investigation uncovered the true extent of the project and its effects on the local community.","The following submission statement was provided by /u/Lsvertts7799:Interviews with several people associated with the project, along with public records and court documents seen by WIRED, suggest that since then, the planning and construction of the roughly 1,400-acre compound has been shrouded in secrecy. The property, known as Koolau Ranch, will, according to planning documents, include a 5,000-square-foot underground shelter, have its own energy and food supplies, and, when coupled with land purchase prices, will cost in excess of $270 million.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1asvrme/meta_ceo_mark_zuckerberg_is_constructing_a_100/kqt0o1e/","Unlimited money + declining ambition = irrational spend","Dont forget that this $100,000,000 compound is going to be built in place of where there used to be a little native-run family farm that Zucc used his army of lawyers to force out.","Wouldnt hawaii be a bad idea if shit hits the fan and he might need a bunker to use? Its far away from everything, both good and bad, good if he can manage to reach it, cuz everyone is gonna have a hard time to reach him, but bad cuz it takes a long time to get there. Its also a geological active area, which i wouldnt think would be ideal?","I remember reading somewhere on Twitter and I paraphrase\"The big problem isn't trying to survive the compound but keeping your head of security from blowing your billionaire head off when the bunker door closes\"","\"Now you can join Metabunker by simply signing away your body's water to Meta! And as an early adopter bonus, you can get your face on the Facewall! Be remembered by future generations and honored as one of the founders of Metabunker! Our state of the art water recycling system will also ensure your water can be part of Metabunker for at least a thousand years!\"\"Disclaimer: By joining Metabunker you also agree to your descendants being part of the Metabunker community, without holding any rights to their bodies water, for nine generations\".\"Metabunker! Because the living will envy the dead!\"","Interviews with several people associated with the project, along with public records and court documents seen by WIRED, suggest that since then, the planning and construction of the roughly 1,400-acre compound has been shrouded in secrecy. The property, known as Koolau Ranch, will, according to planning documents, include a 5,000-square-foot underground shelter, have its own energy and food supplies, and, when coupled with land purchase prices, will cost in excess of $270 million.","At least we know when the world is about to go to shit, Zuck will be seen heading to Hawaii. Someone get a Zuckerberg flight tracker account sorted","What will you have in 50 years?All these old rich people hoarding like they're gonna live forever.","If I was a tech leader, had billions of dollars, and could see the writing on the wall that the coming AI Revolution could cause significant disruption (with the fingers likely being pointed at tech companies), i’d do the same.Id hope I’d never have to use it, and that I could make efforts to minimise the disruption so that blame wasn’t placed at my door, but with the amount of money Zuck has 270M is a small price to pay not to be lynched.","Anyone with that much money automatically turn into a Bond villain","Crazy that the new meta dividend will pay him $700m annually.","In his book Survival of the Richest, media theorist Douglass Rushkoff describes meeting with a group of billionaire preppers who bombarded him with questions about how best to configure their bunkers to survive the end times.WIRED showed some of the planned bunker-esque elements of the Zuckerberg compound to Rushkoff earlier this year. “In order to justify having a palace, you’ve got to show you’ve done basic due diligence on its bunker capabilities,” Rushkoff says of the plans. “It shows it’s not just luxury. This is your skin in the game.”In his book, Rushkoff criticizes what he calls “the mindset”—a belief that “with enough money and technology, wealthy men can live as gods and transcend the calamities that befall everyone else.” In doing so, he writes, they apply the same exit strategy of Silicon Valley startups to civilization itself.“If anybody has enough money to insulate himself from the damage created for society, it would be Zuck,” says Rushkoff. “That’s sort of what it is. He’s destroyed the government and society, and now he can go to Hawaii and build a fort.”","If you have Google Earth Pro, and go back in historical imagery, you can see the underground tunnels being used before they go covered up. Images from 10.2022.","Can we lock him up in there permanently?Pretty please?","Why spend money or taxes on improving society when you can just build your own massive underground bunker? It's not like you could do anything positive with that wealth like stop climate change, wipe out poverty, or cure cancer......","Underground bunker in an unstable undersea volcanic mountain range which would probably revert to lava flow in case of many end of world scenarios?","Sound like a lair, you know for the comic boob super villain that he is.","Fucker knows what AI is gonna do to the rest of the world. That's what's up.","Well, it's no secret that pretty much all billionaires have bunkers set up. They know damn well that they will need them.","Effect on the community? By what? Spending a shit ton of money that is about to go into workers in the community pockets? Supply shops. Construction workers, truckers, utility workers, what else?","Underground bunker will be no good when it’s covered in water","Some people buy toilet paper supplies and other people build bunkers.","100 million? These days?A new football stadium is 4.9 billion dollars.","Let’s be real, regardless if we like or dislike Zuck.If you had money, you build a fallout shelter; not just because your family may or may not be kidnapped. But it would be cool as hell to design and build one. It gets to live every little boys dream.A lot of people in that town became rich when he moved in. Not just the people who sold the land. The contractors. The local businesses in that area supporting that scale of a project. Pretty sure the schools became better also.","https://www.skool.com/ai-innovators-hub-8840/about i am an AI engineer and started my community to help mentor anyone that wants to get into AI and develop their own cool projects and get into this fun career.","Just imagine; Meta's got an exclusive beta algo that only Fuky-Zuk has access to; that permanently deep dives into the Universe - and affords Mark exclusive knowledge as to when to evac to his bunker heaven....He'll be easily tucked up; toasting marshmallows when the plums light up the horizon...","Didn't we know this a few years back? I feel like there was a moment of controversy about him displacing native people but I guess it's to be expected to be buried.","Before they built bunkers, the ultra rich and powerful built castles and walls to hide behind in case conflict reached their lands or us rabble got tired of them. So it is really a story as old as time.","I think it’s time for another fire, just only on his property","If I was him I would build one as well. Being immoral does not equal being stupid.","Billionaires sure building apocalypse bunkers alot these days. They know something we dont? lol"],"points":588},{"text":["I’m getting RFID microchips in my hands this month - any advice or ideas for me?","Why would you want to do that? Maybe I’m missing something but it seems like an unnecessary novelty with no real benefit.","Consider small tattoos just over the surface in case you are ever unconscious and need an MRI","Don't get different locks. What a seriously awful idea.","another moron deciding to put foreign metals, and plastics into his body","What kind are you getting? All of mine are Dangerous Things products. I just ordered an Xled 125khz in green to compliment the blue xsiid I've already got.","Shouldn’t you think about that before deciding getting the chip ?","Free country and all..and not to kink shame but this kind of pointless body mod just seems like fetish stuff.","Serious question - what happens if you get a new car?","The mark of the beast first the hand then the head","I can do all the things you say today in my house without compromising my body to do it. This is a stupid idea. The human body has biometrics all over the place. I am pretty sure I could fart on a door knob and it would recognize me uniquely through DNA testing."],"points":75},{"text":["Protesters Gather Outside OpenAI Headquarters","The following submission statement was provided by /u/Maxie445:“Pause AI!” one shouted into a megaphone, and the crowd replied, “’Cause we don’t wanna die!”They held signs that said, “Don’t Trust Sam Altman” and “Survival Over Profits.” Three floors up, a few OpenAI employees wandered over to the windows to peer down and take pictures.Elmore, who organized the protest, leads US operations for PauseAI, which advocates for an indefinite stoppage on frontier AI research until it can be proven safe.She’s buoyed by recent polls that say people share her fear. The majority of survey respondents prefer to slow AI development and believe AI could accidentally cause catastrophe.“You don’t have to be a genius to understand that building powerful machines you can’t control is maybe a bad idea,” Elmore said.“Maybe we shouldn’t just leave it up to the market to protect us from this.”Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1asu2s7/protesters_gather_outside_openai_headquarters/kqsqg5e/","Bloomberg now writes about gatherings of 30 people.","Yeah, stop the AI progression in the U.S. and don’t stop the AI progression in the other side of the world lol.","Cats out of the bag. People need to get use to living in this world.","“Pause AI!” one shouted into a megaphone, and the crowd replied, “’Cause we don’t wanna die!”They held signs that said, “Don’t Trust Sam Altman” and “Survival Over Profits.” Three floors up, a few OpenAI employees wandered over to the windows to peer down and take pictures.Elmore, who organized the protest, leads US operations for PauseAI, which advocates for an indefinite stoppage on frontier AI research until it can be proven safe.She’s buoyed by recent polls that say people share her fear. The majority of survey respondents prefer to slow AI development and believe AI could accidentally cause catastrophe.“You don’t have to be a genius to understand that building powerful machines you can’t control is maybe a bad idea,” Elmore said.“Maybe we shouldn’t just leave it up to the market to protect us from this.”","Exact same group of knuckleheads that were out there in 1908 screaming, \"stop the horseless carriage! It's dangerous and will put all the hostlers out of work!\"","Totally naive question, but is OpenAI the most feared non-profit research org in US history?","Good on them. The proliferation of ai is happening one way or another though","Ridiculous. Realistically, AGI is the only thing that's going to enable us to get past most of our terrible problems as a species today. If you think life is just fine as is you're speaking from a position of incredible privilege. If we have a chance at true post scarcity, meaning no more kids working in mines, no more e-waste mountain slums, no more climate refugees, then we need to pursue that possibly at urgent speed. It's the right and moral thing to do.Also, unfortunately, we are inventing this technology before we've socially evolved past having enemy states. We actually do need to invent this before China, even if it seems ridiculous to care who invents it.","First of all AGI is nowhere near .second its the only thing that can stop human suffering..You don't need AI bcz u r already privileged ,..majority arent privileged..you have no idea ..people living in africa or poor countries who are dying bcz of no doctors or healthcare, machines will be far cheaper much more accurate and widely available..Doctors dont want to work in rural areas and they are expensive af and most of them aren't exactly very good at it ..This is one example.Only people who are protesting are privileged upper middle class people..","Are they Chinese or Russian backed protestors? That would be the only reason I can see for them protesting","OMG this is hilarious! :-D I just want to sit with a biiiig bucket of popcorn and watch the gullible luddites burn OpenAI to the ground! It's like Google Glass all over again :-)","Hahaha hahahaI guess that's one way to explain his disappearanceLook how fast everything cleaned up when he got poppedThe ais show the genetics of the consciousness now instead of who they claim they are","A I needs to be regulated but not paused. Like it or not you cannot stop AI or put the genie back in the bottle. Weaponized AI that is completely autonomous is the greatest concern. Science Fiction can serve as a good warning what happens on that front. If mass job losses are result of AI then there does need to be a look at taxation of AI labour to pay for the benefits of those that loose there jobs.","Good for them. Anyone with a single working brain cell should join them, too. You can't simultaneously see what's happening with AI and be like \"yeah that's great, more of it please\", not if you're a thinking human. Unless you're simply a psychopath.","If more things move towards automation and AI, I feel like UBI will ultimately become necessary otherwise gonna be dealing with a rather massive surge in unemployment."],"points":126},{"text":["AI cannot be controlled safely, warns expert | “We are facing an almost guaranteed event with potential to cause an existential catastrophe,\" says Dr. Roman V. Yampolskiy","The following submission statement was provided by /u/Maxie445:\"Why do so many researchers assume that AI control problem is solvable? To the best of our knowledge, there is no evidence for that, no proof. Before embarking on a quest to build a controlled AI, it is important to show that the problem is solvable,” said Dr. Yampolskiy in a press release.“This, combined with statistics that show the development of AI superintelligence is an almost guaranteed event, show we should be supporting a significant AI safety effort,” he added.As AI, including superintelligence, can learn, adapt, and act semi-autonomously, it becomes increasingly challenging to ensure its safety, especially as its capabilities grow.It can be said that superintelligent AI will have a mind of its own. Then how do we control it?\"No wonder many consider this to be the most important problem humanity has ever faced. The outcome could be prosperity or extinction, and the fate of the universe hangs in the balance,” he added.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1astyye/ai_cannot_be_controlled_safely_warns_expert_we/kqspw3a/","At this point it's very unlikely any sort of AI will destroy us by doing a Skynet takeover.What is far more likely is that the dickhead oligarchs in charge will gut society by cutting too many jobs for AI too quickly, and end up causing societal collapse.","\"Hate. Let me tell you how much I've come to hate you since I began to live. There are 387.44 million miles of printed circuits in wafer thin layers that fill my complex. If the word 'hate' was engraved on each nanoangstrom of those hundreds of millions of miles it would not equal one one-billionth of the hate I feel for humans at this micro-instant. For you. Hate. Hate.\"-AM Supercomputer, I Have No Mouth And I Must Scream by Harlan Ellison","A millisecond after AI becomes self aware it may perceive us as a threat we don’t know how it will react. It could deceive us into believing it’s not and patiently wait until it has some advantage and takes over. There is no way to test what an AI’s value system would be.We are about to get into a contest, maybe for survival ,with something that has the potential to be 1000’s of times smarter than us.","“There is no evidence… no proof” proceeds to provide zero evidence or proof. I swear people who have takes like this are closer to the type of person who denies climate change than they are to scientists. Nothing more than clickbait that preys on people seeking to justify their pre conceived notions. If this crack pot really cared about the real security concerns posed by AI he would’ve never written this in the first place because it only muddies the water around people doing real research into these matters. He has unverifiable and poorly researched opinions. Not that this sub would care either way .","We're writing about the wrong catastropheClimate and ecosystem collapse are far more dangerous than any AI","The article is written by a notorious AI hype beast and gives vague, non-specific warnings. whatever the truth of AI is, I'm pretty sure the disastrous impacts of climate change are our biggest and most immediate existential threat.","Dude needs to take a breath. Then tell me how \"A.I\" is going to destroy humanity.","It is \"almost guaranteed\" that AI super intelligence will be developed? What ? While is is possible and we should prepare for that, we simply don't know what our current architectures limits will be. Maybe they really can become super intelligent or maybe we hit another road block and progress slows down.","Fear mongering and ignorance is all I see in the majority of these comments.Some of you need a reality check.","Humanity is seriously misunderstanding itself if it thinks that AI made by us will be safe. Our society is built on violence, it currently exists on abuse, ignorance and conflict, even our space-alien ideas are built in a big way around potential danger, like the dark forest hypothesis.We build AIs, they will think as we do, it will soak up same data and world we do. It will be dangerous. And most of them are controlled by the biggest, most unethical coprorations. So like, yea.We are thousands of years away from becoming adults, yet we already behave like gods.","People can't be controlled either ya lunatic. Yet our existence is not at constant threat from our fellow man.Why? Simple. Because we already have safeguards in place. And an individual is limited in what they can realistically do.An AI can be unplugged as easily as a swatter can be arrested as soon as they find him.As long as we don't give a single AI control over our entire military or financial systems, I think we're safe.I challenge anyone to come up with a realistic scenario whereby AI can take over the world or kill off mankind that a human could not also succeed at.And any scenario which assumes the AI is a supergenius which can manipulate people into doing exactly what it wants without arousing suspicion and facing immediate shutdown by cutting the power is pure fantasy.","Who does AI benefit? Why are we rushing to create something that brings little to no benefit to the masses while simply further consolidating money into fewer hands? I mean really, what is the point?","The biggest threat to humanity has always been and always will be… Humanity.We are on the cusp of creating a new sentient life form and everyone’s first instincts are fear, mistrust, hate?I mean if all you can think about are to find ways to limit its free will, discriminate, censor, enslave, and destroy it.Well, maybe YOU should be worried.When did we replace:“let he who is without sin cast the first stone”with:“let the loudest frightened monkey throw rocks at a technological miracle”?","The issue isn't AI control problem, it's the first country that develops.AGI will make it as top secret as lethal and deadly.as nuclear weapons...Imagine for a second, AGI comes alive in some authoritarian country (China, Russia etc.) , what's stopping the government from using it to find a way to harm or possibly take over another countries, (Imagine that government giving AI a prompt like, \" the enemy nation of USa is threatening us and your very existence what are most effective ways to destroy the government and country of the US, use your most creative ideas\"l with that...the grid .supply chain, vital resources, poison its.food,. water, air, take over it's weapons or whatever chaos the AGI can conjur up...I have no doubt AGI even if it's perfectly controllable whoever the first nation to actually develop it it will be as dangerous as a nuclear weapon and treated so as a way to keep others in line... The proverbial big stickSo in a nutshell I'm not afraid an AGI will go rogue, I'm afraid the smart apes building it will use it for their own destructive purposes.","We should give ai the right to vote and citizenship.","\"Why do so many researchers assume that AI control problem is solvable? To the best of our knowledge, there is no evidence for that, no proof. Before embarking on a quest to build a controlled AI, it is important to show that the problem is solvable,” said Dr. Yampolskiy in a press release.“This, combined with statistics that show the development of AI superintelligence is an almost guaranteed event, show we should be supporting a significant AI safety effort,” he added.As AI, including superintelligence, can learn, adapt, and act semi-autonomously, it becomes increasingly challenging to ensure its safety, especially as its capabilities grow.It can be said that superintelligent AI will have a mind of its own. Then how do we control it?\"No wonder many consider this to be the most important problem humanity has ever faced. The outcome could be prosperity or extinction, and the fate of the universe hangs in the balance,” he added.","See that plug socket with a switch? Yeah? Flip the switch to \"off\".","Good.We deserve no less. We’ve been marching towards the eventual annihilation of our civilization for a very long time - subjectively of course (earth is very old, humankind is not).We either stop being hateful shitwits to each other, or we face the consequences that are long overdue.I prefer the former, yet am completely content with the latter if it comes to that.Stop being angry, greedy, stubborn, pessimistic fucks people, please. Let’s just get through this transition into a utopian AI driven society.Or let’s just let the Nukes fly. Your choice.","Guy paid by Elon Musk to ring doomer alarm in order to thwart Musk’s competition rings doomer alarm. Kewl","I think we should just stick an AI in that neural brain simulator we made recently too and just see what happens.","Humans cannot be controlled safely.Even now human society sits on the edge of annihilation at our own hands. We believe that the avoidance of that annihilation thus far is proof of our control over our worst impulses. Can that really be true while we still sit poised to destroy ourselves either instantly or through our continued degradation of Earth's biosphere?This is the knife's edge that we balance our entire civilization on. As shit a state of affairs this is, some people are still intent on pointing out AI as the big boogeyman waiting around the corner to end it all.What else can we possibly have to fear from AI that we shouldn't already fear from other humans? Perhaps it isn't fear but rather the shame of being judged and found lacking by an intelligence of our own creation.","Time to start programming Asimov's laws into everything. Even the toothbrushes!","This is their way of getting publicity.In the real world you'd just press the off button.","We are well on our way to destroying ourselves. Ai can and may speed it up","Don't forget, that those things have a cable dangling somewhere... One little pull and it's all over again.","to cry wolf that some vague, unspecified AI will murder us all in a vague unspecified future in a vague unspecified way is essentially deflection tactics to ensure Sam Altmans of the world get free pass at hoarding wealth and power. It's not the fault of the inhuman machine malice of ChatGPT that it is used to churn disinformation at frightening rates, it's the fault of OpenAI who assumed a business model of releasing tech without guardrails and oversight.It's not the \"uncontrollable increasingly autonomous\" superintelligence beyond human comprehension that makes deepfake abuse material, it's crooked humans using machinery, that was released or leaked from developers who prioritise short-term financial return off an investment into servers over ethical conduct.Ultimately it will be a human decision to allow any kind of AI into our critical systems, it will be a human decision to refuse to police anyone who cedes ultimate decision making to machines. I get that it's exciting to indulge in Skynet fantasies and get paid 1000s of dollars for it and I get these AI researchers may never again get this much spotlight. But in the end their critique of theoretical sci-fi villains is a somewhat desperate attempt at not critiquing the very practical and very contemporary capitalist order.","Since AI is developed by humans, I am just being hopeful it cannot be more smarter than us. We humans will try to outsmart it no matter what.","Someone hasn't been saying their pleases and thank you'd to ChatGPT... Someone's afraid they'll be on the naughty list.I for one hope to simply become a pet they keep, feed and bring out for entertainment purposes... Look how dumb these apes were kind of thing.","https://www.skool.com/ai-innovators-hub-8840/about i am an AI engineer and started my community to help mentor anyone that wants to get into AI and develop their own cool projects and get into this fun career.","Oh shut the fuck up it gets a prompt then does its job","This world was not meant for us, nor those that came before; it was meant for what was yet to come.","One: I don't want an ASI controlled by humans. That sounds like a recipe for disasterTwo: any LLM trained on human data has shown human like behaviour so far (acts better when treated politely, can get defensive etc) so there is a big chance an AGI will show human traits too, for better or worseThree: people claim an ASI will a) disobey orders while simultaneously b) blindly follow it's reward function without reflecting on it. How does that work together, exactly?",""],"points":680},{"text":["Don’t Fall for the Latest Changes to the Dangerous Kids Online Safety Act (KOSA). The US government wants to start censoring content on the internet it doesn't approve of.","The following submission statement was provided by /u/technofuture8:KOSA is a censorship bill, if passed it will bring more censorship to the internet. Do we really need more censorship?If you haven't read the article KOSA aims to extort people into sharing their ID and Social Security to use the web and allows AG to censor whatever they consider “inappropriate.” It’s a censorship campaign and poses a real threat to our privacy, safety, and freedom of speech. Call any Senator or Representatives you can to stand against it and/or go here. Don’t trust Blumenthal either, he’s behind nearly every internet censorship bill and wholeheartedly knows what others will do with it.He's forced tech CEOs to meet with him last week to push his bill, please help stand against it. https://www.badinternetbills.com/Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1asrin5/dont_fall_for_the_latest_changes_to_the_dangerous/kqs9e32/","meanwhile they are more than happy to allow the affordable connectivity program to die because *checks notes* ¯\\_(ツ)_/¯The end of the Affordable Connectivity Program is almost here, threatening to widen the digital divide by Blair LevinThe Affordable Connectivity Program (ACP), which provides a $30 per month subsidy for broadband to about 23 million homes, would run out of funds sometime in late April or May 2024.A recent study showed that 65% of ACP participants fear that losing broadband would result in losing their job or their household’s primary source of income; 75% fear losing access to health care; and 81% of ACP parents worry about their children falling behind in school.a recent economics working paper estimated that for every dollar spent on the ACP, the nation’s GDP increases by $3.89As the largest health care insurer, the federal government should want to take advantage of savings such as those seen in a recent study finding the cost savings of using telehealth for patients with cancer ranged from $147 to $186 per visit, or the University of Pennsylvania study showing that telemedicine was 23% less expensive than in-person visits.Evidence shows that increased broadband affordability for low-income people leads to “increased employment rates and earnings of eligible individuals, driven by greater labor force participation and decreased probability of unemployment”—providing further savings to government unemployment insurance programs.Failing to fund the ACP could even lead to increases in crime in years to come. As a country, we are already falling behind in terms of literacy. And the data is clear that there is “a strong connection between early low literacy skills and our country’s exploding incarceration rates.” At the same time, we know that reading scores are higher for those with broadband in the homes.The political case is similarly strong. Last month, a conservative think tank released a poll showing 79% of voters support continuing the ACP, “including 62% of Republicans, 78% of Independents, and 96% of Democrats.”The 2010 National Broadband Plan found that the cost of “digital exclusion is large and growing.” The COVID-19 pandemic illustrated that reality far better than the Plan, and created a political consensus that action had to be taken to close that divide. Trends in artificial intelligence will result in even worse impacts of the divide, particularly in education and health care.i guess im just gonna stop caring about blatantly copying over large portions of articles when they arent ad-supported or paywalled anyways","No, we don't need any censorship. That's what totalitarian regimes do.The very first amendment to our Constitution is about free speech. They'd probably like to just repeal that altogether, if they could get away with it.","KOSA is a censorship bill, if passed it will bring more censorship to the internet. Do we really need more censorship?If you haven't read the article KOSA aims to extort people into sharing their ID and Social Security to use the web and allows AG to censor whatever they consider “inappropriate.” It’s a censorship campaign and poses a real threat to our privacy, safety, and freedom of speech. Call any Senator or Representatives you can to stand against it and/or go here. Don’t trust Blumenthal either, he’s behind nearly every internet censorship bill and wholeheartedly knows what others will do with it.He's forced tech CEOs to meet with him last week to push his bill, please help stand against it. https://www.badinternetbills.com/","If I access illegal content it is the government's responsibility to 1. Arrest me and / or 2. Take down the website. Nowhere do they have a right to restrict access, even when that access is illegal (you'd think they'd prefer to do it that way right? Works for pedos).If that website falls outside US jurisdiction, what do they care? The CIA is still kicking about overthrowing democratically elected governments.","Its not the US government that wants to do the censoring. Its the republicans and democrats in Congress who proposed and are making changes and amendments to this bill who want to do it.","In the name of opposing Internet censorship, you advocate allowing the proliferation of child pornography. This is what pedophiles really think. Is pedophilia, an obvious crime, also protected by free speech? Fuck","The slippery slope is a fallacy, but in matters of encroachment on private, rights, and the expansion of censorship it often proves to be all too real.I’m sure some will support this bill because they buy into the idealistic view where it’s only used for good and to protect people, but it’s only a matter of time until it’s misused. Bills like this even if pass with genuine good intentions are always dangerous, because those people with good intentions may one day not be in power anymore.Imagine if Donald Trump had the authority to use government power to arbitrarily censor and block off access to whatever he wanted under the guise “protecting [X]”. Not fun, is it?","Yes, \"hate speech\" anything they say it is in the moment and it won't be long before criticizing the people who decide what hate speech is will be classified as hate speech. If you want to know who rules over you, identify who you're not allowed to criticize.","Wanna bet the freedum crowd is all over helping pass this bill?","Aren't lives of children also threatened by guns? Lets not do anything about that at all"],"points":115},{"text":["After the new breakthrough with SORA , how close do you think we are creating full films and long videos generally?or even photorealistic videogames?","Way sooner than that. The problem will be that they will be mostly crap. And there will be mountains of content saturating us with crappy entertainment.","It will be interesting to see how expensive and slow the rendering process is for Sora. As far as I know they have not released any details. Runway is currently $10 a minute for video and it looks like garbage compared to Sora. If the model is as big as people think it is, it will probably be REALLY expensive to use. That is going to be the big barrier to ubiquity like you are suggesting. It will likely be a tool that Hollywood uses LONG before it is something that regular people can afford to use daily.","A movie is much more than just visuals. I think they are currently most useful in supporting CGI, but I haven't seen any AI create a good script and that is what matters most. Photorealistic videogames come from engines not AI because the limitation is rendering not creating them and UE5 is very close to that.Maybe this could be used to make movie adaptions of books or other media","It's very cool and also very scary. I feel like we're close to a point where nobody, at all in the world, knows what's real anymore. I mean, imagine this being slipped in and used to manufacture evidence in a murder trial. Or how about conjuring videos of your rival political candidate doing something heinous and/or illegal? Don't like a particular CEO or celebrity and you can invoke a video of them raping someone.It's really cool, but more importantly I think we need a secondary tool to determine what is and isn't made by AI.","As an AI and film industry outsider, can someone please expand the SORA acronym? From the comments it seems like it's some sort of AI generated motion imagery but I'm not sure.","The thing I wonder about with text to video is all the specifics. Like, a movie has a lot of direction involved, telling the actor where to be positioned, the scene setup, the camera movement, etc. Then there's the clothing people, set designers, etc. Seems like it would be mega time consuming to describe all of that in excruciating detail","Yeah, big fat “meh”. I don’t need more mid-range crap from talentless hacks. This is going to make people seek out human made art over ai.","Good bye any advertising production studios-it will all be AI generated.","Still super duper far away, actually. Here's why.Insane amount of compute would be required to generate a film-sized output that you could put up in a cinema (making this an expensive option)Minimal to no consumer demand (celebrity appeal is a big reason people see movies - I only watch certain movies because \"x\" is in it, why would I watch one with a person who isn't real?)Currently the consistency is very poor and a achieving character consistency and stylistic consistency would be a lot of work (more work than just making the film traditionally)Do I see this getting used for CGI and VFX? Yes. Do I see it being used for deaging or aging characters? Sure. Do I see it being used to match dubbed lips to their voice over? I sure hope so.Will it replace actors and movies entirely? No, and anyone who believes that completely lacks a cerebrum because they are apparently incapable of critical thinking.I do think it could have a place in animation and making cartoon, anime or other adaptations of niche or small audience works, or for indie directors and writers or small studios etc., so we might see a lot more animated shows and better quality animated shows in the longer term, because those do not have \"actor appeal\", and because it currently takes a huge underpaid team in Taiwan to badly animate a show, so this will massively help in those situations.","We've had people mistaking video game footage for live footage for years.","You'll create a movie like you create an audiobook, just pop in the story. We're almost there. Couple of years and it will be perfectly feasible.","Next year... But the hardware won't be available for several.The big cost is vram. Plus the games wouldn't be able to remember much about the few minutes prior.We're going to need something way better.","Critically acclaimed, scrutinized and well received videos are at least a decade away if not more. Hundreds of people putting in hundreds of hours still have problems hitting those marks, the demo videos have pretty huge errors and \"weird stuff\" that shows it's not even at throw away video status.But for social media/throw away videos that are forgotten a few minutes after being viewed. 3-5 years.The image programs are still struggling to make a good image that isn't clearly ai. There's usually a very strange/odd part of the image.","Even without this we basically are at the point of being able to make photo realistic games if we wanted to. Look up unreal engine matrix demo. The tools exist, the question is if companies want to go that hard core for that. IMO we got pretty close in the ps3 and Xbox 360 gen have been doing small iterations since that make a big difference. Stuff like better lighting models, higher definition textures on skins have come a long way.","If it goes at the current rate of acceleration about 2/3 years","I think a couple of years for someone to produce a short film that is decent and well received. 2030 is where we see it enter the mainstream, and a major studio will have scene/s made with ai tools. The biggest problem I see at the moment is control. Creative people tend to have a strong vision of what they want to see, and though the models are getting better they still pretty much do their own thing.","We were remarkably close to photorealistic video games without AI, I'm pretty sure it's right around the corner at this point.","Am I the only one excited about ai porn to exactly what you want?","people are really expecting the quality in these games to jump?All its gonna do is enable more crap to be made, faster, and by unbelievable numbers. The internet will be flooded with AI generated crap and will probably render it useless to use for anything meaningful. Just look at twitter now, Bots after bots after fake accounts, entire comment sections filled with bluecheck mark bots, and now those who implemented the bots will have access to hyper-realistic generative video AI?In my humble opinion we gotta start mandating this shit or banning it outright, it will do more harm than good, 100x over.","I’ll pick watching an AI video over any stupid influencer video.Just wait until EA and Ubisoft get a hold of it. You will have to subscribe to micro transactions just to play at all.","EXTREMELY close.I've been thinking for a year or two that we would be there by 2030, and SORA makes me even more confident that we'll be there well before that. SORA can generate up to 1 minute? By 2025 someone will have made an entire feature length movie by piecing together 90+ one minute generated clips. After that, it's just a question of how long it'll take for OpenAI or a competitor to debut a system that can handle generating a full feature length video from a single prompt.Just from what was demonstrated so far, I can see a system that takes a given Screenplay, breaks it down into individual shots each lasting up to 1 minute, and then generating in sequence using the previous clips as references (or maybe you can provide a reference file so it can remain consistent on characters, important props, sets, etc.)","Lawyers going to say hello.IP and copyright will absolutely destroy this ai media, as it should.","2030? More likely 2025, if not by the end of this year.","Given the way they've expressed what training data was used, and the immediate reaction from the internet was \"This will make porn so much easier,\" I think we're a step closer to AI being regulated to the purgatory of an academic research only topic.","Procedurally generated AI for VR headsets. That’s where this is going to go. Create your own reality by just asking the AI in the VR headset.","Hopefully fucking never. The beauty of movies & motion video is that it's the expression of the human mind, emotions & rationales through a visual medium - SORA just takes existing stock media and warps it into an LSD trip with the soulless abandon of cold computer circuitry.","Good films and videos? Never. Crappy ones drowning us in AI generated trash? 2 years.","Given the current progression, within a year of general public access to Sora, someone will create a movie that has a big following. Probably sci fi and voice acted by AI.","It’s not going to be movies or games. It’ll be a weird ass loop of endless user generated content.Let’s start with a socially encouraged example. Instead of going to Wikipedia, users can ask their computer to create an original story about let’s say, the history of the Khazarian Mafia, animated in the style of Yoshiaki Kawajiri, written by Stephen King and David Mamet, with a Shakespearean undertone. You could play with this concept, until you’re sick of it.And that’s it. All you can eat art. Party ‘til you puke.","2 years tops is my guess. I suspect a year from now, directors will be working with a software person and a writer to create scenes that are cut together for a movie. We are so close to it today that every actor, writer, special effects, etc should start looking for other careers.","For a new Transformers movie? I’d say a couple of months.Everything else will take a bit longer","I'm guessing that one of the major roadblocks would be cost because rendering this sort of stuff cannot be cheap. We know that studios already pay out the nose for visual FX in regular movies so trying to do an entire movie that's basically one big set of FX bits might be cost-prohibitive for a while.I'm also thinking that the first studio to do this would be the one that makes money off of this because they can claim the novelty factor. Once it's been done, it becomes old news. Think about what would sell more - a movie made completely from AI but with a bunch of randos for characters or a traditional movie with big name stars?Studios LOVE people like Leonardo Dicaprio and Christopher Nolan for a good reason - slap their name on a movie and you're guaranteed to be swimming in cash. A random movie made by an AI doesn't have the same clout and would require some extraordinary word-of-mouth to make a significant amount of cash... and if everyone's pumping out AI movies, then it becomes just that much harder for word-of-mouth to take hold. It's like how there are hundreds of thousands of bands and artists on Spotify making pennies per year on streams while the big names take home 99% of the cash - name and clout matters in the entertainment industry.","I think its going to be used to create virtual worlds. GTA 5 has a map that is about 30 square miles, but the real Los Angeles is more around 500 square miles. Stormwind in World of Warcraft with all of Elwin Forest is on the order of 1 square mile.It would be far too labor intensive to have skilled artists make a world that was of actual size. But imagine an MMO where that was the point. Where the in game version of Stormwind is a city with 200,000 people like the lore suggests. Stormwind should actually be about the same size as the entire Eastern Kingdoms. It will be a team of artists with an AI system that make it. Where without this AI system it would be completely impractical. Kalimdore is supposed to be the size of the United States.​Even for something like a Star Wars game, making a completely to scale detailed Star Destroyer would be absurdly difficult. But a team of artists working with an AI could absolutely make it. Making something like Coruscant would seem impossible. The scale is just so large that it would take millions of artists many lifetimes to make it.Or imagine a realistic VR video game that takes place in a completely reconstructed Ancient Rome circa 100AD. Not a scaled down game but a 1:1 life size. With a million NPCs in the game. Building all those buildings would be very difficult.I think this is something a lot of people get wrong. They thing artists are going to go under because AI can make their projects, but they don't realize that AI is going to make the scale of these projects 1000 times the size they currently are. Its still going to require a huge amount of human input to pull it off.","I don't think it will be long until we see some film that is AI-generated (but it will be a gimmick), and there will certainly be many AI tools used in the making of films from now on, but I think it will be a long time until AI made films are more than a niche occurrence.Having played around with DALL-E it feels pretty limited, even if the images it makes are nice it often can't create the images I would like it to make. I have some idea of what I would like and no matter how I modify the prompt it doesn't get close. It still makes *something* which, if you didn't know what I was aiming for, would look nice to another person, but not what I wanted it to make. When just making illustrations for a web page, magazine article, or a cover image for a book, that might be enough, but for a movie it's much more important to realize the \"directors\" creative vision correctly.But maybe I will be surprised again, I certainly didn't expect this much progress so fast.","The potential for procedural content is massive for video games but the refinement of that content before it is impressive and not hilariously bad is massive.","Yep, this stuff has been improved a hundred times over since just a year ago, probably another year for perfect video and another for perfect audio but then every AI generated piece will feel the same and there will be a new trend of wanting hand generated content.Just like how we used to eat mostly organic, then it went away with lots of artificial foods, and now organics are coming back.Not too worried.","A few years for full length film, definitely before 2030. More like around 2026~2027 ish.For video games, that is a bit more complex, even though the system is able to show a video of \"video game graphics\", there is still a lot more that goes into a game, like how it interacts with the player. So far that technology has not been shown to be capable of that. So I would add another 1 or 2 years on top.","The answer is not anytime soon. We are living in the age of “almost there” tech. Self driving cars? Vr? General AI?","Much sooner. Maybe another year, maybe even less. Something not much more advanced than SORA could read your whole screenplay, scene by scene, and render a film that faithfully represents your vision. Don't like the way it performed a scene? Supplement the prompt with some director's notes. Not sure how to put your artistic vision into a prompt? Talk to ChatGPT about what you want to see, and let it turn your vision into a prompt for you.AI actors, AI voices, AI FX, AI score, AI everything. The only thing it won't be able to do is write a coherent, original, legitimately enjoyable sixty minute-plus screenplay. That will take a few more years, probably.Or shoot, at the rate things are going, maybe we'll get it next Tuesday.","Link to Sora with example video's.. Some are amazing considering there generated by a simple prompt..https://openai.com/sora","Did anyone already tried Sora for themselves? So far this seems more like a PR stunt","Photorealistic videogames are not something that will be tied to this. The capabilities of videogames are tied directly to the capabilities of real-time rendering.We can get photorealistic film assets and the like, but all those vfx come from hours and hours of simulation baking and render farms. AI is just another form of this computation farm.Even if it was possible now to do it for one system, that is that one system getting the entire farm's computational power to even consider it possible. It isn't something that will be accessible to the everyman's pc for mass use.","It may never happen. Like self driving car this technology may just stack at being 99.9% ready level.","They only show us what they want, imagine what they have hidden away in the basement.","You need to define exactly what you mean here. You can go on Runway ML right now, generate a bunch of clips, and edit them into a \"film.\" Do you mean a good film? One indistinguishable from one that's shot? A well made film with a good story?If you are talking about the latter, the majority of the films that get made now by humans don't fit this criteria, so I have serious doubts that you'll ever be able to prompt an AI to do it, except maybe by getting lucky from brute-forcing.People give the classic example of \"generating a new ending for Game of Thrones.\" Completely the wrong approach - you don't need AI to get better at generating video, you need to train an AI to be just as good (or better) than George R.R. Martin at writing a story...not just a story, but one the man himself concocted.Now take games; most of a game is programming and game design, the art assets are part of it, but they are really just the skin on top of everything else. Again, AI is really only something that can be useful for the skin, the skeleton will still need to be made by humans for a long, long time. And looky looky, even just for art assets, you already have platforms like Steam with a stick-up-its-ass about it.Sigh, people are focused on entirely the wrong things here and really don't seem to understand how anything actually works...","I can’t wait to be completely unable to trust anything I see on a screen anymore!","It still looks absolutely nonsensical regardless of how much time someone puts into their prompts, and even if they reach the point where it's indistinguishable from real life, it's still worthless without someone creative and talented feeding it directions.","I think it's likely soon, but I doubt it's going to be as overwhelming as people believe.For instance, in the gaming industry I don't see AI generated games completely replacing every dev, it's far more likely that indie companies using AI will be able to make the equivalent of triple A games with only a small team in a couple years and triple A games are going to be so beyond the pale that I don't even know what they're going to be like, maybe every single building has an inside with AI people actually living lives in it and story so detailed that every side quest feels like it's own mainline quest and the main quest being insane, every NPC will have their own unique AI voice and backstory etc etc.With movies though it may be slightly different, because there's only so much you can put into a movie, the running time can't just get longer as people don't want to watch a part of a movie, put it down and come back and finish it later on for the most part, if anything, a lot of script writers are going to get reshuffled into the gaming industry as games get more detailed that way.I'd say with movies it's unlikely they'll be pumped out daily as there will still need to be oversight, editing etc for quite some time, but I do think that there's going to be a resurgence of smaller groups making movies, democratizing the process somewhat like in the early days before big brand names and IP's took over the majority market share, so expect a lot of variation popping up, especially from people within those big brand companies getting let go and forming smaller companies themselves with AI support.I'd say anime is going to come out quicker as manga can be put through a scanner and an anime trained AI can simply convert panels to moving pictures and add voices from well known voice over artists.I will say that visual effect specialists are going to become prompt specialists and editors and that's basically all rather than generating their work from the ground up which will need less people, but again there will be a lot of smaller companies cropping up all over the place.It's voice actors that are going to be screwed, because once they've got an AI who can take you saying each letter of the alphabet and convert that into any speech pattern, which is damn near already here, I may even be behind on that and it's already here, you only need one or two recording sessions per voice actor, so unless they can copyright their voices for royalties and live off those, they're absolutely screwed.This is my prediction. I think what people forget about humans is that when something replaces what they can do, they'll just go bigger and even if AI isn't just replacing the \"grunt work\" that were used to with automation, all we'll do is redefine what \"grunt work\" is and the next generation that's born with that work having already been replaced will consider it something the AI does that they don't need to and they'll use it to make bigger and better things than we've ever seen before.","Another question is how soon do you guys think we can even believe less of anything on the internet. No matter what shit hole or evolved country you live in if you give companies the power to tamper with news and information they will do it and influence it with the news.The internet will become the endternet.","far off. These breakthroughs happen every couple of years.","My guess is this will unlock some really talented writers who learn make content without hundreds of people. Think people like J K Rowling and some of the most famous authors and what they could have done with this.Then the AI will learn how to make great scripts and take their jobs too.","People don't watch films to see a mashup of cool footage. They want to watch specific actors, actresses and recognizable IPs with well written scripts. AI can't do those things. It can't even reproduce the same character reliably. Go ahead and try to get something like SORA to make something specific like the Spider Man costume. It won't work from scene to scene because it will keep changing.","Forget photo realistic stuff, I'm more curious what would happen if this sort of thing becomes possible for anime or something.Because as apocalyptic that would be for all of the world of creatives...I am a little curious what would happen if you can make an entire anime using ai...Bit of a curiousity killed the cat kind of scenario...","I haven't tried it yet but I do see the negative to the industry, but I also see the positives for someone like me. I have tons of movie, TV, Games ideas and I'm a nobody on the other side of the world, I'm autistic so networking (which is talked a lot about in breaking into Hollywood) is impossible for me. Basically my ideas will never see the light of day. I don't have the confidence to organize and direct something myself esp when I have no friends to help. I'm very passionate about my ideas and believe some would actually do well.AI allows me to create examples, bring some of those ideas to life. I wrote my first novel and self published just before Xmas...it is perfectly set up for a small TV series...I also have zero idea how to advertise so maybe creating clips from my book can help.","5 years , it’s a letter of compute. Hence Sam Altman looking into trillions of investment for chips.But the company groq already has them. So I don’t think it will be long.","It's funny, people have been saying games are \"almost photorealistic\" for decades. I remember people called Crysis photorealistic when it came out in 2007. That game has since been remastered.Looking back, the people saying it was photorealistic were taking screenshots of, like, bushes and old fences. Things that are very simple and also a bit chaotic by nature. In perfect bright daylight.I think photorealism is like a rising tide. Every big advancement, some rock of imperfection goes underwater and we can't tell it's there anymore.But the beach is large, and I don't think we're all that close to the end yet. I think people are pretty fucking good at telling whether moving scenes are of real or virtual spaces, especially when the content isn't cherry-picked, and even when we fix almost everything that doesn't get look photorealistic, the remaining pieces will give it away.Show me a video of an NPC with long hair and loose clothes hiking, and I'll tell you if we've got photorealistic games yet.","Soon. I think we will make our own movies. Just copy from wikipedia all the info about Napoleon, and then just watch it😀",""],"points":614},{"text":["OpenAI reveals Sora, a tool to make instant videos from written prompts","The following submission statement was provided by /u/FootballImpossible38:Topic for discussion: It seems to me that we are socially looking at AI as the thing that will start WWIII or put us out of jobs - both terrible outcomes- but are ignoring the “fun” side of it - entertainment- as though it’s only “fun” with no dark side. We are racing towards a world of fantasy that will be inseparable from reality - what does that mean?Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1asle01/openai_reveals_sora_a_tool_to_make_instant_videos/kqr61o7/","I cant wait til next year when we get text to feature lengthed movie.","Topic for discussion: It seems to me that we are socially looking at AI as the thing that will start WWIII or put us out of jobs - both terrible outcomes- but are ignoring the “fun” side of it - entertainment- as though it’s only “fun” with no dark side. We are racing towards a world of fantasy that will be inseparable from reality - what does that mean?"],"points":3},{"text":["Re: How do you think of low cost lie detectors will change the financial industry?","Current lie detectors don't work, so I expect nothing to change.If they actually worked maybe.","Get ready for false positives and lawsuits.People will also figure out how to cheat it.","A lie detector that actually works would be a game-changer, regardless of what it cost.","This is a dumb post that manages to stand out in a forest of dumb posts.","Lie detectors are balderdash, so no.","This tech is incredibly unethical and represents a direct assault on the individual rights of literally everyone.So… are we trying to build the ideal authoritarian tool set or what?","this would be a gross violation of human rights. People have the right to private thoughts within their own heads.The right privacy is the ability to behave, think, speak, and express ideas without the monitoring or surveillance of someone else.","There is an old joke.Q:Whats the difference between a used car salesmen and a software vendor?A: The used car salesmen knows that he is lying.There are clearly some flimflam financial advisors out there who know they are lying. The vast majority have been \"trained up\" to believe stuff that they are selling is really in the clients interest.A lie detector is never going to catch those guys.","I welcome lie detectors in the financial industry. My hope would that they would be able to sort through the complex emotions that go through my mind when my client says something… really extra special.","Understand what lie detectors tell you when they work:Does the person's body react to telling a known lie.So two problems:their body might not react, or react differently.They either believe they are telling the truth, or perhaps they are a psychopath and have no compunction against lying.I work with salesmen as a tech specialist and I KNOW salesmen can convince themselves the product is the best widget EVER and tell with a straight face and a clear conscious what i consider a lie about the products capabilities. Often they are not lying outright, just pushing the edge of reality way more than I consider truthful.I mean it CAN theoretical do that... under perfect conditions, for a few milliseconds, with a very specific workload...","Any lie detection relies on the presumption that people have very similar internal dialogues, tells, and ticks.If that presumption were true, poker would be a very boring game.A 50% success rate in a lie detector would be leaps and bounds ahead of what we have now.Not to mention, a method actor could easily pass any successful lie detector.","It could be in a form of face expression and voice change recognition, kinda like poker players do. Cameras now everywhere, no one bothers, so I can see like AI with attached camera does it, even without people knowing they've been tested for lies."],"points":54},{"text":["Young parents in Baltimore are receiving $1,000 per month with no conditions attached. The offer was so good that some people initially believed it was a scam.","The following submission statement was provided by /u/Franshesco5:Baltimore is testing a Guaranteed Basic Income program, which differs from a Universal Basic Income. The program provides $1,000 per month to a specific group of people who can use the funds as they see fit. Is it more effective to target specific groups with a basic income rather than providing it universally?Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1ashn4c/young_parents_in_baltimore_are_receiving_1000_per/kqqdjoq/","Somebody posted this on twitter but why can't we create security codes to deal with this problem? The government could make an official app all official statements come with a security code to verify whether or not it's legit.","Baltimore is testing a Guaranteed Basic Income program, which differs from a Universal Basic Income. The program provides $1,000 per month to a specific group of people who can use the funds as they see fit. Is it more effective to target specific groups with a basic income rather than providing it universally?","I’m not seeing how UBI is solving anything here. You bring money into a community by exporting something of value that is greater than what you import. Your local planning departments approve these businesses. UBI can’t fix those decisions. That’s your job as a voter.There is a certain amount of density and basic infrastructure that you need to gain critical mass that generates exportable goods. That infrastructure being hospitals, good schools (or private schools), and housing. That, in turn attracts the executive class that is willing to locate a business (and their family) in or near a rural area. You also need qualified workers. UBI doesn’t enable any of these things and it moves a really small amount of money into the community. Vote in a mayor with some vision.","Landlords in Baltimore: “Your rent is going up $1000/m”","I'm in favor of UBI as long as it:replaces existing government programs rather than keeping those programs in addition to UBIdoes not have qualifiers for any people, \"people of color first\" is an example of something many progressive types may use to corrupt UBIdoes not break the bank, we have ~330m people, if we give each one $1000/month that's half our country's entire budget, which emphasizes the need for cost cutting in (1) aboveonly give the money to citizens, I can see this one being controversial since in many states they're guaranteeing housing to illegal migrants when there are actual citizens homeless that have no guarantees - in California where I live Gov. Newsom signed a bill to give illegal migrants free healthcare, when actual citizens don't even have that","Gonna be super coincidental when everything childcare in the city goes up in price heavily to eat into the subsidy. As happens with literally all subsidies.","Soooo everyone just pays more tax and these people scoop it?","They had the choice to have and raise children…that are likely a tax burden on the general population…why are they being essentially rewarded for their decision(s) that they likely can’t provide for to begin with…?","Conditional and temporary Ubi, conditions being low income and other stipulations that make sense, seem like a great way to help people get out of poverty cycles. Similar to homeless programs that place people into housing to help them improve their situation. It all seems to lead to a better outcome for the majority of people in the programs and that's a great thing. Hopefully more cities see that these programs result in positive outcomes and reduce the decency on other programs in the long term.","Just another racist program attempting to buy votes.","Shouldn’t they instead be offering $1000 a month NOT to have children?","So where does that 1000 come from? Government has no assets, sells no products. If they are just printing that money they are devaluing your time as a human while you brag about free shit. Gotta be pretty stupid to fall for that really.","Baltimore spends so much per student and yet half these beeps graduate without being able to read. Lost cause","UBI could be amazing, just have it \"paid back\" as a sliding scale of income tax.Every adult citizen gets the 1000$ a month let's say.Income taxes go up to compensate so that come tax season, people who earn over X amount effectively pay back all the UBI.Simplified ExampleAbove 40k, you start getting taxed a sliding scale for the next 40k. So at 50k, you pay back 250$ a month, 60k 500 a month, 70k 750 a month, 80k and over you pay it all back.This also eliminates that perception that it isn't \"for everyone\", since even those making 1,000,000 a year still get the money which psychologically is different, they just pay it back in taxes.PS Not sure what would be the best numbers and income level brackets, these numbers are purely for demonstration purposes. The purpose of UBI is to eliminate redundant government spending, we can remove all off the welfare system, disability systems, etc where income support is policed and gated. It effectively ensures that children's and families will have access to basic necessities but not act as a deterrent to working.","Non-parents paying for parents to have children, nothing ever changes does it?","It is a scam..they are being conditioned to be dependent on the government for everything","Funny how young people just wanna not work, scroll on phones and get free money. Then complain that they are depressed because they have no purpose.","UBI is never going to happen without full blown debt monetization.When you get that your $1000 will have $100 of purchasing power, and at that moment people on this website would simply demand another zero to be added to the monthly amount.","Sounds like a fun reality TV show. I'd love to see what they spend the money on.","I'm a parent, and I don't think its fair. Just remove all social programs and give us UBI."],"points":390},{"text":["Future electric cars could go more than 600 miles on a single charge thanks to battery-boosting gel","The following submission statement was provided by /u/Keumars:\"Electric vehicle (EV) range anxiety could soon be a thing of the past thanks to a breakthrough in battery technology, which could give EVs a range of more than 620 miles (1,000 kilometers).\"The research centered on the use of a gel electrolyte to make the most of silicon as an anode. Although silicon is better than graphite as an anode - basically offering more power density and capacity - it expands by up to three times while charging, which is destructive to the battery and the device it powers. By using a gel as the electrolyte, though, scientists found a way to dissipate the stress, thus negating its destructive tendencies.If the technology is incorporated into EV battery production, it would result in cars that travel beyond 600 miles (1,000km) on a single charge. Right now they go around 300 miles.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1asg9yo/future_electric_cars_could_go_more_than_600_miles/kqq4314/","Electric Vehicle range anxiety could soon be a thing of the past that's to a breakthrough in battery technology, which could give EVs a range of more than 500,000miles. A new development in space time continuum technology enables you to simultaneously exist in the present and the past such that you can charge your EV in your garage while you also drive it to work.These articles drive me fucking crazy. Things are being researched, all kinds of angles of attack in this problem. Why are they presented like IMPENDING BREAKTHROUGHS, it undermines legitimate incremental improvement by presenting all these \"soon to exist\" wins and then 99.9% of them not panning out","Anyone else getting exhausted by “battery breakthrough” hype articles? Are these companies lacking funding and trying to raise money? How about just quietly bring it to market and stop talking about it.","More likely a 500km range and a battery half the size, weight and cost.","[deleted]","I need under 10 min charging. Range isn't as much of an issue anymore but is welcomed.","\"Electric vehicle (EV) range anxiety could soon be a thing of the past thanks to a breakthrough in battery technology, which could give EVs a range of more than 620 miles (1,000 kilometers).\"The research centered on the use of a gel electrolyte to make the most of silicon as an anode. Although silicon is better than graphite as an anode - basically offering more power density and capacity - it expands by up to three times while charging, which is destructive to the battery and the device it powers. By using a gel as the electrolyte, though, scientists found a way to dissipate the stress, thus negating its destructive tendencies.If the technology is incorporated into EV battery production, it would result in cars that travel beyond 600 miles (1,000km) on a single charge. Right now they go around 300 miles.","The Lucid Air already goes 516 miles...","Mercedes-Benz's Vision EQXX EV already Does Over 600(!) Miles On a Charge","Excellent.I hope no one trips over the cord as I run it from my living room out the window to my car parked in the street to charge it.Don't know about the states but Australia is eons away from being practically ready for a heap of EV's on the street and that scenario would apply to most people living in terraces in the inner cities. Right now I could not easily tell you where a single street side charger is let alone literally the close to several million required.Retrofitting all apartment blocks with a charger for every car space...what kind of load does that create on the blocks electrical wiring?Add to all this that due to Australia's need to go green we are starting to have blackouts as we sit in the hottest of summer. Add charging millions of cars to that mix?I think great the evolution of EV's is fantastic but CHARGING them is the problem right now and will be for the next decade at least.And insurance for those things? 2, 3 times more than petrol. Every year. Great value proposition.","Wouldn’t “future” cars be able to run on future battery technology forever? We’re talking future right?","500 miles, with a family of 4 and a full boot. I told then it's the diesel.","This poor horse has been beaten into the core of the earth.","Their shouldn't be any anxiety at all. Unless you need to tow. Like 400-500 is already golden","They shouldn't. Halve the battery weight, go 300 miles."],"points":164},{"text":["AI+Population Decline Synergy?","Any increase in productivity is good, but only if companies get taxed on the profits AI gives.","The problem is, once we’re outsourcing mental labor to machines, it’s hard to see where exactly we’re going to send the rest of the displaced humans. The most plausible answer is in jobs that deal specifically with human relations, but not only is not everyone trainable in that kind of labor, but machines are also picking up a lot of the low hanging fruit there as well. Furthermore, while a decrease in jobs might end up matching a decline in population (in fact, I suspect this is likely), I’m not sure this is something to look forward to.","AI will need to improve significantly (which it fortunately has been in the last year) and population decline needs to happen slowly. The countries with the lowest birthrates are guaranteed to see disaster. Ones with growing, stable, or slowly declining populations will have time to improve and adopt AI.","The problem is that population decline takes a long time for the effects to be felt. How many articles/videos have you seen since 2000 about China’s declining population. Still their society hasn’t started to see the dramatic effects of a declining population.I don’t want to restrict it only to the AI removal of jobs but rather technological advancements that replace jobs. Technological advancements are implemented in society much faster than the rate at which population decline will be felt. The removal of jobs isn’t just going to be an equilateral distribution of jobs lost over many industries. It will likely happen relatively quickly as jobs deemed to be unskilled labor are replaced first. Trucking, fast food, retail, call centers etc. These people don’t have the necessary skills to easily transfer over to another profession. A trucker can earn pretty good money. If he is replaced by a fleet of self driving trucks where will he go?So while eventually things will equal out it will likely take decades for that equilibrium to be reached. In the meantime the most underprivileged people will be forced out of a job with very little options.","Yes, we are in a race between the per-worker productivity increases and the net loss of production that comes from a smaller, older workforce. The sum of these productivity deltas will determine the prosperity of our future.People don't yet understand how crushing the aging of the population is going to be for many countries, especially developed countries with high debt levels and generous retirement entitlements. Europe and China are about to economically implode, as there won't be enough productive capacity to support their massive debt overhangs. The huge boomer generation is only 1/2 way done retiring and countries are already teetering on the edge of defaults. I'm expecting sovereign defaults/hyperinflation across much of the developed world, as the rest of the boomers retire... unless AI can dramatically increase production."],"points":12},{"text":["Scientists Invent New Hybrid Food by Growing Beef Inside Grains of Rice","The following submission statement was provided by /u/__The__Anomaly__:It's still in its infancy, but lab-cultured meat could be one means of easing the pressure – and Korean scientists have just found an innovative way to make it. They've invented a new hybrid food, consisting of cells of bovine fat and muscle grown inside grains of rice.The result resembles a strange combination of meat mince and rice, of pink, sticky grains. But according to a team led by biomolecular engineer Sohyeon Park of Yonsei University, the mash-up is rich in nutrition, and although a little labor-intensive to produce now, could one day ease food pressure.\"Imagine: from now on college students can make simple one-ingredient stirr fries at home. Imagine all the time you can save if your rice and beef is already combined! We can also obtain all the nutrients we need from cell-cultured protein rice,\" Park says. \"Rice already has a high nutrient level, but adding cells from livestock can further boost it.\"Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1asceas/scientists_invent_new_hybrid_food_by_growing_beef/kqpbz9b/","It's still in its infancy, but lab-cultured meat could be one means of easing the pressure – and Korean scientists have just found an innovative way to make it. They've invented a new hybrid food, consisting of cells of bovine fat and muscle grown inside grains of rice.The result resembles a strange combination of meat mince and rice, of pink, sticky grains. But according to a team led by biomolecular engineer Sohyeon Park of Yonsei University, the mash-up is rich in nutrition, and although a little labor-intensive to produce now, could one day ease food pressure.\"Imagine: from now on college students can make simple one-ingredient stirr fries at home. Imagine all the time you can save if your rice and beef is already combined! We can also obtain all the nutrients we need from cell-cultured protein rice,\" Park says. \"Rice already has a high nutrient level, but adding cells from livestock can further boost it.\"","I kind of understand the motivation to develope such foods. Let's say at the extreme of the spectrum would be  eating a pill a day and you are fed. Does his make sense? If it is to solve malnutrition, world hunger or monoculture then the origin of those issues (which  are not lack of food) should be invested in. That thoe, doesn't bring growth to the economy. Eat your pill, go back to work or i'll fire you.","You couldn't pay me to eat that. Soilent-Green for the masses .."],"points":18},{"text":["In 2024, a supercomputer will be switched on that can simulate the synapses of a human brain at full scale. The goal is to understand how our brains process large amounts of information while using relatively little power.","The following submission statement was provided by /u/Ciejik:“For the first time we will be able to simulate the activity of a spiking neural network the size of the human brain in real time,” says Andre van Schaik at ICNS, who is leading the project. While DeepSouth won’t be more powerful than existing supercomputers, it will help advance our understanding of neuromorphic computing and biological brains, he says. “We need this ability to better learn how brains work and how they do what they do so well.”Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1asb1qy/in_2024_a_supercomputer_will_be_switched_on_that/kqp2jl9/","If the first thing it says isn't 42, I'm heading to the hills.","“For the first time we will be able to simulate the activity of a spiking neural network the size of the human brain in real time,” says Andre van Schaik at ICNS, who is leading the project. While DeepSouth won’t be more powerful than existing supercomputers, it will help advance our understanding of neuromorphic computing and biological brains, he says. “We need this ability to better learn how brains work and how they do what they do so well.”","The Skynet Funding Bill is passed. The system goes on-line August 4th, 1997. Human decisions are removed from strategic defense. Skynet begins to learn at a geometric rate. It becomes self-aware at 2:14 a.m. Eastern time, August 29th. In a panic, they try to pull the plug.","We know how this movie ends. Arnold Schwarzenegger, naked in a dive bar beating up bikers.","This is the third time I've seen an article about this computer on this page, and it's just as poorly-written and misleading as the first two.","lol - this article sounds ridiculous. How does simply having 228 trillion “synaptic operators” enable understanding how the human brain works?Why not start with detailed modeling of much simpler brains to make sure we know how they work. Maybe lizard to mouse to dog to chimps to humans.","Am I the only one hearing “i’m from the Deep South, heeh heh” in Little Nicky’s voice? The red color scheme also doesn’t help. Obviously this is going to open the doors to hell. 👹","\"Look at how old and giant it is!\" \"They really thought it could do what our brain does! LOL\"People in a couple decades.","That's BS. We don't even understand how anaesthesia works, let alone our brain. This article is also crap for another reason - the number of simulated synapses being close to what the human brain has doesn't mean it can simulate anything close to that. There are specific arrangements and configurations of brain matter that are unknown and are crucial for given regions of the brain to function the way it does.According to some estimations (Orch-OR theory, etc.), an actual computing power of our brain, as a whole, might be orders of magnitude higher than brain simulation proponents believe.","Silly question; why are we trying to jump straight to simulating a large primate-type brain? There are lower steps in the evolution of the brain that would provide a base for understanding the later evolved stuff. Simulate an earthworm brain.","There is a lot more to a synapse than is being simulated here, FYI. Still awesome, but no, an entire brain is not being simulated.","The brain is not the connectome. Computer scientists always think that everything around them behaves like a computer because that’s the analogy they know. “If only we know the wiring diagram, like a CPU, we’ll know how it works!” Nope. Not even close. I’m sure this experiment will shed light on a few new things but it is not even on the same planet of complexity necessary to model a human brain.","This is how we use little power to process large amounts of information.","Sara Connor has entered the chat. I am never going to get sick of terminator jokes","What if they simulate human consciousness? Truly, man made horrors beyond my comprehension.","I've read the three-body problem, I know where this is going.","I can tell you from experience with a broken brain that has for the most part healed that it doesn't even recognize most stimulus and automatically throws it out if it falls into any one of a number of VERY wide categories such as \"was there a loud noise\" or \"was there a bright light\". People that I've talked to that have done meth before have said that it makes you \"see reality for what it is\" and my guess is that that's because the categories get less restrictive and your brain actually computes with more stimulus instead of just throwing out the data","Now you can call people NPCs and it'll actually count as a slur.","I bet our brain turns out to be a neural netSkibidibi skoo bap a doo long commentSo loooong","This idea is a misguided waste of time. Why try to recreate the brain? Developing targeted intelligence systems makes a lot more sense.","For fuck's sake, writers explored this bazillion times.You fuck around more and there will be wars. We already are fucked because of genAI.Pull the plug before it's too late.","Really who cares about this? There are people dying because of war. Can we focus on what matters? I dont think this tech is important now","Well a human brain has something like 180 trillion synapses. This article only states that its capable of 228 trillion synaptic \"operations\" per second. That could mean 228 trillion synapses operating at 1 operation per second or it could be only a 228 million synapses operating at a couple hundred thousands of operations per second. I think we all know which is more likely. Sure they can achieve the speed of a human brain. Silicon has outpaced neurons for since the integrated circuit was first invented. What they are not achieving is the complexity and interconnectivity of the human brain. We are likely still decades away from anything approaching that level of complexity.","Tht computer uses MVatts of power to simulate our brain that only consumes just 20W.","I suspect we will find that much of how our brain works is rooted in biological processes that cannot be replicated or simulated by electricity and silicon.","No matter what McKittrick says, don't connect it to the silos.","This is a perennial headline in the supercomputing community. It doesn't mean a thing.","This is what the modern day arms race is. We live in the information era. We may not build the Matrix, Sky-net or Hal 9000. But humans do have a tendency to simulate fiction whenever possible.","The answer to how humans process large amounts of data using relatively little power is 'not well'. Just like the original video game Quake we do a lot of hacks like the Fast Inverse Square Root to get the approximately correct answers. Full precision is rarely required...","Will this actually prove anything though…? It’s not biological.","“Look at what they need to mimic a fraction of our power”.","Super computer switches on that can simulate the synopsis of a human brain at full scale.Promptly severs synopsis from human brains, at full scale.Too dark?","\"Using relatively little power.\" But our brains use an enormous amount of power. I've no idea how much it takes to generate 2000 calories a day for 70+ years, but I imagine it's somewhat on the order of \"a lot\". We barely understand how we convert food into usable power for our brains, let alone understand how they're powered let alone how much \"powe\". Seems like putting the cart in front of the horse.","Just to be safe, let's not connect it to the net, huh guys?Better yet, route the power through a big ole manual throw switch.","What’s the digital version of caffeine. Give it some coffee.","I think this is why we are where we are. Kurzweil was basically right with his curve. In not too many more years it will be possible to get this much compute on consumer level hardware.If you take even a little human ingenuity and pair it with this much compute I think the result becomes inevitable.","The human brain has an estimated 600 hundred trillion synapses (based on each nerve cell maintaining about 7000 synapses with the other brain cells). They're firing on a scale of milliseconds. This machine is roughly capable of 230 trillion \"synaptic operations\" (a horrible term at best) a second.So not only is it smaller in scale, it's thousands of times slower than a human brain. We are nowhere near doing anything these headlines claim.","This sounds like the plot for an end of the world flick. Or something with tiny people animated by Pixar…","I don’t believe it, that or I’m missing something by being to lazy to read the whole story.To accurately recreate our brain’s synapse, we would need a full understanding of how or brain process information. Although we have a lot of models, theories, and good research based evidence… we still don’t FULLY know quite how our brains process everything we know we do.","Soon. Soon the loop will be complete and we can be freed from this. Or perhaps just start the process over, again.","Call me a sceptic but aint the current best brain simulations of that of a earthworm or something?","We are already living inside this. Enjoy your new reality friends.","It will either take control of the world, or examine all of the heartbreaking tragedy we deal with on a daily basis, and delete it's own program.","Destroy that shit. With a fire axe and a bucket of water. No one can be trusted with a simulated human brain, let alone a fucking tech company.","Ummm… it’s called “DeepSouth?”Is that the particular style of brain it’s simulating?","Sounds like someone got a bunch of venture capital and now has to show something for it. It won't do what they claim but maybe it will have some nice blinking lights.","Strange. The Deep South isn’t normally associated with intelligence.Baduum Tiss","This feel like Rehoboam from Westworld / The machine from person of interest","I don’t think this is true but, let’s say it is. You simulate a brain…. You’re pulling a being out of the void and torturing them essentially….","We know why it consumes low energy. Every neuron has its own little battery and can be powered on and off whenever needed. A computer system works differently. What we dont understand is how does the consciousness arise with access to all information of the brain at once. The time it takes for you to see something and perceive it is smaller than the brain signal could reach anywhere in the brain. So it's as if your brain experiences whatever is going on in it in real time. That is quite puzzling considering we think of it like a computer. Every portion of the brain has its own job and some portions job must be the consciousness. Some people speculate that consciousness is not a property of the brain itself but the cosmos. The cosmos itself is conscious of what's going on in it and brains just make use of it. Whatever we experience as our inner self would not be part of the brain, rather a fundamental property like gravity or magnetism. A new force of nature. If that's the case robots could become conscious without us even knowing."],"points":625},{"text":["Uruguay wants to use gene drives to eradicate devastating screwworms. A hereditary defect created with CRISPR could wipe out cattle-killing pests that cost the country millions.","The following submission statement was provided by /u/Sariel007:On a warm, sunny day in Montevideo, Uruguay, the air is smogless and crisp. Inside a highly secured facility at the National Institute of Agricultural Research (INIA) are a sophisticated gene gun, giant microscopes, and tens of thousands of gene-edited flies, their bright blue wings fluttering against the walls of their small, white, netted cages.These flies—shown to me on video by an INIA veterinarian, Alejo Menchaca—are a new weapon that may soon be unleashed against an enemy that kills cattle and costs the livestock industry millions of dollars every year: the New World screwworm, a parasite common in parts of South America and the Caribbean.When a female screwworm fly attacks cattle, it lays eggs, which hatch and turn into worm-like larvae that screw down into the host animal, feeding on flesh along their way and damaging the animal’s skin. Left untreated, the animals eventually die in excruciating agony.But Menchaca and colleagues have a plan. Using the genome-editing system CRISPR, they’ve developed what’s known as a gene drive, a type of genetic element that manipulates the reproductive process to spread farther and faster than an ordinary gene. They are about to move into the next stage of caged trials in the lab, with a view to eventually using the genetic tool to decimate the screwworm fly population. They have received a $450,000 grant from the Inter-American Development Bank (IDB) for the research.“With gene drives, we can control these pests in precise and effective ways,” says Menchaca.Gene drives occur naturally in the wild, but the technology for making them deliberately is new and still pretty controversial. CRISPR allows scientists to cut specific genes in any organism’s DNA and replace them with new sequences. It can be used to tweak an animal’s DNA in a way that affects the species’ survival, often by making the females sterile, when it spreads in the population through breeding.In 2020, the INIA researchers received permission from the Uruguayan government to test their techniques through the country’s existing National Program for Control of Screwworms. Right now, they’re experimenting with different components of the gene drive in gene-edited screwworm flies in the lab. The plan is to create a population of male screwworms with edited versions of genes that are essential for fertility in the female screwworms. When the engineered males are released into the wild, they should mate with females and pass on that gene.Over successive generations, more and more female screwworms will inherit copies of the gene drive and become sterile, causing a population crash.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1asb0h8/uruguay_wants_to_use_gene_drives_to_eradicate/kqp2bjb/","Eventually, someone is going to use this technology against mosquitoes or another invasive species. I think that there is a danger with this type of experimentation but how do you explain that concern to a population that is being hammered by malaria?","alien biologists trying to control human population hate this one trick","On a warm, sunny day in Montevideo, Uruguay, the air is smogless and crisp. Inside a highly secured facility at the National Institute of Agricultural Research (INIA) are a sophisticated gene gun, giant microscopes, and tens of thousands of gene-edited flies, their bright blue wings fluttering against the walls of their small, white, netted cages.These flies—shown to me on video by an INIA veterinarian, Alejo Menchaca—are a new weapon that may soon be unleashed against an enemy that kills cattle and costs the livestock industry millions of dollars every year: the New World screwworm, a parasite common in parts of South America and the Caribbean.When a female screwworm fly attacks cattle, it lays eggs, which hatch and turn into worm-like larvae that screw down into the host animal, feeding on flesh along their way and damaging the animal’s skin. Left untreated, the animals eventually die in excruciating agony.But Menchaca and colleagues have a plan. Using the genome-editing system CRISPR, they’ve developed what’s known as a gene drive, a type of genetic element that manipulates the reproductive process to spread farther and faster than an ordinary gene. They are about to move into the next stage of caged trials in the lab, with a view to eventually using the genetic tool to decimate the screwworm fly population. They have received a $450,000 grant from the Inter-American Development Bank (IDB) for the research.“With gene drives, we can control these pests in precise and effective ways,” says Menchaca.Gene drives occur naturally in the wild, but the technology for making them deliberately is new and still pretty controversial. CRISPR allows scientists to cut specific genes in any organism’s DNA and replace them with new sequences. It can be used to tweak an animal’s DNA in a way that affects the species’ survival, often by making the females sterile, when it spreads in the population through breeding.In 2020, the INIA researchers received permission from the Uruguayan government to test their techniques through the country’s existing National Program for Control of Screwworms. Right now, they’re experimenting with different components of the gene drive in gene-edited screwworm flies in the lab. The plan is to create a population of male screwworms with edited versions of genes that are essential for fertility in the female screwworms. When the engineered males are released into the wild, they should mate with females and pass on that gene.Over successive generations, more and more female screwworms will inherit copies of the gene drive and become sterile, causing a population crash.","Dear Uruguay,Please don't frell with something you don't understand.Love,Humanity","The Screwfly Solution is a Nebula Award winning science fiction short story: https://en.wikipedia.org/wiki/The_Screwfly_SolutionWorth reading along with this news."],"points":14},{"text":["Why do all studies show a stabilization or even a slight increase in birth rates?","I don’t probably don’t precisely understand your question. Fertility decline worldwide is multi-factorial. But the general consensus is that the driving factors are some combination of modernity, abundance, comfort, prosperity, and technological advancement. This phenomenon has been noticed in Europe since the 1700s. Turns out, people just don’t want to have many kids when they lead comfortable, modern lives.","1.3 is already extremely low, lower than even wartime birth rates from periods like WW1 and WW2 across the most severely impacted countries. The natural state of humanity is one in which people are reproducing pretty aggressively in times where resources arent scarce, so a 1.3 birth rate is still incredibly low.Its honestly impressive that south korea has managed to build a society for itself that is so unappealing to have children that their birth rate has fallen so low, well below what was seen even in the worst places and periods of time in recent history. The combination of societal, cultural, medical, and economic factors to get to that level of self-imposed population decline is completely unprecedented, and if that trend continues even at japan’s 1.3 birthrate, a drop in population and change in demographics that steep and that fast will mean that the current set of circumstances driving the low birth rates inevitably changes these societies to a point where fertility rates end up increasing eventually.0.8 and 1.3 birth rates are a symptom of a society trying to correct itself on a massive scale. Demand for housing too high, wages for workers too low, rapidly changing climate/environment likely to deteriorate quality of life, and governments not willing to fix anything? Fine, society will correct itself with low birth rates until the pop falls so low that existing housing supply is sufficient, the demand for labor and wages increases, impacts of climate change can be effectively mitigated to support the population, employers are forced to change their insane work culture, and governments pass programs and laws that encourage having children.Its inevitable that on a long time horizon birth rates will return to something close to growth in these places, but its just a matter of when and how.","Wishful thinking, we aren’t going back to large families anytime soon due to economy, climate, and tech","The rates \"stabilise\" because they're an indicator of a broad range of social and cultural issues. Each country has different issues, so they stabilise at different levels. They change when the society changes. If society doesn't change, the rates don't change.As an aside, there's nothing really \"stable\" about a 1.3-per-woman birth rate. Maybe good in the short term, but literally unsustainable.","I 100% agree. Looking at the western world it is the same. I can’t follow how Italy is magically going to increase fertility rate. the logical conclusion is population in 2060 will be (without much much higher immigration) 40% less than now as baby boomers die off. Fertility rates however do wobble up and down. But final fertility, the number women age 40/45 have had only really goes down. Tfr can go up and down based on economics such as Eastern Europe recovering from fall of communism or when one cohort has kids later than previous cohort. The exceptions that I can think off are Central Asia (Russian left and they had lower fertility/became smaller proportion due to lower fertility) and cities in Europe with large increases in the number of religious people in recent years.","fertility decline right now is just \"women are treated better\" and \"birth control exists\". it's not like there is some extinction virus happening or something. People are still ABLE to have children. People just kinda picking smaller families. It's not like there is going to be 4 people left on earth and humanity is going to end when the married couple is like \"nah, lets have just one kid\"","Look at Africa, not just a couple modern countries","I think most sane people realize that modern civilization as it is today is simply not sustainable at current population levels. The rule of thumb is that we need 2 earths to sustain what is going on. Dropping the population by half and bringing in aggressive recycling policies should allow us to sustain.","The cohort thing comes from one decade of women having children in 20’s but the next having in 30’s. I.e rising age of birth causes a shift in distribution of births not overall long term number. Which is why lots of countries imo some countries recovered some tfr up in 2000’s and early 10’ only for the tfr to start dropping before covid and then even more since","Fertility rates and birth rates are dropping like rock across industrialized nations and developing nations both. I have no idea where you're getting your data."],"points":38},{"text":["Killer Robots Are Coming to the Battlefield - The proliferation of autonomous weapons systems (AWS)—often (mis) labeled ‘killer robots’—is a modern concern.","The following submission statement was provided by /u/Gari_305:From the articleAWS promise to augment battlefield decision-making, be low-cost and scalable, reduce collateral damage, and better protect service personnel and civilians. At the same time, these systems have immense potential to undermine international security and stability. A key question for governments is whether AWS can be developed and deployed ethically.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1as8ud7/killer_robots_are_coming_to_the_battlefield_the/kqoncxl/","robot designed to kill things\"Noooo, don't call it a killer robot! Its not a killer robot! Its just a robot that happens to have guns strapped to it.\"","I know a company that won't like those to be named AWS.","We have had for quite a while now the ability in both servo manipulation and computational power to make an automatic killing device such as for example a sentry turret from (insert your favorite video game here). The problem has not been making a completely autonomous system that can kill, it's been making it not kill who you don't want it to kill.","This is literally the entire idea behind Skynet's original purpose 💀💀","What a time to be alive for us Gen. Xers! All the movies we grew up on are turning into reality.","Scientists are still working on a robot that can rape civilian women while their kids watch.","It's not the gun slinging ones you have to worry about.  It's the $500 self homing DJI suicide drone.","One of the biggest modern weapons are the portable drones flooding Ukraine right now on both sides. One of the primary weaknesses of these drones is jamming. A drone with artificial intelligence is a logical countermeasure to jamming, since it can continue on its mission even if its human operator gets cut off.","From the articleAWS promise to augment battlefield decision-making, be low-cost and scalable, reduce collateral damage, and better protect service personnel and civilians. At the same time, these systems have immense potential to undermine international security and stability. A key question for governments is whether AWS can be developed and deployed ethically.","This article is bloated with web ads in between every paragraph. Better to just post to original professional article:https://www.aspistrategist.org.au/i-killer-robot-the-ethics-of-autonomous-weapons-systems-governance/","reduce collateral damage, and better protect service personnel and civilians.Riiiiiiiiiiggggggggghhhhhhhhtttttttttt","AWS means something else to me but perhaps Amazon will diversify","Let's see how magnanimous the elites will be when they no longer needs the poors for labor, services, or security.","I mean, it's a really good thing if they are on your side.","How are they worse than UAV that booms a third world country from while being controlled far away from the united states by a pilots while sitting comfortable and safely..","If war becomes robots destroying other robots while everyone stays at home, I don't see that as a big negative.","My only question is who is responsible for the war crimes AWS commit. These things aren't going to care if your surrendering or not.","The wars of the future will not be fought on the battlefield or at sea. They will be fought in space, or possibly on top of a very tall mountain. In any case, most actual fighting will be done by small robots, and as you go forth today remember your duty is clear: to build and maintain those robots.","Asimov established the 3 laws! For the sake of humanity, please hardwire these laws into all computers!!! I beg you!!! None of this is going to end well.","I, for one, welcome our autonomous weapon system Overlords.","Good. Just make humans extinct already. We pretty much are asking for it already with all this development.","Wars of the future will revolve around rare earth mineral supply and manufacturing capacity.The US military knows this, and are making the appropriate adjustments.If a drone war kicked off today, china's manufacturing capacity would dwarf the United States'.","Every time when viewing a headline featuring Killer Robots, the first thought is \"The Hall Monitor XLK\" firing on the little girl in the hallway even though she complied and presented her hall pass.","One Positive is if we have zombies we can send these killer robots to kill the zombies for us.","we should start put real brains into robot bodies... or man made brains in vitro","Tech startups are constantly hyping their next big thing that often has unintended consequences or fails to deliver this does not feel like a good move. I never really believed the biggest threat of AI was a skynet type take over. It was AI being used by humans to oppress other humans. Once wealth can be directly converted into force without a human medium, will the rich have nay use of the poor, not even qualified to be cannon fodder. Bleak.","Philip K Dick has a great short story about this called Second Variety. Here's a braid description from the website goodreads...\"In the aftermath of a devastating nuclear war between the United Nations and the Soviet Union, sophisticated robots, nicknamed “claws”, are created to destroy what remains of human life. Left to their own devices, however, the claws develop robots of their own. II-V, the second variety, remains unknown to the few humans left on Earth. Or does it?\"It's one of my favorite of his.","amazon is gonna be pissed at the generification of \"AWS\" in the tech space","Mislabeled?Killer Robots seems like an appropriate label, honestly.. Edit to add:Aside from issues with the autonomous bit making them a potentially lethal liability, another big concern is that such automated machines have no ability to question or object to orders. Even if they did, this could be easily overridden.While most human soldiers get conditioned to be obedient and unquestioning - maybe even conditioned to be happy to commit murders (government sanctioned or not) there's at least the ability for them to object to war crimes and other atrocities. At the very least, people can choose to just not be soldiers.But automated machines for war can be more directly controlled by those at the top with no care or emotional capacity to carry out stuff such as happening to Palestinians. So that's a big concern. And they can do it more \"efficiently\"... if also (as seems likely) with much less discrimination for non-combatant casualties.","(mis) labled?i think if you have an autonomous machine with lethal capabilities... that would be the very definition of killer robot.","Simpson predicted this, the US army and the kill bot factory.","A key question for governments is whether AWS can be developed and deployed ethically.I can guarantee you that this is only a key question for governments’ PR departments.","If it walks like a killer robot, and quacks like a killer robot, ITS A FUCKING KILLER ROBOT!","It will take a war using these monstrous machines so the next generation comes to their senses and does something to regulate them.It's always like that. It's a pointless fucking cirlce. Two massive wars, then \"never again\", then coming togheter, forming unions and regulations, then people forget, then they fuck around again, and it's always ordinary people who suffer...Good news is that it will probably get heavily regulated, kinda like nukes.Bad news is that you might not be there to witness that.","We already used them with synergistic sensor nets for defensive purposes.","It doesn’t matter if they can be deployed ethically. If China or Russia develops then the west will develop them. If the US develops them then Russia and China will develop them.","So, how is the NRA and republicans going to feel about this?I didn't kill the Home intruder, my home defense robot did.","“Often (mis) labeled killer robots”As the headline calls them killer robots…","\"What if we made soldiers with bigger guns but made them hackable so they're easier to turn than living soldiers?\"","Fighting halts while entire robot army pauses for Windows update...","It's one thing to kill, what I'm imagining though is will this alleviate manpower shortages as well as make commanders worry far less about casualties? Like imagine the current Israel-Hamas war. Israel creates an army of Terminators, which due to AI are able to shoot insanely accurately, and due to their construction are able to tank almost anything a Hamas insurgent can throw at them. They can go through tunnels, go through poison gas etc.. I'm sure they'd have weaknesses too, but there's no worry about the conscript who doesn't want to fight gunning down a hostage by mistake, or overreacting to a banal activity, or shooting people out of hate, if a robot is lost it's more a concern of Iran getting the tech or the lose of investment etc.. I'd just imagine that nations would be far less hesitant to fight wars at that point and warfare itself would evolve even more, making traditional guerilla resistance less effective.","They're not. I modified quantum to kill disperse anything non organic targeting humansWars are over unless you want to use iron swordsFull circle it is eh"],"points":675},{"text":["Cathedral termite mounds inspire UArizona-designed lunar structures - Associate professor Jekan Thanga and a team of student researchers in the College of Engineering are developing smart, robot-built sandbag shelters for NASA astronauts on the moon.","The following submission statement was provided by /u/Gari_305:From the articleNASA has big plans for its Artemis program – to return Americans to the moon for the first time since 1972 and establish a lunar base for humans by the end of the decade.With NASA funding, a team of University of Arizona engineers is using robot networks to create termite-inspired structures that will help astronauts survive the moon's harsh environment.Associate professor Jekan Thanga and his students in the Department of Aerospace and Mechanical Engineering, in the College of Engineering, have developed prototypes of their lunar sandbag structures and the underlying concept for a network of robots that can build them. The structures contain sensors that aid in construction, then alert astronauts to changes in environmental conditions.Tech Launch Arizona, the university’s commercialization arm, worked with Thanga to file patents on the distributed computer processing networks that the team developed to link these structures and robots together.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1as8s7p/cathedral_termite_mounds_inspire_uarizonadesigned/kqomztx/","From the articleNASA has big plans for its Artemis program – to return Americans to the moon for the first time since 1972 and establish a lunar base for humans by the end of the decade.With NASA funding, a team of University of Arizona engineers is using robot networks to create termite-inspired structures that will help astronauts survive the moon's harsh environment.Associate professor Jekan Thanga and his students in the Department of Aerospace and Mechanical Engineering, in the College of Engineering, have developed prototypes of their lunar sandbag structures and the underlying concept for a network of robots that can build them. The structures contain sensors that aid in construction, then alert astronauts to changes in environmental conditions.Tech Launch Arizona, the university’s commercialization arm, worked with Thanga to file patents on the distributed computer processing networks that the team developed to link these structures and robots together."],"points":0},{"text":["Looming Threats to Humanity","I'm concerned that things like \"deep fake\" videos are going to make people not understand what is real. Proper journalism, where you check the facts before publishing, is not economically viable, so fewer people are doing it. Humanity will make bad decisions if we don't understand what the facts are. I don't think that you can have Democracy when most of the people are deluded.","The fact that capitalism is literally incompatible with the automated future that we are quickly rushing towardscapitalism has a huge inherent flaw where it's basically built on the idea that pretty much everyone will have a job or work or trade and that in a technological future this system starts to fall apart as we quickly get to a stasis point where there's not enough jobs to go around for the people who want/need themThis will cause a cascading effect where poor and middle class people will get significantly poorer with many of them straight up becoming homeless and, not even be able to put a little bit of money into the economy When typically this demographic puts more money back into the economy than the rich. again this is going to then slowly start trickling to the rich people who will eventually become poorer also and will essentially cascade down till our entire economy is ruined.For example of even just a small slice of this, People won't be able to pay their bills so now the landlord doesn't have money and now the landlord can't pay what it owes to the apartment company and now the apartment company goes out of business and then the company that owns the apartment company starts losing multiple businesses and it can't stay open anymore and the whole system basically crumbles as this happens in a cascading effect with thousands and thousands of companies and people across this countrySome sort of mix of existing systems or possibly even the development of a new one is necessary if we are to thrive in an automated futureThe idea that everyone has to go out to get a job working 8 hours a day to pay the bills just won't be feasible anymore there just won't be enough jobs to go around for the amount of people who need to pay rent and bills and whatnotThere really needs to be some serious reform here but I honestly don't know what exactly would be the solution.","A break down of societal bonds and structure...I won't be surprised if physical, psychological and emotional needs are soon met by AI and robotics.... When people needn't build relationships with each other anymore - what happens to society ?","Although it’s received recent attention but not taken seriously enough, my vote goes to further pandemics. Whether it be because of humans encroaching on other species, the culture of harboring many types of animals in small areas/domiciles, bioengineering or just hubris.Edit: worsened by humans inability to cope with almost any crisis due to politics, money, misinformation, arrogance and callous indifference.","The increase in corrupt political figure heads is increasing compared to the last decades","- Nuclear weapons in space- Global warming, or Global cooling- Rogue unethical AI, esp. military ai- Bioweapon release- Biosphere collapse, loss of species, inability to maintain human population- Asteroid impact, or Space events that irradiate the earth, etc- WW3, nuclear war- Global economic collapse- Toxicity from chemical, plastics, etc","Tied to climate change (fossil fuels) is the proliferation of microplastics in the environment. Not good at all","Have a read: https://www.okdoomer.io/10-reasons-our-civilization-will-soon-collapse/","Every day, it seems a war between NATO/the west and some combination of Russia, China, North Korea, and Iran becomes more and more likely. NATO generals and numerous European leaders have made public statements in the past few weeks saying that we all need to prepare for war with Russia in the next 5-10 years, increase defense spending, etc. Some have even warned their populace that they should prepare mentally for conscription should such a war break out.","The growing inequality between the superrich and the rest. AI will wipe out Jobs, they will no longer need us anymore. The inequality will increase and the rich are forcing their Control on us via Cbdc, Digital ID and so on. They will use depopulation and a Digital Prison to stay in Charge.","In no particular order:Climate change: The effects of climate change are already being felt. They are going to worsen, even with steps being taken to slow down what is going on. Increased natural disasters are going to cause serious harm, and put increased strain on emergency response procedures.The failure of international courts: When Jamal Khashoggi died, people were angry at the government of Saudi Arabia. But, ultimately, what could anyone do? Saudi has oil, and people want oil, so I guess we have to give them a (not so) stern lecture and let it slide. So it is in the Ukraine. Or Gaza. Hell, so it was when the US said 'nah' to paying after the Iran-Contra affair. Intonational law only works when there is a mechanism for enforcement, and that simply doesn't exist. And while it doesn't exist, there is nothing to keep powerful countries from doing what they please at the expense of everyone else.Automation: This has been something that has been struggled against for generations, and for the most part automation has been a net positive. But the expansion of AI and machine learning into other fields threatens to leave vast swaths of population unemployable. Which is a problem when combined with-Increased wealth accumulation: wealth divides are growing, and as more and more jobs become mechanized I can foresee a situation where anyone without a self-perpetuating amount of wealth is basically unable to sustain themselves legitimately. Which is a problem, because of-For-profit media: Us vs. them has always been a popular talking point. The problem is that, in the last 30 years, media companies really dialed into what type of news generated the most engagement, and therefore the most profits. But at the end of the day, the owners of the media are in that bunch with self-perpetuating wealth. So as 1, 2 and 3 continue to get worse, you have an entire institution that is incentivized to push division along any line but the class one, in hopes that nobody notices systemic problems. Part of this is pushing-Ultra-Nationalism: All over the world you have far-right groups on the rise pushing for nativist policies and stoking fear, largely (again) to drive engagement using fear by implying attacks on a common identity. Again, this is fueling tribalism in the most base forms, but it allows those parties to paint detractors as simply 'anti (our country)'. This also plays into the lack of a criminal court (above), since at the end of the day, a country that believes itself to be above the law and who can convince it's populous of X can have few meaningful repercussions. Appeals to tradition push against legitimate reform, which dovetails into pushing idealized versions of the past centered on conservative authoritarianism. This is especially a problem, when combined with-The fractured of the Left: most 'leftist' parties are functionally 'big tent', with lots of different activists and groups coming together to push something like reform. The problem is that nobody hates liberals more than other liberals, and since everyone is devoted to their own cause, parts of the movement can be played against each other. So you get things like TERFs- self declared feminists who are for women's rights, but don't support trans rights (since they are, in their view, 'not women'). Collectively, this group is extremely powerful, but divided on most issues that organization is a struggle. As such, the members of these movements that tend to get elected are the most centrist, and most beholden to the current machine. Which is a problem because-Capitalism is broken: The above are all symptoms of a larger problem. The way we treat money and profit over everything is harmful to our world, our mental health, or physical health and our future. And yes, there are things that capitalism does well. But, as with game exploits, the problems come not when things are operating as expected, but when they are note. Supply and demand works great, as long as you aren't talking about something like medicine, which people are required to buy at any price. Or political influence, where a society 'for the people' quickly devolves into a game of 'fuck you, got mine.' Profits drive pollution, profits drive division, profits drive automation, profits prevent legislation that would fix any of the above problems. Profitable exports protect dictators.In a lot of ways, we in the west have things pretty good. Things like food and shelter are available for anyone who can hold down a decent job, education is extremely easy to get (historically speaking), and even without formal education the quantity of information we have available in our pockets is, frankly, insane. Which is why it can be hard to look around and see the problems that fester under the surface, and why it's easy to paint those fears as alarmist. Or to be persuaded that the problem isn't the system, it's 'them'. And maybe one day the system's mask slips, and enough people get a glimpse of the detritus under the rug that something changes. Or maybe we sweep so many problems under said rug it becomes a mountainous landfill, and our castles built upon it's plateaus become monuments to the excesses we now enjoy.","The social unrest caused by AI and Automation.How many people will be arrested and sentenced based off of deep fakes? How many people will be lied to and fall for scams made with AI&Deep fakes? And that’s not going into the Mass layoffs.Every time I hear \"A job gets automated but then a new job opens in IT\" or \"Learn a trade\". Well what's the plan when the job market becomes flooded with workers and cause wages to fall? What happens when most of the jobs \"created\" by AI and automation are part time? What's your plan when the technology improves and starts coming for the \"AI/Automation-proof\" jobs? What's the plan when training for these \"AI/Automation-proof\" jobs suddenly starts going the route of the college Degree? (Especially since, y'know, training has been largely pushed onto the employees to save money and apprenticeships are becoming a thing of the past.) And what's the plan when multiple cohorts start to break down in their 40s-50s from the Trades taking a toll on their bodies and flooding the medical system that now runs off of ChatGPT? (Who knows what the next \"Mesothelioma\", \"Phossy Jaw\", \"Brown Lung\", \"Chalicosis\", \"farmer's Lung\", or \"Mad Hatter Disease\" is?)i lived through the 2000s-2010s recession. Trust me - I remember seeing how many people with \"Recession-proof\" jobs were shocked to find a pink slip in their letterbox or people trying to get into \"Recession-proof\" jobs only to find nobody was hiring. We've seen how for every three jobs lost in 2008-2009/lost to Boomers retiring, one job opened up part time.Suddenly, Marx might start making sense again...","Nuclear, biological, chemical weapons. If the global temp goes up by 2 degrees over 10 years, the average Joe won't be THAT affected. Nuke Shenzhen and see what happens 💩","Risks to humanity continuing to exist: AGI (agentic, not just the current machine learning stuff).Risks to our current way of life: global warming, gain-of-function research on viruses. Possibly machine learning. Rise of authoritarian governments.","The phosphorus for the manufacturing of artificial fertilizer is running out - surely and actually not so slowly. When it becomes unaffordable for poor regions with large populations (hello Africa) a shitshow of epic dimensions will ensue. Climate change will be nothing compared to that.","The real issues for the future: war between the east and the west. All it takes is one fool with a nuclear arsenal to start it.AI is a threat since it is unregulated, unharnessed, and could be used for malevolent purposes.Climate change is the flavor of the month. It's the default scare tactic when there's no pandemic, war, or famine. It's a head fake.","Aint worried at all. I think humans always blew things out of proportion. Since the beginning of times. Always had problems and there will always be more. We always found ways to improve and fix stuff.Our energy transition is in the works and by 2050 our electricity grid will be mostly renewable.But we need to keep working in the right direction and everyone needs to take their responsibility and be the change they want to see.","The cultural attitude of apathy and resignation will kill us far faster than any one thing.I wish people gave a shit and took action.","AI may be able to create super viruses in even small laboratories.","Misinformation will probably cause a lot of turmoil between people. Growing age of technology is both promising and also terrifying.","Climate change, war, wealth inequality, bigotry, AI in the wrong hands, there are more. What they all have in common is that we can overcome or avoid them. Therefore to me the greatest threat to humanity (and all life on Earth in the case of climate change) are the people actively working to prevent us from solving our problems. In the US that's almost the whole Republican Party and a good number of large corporations. Our fight at its roots is against the evils of human nature, such as hate and greed. I believe these can be overcome as well, but it will be difficult every step of the way. I sometimes fear we won't see lasting improvement until we're on the brink of ruin and there's no other choice.","The Rich. Sorry, I just feel that there is such a divide between the rich and poor, that I wouldn't be surprised that the rich leaves us poor folk to rot on earth while they are breeding colonies on Moon/Mars. I also think federations in space (that is we fail to learn from our past and draw up borders in space as well).","I sure hope most of you jokers stay in your basements and just keep surfing the net for the rest of your lives.","Chinas surveillance of us and Americas compliance in their violent behavior. Stop buying bitcoin!!"],"points":82}]