[{"text":["Feedback on this res please"],"points":0},{"text":["Google Open Sources Magika: AI-Powered File Identification Tool","This post links to The Hacker News (THN). The moderators of r/cybersecurity strive to maintain a professional subreddit which will often discuss news, and further acknowledge that THN is a popular source of news within the cybersecurity community at large. We always wish to act in the best interests of the community and will not restrict news content which is accurate and valuable.However, it has come to our attention that THN has been accused of plagiarism since at least 2012 (ref: attrition.org), allegedly copying article contents from original authors and modifying them without appropriately crediting the original source. Their behavior has been met with repeated criticism, including making false statements (ref: @thegrugq) and renewed claims of plagiarism (refs: news.ycombinator.com c. 2018, reddit.com c. 2021). Due to these incidents, THN links have been banned from several subreddits including r/privacy, r/technology, and r/hacking.We would hope that THN is now appropriately crediting sources of its content or writing its own original content, however we are unable to police each and every article. Please ensure that the information in this article is factual, and where possible, please choose to support high-quality ethical journalism directly. If the community feels this warning is no longer relevant, we will remove this AutoModerator action. Thank you.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Turn off logging for icmp","Traffic logs are usually expensive. Is there a need for like TTPs, forensics, or something you’re using these logs for? If not, don’t capture it cause it just creates noise and costs to store them.I recommend only capturing logs of what you need. If they are running through a firewall or passing into an IDS maybe you just capture notable events or alerts.","OT is a problem child right now. Industries are not comfortable with the environment due to targeted attacks and information leaks about docs being stolen from documentation shares being stored in the Windows business environment.I have been called to help a number of environments in the middle of the night and logging is very helpful if they've got it, but in the end, docs stolen via a number of methods are the key lesson.Some of the antiquated systems and lock down processes and controls that are missing, is a sign that some places need new people and resources.","I work in OT and you need to be very careful with things like that. OT environments are very particular as to what traffic and system configuration is used. My advice would be to either select a low risk network segment or set up a test environment and gradually start removing icmp and check what the impact is.","This, DNS logs, and largely AD logs are like 99.99999% useless but can take but like 60% of your chargeable firewall log intake.I once reduced the log amount by about 60% by simply fixing a policy that wasn't allowing an AD client to talk to a controller, causing like 10-20 attempts per minute, and disabling DNS logs.On DNS, it can be a gold mine if you can see the application layer, but with firewall logs you can't. What you see is that a DNS client asked DNS server to resolve something, oh the horror. Same with AD (from allowed areas). Event intensity might be helpful for detecting lateral propagation and such, but you should have EDR for that which will do the job a million times better. No point in paying guaranteed fees (direct or indirect) for information that almost certainly will not provide any value and definitely will make it harder to find something that does.Cutting the crap is the real art in cyber. Easy to be a hoarder of afraid of everything.","If you have some monitoring for uptime or metrics calculator they may be just pinging away to get a response.From a security perspective it's advantageous to disable icmp so attackers won't know what you have.From an operations standpoint they could be blind as well. Check with your it ops teams.","If you baseline your ICMP traffic, you can set thresholds to log activity that falls outside of the baseline. For example, packet sizes that exceed X or the number of packets, etc"],"points":10},{"text":["Seeking Feedback: CTI Interview Prep"],"points":0},{"text":["Preparing for CEH","When my job asked me to pass the CEH, here's what I did: - I read through the book one first time - every day after work, I met with my coworkers and we practiced using practice questions - we took note and asked eachother questions - just kidding I said please no anything but the CEH and they paid for a offsec subscription instead","Before you invest your time and money, you may want to evaluate if the certification has good reputation and market demand .IMO there are other certifications such as OSCP, TCM -PNPT and others are in greater demand.","First I'd say you night want to check r/CEHWhen I did mine years ago the guide by Matt Walker was one of the best study books for any topic I've ever studied. It was actually entertaining to read.But I'd also recommend making sure it's the right cert for you. Only some industries value CEH. It's not a highly regarded cert in general","Buy the boson and udemy practice tests and keep doing them until you’re consistently getting high marks. That’s how I passed.But frankly you’d be better off doing something else.","I passed that few months ago. My suggestion is to buy the exam simulation on Udemy and study every topic you are unable to answer. This method will save you a lot of time as you can skip unnecessary topics.","If you still didn't pay anything for it, choose something else."],"points":10},{"text":["Internal audit vs external","This makes no sense. External auditors will audit against the frameworks your company specifies.There are mappings between the CSF controls and 27k but that’s to simplify multi framework compliance.","Audits can be tricky.  Either competent or juniors with boxes to tick. Either way only provide them what they require. Audits can become political and the noise travels upwards.  If external auditors want you to run their script.  Tell them to go away until it's been approved by change management or security. That gives time to fix anything.","Could be that the external auditor is very inexperienced and not used to auditing other frameworks in relation to the HLS?","Are you going through an iso 27001 certification or surveillance audit? If so, what controls are listed on your SOA? Are they CSF controls or annex a?","So while NIST CSF has controls in it, it is technically a risk mgmt framework, not a security controls framework. I can understand why the auditor is a little confused there. As well, when auditing CSF, you score it to an internally developed profile. Whereas, ISO or 800-53 or …, you do it scored to an externally developed profile or pass/fail or …. So the auditor may be saying that the profile scores for CSF that you have chosen as goals for your organization may be insufficient for ISO. Or they may be confused about the crosswalks/crossmappings you’ve chosen and built out. Or they may just honestly think you did a crap job of evidence gathering and haven’t gathered evidence with proper adequacy and sufficiency.Complianceforge sells crosswalked standards for a few thousand. If the issue is the crosswalks, grab one and show them. If the issue is the evidence, work with them then to get better quality evidence. But if the issue is the standard is totally inappropriate, you may have to redo things. I deal with this everyday, yell if you need a free consult"],"points":3},{"text":["Italy’s new Piracy Shield has just gone into operation and is already harming human rights there"],"points":0},{"text":["Is it a fairy tale to want to get into Tech, but also have a good work life balance?","No, it doesn't have to be like that. When first starting out, you might find yourself kind of naturally gravitate towards that style of working. After a while, you'll either burn out or adjust accordingly. Took me about 7 years, but I finally rid myself of imposter syndrome so I can mentally check out after the work day is done.Be deliberate about your time. Work hard during your shift, enjoy life after, however you choose to enjoy it.","I'd argue having a good WLB in tech is the normIdk anyone working more than 40 hours except those who want to grind by their own choice","If you work at a normal corporation it can definitely be very predictable. I worked for a major consumer goods company, hybrid, 3 days a week in the office and my day generally started at 7:30 and ended around 4. Now I work in pharmaceuticals and it’s similar. No one calls me on weekends unless something is on fire, which is rare.Conversely I did a brief stint at a major cybersecurity company (FAANG like). They used slack exclusively, hated email, and my team was in different time zones. My work life balance went to crap very quickly. I remember our director scheduled a strongly encouraged virtual happy hour at 6 PM on a Friday one of my first weeks there. I started looking around almost immediately and left after 4 months. Of course that also meant leaving my RSUs behind and the stock has doubled since then, but hey, you can’t put a price on sanity.It definitely depends on the role.","I’m a cloud engineer with some minor devops processes involved in my job. I work like 20-30 hours a week fully remote.","I’m an infosec analyst. I work normal hours every day, hardly ever have to do anything outside of working hours. It is very reasonable. I am also in school and have an almost 1 y/o. So yeah, there’s good reasonable jobs out there, just gotta keep looking","There’s so much variation in the industry. I’ve worked as a software engineer for 7 years now. I have worked at a mid level company in office doing pretty much a consistent 40 hour week with minimal stress. I’ve worked as a freelance contractor with more freedom and very chill clients I only had to speak with once or twice a week. And I recently just put in my resignation for a start up because I have been working 60 hour weeks and weekends consistently for over two years with no end in sight.","Good life balance in tech? Yes, it exists. However, if you want a successful career in good life balance, very unlikely to happen. Top performers always take extra time outside of work to improve themselves. But it doesn't make sense to compare top performer, top 5% people of the world.","It usually takes time.Most Junior and Intermediate roles are going to be very focused on daily operations, which means project deadlines, on-call, dealing with emergencies etc.Once you have experience you can move into roles where you're paid for your knowledge, architecture, engineering, consulting etc, where you aren't heavily involved in operations and can have a normal 9-5 job.","You can break into this sector and still maintain a good W/L balance by simply going public sector. Govt/SLED are still new into security teams and it's a great time to get in. I've been at it for 5 years and making a good mid-range pay. Not what I could be making in private sector but the risks are so low and I can guarantee clocking out at 4/5 every day.","I'm in IT for a small business 60 ish users, I'm the director now. There's three of us. It used to be just me. There are weeks that I work 70 hours a week, but it's rare. Mostly I put in 20 actual hours. I'm on call 24/7, but, I've been here a long time. It's pretty laid back.","No. It’s rare that people work in this field beyond entry level and don’t live normal lives. The people that don’t do it by choice, they’re the exception.Of course it depends on the role, but by and large it eventually turns into a pretty normal job.You’re on a Reddit sub, you’re missing out on the opinions of 95% of the standard workforce. Most people work their 40 then go home, the whole “you never stop working” schtick is not reality for us normies.","no, its a non stop living nightmare. Filled with meeting after meeting of dealing with angry egotistical nerds or managers with little social skills. Its hell","I've been in several top tech companies, and in my experience, WL balance has been mainly up to me and my ability to set boundaries. Once I was able to do this, I was pretty consistent in working ~40 hours per week. Currently at a later stage startup, and I probably work between 35-45 hours per week.The problem with working longer is that efficiency drops and people burn out, and good teams/managers realize this and don't push it unless necessary (like sales deals are on the line, or there's some critical customer-facing launch).Of course there are probably lots of terrible companies/people out there. You'll need to develop your skills so you can join the better places, and also learn how to spot the terrible places and avoid them.","It depends how naturally gifted you are. It's more difficult for some people than for others.","Only at the cost of others.Heard many stories where people, usually on high position ( like Manager, but not Tech Lead or Senior Developer) that it seems like their work is just mostly about DEMANDING from others and judge others.Then this people seem to have no problem with work-life balance. Because they actually don't use much of their brain so they don't feel the burnout. And if client demands change all of the sudden - then their job is to give that demands to the team. But the team does the hard work. So at the cost of others.So it's similiar to every type of work, there are structures and there will be some people that do most of the nasty or hard work and some people who seem to do nothing at all. So if you find yourself an IT job that you will be able to not do much then you will find your work life balance.","I think the chances of having a good work/life balance is mainly due to the your boss and the company culture.Unfortunately, I think most opportunities will be with companies with bad leadership and bad culture. I am in the opinion that you need to be very lucky or be very selective on who you choose as an employer to get a good work/life balance.","Do government work, be actively discouraged from having a bad worklifebalance","define \"having a life\". Can't comment for SV, but most jobs in technology globally aren't about working 24/7. Though to make progress in tech you do have to learn a lot all the time, and a lot of this learning happens outside work. Just to stay relevant you have to learn constantly, career advancement requires more than that.But at least you can grow and it is fully under your control, you don't have to study formally like doctors or lawyers and work culture is usually fair.In my area there isn't shorage of people in tech and cyber who don't quite do that and just go with the flow. In my opinion they'd have produced better outcomes if they didn't work, or did something totally different.","For sure, finding a company that lets you enjoy life outside coding isn’t a fairy tale—it’s about choosing the right place.","It’s like any other job, work/life balance is up to you not the company. If you accept a job where they expect you to work OT and be glued to your phone you probably won’t have work/life balance. If you accept a job with solid hours, good colleagues and working on mature software or in a regulated sector like most of government work then it’ll be easier to create the balance you want.It also depends on your geographical location and goals. If you live in New York and want to make a top 1% salary while still being new you will most likely need to work insane hours. If you work in Edmonton for a government contractor you’ll make a lot less but have the money to buy a house and afford to go out.","Devsecops here. I work maybe 3 hours per day unless something big comes up. Remote","I didn't study a single thing outside of 9-5, nor work on-call, for the first 10 years of my career. I only picked up new things because I wanted to move from dev to data engineering (and now to cyber after joining a cyber team). You can definitely have a great work life balance.","I’m an SE leader for a B series startup and I work about 40 hours a week fully remote, have minimal travel and do well (not FAANG well) salary wise.When I was younger I worked A LOT to get noticed/pushed to management and it has really facilitated taking it easier now that I’ve got kids and have other things I want to do than work.","I’m not in security but in IT infrastructure. Obviously the nature of IT is that it’s always on which means it needs supporting. However the company you work for will greatly affect how involved you need to be. I was in house IT for years and we had an on call rota but it was usually pretty quiet. I now work at a follow the sun MSP so we have clients all over the globe albeit the third line team is only in the UK so we get quite a few escalations from our 100 or so clients. I’m not going to lie, the MSP was a step back from that point of view in my career albeit I’ve learnt ALOT in the last couple of years compared to the same time frame doing in house IT. My ideal job would have no on call but they are few and far between. lol","In my experience if you have the right skill level your job can be done within the allotted work time and you should have a fine work-life balance. If you're constantly facing new challenges and learning new things requiring you to sit and absorb content or conduct research or depend on other departments then yes work life will be difficult. I can't tell you the number of problems that need to be solved at my firm requiring so much overtime simply because the fender support we have just don't know how to tackle the problem because they are lacking in skills. In my current role I'm not a hands-on technician I just direct the vendor to what needs to be done so they do all the work and very rarely do I need to do anything beyond 40 hours a week and usually even less than that."],"points":89},{"text":["Burnt out with role, but not industry","It sounds like you want to move to cyber presales","[deleted]","I’m also struggling with the concept that I worked hard to get trained up and out of the SOCDo you feel like this work is beneath you?Depending on your consulting company sometimes the nature of the work is to do what you’re told. It’s a harsh reality but if you don’t like it then you’ll likely want to move onto a more engineering focused role. Many companies offer different kinds of security engineering - larger companies will tend to have more focused roles while smaller companies will be more generalist."],"points":4},{"text":["Former ADF lieutenant colonel fined for illegally accessing classified defence documents","The other question is why hasn't his access been terminated if he's left? \"Administrative oversight\" won't cut it with the auditors."],"points":2},{"text":["Passed the CCSP","Congrats on your pass!!","Congrats!!!! And thank you for the tips. I take mine Monday 😅","Congratulations.. do you mind sharing the resources and overall preparation to pass the exam?","Congratulations 👏🎉","Great job for your journey. Congrats!!","Hey - congrats! Nothing else but that’s great that you passed and are sharing your experience","Congrats can't wait to do mine as well","Great job !","Congrats!!","Congratulations!","Are the questions \"easier\" than the practice questions or are they relatively the same?","FUCK YES MAN! This is huge and you should celebrate!","Congratulations!","Well done and congratulations!","Congrats! If you don’t mind me asking, how many years of experience do you have? And how much time did you spend studying on average?","When I did mine, I used the official ISC2 study app and it was the best and easiest way I've studied for any of my certs. I can't recommend the study app highly enough. The app keeps track of how you're scoring on the questions for each domain so that you know where you need to focus. It has hundreds of questions and a number of practice tests.The best part is that I've tried some of those apps before and the questions can be quite different from the actual exam. The questions in this app were very similar to the actual exam. I think it cost about $7/month maybe and I only needed it for 1 month.","I agree on the re-reading of questions. A few times on the third reading I was like \"oh yeah now the answer is obvious\" and changed my answer.","Normally I just downvote \"praise me\" attention whoring posts like this when they don't have anything of value for the reader, but you included some useful advice and info.What was your starting point, and how much study time did you put in? For example, how many years of real experience in what roles, and then how many hours for how many days sorts of info. Give us an idea of how difficult or easy this was for you to achieve and what kind of time and effort investment it took.Regarding the questions, do you think they were intentionally worded to be confusing, or was the problem your personal comprehension skills and/or trying to rush it too hard?","What overall experience do you have in this industry and how long did you study for ?","Congratulations!!!!!","well done !!!!","Good now join your local ISC2 chapter and meet up once a month for 2 CPE's.","Congratulations u/sdfjkloeifpoiwjef !!!","Congrats! This is my next one I already own books for it."],"points":82},{"text":["Take on AI taking over the industry","Cybersecurity evolves with technology. New tech, new threats.Almost 20 years in the field and still see the same problems I did when I first entered IT and Security. Echos from stories from mentors about these same problems from decades past.My advice is to be a generalist in many and a specialist in few. Don't make a career out of any one technology because something about eggs in a basket.Hit me up in a DM if you want some mentoring. Happy to pass it on.Good luck!","I am not a veteran in any sense, but AI as it stands now is just a word/pixel calculator. You give it an input and it calculates a most likely response.It doesn't know why, or the context or the bigger picture. It just spits out words/pixels most likely to correspond to your input. When used as a part of software, it works exactly the same.These days you can read that Air Canada lost a litigation disputing the discount that it's AI chatbot offered a customer. This is why AI in critical fields and applications cannot be let to work unsupervised.Yes, AI will speed up a lot of jobs and make people more productive, but it will not replace experts in a critical field such as this. It will bring even more complexity that will require a human to setup, understand and supervise.So basically we are good, at least untill we figure out true AI, then we will either drink coctails on a beach while receiving UBI, or we will be dead...","I'm in the same boat as OP.I'd speculate that AI is going to increase the need for people in cyber security.IMO the current layoffs in the tech industry are to free up cashflow to do massive stock buybacks. Case and point, Meta. Everyone's just using AI as a convenient scapegoat just like grocery chains are using inflation to conceal price gouging.","Language models such as open AI don’t really have any prospects being analysts, threat hunters or most things in cyber as they don’t thrive at what makes these jobs difficult. You’re not going to be prompting one of these language models about an alert and feeding it logs. Machine learning for behavior analytics is vastly more important than a language model. That is how you detect APTs, internal threats, etc.","I have about 12 years in the industry. everyone said behavior analysis will take over the industry and everyone will get fired.Yara rules will take over the industryxyz will take over the industrynope. point here is who's going to monitor AI when it goes rogue? who's going ti monitor that attack vector when it gets exploited, because it will happen. it's only a matter of time.Point is AI will become part of the industry. it might even help. but let's hope it doesn't do more damage than good. and no it won't replace everyone, but it will replace some, but also open up new jobs.","My job is probably the easiest to take over with AI and I’m still busy.","When your job is protecting against the AI, I see more job security in my future…","Learn how to hack AI models. 😄","Come, oh AI overlords, and take our work! For we have stared at enough logs for a lifetime…","I understand the concern about AI taking over the cybersecurity industry. While AI and automation will certainly transform many roles, I don't believe security professionals will become obsolete anytime soon. Here are a few key reasons why:— While tools like ChatGPT can generate code, it is often vulnerable or flawed. Not to mention how expensive it is to train these models.— New attack surfaces. As technology advances, new vulnerabilities and attack vectors open up that AI will not be prepared for. After all, AI is only as good as the data it’s trained on. Skilled humans will be needed to analyze and defend against new risks. And we’ve already seen what happened when AI tries to update itself: https://www.theatlantic.com/technology/archive/2024/02/artificial-intelligence-self-learning/677484/— ML models can be attacked too, which makes oversight of security professionals even more crucial. Even the best AI needs human supervision, testing and oversight to ensure safety and prevent unintended consequences.— Creativity and innovation. Coming up with clever solutions to complex security problems requires out-of-the-box thinking AI cannot currently match. The human element fuels new ideas. Like how we came up with AI in the first place.So while AI will certainly take on some menial tasks, the cybersecurity field will still require creative, strategic, ethical professionals. Specialists like security architects, analysts, engineers and researchers will continue playing irreplaceable roles. AI will be a tool, but not a wholesale replacement.","Most good cybersecurity functionality is automated already. No one should be manually scanning millions of pages of data. So having ai/ml simply adds new tools to that scanning arsenal. Will things get automated sure. Will hackers use more advanced techniques? The reality is as more things go online, the attack surface increases. I don’t really see cybersecurity resource requirements going away anytime soon.","Doubt. Honestly, without being cheeky about it, just doubt. Just a bare minimum of 'play' with any so-called AI always shows that it's still stupid and will probably be stupid for a while (and not really AI at all) My personal suggestion for anybody who is anxious about AI is to actually study the nature of the beast, so to speak. See how silly this whole fancy-speak actually is. (Plenty of books in the local libraries from simple to complex). Also, can't resist being a little bit passive-aggressive: anybody who thinks ai is good at programming is a shitty programmer. (Again, to the library and beyond! )An argument can be made that AI will actually add security jobs based on volume pressure that would be created from adversaries becoming more effective at their jobs by getting assist from AI and also just from adding complexity to the eco-system, thus making it grow.I myself think it's be \"same shit, different day\" situation like everything else under the sun.And as an afterthought, from my personal experience, when you are starting out, it is easy to get lost in these sort of theoretical brain-masturbations that are absolutely irrelevant and, dare I say, useless. You listen to a podcast from another \"veteran\" expert and down into the rabbit hole you go. You are wasting your time on \"opinions of some veterans\". Spend that time studying active directory or something, instead. Replace that anxiety about the future with hands-on work.","I think AI has its good and its bad sides. Threat actors are using AI, so we'll be forced to use it too.AI has its downside. If left on its own, it creates increasingly sloppy code because it likes to copy. You still have the same issues with supply chain vulnerabilities. How much worse is this when it affects your AI? We're also seeing weird legal battles. Our Canada had a chatbot that was just making up terms and telling customers false information. Air Canada's legal defense was that the chatbot was it's own legal entity, and they shouldn't be held liable for what it said.AI is a useful tool, but we still need humans who can think and understand the problems. Don't be discouraged because of AI. Embrace it and add to your skillset. Use it to your advantage.","Once you have a solid grasp of what AI technology is, you very quickly realize there's zero threat to your job or the future of the industry. It's great for helping you end point manage against spam emails or phishing, but it does fuck all against day zero attacks, which only you can prevent","Until they reach AGI I don't see an LLM replacing anyone here! The whole Q* Sam Altman talked about is scary though...","Never gonna happen as long as its main focus is on cat videos and term papers lol!Now quantum computing and A.I? We are all screwed!","My benchmark for this is whether our non tech background MBA can use AI to write usable SQL queries without any assistance. No luck so far. My feeling is AI can get jobs done when 70 out of 100 level quality is acceptable. But in industry like cyber security and drug discoveries, etc, scoring 70 or 85 is the same, just means useless.","What most call AI right now is just machine learning, and some of the tools are actually bad at it. Any machine can be compromised or tricked. A week trained human professional is always better","Depends on whatcha mean by do everything. I've seen AI for remediation, and AI for detection and defense.1) Doing analyst workMet a guy on LinkedIn who developed an ai tool that can do L1 analyst work... quicker and more accurately. Super cool tool. It even interacts w/ employees who received phishing emails. Man I would've LOVED that.Definitely valuable for low hanging fruit, gathering forensics, etc., and providing context,BUT:For now, any LLMs need us to look over their output.2) Detections.We develop an NDR tool. It uses AI to catch patterns in network behavior at scale... (literally looking at every bit of data flowing through your network).It's not something an analyst can do.Nor can traditional heuristic/signature based detections.AI for defense will be required, 100%.","it's still a grift that's up there with NFTs. don't panic","definitely, go find another career path.. this one is not for you.","I don’t know about you, but every security team I’ve been a part of has had a huge backlog. I think it will increase productivity to a certain degree. But we need the boost!","I’ve been using CoPilot for a month now and I wouldn’t call it “doing well”. It often gives me suggestions that should be simple but it comes up with nonexistent functions. I’d say the autocomplete feature a 50-50, it’s not great. But when you ask code, it’s a lot of times rubbish. Stupid use of functions, repetitive lines, etc. BUT I’ve used it instead of Google and it is pretty decent until you want up to date information. I work with Laravel and I think it only knows it up until 8 while we’re at 10, so I still have to browse docs and Stackoverflow occasionally.I think people who can code are very safe from AI. Those who copy paste code like a monkey (and not understand any of it) are in trouble though, which is good for the industry overall in my opinion.Aand just to stay on topic with the sub, Cybersecurity is always evolving, there are new threats literally every day. Don’t think that only the “good guys” will use AI. Bad actors will use it to find new ways to hack and breach into systems.Plus hacking (and defending from hacking) often NEEDS creativity, which AI doesn’t have. What we have is not really AI, it just has billions of data fed into it and it tries to predict the best answer based on the input and context. If you throw a completely new exploit at it or whatever, it will be probably pretty much clueless.","Black hat🤘","I want to do cybersecurity with no tech knowledge. Can anyone guide me on how to go about it?","Man, even with a PNPT, you're 'just getting into the field', I dont even have an eJPT, how fucked am I"],"points":358},{"text":["Control assessment on systems/applications","Imo, once you’ve done everything you think you need to secure a given system/network/application etc, hire a NEW pen test firm to check.I like to refer to the essay “Defense of Duffer’s Drift”, as it paints a nice picture of the defense in depth process (albeit in the context of the Beoer war, not cybersecurity).","NIST CSF has maturity levels that you could use to add some numbers to come up with a maturity score.I have also seen a combination of NIST CSF and CMMI (https://cmmiinstitute.com/cmmi) for each of the subcategories that are then averaged up to an overall score."],"points":2},{"text":["Reward for Information: ALPHV/Blackcat Ransomware as a Service - United States Department of State"],"points":0},{"text":["Microsoft Warns About New Zero-Day Exchange Server Flaw"],"points":0},{"text":["How are you getting better at reporting on risks and explaining them to leadership?","Hands down, the best way to do this is via a top-down risk register development. There are several different ways to do this but the gist is the same: Have your most-senior IT executive sponsor an exercise with the company’s leadership team (CEO, CFO, CHRO, SVPs, etc) where they are interviewed about cyber risk concerns (Fraud, business disruption, IP theft, etc.) Translate those responses into cyber risk line items and report the aggregated results to the leadership team and the board. You’ll probably want to develop a list of projects and budget requirements as a precursor.One of the best things about this approach is that the leadership team can’t dispute the list or priority and becomes somewhat compelled to fund them. “You said you were worried about this!”I’d suggest that for your first assessment, use an outside consultant to facilitate the exercise. From there you can run it yourself.","Would like to get better at this as well","My least favorite thing to do is to report risks to the CISO. It’s like calling his baby fat and ugly. I have sugar coated it to the extreme and still these guys get defensive and petty. I’m 25 years into my career so I’m getting closer to these guys age and don’t mind upsetting them too much, but I still need to get paid and it’s a pretty bad situation when your job description is to make the guy paying the bills look like he isn’t doing his job.","The C-Level don’t care about your technical risk. Not one bit. They don’t care whether it’s a SQLi or a stored XSS, or whether there’s a potential problem in some version of Java.They care about how much that risk is going to COST if it happens, the probability of that occurring, and the cost to fix it. They care whether they are going to have to report a breach.Have a look at the FAIR risk methodology. It could help you articulate your “risk” in financial terms.","Ask for feedbackMake a small form And ask on a scale 1-3 1 being Useless 3 being UsefulI got the idea from Intel471Know your audience.","Everything is on fire, the fires are prioritized, it’s unlikely well actually confirmed anything, hardening actions are x, y, x.Autobots, roll creds.","in some ways I think they are getting better at understanding the risks, but you really need to quantity \"leadership\" - board level vs C-suite, size of org, industry, etc. I generally know my boards companies/industry and watch what cnbc is reporting, to try to relate the risks to real life events.","Is there a risk function in the organization already? Try to roll up cybersecurity risks as business risks. Learning business terminology also helps, like if X system gets compromised and goes down then you're losing out on Y sales.Edit: A risk register and consistent quantification also helps build trust.","Alignment with the enterprise risk framework is where you should start","Simplicity.","In addition to my comment about the risk register, I think it’s worth distinguishing vulnerabilities (things that can be exploited), risks (events that may occur which would have an adverse impact), and threats (risks manifested by a motivated adversary.) Risks can also be categorized into business risk and technical risks.At the C-level, they speak business risk only. You can use the opportunity to educate them about cyber threats that could manifest business risk as well as the investments that can mitigate them.Within IT, you can speak to leaders about technical risk, threats, and vulnerabilities in the context of business and technical impact. Be prepared to show how these risks are real for your industry and not theoretical.","You tie a risk in a quantifiable manner to a line of business system or process. If you can’t do that, it isn’t a risk to your particular business.","In a challenging new environment where risk is sorely misunderstood, I have taken to abuse case threat modeling to analyse risks.Say the risk of data exfiltration for XYZ system.- diagram the system - document all potential threats and “abuse cases” - overlay the attack path and methods on your architecture diagram / data flow diagram - identify the existing controls in your stack against the attack path aligned to ability to prevent and detect - determine the likelihood of the threat and make sure it’s realistic - if there’s a reasonable likelihood then also look at control gaps and what’s missingThis is the first half of a quantitative analyses without going into FAIR and financial impact modelling, however that’s where I will eventually take it having spend a few years in quantitative risk modelling.The key thing here is that the business understands what data loss means, they know how bad that can be and they should be scared of it.If you can determine and highlight control gaps and weaknesses in your architecture that result in an increased probability and likelihood of that risk, you can then start having meaningful conversations about tolerance and cost vs benefit etc.It’s a long journey to educate leadership into thinking about cyber risks properly but it’s a really beneficial process.Aldo, remember that a vulnerability is not a risk. I don’t care about XYZ vulnerability unless it’s in the context of a modelling risk with a validated attack path AND impact!"],"points":28},{"text":["Co-worker wants to open a SOC business and asked me to join him.","How do you plan to compete with other very well-established and very well-funded MSSPs?What do you have to offer that would make an organization trust you with their security over another MSSP that has already proven to be trusted?","If he doesn't already have an established client list, it's almost guaranteed to fail. The first thing prospective clients want is a reference.How do he plan on providing 24x7 coverage, which is pretty much the only reason companies outsource SOCs?","Wow, glutton for punishment are you? This sounds like long hours, lots of work, low pay, and getting blamed for everything that goes wrong. GLWT.MSSP is a cutthroat business. Too many fingers in that pie already for me, thanks.","If your co-worker doesn't have investment money to hire a 24x7 staff, I'd bid them good luck and stay away. As other have posted, this is a very crowded field. Also consider the huge amount of capital you'll need to build out a decent toolset.No backer with big $$$? Not a good chance it will work.","Does your coworker have a ton of financial backing to start up this business and afford the insurances necessary for a SOC to operate? Does he have experience running a corporate business? Does he have a list of potential clients that he has a good rapport with? Does he have the finances to hire a legal team or keep one on retainer to operate that side of the business?Running a SOC isn’t like starting a tshirt company in your garage… there’s a lot of legal contracts with very real consequences involved. I would steer clear unless he has a very solid game plan and the means to follow through while being unprofitable for quite some time.","As others have said run.It's hard to set up a SOC for one company let alone many. We went to a decently sized local MSSP and it was pretty bad.Ended up going to a much, much, much larger international MSSP and all is well.","This is a highly commoditized business now. You can pretty much buy it for $5-10/seat from hundreds of companies, and most bids and business are based on existing demonstrated performance and certification levels.I don't know how you'd start from zero in 2024.","MSSP are now automating everyting with SOAR and AI.. you need more programmers and less analysts","Your co-worker is a dumb ass","What is his plan to get clients is the biggest question i'd be asking, and if he doesn't have a detailed business and marketing plan to acquire clients then I wouldn't waste time.Cybersecurity keywords for Google ads are fucking ridiculously high priced, you need at least a 6 figure budget to compete.Being a \"versatile sysadmin\" is not enough experience to be a main technical resource.Could you be a level 1 analyst, sure probably, but setting up a SOC requires specialist experience, it's not something you can just learn on the fly, security is significantly more technical than system administration.","Just to put it in perspective. The MSSP SOC I used to work for closed down the SOC because they tried to go cheap with the software we used, didn’t listen at all to our feedback, we had 30+ large clients, they saw the prices of the SOAR we needed, threw up their hands and now only do consulting and pen testing. That being said you might be able to be successful if you stick to small to medium sized businesses and have a good group of analysts on board. You also need a good set of TAMS, and Manger.","It can be done, but it isn’t an easy business to build from scratch. I helped a friend build this as an offering in his consulting company a few years ago. Being hard isn’t a reason not to do it, but be honest with yourselves about what it will take from a software, staffing, legal, and insurance perspective. Most SOC providers don’t scale down their offerings to small businesses very well, so there is a huge opportunity in that space if you can figure out how to do it profitably for you and affordability for them.","Has your friend accounted for the upfront costs? What tools are you going to use on what systems? How many contracts will you need to sign to get these tools?How many clients do you need to break even with tool costs? How much can you pay for the tools before you get your first X number of customers?","It's tough. I work for an MSSP right now and my boss started the company in partnership with another well established company, and that took them forever to turn a profit with the SOC. Like others have said, your friend should have a list of prospective clients already.","Think of it this way: in the end what your co-worker wants is a business, not just a SOC. Technical skills in IT and security are important too, but no prior knowledge to run a business will be the end of it. You need clients, funding, and a marketing strategy.","It's called an MDR. Managed Detection and Response.Much of the industry is about who you know. So if he isn't personally friends with a few dozen executives...","Think of all the vendors that try and get your attention to sell you their services. Now imagine being at the back of that queue trying to get onto preferred supplier lists.Being an entrepreneur running a small business is going to consume so much more time than a regular 9-5.If you have 6 months to a year salary in the back to support the endeavour then crack on but if you rely on that new business to make your salary I would tread with caution.","There's unreasonable amount Haters and salt in this thread.There's absolutely nothing wrong with the idea obviously you're light on the details but it's definitely possible with two guys and a little bit of startup cash.You basically need to figure out who your Target demographic is and how are you going to generate leads from them. What your default software/hardware loadout is going to be.most importantly you need to figure out what percentage of shares you're going to own in the company, how much cash your going to need to put up (then probably triple that) and do you have enough saved resources to survive for 2 years without a paycheck? because you're probably not going to get paid for your first and probably second year of operating.Also if you don't have a lot of experience in the industry and you're still very fresh you are going to have a hard time finding clients","The level of risk involved is enormous. Can you afford to risk a couple years of life on a venture with a low chance of success? Your friend may become rich if they survive on fumes while doing business at cost for years while they struggle brutally to acquire and retain clients.","I worked for an MSSP that was transitioning away from SOC services and into… something else that just thinking about it sounds absurd. An industry professional tells me that with an established client list and a working SOC, how they didn’t “make enough money as SOC as a service” was beyond him. That job felt like and wound up being after they closed the SOC a complete scam. Run. Trust me— this is a business venture with more competition than the trouble is worth, and without a pre-established client list in place for the service, the amount of risk that poses this new business is terrifying to say the least.","Look into “Goto market strategy”Success will vary based not just on how good of a service you provide, but also how good you are at obtaining and keeping customers.","Yeah definitely keep your actual job.","Damn well is he hiring? I’d like to join in","Client list is #1. If you don't have revenue immediately (or an investor with deep pockets) you won't be collecting a paycheck for very longHow many of those clients are locks and how many are something that need to be chased (with investment)?What revenue is projected in best and worst case scenarios?How is recruiting handled? A new company typically need to pay out more $ or equity to attract talent over more established companies.Is this based on remote work, a single SOC location or multiple SOC locations? A single local SOC will disqualify you from most large companies.Are you partnering with firms to build a tech stack? This works for smaller firms that want to sign a contract and forget about it but larger firms want you to monitor their tools - how do you handle the way the alerts come in?There is another 50 or so questions I could probably come up with. If it were me I would say no unless they had a very compelling anchor client to build a viable business around."],"points":326},{"text":["Office 365","Really not sure what you're asking.First, Office 365 is a license, not a product. The account is located in Entra ID. Mailboxes in Exchange Online. When grouped together we usually call it Microsoft 365, the full package that includes Office, Entra ID, the security products. You gotta know how each product fits into the puzzle, it's a big interconnected blob that can be hard to navigate if you've never used it before.Is it incident response of M365 you're asking for?Or hardening and assessment of posture?","Go to Microsoft secure score and start working through the items to start for overall security.After an account gets phished ensure you help the user to reset passwords, check device statuses within logins / portals and ensure no unauthorized devices(especially in MFA in case a mitm reverse proxy was used and session tokens were stolen), check major applications for recent logins, check for inbox forwarding rules, look for and contain sent messages and do message traces to identify the threat / potential apread and I typically do items like help reset the master password and generate a new key for it for their password manager etc recheck that they have all software needed and it's functioning. Tbh the above is a bit overkill but just some specific steps"],"points":7},{"text":["Silly Question when I can download leaked database for research ?","I present you a leaked database:username, password, role John, potato123, admin jim, anime567, user Bill, Iw3r34min, user","Wildly unethical ask.Why can you not use synthetic data for your research?","I made it here before the post was deleted!","Question is way beyond silly.","What's this for, u/pale_explanation_603?","Tomorrow","Google is your friend","At least OP didn’t ask afterwards","Just look on torrent sites. You'll need to have in mind the name of the leak you are looking for though. If you want to be a bit more ethical go for an older leak so that everyone has probably changed their passwords or deleted their account by now."],"points":100},{"text":["How do you pronounce DFIR","JIF","Dee-fear","Danish (mother tongue): De'-fearEnglish: Dee-fear","Duh-Fur","duffer!","Only one of those options is valid."],"points":15},{"text":["UMGC/M.S. Cybersecurity","As Master's courses, they shouldn't be entry level friendly. What is your Bachelor's degree in?","I am looking to attend UMGC for the masters in Cybersecurity, with no Cyber/Tech background, this springwhich one?Cyber OperationsCyber AccountingCybersecurity Management & PolicyCybersecurity TechnologyDigital Forensics & Cyber InvestigationHave you bothered to look at the curriculum? https://www.umgc.edu/online-degrees/masters"],"points":1},{"text":["Information Hacker Group Shanghai Anxun exposed"],"points":0},{"text":["Are cybersecurity research opportunities a thing?","Yes, but it heavily depends on the school/program you're attending and I think that they're great opportunities outside of traditonal internships to get really good exposure to problems that're faced in the industry. Many schools have research labs or centers of study focused on specific aspects of cybersecurity or computer science too, where faculty work on various projects sponsored by other institutions, the government or corporations. My alma mater had partnerships with places like MITRE, NSA, DoD, etc.If you've ever been to a cybersecurity convention that has talks, sometimes there'll be students from large research institutions that present proof of concept exploits or research findings done at their school's research center for security or comp sci, etc. This is partially why I'm a strong advocate for going to an in-person school if possible, cause you meet great people doing this kind of work that are in the industry. I've gotten recommendations and eventual job opportunities from professors through their connections in the field for stuff like internships. My school even requires getting either a research internship from a partner program or a co-op/internship in order to graduate too.","Check with the security studies department at your university. There may be opportunities in the pipeline but you have to be on the mailing list. I managed to coauthor a study after undergrad.","Look up the faculty in scholar.google.com to see what they are publishing then go talk to them. If there is a cybersecurity center go talk to them as well. NMCCoE for example hires about 6-12 research students at a time as well as setting up summer institutes for students. Talk to people."],"points":10},{"text":["New Wi-Fi Authentication Bypass Flaws Expose Home, Enterprise Networks"],"points":0},{"text":["Automotive Service Diagnostic Recorders","Wrong sub... r/privacy"],"points":1},{"text":["After 6 Years of Work and Thousands of Users, We are Going Full Open Source."],"points":0},{"text":["Becoming a CISO, which certifications would be the best?","The role isn't about certs dude, you're past that part of your career if this is an actual C-level roleIf you need professional development for he role, then you want something like this - https://www.heinz.cmu.edu/programs/executive-education/chief-information-security-officer-certificateYou should be looking at executive management programs not security related certificationsIf you don't already have CISSP, then I would question who hired you for this new role","CISO is 90% business and 10% security, so certs aren't much of a factor. An MBA is generally the most valuable for that position.","You should ask the Onlyfans subreddit","Just note, CISO have massive turn around, often report to a CFO , do not have Executive level push like other C-suite roles and will however be given all the blame when things go wrong (Due to the other C-Suites not giving you proper support or funding to do what you need to do)","Get a CISSP if you don’t have one. While it may or may not help you with your current job, if you ever want to move to a different company, they will want a CISSP or CISM.In addition to my CISSP, CISM, and CRISC, I also have an MBA for the business aspect.","For me cism and crisc have helped greatly, not done CISSP. Business knowledge is crucial, and for me that was just learnt over the time.","would do a masters in security from something like GT - no one hiring you for your next job will know about certs, it's all going to be presentation and executive presence skills."],"points":33},{"text":["Most useful cybersecurity training/certifications for SMB","What skills do you want your staff to learn?"],"points":0},{"text":["Next job role into Cybersecurity","Appsec, Vulnerability Management, Pentesting can be quite technical and enjoyable. Are you an individual contributor or people manager?"],"points":7},{"text":["NIST CSF Lead Implementer Certification, NICCS Recommended","first sounds like a good fit for you but I have never heard of this or seen a job require it. Secondly I have heard of the ISO Lead Implementer certification and have seen it in job listing.","EditI'm sure someone will be able to answer your question shortly, OP. I'm just not familiar enough with the program to say."],"points":4},{"text":["Third Party Risk Management learning path","I don't know of any training other than 'read some questionnaires and figure out if they make sense for understanding risks to us'.I'd start with the SIG and CSA STAR."],"points":1},{"text":["Top cybersecurity stories for the week of 02-12-24 to 02-16-24"],"points":0},{"text":["CISM certification","I mean, it really depends on what works better for you and your learning style.","You don't need to do that. Grab the CISM AIO book by Peter Gregory and buy the QAE. Study away.Also go to r/cism if you need help.","For me, offline for the CISA was enough. But that's how I study best. The instructor led does have benefits but I believe they're a little costly.","Instructor-led courses are nice because they tell you exactly the information you need to pass. But it's a ton of information in a very short time. It's really only worth if it your work is paying for it too.I recommend doing offline studying to get a good baseline of the knowledge, then if your work is paying for an instructor, do that right before you sit for the test.","Okay thank you","i have 10 plus years in network administration and handled firewalls and security issues aswell including complianceThis is irrelevant to the question you are askingHave you taken any certification exam before? if so how long ago?Have you taken an exams from ISACA before?What study methods work for you? can you read and use flash cards on your own or do you need to hear the material from an instructor? or can you watch videos?We have no clue what works for you as far as studying and retaining information","If your work is willing to pay take a boot camp to complement your own revising / practice exams. It helped me with a few areas, but I had already been working in security for a while.I took the exam about 7yrs ago when it was still on paper and held every so often as opposed to online.I personally can’t stand ISACA or any other “body” but get the exam passed it will help with job opportunities and pay rises.Good luck.","See the CISM sub forum (CISM2, not CISM).Books and online QAE is what you need. Don't spent money on instructors"],"points":17},{"text":["Advice on Audit Log Implementation for Internal and SaaS Applications","Are you reinventing a SIEM?"],"points":1}]