[{"text":["Why is my laptop randomly losing internet? Router issue?"],"points":0},{"text":["TV hdmi connection to PS4"],"points":0},{"text":["Hacked by Ex","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Post the contents of the .plist file. It's just a flat text-readable (XML) file. It would be dead easy to decipher what it does.","This reads like paranoia. If you truly think your ex is hacking you then you need to file a police report."],"points":0},{"text":["Weird audio after restarting my computer.","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Do you have discord on startup?"],"points":0},{"text":["iPhone 15 eSIM unlock","You were scammed and bought a stolen phone."],"points":0},{"text":["Strange File Name “USBCα÷╙╣.”"],"points":0},{"text":["Windows says :D drive is not connected. I can still use it. Unknown Error."],"points":0},{"text":["Compiling Shaders in CS2"],"points":0},{"text":["My Poco M2 (Shiva) stuck in bootloop while plugged in/charging. Only fastboot works."],"points":0},{"text":["PC crashing while playing \"heavy\" games"],"points":0},{"text":["PS2 silver making weird noise","Post a video if you can. It could be something as simple as a fan, or something a bit harder to replace like the cd drive or hard drive if you have one attached."],"points":1},{"text":["iPhone XS Max"],"points":0},{"text":["RTX3080 slow after waking PC up from sleep"],"points":0},{"text":["Exploded chargers","Highly unlikely that the laptop is causing damage to the power pack without being damaged itself.I would suggest getting an electrician out as multiple occurrences suggests a wider problem with the wiring.And no, the mouse cannot cause this."],"points":0},{"text":["ESPN website causing a memory leak?","If you suspect your computer might be running low on memory, please see \"How to know if you need more RAM\".Please ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Try another browser to see if it happens there too.It could be a buffer setting in the player so have a look around in its settings, or maybe the player just never purges old footage.If the stream allows it, you could watch using vlc via the stream url.Depending on the issue, it may need to be fixed by the webmaster, if you rule every thing out on your end then contact support and let them know."],"points":0},{"text":["Laptop crashes with slight moment","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["internet randomly “shutting off”","Call your ISP, it's likely an issue with their service, or their equipment (unless you bought your own, in that case your router). Another very unlikely solution to try is changing where you plug in the router in case there's a power issue.","If you're using a calix brand router, that's probably your problem. Easily the worst isp provided router I've ever touched. Frequently drops wireless connections, and gives devices much lower signal strength than my tp link router. Only reason I haven't returned it yet is 2.5gbe equipment is expensive, but once the income tax return hits, it's going away."],"points":0},{"text":["Freezing Problem With DELL G3 3590.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Ethernet wire with unstable conection"],"points":0},{"text":["Lenovo laptop won’t install windows after reset","Fast fix: Install Ubuntu or Mint."],"points":0},{"text":["The system detected an overrun of a stack based buffer in this application. This overrun could potentially allow a malicious user to gain control of this application"],"points":0},{"text":["Color on Google apps"],"points":0},{"text":["Issues with Steam/Game Drive"],"points":0},{"text":["Configuring macro on a Lenovo Legion M300"],"points":0},{"text":["Windows Installer not detecting SSD NVMe","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Why is my AOC monitor acting like this?","It only behaves this way when I'm on the desktop, not when I have other windows, tabs, or applications open. It's brand-new.","If it's brand new, and other monitors don't do the same thing, it's likely the cable or monitor is bad. I'd exchange it."],"points":0},{"text":["z906 digital audio with msi b650 tomahawk wifi ?"],"points":0},{"text":["Is there a way to make my own filter to use in a call?","Hi! I don't have much experience on it but there's a discord python library where you can make bots and automated stuff. Maybe you could create a bot that filters words or whatever you want to creade using that and some kind of speech-to-text AI or library.I hope it helps."],"points":0},{"text":["Frozen boot screen, where to start?","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Outlook in multiple locations not correct"],"points":0},{"text":["PSU+CPU problems after installing new SSD"],"points":0},{"text":["PSU+CPU problems after installing new SSD"],"points":0},{"text":["computer doesn't like headphones"],"points":0},{"text":["Is it better to use 1920x1080 at 60hz or 1600x1024 at 100hz?","How much the resolution difference matters is really for you to decide, you’re the one who has to look at it.","define \"better\", being higher resolution is better?","Input latency usually goes down with a higher refresh rate which is better for professional gamers.Personally the 60HZ experience at a higher resolution is better for my eyes and gives me less nausea","what is your use case? if you're playing competitive videogames/esports, you want the highest refresh possible. if you're doing office work, 60hz is fine.","What kind of monitor is this exactly and what do you want to do with it?If this is FHD monitor, then you really should use the 1080p resolution, because that's exactly how many pixels your monitor has and the other resolutions have the wrong aspect ratio, so the picture will have black borders on the sides or will be distorted.1920/1080 = 1.77 and 1600/1024 = 1.56","you need to use the recommended resolution for your monitor otherwise its going to look shit"],"points":6},{"text":["Any ideas as to why my photos app is taking up more than 32 GB on my iPhone 11?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Hello everyone. I have a problem with my ASUS ux410ufr laptop."],"points":0},{"text":["Weird white lines appearing on screen","Sounds like GPU Artifacting. Especially if it happened to your brother while using the same GPU in a different machine."],"points":0},{"text":["External HDD won't show up on my new laptop","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["HDR keeps turning itself off after games"],"points":0},{"text":["Help recovering lost files","You can spend 10-20 hours trying (and likely failing) to recover your data.Short version, the only software that has any hope of a solid level of data recovery from a corrupted USB (or HDD/SDD, etc.) is incredibly expensive.Short version, it's 99.9% gone. It sucks. Learn not to put sensitive data on a thumb drive."],"points":0},{"text":["Viewing links from an iOS notification"],"points":0},{"text":["Can WNASPI32.DLL work in 64-bit Windows 10?","Couldn’t you just call it with wow32?"],"points":0},{"text":["is there a floating video extension that works for reddit videos"],"points":0},{"text":["Video/Audio starts after 10-20 seconds when Headphones are not connected"],"points":0},{"text":["My old phone was in perfect condition and it randomly stopped working after i came back from a vacation."],"points":0},{"text":["Received over 100 verification code emails from atleast 40 different websites I never signed up for","There are malicious websites where you can 'submit' emails to be flooded with junk. Maybe you pissed off the wrong person?","Change your email passwords and add 2-factor authentication. Email is your identity online, they maybe had access. Check your email login history on the security page.I would then change passwords for all your online banking accounts. Use a password manager so each password is unique and complex.I would also check on your phone service. Make sure you still have service as SIM swaps can takeover your phone and email and ruin your digital life.","100% pissed off the wrong person who then gave your email to spam sign up lists.There is nothing to be done, once your email address is on a list, that's it.","This looks like an email bomb. One of your accounts might have been compromised and a legit purchase might be buried within the emails, which you wont likely see if u just consider all to be spam. Search “email bomb scam reddit” on google and check the results out.","I had this happen to me. Whoever sent them had gotten into my bestbuy account and placed orders on it with a stolen credit card. They sent all the spam so that I wouldn't see the confirmation emails from bestbuy.I would look through and see if anything stands out and then set a rule to block anything coming from those addresses. They will keep spamming your inbox, and it's a huge pain to clean up."],"points":8},{"text":["Extremely loud BEEP sounds while playing game"],"points":0},{"text":["Computer froze while playing a game, had to choke computer and now it runs terribly. It can only detect one display and the game I was just playing (BG3) won't even load."],"points":0},{"text":["Errors attempting to erase hard drive","Sounds like the storage devices table has been corrupted. - In a nutshell, the data is still there, but your chances of recovering it (or anyone outside of being incredibly skilled with a lot of usually expensive software) are damn near zilch."],"points":1},{"text":["Replace USB 3.0 dual bridge connector and add an external HDD on USB 3.0 on RPI4?"],"points":0},{"text":["[W11] Do not have permissions to access the Windows Defender folder on a clean install.","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Sounds like you may not have admin level access to the system, which I'll concede is odd if you did a clean installation.With that being said, if you're getting PuPs and viruses, you're clearly not being very sensible in your online/downloading activities.Free tip - \"metalica.exe\" is probably not their latest album.","I had a similar issue a while back trying to fix a corrupted system file. Windows really doesn't want you to mess with those files, and I think the same is true for quarantined files. You can take ownership of the folder through powershell, but I'm not sure it's worth the effort."],"points":0},{"text":["Is my ONN Media Player Region Free?","See https://www.videohelp.com/dvdhacks/onn-100008761/12926"],"points":0},{"text":["Disk visible in bios but not in any OS"],"points":0},{"text":["Usb port no longer works"],"points":0},{"text":["Help. 100% disk usage slowing Asus laptop","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["bedtime mode"],"points":0},{"text":["PC restarts 1 time during boot and doesnt post at all","Some motherboards have 4 LED lights indicating the boot process: CPU, VGA, RAM, BOOT (maybe not in that exact order).If yours has these, then look for the light it hangs/boot cycles on."],"points":1},{"text":["Windows 10 home activation","I could type, but here you go - https://answers.microsoft.com/en-us/windows/forum/all/installing-windows-10-pro-instead-of-home/fb62c4e8-8829-41ba-817c-aff3cca51b3b"],"points":0},{"text":["Extremely slow internet.","ISPs rate speed in Mbps but most software report download speed as MBps. The capital B matters.8mbps = 1MBpsIf your service is supposed to be 7Mbps, then you are getting about that when downloading."],"points":0},{"text":["Brand new custom made gaming pc not turning on day after first play session","Switch on the PSU turned on?","Sounds like Power Supply or wiring."],"points":0},{"text":["Really slow typing in facebook","Facebook is a VERY bloated platform. - You'd probably be best trying to swap out to a less resource greedy browser (Opera is pretty good)."],"points":0},{"text":["Oddity in own profile: posts and comments not shown..?!"],"points":0},{"text":["Razer Huntsman mini is having glow issues, W button has turned a bright red color, and the r button has stopped working."],"points":0},{"text":["New GPU & screen flickers to dark colors"],"points":0},{"text":["Problem after PSU short circuit Blackscreen of death"],"points":0},{"text":["2.4Ghz Only","That's a very weird router to only offer 5Ghz support. Particularly since a LOT of devices still only offer 2.4Ghz connectivity.There probably is an adaptor, but I can't help but feel that a different modem/router would be a better choice.","If you have a multi-million dollar house as you say, and getting a water heater on your WiFi is that big of a priority for you, then you need to shell out a little money that doesn't seem to be too much of a problem for anyone with a multi-million dollar home, and own your own router and modem and not using Xfinity garbage that isn't reliable and is clearly not working as intended.Get your own modem. Get an Arris modem, and then get a router or mesh network like an Eero. It'll auto use 2.4/5 as needed, and give you no more problems.Sometimes the answer is to stop relying on free shit from your provider and use something that is actually going to be useful.Also, it's not free, because you're leasing the modem/router from them and are paying a monthly fee.","Call Comcast and have them replace your gateway so 2.4Ghz works.Or put your Comcast gateway into bridge mode and connect your own router.","[deleted]","A cheap wifi extender will probably work . Plug it in, connect to the 5ghz wifi from the router and give its 2.4 a different SSID. Had a similar problem with a smart TV that didnt like the single SSID bullshit/band steering of the ISPs router.Other option is set the ISPs modem/router to bridgemode and get your own wireless router where you can split the 5 and the 2.4.","Not a comcast customer but most every wifi device I have seen or used support 2.4ghz. It's gonna be something like thisOpen the Xfinity app and sign in with your Xfinity ID and password.Go to the WiFi tab.Select Wifi Details.Select Edit WiFi settings.Select 2.4 and 5 GHz WiFi.Select Edit next to the WiFi band you want to update.Select the new WiFi Mode and/or Channel setting.Select Save to save your new settings.Using the Admin ToolConnect to your WiFi network.Open a web browser, go to 10.0.0.1, and sign in.If you haven't changed it, the default is:Username: adminPassword: passwordGo to Gateway > Connection > Wi-Fi.To change your Channel Selection, select Edit next to the WiFi channel (2.4 or 5 GHz) you'd like to change.Click the radio button for the channel selection field, then select your desired channel number.To change your WiFi Mode, select Edit next to WiFi Mode and select your desired mode.Select Save Settings.","Why do you want your water heater on your network?"],"points":7},{"text":["Clownfish voice changer problem."],"points":0},{"text":["Additional Monitors"],"points":0},{"text":["\"System UI is not responding\" error message but system is responding"],"points":0},{"text":["lacie hard drive vs Mac"],"points":0},{"text":["PC Frequently BSODs with IRQL NOT LESS OR EQUAL","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","How often is \"frequent\"? There are only two dump files that are relatively recent. Is your system sometimes experiencing BSOD crashes that fail to generate dump files?"],"points":0},{"text":["Switching between work laptop and PC"],"points":0},{"text":["PC fans spinning but RGB is not lit up.","I doubt it's a PSU failure if all your other components are working fine; rather it sounds like the LEDs just gave out.PC fans are notorious for having the RGB lighting \"die\" way ahead of times, (that's why some manufacturers like Lian Li limit how bright fans can get). It's a pretty common issue, at least from what I've seen. How long have you had the PC for, and do you have any software to control the lighting, or is it manually controlled on the case? If it's the former, it could be a software issue, which you could address by updating the control program."],"points":0},{"text":["PC restarting when playing demanding games."],"points":0},{"text":["Spilled water and touch pad not working."],"points":0},{"text":["Low storage problems with little apps installed","Use Tree Size Free to check what apps are wasting the space"],"points":2},{"text":["Help with a memory dump....Unexpected kernel mode trap BSOD","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Locking screen samsung galaxy 10+"],"points":0},{"text":["Get Backup Pro 3 - incremental backups"],"points":0},{"text":["KVM no Keyboard output when hotkeys enabled","what is the brand and model of the KVM switch ?"],"points":0},{"text":["How do I remove cooking oil grease from a desktop PC?","The go-to cleaning fluid for computers is isopropyl alcohol, but I have no idea how that behaves with cooking oil. From unrelated experience, active oxygen based cleaners are great at breaking up cooking oils but I would not recommend that for PCs; I've only used it for stainless steel extractor grilles.","If it's on the outside them detergent, with soft sponge, but if it is inside, then you need to take it apart, even the conponents and clean them with soap and dry it properly before assambely."],"points":0},{"text":["\"Sleep\" function disappeared from power settings | Windows 11","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["SSD for Dell PowerEdge R740"],"points":0},{"text":["Significant Windows 11 issues after latest Windows Update, anyone else having problems or know of a fix?","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","How long did you wait before you deemed it as stuck? On the welcome screen that is.Because after my PC updated it was sitting on the welcome screen for at least 5 - 10 minutes but has been working as usual after that.So, are you giving it the time it maybe needs before beginning to power reset and so on?"],"points":1},{"text":["Pc Running Way to Slow for its Specs","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Need to identify which part is broken HELP!","I'm not sure, but it looks like it could be a problem with the GPU. That said, it could be any of the ones you mentioned. Do you have any monitor or spare graphics card to troubleshoot with? And have you done a \"clean install\" of your graphics drivers?"],"points":0},{"text":["Error code 0xc00021a","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Brand new laptop is incredibly slow?","What are the specs?I would expect that it will be downloading Windows updates as well as app being updated from the MS App Store so they could be one cause.","Check if it has an SSD... if it doesn't return it and buy one with an SSD lol.","Check that S mode isn't enabled"],"points":2},{"text":["What are These X's on the Bottom Left of My Applications on My Desktop?"],"points":0},{"text":["Help solving Random restarts on pc","Here’s all the Specs I can think of off the top of my head:-Windows 11 -Msi b450m gaming plus motherboard -Ryzen 5 2600x with AMD stealth cooler -Evga Gtx 1070 FTW -Team group team force Vulcan 16gb ddr4 ram clocked at 3200 MHz -1 TB Crucial MX500 SSD -Cooler master 600 watt Psu from an HP omen -3 intake fans, 1 exhaust fan (all 120mm) -144hz asus monitor -Amazon basics Display port 1.4 cable -Philips Cat 8 Ethernet"],"points":0},{"text":["PC power itself off and then won't start anymore"],"points":0},{"text":["I need help uninstalling avast One","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Laptop refuses to fully go to sleep","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Can i use a hdmi-vga adapter for my pc and graphic card?","If problem is hdmi port, and not monitor itself, adapter will work without a problem (DVI is also digital as hdmi, and doesn't require nothing more than adapter)."],"points":0},{"text":["I'm a dummy. 0xc0000185","System files are damaged, you will need to reinstall windows. And for that, you will need usb with windows installation - 8Gb+ flash drive, working computer with internet (best would be also on Windows, Linux and MacOS can be problematic sometimes)."],"points":0},{"text":["How can I batch convert .mp3 to .FLV?","ffmpeg -i blah.mp3 blah.flv"],"points":1},{"text":["Games CTD windows 10 & 11","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Port forwarding problem","If you are having issues with port forwarding checkout this wiki article.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","To port forward you need to access the default gateway of your router, and login there using the admin credentials for your router. If you never set this up, you can find the default login for your router model online. You can also find the default gateway for your router online, but it's usually 192.168.1.1, or 192.168.1.0, 192.168.0.1. All common.","Sounds like the web gui didn't get setup correctly may need to factory reset your router."],"points":0},{"text":["reccomendations for a good iphone charging cable?","I usually only buy Apple or Anker."],"points":0},{"text":["Samsung 75nu8000"],"points":0},{"text":["Disabling CPU fTPM to update Bios, but using windows 11?","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","I would probably just update it from within the BIOS, and then re-enable it after it updates but before first boot.I would be cautious about reading those update notes thoroughly, however - The fact that it's asking you to turn off fTPM would lead me to believe it's also performing an update on the TPM module, and quite often (Not always, but often) that means you need to disable Bitlocker if it's enabled and fully decrypt your drive prior to updating, or you can end up with an unbootable drive and total loss of any data that isn't backed up."],"points":1},{"text":["alt tab not working and very broken"],"points":0},{"text":["Is it ok if I wipe metal laptop frame while it is on?","I'll be honest, I do this all the time with my personal system and have never had a problem. It's unlikely you'll damage anything, but there is a non-zero chance that you will. So it's all about your comfort level.Windex, 3M and other brands sell non-conductive wipes for electronics which is what I would recommend for the overly cautious.But if you have no choice except to use a damp cloth then make sure it's barely wet, and I mean almost dry. Follow up dry cloth to capture any moisture on the surface that could make it inside."],"points":1},{"text":["4080 Super not being recognized, Code 45","Disconnect GPU fully and reconnect it?","it was a loose cable. my fault yall 😭😭😭"],"points":0},{"text":["Cloned M.2 SSD not showing up in bios or windows disk manager Troubleshooting"],"points":0},{"text":["My modem connects to my router but doesn’t connect when I wire it to my computer.","Did you power cycle the modem once you connected it to another device?","Yeah, tried that already","Was the modem reset and set up with your details? Or was the modem reset and the router set up with the dial up details. Or is dial up done by using either the modem or router's MAC address?Asking because I live in another part of the world.","This won't work because the modem is just a modem, it's not running DHCP etc.Why are you trying to connect directly to the modem?Your router should connect to the modem and your PC should connect to the router.","Fixed"],"points":2},{"text":["Gaming pc","And steam and discord and stuff"],"points":0},{"text":["Blank Screen booting Dell Optiplex. Is it time for a new one?"],"points":0},{"text":["PC shutoff during gaming, won’t turn on"],"points":0},{"text":["Aorus B550 pro ac bios update"],"points":0},{"text":["Continuous Beeping Sound Issue When Laptop Enters Sleep Mode with External Mouse Connected","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["how do i change my nat type to open?","If you are having issues with port forwarding checkout this wiki article.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Look up the model of your router and a proper tutorial on how to portforward. UPNP is shit and works half the time."],"points":0},{"text":["Two partitions one HDD","https://imgur.com/F8etmDk","If you look at partitions in Disk Management, there is most likely additional system partitions between C and E. Windows don't know how to handle that, there are 3rd party software that can.","A simple but time consuming way to fix this is just to back up your data, and do a clean reinstall of Windows. Whenever I do a clean reinstall, part of my process is to delete EVERY partition, and then create one new partition that is the whole drive. Then, when Windows installs, it creates whatever partitions it needs as part of the install process, I don't need to worry about it. So that is one method to accomplish what you want.","Fixed it. In boot menu there was no RAID volume created I've created it and added both HDDs into volume. This time they're connected and working as one"],"points":0},{"text":["Probelm starting applications (Windows 10)","Yeah, having OS on slower hdd doesn't make much sense. I recommend clean install, to get rid of old leftovers. (disconnect hard drive while doing windows install)."],"points":0},{"text":["Windows 10: All devices suddenly disconnected and now clearly receive power but do not work. Cannot do anything or even enter BIOS.","Disconnect front panel connector from motherboard. Disconnect all usb devices and boot drive (that should force mb going into bios). If you manage to get into bios with that, connect kb afterwards and see if it is working.If none of above is working, mb is most likely damaged."],"points":0},{"text":["Redirected to a strange site while browsing another one.","HiWhat device are you browsing on? Phone? PC?"],"points":0},{"text":["Pc Froze Overnight","Pc says “could not find the recovery environment” when trying to reset. I’ve never got that message ever when trying to reset"],"points":0},{"text":["Why can't I access //HIS-PC but //HIS-PC/Downloads is reachable on Windows 10 Network?"],"points":0},{"text":["Bluetooth with an usb stick","HiWhat exactly have you bought?You might have had to have the stick in before installing the driver.As you didn't post any system specs, I'm assuming you are on Windows 11?Try this:https://www.howtogeek.com/743815/how-to-turn-on-bluetooth-on-windows-11/(if the link doesn't work copy it as text and paste in your browser)"],"points":0},{"text":["Strix Motherboard B650E-E at 83c.","AUXTIN0 should be reading for PSU temperature sensor, if there is any. Usually not reliable, even if psu has one."],"points":0},{"text":["i3 12100f upgrade to i5 12400 is it worth it?"],"points":0},{"text":["Usb cooling pad makes my game lags"],"points":0},{"text":["How can i change grub config?"],"points":0},{"text":["Windows Login Help"],"points":0},{"text":["My laptop has lost it WiFi option and I have no uninstall network adapters and can’t get them back."],"points":0},{"text":["Why do the 'Optimal Settings' for a game in the Nvidia Geforce experience still run poorly?","Because it doesn't work properly. optimal settings are never good for my 3070, or the 1060 I had before that either. They either overshoot to the point that game chugs, or put settings so low it makes no sense."],"points":0},{"text":["Help! My PC is on a crash loop.","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Boot into safe mode, you can do that from login screen if not possible other way.In safe mode uninstall graphic adapter, with deleting driver (checkbox). Do not connect to internet yet, go to update and pause for a week. After that you should have working computer, without drivers for gpu, download that from laptop support page or from Intel."],"points":0},{"text":["How to limit Xbox download speed","You'll need to get a router and put the hub in modem mode. The router should then let each device be configured to whatever speed limit desired.","HiSome routers let you limit bandwidth per user, but I don't think the smarthub can.The only alternative for now may be:https://support.xbox.com/en-US/help/hardware-network/connect-network/manage-network-bandwidth-for-game-downloads(if the link doesn't work, copy as text and paste into browser)","Just turn off standby mode in the Xbox settings","Crude yet effective - put a 10 mbit hub and wire it in. That will make the Xbox behave. You'll need 36 hours to download a game though."],"points":1},{"text":["Font changed in some websites."],"points":0},{"text":["What's a good gaming chair to buy","I might get downvoted for this but skip buying a \"gaming chair\" and look into higher quality office-type task chairs that are designed for long-term sitting.You'll pay a bit more but you won't be in something that breaks down in a few months or a year.","You just have to check online stores and see what your budget can afford to buy. Although, I'm sure it's not going to be anything too sophisticated but it's going to be manageable.","A gaming chair will hurt you more, they're modelled after racing seats so they will naturally restrict your movement. After all you don't want your body flying everywhere in the car in a racing accident do you?Get an office chair.","gaming chairs are ass get an office chair with armrests that arent plastic"],"points":9},{"text":["pc does complete black screen after i left if inactive for ~1.5 years","Try with another power supply."],"points":0},{"text":["CEC Dongle"],"points":0},{"text":["Suddenly Pc Stopped Working after shutdown","This might be a problem with the power circuit. If you're tech savvy and know how to dismantle your PC, you can do so and find out the problem but if you can't, just call in an expert to do it for you."],"points":0},{"text":["My boyfriend may have lost his gaming clips while backing up his pc. Are they recoverable?","Use a recover program and see if it can find anything.But if it was only a system recovery your chances are not too bad.","HiIt all depends on how he backed them up and where.","So typically if you reset your windows depending on how you did it you can access your old files in a folder called windows.old (I think? Can double check name with a Google search)"],"points":0},{"text":["Potential Problems with Uninstalling Main Disk Drive","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Dual 4K screens at school flicker/snow screen when connected to some laptops"],"points":0},{"text":["My little brother is being blackmailed with his photos.","Tell the police.And never pay anything.Block him on all platforms.","Tell your mom and dad, they already seen him naked.Never pay and no one care about nude dude pictures.","Never pay. Block scammer.It sounds like his parents should know.","It depends on the kind of pictures your brother is being blackmailed with. Is it a picture that's going to put him in serious trouble?If not, then never pay the scammer and block him or her.","What is the message sent, did they sent proof ? Because it’s a common tactic to mass mail leaked emails with some specific information and just threat to do stuff when it’s only bluffing to gain money with minimum effort.","The blackmailers IP address should be listed in the header of the email. Go on youtube to quickly see how, print it out and highlight all the IP addresses and then use it to file a police report. Fingers crossed that will be enough for them to get a warrant to trace the IP to an address... the question is if police will be motivated enough/have the resources to do anything. Keep us updated, hope you catch these bastards!","Tell him to not engage. The fear of sharing is their leverage. They won’t share while they think they can make a buck. If they share, they’ve lost their leverage and chance to make money. When they realize your brother is not engaging, they will (generally) move on unless they have been antagonized and then they will share for revenge.","This isn't really a tech support question. Reach out to the police.How little is your little brother? And what type of photos? Because if he's under 18 or whatever the age of majority is where you live and the images are indecent then the police will be very interested and the blackmailers are screwed.","Report to the cybercrime department","This scam has caused multiple suicides so please approach this with full seriousness. https://abcnews.go.com/US/parents-teenager-died-by-suicide-after-sextortion-scam-urge/story?id=99047305"],"points":23},{"text":["Fujitsu ticking sound"],"points":0},{"text":["Weird usb-connection issue between Android and PC."],"points":0},{"text":["D drive doesn't exist anymore according to my PC","HiYou haven't made any hardware changes / been inside the pc case?Just trying to rule out if it might be something simple like a loose cable."],"points":0},{"text":["Text won't go through AT&T to T-Mobile"],"points":0},{"text":["I need help with recovering deleted files","You could maybe try Recuva or Testdisk and Photorec."],"points":0},{"text":["Im trying to make a recovery environment so i can reset my pc but its not letting me (More context in description)","Just Re install it via USB stick."],"points":0},{"text":["Black screen after windows 11 update!","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Just removed and installed the gpu again. Now I’m hearing beeping from somewhere within the pc, and still black screen. The codes are now switching between ‘CPU’ and ‘DRAM’ with the pc turning off and on again."],"points":0},{"text":["PC freezes with BSOD when playing more GPU intensive games (dump file included)","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Try change game drive to ssd"],"points":0},{"text":["i can’t stop my tabs from glitching on my ipad"],"points":0},{"text":["Intermittent black screen and reboot on new build (7800X3D, 4090, etc.)","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","As bug check was: 0x00000119 is a know issue with the graphic's HAL not just the drivers (Hardware Abstraction Layer). I'd recommend a full OS reinstall, you've already done DDU with drivers, but the issue may be corruption at a system level."],"points":1},{"text":["Should I format my PC and reinstall Windows?","Why not try Linux? But to answer your question, reinstalling will always be fast in the beginning but if you have bad habits it will slow down again over time.","Everytime I boot my PC Windows requires a disk drive check.This alone should probably tell you to reinstall windows. If that doesn’t fix things or you have issues in the process, you probably have a bad drive"],"points":1},{"text":["Failing GPU?","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","HiHave you tried measuring temperature to rule out any gpu / cpu overheating?"],"points":0},{"text":["Usb mic not working","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Recovering a drive after changing its disk label","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Don't panic!Changing the name shouldn't delete any data or did you format the partition?How exactly do you mount your partitions?Please check /etc/fstab or something.What happens when you try to mount the partition manually?mount -r -t ntfs /dev/sdX1 <somemountpount>where /dev/sdX1 is the correct NTFS partition."],"points":0},{"text":["Best way to save photos and videos from iPhone?"],"points":0},{"text":["CPU Speed stuck at 0.40 ghz","Start by getting a more reliable piece of software like HWMonitor, that'll give you a lot more details."],"points":0},{"text":["Audio from one speaker works only intermittently with Cambridge Soundworks Microworks Computer Speakers"],"points":0},{"text":["Current running through hdmi cable/TV can it be used","A cable that is shocking you enough for you to yell out in pain...and you are asking if it's safe to plug into anything?"],"points":2},{"text":["PC won’t boot","If you are getting to bios then it's not your ram, GPU, CPU, motherboard. You are actually booting up, just not getting past bios. Sounds like your hard drive is being read. Try plugging it in to a new m.2 or sata port","IT doesnt know what to Boot from i guess... Different settings in BIOS maybe?"],"points":0},{"text":["All my Games keeps freezing"],"points":0},{"text":["Windows 10 PC has lost internal sound capability"],"points":0},{"text":["Microphone sounds well on Razer Synapse and while playing but not in discord or windows"],"points":0},{"text":["Unable to get mic from splitter cable"],"points":0},{"text":["AX210 Intel Wifi/Bluetooth card"],"points":0},{"text":["Windows unistallation","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["myPhone flip lte game format","Definitely not APK, that spec is too weak to run Android even from a decade ago, and also not Java, feature phones have also stopped offering Java for years. The same CPU is used by Nokia for their feature phones, but their OS is definitely not available for other phones.Even if the proprietary OS supports installing apps, I doubt anyone can compile their own app for it since normally it will be locked to only run apps signed by the vendor."],"points":0},{"text":["Why does my computer suddenly go into bad quality?","Your graphics card driver might be crashing and then running at low resolution. Explains the black screen then switch to low res.Try installing a newer/updated driver","If it's happening more frequently, it might be a problem with your display cable (HDMI, Displayport, etc.), it could be dying/breaking.Try switching it to another (known to be working) one if you have one available.","This would most likely be a problem with your graphics card. If the issue is repeating frequently, you should check your graphics card.","I think the screen resolution in game changed, check the graphics settings"],"points":4},{"text":["1 Flash Drive and 2 PCs"],"points":0},{"text":["[macOS, M1] I want playing media not to pause when I take bluetooth earphones off"],"points":0},{"text":["Can't find the ssd slot","this might help i would say https://www.youtube.com/watch?v=bnG6mdQuLco","If this is the model it has eMMC, soldered on board, no expansion slots.","Google your model number and you will see where it is located."],"points":1},{"text":["Low FPS with low CPU and GPU usage."],"points":0},{"text":["Wi-fi card is problematic","Your WiFi card is mini pcie half height.They don't make modern WiFi cards in this form factor anymore. My recommendation is that you try find some Frankenstein new one from AliExpress or get a tested working one on eBay."],"points":0},{"text":["Thumb drive becomes hot","Just buy a new one. Recovering it will cost so much you won't be asking here if it's worth it."],"points":0},{"text":["Friend’s OS Migration has been stuck for hours"],"points":0},{"text":["Acer Swift spare screen alternative?"],"points":0},{"text":["Razer headset not working with amd adrenaline"],"points":0},{"text":["Why does my 75hz monitor look so bad when set to 60hz?"],"points":0},{"text":["how do i make a macro for a game?","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Check out MacroGamer used it for years. You can find videos as well if you don't know how to use it."],"points":0},{"text":["Windows audio blows out when in game"],"points":0},{"text":["Monitor started showing weird colors"],"points":0},{"text":["PC wont boot now if the HDMI is plugged into the GPU. Is my GPU dead?","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["i am unable to download any apps on windows can u help me !!!! music and vidoe are downloaded easily but not apps https://imgur.com/a/zo9MH4x here is ref.","HiThey all show as a network issue.See if one of these helps:Ty resetting Windows network: https://www.lifewire.com/reset-network-settings-in-windows-11-5194111Try power cycling your router; Pull out the plug, leave it off for a few minutes an start it back up. Wait for it to reconnect with your ISP, might take a while, usually 10-15 minutesPlease also post more details of you need more help, also your system specs."],"points":0},{"text":["adobe firefly generated photo use as logo ?","You're allowed to use Firefly output for commercial use without paying more (since you already pay for the subscription anyway) to Adobe https://helpx.adobe.com/firefly/faq.html#using-firefly, however, some jurisdictions such as the United States doesn't extend copyright protection to AI-generated images, which means if someone else uses/modify your logo you can't sue them on copyright ground."],"points":0},{"text":["Could low voltage cause my pc not to turn on?","Tried plugging it elsewhere as wellnot sure if this is what you meant by saying this, but you should also check the outlet op, I had a similar situation in the past and the outlet was overheating because of variation in the voltage in my area. In my case, my PC would turn on but it would behave really weird when being used, things like being slow, popping nonsensical system errors, and sometimes it would restart itself.","A power supply converts the input voltage+current into a range of output voltages and currents.I'm not super familiar with exactly how it does this, but it would make sense if you vary the input voltage down enough, then the power supply won't have the energy it needs to turn on. Even though for other appliances, the difference isn't big enough to make a difference.Some people in places with power issues use UPS (uninterrupted power supply - essentially a battery) to iron out some issues with power. They are supposed to give you a few minutes to save your work and shut down during a power outage, but maybe they could help \"charge up\" from the low power to start the machine, then once it's running there is enough passive power to keep everything running?The PC will use peak power when under load, tho. So it's possible that this wouldn't really help too much.Idk, I'm really not sure if that is a good idea, and it probably wouldn't be a cheap experiment either.","Low voltage can kill some electronic devices.https://en.wikipedia.org/wiki/Brownout\\_(electricity)#Effects","Yes, it's possible for low voltage not to bring current to the socket. I've had the same issue with my laptop and even smartphone charger too."],"points":1},{"text":["Can someone track me through Bluetooth with a VPN on?","They are in your walls","What kind of fucking question is this? 😂","Bluetooth only transmits in a very small radius, it is not affected by or has any connection with a VPN for encrypted web trafficNoone can find your location based on your headphones unless they are airpods and linked to another person's icloud, and if they do belong to someone else and are in their account, then of course they can track them, a vpn does nothing there as it's other peoples devices that send the information","Yes, they can probably hear what you're thinking too","No.","Bluetooth has nothing to do with the internet.","LMAO","If they really try maybe but no one cares enough unless you stole something","No.","Bluetooth is short range. If they are near enough to connect to them, then a VPN won't hide your location.You can't track Bluetooth devices through serial numbers. They don't give anyone a location","Bluetooth and VPN are in no way connected."],"points":23},{"text":["I cannot access virus and threat protection in windows 11","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Is it your mom's ex work computer? It might still be device managed by them","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","just do a clean install of windows 11 using a usb key, the computer may have been setup by a company or something and so access may be blocked. Download windows 11 from the microsoft site onto a usb and install it fresh"],"points":1},{"text":["PC won't read my HDD unless it's titled","The HDD has a read/write arm inside that moves \"side to side\" (when mounted flat) as the disks inside spin. If the mechanism that moves that arm is suffering from a mechanical fault, it might be possible that the gravity on the arm when it is sideways is helping temporarily \"fix\" that issue. Or it could be related to the bearing(s) on the spinning disks.I would suggest backing up any important data on that drive immediately. Run CrystalDiskInfo if you want to see the health of the drive, but it sounds like it would be a good idea to replace it. A faulty drive could competely fail tomorrow, and you'd be looking at a very expensive bill from professionals if you wanted that data recovered."],"points":0},{"text":["Webcam? Hotkey keeps flashing up and then off again","There was a little slider on the side of my laptop that was half way between on and off causing the issue"],"points":0},{"text":["My iPhone 11 will randomly press buttons that I have not clicked and I don’t know what to do.","Propably a lose connector or a damaged touch panel.You could try to reset it and see if it was just a software problem but the chances are low.There isn't a fix without opening it up and check the components.You either bring it to a repair shop or if the costs are to high get a new phone.","If its cracked amd youve left it that way thats pretty normal unfortunately, maybe a soft reset as a temporary fix.","I wonder if you may have water damage. Got wet at some point after braking? But yeah, if you've dropped it alot then stuff can dislodge inside too.","cracked displays do this pretty bad on the 11 and X series phones (the curved glass faceID models), a display replacement is really the only “fix” as even officially there isn’t a way to calibrate that out"],"points":3},{"text":["Motherboard shows only grey screen - no bios.","HiYou said resetting the battery, what exactly did you do? Removing the battery doesn't always reset the bios completely.Try the method suggested in the manual (1-27):https://dlcdnets.asus.com/pub/ASUS/mb/LGA1150/GRYPHON_Z97_ARMOR_EDITION/E9266_Gryphon_Z97_Armor_Edition.pdf?model=GRYPHON%20Z97%20ARMOR%20EDITION(if the link doesn't work, copy it and paste it in your browser)"],"points":0},{"text":["upgrading pc","HiOf course you can move things over if the new motherboard has the right connections.Windows might get a bit \"confused\" though if the hardware changes are too numerous.You will also likely have to reactivate Windows because it was activated on a different motherboard.Most of the time I would suggest a fresh Windows install to get rid of old files and drivers that are no longer needed by the new hardware. But it's up to you."],"points":0},{"text":["Android/Funtouch OS 14 update on Vivo Y76 5g?","HiWhen I look at the support site for your phone only one update is listed, it is dated june 2022https://www.vivo.com/ph/support/upgradePackageData?id=1605"],"points":0},{"text":["Started getting BSOD a few weeks ago, Code 7f","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Saving Docs by Print to PDF","I'm assuming you are printing from a browser. Which browser are you using and have you tried a different one to see if it has the same issue. I mostly use Firefox or a FF derivative and haven't had any issues. I use to have period print issues with Chrome before I ditched it for other reasons."],"points":0},{"text":["ERR_SSL_BAD_RECORD_MAC_ALERT only one one website?","Also, if i open Udemy with another WIFI and then switch to mine, I can continue using Udemy on my WIFI...","Maybe your antivirus is causing this, have you tried wiping your cache and everything? Are you under windows10?"],"points":0},{"text":["bad internet connection on a new laptop","Network Reset? Or just do a clean install, it might come with preloaded crap."],"points":0},{"text":["Black rectangle in fullscreen"],"points":0},{"text":["About .php virus on mobile devices","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Most computers don't even have a proper server to run PHP files, your phone definitely doesn't unless you're a developer, and even then you'd have to deliberately set your server to somehow load that file.Just delete them and move on","No. PHP is a server-side language. Your mobile isn't a webserver. You'll be fine as the script won't run."],"points":0},{"text":["Help! I did something very foolish and the screen stopped working"],"points":0},{"text":["Kernel Power Event ID 41. Computer Crashing","HiSee if you get a readable BSOD if you disable auto restart on BSOD:https://www.elevenforum.com/t/enable-or-disable-bsod-automatic-restart-in-windows-11.8084/Did you already measure temperatures (especially cpu and gpu)? Could be an overheating issue"],"points":0},{"text":["AMD Drivers","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","HiTry uninstalling any remnants of the current driver using DDU:https://www.guru3d.com/download/display-driver-uninstaller-download/Afterwards download the latest driver from here and choose \"reset settings to factory default\" (or something similar).https://www.amd.com/en/supportSee if that works"],"points":1},{"text":["MacBook Air M1, attempting to downgrade to macOS 14.0 Sonoma"],"points":0},{"text":["Dell xps 27 visual glitches","HiSee if the cable (hdmi?) is connected firmly on both sides (GPU/monitor).Try replacing the cable.Also check the monitor power cable for any issues."],"points":1},{"text":["Don’t know how to fix laptop display","HiMaybe just uninstall and re-install the game?You also don't mention what game, what mods (might just be incompatible with the steam version), what system specs / OS."],"points":0},{"text":["Droidcam on pc with no wifi?","Buy a wifi dongle for your PC, or use its USB support if the distance is acceptable. Or just try using the IP setting, it should work unless your router prevents wifi and ethernet clients from interacting."],"points":0},{"text":["New computer, problem persists","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","HiAlthough the error is often cpu or ram related, other things can cause it as well, a minidump would have certainly helped but doesn't always give the answer.Read trough this article, it might shine some light:https://www.lifewire.com/how-to-fix-it-when-you-get-a-clock-watchdog-timeout-error-in-windows-10-4778090"],"points":0},{"text":["Visiting an insecure website?","It's showing as secure for me on my phone browserAn insecure site means that it either doesn't have a certificate or a the certificate verification has failed for various reasonsAn insecure site (http) is fine as long as you don't enter any personal info. Anyone can sniff the data and since it's not encrypted, anything you enter is visibleAn insecure site that has an invalid certificate (https) is secure from people sniffing data outside BUT it means your browser cant verify that the site is who they say they areI probably wouldn't put personal data in there either unless you trust the site. Some of my stuff at home is secured but with an invalid certificate because I haven't properly signed it yet","Every website is like a person. You are very close to some people and know that they are friends. Some of your friends have more friends then you. So when you meet someone new you ask your friends \"Does anyone know this person?\" Sometimes your friends answer with \"Yes I know him, he's chill.\" And sometimes none of your friends know this new person. Does that mean that the new person is a terrorist? - mostly not","Just because a site is insecure doesn't mean its unsafe to visit.The site has a certificate that is missing it's owners name. The connection between you and the server is still encrypted.Not that ANY of that matters as you're not inputting anything into the site.Stop being paranoid.","If a website is insecure, just give it some words of encouragement and let it know that you value it and it has worth.","bom.gov.au doesn't support HTTPS and doesn't need to. It's not always useful. It's a government created weather site. It's fkn awesome.","Secure doesn't really mean what you think it means. A secure website really just means it is encrypted via a trusted source. These trusted sources usually just mean that someone paid the trusted source to say the website you are using is secure. A trusted website can easily contain malicious software. It happens all the time.An untrusted \"non\" secure HTTPS website is still encrypted. It just means the encryption source isn't trusted. This could be malicious, but usually just means whomever didn't feel like paying for a certificate, or it wasn't worth it to do so. Everything from your printer, to your wireless router uses these untrusted encryption certificates.An HTTP site is just a website that doesn't use encryption.TLDR; untrusted or non secure sites don't mean anything really. Don't put passwords or payment details into untrusted sites if it isn't your own website. Simply accessing the site doesn't do anything.","When you get the notification a website isn't secure, it means that SSL of of the website have expired. It's not safe to use such website because scammers are hackers can steal your details if used on the site.","If you find a unsecure website it just means that those websites have harmful codes or just using unsecured web protocols","Where did you get the warning? https://www.virustotal.com/gui/url/549bf1f9eff84aabb129f65ba4f0138f128f170ae3933977d069522f7c88ce3a says that the art site is fine","I struggle with this issue as well! I usually don't access them. The warning is usually along the lines of 'your information may not be safe' which refers to info you input so if no info is input then no harm.It is highly context related. You refer to an .org. domain and they probably have a shit web runner and it is most likely safe since all you are doing is looking at pix.I just ran into this with a local non-profit and emailed them a screenshot of the Malwarebytes warning and they responded that they would look into it. So, tell your prof and maybe tell the site.Overall, your attitude is healthy and sensible.","Insecure websites may just not have a certificate. My home server is one example of an insecure website but I run it. Just don’t enter anything that you don’t want other people to know. Act like you’re saying it out loud at a public bus stop to a random person.","Insecure has me thinking of a website that's really shy","Happy to report no errors here as well"],"points":49},{"text":["lenevo laptop nvidia display adaptor driver bsod/freeze","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","HiDid you try downloading the driver from the Nvidia site?"],"points":0},{"text":["How can I find out why Windows is crashing all the time?","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","WhoCrashed and BlueScreenView true help to BSOD analysis"],"points":0},{"text":["Please help me with this monitor problem","Check your cable connections, restart your PC, and adjust display settings to detect the new monitor. If it still doesn't work, update graphics drivers or try a different video output port. If the problem persists, just contact the person you bought it from.","HiTell us more about your system (specs)?Let's say you are connecting to the monitor using hdmi and your motherboard has a hdmi out, but your graphic card has one too, you might just be using the wrong port."],"points":0},{"text":["I want to update to W11 while losing all my data","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Just do a clean reinstall with a usb."],"points":1},{"text":["My friend laptop couldn't finded drivers","HiAs there are no downloads on their website, I suggest contacting them directly.It's likely to be hardware specific to that brand so it will be unlikely you will find drivers for it anywhere else.https://www.entityuk.co.uk/contact"],"points":0},{"text":["Trying to fix redgifs on my laptop","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Brother installed malicious software to my old PC","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","The debugs and alerts on your modem are concerning. It's possible that the malware attempted to access or compromise your network. A potential option would be to reset your modem to factory settings and then set it up again with a strong, new password. Additionally, update the modem's firmware to the latest version, if available, to patch any known vulnerabilities.I suppose going forward is more of a retrospective learning experience. It goes without saying that MFA is a must, aside from that. Education toward understanding not to download files from dodgy sites and to be weary of phishing attempts.Did good though post-incident wise."],"points":3},{"text":["Laptop screens loses color calibration & keeps turning greyish","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["I'm on Edge, and this is a new problem I've just noticed. When watching YT there will be checkerboard yellow squares flickering every few seconds and idk why. No issues on other tabs or anything. I'm on a 3070 laptop with intel and nvidia drivers","HiSee if turning off hardware acceleration helps:https://www.tenforums.com/tutorials/149042-enable-disable-hardware-acceleration-microsoft-edge-chromium.htmlIf not, see if the problem persists if you use another browser.Also check if any browser add ons might be causing the issue."],"points":0},{"text":["Why does my Dell laptop fails to boot several times?"],"points":0},{"text":["Phone says 5g but no connection without wifi","HiCould be something wrong with the phone.Did you try in different locations? Are you on your telecom provider's network or are you roaming?I suggest contacting the provider, they might be able to help you better."],"points":0},{"text":["HELP I have 2 drives on my pc, I want to install a new OS on one drive but I want to be able to access the things on the other drive","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","when you are doing the install and it asks where to install the os you select the c drive. Job done"],"points":0},{"text":["Weird bottleneck/something wrong with gpu and cpu...","HiIt's likely that your games are still using your cpu's internal GPU, read this, it should help:https://www.digitalcitizen.life/set-default-gpu-windows-11/"],"points":0},{"text":["Maximus viii Hero rebooting during bios update","Hi try resetting the bios using the jumper, manual page 1-23:https://dlcdnets.asus.com/pub/ASUS/mb/LGA1151/MAXIMUS_VIII_HERO/E10343_MAXIMUS_VIII_HERO_UM_WEB.pdf?model=MAXIMUS%20VIII%20HERO(if the link doesn't work, copy it and paste it in your browser)"],"points":0},{"text":["Is the chip revealed in this video where thermal paste might be replaced?","TLDR - Unless you are prepared to have a ruined laptop, I wouldn't recommend this. - And I would say this applies to ALL self-contained hardware. If you need it, and can't afford replacing it, just take it into a laptop repair shop.In brief, years ago I replaced the thermal paste on my PS4. I took the risk of breaking it completely. - Fortunately I did my job well and it never made a jet engine noise again, but still, it was a risk I took being inexperienced in that kind of work. I only did it because I felt I had to, and more so, that I could live with buying another if I broke it."],"points":0},{"text":["how do i deal with moisture screwing up my electronics/computer equip?","A few options:There are indeed simple moisture absorbers, brand doesn't really matter, most of the time you buy the first in a special plastic container and after that you buy refills. Just go for the cheapest, they almost always use the same stuff.There are electric options available, but they are quite costly, also in use.Improve insulation in your house, fill cracks, open windows for at least 15 minutes a day to let some fresh air in, use more heating. Maybe cover electronics when they are not in use (when they have cooled down)","My nod would be a dehumidifier in that room because absorbents wear out fast."],"points":1},{"text":["Email storage default","HiIt could be related to how you set the program up;If you selected \"pop\" for your email, the email is probably all being downloaded to the device and becomes part of the backup process.If you set it to \"IMAP\" the email stays on the server and you just access it there."],"points":0},{"text":["Acer Aspire 7 - Bluetooth Missing (Device Manager and Toggle switch)","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","HiNo unknown devices in Device Manager either, often displayed with an exclamation mark?If the bluetooth is on the motherboard, you could check if there is a bios option that enables / disables it.If all else fails and it's likely the bluetooth hardware has failed, keep in mind that you can simply buy a new bluetooth device for only a few bucks on sites like Amazon.Just choose one with a lot of good reviews and a price that fits how much you want to spend."],"points":0},{"text":["help with upgrading gpu","There is a small plastic tab which is on the right parallel to the GPU socket. Make sure that's in the 'release' position before removing the graphics card (it usually requires a small - and awkward in a lot of cases - slide/push to the right).There is also likely 1-2 screws holding the GPU in place to the rear I/O panel. Nothing big.One that's done though (no more than 2 minutes work), yep, remove the gpu, push the new one in until you hear that clasp you slid earlier click, re-insert the screws to the I/O panel, hook up the power connectors (as needed) and away you go."],"points":0},{"text":["Issues after upgrading GPU","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","HiDid you check the bios gpu settings?Is it set to the correct GEN and lanes? Like GEN 3 or 4 and 16x"],"points":0},{"text":["Monitor Turns off when many game objects load and randomly, But Pc Is Still On","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","HiCheck if your games aren't accidentally using the cpu's internal GPURead this, it might help:https://www.digitalcitizen.life/set-default-gpu-windows-11/(if the link doesn't work, copy it and paste it in your browser)"],"points":0},{"text":["Computer acts kind of like sticky keys is on when I use it, even though it isn't","HiWhat are your system specs?"],"points":0},{"text":["Any idea what these are?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Pls help Mouse keeps shaking on its own","Hi, make sure the sensor is clean, sometimes dust or hairs get in front of it and make it act erratic."],"points":0},{"text":["Huge keyboard latency spikes and other USB troubles.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","HiThe usb drivers should be part of the motherboard's chipset drivers, so install those.Also make sure you are on the latest bios, it might improve stability. (read up on it if you haven't done that before)"],"points":0},{"text":["The trackpad on my Laptop is becoming non-responsive","HiThis should be the driver:https://ftp.hp.com/pub/softpaq/sp105501-106000/sp105790.exe(if the link doesn't work, copy the link as text and paste it in your browser)See if it works / helps."],"points":0},{"text":["Tv flicker when white","HiCould you be more specific?What hardware are we talking about?"],"points":0},{"text":["Windows Reset Is No Longer An Option After Using Macrium 'Fix Boot'","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Not sure why it disappeared, but I suspect that Macrium may have nuked the recovery partition.  If you just want to reinstall windows, you can use the media creation tool to make a bootable USB drive and reinstall Windows from there.https://support.microsoft.com/en-us/windows/create-installation-media-for-windows-99a58364-8c02-206f-aa6f-40c3b507420d","Lmao maybe pay the 65$ instead of being a cheap bastard and this wouldn’t even be a problem"],"points":0},{"text":["Why do I need to change Network Address every time I start my computer?","HiI would start by setting all settings on both pc's back to default, no more mac spoofing (I talked to Mac, he doesn't like to be spoofed ;-)Also do a network reset on both:https://www.lifewire.com/reset-network-settings-in-windows-11-5194111Start by doing a power cycle of your router/modem, just power it off (take out the lead) and wait a few minutes.Start it back up and give it time to reconnect to your ISP, could take a while, usually 10-15 minutes.See if the problem is solved.If not, try resetting the router back to factory default (see the manual for a how to), remember that the WiFi password will likely be reset to default as well.You might need to wait for it to reconnect to the ISP again.If that fails as well, contact your ISP."],"points":0},{"text":["[Windows 11] [Bootleg Airpods Pro - Wireless Bluetooth Earphones] How do I completely disable the buttons of the Airpods?","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","HiSee if this helps:https://www.reddit.com/r/techsupport/comments/rf4rkr/bluetooth_headset_sends_auto_playpause_commands/(if the link doesn't work, copy it as text and paste in your browser)"],"points":0},{"text":["Can someone help with interpreting S.M.A.R.T. values on my hard drive?"],"points":0},{"text":["Personal Desktop Computer Deadlocks at Random, Uncertain Cause","If you suspect your computer might be running low on memory, please see \"How to know if you need more RAM\".Please ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Please note I'm going to sleep immediately after posting this so replies and follow-ups will have to wait til I'm back from class."],"points":0},{"text":["Windows 11 restart loop. Cannot uninstall in safe mode.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Cablet HDD Transfer Case disconnecting and reconnecting periodically"],"points":0},{"text":["Weird message/ad in Facebook Messenger.","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Visual glitching? on my RX6700xt","HiWhat are your system specs?Have you checked gpu and cpu temperatures?"],"points":0},{"text":["Ways to clear out iCloud space on iPhone and iPad","Amazon photos unlimited storage free with Prime."],"points":0},{"text":["Games dont run as supposed to unless on high priority","Have you tried process lasso?Also what processor?","More about Lasso at https://chefkochblog.wordpress.com/2018/02/27/does-changing-process-priority-have-any-effect-on-game-or-application-performance/But this is rarely called for. Tell more about the PC as well about Norton, McAfee, the 4GB RAM, HDD system this is."],"points":0},{"text":["PC randomly won’t POST"],"points":0},{"text":["Wifi is not connecting.","Open https://github.com/status in your browser, then open Terminal, paste the following command curl https://github.com/status and paste the output (use your mouse to select the output and they're ready to be pasted) in the comment. If it errors out, also paste the output of curl --doh-url https://dns.google/dns-query https://github.com/status, nslookup github.com and nslookup github.com 8.8.8.8"],"points":1},{"text":["Help with Hard drive issues","HiStart by checking the cables going to all your internal drives, make sure all cables (sata, power) are securely connected on all sides (drives, motherboard, psu if applicable)It might be as simple as a loose or damaged cable, but if that isn't it, the drive might be beginning to fail.If you can get access to it at some point I suggest immediatly making a backup of important files, better safe than sorry."],"points":1},{"text":["Help! I cant watch pornhub!","Wtf","LOL sounds like a problem with their site. Same on a different browser? If so then the hub might need to fix this on their side.","I just imagine a 60 year old guy typing this out on the library computer.","That's the only issue I hope no one will ever try to solve.","bonk","Eww..","Logout Clear your cookies If it doesnt help, use bookmarks","Depending on what browser you use you want to click desktop site or something along those lines, then you'll be able to see all your stuff, it's a glitch on pornhubs end.","I think it's a glitch with PH. I'm having the same issue too","Check whether you're really logged in or try a different browser"],"points":46},{"text":["my nintendo switch controller is not letting me walk forward properly in any game","HiI don't know how old the controller is, but it might just be failing.If you can, check with another controller (maybe from a friend).If the issue doesn't exist with his/her joystick your joystick is likely to be faulty and needs to be repaired or replaced. Depending on it's age you might still be under warranty."],"points":1},{"text":["DS4 controller charging issue","The only thing I could find is that a charger shouldn't exceed 5v and it should have a minimal output of 800ma"],"points":0},{"text":["Acer Aspire 3 ridiculous lagging","HiMake sure your games are using the mx350 and not the Intel one build into your cpuhttps://www.digitalcitizen.life/set-default-gpu-windows-11/(if the link doesn't work, copy it as text and paste into browser)"],"points":0},{"text":["Upgrade laptop ssd and keep operating system licence","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","If it comes with Windows, the license is tied to the motherboard, switching SSD will still keep the license."],"points":1},{"text":["USB Ports Issues/Not Detected","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","HiIt sounds like the microphone is causing some sort of glitch in the port, probably during the insertion of the plug.I don't know is it's fixable.You could have a look and see if there is a bios update available that addresses this issue (might be a known issue) or increases stability.Also keep the motherboard's chipset drivers up to date, they should also include drivers for the usb ports.If the microphone is the cause there's likely not much else to do then buy a new one.(although you could try just leaving it in a port instead of continuous swapping, if you don't have enough ports, buy a usb hub or something similar)"],"points":0},{"text":["Laptop says it’s on, yet the screen is still black","Either Backlight might be set too low or the screen is broken.Hook up laptop to another display, then try this in powershell if the issue is that the backlight is somehow set too low in software.C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe (Get-WmiObject -Namespace root/WMI -Class WmiMonitorBrightnessMethods).WmiSetBrightness(1,91)"],"points":0},{"text":["tplink Deco XE75 pro the wifi speed is not stable"],"points":0},{"text":["Having stuttering issues in non fullscreen games"],"points":0},{"text":["Why my GPU is low usage on video editing?"],"points":0},{"text":["Error Event 41, that old chestnut"],"points":0},{"text":["Seagate disk drive","Yes.","Pluck the drive out and try a different enclosure… cheap fix if you’re lucky"],"points":0},{"text":["Need help on retrieving deleted files in the private folder.","Unless there's some real major security flaw they haven't fixed, they should be gone forever."],"points":1},{"text":["How to send ASIO audio to channels other than default 1&2?","Select different channels in whatever application you're using"],"points":0},{"text":["Cannot find chromebook model number","It’s pretty straightforward, go to the diagnostics window, see the code name, and match it to the dev page.Here is an easy walkthrough :)https://kb.plugable.com/general-support-articles/how-to-identify-your-chromebook-model-and-chromeos-version"],"points":0},{"text":["Walking Treadmill Causing EMI - Solutions?"],"points":0},{"text":["My VG27WQ1B Asus monitor is running at 3840x2160@60, but actually how?","According to the manual this monitor supports [4K@60Hz](mailto:4K@60Hz) (over HDMI 2.0, it doesn't over DP). Of course if will look really bad if you set it to that resolution because it will be down scaled to the physical screen's 1440P.Why a PS5 says stuff, who knows. One thing is for sure, it isn't running 4K @ 144Hz, the electronics in the monitor cannot handle that (by a long shot). The PS5 may be running in 4K @ 60 Hz."],"points":1},{"text":["Received text from a friend with a pretty bad insult. However, phone records (T-Mobile) indicate no texts received at that date/time.","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Do you have an iPhone? Does your friend have an iPhone? if it’s iMessage on both ends it wouldn’t show up to T-Mobile as SMS","I just found this link on T-Mobile community forums: https://community.t-mobile.com/accounts-services-4/records-missing-from-text-usage-report-48934Looks like a possibility that T-Mobile might not capture all texts in their logging maybe?","Providers overseas log every text that comes in and goes out??"],"points":5},{"text":["Why is my USB transfer speed so much slower than advertised?","These drives have a small write buffer that allows 70 MB/s write for small transfers. Once it fills up the drive's native performance becomes visible until it has had time to flush the buffer. It should be able to read decently fast, 70 MB/s. If it seemed to read it back at 800 MB/s then that was because it was still cached in RAM.","USB 3.0 devices usually advertise the \"10X\" based on 3.0 vs 2.0 theoretical protocol speed. The actual writing speed relies more on the storage cells which for cheap flash memory cells haven't even passed the old 2.0 speed. That writing speed is to be expected, the initial surge is either from your PC caching write operation or the drive itself has a built-in write buffer (it's faster to buffer write operations and do them in one go, which also improves the cell's longevity). And yes, read operations tend to be faster, because it's just a measurement process, unlike write operations where they need to change the cell state.","Writing to them is usually much slower than reading from them. Their \"10x\" or whatever are usually marketing gimmicks and always marked with a * to mess with you.","Honestly I would like to know this too.I have a 1TB crucial brand SSD and a 1TB WD easystore SSD, both bought in the last year, and both with virtually the same little square form-factor. The crucial uses a usb-c connector while the WD uses the older USB 3.0 connector. Yet the WD is over 10x faster than the crucial (311MB/sec vs. 28-30MB/sec). I have no idea -- they were similarly priced with the same advertised speeds...","Another thing in addition to what others have mentioned is when comparing to downloading something from the internet you have to be careful what number you are looking at. If you are looking in task manager for example, you need to divide the number by 8 to compare as internet speeds are often using megabits, or Mb, and usb speeds are usually megabytes, or MB."],"points":3},{"text":["Does resetting delete user data or local data?","It will only erase the laptop."],"points":0},{"text":["Fucked up my ram trying to add new ram stick","Reset cmos battery on your motherboard"],"points":0},{"text":["what is this event log and do i need to fix it ?","Ignore it.  There are always errors in the event log.  Computers are noisy behind the scenes.  Sometimes things just fail intermittently and the computer just tries again.  If you aren't experiencing other issues, then this probably isn't an actual problem."],"points":0},{"text":["Internet having major issues.","Yes, you should switch. Find a fiber provider with symmetric internet and go with them. Xfinity boasts the high speed but doesn’t tell you that their download is good but at the expense of upload. They are trash. Switch and enjoy real high-speed internet.","Are you on Ethernet or wifi?"],"points":0},{"text":["Help My files","Can you restore to a time before this occured?","Did you have your files synced to a OneDrive/GoogleDrive/etc and the account needs to be reconnected?"],"points":0},{"text":["HP Laptop Disk Error","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["I'm planning to change my HDD to SSD","Here’s an upgrade vid for your model laptop: https://youtu.be/RoIQqTFFL-M?feature=sharedIncludes teardown and options. The Kingston m.2 SSD will work fine, but there are better/faster options out there.To use the 2nd m.2 slot, you will need to remove the current 2.5” HDD since it sits underneath.You can buy a usb external enclosure and pop that old 2.5” drive in if you want to continue using it.","We're not supposed to review products here, but a couple of the answers here are very badly mistaken. The Kingston NV2 is an utter garbage drive.This review explains it all.We've seen many of these drives misbehave on here or just outright break. They suck really bad. They will cause your machine to stutter, or they'll just break really soon, etc. Of course not everyone will have the worst experience with one (this is also explained in the review I linked above, these drives aren't all the same), but you are definitely risking a very bad experience with one of these.Again, do not get one of these, you will likely regret it.","It's decent, as long as there's a warranty, go for it.","Kingston is fine...Though if you have a 1TB HDD (I'm assuming this is mechanical storage), that means (according to the Asus datasheet for your laptop) you only have one M.2 slot (which looks like it's taken by the 512gb SSD). The current 1TB HDD uses the sata interface to connect to your laptop's motherboard...To use a second M.2 drive, you'll need to buy an adapter (ie sata to M.2). Search Amazon/ebay or equivalent to buy one..."],"points":4},{"text":["IRQL_NOT_LESS_OR_EQUAL and DPC Watchdog errors only when using Adobe Premeire Pro","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Regarding the black screen issue, I'd check to see if there is a VBIOS update available for your GPU from the manufacturer. I'd also contact NZXT to see if there is a motherboard BIOS update that is newer than version P1.30 - timestamp 04/15/2021.As far as the crashes, both happened on the same physical core and they happened while the core was idle. If that pattern holds it could mean you have a faulty CPU core. Two isn't enough to make me confident that's the problem so please do make any new dump files available for comparison if the crashes continue.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":1},{"text":["HELP Trying to upgrade my Nvidia card - barely know about PC building"],"points":0},{"text":["Help changing power settings on Windows Camera program!"],"points":0},{"text":["Screen share audio not working"],"points":0},{"text":["S.M.A.R.T Status Bad, Backup and Replace","Sounds like your drive is dying/dead. Try booting up a windows install disk / linux live usb / move the drive to another computer to see if you can read anything."],"points":0},{"text":["Internet connection spikes since a few days ago."],"points":0},{"text":["Peripherals flash on then shut off on boot-up"],"points":0},{"text":["Black screen in games Rx 5700 XT","Using msi afterburner and lowering -15 voltage, apparently it's already solved. Anyway I have a pylon 750w, msi b760 tomahawk wifi ddr4, i5 14400f, rx 5700 xt soyo."],"points":0},{"text":["Video files on Chromebook not playing properly","A specific video file, or all videos? Can you still stream from YouTube or other sites?","Maybe ask this on /r/chromeos."],"points":0},{"text":["I keep getting an error that crashes my game. I need help to fix it. :(","If you suspect your computer might be running low on memory, please see \"How to know if you need more RAM\".Please ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Reddit is very laggy on my PC browser (using Firefox) ever since the new look was introduced a few days ago.","I have seen absolutely no performance differences with old.reddit.com - it’s still snappy and responsive AF."],"points":0},{"text":["Cannot connect to local file server on iPhone SE(2020)","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Installed new operating system, now constantly getting shutdowns.","If there's anything I need to do or anything I need to run to get yall the info you need to help, please tell me!"],"points":0},{"text":["Is it worth repairing? Drink spill + smoke","From experience it is very hard to determine what was damaged. In parts alone it cost me $400 on a old hp laptop, and that was before the pandemic so parts may be even more expensive","It’s probably cooked brother. More trouble than it’s worth, at least for me. I’d salvage the drives (if possible) and move to a new device","If it smoked it’s dead . To be sure you can measure the voltage with a multimeter on the laptop power output . Fried motherboards normally are not worth the replacement unless you find a used one for cheap . If you tech savvy there’s actually some stuff you can still save like storage , WiFi card , possibly RAM , cooler fan and dissipation hardware, screen etc… You can use those components to repair a future laptop ( that’s what I do ) alternatively you can sell you laptop as defect and get some money for the next one"],"points":1},{"text":["Muffled headphones audio"],"points":0},{"text":["WiFi-Direct to HDMI? (TV)","So what phone and what TV?My only other option is to buy a Chromecast which I'd really rather not do.Why not?"],"points":0},{"text":["Random Keyboard Lockout","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["My PC keeps soft crashing while gamming"],"points":0},{"text":["I messed up, someone plz help.","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Yeah, I'd destroy your current hard drive / SSD and reinstall Windows on a fresh one, I wouldn't trust using the Windows in built refresh if you've booted from a USB","Wtf, DO NOT install software through a boot loader, really scammy","First, that really wasn't a smart idea install software in that manner, especially since you clearly have no idea the implications of running said software.Second, although uncommon, you can have malware that infects the firmware of a device, like BIOS or UEFI. It can persist through a factory reset. Firmware is the low-level code that initializes hardware before the operating system starts, and it's not typically affected by a factory reset.While the chances of your machine being affected in this way is slim. There's always a possibility.Lessons should be learned. Don't download sketchy programs from untrusted sources. Also, if the game you were attempting to cheating on was an online game against others. Don't. Nobody likes cheaters.","I say securely erase the drive using dban, as well as reset BIOS to default. Once you load into windows I suggest run a scan with malwarebytes antimalware","JFC. I would never reccommend downloading some dodgy software off a suspect site offering cheating servicesand installing it - never mind installing it via the bootloader. A monumentally stupid act.Who knows what was installed. I hope it wasn't an expensive pc or laptop.","Re-install windows and format the hard drive or just get a new ssd instead. Also, hope you learned your lesson no to fckng cheat, there's nothing more annoying than cheaters , specially in competitive games like Apex."],"points":15},{"text":["Computer overhaul, now can't boot into Windows","If you mean you're trying to boot the old installation from that GA-78LMT based machine, then you need CSM. Since that doesn't work, I guess you could try booting a Windows installation medium, opening a command prompt with Shift+F10 and running the command \"mbr2gpt /convert\". This will convert the drive to UEFI booting, but isn't completely risk free, there's a very small chance you'll lose the contents of the drive. I've used this tool many times though and it has never happened to me.Moving a drive to a different system isn't officially supported and may not work. You'll have to see how things go, but you may have to reinstall anyway.The reason you can't install Windows on the drive is closely related to why this doesn't work, the drive is configured for legacy booting with an MBR. The Windows setup is booted in UEFI mode and Windows knows you can't boot from an MBR drive (without CSM enabled)."],"points":0},{"text":["Windows Defender doesnt works","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Can you describe what happened with the \"hack\"?This just seems like an organisation has taken over management. Do you use this for work at all? Signed into a work or school email?This can happen if you sign into an office 365 app or other application using your work or school email and don't tick \"manage this app only\" when it tells you they will control any policies","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":1},{"text":["SSD no longer showing up after Ethernet cable stopped working","These two factors--ethernet and SSD--should not be related, unless your motherboard is failing in a strange way.​Is all of your other i/o still working? Getting the new cable enabled wired internet access again, right?​Could this be an SSD failure due to age/wear?"],"points":0},{"text":["PC crashing, IRQL_NOT_LESS_OR_EQUAL (a)"],"points":0},{"text":["Any reason this wouldn't work? 6 monitors to a laptop using eGPU."],"points":0},{"text":["PS4 not turning on"],"points":0},{"text":["pc suddenly not turning on anymore","https://imgur.com/a/3FDKxV5","The PC or the display won't turn on?Sounds like it was the display. The first step would be to use some common sense and try a different display and hdmi cable so you can eliminate whether the issue is your PC."],"points":0},{"text":["Help with the YouTube black and white screen situation"],"points":0},{"text":["Extending WiFi and Ethernet in my new house","MoCa adapters, and I've heard that some of the Xfinity routers actually have a built in MoCA adapter, so you'll just need the one for your room."],"points":0},{"text":["Letasoft sound booster muted my PC"],"points":0},{"text":["LG Smart TV sound issues"],"points":0},{"text":["Windows 10 stuck at boot screen only when restarted"],"points":0},{"text":["Self Built PC can connect to other WIFI but not my home WIFI even though My WIFI works on other devices.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","First ensure updates are done, esp. .net ones. If not resolved, Disconnect a few other devices to see if your isp has a limit on number of devices or if your dhcp range is too small. Next Try “network reset” on you pc. Still not good, Go to “ manage known networks” and remove all wifi SSIDs you no longer use as well as your home wifi then connect again and retype the password."],"points":0},{"text":["Old laptop fan only works in the bios, stops working when entering the OS"],"points":0},{"text":["Is someone having this ssd problem? how did u solve it?","Do a search \"toshiba ssd read only\" and you'll see quite a few hits, many on Macs. There's also this discussion on an earlier Reddit post saying it's dying and read only is so you have a chance to save your data off before it dies completely."],"points":0},{"text":["Can’t navigate to turn tv brightness down?"],"points":0},{"text":["Unable to delete McAfee PC Optimizer","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Go to Safe Mode, there u uninstall the bastard"],"points":0},{"text":["What would cause this to happen to a blue screen error","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","You have the first motherboard BIOS (version F3) according to the latest dump files. There have been many updates since if this is the correct product support page that improve stability/compatibility/performance. How long has this been a problem?"],"points":0},{"text":["SHARED CONNECTION AND DNS SETTING","If you are having issues with port forwarding checkout this wiki article.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Can you explain why you don't connect the PS5 directly to the router? Depending on how you share the connection, the router may/may not handle the PS5 DHCP at all, and for port forwarding, you'd have to setup your router and PC to forward the port to the PS5. The DNS setting is almost nonissue here, it shouldn't even matter unless your ISP is blocking services, if that's the case then just set it on the PS5."],"points":0},{"text":["Red with Yellow Flashing Light on LAN - ASRock B560M-C"],"points":0},{"text":["issues with new 4070 ti super"],"points":0},{"text":["Problem with my CPU (HELP!)","If it’s tripping the thermal sensor and throttling, you need to figure out what’s causing it to overheat. 90 C is much above what is normal.If you haven’t opened use the case and cleaned out all the dust with a can of compressed air, thats where you should start. Cooling fans and vents could be gunked up or even broken."],"points":0},{"text":["Os is gone","Alright, so first things first, did you make the MS ISO bootable?  Only reason I ask is because you need make the USB bootable first and then attempt to boot from it, as opposed to just attempting to boot from a USB with a raw ISO image on it.  If not, I can walk you through it real quick.","Download the Media Creation Tool. It'll in turn download the OS, format a USB as bootable and copy the setup files to it. All you have to do after that is boot from that USB. If you have Win 11 it has it's own tool, I linked to the one for 10."],"points":3},{"text":["Windows 11 Application Internet Problems","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Cat Piss Ruined PC?","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Your motherboard is dying. It has the most surface area to catch all the cat pee and interacts with all components. It is only going to get worse.You could salvage the ram and SSD. I would replace the motherboard. Put the SSD and ram into the new board."],"points":2},{"text":["Help me please! I've deleted a lot of my photos and videos accidentally and i want them back!","You have a microSDXC slot on that phone. If you were saving them there there's a possibility. Pull the card, mount it on a PC with an adapter and run Photorec.If they weren't saved there or in the cloud somewhere you're out of luck. Google automatically backs up photos to your google account but I'm not sure about if they were taken within Instagram if they'd be backed up.you can restore deleted archives in pc because they are technically not gone until you write something over itThat applies to HDDs, mechanical hard drives. With SSDs and other memory based drives, like what's in your phone, that's not the case. They work completely differently."],"points":0},{"text":["Why isnt it working","You are going to need to provide a little more information for anyone to hope to assist you. When you try and type in the website name in your browser search bar on your browser what does the page say? SNIP/ screenshot might help."],"points":0},{"text":["A piece of plastic fell out of my laptops charger hole"],"points":0},{"text":["Need to get files/photos from an old 2.5 SATA HDD from old pc","No idea why that's happening but I'd suggest a Linux boot disk, see if it'll see it and give you access. Beyond that I'd make a bit for bit backup of the entire drive before trying some recovery software like Testdisk."],"points":0},{"text":["BIOS error code 99 help"],"points":0},{"text":["When I look up my IP address on Google it gives me a different result from my actual IP address. What could be the reason?","You have two IP addresses usually. Your internal bogon IP (LAN only, non-routable over the internet) and your ISP's WAN IP, usually either IPv4 or IPv4 and an IPv6 address.If you have an IP on your workstation that starts with 10.x.x.x or 172.16.x.x or 192.168.x.x those are bogon and are for your internal use only. If you are seeing something being returned by Google that's different, it's most likely the public facing WAN address on your internet gateway. Google has no idea what your internal IP address is as your gateway performs something called Network Address Translation (NAT) to share your public IP with all the devices on your internal LAN.You can get more information about your public WAN IP at www.ipinfo.io. You can use your operating systems internal tools to determine your bogon IP. On windows, that would be to open a terminal and type ipconfig.I hope that answers your question!","Are you confusing your internal private IP address to your ISP provided IP?","LAN (Local Area Network) = the IP inside your home RouterWAN (Wide Area Network) = the IP on the Internet side (external side) of your Router.","Google will give the public IP. What are you comparing this against?","CGNAT just means you are under an additional 'layer' of LANIn your home network the Private IP is 192.168.x.x and the 'public' IP is the 10.x.x.x address. One layer above that, the CGNAT LANs Private IP is the 10.x.x.x address and the public IP is the 80.x.x.x addressThink of your ISPs network as a giant LAN that your home LAN sits inside of. This exists to save on real public IP addresses as that 80.x.x.x address is being shared with many fellow customers of your ISP.","Do you know if your behind a CGNAT? ISPs will usually do that to customers to save on IP4 addresses.","defrent enternets, let them express themselves ffs, don't be a nazi, exept defrenc","If your IP starts with 10. Or 192.168. that's your LAN address and this is for the devices in your home network. if what google is showing you is anything else, that's your public IP that your ISP gives you and the rest of the internet uses","Your IP on Google is going to be your cable modem IP. That's the address your ISP gives you. Your local IP is your own private LAN and the internet can't see it.","With everything else said by others, you have two separate issues for self-hosting: 1) WAN vs. LAN, and 2) Static vs. Non-Static.Unless you are a sole device connected directly cabled to your modem, you are behind a router; and, this is all a router issue about which you must then be sufficiently knowledgeable. Also, if your ISP does employ CGNAT, there can then be immensely more problems vis-à-vis your own port-forwarding (NAT within your own router).To be reliably found by others outside of your premises, you need a Static IP Address. Otherwise, your address will be constantly changing from time-to-time. (BOGON addresses are totally unreliable, often blocked, and technically highly illegal.) Or, you need to be going through an additional service that keeps track of your always then current address (like, say, just for simple conceptual reference, GoToMyPC; there are many others)."],"points":31},{"text":["PC turns off when i get out of my chair"],"points":0},{"text":["Make Google drive content available for people whose organizations restrict it."],"points":0},{"text":["Windows key isn’t working | Windows 11","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Is there a way to upload APFS files to a website using a Windows computer?","Windows would need an APFS reader software of some kind:https://www.reddit.com/r/MacOS/comments/p09jid/whats_the_best_free_program_to_read_apfs_on/https://appleinsider.com/inside/macos/tips/how-to-access-apple-formatted-apfs-hfs-drives-on-windowshttps://macdrive.com appears to have a 5-day full function free trial"],"points":0},{"text":["Is there a way to add saved browser logins for all IP prefixes? Details inside"],"points":0},{"text":["Dash cam. memory card question.","back up the photos before using it in the dashcam. it may or may not write ove the photos HOWEVER with it writing over itself over and over and enviroment of being in the vehicle the card will go bad.so far i had 2 cards go bad in dashcam.","Dash cam only overwrites the video files which are generated by it.However, if you format microSD card via dash cam, it will delete all files in microSD card.In addition, if there are other irrelevant files in microSD card, it could possibly cause \"card error\" when the dash cam is recording."],"points":0},{"text":["Samsung Galaxy Book Function Lock Problem"],"points":0},{"text":["Computer shutting off"],"points":0},{"text":["How to downclock my CPU to fix instability?","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Computer basically unusable for anything but web browsing","thoughts.. mining crypto on it? for someone else?.. running on the onboard instead of the gpu card?.. latest drivers?.. manufacturer drivers?.. event logs?.. hardware test?..","Repaste the heatsinks on cpu and gpu. Re-pad the vram and any heatsinked vrm's","Open a command prompt with admin access, then run this command:DISM /Online /Cleanup-Image /RestoreHealthafter it finishes, assuming no errors, run this command:SFC /scannowThis should solve the problem if the problem is with the Windows install itself.","You can run Fortnite on lower end pcs, something doesn't sound right but there's not enough info here to tell","Reinstall Windows to see if it is a software issue. If that doesn't work you have a hardware issue related to heat and throttling of your CPU and/or GPU.","Start with the basics, i.e. how does it do with normal usage... Go into task manager (ctrl+shift+esc). If any of your primary resource allocation (cpu, memory, SSD, HDD) is above, say 20-25% on idle, then there is a problem there. Go to your processes tab and see what app is eating resources. If the system runs perfectly fine with no funny business during normal usage, then you've localized the problem to the gpu. I assume you've uninstalled and reinstalled the gpu drivers? Downloaded all of your windows updates? Thought about any changes that you might have made just before it started acting screwy? Are the games installed on your SSD or HDD? Have you let task manager run in the background while gaming so that you can look at the resource graphs in real-time?I'm just spitballing here, but those are the first things that I would do to nail down the problem before going nuclear with a clean wipe of the OS...","What psu?","You playing over Wifi?","Download Dell Command Update and run it and update all your device drivers.Download Nvidia Geforce experience and update your gpu drivers.Nvidia control panel, set power management to prefer max performance.Load task manager and check performance when running a game, and make sure that the actual GPU is rendering the game, not your CPU’s onboard.Make sure all displays are plugged in to the GPU.Check the cpu and gpu temps when idle and when running games.Check if your Defender is running a lot when gaming. If it is, learn how to disable unnecessary shit in Defender, disable the real-time scan when gaming, exclude your game folders and stuff.Make sure games are installed on the SSD.If all else fails, contact Dell Support and ask them how you can gather log files to help them help you change your settings.Run the GPU benchmark tests and show us your results.","You need a control. Therefore you need a fresh disk and a fresh OS. Pop your existing one out so you don’t lose anything. Pop a new in. Provision with OS. Do updates and drivers until you can’t. Then run tests. That’s your control. Go from there.","Id try running something to check your thermals. I had a crap cooler one time that wasn't operating right that did what you described. Web browser ok, low spec games ok, but anything that put a real load on the computer it immediately started chugging.If the cooler seems functional on the CPU and GPU maybe just repaste them. Cpu easier to repaste so I'd start there."],"points":15},{"text":["CPU stuck to heatsink","Hold the cpu and twist the cooler clockwise/counter clockwise and it will come right off."],"points":0},{"text":["My final fantasy games won't save. HOURS OF PROGRESS LOST"],"points":0},{"text":["Can I download games on USB flash drives?","Don't use flash drives.Get a external drive and you're good to go.Best would be to buy a bigger drive or install another one if possible.","It is possible to do what you ask but it isnt worth it, it's slow, cumbersome and very prone to errors. It would also be more expensive to buy multiple flash drives then it would be to buy a 1TB external HDD/SSD.What external drive depends on what USB ports you have available. If you have USB 3 or higher the you can get an external SSD which will be faster or if you only have USB 2 then just get an HDD as USB 2 can't handle SSD speeds.Or the best option overall is to upgrade the drive in the laptop.","The games may not even launch at all because usb flash drives are extremely slow.but it all depends what brand you get and the advertised speeds"],"points":4},{"text":["Separating In-Game Audio and Desktop (discord and spotify) audio"],"points":0},{"text":["Internet goes down whenever a game is launched"],"points":0},{"text":["My win 11 doesn't have audio after secure boot enabled!!!","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Email folders disappeared after windows updates"],"points":0},{"text":["Phone not charging unless in a really specific position","USB port will likely need replacing, fairly simple job, any local repair shop should be able to sort this"],"points":0},{"text":["Mac book pro 2009 encryption","Depends on whether the User choose to turn on FileVault during (or after) initial OS setup."],"points":0},{"text":["Accidently deleted Samsung notes","If they aren't in the recycling bin than they are gone.You cant recover them due to the encryption"],"points":0},{"text":["Network/Driver error in Asus TUF Laptop"],"points":0},{"text":["Some music on Apple Music is sounding off… please help"],"points":0},{"text":["My 3090 just died, maybe bricked? help"],"points":0},{"text":["Asus Nitro 5"],"points":0},{"text":["how do I \"trick\" my pc into thinking I have a wired connection/internet","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","What fighting game is this? Who's enforcing this rule?There would be a reason for it to be enforced so you're just putting yourself at a disadvantage","You're going to sneakily enter a fighting game tournament on wifi when they want stable consistent connections? Why? This is pretty poor sportsmanship on your part, creating an inconsistent experience for your opponent is not something you should be doing in a tournament setting.","you could create a virtual switch that is bridged to your wireless network adapter. I couldn't tell you how to do that off the top of my head but it might be a good place to start googling.","Haven't tried it but look up the wiring on a RJ-45 then loop the transmit pair back to the receive pair. I should remember those but do not want to steer you wrong. I have used this type of loop back 100s of times just not on that plug.","Sounds like you're cheating, but loopback or the use of any VPN will make Windows treat the connection as an Ethernet rather than Wifi connection in my experience.","Loopback","Don't listen to these goofballs, it's a fake on screen pixel competition, not the Olympics."],"points":28},{"text":["Arzopa Portable Monitor"],"points":0},{"text":["Gpu not connected gaming laptop","Have you updated drivers?Try all the drivers from the manufacturer. If that doesn't install GeForce, install the drivers from the Nvidia site.But you should definitely use the manufacturer ones first since you're probably missing chipset and other drivers if you haven't updated any."],"points":0},{"text":["PC only using 20% of gpu and cpu while playing games???","You're likely CPU constrained and don't realize it.You can't necessarily look at CPU usage as a whole as many things are still at least somewhat dependent on single-thread performance.Look at your CPU usage per thread, and you'll likely notice 1 or 2 threads maxed out."],"points":0},{"text":["I think I messed up","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Re install windows via a USB stick.The factory reset isn't great after a potential infection.For your boot parts it's impossible to tell without knowing the files and their content."],"points":2},{"text":["Keyboard shortcut for \"Open archive\" 7zip?"],"points":0},{"text":["Malware site on search bars - Help!","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Is this a false positve?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["PC loading issues when using restart"],"points":0},{"text":["Is my motherboard (Asus Maximus VII Hero) compatible with an SSD I'm thinking about purchasing? (Silicon Power 2TB XS70)","Yes, that motherboard supports M.2 drives."],"points":0},{"text":["PC won't turn on"],"points":0},{"text":["Internet issues- I need help!!!"],"points":0},{"text":["Can someone get my phone number from my debit card, and store my card information by means of the terminal?","No. Terminals don't store your card details nor do they record your phone information","In the US don't know about all that. What I do know is the card system can send messages if the card is used. Beyond the standard accepted and declined.Before the ultimate rise of cell phones there was a family emergency while I was doing the regular camping trip with my grandparents with their RV. The only way they got a message to us was with the credit card company pushing a message to call home though the register."],"points":0},{"text":["Newly built pc crashes during gaming (14700KF / RTX 4070)","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Hi Tech support! I come to you at a time of great need!"],"points":0},{"text":["SSD Swap Help"],"points":0},{"text":["Does this just mean I need a new Wi-Fi USB Adapter for my PC?"],"points":0},{"text":["My phone Lock Screen and Home Screen both keep turning black"],"points":0},{"text":["Windows 11 file ownership","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Taking ownership doesn't change the permissions, it only allows you to change the permissions. So take ownership of the root, then change the permissions to give yourself full access to the root and tell it to apply to all children."],"points":0},{"text":["My computer is Capped out at 70fps and I have decent specs. How do I fix this?","which i9? what games are you trying to play? what is the display you are using? are you using HDMI or Display port?","1080p gaming? What game? What setting?You get bottlenecked by your gpu no matter how good your cpu is, games get processed mainly by the gpuAs long as your game can be fully processed by your cpu you get only a certain amount of fps from your cpuEither go down with your in-game settings or overclock your gpu to get somehow 5% moreOr do you have your framerate set at 70? (Monitor setting in the display option in windows/your gpu control panel","Are u using a high refresh rate monitor?Have you changed the refresh rate on the monitor itself?Have u changed the refresh rate in windows advanced display settings?Did u cap ur fps in nvidia control panel?Which games?Which settings are you using?"],"points":2},{"text":["How do I access all the files on my android phone when plugged into my PC?"],"points":0},{"text":["GOD HELP ME ; MISSING FILE PRIVILEGES","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["PC crashed suddenly and won't turn back on"],"points":0},{"text":["Android phone won't hold charge for long","Get a new battery."],"points":0},{"text":["Is this USB stick salvageable?","If your USB stick is recognized in Disk Management but the partition info pane is grayed out, it suggests that the device might have encountered issues with its partition table or file system.You can attempt to repair the corrupted USB stick using the CHKDSK command or DiskPart command. (This guide might be helpful).","95% likely it's corrupted.Can the data be retrieved? Possibly. - Could you do it? Unlikely. - Free and quickly?... Nahh.Thumb sticks are, generally speaking, a terrible place to permanently store important data."],"points":1},{"text":["How do I make this run something (eg. doom, mario, etc)?"],"points":0},{"text":["Second monitor detected but no signal?"],"points":0},{"text":["Having problems oppening apps without a DNS app"],"points":0},{"text":["My GPU ( Radeon RX 6650 XT) driver randomly works and doesn't work, mostly not","What makes you so sure it's a software issue? Given that it's persisted even after a complete reinstall of windows, it sounds a lot like a hardware problem to me.The first things I'd check are that the GPU is properly seated, that the power connectors are securely plugged in on both the GPU and power supply (if it's modular), and that the power supply can provide enough wattage for your card.The PC crashing while it's being used is also suggestive of components not getting enough power.If the GPU is struggling to operate properly, that can manifest as problems with the driver failing to initiatualize or work properly."],"points":0},{"text":["Random black screens and freeze"],"points":0},{"text":["HP Mini 210 2010-SM Charger"],"points":0},{"text":["wierd problem, need help"],"points":0},{"text":["TIFU: Chose a foreign language when during startup of a new laptop. Now it is permanent.","yeah, i hate windows because of this shit. I still see chinese text in my login screens","Lol. You should be able to make a Windows installer USB and reimage it. You will need to reinstall drivers but they should allow you to choose language again."],"points":1},{"text":["[Lenovo Ideapad Z710] how bad is this?"],"points":0},{"text":["help how can i fix my monitor.","Sounds like you have entered screen test mode, just try unplugging it from power and plugging it again"],"points":1},{"text":["Turning off Turbo Boost doesn't result in stable performance. Why ?"],"points":0},{"text":["Wired controller only working when holding home button"],"points":0},{"text":["$1400 laptop sold as gaming pc can barely run games on steam","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Yoga aren’t gaming laptops","If you mean the 14\" Yoga 9i - you've been sold a duff. This normally retails for $1,500 - which is why I think you do mean that one. The Yoga 9i has an inbuilt graphics card - which given it's specs would struggle to run games such as League of Legends. It's focused more towards portable business market - for lightweight activities such as browsing the web and document editing.The 16\" Yoga Pro 9i however, which retails at $2,400, has a dedicated graphics card, and would likely be able to run the games you want to play, however, it's got overheating problems, so would likely only be able to run games for an hour or two max before needing to cool off.Neither the Yoga 9i or Yoga Pro 9i are marketed as or really suitable for gaming.","What are the specs on it?There's a chance it's using the CPUs integrated graphics instead of the dedicated graphics card","If it doesn't have a dedicated GPU or one of the more recent APU then it's just a laptop. The price of a laptop can be very high without it being a gaming laptop, especially with an OLED screen.Is this your laptop?https://www.lenovo.com/us/en/p/laptops/yoga/yoga-2-in-1-series/yoga-9i-gen-8-(14-inch-intel)/len101y0025Lenovo Yoga 9i (not i9) because Intel Iris Xe isn't even their Arc level stuff, so doesn't appear to be a gaming laptop.","That's not a gaming laptop, return it if you can.","The first 5 review sites for that laptop have \"Underwhelming graphics performance\" as a con.Nice bit of research you did before an expensive purchase OP.lol","Return it, if you can.I can't find a single Lenova Yoga that has a dedicated graphics card, only Intel integrated. Intel's marketing says it's great for gaming, which is all most of Best Buy's employees have to go by, but they're not.You can currently get this one or this one on sale, save $200, and have a much better gaming experience.","The yoga is a 2in1, not a gaming laptop. It has an Intel iris gpu. The LOQ is Lenovo's gaming line (GeForce RTX gpu's). I got a midrange LOQ for... much less than that, and it plays everything I throw at it (at 1080p at least)","Return it. For that money you can get an actual gaming PC. Asus TUF, Asus ROG, HP Omen, MSI, Lenovo Legion. Those are good gaming laptops. I have a Asus TUF personally which I bought about 2 years ago I think. I can play helldivers 2 on the highest settings.What is absolutely vital is that it has a dedicated GPU - remember that, it's extremely important. Either Nvidia or AMD. I have an NVidia 3070 RTX. I don't know the AMD models that well. But you can compare them with Nvidia. You need to have at least a 3060 imo. 3060 being towards the lower end, 3070 mid. Keep in mind that this is an older generation. The newest generation of Nvidia are the 4000 series. So the equivalent of 3070 is now 4070. Sort of, the newer one is obviously more powerful, but usually by not that much.I also recommend a minimum of 16gb of ram and a good cpu, so at least an i7. My laptop has the above specs (16 gb ram, i7, 3070) and never had issues running any game in 2 years.If you find something and you're not sure, best to ask here. Someone with more knowledge can help. I'm not an expert either, but I have a general idea. Good luck!Edit: better yet, check this subreddit r/GamingLaptops these guys are pros","A YOGA..? Jesus christ OP, you got done in hard.Yoga's aren't gaming laptops in any way shape or form.. they're simply a business / personal laptop that's light and on the go.I doubt it even has an actual graphics card in it.You should take it right back and complain that a staff member mislead you.","lenovo goya i9 oledI recommend you learn about what makes a computer able to render games before you make another purchase.","The yoga i9 is not marketed as a 'gaming laptop' lenovos own website calls it a 'luxury laptop' whatever that means.It has an rtx 4060 but most of the power from that will just be used for the 3.2k displayEdit: actually if it's the yoga 9i it has Intel graphics so that might be the issue","Return it if you can OP","The price doesn't make a PC good, the hardware does. You need to understand what you're buying and how it stacks up, not just spend a lot of money and hope.","Is your laptop plugged in and is the power mode in the options set to performance mode? When in balanced or power saving mode, performance is heavily throttled to reduce power consumption.","As many people said, return it if possible.The best buy dude didnt knew shit about the computer specs and honestly in his defense he is not probably paid enough to know deeply about it.Being a 1400 laptop its most likely one of those ultra thin, ultra luxury laptops that only come with the igpu, so yeah, return it if possible. I once saw a tiny metal HP laptop going for like 2k with igpu and I was like wtf is HP smoking.Personal opinion: those lenovo yoga are not that good considering the price they usually have. I have an older model (a 910 iirc) with an i7 that a client never came to pick up that its pretty much a super expensive paper weight because the charge board got busted, and the replacement is stupid expensive for what it is (around 180 USD for the part only, and thats in USA, here in Mexico they dont sell it at all). And for what I could gather it was a factory defect since a lot of people had the same issue.","so they are technically correct, it can run games, just not the ones you want to play. you got scammed, lenovo yogas are thin and light, 2 in 1 laptops.they prioritize battery life over performance.I would return the product because you given bad info.","I just bought helldivers 2 and wanted to play it but theirs no way in hell it could possibly run on this thingDon't worry, none of us can play it either.10002038Retrying in 20ERRORSever at CapacityRetrying in 20","Price doesn't matter, check the specs before buying.","lol, yoga never were gaming devicesit is portable versatile multimedia devices which can run some old gamesthis laptop doesn't even have a graphics card, lol","You made a bad purchase op 😭😂😂 go refund it","You scammed yourself. Return it if you can. If you bought it from someone, that person doesnt like you.","This is your fault for not knowing how computers work fyi","Good news is you can connect an eGPU via your thunderbolt port. I use an x380 yoga with a GTX 1080 eGPU and it's quite usable.Bad news is, you have to spend some more to get this setup working for you","Hopefully you've learned that you should never buy a laptop for gaming purposes.","Perform a clean format. Lenovo pre installs a lot of bloatware so something might interfere with your system.","Lol is ok","Run updates","Shouldvd bought a steamdeck or rog asus ally","Probably over heating","You can get a pretty nice used Alienware for that.. it's a risk, but, it doesn't sound like yours was built for gaming. Sorry.Can you get a refund, or exchange?","1: go back to best buy and get your money back.2: Don't buy Lenovo... they're shit, I've used plenty of lenovo products in corporate settings, and they make Dell & HP look like they actually are competent system builders.3: laptops may be capable of gaming, but they're really not the form factor that's best for that use case. You're going to want something that is either a mini ITX tower (very portable, usually even have handles for carrying), or a mid-tower with a discrete GPU. Anything else is going to have a mobile GPU, and generally speaking those are about 1.5 to 2 generations behind (possibly more if it's a \"budget gaming system\") their current desktop offerings, and not what you're really looking for in terms of graphics performance.","Try vsync","The next time you play games, put your fingers on the laptop surface near the screen. If it feels excessively hot, then heat may be shutting your PC down. If that's the case, a good fan across you keyboard may solve the problem.","I'm looking for a Lenovo Yoga i9 but only find a 9i. Some don't seem gamer oriented but reading https://www.reddit.com/r/Lenovo/comments/14fvoza/lenovo_yoga_pro_9i_review_14inch_model_intel/ would be capable.However it may require a cooling pad if not more to keep from overheating.","What resolution?The website lists the Yoga 9i as having an Integrated Intel® Iris® Xe Graphics. This isn't a dedicated graphics card, you might pull off some 1080p gaming at 60ish FPS depending on the game. But don't try to use any higher resolutions.","specs of laptop?","A Yoga? Oh boy","It's a Lenovo yoga, that's not a gaming pc","since when is a lenovo yoga a gaming laptop????? did you not even look at the specs before buying???","If you want a good gaming laptop get a rog zephyrus g14 or 15 I have the 2022 model it was $1300, dedicated GPU, and can run all games on ultra settings.Just remember all gaming laptops get super hot.","Return it if you can. Sales guy conned you. If you don't know much about computer hardware, you definitely do not need an i9. It does not have a gpu at all.","Next time ask before to spend 1,2k on a laptop.","Also. I have spent 1,4k for my laptop, 2 years ago.But it is AN ASUS G15 Advantage Edition. It plays games.","Try another game just in case. Orc must die had insane lags when i tried it on my pc","The moment i saw it was a Yoga, automatic, you got sold. That is not a gaming-focused laptop.","You bought a 2 in one laptop. Not a gaming laptop. These are meant to be sleek, premium, and portable. They aren't meant to run games. Did you look at the specs before purchasing to make sure it could actually do what you wanted it to do?","Wait, why do you think it’s a “gaming” laptop?","That guy at Best Buy completely screwed you, that is not a gaming laptop it only has integrated graphics which means it basically can barely run the shittiest games on low graphics. He knows nothing about computers and shouldn't be advising people on what computers to buy.You could have gotten a gaming laptop with a top of the line graphics card for the same price. You need to take that laptop back to Best Buy and tell them this, say you wanted a laptop for gaming and this guy suggested you a laptop that doesn't even have a graphics card. Tell them you want a gaming laptop with a Nvidia GeForce RTX 3060 or better.","Return the laptop ASAP and come back to us for laptop recommendations for gaming, they sold you a dud cause that laptop can't game","How long have you had it?( Hopefully not that long so that you can return it)","The specs are dreadful","Probably would help to include the specs of the laptop youre trying to run it on. cpu/gpu and ram.","I could build a decent pc rig for less than that. And laptops usually struggle more with heat.","If you're in the return window, get it back and demand a refund.You bought a laptop that is most likely a UI design or productivity laptop, not a gaming one.You probably have the integrated graphics Xe-LP (Low Performance) which is just the base option for watching movies, internet browsing and maybe some very light gaming (indie games, 2d, minecraft at most).You want to make sure that the gaming laptop has a dedicated graphics card (Nvidia, AMD) and if you're in-store, ask for a test run on a specific game. Fortnite or something free to play but a bit more demanding. Look it up.","Take it back to the store as you were lied to.Also perhaps learn to do the bare minimum of 'research' before making expensive purchases. A straight Google of this product says it is not a gaming device and has only an integrated GPU.","A gaming laptop should have at least a GPU such as nVidia or AMD, otherwise it will struggle to run games. From what I have checked, this specific laptop does not have one as it uses integrated Intel graphics.Some older games may still run, but it all depends on their requirements.If it is possible, return it and get a proper one. It is not difficult to get an idea about the specifications you need. List 10 of your favorite games that you would like to play and check their hardware recommended requirements. Then check prices of computers with those requirement and a bit higher (future proofing) to see if your budget allows. Usually you will find multiple computers with similar specifications.Usually I check reviews and their pros/cons to try and match the right computer to my specific requirements. For example, I prefer better gpu but smaller battery as I always use it on power.","Without the exact and entire model number of the laptop there’s really no way to know if the unit is under spec for games or if there’s a configuration. Issue","You part with 1400 of your hard earned money, some due diligence and googling wouldnhave been wise, don't you think? If younlike the laptop however and it has a thunderbolt 4 port, which a lot of lenovo Intel laptops have. You could spend another 600+ to get an external GPU. Or you know take that jank back and get a lsptop with an actual GPU inside it.","If you like OLED screens, lenovos and games look at this onehttps://www.ebay.com/itm/325852742587?mkcid=16&mkevt=1&mkrid=711-127632-2357-0&ssspo=ANTB-InmQOe&sssrc=4429486&ssuid=wj3vz9LsSyy&var=&widget_ver=artemis&media=COPY","A laptop without a discrete graphics card won't run shit. Integrated graphics just don't have the oomph needed to run games well, even if they're from an i9. Get a subscription game streaming service like geforce now","Honestly, a base model M1 macbook air is better for gaming than that, and it’s half the price.For that money you could have surely gotten something better, that’s not a gaming machine, see if you can return it.","“Gaming” laptops are a scam. Even if you buy some high end ones from Razer or Alienware, they will just get their battery swollen and fucked after 2-3 years of normal gaming.","You got screwed over. Depending on laws where you live and the amount of time it's been you might be able to return it.","I mean this is the nicest way possible, but I think you should stick with console gaming. If you want to get into PC gaming, you really need to educate yourself first. Just based on your post it doesn't seem like you're very computer savvy - and unless you've suddenly become really motivated to get into the hobby and learn, it's just going to be cheaper, simpler, and ultimately more rewarding for you to just play console games. I'm not discouraging you from getting in to it - PC gaming is a great hobby, and it has opened a lot of doors for me - but it isn't for everyone.If you do decide to continue down this path I would seriously recommend that you start with an online course on the basics of computing, or a \"for dummies\" book, or something along those lines. Stumbling your way through buying or building/maintaining a gaming rig can (and likely will) result in much costlier mistakes than this one.You could potentially explore buying an external GPU if you're determined to game on the Yoga, but that doesn't seem like a great option to me. If you can return it or sell it and you want a quick alternative, you could probably find a Lenovo Legion of some variety for around the same price point, which is a gaming laptop. Good luck!","ZZZ z2T TT FT 6ddz","Your fucked, that laptop's sucks for gaming. It might have a good cpu. For gaming this won't work. It's not designed for gaming. Since you don't know about pc's I'll explain.That has an integrated gpu (igpu). Which means it's their to show images on your laptop screen. Every computer needs a gpu in order to see an image on a monitor or a display. In the old times you needed a dedicated gpu. Now they have an igpu. Which means that it uses some part of cpu as an gpu. So it can give a display out to the laptop. It's good for normal tasks but not for gaming.It lacks vram, most of them have 128mb.whichnks not enough to play modern games even at low settings. Older games may work very because of the good cpu. For modern games at least 4gb is recommended. It means 4000mb in vram. See the difference. Most dedicated gpus at least have 4gb of vram minimum.So return that laptop and get your money back","Lenovo Legion and Lenovo LOQ are gaming laptop lines for Lenovo","A yoga is not a gaming machine take it back and yell that continually","I've always bought second hand and 2-1 generations old for the last 15 years. I've only had 1 power supply that didn't work and the seller refunded me without even requiring it back. For 1400 you could easily buy a hybrid of used and new parts for a sweet pc that will smash most games. Because of the work I do, I have a 4k monitor that I play games on with a Ryzen 3700x and a 3060 at around 60fps on low to medium graphics and its great for me. I've seen similar complete setups for as low as 700 Euros and the dollar price is usually about the same in the second hand market as far as I can see.There always seems to be something scammy about buying prebuilts and laptops from chain markets. There always 1 or 2 scam parts or things missing. Cheap power supplies, celeron processors.I tried to upgrade a second hand HP laptop I bought from a guy that said he bought it at one of these places. It had no connectors in the extra hard drive slot. Its was just a sponge.","Return it, get one online with 3060/4060 for the same price, make sure its gaming i reccoment acer nitro series they are good for medium full hd gaming and are cheap","U got hosed brother.","Laptops aren't for gaming. They eventually turn into desktops that can't be upgraded when battery dies.","At first I was sad that you got scammed but after reading your comments I am sad that you only got scammed for $1400.","what was the advertised spec of the machine? did it include a GPU?","Lots of misleading information in the comments here. First, we need to find the specs of the laptop.Press the Windows key and type dxdiagIf you get a prompt select yesThis will open the DirectX Diagnostic Tool and will have the info needed. The first page will have info on your processor and memory. What are those? The next page will show your GPU if you have one under name. What does it say?Contrary to what many are saying, Lenovo Yoga's can have a dedicated GPU along with a higher refresh monitor, which is great for gaming. A laptop doesn't need to be sold as a \"gaming\" laptop to run games. Without the above info though, no proper advice can be given.","This is why consoles will never die.","Anyone else feel like this sounds like a troll?","Just from the title, not reading the contest, i assume you didnt notice it has no graphics card. I mean its a laptop. I even had people with real tower pc asking me why their games didnt run.","I can get a real \"gaming pc\" for 500 bucks. Runs any game. Maybe not on high but on average settings 60-120fps. Not everything marked gaming can game. I have a \"gaming chair\" and it wont even boot.","return it and say that it was sold to you as a gaming machine and yet it doesn't have a dedicated graphics card. get a full refund and get something that has dedicated graphics, for 1400 you can get a sweet tower like this if you dont need it to be a laptopthis can do 1440p gaming fairly easilyPCPartPicker Part ListType\tItem\tPriceCPU\tAMD Ryzen 5 7600 3.8 GHz 6-Core Processor\t$229.00 @ Best BuyCPU Cooler\tThermalright Peerless Assassin 120 SE 66.17 CFM CPU Cooler\t$33.90 @ AmazonMotherboard\tMSI PRO B650M-A WIFI Micro ATX AM5 Motherboard\t$149.99 @ AmazonMemory\tTEAMGROUP T-Create Expert 32 GB (2 x 16 GB) DDR5-6000 CL30 Memory\t$92.99 @ AmazonStorage\tKingston NV2 1 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive\t$61.70 @ AmazonVideo Card\tSapphire PULSE Radeon RX 7800 XT 16 GB Video Card\t$489.99 @ NeweggCase\tCorsair 4000D Airflow ATX Mid Tower Case\t$89.99 @ AmazonPower Supply\tCorsair RM750e (2023) 750 W 80+ Gold Certified Fully Modular ATX Power Supply\t$79.99 @ Best BuyMonitor\tGigabyte GS27QC 27.0\" 2560 x 1440 170 Hz Curved Monitor\t$179.99 @ Newegg\tPrices include shipping, taxes, rebates, and discounts\t\tTotal\t$1407.54\tGenerated by PCPartPicker 2024-02-19 07:16 EST-0500","Telling us the CPU alone doesn't help at all. Does a Yoga even have a GPU? I don't think so. Not sure how it's a gaming laptop.","Return it and get yourself a proper PC (not a laptop)","Return it and ask for Lenovo Ideapad Gaming 3 with GTX 1650TI or newer (there could be some with older 960s but you dont want this). It should cost between 700-1200 dollars depending on spec. You can buy from other brand, but as far as I'm aware this is the cheapest laptop with dedicated GPU. Edit: also if you want to spend more, my personal recommendation is to buy something from MSI. They're not much more expensive but from my experience quality of audio and screen and general feel is better. And I think all of their laptops are Gaming focused so you dont need to worry you will accidently buy something with integrated graphics.","Bruh Yoga is a business laptop not for gamers.","You got ripped off RETURN IT ASAP. That is NOT a gaming laptop!!!!Reset it before returning it.These are gaming laptops: https://www.dell.com/en-us/shop/dell-laptops/sr/laptops/g-series","Don’t look at pc strength by price. You could have gotten a nice gaming laptop for the same price, but you bought a laptop that isn’t for gaming","You've been scammed mate, never ever trust computer salesmen. I remember back in the day I overheard a conversation between some concerned parents trying to buy their kid a laptop for gaming and some employee was tryna convince them that somehow a core i3 was better than a Ryzen 5 (which turned out to be a 5600h).","You’re not going to have fun if the GPU is internal graphics. You need a dedicated graphics card.","Return it if you can and do your research. If you can't return it, consider it a lesson learned and do your homework next time. The Yoga series is a 2 in 1 design for office work and home work so upgrading it in any meaningful way isn't possible. Lenovo's gaming brand is the Legion series. Dells is alienware, but they also have a set of budget gaming laptops under just dell, but they will have gaming in the name. Hp's is OMEN. Razer is in-general agaming company, but their laptops specifically are called the blade and stealth blade. Id it's none of these, then it's not gaming.","dude at best buy lied to you champ.","You should have known better. The laptop isn't best suited for gaming. Consider yourself being scammed.","I hope some can learn a lesson here and never listen to Best Buy employees about anything. They hide behind the whole “we are not on commission” ruse. That doesn’t mean they are knowledgeable and unbiased, it usually just means it’s some kid who doesn’t know shit about fuck.","Take it back. Just because it's expensive and fast doesn't mean it's a gaming PC. That thing doesn't even have a GPULenono has a whole different line of laptops that are gaming computers, this one is meant to be a personal workstation.Look for a laptop with a dedicated GPU if you want to game. Acer predator, for example.","Guy at Best Buy was an idiot. I used to work there and unfortunately a lot of the sales people there really don’t know anything. Definitely return it. If it’s outside of the 15 day return policy, go in and speak to a manager and explain to them that you were told misinformation.","When you have $1400....You should sense to buy an actual gaming laptop.","Its a laptop and lenovo. Get a proper pc","I don't believe Lenovo markets this laptop as a gaming laptop. You didn't mention where you purchased it from, but if the vendor you got it from advertised it as a gaming laptop, I'd return it. Not everyone knows enough about computers to look into the specs of it, so I can understand being fooled by a sales tag if you're not familiar with the hardware.","if you could return it you should, there are better option for work and games for the same price, Best buy see an I9 o I7 and believes is a gaming laptop, i hate these guys, i remember the first PC that i bought and the guy told me i could play every game in the market, which of course wasn´t true, after that i learn to build my own PC.","I doubt a yoga can run games nor does it have a GPU.","People at Best Buy have told me their gaming computers don’t have various things and they are still the best. The best interaction I had with one woman was when she told me a gaming laptop was special because it ran without a motherboard. Lmao They are so stupid!!!","Return it to Best Buy say the sales guy said it can play games really well and it can't and then take your $1,200 and build yourself a gaming PC. r/PcBuildHelp is a good resource if you need any more info. You can make a post tell them your budget and what games you want to play and normally people will help you out.","Return it and build yourself a nice rig for 1500$","There is no such thing as a gaming laptop.","Return it, and get something with a discrete/dedicated graphics card. One that says it has a Nvidia 30** or 40** in it.","Return it to best buy, and never trust a salesperson...","You didn't even mention the specs of your laptop","Regardless of the specs it shouldn't crash. Run like shit, sure. But if it's crashing there's something wrong with it."],"points":993},{"text":["Can I change my voice live during a call?","There's basic voice filtering software available (that do things like pitch, and other basic audio effects), that will likely induce a small delay (like 0.2-0.5 seconds or something), but as far as I'm aware the ability to do proper transformation to change one voice into another voice with neural-networks or whatever isn't something that's going to be done in realtime with at home hardware (at the moment)."],"points":0},{"text":["PC freezing when playing any video content on Steam/Discord/Web Browser","Just a few suggestions:make sure that your operating system and all relevant software (browsers, Discord, Steam) are up to date. Performance issues can sometimes be resolved with updates that contain optimizations.Another thing to check would be your power settings. If your PC is set to a power-saving mode, it might be restricting performance. Try setting it to a balanced or high-performance mode.Beyond that, perhaps check your monitor? Its rare but sometimes something can be dodgy with either the monitor, HDMI or DP cable."],"points":0},{"text":["Can’t install tp-link archer tx55e internet adapter"],"points":0},{"text":["Windows gets unresponsive at a 'certain time'"],"points":0},{"text":["External WD HDD getting hot, takes super long to respond"],"points":0},{"text":["Please help, PC shuts at random","Could be temperature issues? Try stress test benchmark on Aida64 to see if you have temp and throttling issues. Maybe have HWINFO logging the temps so you can see what the temps were when it shuts down"],"points":0},{"text":["Incoming email - Domain blocked at my end - is this even possible?","Does this help:https://www.fatcow.com/help/article/email-management-how-to-manage-your-spam-filter","The bounce back they get should tell you exactly where the issue is, ask them to send it to you","This sounds like an answer from a lazy IT guy to be honest"],"points":0},{"text":["Problem with keys"],"points":0},{"text":["BSOD issues","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Please run the following command in a cmd prompt terminal and link a screenshot of the output:wmic memorychip get banklabel, configuredclockspeed, DeviceLocator, partnumber, speed"],"points":0},{"text":["Cannot open or reinstall apps like Photos or Store on Windows 11, considering repair install.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Why would Phone randomly start asking for 2fa code","post this on r/iphone","Maybe the backup was very old and apple refreshed the session in a way (or they just tightened up security so that an iphone backup can't be used to steal your account","The fact that you are resetting your phone back to a particular backup multiple times is pretty alarming just by itself. What could possibly be the reason for multiple resets on a regular basis?"],"points":0},{"text":["Pc monitors turn off while gaming but the pc still runs","For refrence my PSU is the corsair rm850x and my GPU is a Radeon 6800xt","do your peripherals (keyboard, mouse etc.) also turn off or just your monitor?"],"points":0},{"text":["2080 fan goes to 100% as It reaches 70 degrees","try an app called \"fan control\" ,"],"points":0},{"text":["Tips for basic cleaning of Helios 300 Predator PH315-53 Gaming Laptop"],"points":0},{"text":["Issue with Lan connection from computer"],"points":0},{"text":["I'm getting a bluescreen and I don't know why help","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","I'm still getting bluescreened after uninstalling and reinstalling the AMD drivers, with the format install option."],"points":0},{"text":["How do I switch all data between two laptops?"],"points":0},{"text":["I dropped my phone while in the rain. The floor was quite shallow. It turned itself off (I didn't know I had to immediately turn it off) and turned it off twice. Now it won't turn on. Is it done for or salvageable?","Your best bet, let it sit and wait."],"points":0},{"text":["[Linux] Bought a new SSD, and found it already has a bunch of data on it. How do I figure out what sort of filesystem it is so I can mount it?","First, I'd use something fdisk -l or other that can show you if the drive has partitions.Then for each partition, or the drive itself if it has zero partitions:sudo head /dev/sda1 | file -"],"points":0},{"text":["Router isnt outputting a wifi signal, but is allowing my ethernet cord to work.","It's probably on 192.168.1.1. Go there in your browser and see.","There is a button the the router to turn wifi on and off. On the nighthawk the WiFi indication light is also a button."],"points":2},{"text":["Monitor Stretch Resolution"],"points":0},{"text":["My Ethernet connection keeps cutting out for a few seconds and reconnects after."],"points":0},{"text":["Pc not displaying"],"points":0},{"text":["Monitor Stretch Resolution"],"points":0},{"text":["Pixio PX278 Monitor Refresh Rate Issues??"],"points":0},{"text":["Pc xbox app not working"],"points":0},{"text":["My Laptop Screen Randomly Cuts In And Out","I suppose you don't have an accessible lid switch, do you? i.e., a tiny button somewhere around the edge of the keyboard, probably near the hinge, with an opposing pin or nub which presses down that button when the laptop lid is closed.​If you have one, perhaps try cycling that switch a few times when it acts up?Unfortunately, many modern laptops conceal this switch inside the hinge, where you cannot see or access it."],"points":0},{"text":["Laptop shuts down while gaming, system overheating","CPU at 85°C is right at the limit of what I would expect. High but not terrible. GPU at 75°C seems fine. PCH at 100°C is a problem, though. They're not supposed to get that hot. Most of the time, they don't even have any thermal management, just a bare die.Given several assumptions, I think this is the inside of your laptop, with the PCH circled. Bare die, nothing to suck away heat. Because it's not supposed to need heat management. If it's getting so hot that your laptop is shutting off, then something is broken. There's a short somewhere on your motherboard or in the PCH chip, and too much power is being drawn. It could theoretically be cheaper to do component level repair rather than to replace the whole motherboard, but that requires specialized skills and equipment. Someone like Northridge Fix could probably handle it. Otherwise you're looking at a motherboard replacement.You could theoretically attach a tiny heatsink to the die, and that'd probably get you an extra couple of minutes before the system shut down. Problem is, you need airflow across a heatsink for it to work well, and laptops don't have much.You could also stack up several copper shims to the right height so that the PCH can sink heat to the bottom of the laptop, the same way that the NVMe drives do. You'll need some thermal adhesive to attach the shims together, and to attach your newly made copper block to the case. And a thermal pad to interface the block to the PCH die. That might work long term, especially if you get a cooling pad to blow air at the bottom of your laptop.","needs repasted..."],"points":0},{"text":["Computer not working","It got stuck on some corrupted file (or something similar). Here is an article about how to repair the situation: https://answers.microsoft.com/en-us/windows/forum/all/we-couldnt-complete-the-updates-undoing-changes/f054a777-f7ac-430a-bf65-9e320714d5e3 Try the repair and scan options as needed."],"points":0},{"text":["Wifi speed really slow but only on ps5"],"points":0},{"text":["PC acting weird","I had a similar issue not so long ago, ended up being an issue with the RAM holding process. If you have two sticks maybe try unplugging your second stick and turning it on, or swap them out. If you could give a quick spec list that would help too.","Run a stress testing program like prime95 and see if it happens more often. See if your ram throws CRC errors.Check windows error logs."],"points":0},{"text":["A line of pixels has rotated","First step: If you take a screenshot, does it show in the capture? If so, it's probaby a driver issue. If not, then it's a monitor issue."],"points":0},{"text":["Google Movies","Which movie?"],"points":0},{"text":["this error pops up whenever i try to connect to a discord call with either of my headphones","Test if audio in general works by watching a YouTube video or something and then if your audio works just uninstall discord and reinstall it. Instructions for that can be found on google."],"points":0},{"text":["Crashing Issues worsening","Do you get any issues in any other games?​Step 1 : Try vanilla Minecraft with the default launcher."],"points":0},{"text":["Need help figuring out what is wrong with my pc setup. Monitor doesn't display anything apart from \"no connection\"."],"points":0},{"text":["Black screen issue with graphics card drivers (RTX2060)","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Calibration on Xbox 1 controller not working…"],"points":0},{"text":["GPU being used to fake 100%!!! (nvidia gtx 1650)"],"points":0},{"text":["Samsung SmartTV makes super weird buzzing sound"],"points":0},{"text":["PS4 Streaming Apps Connection Issue"],"points":0},{"text":["Subtitles going out of sync on browser","I just found a solution. If u turn off Ublock Origin then it supposedly seems to work so try turning off/on some extensions for that page and see what works for u.Edit 1: I am using OperaGX and only getting this issue in that browser so ur case may vary. I have this issue on Prime video btw."],"points":0},{"text":["Please explain how remote PC access works.","They install a piece of software that allows them to connect. The tech could cause serious harm, but that is where hiring trusted companies come into play."],"points":1},{"text":["HELP! Ping Spikes | Massive Lag Spikes in Games and on Video Calls","Is the pc directly connected to the modem/router or is anything else in between there? A faulty switch or cable perhaps?"],"points":0},{"text":["My keyboard causes ping unestability","So either whatever you’re playing handles the direction you face locally but might validate your location through the server meaning that movement could cause lag/desync but camera movement won’t(basically it could just be because of how the game works ¯\\_(ツ)_/¯). Or there’s a possibility that if you’re using a Bluetooth keyboard and your WiFi is on the same frequency they can sometimes interfere with each other. Usually I notice it if I’m using usb adapters (WiFi and Bluetooth usb adapters at the same time).","Wireless internet?"],"points":1},{"text":["My Windows doesn’t let me download an important update and I can’t download anything on steam, epic games, riot games etc.","Hard drive full?","Copy the KB number, go to this link to manually download the update.https://www.catalog.update.microsoft.com/Home.aspxPast the KB article in the search box and search for it.Download the correct version based on your operating system, 32 but or 64 bit.Find where you downloaded the file and double click to install it."],"points":0},{"text":["how do i connect speakers to my xbox 360 (or crt monitor)? details below"],"points":0},{"text":["Laptop screen suddenly started glitching","Connect to external display to see if it is display or graphic card problem."],"points":0},{"text":["Ctrl+Shift+Esc does not open Windows Task Manager when using left side of keyboard","You'll likely want to use something like KeyboardStateView by Nirsoft to identify whether all the key presses are actually going through and being registered by your PC.That might help narrow down whether the keypresses are actually being picked up, but something on the PC is preventing the action from happening; or whether it's something like an odd Keyboard feature that blocks that combination 'on-device' for whatever reason and just never sends it to your computer (like those 'gaming' modes that block the Windows Key or whatever)."],"points":0},{"text":["PC Randomly turning off after closing games/BSoD","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","That it only happens after closing a game might suggest either a temperature or BIOS issue, but all five dump files show a hardware issue with the CPU's cache. If it's not temps and a BIOS update doesn't help, a faulty CPU is the main suspect. Granted, it only happening after closing a game doesn't quite make sense, but there are some scenarios where it might like if it's an issue with the c-states. C-states basically being power modes for the CPU."],"points":1},{"text":["PC randomly gives me no display for YEARS."],"points":0},{"text":["Ive had my PC for a long time now, but I cannot for the life of me find out where all of this storage went?","Install WizzTreehttps://diskanalyzer.com/?ref=wiztree","I use https://windirstat.net for situations like that. Great free program to see what's going on with a hard drive.","Time for a format and reinstall windows, my experience is that the c drive can slowly getting full with windows over time, maybe with update files etc.","temp files and swap file is usually the reason for this. windows updates normally download to a temp folder before installing as well as some other programs when you update them. if those are not in the user temp folder they will not be cleaned up with windows cleanup.zip programs usually put the them files in the user temp folder unless you change the setting for those programs. even bittorrent will use the user folders unless you change the settings.another problem is the swap file. if it is set to dynamic it can grow or decrease as windows seems fit. the swap file helps if you dont have enough ram to run large programs/games and even the sleep mode (storing data til its woke up again if i understand it correctly) but the size can grow pretty large which dont help if you have a small hard drive.plus over the years of programs installed and uninstalled takes up space ... i've heard some do reinstall about every year or so to help clean up some of that as well. after about 4 years i upgraded my ssd and did a clean install just to rid a bunch of programs and games that i never really used much. for me a clean install with some programs i wanted uses just over 50 gig where as the windows was using about 175 gigs before - just to show you things can add up over the years."],"points":3},{"text":["Ive had my PC for a long time now, but I cannot for the life of me find out where all of this storage went?","WinDirStat","SpaceSniffer"],"points":0},{"text":["Windows stuck on Windows is bedingt prepared"],"points":0},{"text":["Z key remapped itself to right click"],"points":0},{"text":["Which is better, large battery capacity Vs power bank?"],"points":0},{"text":["PC Rebooting (Sometimes BSOD)","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","I have the same problem, same exact, to the roblox part xd and it all started after the new windows update! Maybe try reinstalling windows or downgrading to an older version before the update?"],"points":0}]