[{"text":["AI hiring tools may be filtering out the best job applicants"],"points":0},{"text":["Air Canada ordered to pay customer who was misled by airline’s chatbot","Most people don’t realize that Chat GPT is just a language model. It studies what we’ve said and produces results that sound like what we’d say based on what we’ve said in the past. It’s like an actor going to a medical convention to study how to play a doctor. He can learn to imitate their tone, their delivery, and use medical terms to say doctor-y sounding things. But he’s not a doctor. He doesn’t understand medicine. He’s just imitating what doctors sound like one.You never hear a chatbot say “I don’t know”, because it was never thinking in the first place."],"points":0},{"text":["New chip opens door to AI computing at light speed"],"points":0},{"text":["Suddenly, there's real competition for broadband internet","Spectrum should rebrand as Rectum.","Spectrum in my area has an absolute monopoly and they have terrible service for people!","To spell it out: This is from Spectrum, also known as Charter — the biggest cable-TV provider in the US and the second-largest broadband-internet provider in the US. And it’s targeting a rival program from T-Mobile — the third-biggest wireless carrier in the US, which has started selling its own broadband service.","spectrum is trash and runs a monopoly","Returned my Spectrum modem today. Had them out twice last week due to intermittent drops that would last 2 to 20 minutes - usually in the middle of a Teams call. They said it was my WiFi router, so I replaced it. Still happened. They came out again and said everything looked good on their end and it was my equipment. When I told them I replaced my router they shrugged and left. I switched to MetroNet and now no drops.","Been using T-Mobile 5G Home Internet for about 2 years now and it works flawlessly. MS Teams, 4k streaming, xbox x gaming, it handles all of it. Customer support is really good as well. The one time I did have issues it was fixed in about 10 minutes.Spectrum / Charter are absolute garbage from a customer service standpoint. The networks are generally out of date. And the costs just go up and up every year. They shouldn't be worried about telco they should be worried about doing some self improvement.","Internet will not be competitive and equally available for all Americans till it is regulated like a utility.","Bye spectrum. Finally more competition","Does spectrum have a satalite connection?","T-Mobile Home Internet is horrid, but it's better than cable and DSL It took over a year to figure out how to pay my bill without having to call the Philippines at 2:35 a.m. and tricking a computer into letting me talk to a human to pay my bill. It's been about three years and I still can't get a VPN to work with it's crap trash can modem. (As in, looks like a trash can.) Forget tech support, this is only supported by a small team in the Philippines who don't speak English and barely know how to turn on a computer. Also, when I first got it, I didn't get it. I had to complain and they said they want money for the one they sent. I went down the street hoping and finally found out where the morons sent itIt has also just raised prices and established a data cap, both of which they weren't supposed to do.If something can beat it, go for it. It is reliable and fast, tho. Then again Frontier had me believing 2.5 mhz down was blazing fast.","I’m more curious what pricing will look like after April when the affordable connectivity program runs out of money. Prices jacked up when it rolled out to capture more free money and now companies like comcast have a bunch of accounts on the books that won’t be able to afford their plans but they won’t do shit to give an existing customer a decent rate.","I guess that $20 a month increase in my broadband bill was to pay for a Super Bowl commercial.","We've had more problems with work from home clients that have T-Mobile broadband. I have a feeling it would be less of an issue if we were using IPv6, but that's out of my hands.","Well... im stuck with spectrum. But we're getting fiber in my area from some other company, att dsl, starlink and a few mobile carriers are avalable. Hope they compete and drive prices down.","How is the tmobile for gaming?"],"points":126},{"text":["Feds dismantle Russian GRU botnet built on 1,000-plus home, small biz routers. Beijing, now Moscow.… Who else is hiding in broadband gateways?","I unplugged my smart coffee maker and now Teams runs faster. Who knew?","Literally everyone","Maybe change the default admin password","I have been storing my Pied Piper data on smart fridges for years","Iran, North Korea, maybe a few more.","AllOfThem.","To be fair, they learned it from the NSA and Cisco.","Please consider pfsense or the forked project opnsense if you have some technical skills.They’re both open source router software based on FreeBSD (remotely like Linux but different enough that they aren’t compatible). You can repurpose old computers for a much better and more secure home network.","Inserts always have been meme...🌎🧑‍🚀🔫🧑‍🚀","What the fuck is this headline?","All the countries do this. Have been for decades.","Is this a serious question? The NSA of course.","The CIA? The NSA? The DoD?","The CIA, NSA, and FBI.","The Israelis in your video cards for real","Digging the cover photo for the article lol","Giorgio Tsoukalos enters the chat…","I am waiting on the offshore development story to break 🙃","Everybody. Companies don't take network security seriously and are unwilling to properly budget for it, and I'm using the blanket statement on purpose. And home users are even worse than that.","Doesn’t the new device setup wizard make you change the default password? How does something as basic as this kind of security breach still happen these days ffs?🤦","Who would've thought having an internet facing networking device would increase attack surface?","Remember when the most Reddit addicted place was a US air force base when reddit revealed usage data?","Jokes make a full circle before turning a reality: put American firewall ahead of Russian firewall ahead of Chinese firewall ahead of German one, ahead of French one. Then put generic Linux with iptables on top of that to be extra sure."],"points":230},{"text":["Uruguay wants to use gene drives to eradicate devastating screwworms. A hereditary defect created with CRISPR could wipe out cattle-killing pests that cost the country millions.","Do mosquitoes first, please.","What could possibly go wrong","Do.Not.Fuck.With.The.Life.Cycle.","God I hope so!","Domino affect if u take out a part of the food chain","As a kid in Texas in the early 70’s I remember finding the white cardboard boxes that had contained sterile screwworm flies out in our pasture. I didn’t know what they were at the time, but found out later.","Any chance they’ve worried about how that will ruin their whole ecology?","“Operation Screwdriver” is hard to pass up","Do humans next.","The balance of nature is pretty much in-tune. We off killling something just because it’s a pest and don’t expect consequences? Right…","Do bedbugs next please! Someone provide one good reason bedbugs exist?","There’s already an effective strategy for eradicating screwworm: release sterile males into an area. We don’t need to mess with CRISPR","Just wind down cattle farming. Nobody needs beef in their diet to survive.","This has been done before the old-fashion way.https://en.wikipedia.org/wiki/Sterile_insect_technique?wprov=sfti1#TLDR: The female adult screwworm fly have sex only once in her life, she basically stores all the sperm. Once these scientists realized that, if they release sterilized males (by literally blasting them with radiation) en masse, those sterile males will just overwhelm normal males in sheer volume, have sex with females, and she will lay non-viable eggs. If done repeatedly, this will cause a population crash and effectively eradicate local population of screwworm flies without using pesticides or chemicals. These CRISPR gene drive is just more modern, and hopefully more efficient method, of sterilizing these males.","Dew it","Anyone remember the opening shot from the movie adaptation of “I Am Legend”? I’m getting those vibes."],"points":51}]