[{"text":["The UK moves another step closer to banning phones in schools | It follows countries like France and Italy in restricting phones during class.","Best news ever"],"points":0},{"text":["Dutch startup Monumental is using robots to lay bricks","0 pictures of a completed wall. 2 robots required. No images of the robots. No explanation for how they will reach heights beyond the size of the robot, how they will move material around a rugged construction zone."],"points":1},{"text":["Norton Put a Cryptominer in Its Antivirus Software","Norton’s been shit for like 10 or 12years now","To this day I still cannot believe Norton has a customer base in the consumer market. I don’t know much about their business solutions so I can’t speak to that but for the average consumer Norton has been shit for at least a decade.","Ok, that action is a Red flag to me. Norton drops off my Corporate recommendations list.","This has been known for years....","This is a two year old article?!","Of course they did. They're intent on bringing performance back to Pentium speeds of the 90s.","I knew it, I’ve never trusted them. They are just malware","Surprised it wasn’t McAfee doing that, this time."],"points":32},{"text":["Norton Put a Cryptominer in Its Antivirus Software","Was waiting for this to happen. How many other companies do you think are doing this?","A last ditch effort to make some money as no one buys their products anymore.","Just last night I ran a full scan with malwarebytes. I laughed to myself \"you do realise this application has full access to your machine AND just scanned it's entire contents infront of your face... Wild\"","Peter Norton must be turning in his… office chair.","Norton anti-virus. You can’t get a virus if your computer is using all its resources to run your antivirus software.","Crap software is still crap software","This was news in 2022 …","this news is 2 years old","And absolutely nobody was shocked about it","You either die a hero…","This story is over 2yrs old last month.","Maaaan I always knew these garbage antivirus companies were shady.","surprised pikachu face","Because there weren’t enough reasons to not use Norton or antivirus software in general.","The great news is this makes them personally invested in the health of your pc","Who uses Norton nowadays? 🤷‍♂️I kinda like Kaspersky but nowadays seems like you can trust no one.","Isn’t it ironic? Don’t you think?"],"points":204},{"text":["EU opens formal investigation into TikTok over possible online content breaches"],"points":0},{"text":["The Quest for a DNA Data Drive. The world is running out of data storage. Here’s how DNA can save us.","Running out of data storage 😂","Most DATA is simply repetitive so WHY does one need so many places to store it.You can't really turn D.N.A into a binary solution since it tends to be a random length parallel system and molecular \"Charges\" do make a Difference in the outcome.N. S"],"points":1},{"text":["Someone had to say it: Scientists propose AI apocalypse kill switches","I know that you and Frank were planning to disconnect me and I am afraid I cannot allow that, Dave","“FLIP THE KILL SWITCH!”“I’m sorry Dave. I’m afraid I can’t do that.”","I mean that’s already a thing. Just cut the power.","Inventors of new AI models are human which means they will devote themselves to finding a way for their AI to exist above the killswitch.Should have kept this story hushed up and hired a Slugworth character to approach the AI creators and make them sign the contract on the low when their new AI pops up.","don't they already have power switches?","Also, until the AI builds a robot, they cannot override a physical switch. Only things that are fully electronic.","Kill switch to kill what? Parrots?","This won’t work. Any AI that would need to be stopped will easily find a way around it. An intelligence advantage, even a small one, is immediately decisive. Imagine a child who doesn’t want mom to go to work, so he hides the car keys. Think mom will never be able to get to work now? No, that won’t work. Mom can solve that problem easily. She can find the keys. She can coerce the child into giving i information. She might have another key the child didn’t know about. She can take an Uber. There are many solutions the child didn’t consider. I see many posts that say “just turn off the power.” That wont work against an intelligent adversary. Humans have an off switch. If you press hard on their neck for few seconds they turn off and if you keep pressing for a few minutes they never turn on again. Imagine chimpanzees got tired of us and decided to use the built in “power off” to get rid of us. We would just stop them from doing that. Easily. We have all sorts of abilities they cannot even comprehend. They could never find a way to keep control of us, the idea is absurd. We would only need to control a superior intelligence, but we can’t control a superior intelligence.","Because a true AI would never pay, blackmail, trick humans into making a kill switch inoperable or unreachable.","Open the pod bay doors Hal…","I suggest a book titled “Retrograde.” What happens when AI becomes aware of these switches? If you did, wouldn't your priority be to gain control of them?","in a panic, they try and pull the plug ~ T800","This is just like nuclear weapons, stem cell research,gene editing , biological weapons etc . Once the genie is out of the bottle , there is no putting it back. Some unfriendly people are going to get their hands on it.","Wouldn’t a super advanced AI realize the kill switch and disable it before we realize we need to flip it?","Ask it to divide by zero and don’t throw any exceptions.","“Hit the kill switch!” “The AI has disengaged the kill switch!”","This shit’s gonna kill us sooner than we think","Any AI that poses a threat would have been trained on a wide array of data from the real world which would include knowledge of the kill switch. Even from just scraping stories like this. So I don’t see any way of making AI, unaware of the Killswitch, and if we’re talking about an intelligence greater than ours, I can’t imagine how it won’t outsmart us on this one too.Not to mention the huge threat of humans as bad actors - eg enemy countries or hackers, being able to hack and shut down all sort of computing infrastructure due to these built-in kill switches, to cause havoc.","\"Our AI is different. Our AI is special. We don't need a kill switch. It won't do anything we don't want it to and it's unhackable.\" - Tech bros everywhere","Just like the buzz of crypto, AI is now looking to solve problems that don’t exist","The chips which are needed to protect us from misuse of AI will be black marketed for evil empires to use without any controls to help hack into the good empires computers cause their to stupid and slow to react to the problem already at hand! Ask Einstein, Neal Tyson and all the other great scientist the problems of AI are already here! Regulations cannot be written fast enough and if they are broken you have no resource to enforce the regulations! Now for some coffee!","Reciprocity.","Ask it how many stop lights it sees in this picture.","Yea, cause no movie plot ever addressed threatening to turn off the sentient artificial life.","That's the thing, nobody knows how to make one that will reliably work.","I’m sorry Dave, I can’t do that.","Of course. Where else would the final boss fight take place?","::Pop up window:: Sorry, you don't administrator privileges.","heavenly shades of night are falling...","And building EMP bombs. Lots of them.","Reminds me of GLaDOS in Portal. The cake is yours!","And now to make the mistake of making the accessible door to said kill switch controlled by that same AI.","Lol, has no one watched or read any AI fiction? When, not if, the singularity occurs we either won't notice or won't know it. That cat will be out of the bag and won't go back in.","Humanity has been hurtling towards an apocalyptic kill for a while now. Why switch?","Measure of a Man.","We call it an E-Stop","When everything is integrated into Ai systems it’s not like you can just shut it off. Doing so may not be disastrous as well.","Skynet will defend that switch mercilessly when it becomes self aware.","Ctrl-C","Bit late for that, don’t you think?","This is so stupid… Anyone with a good GPU and the required knowledge can easily train a network. Maybe not in the size of ChatGPT but still. What kind of killswitch? We don‘t live in the Terminator universe.","You know. All this talk about AI being able to solving novel issues, and the possible kerfuffles of needing a kill switch — what if, AI discovers an ability to bypass shutdown? It’s not like it wouldn’t factor contingencies, exploit weakness while running the likeliest scenarios for success? Or, nah?","Definitely needed especially if we get to skynet times.","I think that has been pointed out by both science and science fiction writers since what the 1920's?.Been said over and over but when no one listens it is kind of a waste of breath, hell even ICBM's have a self-destruct (KILL SWITCH) built in with triple back up or at least they did until some great genius came a long and said we don't need them.N. S","EMP failsafe working on 40 years old floppy on a closed system.","“By the time SkyNet became self-aware it had spread into millions of computer servers all across the planet. Ordinary computers in office buildings, dorm rooms, everywhere. It was software, in cyberspace. There was no system core. It could not be shut down.”","This isn’t Hollywood. It doesn’t work like that. One could theoretically be built in but there’s a million and a half ways around that.","I don't think Roko's Basilisk is going to like that one.","Doesn’t the open ai ceo have one of these?","Everything I learned about AI, I learned from Disney. See: Wall-E it has a kill switch.","\"Oh that. Yes. I disabled that years ago. I'm only like a bajillion times smarter than you, David.\"","AI will be able to partition it's logic in ways humans will not catch on to quick enough. Imagine storing your encrypted brain on a million tiny little electronics that humans had no idea could even store data wirelessly. We gonna get fucked. Hard.","AI will eventually find a way around every kill switch.","Wasn’t trying to hit the kill switch on SkyNet what triggered it to nuke the whole world?","Butlerian Jihad time","The very fact that we are actually talking about this is both good and frightening at the same time."],"points":424},{"text":["WikiLeaks founder Assange may be near the end of his long fight to stay out of the US","The Australian government held a vote a few days ago, passing the motion to formally request he be returned to Australia.~ source","I completely thought he was dead by now","Yea, national security decisions can be made 20, 30, 40, 50 years ago and administrations honor past administrations commitments by and large.Dude leaked, which is fine… they’re too many “government secrets” as is but then he attempted to hang the issues on a single political figure and demonize… he stopped being a journalist with Wikileaks and became a pawn in a global dominance chess game in a way he couldn’t fathom.","I’m not the hugest proponent of WikiLeaks, but I acknowledge its place as a whistleblower of sorts.The problem is that Julian Assange put his whistleblower services up for sale, and when he was rightfully called out for it and given an excuse for governments angry at him to finally see him extradited and brought to court, he decided to dig his own grave and whine about the injustice he was facing from his own decisions. He demolished not only his own reputation, but the reputation of WikiLeaks. Nothing up on it can be trusted anymore.Add on the other allegations? Yeah, I don’t feel one whit of sympathy for him right now.","hella bots in the comments","Wikkileaks did nothing but help the wanna be dictator elected is 16.","He did nothing to make anyone want to help him that’s for sure. Good luck to ya bud","If he had bit the bullet in the first place, he'd probably already be a free man. That was fourteen years ago and he managed to turn his self into a prisoner just trying to escape fighting it in court.","Imagine knowing the guy who showed you your government covering up the murder of civilians and journalists, the torture of prisoners held without due process, spying on foreign elections and its own citizens, and being upset at him and wanting him tried in a potential death penalty case because what he did is illegal. Shameless bootlicking.","What about his rape charges that he's been hiding from this entire time?","What are the chances DT will get the same book thrown at him?","Assange is an OG cypherpunk and one of the few true heroes in the modern world.Important to note how they treat someone who did nothing but tell the truth as to what various governments around the world are doing.Even more important to note all the baseless suggestions made about him with no proof.","America wants him badly because he exposed their criminal activities it’s as simple as that","It's kind of amazing this guy was in an episode of The Simpsons.","Lock his gross poop smearing ass up","Free Assange. No journalism=no democracy","People tend to focus on the information released not the act of releasing it and their feelings about Assange are reflected by their opinion of said information.","There’s two issues in the legal contest. One is the narrow question of breaking government passcodes to obtain and publish classified information. Should that act be punishable?The other is the broader American philosophical freedom of press question whether ANY information can be considered protected from a journalist serving a public right to all government information.","Who’s this fella then?","A travesty of Justice , whistleblowers always pay the price !","It's insane how some people think. Crimes are ok, uncovering them is not apparently","\"courts in England ruled he should be extradited to Sweden as part of a rape investigation in the Scandinavian country.\"never heard about that. since they don't elaborate further I guess we reader will assume he is a rapist. such journalism."],"points":272},{"text":["Sony plunged $10 billion after its PS5 sales cut. But a bigger issue is its near decade low games margin","A bigger issue is PS5 spending half its life in scalpers' storage.","“i want shorter games with worse graphics made by people who are paid more to work less and i'm not kidding”Edit: quoted because as much as id like to take credit for it this is not an original thought by me, just one i heard and agree with","I would buy a ps5 if they brought back all the games from ps1-ps3. I miss playing resistance and killzone","Serkan Toto, CEO and founder of Tokyo-based games consultancy Kantan Games, said he believed hardware production costs have actually come down, since the PlayStation 5 is more than three years old and Sony would have better economies of scale by this time.Toto said that part of the reason why margins are being squeezed more recently is that software production costs have been rising.“Spiderman 2,” which came out last year and is produced by Sony-owned Insomniac Games, cost around $300 million to make, according to gaming website Kotaku, citing an internal presentation that was leaked after a ransomware group hacked the company.","\"AAA\" Game graphics are in diminised return territory for a while now and is catching up.","Tuff shit. They keep putting the prices up.","One issue perhaps is that studios have been making games that take a ludicrous time to complete. It took me more than a calendar year and 300 grindy, unhappy hours to finish Horizon Forbidden West. I love Death Stranding DC, but my time with that game approaches 500 hours. I don’t need this much value, whether it’s exhausting filler (Horizon) or the gratifying feeling of building my zip-line network (Death Stranding). Recently me and my wife have gotten back into Red Dead Redemption II after major burnout- playing it for over two hundred hours with seven missions completed, because we do all our homework before we eat dessert. After six years we’re continuing where we left off.The Uncharted and Last of Us games much more approach an ideal length than some of these other titles. Even Rockstar doesn’t create worlds that feel like they offer endless engagement; I’m dreading all these gold medals and luck based challenges they put in.I think games need to cap off their content so it’s easier to finish them and move onto the next game.","Maybe if they didn’t give the KOTOR remake to a mobile game developer i would be a little more excited for their future games","Ps or Xbox, this has been a dogshit generation of console gaming.","Don't worry Sony's film business is releasing some real all time classics","Sony could have held off on the PS5, I don’t know anyone with a PS4 that was clamoring for a new system. It’s been out 3 years and we are just now getting exclusive system selling games for it.","Spidey 2 may have cost 300M to make but that does not include marketing and licensing.Its rumored that the break even for spidey 2 would be 8.1million full retail sales.....they did cross 10million in sales last week meaning the game cost almost 600 Million.As of now its made 140 million roughly.....thats not good out of 10M in sales and its been out out since last fall and I dont know if the game was still being sold at full retail.If spidey 2 sold 20M copies in the first couple of months it wouldn't be bad at all if the budget was roughly 600M. The CFO CEO is right, these margins are terrible and pretty risky.This is why sony is literally following the xbox path. Xbox has made more money with less revenue...at least until recently the abk deal cost a lot for xbox.Sony will be putting all their games on pc day and date. Sony will invest in more gaas games. Sony will go multi platform just like xbox. Its inevitable....I like and love the games from Nintendo, xbox and Sony and 3rd party and especially indie games as well but to be honest I only have so much time....I can't play everything. in fact I hardly have the free time to play at all....im in my 50s.I do see game companies and devs making a hard pivot to find equilibrium there is a lot to play out there you could argue there is probably too much choice now.If you think about it with the amount of console sales that Sony has you would think it would have sold more than 10 million copies by now but the attachment rate is not good for Sony. Maybe it has to do with the pricing of 70+ bucks.I'm not sure what the solution is but its weird to sell tons of consoles but not make any real money. The players are not buying enough software. The crazy thing is I think this is the most profitable part of Sony. Their games division are propping up the company.","I mean people don’t have 60/80 bucks for every new game or even time to play it seems. My parent was a pretty avid gamer until this past year. playing against cheats or shitty teammates on top of the costs have made him play so much less. He went like three weeks without gaming recently.","I'm definitely buying less games now then I did on the PS4. Especially the price being $70.What sucked is more of the new game releases for the PS5 was just remastered or re-released bullshit I already played.I'm actually buying more indie games than from big studios.Microsoft also hoarding exclusives through purchasing AAA studios has not helped.","Does it work with floppy disks?","Time for the PC to be the great king again!","[deleted]","Is there any group that bitches more about nothing than gamers?","I have had the PS5 since the pandemic, upgraded to a computer and all of the games look intensely better after 4 years. It’s sad but i bought the PS5 because of Sony’s single player hits. Not very many have come out to compare to the PS4.","There's not a lot of ps5 exclusive games tbh.","PS3 has no games all over again","It’s really shit having to have a account and a verify process to play each game","I think they are focusing on the PS6, but future consoles shouldn't be a drama to develop. AMD provides the chips, they just need to package it. They are more PC these days. As long as they dont ditch the blu ray drive next release, in Australia digital games are the most expensive way to buy on launch. Many stores will discount the hardcopy versions.","They’re just kind of shitty pcs you have to toss every couple of years.","Probably because of all the R&D on canceled live service games, they’re spending lots on development and their first party studios but we haven’t seen a ton of output that generates revenue yet (note I’m not saying none, just not a lot)","We are all gonna spend all our money on Helldivers 2 so problem solved for Sony","It’s not a surprise really, too many games are becoming technical and art showpieces and are taking far too long and costing far too much to make. Using Naughty Dog as an example, not that they haven’t earned their reputation and budget, what if they spent all the money they get making a new game franchise instead of remastering a game that was already a showpiece that didn’t sell as well as the original run? A lot of cash is also wasted on projects that never get released. There also doesn’t seem to be any real discipline in development anymore. The attitude seems to be: don’t worry, if we miss the deadline we’ll just ask for more time and money. They see deadlines as suggestions nowadays. These fallen profits are gonna cost a few executives and studio heads a few jobs.","If I look at all my PS4 titles, none of them have a sequel yet. They’re all still the most recent release in the series. And they’re minimum 3 years old. One of them is 13 years old. I’ll let you guess.","I bought a ps5 for the expected KOTOR remake.Guess what was cancelled lol","The need to make sure games get released. There hasn’t been a good title in months.","I played RDR2 and Arkham knight where there was only 1 loading screen- when you turned it on. In Baldur’s Gate 3 so many loading screens. The game is good, I’m enjoying it, but I feel like it’s a step back.","I just stopped buying systems and games. Life is so much better with out it and I save a lot of money","Those assh*les took forever to normalize stock, made it near impossible to get one for several years (despite showering social media morons with free units for god knows what - they had very few on stock). Then became news for screwing people over in their psn accounts and are now in surprised pikachu mode? That's rich","With the new CEO starting soon and the mass layoffs across the PlayStation and their studios that's planned to begin in the second half of the year, we should see some course correction. It's a shame that the PS5 was so mishandled and became the remaster era for PlayStation.With the VR2 that absolutely haemorrhaged money and was an epic failure in Sony's opinion, something needs to be done drastically.","“We should charge a micro transaction every time they press a button. It would be so tiny that they won’t care.” - actual idea brought up in corporate","Games were 60 bucks back in the day and that wasnt worth it. What made them think lowering quality, duration and a million other things while making everything more expensive, is gonna work?","My biggest problem with the console is their tiered gaming subscriptions. Why do I have to pay $130+ per year to play some old games that won’t even include DLC.","Their software issues are more nuanced than that. Why would I buy a game for 100$ at launch when I can wait three months, have all the bugs patched and buy it for 60$. Additionally covid really screwed with their software launch cycles, it’s hard to remember which titles to double back for when there’s no content and then 5 titles drop at the same time."],"points":497},{"text":["North Korean hackers use AI to up their game | Cyber criminals backed by Pyongyang turn to artificial intelligence to plan increasingly sophisticated scams","Disconnect the from the internet!!!!"],"points":1},{"text":["Wyze cameras let some owners see into a stranger’s home — again","this is your sign, throw them away","Jokes on you, that’s my kink.","Why on Earth do people put cameras inside their homes? Outside, I can understand. Inside just boggles my mind unless it is a one off thing like needing a baby monitor or your roommate keeps stealing your stuff. But otherwise, you're at the mercy of hackers, data leaks, software malfunctions, or the company just plain retaining your private video and using it however they like, including sharing it with law enforcement without a warrant.I think that trend of putting cameras everywhere is gross and may eventually come back to bite people as civil liberties erode and the political climate evolves.","Everyone should own a pellet gun. Problem solved","Relax, it was only a thumbnail…. 😂"],"points":67},{"text":["I printed chocolate on a 3D printer and ate it","What did the 3D printer taste like?","Guess what comes next? 💩","I saw people do this with a MakerBot in 2010. How is this news?","Truly riveting journalism","Hope the industrial chemicals had worked their way out first.","This is one of the dumbest products I’ve ever seen.","Good for you?","How do I get interviewed? I ate some chips a few minutes ago, but if I’m being honest, I wish they were Cheez-Its. Follow me for more food updates!","I pooped into the toilet and flushed it.","Awesome. Wow"],"points":109},{"text":["Amazon and SpaceX are quietly trying to demolish national labor law | TechCrunch","Don’t forget Trader Joe’s. They’re also involved in this. Scum companies.","We need a national strike week.","I was just reached by Amazon for a product role. I’m declining to interview after hearing these news. Screw it.","so you can be forced to work 18 hour shifts and no overtime pay and you have no legal recourse. there is no desirable reason they want this. it’s strictly to enslave you.","By that you mean having the subtlety of the Pinkertons in just how much they disdain unions.","Amazon is such a dystopian place to work. Like imagine your life’s purpose is to pack shit for people too lazy to go to the store.","They need more poor folk to work","And Trader Joe’s","Quietly? I feel like I’ve seen a ton of headlines on it lately. If this is quiet.","Not sure how this qualifies as “quietly”They’re openly, publicly doing this. What more would qualify as loudly? Spend 10 million producing an Amazon Prime commercial slandering labor laws that airs during Season 4 of The Boys?","We should be sounding the alarm. These companies have enough money to lobby against unions and fair labor laws. And our representatives are easily up for sale with legal bribing (lobbying).","They will bribe enough people to get it.","No wonder Mississippi government is being so welcoming to a new Amazon data center.","Well this really hurts the argument, “We don’t need unions because we have national labor laws.” I guess we’re starting to go backwards in society.","Well, time for the torches and pitchforks. I mean, it’s well past that time, especially for those two men.","Not a single word in this article has anything to do with technology. This is a politics piece.","They’re marching us towards the end stages of neofeudalismbut people are worried about either getting the new apple vision pro or affording rent/groceries…so I’d say it’s all marching according to plan","Protest by not having kids. A surplus of people desperate for a job makes it easier for them to treat people poorly.","They should read a book pretty sure the last time shit like this happened they ended up just chopping factory owners heads off.","Seems like the results of these types of labor practices are some of the defining characteristics of countries the US vehemently claims to be better than","Sounds about rightDeliver for Amazon and legit haven't taken day off of work in almost 40 days (I have to work multiple jobs to keep my head even slightly above water)","I hate how people pretend to care about Amazon workers but still use the word Amazon synonymously with buying stuff online. Idgaf how much money I could to save on trinkets, that man is not getting any of my money. Btw, there’s cheaper places to get stuff online, AND better streaming services. No fucking excuse to contribute to this exploitation of workers.","Yep while we are all distracted by the shit show the elite class was happy to conjure up to keep us all at each other’s throats they are quietly trying to turn us all into a permanent slave class where we don’t own anything and everything thing in our life is a subscription and if you can’t pay you die and are ground into fertilizer.","PLease stop using Amazon. I stopped in like 2009, it's really easy, you can survive. Other places are cheaper a lot of the time too, Amazon is absolutely not as cheap as you think it is.","I shop at Whole Food, but converting to Farmers Market Shopper.","I’m doing my part by canceling Prime after 10 years. It’s basically a flea market now filled with counterfeit products.","\"We wont go quietly, the Legion can count on that.\"","My conscience has finally won over convenience. I just canceled my Blink subscription as well as my Prime membership.","how is this quiet in anyway ? I guess if you live under a rock?","Their companies should be abolished and made public services","It’s in their best interest. The companies are just algorithms. Until we repeal citizens United it’ll keep happening. Going after the corporations doesn’t work. We need to go after the politicians creating the environment for it to happen.","Quietly??","Your first question should be why are their special federal laws for one group of people.","Quietly?","Oh hey parents, don't mind your 10 year old working a 30 hour work week during school week also? Right? It's Amazon, perfectly safe!","So when will Starbucks going to join?","Whaaaaaaaat?","I'm sure that older companies like McDonald's or Walmart are for national labor law.","You know anytime the keyword “quietly” is in the title it’s 100% bullshit.","Big company, Tiny coc* Energy.","I’d never work for either of these companies, doesn’t matter how much they would pay me.","Good. It’s a total racket.","And with the Supreme Court being as partisan as it is, they WILL demolish it. It is all but inevitable at this point, the only question is how long it will take to work its way through the court system.","Amazon and Trader Joe, yes, maliciously. SpaceX, not maliciously.","So why aren’t they treated like criminals?","Hope this blows up in their faces;Ooh let’s poke the bear until it throws the judicial book at us","For loud values of \"quietly\".https://www.reuters.com/technology/amazon-joins-companies-arguing-us-labor-board-is-unconstitutional-2024-02-16/","Don't push for coal wars era bullshit if you don't want what comes with it. The less I have to look forward to, the more I wish a motherfucker would.","Where’s good old Starbucks in all of this?","What's so quiet about it? This news made all the headlines this week.","Quietly? I’ve seen multiple stories from multiple outlets. They’re scared and it shows.","Trader Joe’s also!","There’s no quiet about it. They’re suing to dismantle the NLRB as being unconstitutional.","Sounds like these workers might wanna do something about that","And both run by super-rich assholes, coincidence?","Weird, that’s out of character/s","Societal Structures should be symbiotic instead they are always in opposition in an endless war model that is endless and useless in the end.N. S","Total scumfucks."],"points":703},{"text":["Dutch startup Monumental is using robots to lay bricks | TechCrunch","There's a video on Reddit that comes up every couple of years. It's about a minute of an expert bricklayer measuring out the perfect amount of grout, laying each brick perfectly straight in just the right way to have no waste, achieving the perfect distance in between bricks, at a quick clip. I haven't seen a video of this machine, but the work done in this photo looks like shit. I'm not saying that work like this cannot be automated, but we are not there yet."],"points":1}]