[{"text":["HP is in the rent-a-printer business now"],"points":0},{"text":["Earnings down? Keep your fancy GPU from gathering dust. Download Salad, start chopping, and earn up to $200 per month."],"points":0},{"text":["Barnacle proteins protect metals from corrosion in salt water The adhesive proteins stick to steel and form a complex with iron ions in the alloy, creating a protective coating"],"points":0},{"text":["Europe's largest 3D-printed building rises in just 140 hours","Loving the photoshopped landscaping and children playing outside.","“The Wave House’s interior is utilitarian and windowless”Ah yes, much like a dank cave","It will be really interesting if this or assembly line methods using semi traditional materials will help bring affordable homes to people.Unfortunately I assume regulations will be the largest hurdle.","140h is the benchy in draft mode on my Ender 3.","Can I have a house now please?","Can they print me a house? Australian homes are insanely expensive","Neat. Now do the seismic test.","Printed with what?","This feels like it should be used for building Universal Basic Housing but will end up being used for billionaires or something. No I didn’t read the article.","Worlds largest spool of printer filament still missing","Zordon?!","Looks like cake","Cool but also looks like shit","Looks better as a warehouse than a home.","This Texas Company3d prints houses AND more interesting projects like melting the dust on the moon to make stable landing pads and shelters.I do believe the home structure we watched on the video had rebar reinforcing and cutouts for plumbing, electrical etc.","I wonder what the acoustics are like"],"points":131},{"text":["UCLA and Equatic to build world’s largest ocean-based plant for carbon removal. The $20 million system in Singapore will be capable of removing 3,650 metric tons of CO2 per year.","What is 3kt of CO2 equivalent to? How many mature trees are needed to do the same removal? How many typical US households does that 3kt equate to?Article doesn’t contextualise the amount well enough.","Every commenter with the obligatory “bUt It’S nOt EnOuGh” comment that follows every post like this need to realize that the purpose is research. They’re learning how to improve scaling of carbon removal, and at 3.6 kt that’s already an improvement over previous plants.The idea that you would trash a university’s research because that’s not you would spend the money is ridiculous. They can spend the money researching dildos, and all of you can fuck off","[deleted]","How many Taylor Swifts is that equivalent to?","I for one hope things goes well for this tech. Every avenue we can explore to get the CO2 out of the ocean and atmosphere is worth a look.","So we need to run that thing for 547945 years to remove one part per million. We are currently 61 ppm over the 350 ppm threshold. so that means we need to run that thing ultimately for 33424645 years to get back to normal. Assuming we don’t release anymore carbon dioxide into the atmosphere.","So 793 cars worth of CO2","$20 million only? That's chump change compared to the extinction of us.. wtf are we even doing? There should be 100s of these.","I'm doing my part! I've planted some 40 trees and shrubs in my yard. Most of them live.","Cool only 365000000000000000000000000000000000000 more tons to go","Make all “carbon offset” monies go towards funding these",".04% is now. What exactly is the goal???","At this rate they would need 9,250,000 of these facilities to deal with the CO2 produced in 2022 which based on their figures would cost $185,000,000,000,000 my math may be wrong please correct me if possible. This is a grift/feel good story and I believe they know this","For context a small flare destroying methane from landfill gas can reduce about 3,600 tons in 3months and the cost is closer to $200k.","Do they recycle the co2 into other products or industry’s that use it?","15 TRILLION tons of co2 per year goes into the atmosphere","Why Singapore? Why not right here? Is there something about the geographical location or just cuz?","While using how much power from what sources? How long of a carbon return on the materials and processes needed to construct the plant? These are the questions I never see...","Wow I thought with all the oil and gas propaganda claiming they are building such projects that it had already been done . ( by oil and gas of course)","Is that a lot?","This article doesn't really say very much. For example what happens to the CO2 that gets captured?","They are trying to suffocate the trees!!!! Jk, but you know someone will buy into it.","Once again we see scientists doing a dance around the fact that carbon capture makes absolutely no economic or energetic sense. How is process any different from sequestering seashells, eg oysters or clams? This work is already being done by legions of animals, why not simply harness a natural process?","Sorry T stands for trillions I’ll make that clear","To be completely honest, I’ve grown less excited about decarbonization technology that isn’t a solution to the real problem - which is scale.The tech is cool, but it’s ultimately a paper napkin idea until you can prove you can offset truly significant numbers at truly meager cost.I want to see a decarbonization technology that solves the problem of scale - that will be the one that gets adopted, and the one that deserves hype","Absolute waste of time, money and effort.","It’s amazing to me. This plant is 20 million, I understand it’s not doing a lot of c02 removal, but compared to the trillions of dollars already spent fighting increasingly radical weather why hasn’t any government looked at investing in more of these? Why haven’t these been considered as an approach to fighting climate change at scale?","Yo, trees?!","Call me a pessimist it I’m willing to bet this isn’t even close to carbon negative. The article and site don’t go into the numbers. I bet this experiment produces atmospheric carbon. Do t get me wrong, we should keep trying but we need to recognize scaling up experiments that are not net negative are doing harm.","CO2 is not a pollutant. It is literally PLANT FOOD.The NetZero scheme is a crime against humanity."],"points":132}]