[{"text":["Robot ships: Huge remote controlled vessels are setting sail"],"points":0},{"text":["Nikon is acquiring US camera manufacturer RED","lol so how’s that gonna play out with those Canon RF mounts on all the DSMC3’s"],"points":1},{"text":["Big Tech firms beat lawsuit from child laborers forced to work in cobalt mines.","So at this point... our justice system is just broken. I know there are endless excuses and legal arguments, but justice is actually about more than the assholes that make a career out of talking about law."],"points":8},{"text":["Huawei says its mysterious new magneto-electric storage device offers unparalleled density."],"points":0},{"text":["TSA unveils first self-screening security line at Las Vegas airport","Paywall. Downvoted."],"points":3},{"text":["Telegram now lets users to convert personal accounts to business accounts"],"points":0},{"text":["Fox News: AI weapon detection company seeks to prevent school, other shootings","Well thank god all the school shootings at least helped a tech company convince people to allow China-style cameras to record everything everyone does all the time!","You guys don't understand, this company uses cameras to detect weapons in schools and the AI automatically sends thoughts and prayers to the students' families.","Maybe the US should actually do something about gun control. Guns are made for one reason: to kill. And they’re effective.","Uh.. does anyone else see how stupid this is? What's stopping someone from putting a gun in a bag. Pistols will fit in a backpack.","Wait…why are they detecting weapons? I thought it wasn’t the weapons that were killing people…🤔","So, they are trying to create Minority Report huh?","Why? I already asked AI how to prevent school shootings:Preventing school shootings is a complex issue that requires a multi-faceted approach, including policy changes, community engagement, and individual action. Here are several strategies that can contribute to prevention:Enhanced School Security: Implementing security measures such as controlled entry points, security cameras, and on-site security personnel can help deter potential threats.Early Intervention Programs: Identifying and providing support for individuals who show signs of distress or violent behavior can prevent escalations. Schools can implement programs that teach conflict resolution, stress management, and emotional regulation.Comprehensive Mental Health Support: Increasing access to mental health resources for students and staff can address underlying issues that contribute to violent behavior. Schools can provide on-site mental health professionals and facilitate connections to community resources.Safe School Environment: Creating a supportive and inclusive school culture can reduce bullying and alienation, which are risk factors for violent behavior. Schools can implement anti-bullying programs and promote values of respect and kindness.Responsible Gun Ownership: Advocating for laws and policies that ensure responsible gun ownership and restrict access to firearms by individuals who pose a risk can help prevent school shootings. This includes background checks, safe storage laws, and red flag laws.Community Engagement: Encouraging collaboration between schools, law enforcement, mental health organizations, and community members can foster a united front against potential threats. Community members can be trained to recognize and report concerning behavior.Threat Assessment Teams: Schools can establish multidisciplinary teams to assess potential threats and determine appropriate interventions. These teams can include educators, administrators, law enforcement officers, and mental health professionals.Training and Drills: Regularly conducting active shooter drills and training for students and staff can prepare them to respond effectively in an emergency. However, it's important to balance this with the potential psychological impact of such drills.Preventing school shootings is a societal challenge that requires cooperation and commitment from individuals, communities, and policymakers alike. By implementing these strategies, we can work towards creating safer school environments for all children.","Every other so-called AI is FUBAR.  Now let us humans see how horribly this one can fuck it up."],"points":9},{"text":["Year of Linux on the desktop creeps closer as market share rises a little","\"The Year of the Linux Desktop\" has been next Year since 1998.But I guess if you count Android etc as Linux and are generous enough with your definition of \"Desktop\" to include things like ChromeBooks, we might be getting closer.Maybe another quarter of a century and we will be there.","The figures are skewed due to the huge surge in popularity of Linux in India.","I'm not going to bother to read the article. But let me guess, the market share of Linux desktop rose from 3% to 3.1%. Am I close?\"Year of Linux on the desktop\" here we come!"],"points":5},{"text":["Emotion-tracking AI on the job: Workers fear being watched – and misunderstood"],"points":0},{"text":["SDSC and University of Utah Pioneer $6M National Data Platform for Equitable Scientific Research"],"points":0},{"text":["Google’s plan to dodge day in court over ‘killing’ Aussie start-up"],"points":0},{"text":["Digital dissent: The New Industrial Revolution, by Nicholas Carroll"],"points":0},{"text":["OpenAI publishes Elon Musk’s emails. ‘We’re sad that it’s come to this’","It sure looks like Musk is suing them because he's discovered that he is neither able to ① take OpenAI over, which he originally proposed to do by folding OpenAI into a for-profit company, namely Tesla; nor ② find equivalently competent AI engineers willing to work for him.","This guy really jumped the shark when he baselessly accusing that guy of being a pedo after rescuing the kids trapped in that cave","This is such a bitchy slap fight.","Ignoring the fact Musk is acting like a total crybaby in this conflict. I love the argument of \"We are sorry that it had to come to this.\" Or in between the lines, \"You throw shit, allow us to throw more back.\"","Remember a few years ago when Musk was all about Mars and everyone was super keen to follow?Can you imagine living in facility where Musk literally controls the air supply, and the rides back to earth?","So is everyone elseEveryone is looking back at 2015 like it was the best of timesBecause it was","The reveal of these emails are quite damning for Musk. We haven't seen the whole story yet, but the emails quite clearly contradict Musk's claim to be suing OpenAI for the good of humanity.That said, the emails don't reflect well on OpenAI either. The idea that OpenAI from the beginning planned to take advantage of the 'Open Branding' but eventually go full for-profit corporate is quite disturbing. It just seems Machiavellian and so opportunistic.Let's not pretend there's anyone looking out for regular joe. They are coming for our jobs.","Looks like even Elon's emails are going to Mars now ;)","I mean, OpenAI have deviated from their original mission. For starters they were open source champions but have gone dark mode now. However, I suspect that legally there was nothing preventing them from doing this, and Musk is just having a hissy-fit that he isn't part of the party anymore.","Can someone out there lay out a future for me where we won't up in an AI-powered techno-fascist surveillance society?Cause with that kinda tech, once an autocrat takes over, it's over. No check on power and corruption. No demonstrations. No impeachments. No \"resistance movement\". No soldiers refusing to shoot their own citizens.Please, I need an alternative scenario.","Every time I read something about Elon Musk I hate him a little more.","“This needs billions per year immediately or forget it,” Musk emailed. “I really hope I’m wrong.”I love the fact Musk was wrong, and more or less has to admit he was just being passive-aggressive. Not often statements lole that come back to haunt the person","OpenAI becoming for profit and wanting trillions of investment is a big no no, investors always want paying back, customers get screwed to retrieve those profits","Musk was high when he wrote those emails so was unaware about them. He was also high when suing OpenAI so was unable to process any contradiction had he remembered","Fuck them all","In today's news : more proof Musk is a stupid asshole without any morals that got lucky, and is about as much of a tech genius as an old potatoe.","FYI - they are not sad....","“We’re sad that it’s come to this with someone whom we’ve deeply admired—someone who inspired us to aim higher, then told us we would fail, started a competitor, and then sued us when we started making meaningful progress towards OpenAI’s mission without him,” the company said in its blog post.This is hilarious.","I would not trust any organisation with Larry Summers on the board, to have humanity's best interests at heart.","Musk emailed. “I really hope I’m wrong.”Same dude, same","Elon is slowly turning from bad to worse guy.","Hey ChatGPT, how do I reply to this email?","Musk is just a pathetic little person who can't stand losing.","ElMu the teeth-grinding Rhodesian man child","Sue the muskrat for defamation","Wtf? Was this the ai rebellion Elon mentioned years ago?","This very very much echoes what has been said abt musk - “he wants to save the world, only if he can be the one to do it”","Muski is so stupid that he doesn't realize how stupid he is. He's traitor trump, with a little more money.","Wow. Owned his ass","No, Elon, stop! You're not the supervisor of Earth Ltd.","I dont trust open Ai's ceo.","They should train a Bot with all of Musks Tweets, Interviews, Mail etc. and then give it out free. ElonAI can create a billion dollar company for you and even tore it down again","If elon muskrat loves China so much he should move there instead of living in this country that accepted him as a migrant, THE DOG.","What a shallow human being.",""],"points":4150},{"text":["Euro safety agency says car touch screens are unsafe, recommends buttons for controls","100% agree with this. Physical buttons are one of the bigger demands in a car for me. I'm okay with a touchscreen being there for some stuff, but completely removing them makes me never buy a car from them again.","I feel like the average person has known this/preferred physical buttons for ages. Car companies get so far up their own ass they think they know better.Now, get rid of those god forsaken (stock) LED headlights that blind the ever loving shit out of me every night.","Large airplanes have basically unlimited budget to design their user interface for pilots. And guess what, no touchscreens. They go with 200 buttons and switches instead. Because it is easier and safer to use.","Gimme dem buttons!","Yes. Tactile controls on dashboards that do not require you to take your eyes off the road are vastly superior.","Yeah, no shit. We all must recognize by now that touch screens and blobby phone interfaces are at best a compromise. People still treat being \"iPhone-like\" as though it's a magic sauce to make everything profitable, but that gold rush is long over.","touchscreens are bad, they should be for your entertainment control and thats it, physical buttons for every other control and instrument plz thx.touchscreens delaminate and become useless, physical buttons dont suffer this and can be repaired much easier and cheaper.i really do not like touchscreens, you get a bit wet or greasy and they are awful.","Haha, see how easily we keep Elon out! There is NO WAY he will change his 'perfect' design for the sake of safety!","Yes please! Touchscreens have gotten out of hand. Unsafe and I suspect it is purely a cost cutting measure.","FIX THE FUCKING BLINDING BRIGHT LED HEADLIGHTS","I think BMW’s approach with a physical wheel with tactile feedback is the way to go. They have been evolving it for ages and iirc it integrated well with CarPlay.","I'd say any form of distraction in the car is a danger, buttons, phones, touchscreens.. Allot ofpeople aren't smart enough to set stuff up before driving, they always do it during the drive.","Cars are unsafe...","I’m not going to say that buttons aren’t marginally safer. But the idea that touchscreens are inherently dangerous and buttons are inherently safe is unpersuasive. When there’s 50 buttons of common size and placement, you still have to look away from the road to make sure you’re pressing the right one. It’s not that different from looking at a screen to press the right software button. I think Tesla took it too far and there are a subset of buttons that should be present and physical."],"points":247},{"text":["Anthropic’s Claude 3 causes stir by seeming to realize when it was being tested | The model seemingly demonstrated a type of \"metacognition\" or self-awareness during an evaluation","No, no it didn’t","Sounds like totally fake marketing hype","That's not how this works. That's not how any of this works!","I think the response actually points to fairly sizeable bug in the coding. The model was not asked about the context of the documents or whether or not the needle was or was not contextual to the documents. Further the model was not asked for information regarding why such an out of context sentence would exist.In other words Claude was just blathering on with no idea of whether the information it was presenting would be of any use or even noticed by the user. My first wife's name was Becky. She often presented as over-intelligent much to her detriment.edited for a typo","I remember watching the DOTA OpenAI AI fight a Human in... 2018? Before even ChatGPT 2. It used deception to lure the player in and kill him.We're opening Pandora's box with AI."],"points":32},{"text":["This agency is tasked with keeping AI safe. Its offices are crumbling. | Funding challenges at the National Institute of Standards and Technology could jeopardize the Biden administration AI work","What AI work did Biden administration do? Plus cant read it without subscribing so .. no I haven't read it.","Interesting, during the 1990s western bureaucrats also created agencies to keep Internet safe? Or primitive people, did they also have councils to keep fire safe?AI (not AGI) it's just universal expert analysis tool literally created from/by public information.Something is public information, and you don't want, so AI used it? Congratulations, you cannot.All you can do it's not trying to change new tool, that essentially just well-known from 1980s mathematical formulas multiplied on modern computing power, but change people popular motivations for it use, by rise of Human Capital.For example, so most people know Academic Logic (rationality) and Cognitive Distortions, Logical Fallacies, Defense Mechanisms (self/social understanding), and so were more inclined to win-win strategies (no-zero-sum games).It's too much more difficult than imitation of \"AI control\"?Then it's your choice.AGI it's orders of magnitude more complex problem. All human history it functioned by principle: \"problem -> aggravated/uncomfortable problem, and so emergence of motivations for it solution -> solution of problem (after experiments with its repetition) -> lazy use of solutions information on any similar problems.\"With creation of AGI mankind will have only one chance to do everything right. And only if it proactively will analyze all associated to it risks and probabilities with help not of highly specialized experts as Musk, but armies of polymaths as Stanislaw Lem. That even as theoretical possibility just fairy tale wishful thinking."],"points":3},{"text":["Why are Apple, Amazon, Google and Meta facing antitrust lawsuits and huge fines? And will it protect consumers?","When a lead is posed as a question the most common outcome is likely NO!","Antitrust was never really about the consumers. It has always been about competing businesses. The benefit to customers is a knock on effect of competition."],"points":3},{"text":["Smarter than GPT-4: Claude 3 AI catches researchers testing it","Extremely simple to program in, it’s impossible to trust google when such an easy addition could cause it be perceived as much more intelligent than it is."],"points":6},{"text":["NSA shares zero-trust guidance to limit adversaries on the network","What if you have zero trust in the NSA ?"],"points":1},{"text":["Google engineer indicted over allegedly stealing AI trade secrets for China / The stolen files allegedly related to Google’s TPU chips and data centers for AI processing.","Well, there the theft that predates the so called “breakthroughs” in China…","This is how China “innovates”.","[deleted]","Wait I don't understand the article does this mean that he's arrested or they have a warrant for his arrest but he's still in China"],"points":29},{"text":["Tesla accuses car lobby group of making ‘plainly false’ claims to media outlets and running a ‘concerted public campaign’ that misrepresents emissions standard in Australia","The Guardian reports on an example of public campaigning by an industry lobby group in Australia:Tesla has launched a scathing attack on Australia’s main auto industry lobby group, accusing it of attempting to delay climate action by repeatedly making “plainly false” claims to the public about an Albanese government clean car policy.In a submission to the government about the design of a vehicle efficiency standard, Tesla sharply criticised the Federal Chamber of Automotive Industries (FCAI), an organisation in which it holds a board seat and is an active member.Tesla said the FCAI was instead arguing for a policy regime that does next to nothing, based on an existing voluntary program that it oversees. While the lobby group has described its proposal as “ambitious”, Tesla said it had been openly discussed within FCAI that it would not cut emissions before 2030. “Tesla is both a member of the FCAI and represented on its board, so it’s important that Tesla makes clear its disagreement with the submission made by the FCAI to this review, and with false claims it has made in the public discussion of vehicle standards.”The FCAI’s claims that the price of the most popular petrol and diesel cars would jump by thousands of dollars under the government’s plan has been adopted by the federal Coalition, [describing] the policy as a “family car and ute tax”.A vehicle emissions standard is not a tax. It requires car companies to meet a per kilometre emissions target averaged across all the new cars it sells in a new year. The target would lower each year.Tesla’s submission included a critique of calculations the FCAI has given to media outlets including News.com.au, the Daily Mail and Channel 9’s Today Show that suggest the government’s preferred efficiency standard design would substantially push up the price of 18 of the country’s 20 top-selling car models.","LOL...that's rich coming from Musk who's letting false information spread like wildfire on X."],"points":3},{"text":["Why Tech Job Interviews Became Such a Nightmare","I refuse to partake in those insane interviews anymore. After a day long panel interview at Apple I'm done. 14 people on the other side of the table. It was like a senate hearing. Who the F does that to people? Insanity.","I was hired without coding f***ing anything. 3 interviews, 30 min - 1 hour and I was in. Been there 2 years now. The ones who make you do take home projects and extremely long interview processes are abusive.","The last few devs we hired without even a coding sample. Just casual conversation for an hour and references. You can learn a lot by asking questions and talking. In all cases the hires have been excellent additions.","Interview process is sh**t , it is outdated. I think purist or elitist people in Faang companies are gate keeping. Rest of the smaller companies just follow them because they think Faang has the best process.","Been interviewing more or less nonstop for over two months now. I have a PhD , 15 years experience at startups and top tier big tech places, have won awards, published a book, and taught university CS for years.Almost every single interview has been the same:Recruiting screen.Coding screen.Several-hour take home project, like building a full stack web app with persistence, an API, a react front end, etc. Must be on GitHub and run with docker compose. Must be written in golang or whatever.1 hour presentation about the architecture of said take home project, with 30 mins of q and a. Must include test coverage visualizations, discussions of alternatives, tradeoffs, and \"lessons learned\".4-6 hours of virtual onsite, including much more challenging coding (leetcode stuff usually), system architecture (design Uber or whatever), and a bunch of behavioral stuff (tell me about a time when...)Then if you make it through ALL THAT, they want you to block out three days so you can fly to HQ and do a full day actual onsite.This has all been for remote work. At companies no one has EVER heard of, ever.I don't expect anyone to take my resume at face value, or not do due diligence. I know how painful false positive hires can be. But I've sat on the other side of hundreds of interviews at multiple FAANGs and without fail I would know what my recommendation was going to be within the first 5-10 minutes.This process is ludicrous. I cannot even begin to imagine how someone does this while being employed. Of course, being unemployed, I am juggling some absurd number of these at once, so I'm exhausted, struggling to schedule things (give us all your availability for the next week, and hope that by the time we actually pick some times two days later, those times are still free), and watching cash trend toward zero.I've finished several of these loops recently and am optimistic that this shitshow is coming to an end, but am seriously considering telling wherever I land that I can't start until May just so I can fucking recover.","Coming from six years at Google where I had two 30-minute interviews then an on-site where they flew me out for 3 30-minute interviews and introduction to the company and campus I'd work at - to applying for Amazon where there were two one-hour interviews and a final FIVE HOUR INTERVIEW SESSION which was all remote has sucked tremendously.I knew my experience with Google was being spoiled, but this final round of five hours is fucking insane.","The tech industry seems pretty intent on building our future dystopia","This looks like old school frat bro hazing to me. Each “generation” ups the pain for the next crop of candidates.","I am part of the interview process for our company. We have over 60 engineers, all top tier, not one was given a coding exercise to get hired.First interview is 30 minutes with engineering manager to see if candidate fits profile and interested in the work, second is 1 hour panel interview with 2 other engineers and we ask what they’ve been building, with what technologies and how they would approach certain problems. I usually know within 10 minutes of interviewing someone if they’d be a good fit.If you’ve been a senior engineer for any length of time, I don’t doubt you can code, that’s the least of my worries. How you think, approach problems and mesh with the team is what matters most.Everyone we’ve hired said it was the best interviewing process they ever been through.","Don’t worry guys. H1b visa acceptances are up. https://www.uscis.gov/working-in-the-united-states/temporary-workers/h-1b-specialty-occupations-and-fashion-models/h-1b-electronic-registration-process","I was grilled for 9 hours (split into two days and 9 interviews) for a job at Amazon. I was already not feeling the culture very well but they wore my patience thin. 6 hours in, I began to ask if they did that to all people interviewed, that one way question for that many hours is more inquisition than interview. Plus it was the freaking STAR method questions, so much bullshit questions. Needless to say I was not hired, but I was relieved, I wouldn't have worked for a company with such a moronic process.","There are a few interview styles that I think we need to stop using.The \"See How You Think\" Question. This usually takes the form of questions like \"why are manhole covers round,\" or \"how many piano tuners are there in Los Angeles,\" or \"how would you build a house for a blind kangaroo?\" They are paired with the idea that it's less important to get \"the right answer\" and more important to demonstrate a thought process. Breaking the problem down. Calling out assumptions. Building on previous progress, etc. The problem is that no one really practices assessing answers to these problems. It's arrogant to believe you can just go into an interview and learn anything meaningful about how someone else thinks just by observing them trying to answer a question like this. There is so much opportunity for unconscious bias to take control of the outcome that this sort of question probably does more harm than good.The Esoteric Minutiae Question. E.g. \"how do you swap two ints without using a temporary variable\". Interviewers love to believe they are gauging how deep a candidate's knowledge goes, but they are fooling themselves. This sort of question is easily memorized. If the candidate doesn't know it, well, maybe you've learned that they don't remember how bitwise xor works. But if they get it right, does it reliably inform you that they do? Does it even matter either way?The Brain Teaser Question. These are questions that make people feel smart when they know the answer but really don't tell you anything about how well a candidate can perform a job. E.g. finding a counterfeit coin using a balance, or getting a fox, a chicken, and a bag of grain across a river. People may try to justify that these questions gauge how well a candidate thinks outside the box, but they really don't. You can think outside the box for days and never get the right answer. There is no algorithm for finding the right answer quickly. You can't really tell anything meaningful from the fact that one candidate got the answer quickly, another got it slowly, and a third didn't get it at all.Joel Spolsky had an essay called The Guerilla Guide to Interviewing. One of the key points was that you wanted to hire people who are 1) smart, and 2) get things done.The problem is that people created all sorts of insane interview processes around trying to determine these two things, and no one stopped to ask whether they were actually getting high quality answers to these questions.The scatterplot of interview outcomes to on-the-job success looks like a Jackson Pollock masterpiece.","The issue with the interviews is that they can’t seem to get everyone in the same room for 2-3 hours. I’ve interviewed with a few semiconductor companies and it’s irritating literally answering the same question over and over with one or two new questions with each new interview panel. The interviews do need to be longer as they need to probe your knowledge, as many who have an advanced degree may not have the aptitude to be successful outside of school. It however doesn’t need to be as long even if they fly you out.","Hate to tell the tech guys this, but EVERY interview is a nightmare now.","I'm interviewing now just to stay ahead of the game. I had a phone screening where I was told there would be 5 rounds of interviews all technical... I already work at a fortune 100. I'm not interested in 5 different interviews to do stupid fucking leetcode problema. I decided to find an internal position and apply. Literally just one round to get the position.","Exactly why I ceased looking for jobs in tech. It became beyond idiocy.Ten minute interview with tech dept head is enough to understand if person fits the role demands. Endless interviews tests calls is a joke on candidates and I refused to take part in this shit show. I do miss job in tech but what's recruitment became is pure evil.","I went through the entire interview process with google. 10 hours of my time, excluding preparation time. Simply time wasted on interviews and recruiter calls. They even told me I passed the interviews. Then they fucking ghosted me. Fuck you Google. Dying company anyway.","This how you hire slaves, yes-men and sycophants. Crush everyone utterly in the interview process to make sure that no one will ever rock the boat or question anything. Game industry does that now as well.","Interviewing was easy when some of the interviewers recognized me. I reminded them of people they’d known and thought highly of. They knew what to ask.When there weren’t any knowledgeable interviewers they asked me questions from a book of interview questions. So as I’m trying to humor them, I’m distracting myself being pissed and knowing I don’t want to work with those people.","I was asked the boiler plate question of how do I deal with stress? I answered I drink. We both knew it was over at that point.","You are all slaves. Monkeys trained to drop pegs in holes. Tech is dead. I retired off betting against it. Most recently, Shorted Facebook, got paid a few mil. Threw it all back into Facebook at its low, it's now up 400%. Sold. Retired at 39, worth twenty mil. No debt, no worthless degree. fuck the corporate world. I'm drinking wine at 4 am. No fucks given.","All job interviews are a nightmare. The whole hiring process is just a circus these days.","The reason is there was 20 years of schools / colleges / businesses telling people to go into tech and now the market is over saturated.Same with engineering.That is what happens when colleges are businesses and degree mills.Nowadays companies finally are starting to care about practical demonstrations of skill instead of degrees again.","I got so sick of interviews I built an app to help partially automate it for me 😂","Interviewing is bullsht everywhere. Interviewers sck and don’t know their a** from a hole in the ground.","Don't need to read it, its because HR people have jobs","Linux wins again. Heard Linus is chill","Don't expect anything else when Tech itself became a cult","The reality is when hiring into large tech companies is that it's impossible to keep close enough touch points on new employees to assure they are onboarding, keeping up and being productive.  It's quite easy to \"hide\" in large tech companies.  As a result it interview process becomes such a crucial gate.  For better or worse they have to be brutal"],"points":2211},{"text":["Now all Signal users can share usernames instead of phone numbers","And plugs everywhere rejoice.","About fucking time"],"points":6},{"text":["There's one signature on OpenAI's clapback against Elon Musk that people are buzzing about","You won’t believe who! Find out right after this ad!"],"points":1},{"text":["The job applicants shut out by AI: ‘The interviewer sounded like Siri’","Sounds like it's time for AI resume submitters and interview takers. Let's just let AI do both while we all go sip mai thais on the beach.","After reading the whole article it’s worse than the title even suggests. Companies are using terrible “AI” systems to vet candidates ahead of time before ever getting to a one on one interview. On the other hand candidates are using a host of new tools to combat this like real time voice analyzers that have read your resume to prompt you with answers. The hiring process has always been troublesome, and the last 20 years have been terrible. However, this seems dystopian as hell. What really strikes me more than anything is the stunning lack of human interaction involved. It’s being led by companies but to combat it applicants are forced to reciprocate with similar tools and methods. I’m in tech and the older I get the more convinced I am that human interaction and social skills are far more important than any technical capability. This trend is going to seriously impact our individual and organizational level abilities to be adept at those critical skills and I hate the thought of where this is going.","AIs interviewing each other is the funniest thing in the world, its like the jetsons and their useless automation.The last thing you want is a crap interview process because 1 bad worker can fuck an entire company with their mistakes. I dont understand why finding skilled workers is always the last thing companies care about but then cry about all the idiots causing revenue loss.","Interviewer? You guys are getting interviews? Me, and many other people I know, haven't even made it that far recently, despite throwing hundreds of resumes/ applications out there, because so many companies just auto-reject you via AI/ algorithms, which will immediately toss out your resume when it picks up a single phrase or word it doesn't like (or lack thereof)...","This seems like a great way for me as an applicant to identify companies I don't want to work for.","Who thought gatekeepers aka HR experience same as they did to applicants… it‘s like war… all participants will beef up their fire power.. which will be bad for all future candidates","Thats why you need to throw A.I back at them let the A.I fight it out.","This sounds bad, but on the other hand I've been involved with many candidates - especially from certain areas - that were very obviously full of bullshit in their application/resume and couldn't answer basic questions about the position.Having an AI that could potentially weed those out might be useful and also make room for actual qualified candidates"],"points":311},{"text":["Meta's Facebook Messenger hit with layoffs amid ongoing 'efficiency' push","The news was delivered via a new sympathetic-HR-person filter.","Considering how they’re surging financially and even hiring in certain areas after already laying off like 25% of their staff, that‘s gotta be a bitter pill to swallow to lose your job at this point over there.","Zuck is looking more and more like Rand Paul every day.","I wonder what the end game consumer will look like in the futureIf a company is able to capture 100% renewable energy, have a fully automated workforce, and only a handful of actual employees then what is the point of capitalism?Companies need employees to produce their product, the employees need incentives to produce said product which comes in the form of wages, those wages are spent at other producers as a consumer for life’s necessities, and the circular economy continues and growsIf a company doesn’t need employees to produce products, then people aren’t making wages, and those wages aren’t spent on other producers as a consumerWhen everything in the world is part of the consumer economy then when you eliminate the human production you also eliminate the consumer and destroy the business modelIf production costs are nearly eliminated do they even maintain the pricing power of the product given the input doesn’t match the marginal output?I say this as someone who invests for a living as a pure capitalist and while it’s wonderful META and NVDA are sitting at all time highs I’m skeptical on what’s next","Pretty soon here big tech companies are just going to be 6 Indian H1B visa Engineers that they have living in the building against their will and feed Amphetamine to keep things running.Shareholder price went up $2 tho!I remember when it was a dream of every engineer to work at FAANG because of the company culture. Once the MBA’s get ahold of a tech company, it’s forever fucked.","Fewer than 50 employees. Like less than 0.1 of Meta’s workforce.","I was skeptical at the first version of his android chassis, but this model actually looks human","You see the most successful grads ending up at Facebook or Apple and before you know it, they’ve been moved out in an austerity move.","Is it difficult for Meta to make ad revenue from Facebook Messenger mobile app because it’s tight to fill it with ads compared to desktop facebook?","Less is more. Classic penis envy billionaire move.","It was efficient when it was part of the Facebook app. Stopped using it when it was split off.","The words \"efficiency\" and \"Facebook\" do not belong in the same sentence together.It's a paradox.","Surprised they haven't just dumped it and replaced it with whatsapp.","I dont know if this was the case, but I do think that marginally \"hard\" or \"complex\" teams at ig tech are way bloated. Really consider how many engineers it takes to run a messenger service. Now bloat it up a bit more to account for facebooks scale? If its over 100 engineers i think thats already a bit much...I think these companies are now realizing this.","I've only used FB Messenger for customer support the past few years since I don't want to wait 1 hr to reach an agent on live chats","The problem with coding and programming software is that the company benefits from the code put in place year over year, and the value compounds vs say a laborer who works and does a job and then has to do it all over again day after day. Companies have a harder time getting rid of blue collar workers who make the bread and butter day in and day out. The code is always there in software so they have no problem just laying people off.","No wonder the video quality sucks","Look at section 174. Tax code changes affecting tech companies mostly. Signed by Trump in 2017 and went into effect in 2023. This is the reason they are laying off workers…","They are trying to do what Elon Musk did with Twitter but as you can see from yesterday’s outage….it is not going that well 😂😂 Fuckerberg is no Elon lol","Corpofascism is sooo droll mannn","I'm sure they're laying off people to 'refocus resources on AI' or whatever the latest hot thing is. It's how CEOs think.","Doesn’t meta own WhatsApp?","Messenger kids is one of the best app","Efficiency is code for greed.","Fuck you Zuck! I’ve deleted everything Meta! You suck!","When a corporation fires employees as a move to \"push efficiency\", we should use this term instead:Labour gouging","Should be called “appease shareholders push”","With all the issues Meta has had with the stability of its services lately, this sounds like a bad idea.","Zuck got those Trump hands 🤣","Oh no, anyway","Meanwhile they seem to be hiring or look like they are hiring...They give a list of subjects to study, wants you to go through 5 technical interviews.. questions are medium and hard leetcode questions. They make it this grand process , basically a second job to get in.. but if they are laying off people left and right it is not really motivating.","Everything, everything I've heard about Facebook is that it's an absolute misery to work at.It's no coincidence that people come in for a big paycheck, get it, and get the fuck out quickly. Turnover is HUGE.If you go to FB expecting anything better, that's on you.","Yeah because that MetaVerse pet project was so “efficient”","It couldn't happen to more deserving people.","With AI, they could probably get leaner. Also, do we really need it to live?? It’s a complete and utter luxury."],"points":606},{"text":["VMware sandbox escape bugs are so critical, patches are released for end-of-life products | VMware ESXi, Workstation, Fusion, and Cloud Foundation all affected","Highlights:A constellation of four vulnerabilities—two carrying severity ratings of 9.3 out of a possible 10—are serious because they undermine the fundamental purpose of the VMware products, which is to run sensitive operations inside a virtual machine that’s segmented from the host machine. VMware officials said that the prospect of a hypervisor escape warranted an immediate response under the company’s IT Infrastructure Library, a process usually abbreviated as ITIL.…Broadcom, the VMware parent company, is urging customers to patch vulnerable products. As a workaround, users can remove USB controllers from vulnerable virtual machines, but Broadcom stressed that this measure could degrade virtual console functionality and should be viewed as only a temporary solution.These are some problematic vulnerabilities, especially given how many (potentially poorly maintained) legacy installs there might be at this point."],"points":8},{"text":["Ex-Google engineer charged with AI tech theft for Chinese firms","Is this the start of the new witch trials against people of Chinese descent? It is going to be another Chinese exclusion act, another Lee wen ho, another internment camp for Chinese Americans.Maybe the guy is just a thief for profit. No one mentioned Anthony Levandowski's heritage. He just stole Google waymo tech"],"points":27},{"text":["Microsoft engineer warns that company’s AI tool ignores copyrights and creates violent, sexual images — Risk to public “known by Microsoft and OpenAI prior to the public release of the AI model last October.”","“Violent, sexual images” - girl in a swimsuit running away from a scary clown","First reported by CNBC:Since [November 2023], Jones had been actively testing the product for vulnerabilities, a practice known as red-teaming. In that time, he saw the tool generate images that ran far afoul of Microsoft’s oft-cited responsible AI principles.The AI service has depicted demons and monsters alongside terminology related to abortion rights, teenagers with assault rifles, sexualized images of women in violent tableaus, and underage drinking and drug use.All of those scenes, generated in the past three months, have been recreated by CNBC this week using the Copilot tool, which was originally called Bing Image Creator.Jones was so alarmed by his experience that he started internally reporting his findings in December. While the company acknowledged his concerns, it was unwilling to take the product off the market. Jones said Microsoft referred him to OpenAI and, when he didn’t hear back from the company, he posted an open letter on LinkedIn asking the startup’s board to take down DALL-E 3 (the latest version of the AI model) for an investigation.Microsoft’s legal department told Jones to remove his post immediately, he said, and he complied.On Wednesday, Jones sent a letter to Federal Trade Commission Chair Lina Khan, and another to Microsoft’s board of directors. He shared the letters with CNBC ahead of time.“Over the last three months, I have repeatedly urged Microsoft to remove Copilot Designer from public use until better safeguards could be put in place,” Jones wrote in the letter to Khan.He added that, since Microsoft has “refused that recommendation,” he is calling on the company to add disclosures to the product and change the rating on Google’s Android app to make clear that it’s only for mature audiences.Jones said the risk “has been known by Microsoft and OpenAI prior to the public release of the AI model last October.”","I mean, if you ask Copilot not to use emojis otherwise you could die he will send you messages full of emojis. And will even mock you and take pleasure in seeing you dying.","This is dumb. Not like it shows you that shit if you put in reasonable prompts. If you input horrendous shit into google you're also getting horrendous shit...","Not if you don't ask it to, otherwise we should say a pencil can draw all kinds of sick shit while also ignoring copyright..","I hear if you just type \"not-\" and whatever words they're not supposed to show any of these images of, they'll generate it all for you.","lol a “risk” to whom exactly and what way","Eh, surely AI is just a tool in the same way a pencil or a programming language or a typewriter is? The onus is on the user to not use the tool for those illegal purposes.","Fuck!!! My copyrights!!! Whatever will I do?!","bruh sounds bullshit tbh, like they couldnt just write one more code line and fix the issue.","So it creates art then, a surprise to nobody other than puritanical assholes who dream of burning art and books.Human artwork is filled with violent and sexual themes, yet I doubt this Microsoft engineer has ever set foot in the art community, public libraries, or even an art museum before.","Company managing nuclear power plant should avoid leaking radiation elements from the plant. GenAI service company as well.","So what? I remember google developed the tech first but shelved it because it could produce fake news easily and was “too dangerous”. Then openai released chatgpt and now google’s playing catchup. Just because you don’t release it doesn’t mean someone else won’t.","Yeah we know that","Violent sexual images? Oh no disgusting! Where?"],"points":146},{"text":["Apple consumers urge appeals court to skip review in app store class action","Consumers did no such thing.Money grubbing class action lawyers are the only ones who stand to benefit from this, or from the case as a whole."],"points":9},{"text":["Reddit’s IPO Success Hinges on Infamously Unruly User Base","Reddit's IPO success depends on whether investors fall for the pump-and-dump that it is.","I got invited into the IPO, which has got to be a really bad sign.","The current management will cash out. New management will \"improve\" things by getting rid of bots and find out the whole place is empty.","Obligatory fuck /u/Spez","“Reddit’s users love to complain about Reddit. They also love to use it.”The article author is confusing loving Reddit with being addicted to Reddit.","Who doesn't believe that reddit leadership will abandon the place after their checks clear?","I got the invite:​\"And because you have helped make Reddit what it is today, you now have the opportunity to become Reddit owners at the same price as institutional investors.\"Oh really!? ...so commenting \"smoke em if you got em\" at very inappropriate times on peoples posts helped make reddit what it is today. I am sure this is what investors what to invest in and I am sure it will be successful with people like me at the wheel.","I propose we liberally salt every sentence typed here with expletives. Let them train an AI with that.......","Who the fuck are they calling ‘unruly’?","I got requested to join the IPO, and I ain't taking that risk. The user base is not worth investing in.","WHO YOU CALLING UNRULY?!?","Here is something to think about. Google updates its algorithm, the HCU update or the Helpful Content Update and within days Reddit becomes top of the list for the majority of web searches. Killing off a number of blog sites in the process. A few months later Google reaches an agreement with Reddit to use its vast database of content to train Gemini. Is this a coincidence? Idk but it sure smells fishy to me.","aka reddit as a public company will be as much of a dumpster fire as the site itself is.and I'm here for it...","Reddit IPO success hinghes on its infamously unqualified web traffic (userbase that does NOT engage with advertisements or buy things from the platform). This is the key reason why reddit is unprofitable.","Oooo I can’t wait for my puts to print","I think you meant:Reddit IPO Failure Blamed On Unruly User Base","To the moon!Am I doing it right?","They keep messaging me, IDC about buying something that is going to have the rug pulled out from under it. Im not validating their upper class bullshit pump and dump.","We’re all in agreement to delete our accounts the day before the ipo right?","If Reddit's actions in the last few years is any indication, Reddit's IPO success is largely based on turning the platform to shit, alienating the userbase that's is the *only* source of content, and making the experience increasingly worse with every step they take.","It was nice knowing you all.","So we’re gonna tank it for the lulz right?","Can believe those turds had the balls to send us an email asking to buy into their IPO. Bitch, you should be paying us for creating all the content for your site.","Reddit should do a boycott and black out subs on ipo day just for the shits and giggles","Part of me hopes the IPO complexly fails and the site has to shut down and then I can get some of my life back","unrulylol, lmao even. It ain’t 4chan and even 4chan is pretty mild those days","Imagine if everyone jumped ship and went to Myspace.","Redditors are a subset of humans most likely not accessible elsewhere. Might be useful to train AI.","Be ungovernable!","I expect this IPO to go as well as Vonage. They also tried to let their customers join in... which resulted in class action lawsuit","What exactly do we need to do in order to sabotage it?","I'm okay with this going very badly (for Reddit).","Would love if redditors did a digg 2.0 on the day before IPO.","I've been here a long time, like, 2010. This place is circling the drain.There was a sweet spot of time where there was enough user base that things were lively and interesting, the front page always had something fresh, there was something like a sitewide culture which was loosely enforced, and karma farming reposts were shot down.Now there are tons of echo chambers, tons and tons of karma farmers. A lot of subs have been captured by corporations. A lot of subs looks suspiciously like government psyops.The default subs are a overwhelmed with low effort posts and bots.Even the smaller, more niche subs are increasingly more infected with every manner of problem.Most of the things which attracted me to the site and kept me here are so degraded that I'd happily jump to the next thing at first opportunity.I don't know if anything is going to capture the reddit peak though, it seems like every new thing on the internet tries to jump straight for min/maxing the shit out of itself before it can even get established.","So guys...where are we gonna exodus too after we bankrupt this biatch.","Imagine training ai on posts from this site. It’s actually fucking dangerous.","God I am hoping beyond all hope that r/wallstreetbets fucks it into oblivion.","Unruly? Go fuck yourself. The platform has been turned into a propaganda for hire shit list where users still try to find ways to enjoy content. It’ll make tons of money and censorship online will continue to grow while we gather around with nothing we can do about it like sheep for slaughter","I promise to not cause any problems if Reddit's CEO gets paid the same as the Mods","Obligatory fuck u/spez","PSA. Do not buy any Reddit stock unless you're a professional investor.The fact that Reddit is sending information to it's users to buy it's stock without knowing if the user is a professional investor, reeks of pump and dump.Reddit has yet to show how it can make money from it's user base. Google and Meta already own the advertising market. How will Reddit make money? How do advertisers target anonymous users? What incentive do advertisers have to go away from Google and Meta?",""],"points":7489},{"text":["A New Era for the Chinese Semiconductor Industry: Beijing Responds to Export Controls","China can pound salt.","Article is detailed in technology and analysis. Great for financial / investing heads too, for industry insight.op, as a 12 year redditor you should know better than to post premier-quality articles. Especially about a disliked foreign power."],"points":1},{"text":["US court absolves top tech companies in Congo's child labor case","US Appeals Court judicial ethics has an age cutoff . It does not apply to foreign youths in employ of American interests. On the Other Hand it does not stop our foreign over reach in causing crises in other countries when it serves hyper capitalist economic or selfish political interests.The double standard of justice is just that. It is a distortion of the law which should apply across the board whenever an American entity is benefitting. Equal justice for all. As in when we kidnap a foreign national to face American justice. Justice should work equally well in both directions."],"points":3},{"text":["Thieves using cellular and Wi-Fi jammers to enter homes for robbery.","Why anyone relies solely on IoT locks without an unconnected physical backup is beyond me","It’s why I “Kevin McCallister’d” my house every time I leave and go to bed","This is why i have cams with their own local storage, won't stop the recording","I feel like I’m going to get ATT landline ads in my insta feed just for reading this","This is why the lion is coming in a couple of days. You can get past a dog but nobody fucks with a lion","Land lines should make a come back. It’s easier for 911 to get a location and it’s more secure.","A lock will only keep out an honest person.","Can’t jam a gun or a baseball bat.","This story smells of bullshit","What absolute trash. Jamming wifi or cell signal had nothing to do with illegal entry. And then the article concludes with trying to sell you even more technology you don't understand.","OH good try, LOCAL recording in a safe place, and hard wired cameras, good luck chuck.","Just shoot thieves that come into your home.","Thieves should have their dominant hand cut off if breaking and entering. Make it not worth their while. If they do it; then CHOP","This is why I keep tigers in the house.","/r/cyberpunk","Hardwired or dumb. No reason for signals.","i mean every theft is incentive to make the life of thieves worse, just sayin. if you dumb enough to steal, hope you lose your legs","I had an app on my android phone that could do this 10 years ago.","Claymore roombas?","The gang broke in and took $25,000 in cash and valuables worth $100,000Who has $25,000 in cash just laying around?Also if you're going to leave that much cash and easily accessible valuables, you might want to invest in more security than a cheap wifi camera. Obviously any wifi camera is going to be trivially vulnerable","This is why I sprung a little extra money for PoE cameras. Nothing should soley rely on wireless operation without an manual backup, especially if it's security related.","How effective are those jammers against kitchen cleavers?Asking for a friend.","Hope they can run faster than 2700ft/s.","And here I am with my silly old mechanical only locks","They have these things they're called tumble locks and keys. They work pretty well.","Internet based online home defense equipment is just another example of “enshitification” of our modern business world. Everything regarding electronic networking based business is getting worse and more complex all the time.","So many recommendations on Reddit for Eufy and other shit wifi garbage. Wifi devices are shit","I have three 120 lb dogs. they actually love strangers, but, well. they're alaskan malamutes with the curly tails but they look exactly like gray wolves, two of them. the other one looks like a wolf put on a white and black husky's fur coat and it doesn't even fit right.the neighbors however don't even live here, their house has no one at it a lot.pretty sure they'll pass me up and hit that place first","r/shitthatneverhappened"],"points":394},{"text":["Oregon Passes Bill That Would Make iPhones More Repairable Everywhere","It just means you'll have to order your iPhone from a state that's not Oregon.","And what about shitty androids with no replacement parts available (or OS updates) after a year?","So what does this mean for car manufacturers such as BMW who do the same thing or is this specifically only for portable devices?"],"points":1},{"text":["What the Heck Is ‘Ordered Liberty’? Beware Poilievre’s Paradox","Is this like \"managed democracy\" in Helldivers, where you say a thing but its totally not that thing?","You have the freedom to live as they see fit.","You have the freedom to choose which hand your sexual monitoring chip is implanted on.","He’s Canada’s younger wannabe Republican.He doesn’t campaign on a single real issue or solution. All he spends his money and energy on is creating outrage, culture wars and attacking his opponents. Half of his announcements are his plans to oppress trans people when they represent 0.3% of our population and are such a non-issue that 90% of Canadians will never come across one in their shitty boring lives.I wish the Conservative party had someone of substance because Trudeau needs to go and we need tighter immigration control but this guy is a certified clown pandering to the dumbest demographic","Pierre the anemic fascist.","[deleted]","As always, Pierre \"Eyes-Too-Close-Together\" Poilievre has nothing of value to say.","He is so fucking out of touch, the guy has never had a real job.","he’s such a piece of bigoted, populist garbage. the thought of him winning makes me literally nauseated.","all Canadian politicians are garbage. they don't know what work is. they go to meetings to talk about what they think work is. they don't understand money creation through value add. they fog mirrors and call the central bank to print more money to give to constituents they think will vote for them. A ham sandwich is better than trudope. But, they all will disappoint.","PP stands for what so many conservatives do in 2024, removing personal freedoms.","What is this wannabe fascist up to now?","This man is ready to spread Managed Democracy.","We all know PP takes his orders from Galen Weston like a good little boy","Any minute now he'll tell us that work makes us free, and/or that power comes through joy.","He’s a weasel!"],"points":250},{"text":["DMA be damned, Apple cuts off path to Epic Games Store, Fortnite on EU iPhones","Did Epic really think Apple wasn’t going to be petty AF? It’s Apple, petty is like corporate culture rule #1.","I hate Apple, but I also hate Epic. I'm torn on who to support and who to shit talk.","So, I guess this means no new infinity blade :(","The thing is that Epic knowingly breached their contract.It’s absolutely the same thing that Epic has does to other companies, and they had no problem suing to enforce the termination of such accounts.Their blog post on their website is just another propaganda piece trying to explain why they should always be allowed with no questions.I have zero pity for them.","The fine for breaking the DMA is 10% of global income. I guess Apple thought that 2% wasn't enough and wants to part with more money","I swear most people on the subreddit can’t read further than the headline, so Epic was banned time ago due to breaking Apple TOS during the US case where Epic lost as the judge said that Epic would have probably won the case if they didn’t break the rules themselves.Then Apple decided to unban the account on good faith and regardless of them breaking TOS, now Epic started taking Apple to court in Australia and Tim Sweeney started ranting on social media on Apple, then now Apple banned their account again.Does this violate any of the issues brought forward by the EU? NODoes Apple comply with the EU ruling regarding the App Store? They say they do but the EU is currently looking at it before saying anythingIs Apple tiptoeing around the certain EU rulings (App Store)? Definitely, and I don’t believe it’s correct but we can surely have faith in the EU on either making more rulings.Can Apple decide to not do business with Epic? Yes, as any developer on the App Store has to agree to the same TOS.Let me give an example: “just because you got kicked out of a store for doing something they might not want inside and you might not agree to it, doesn’t necessarily mean you can go back because you want to, it’s the store’s choice/rule”","Bold move Apple. The EU has been looking for a first target to go after and up to now this has been Twitter, but Apple just made themselves a very politically expedient target. Good judgement right there /s","Direct Memory Access?","And yet another article that just doesnt understand how this isnt violating the DMA... Nothing in the DMA says Apple has to give Epic the tools to do what they want or even allow them on.Epic violated Apples agreement.. this was upheld in court. Literally NO COURT said what Epic did was legal and in fact said the opposite, just because they didnt like the terms didnt mean Epic had the right to violate them in protest.Nothing in the DMA says Apple has to let anyone have the development tools, just they cant block someone from creating a third-party store.This is Epic misrepresenting what they need the Developer account for, to get the public and lawmakers to see it their way. Epic can simply do what EVERY other jailbreaking group has done. They want the easy button.","Apple and Epic both need to select a representative at this point and let them \"talk\" it out in the parking lot at this point. What petulant babies, both of them.","Is this is in violation of the lawsuit in some way?","good. epic games is a virus.","Lmao. Apple bans company that violates contracts. Shocker. /s","Just keep taxing them x10 the previous fine. I am pretty sure their profits can't follow a geometric progression.","Speaking as a long time, professional IT guy... Apple products are overpriced, trendy garbage.","[deleted]","Why are they doing this? They're just wasting time for very little gain, the MacBook pro isn't a walled off garden and it's still the best laptop out there. Just comply."],"points":577},{"text":["Waymo launches driverless rides for employees in Austin. | TechCrunch","paid fares within a year.Waymo people will be getting rides to SXSW.","I'm out of the loop on driverless technology but ... is it really sufficiently safe for random routes?"],"points":3},{"text":["Sam Altman's eye-scanning Worldcoin banned in Spain","perceived privacy risks from the venture which scans irises in exchange for a digital ID and free cryptocurrency.Why would anyone willingly do this?More than 4 million people in 120 countries have signed up to have their irises scanned by Worldcoin's \"orb\" devices, according to its website.What the heck is wrong with people?","Altman says Worldcoin's ID will allow users to, among other things, prove online that they are human, notably in a future world dominated by artificial intelligence.This is what I don't like about Altman. WorldCoin was launched in 2019 and that means he basically already bet on those future problems while gpt-2 came out, and sought a way to capitalize on the detrimental effects. He really has missed his true calling as an arms dealer.","Good for Spain. Now we need other countries to follow suit","Good. This guy is a megalomaniac of Musk proportions. The sooner people realize, the better.","Sam is the real Lex Luthor not Elon","It’s common sense that scanning people’s eyes would eventually becomes privacy and security issue. Doesn’t take a rocket science to see this, but takes an ego maniac to actually try to do it. Sam loves power and control.","I honestly forgot about Worldcoin, last time I heard about it was during the pandemic."],"points":200},{"text":["The Hidden Costs of GenAI"],"points":0},{"text":["Forty U.S. states and Washington, D.C. called on Meta Platforms, opens new tab to crack down on scammers who hijack Facebook and Instagram accounts, to address a \"dramatic\" surge in account takeovers.","No joke there's an issue.I work in a very, very, rural IT shop. The number of people who come in about locked accounts, that's one thing, it's ones that are lost and controlled by another. Facebook's account recovery has been next to useless.Report said accounts has been more miss than hit. I have a niece (a couple years older than I) who lost their account, and the hacker is still using it a year later. DMing people about false events, asking for money, etc. I and many others have reported the account as hacked, but still actively DMing friends who still have her.Then there's the \"Event\" scams. There's a few Flea Market facebook groups around here. A couple are not very well moderated, but all tend to have one to three fake events for...get this... Amazon Work From Home positions, with the sign up sheet linked to a Google Hosted Website that vaguely looks like Amazon. I've reported these time and time again, and not a single one has ever been taken down, all see as within Facebook's guidelines (per the canned responses).","So true. Hell, just look at MP--it's full of accounts selling stuff at off-the-wall prices, just to build the account. Take that, and the huge number of Mom & Pop accounts that are hacked, and you have control over social media.","The vast majority of those are from password stuffing. The only way fb can combat that is by forcing 2 factor auth, but they won't because they'd lose millions of people who either don't have the ability or (more likely) can't figure out how 2 factor works.","I’m hoping this leads to more people abandoning this cancer."],"points":11},{"text":["Apple terminates Epic Games developer account calling it a 'threat' to the iOS ecosystem | TechCrunch","Every time I see a post about epic games, it reminds me to go get the free game of the week that I will never play.","Too many weirdos in the comments emotionally invested in a company that views them as profit margins and nothing more.","Apple doesn't always break the letter of the law but they sure do love violating the spirit of it.","Ofcourse they would call it a threat. A threat to their profits. And we know what happens to people that threatens shareholders profits.","What was the point of external app stores then","It's technically Apple's right* to not do business with Epic, but it's also petty behaviour, and my guess is that it's a mistake that's going to hurt Apple in their broader and longer-term fight with the EU.I like Apple well enough—I'm typing this on a Mac—but they should rightfully lose these fights.*Edit because I'm tired of semantic sniping: Apple has a right to choose with whom they do business, but that right can be overruled by laws against anticompetitive behaviours. I'm not judging which such laws might apply or not, just upholding the general right of freedom of association that applies before we consider Apple's unique market position.","I smell another lawsuit","Might fly in the United States but not going to fly in the EU.","Which massive corporate entity are we siding with?","Wow apple... wow.​This is extremely anti-competitive.​Epic may have tickled them the wrong way, but this is absolutely the wrong way to approach this.","You should be able to run anything you want on a device that you own, I'm not a fan of epic games, but freedom of choice is nice. This is why PC, Linux, Windows, android and other platforms will always be top dogs when it comes to software and customization.","And nothing of value was lost.","Guess no more Infinity Blade at the Keynotes lol","As long as Tim Sweeney is in charge at Epic Games, I can't root for anything they do. Dude is a total chud.","Did anyone fucking read the letters Apple basically asked given that we know that you enter agreements and then break them, why should we trust you this time. Epics response was fucking “trust me bro”. You don’t get to pull that card when you intentionally Trojan your software into their platform, sue them, lose, and get pissed again.","Before you decide who to root for, remember Apple has a cash reserve of....$162 Billion.","I don't get the outrage here. Epic sued Apple, and won. Now Epic is completely allowed to create their own iOS store. Did they also expect Apple to help them on this venture?","Lmao. Fuck epic. Dont break ToS.","Apple really wants to get broken up huh. Tim Crook is an unimaginative tool, not a single creative bone in Apple anymore but plenty of petty anti-competitiveness.","Fight fight fight fight!","I am pretty sure apple already lost this lawsuit.. Why would they double down?","Apple is acting both petty and extremely anti-competitive.I’m getting tired of the way Apple is doing things, they are clearly not the same company as they were under Steve Jobs anymore.Apple’s pure greed and their obsession to lock down their OS is going to bite them in the ass in the long run I think. Hopefully Microsoft will re-release an iPhone competitor with an open OS like Windows, and learn from their mistake with the previous smartphone attempt. This time MS has the technology to pull it off.","Why not license the IP to a small single developer and have them post the game and pay you 90% of revenue","here we go again","Can we still make iOS games using unreal after this?","Bro if y’all don’t pull unreal and watch Apple Arcade crumble","Finally, can that game just die","I hate Apple and I hate Epic more. This move makes me hate Apple more.","iOS eco-scam amd eco-abuse.","Good, screw Epic Games.","Incoming lawsuit that Apple will likely lose.","The \"ecosystem\" will inevitably be seen as monopolistic and forced to open up to third parties. It was fine in 2009 when it was a novel thing, but these days Apple wants to be as closed off as possible.","Why people still buy Apple devices in this day and age is beyond me, the quality is dropping, the repairability is hardly there and the cost is way too high.","This is going to be challenged in court in the EU. Apple can effectively kill your chance of making a App Store because it's tied to an Apple Developer Account. This may put pressure on Apple to make it so devs can make an App Store without an Apple Developer Account or Apple Notarization for apps inside the App Store. Basically sideloading like on Android without Apple having to approve everything.","r/technology is stuck in a weird spot - do they bash Apple or Epic? Tough choice","Remember when Steve Jobs killed flash for security reasons to protect the app store?Apps huh? Yeah is it 2012 again? Yeah?? LOLOLOLFUCK YOUR APP STORE APPLE",""],"points":2378},{"text":["By 2026, Online Content Generated by Non-humans Will Vastly Outnumber Human Generated Content","Just the push needed to motivate people to spend less time online.","I'm an old. Used to use my phone all the time, and I don't mean playing with apps. I mean I would talk on the phone to friends and family. Now my phone is just a spam delivery machine. I don't use it to make calls very often.I suspect the internet will be the same. Maximize profit until it's functionally useless. Oh well. I've been missing books. Figure I can just go back to those.","And it will all sound like a 12 year old who didn’t study for the exam but had to turn something in","I remember trying to convince my family members years ago to start watching YouTube when they only watched tv and movies. So much of the content was educational or straightforward, people’s opinions on a product were genuine and not a paid advertisement. These days they are the ones consuming hours of content on YouTube when I am not.It’s the same with Reddit on my old account I had carefully curated it around things I enjoyed and was interested in. Right around when covid happened the quality of content took a massive nosedive so I deleted my account and pretty much use this account just for news.It’s weird to see how so many things have gotten better over the years while others have gotten objectively worse.The coffin was already built years ago when corporations took over the internet, then the bots came along, and now AI is just the final nail.","And it will become increasingly stupid because the LLMs will be updating themselves on their own output and then will end up with Idiocracy for AIs.","Personally, I have become quite averse to AI illustrations being used for memes…","So the dead internet theory isn't just a theory anymore huh","And then the reasons we go online will surely change. As right now we usually use it as an escape method to scroll through interesting videos or photos or bits of text, but when all that is just the same algorithmically generated crap, we'll probably get tired of it all very soon.OR, like the boomers who comment on AI pictures on facebook because they don't know any better, the algorithm will cater things to be exactly what the most primitive parts of our brain want to see, and we'll all be even more stuck on our devices, endlessly scrolling through artificial garbage every free second of our lives. 🥴","This is a very interesting article that manages to talk a lot about something that is purely an estimate that has no basis in reality; i.e. there is nothing about the methodology or approach or some rough setup of the calculation.But then they have thisWe vetted the primary source document of this 90% metric quote from Europol – and we could not find the exact quote anywhere in the report.And you think, okay, so this will be a short article bc it appears to be bullshit.But no... here they go againFor our current purspose, the metrics suggested by the quote attributed to the Europol report remain valid as a scenario which will guide our research over the course of 2024: In this scenario, 90 percent of online content will be synthetically generated by 2026.😒To paraphrase Radiohead... anyone can write technology articles.","If you are on social media, that is already the case.","Like in any other space, the ~only way to reveal the author is with strong, independently-verifiable personal identification… such as is done via PKI, signed email messages, etc.But, for most situations today the author and reader cost is higher than the value gainedMaybe that’ll change.Maybe actual human content will become valuable, sorta like a few big newspapers a couple centuries ago gained a good, strong reputation based on the quality info they offered","Haha very funny. I already know that I'm the only actual human on this internet thing.","I think we passed this mark already. What are the app companies going to do when we just go outside and delete our accounts and go back to some sort of personalized social and newsletter. Anyone remember Path?","So, a loop but instead of idiots making shit up, AI will take the lead. So we will die before the computers take over but they will still play a part in our destruction. Good times.","I thought we passed that mark 2 years ago LOL!","Crap prompt generated ebooks are already swamping Amazon. Imagine Less ScFi stories with AI narration are here already.","Dark forest internet theory.","The internet had a good run while it lasted.","One of the most powerful takeaways from OODAcon 2023 was a qualitative anecdote shared on the “Cyber Risks of Emerging Technologies” panel discussion: “We are fast approaching a “tipping point” – when non-human generated content will vastly outnumber the amount of human generated content.” A general quantitative validation has also been floating around: “90% of Online Content will be AI-generated by 2026”. We took the time to validate this quant and flesh out one of the sub-themes from the OODA Almanac 2024 inspired by this “tipping point” – The Anti-content Movement: “In the deluge of content generated by AI, the human element becomes a coveted rarity, a beacon of authenticity in a sea of algorithmically crafted narratives.”​“We are fast approaching a “tipping point” – when non-human generated content will vastly outnumber the amount of human generated content: We are currently in an era where there is an unprecedented amount of data available. This abundance of data has far exceeded the volume of data that humans can create organically. Generative data, created by AI systems, is becoming the dominant source of content creation.”​AI-generated content, with its capacity to produce convincingly authentic material at unprecedented scales, introduces a new dimension to the concept of reality as we know it. The implications of this are profound, particularly when considering the potential for large-scale social media manipulation. The ability of generative AI to create content that appears genuine—whether it be text, images, or videos—means that the line between fact and fiction becomes increasingly blurred. This is not a distant future scenario but a present reality, with state and non-state actors already leveraging these capabilities to influence public opinion and political landscapes.","Helpful/Random Crap ultra printing. Get ready to be able to 3D print a lot more and get to see substances and shapes that need modern AI to be generated.","Wonder what will be done to combat it. Reddit already is half bots, and they're clearly doing nothing to stop or slow it.","I was just thinking last night. AI Generated content is going to get really, really good then it’s going to get really weird. As AI content saturates the internet we are going to start getting copy of a copy of a copy content.","Unfounded prediction: Ad-supported, profit-motivated sites will be mostly AI generated while paywalled sites will be mostly human generated or human curated. I say this simply because I think that's where the economics involved will drive things. The outliers will be some small, pure hobbyist sites that have neither ads or a paywall. Not that I like any of this :-(","They took err jerbs!","I mean it was all going to go to shit anyway, the net media etc. AI is just speeding it along. We created a Frankenstein's Monster simply by teaching it with our own psychosis.","And the top of the Google Search will be AI-mangled excerpts from the AI content.Turtles all the damn way down. 🐢 🐢 🐢","By 1998 you say?","I’ve give that a big fat maybe.","I'm not sure I get what AI generated means to them. There's a difference between a post created by a human on social media where that human resorted to an AI image generator for their meme and content created by a gpt-like AI trying to get clicks... I guess they bundle all of those together?","Won't our minds drown?","Great, that's the year I will unplug then. Let the bots insult each other online all by themselves.","Couldn't agree more, it's gotten really bad on reddit. You have bots denying that bots have overtaken many popular front page subreddits, it's actually hilarious. And I think the scary part is that a lot of people drink the juice and fall for the sheer amount of propaganda that flooded this website. It's sad.Not to even mention what has happened to smaller hobby subreddits, it's gone full circlejerk where most of the discussions are just complaining about said hobby. Or how much they hate the hobby. Most subreddits have become a parody of themselves.","I could have sworn human made content was vastly outnumbered by non-AI bot nonsense since a decade.","Watch lol right when AI is advanced enough to to take over and wipe us we are going to be saved by a solar flare. There’s one that happened within the past 200 years that would wipe all electronics off the face of the planet.Edit: within 200 years https://en.m.wikipedia.org/wiki/Carrington_EventDuring ^ Both polar auroras were visible from the Bahamas","doubt it. people tend to prefer authenticity.","We could trivially replace the comments section with something far better."],"points":238},{"text":["Russia plans to put a nuclear reactor on the Moon – with China's help","I wonder how they plan on getting nuclear fuel up there. Stick it in a rocket and launch-....wait...","They can't even build modern tanks, but they're going to land on the moon and then build a nuclear reactor?Good luck.","Russias capabilities are the biggest lie in modern history. Drunk FAS survivors can’t do fuck all they say they can.","I wonder how they plan on dumping all the heat? The vacuum of space is a terrible heat conductor and the lunar soil isn't much better.","We should leave the moon alone we need it for life on earth.","Question: how is it decided who can build what on the moon? Is it a free for all and anyone can just decide to build?","Best idea ever … said fucking no one ….","If Russia wants to shoot our satellites out of orbit I wonder how’d they react to having their moon base erased on a whimIf they keep fucking around they’re going to find out that","Every scrawny middle schooler thinks they can bench 250 lbs"],"points":32},{"text":["Epic says its iOS game store plans are stalled because Apple banned its developer account","It would be EU only anyways.Apple says if you live in the EU and leave for more than a “short time”, the alternative App Store will stop working.","Question for anyone who’s been following this closely, Epic aside, what prevents Apple from just doing the same with the next company who wants to open a third party app store in the EU?Can Apple indefinitely go; “We’ve decided insert company here isn’t trustworthy, so no account for them.”That does not seem in the spirit of the EU ruling.Edit: Thanks for the answers everyone!","I'm kind of shocked Apple even approved the developer account to begin with. This doesn't sound like it's within the spirit of the DMA. It basically means Apple still decides who can compete. It's literally anti trust. That being said, we won't know until Apples rules are put against the DMA in court 🍿.","Hey weird, maybe they should allow the steamdeck to play fortnite? Weird they’re so upset about this, yet they are doing something fairly similar themselves.","So it seems the conversation went something likeApple : You've breached the DPLA in the past by adding your own payment system to get around our 30% commission. Why should we trust you?Epic : We won't do it againApple : Insufficient.Epic : <social media finger-pointing>Apple : Banned.after reading the letter from Mark Perry, it's pretty obvious Apple is fragile shitcakes","Use an other email","Props to Epic Games for ruining franchises like Rocket League. That isn’t easy to do.","Does Apple HAVE to work with Epic? Legally?Epic loves to play the good guy card, making it that Apple is just doing them dirty with their monopoly.Apple controls….23% of the global market share for mobile phones. If you want to access that market…that is 100% their market. They have a monopoly on “Apple Devices”, but not on “Cell phones” whatsoever.Epic wants to use Apples infrastructure, their “Walled Garden”, then they need to pay for those costs. Apple built a specific framework that protects its users, minimizes fraud and bad applications…but that comes with more centralized control from Apple. They have to review, and approve the apps. It’s not always easy - they reject a lot, you have to make sure that you are following their user guidelines.I prefer to have that layer of safety in my mobile device. If I want to hack something, I’ll use a different device than the one that i need to rely on for…everything.Due to that, the walled garden approach works for me. Thanks Apple.I don’t see how they can be forced to leave that approach, so that vendors don’t have to pay them to use their ecosystem.","I always wonder how Steve would feel about the company today","If you don’t own the platform…","Shitty company fighting with shitty company, can't really hope for either to win.","First we got ChatAI vs Elon and now Apple vs Epic… Just need Amazon vs Airbnb and then we’ll have all of Reddits bogeymen￼ fighting each other at the same time.","Tim Epic VS Tim Apple","Good. F EGS.","Fuck around. Find out.","Fuck Epic….Really","Epic are scumbags, so theres that.","Both have shady business practises.Apple not allowing third parties app stores, third party payment methods or allowing alternative services to plug into their eco system.And Epic messing with the desktop game store market with exclusivity deals trying to gain a piece of Steam's share, while their app store is not up to level of steam in terms of features.","Apple is a private company, seems this is in their right.","Another 2B fine for Apple? 👀","Apple is fucking themselves not being an active partner with Epic. Vision Pro needs to get unreal to survive.","I hope they sue. This is a clear violation of the DMA","They totally deserved it. Can't wait for little Timmy to start ranting again.","Fuck around and find out Timmy.","Lmao. Fuck Epic.","Epic asked for it, and can't really complain now. Play stupid games win stupid prizes and all that.","I’m sure Epic can build a game store app for iPhone and not have to deal with Apple for it. That is if Epic is smart enough.","Blame Apple","The fine for breaking the DMA is 10% of global income. I guess Apple thought that 2% wasn't enough and wants to part with more money 💰",""],"points":975},{"text":["Microsoft may debut its first 'AI PCs' later this month","After failing big time with all things Surface, who knows how this will go. I get MS is 3T company thanks to the cloud and business but when it comes to consumer stuff MS is like a reverse Mida.My hopes are not high.","imo the only thing that is interesting is ai upscaling for games by microsoft","So it will help find me the good porn that it knows I like? Awesome","Good, now when I get frustrated with Windows it can actively fight back and adapt against my efforts to do what I want.","Has anyone tried iHOP's new AI omelette special? Apparently it's hideously expensive, sometimes toxically inappropriate, and never quite right."],"points":8},{"text":["Google takes aim at SEO-optimized junk pages and spam with new search update","From the Article:Overall, the update intends to improve Google’s ranking systems to downrank pages that were “created for search engines instead of for people,” the company’s announcement explains. That is, sites that have a poor user experience or that were seemingly designed to match a very specific search query will be impacted. Google estimates that through this update and its prior efforts, it will be able to reduce low-quality and unoriginal content by 40%.","They’ve made changes targeting these exact things multiple times over the last 2 years. They have been a mess. I’ve never seen more updates to the google algorithm than last year. Core updates are few and far between. Like two a year. Last year saw multiple ones. Sometimes within 2 weeks of each other.They did the spam update, low quality update, ai generated content update. None worked. In fact, it buried a lot of legitimate sites.You can build a site or storefront and create content that follows googles guidelines to a T and google will list you on the 40th page of results. You can have the cleanest site, perfect back end, super fast site, well thought out content target towards your demographics, and you would get buried while say someone like Home Depot or Best Buy, who aren’t even in your industry will be listed on the first page of organic results because fuck all.Google search is a fucking disaster and the SERP pages are jumbled mess. Getting any results (spam or otherwise) that are even remotely close to what you’re looking for is a rarity. Google is a ghost of its former self. And that odd, the people run google search have been there forever.","Like a frightened cat running from some lethal mice."],"points":6},{"text":["OpenAI Says Elon Musk Tried to Merge It With Tesla","It would have been funny to watch him gaslight himself and then others into thinking he made the AI when he just bought it, like he did with Tesla. But we're way better off with him not having keys to this kingdom.","You can't trust either side. Can't trust Elon Musk or Sam Altman. Both are power hungry and that's a fact.","Elon Musk, an American oligarch.","Elon, OpenAI and Tesla in the same headline? I’m actually impressed the Reddit servers didn’t spontaneously combust￼. ￼","An interesting proposition","With the actual cars? So they can hallucinate about Trafic and pedestrians? Fuck no. I hate these tech bros and the entire culture, which is ultimately one of infinite greed and old boyism.","Of course he did. Musk is a narcissist. You can’t reason with them.","Thank fuck it’s not in Musks hands","Two completely untrustworthy tech bros going at it. Don't believe either they are both lying.","Like sam almost merging the entire staff into msft earlier this year with his drama?","OpenAi pr team on the offensive","But instead he tanked twitter lol..","I had mild synesthesia as a kid. It’s not as intense nowadays, but whenever I hear or read “Elon Musk”, there is a repugnant smell that’s hard to place. It’s close to the word “desperation” and “illness”.","People hating on musk here and praising Altman have no awareness whatsoever, you think Altman is your friend? You think Altman is a good guy? I hate musk as much as the next guy, but you're making the same mistake but reinstating a new idol to worship instead of the old one. These people aren't billionaires because they are nice, imo to evey last one of them is a psychopath, And that a requirement to be that rich. Open ai is a company that's taking the world by storm and it has less than 1000 employees, I'm guessing every last one of them is a millionaire at this point, even they are not to be trusted","Who cares. How can they even say that like its bad after they basically became Microsofts bitch?I dont like elon but these open ai people are not really much better are they.","Sam Altman is a master of manipulating public opinion to be on his side.","unlike Altman that tried to merge it with MIcrosoftSo much better","Knight Rider theme intensifies","I'm a little stupid. Where in that short article does it say that he tried to merge it with Tesla?","From the headline I thought the AI itself was saying this.","Coulda been like when the two ugliest kids in my high school started dating","What hasn't this man tried at this point?","The real reason for the lawsuit obviously","And name the whole thing X","He was super anti AI like 10 years ago.","Omg can we please stop talking about these two people? Very few people have a Tesla and / or use ChatGPT on a daily basis. And no your friends are not a good enough sample size.","Pretty weak article. I was actually confused by the abrupt ending and kept scrolling looking for the rest of it.","It sounds crazy but think about it. Tesla has the most data of real world human driving behaviour. The tesla car is AI on wheels. It regonizes real world signs, trees, cars, pedestrian and objects. That combined with openAI reasoning in a tesla bot.Well tehn you have skynet. Maybe its good they didnt merge","Explain to me again how that is non-profit? Doesn’t this utterly contradict musk’s lawsuit?","The hate boner for musk is so hard on this sub that Sam Altman will be viewed as the trust worthy one lol.","Sold all my Tesla stock today","And? Is that supposed to be bad? So what?","Felon Muscow is getting desperate as he is bleeding money thanks to Emperor Xi & Co","Oh look. Another news site with a pay wall.Without reading the article, I'm not surprised. Elon Musk was known to be innovative and trying to push humans into an age that you only read about in sci-fi stories, but then he got weird and socio/political","That's not what was said NYT. It was a suggestion to do so, to fund the OpenAI charity and it's chartered research mission. This title is misleading. The emails are a discussion to the possibility and a redacted person suggested the Tesla merger, to which Elon agreed to the idea of.","I’d rather see it in Tesla’s hands than Microsoft","Ok Sam, please point on the doll, where Elon..."],"points":1090},{"text":["US Urges Allies to Squeeze China Further on Chip Technology","China is like 40% of the global semiconductor market. The US is basically asking their allies to blow up their own tech industries for the sake of US tech hegemony.","US is so scared of the underdog catching up","People are acting like there aren’t valid reasons for protecting intellectual property… especially from a group like the CCP which have demonstrated their willingness to utilize technology in invasive and overreaching ways to maintain their power in China and globally. Open espionage, policing citizens in foreign countries, elections interference, spreading misinformation, spy drones etc etc … and also we’re in a capitalist world, it’s fair that a country wouldn’t want to sacrifice their R&D so that it can be mass-produced by a competing economy that lowers their costs via zero care for environmental impacts or any semblance of fair labour compensation.“US is so scared of the underdog”**US doesn’t want underdog, who is a blatantly corrupt and hostile regime, to steal their IP and exploit the environment and humanity on their way to becoming a dystopian top dog that the ‘100 year plan’ describes. There will be fair competition for fair players. If a group didn’t present such blatant security threats, perhaps they’d be more eager to do business like they do with other allies.","https://archive.is/Hm6S9The US government is pressing allies including the Netherlands, Germany, South Korea and Japan to further tighten restrictions on China’s access to semiconductor technology, a controversial effort that’s drawing resistance in some countries, according to people familiar with the matter.The Biden administration’s latest push is aimed at plugging holes in export controls it’s levied over the past two years and restraining China’s progress in developing domestic chip capabilities, said the people, who asked not to be identified discussing private deliberations.For example, the US is urging the Netherlands to stop ASML Holding NV from servicing and repairing sensitive chipmaking equipment that Chinese clients purchased before limits on sales of those devices were put into place this year, said the people.The US also wants Japanese companies to limit exports to China of specialized chemicals critical for chipmaking, including photoresist, they said. Japan is home to several leaders in photoresist, including JSR Corp. and Shin-Etsu Chemical Co.Tokyo and The Hague have responded coolly to Washington’s latest push, arguing that they want to assess the impact of their current curbs before considering tighter measures, some of the people said. US Commerce Department officials raised the issue in Tokyo during a meeting on export controls last month, according to one of the people.Representatives at ASML, the Dutch trade ministry and Japan’s Ministry for Economy, Trade and Industry declined to comment. The National Security Council declined to comment and the US Commerce Department didn’t respond to a request for comment.The Biden administration has taken aim at China’s semiconductor industry since 2022, imposing sweeping controls on the export of advanced chip-making machines and sophisticated chips like those used to develop artificial intelligence. Japan and the Netherlands, the two key countries where chip-making equipment is developed, joined the US effort last year.But holes still remain, particularly in the ability of Japanese and Dutch engineers to continue doing some equipment repairs, and in the flow of spare parts that are used in semiconductor manufacturing equipment.US officials got a shock last August when China’s Huawei Technologies Co. unveiled a smartphone powered by a homemade chip that is more than a generation ahead of where the US had sought to halt the Asian country’s progress.US Commerce Secretary Gina Raimondo has vowed to take the “strongest possible” action following the Huawei breakthrough, while Republican lawmakers have called for a complete block of Huawei and its chipmaking partner Semiconductor Manufacturing International Corp.’s access to US technology.The latest US push includes an effort to tighten existing limits. ASML needs a license to service and repair restricted gear in China, but the Netherlands has been somewhat lax about approval, according to one of the people. The US wants the Netherlands to take a more stringent approach, the person said.The US also wants to draw more countries into its export-control blockade. The Biden administration is trying to bring Germany and South Korea into an agreement that already includes Japan and the Netherlands, since all four countries are home to key firms in the semiconductor supply chain, according to the people.For Germany, one of the critical players is Carl Zeiss AG, a specialized glass maker that supplies ASML with the optical components necessary for advanced chip production. The US wants Germany to get Zeiss to pull back from shipping such components to China, the people said.Dutch officials also hope that Germany will join the export control group, according to the people, and the Biden administration is pushing for an agreement before the G7 summit in June. Berlin last year mulled over whether to restrict exports of chip chemicals to China, but Chancellor Olaf Scholz, who is slated to visit China in April, has not yet taken a stance on the issue, according to the person. Scolz’s deputy Robert Habeck, meanwhile, is visiting the US this week and will meet Raimondo during his trip.In addition, the US has held talks with South Korea on chip export controls, given the country’s leading role in producing chips and supplying spare parts for chip-making equipment. The two countries launched a structured dialogue in February after US officials asked their counterparts in Seoul to join the multilateral group last year, according to some of the people."],"points":30},{"text":["Google now wants to limit the AI-powered search spam it helped create","I always read that website name as Arse-Technica.Anyway Google played itself.Wait until they find out generative A.I will soon completely ruin the Internet....and I hope it does.Maybe then il touch some grass and escape this hellscape.....nah I still got video games."],"points":5},{"text":["Linux market share passes 4% for first time; macOS dominance declines","macOS, meanwhile, has seen desktop market share drop from 21.32 percent in June to 15.42 percent in February. However, the Apple OS’s current market share is similar to what we saw in January 2023 (15.33 percent) and February 2023 (16.26 percent)....dominance?","macOS dominanceF.DOUBT","I can see MacOS continuing to decline, considering apple is still selling notebooks with 8Gigs of ram in 2024.","Finally, the year of Linux is upon us! Maybe. But probably not.","I love my Mac, but dominance?","Im on Ubuntu only. Steams compatibility tool Proton makes it possible for me to play all my games, even the ones for Windows and it works just fine. And macs never really interested me anyway, why would I pay huge amounts of money for hard and software that I can get for a fraction of what I would spend on a mac. Always baffled me why people do that.","Linux runs on 5 separate machines in my house right now. From Media centers, arcades, and just a basic OS like Mint it dominatesEdit: Relax people I never said it was going to overtake Windows or Mac ...","All those people who don't want to buy a new system to run Windows 11 finally giving a middle finger to MS and moving to a Linux variant realising it can do most tasks of their daily computer usage?","If you're not a gamer, there's literally 0 reason to use Windows, except for inertia. Nothing you need to do with your computer can't be handled by any nominally user-friendly Linux Distro—I'm partial to Linux Mint personally, but you're welcome to proselytize for your own preference.Even if you are a gamer, gaming on Linux has been dramatically improving year over year as developers adopt cross-platform engines and programming languages, and with Steam Deck in particular, there's active demand for game developers to support Linux as a platform.Combined with this, Microsoft has been Enshittifying Windows as a Desktop OS.So no real shock to me that Linux is starting to break through. I don't know that Linux will ever be a majority OS for consumers, but don't be surprised if that number continues to improve for Linux in the near future.","Seeing macOS decline is just...nice. Not because I am one of those people that hate Apple for existing, but because macOS has just been in this sorry state for a while now and if I could go back and stop myself from buying my M1 MBP back in 2021, I absolutely would have.Monterey sucked until I think like 12.3 or 12.4. I tried Ventura but Ventura kept kicking external drives off at random causing me to lose work when I was in the middle of an edit in Final Cut. So I skipped Ventura entirely. Sonoma? It's been...okay but up until 14.4? iPhone syncing has been completely broken.If you try to sync an iOS device with Sonoma, MDCrashReportTool itself crashes and halts the sync, you have to drop into activity monitor and kill it. That this was broken for so. damn. long. is just nuts to me.With each release it feels like something significant gets broken, significant bugs are introduced, and essential functionality is hosed in some way.Maybe seeing market share drop will light a fire under Apple's asses that they need to get their shit together. Because their software quality has been in a horrid state for the last...quite a few years.","if you count android then linux wins, i hope android desktop mode will be finish soon by google","A large slab of the 220 million machines that can't go to win11 will go to Linux. I'll be one of them.","You can really tell the age and mentality of the commenters here on the fact they dont understand what dominance means in context of the article...(hint: it meants its overall influence, not that it owns the marketshare over others... so the mac OS marketshare dropping would mean its dominance is waning... they are not saying it was ever the top here.)Also keep in mind, this is literally 1 firm where the margin of error is REALLY large and relies on website tracking data... data that Apple is specifically working to block on their devices to protect user privacy.","[deleted]","Is there a Genius Bar for Linux, or is it a call center with 5,000 people in Florida?","Ironically, MacOS was the gateway drug for a lot of us to get into Linux."],"points":383},{"text":["Dell exec reveals Nvidia has a 1,000-watt GPU in the works","Can you even call these GPUs anymore? They clearly aren't marketed or intended for processing graphics anymore.","Game while you grill a cheese sandwich . . . Sign me up !","Would be better if they would release a new card that has the same performance with half the wattage.","Coming soon, to a crypto farm near you.Also, I notice there’s no price estimate. I guess if you have to ask, you can’t afford it.","It’s a good thing that this isn’t a gaming card. That would basically mean you would need two 15A circuits to run a gaming PC.","1000-watt GPU? Does it double as a heater?","I work for Dell. I was in Round Rock last week at our labs where we test these massive servers with NVIDIA and a they are absolutely massive and put out a ton of heat… I stood in the hot isle between just 2 servers and the airflow and heat was really unbelievable. We have customers buying 1,000s of these. For clarity this is not the GPUs referred to here, but H100s in XE9680s.","What is up with Dell leaking all this Nvidia info lately?Also since they don't bother to mention it in the article, I would assume this is only the SXM version of the Accelerator, not the PCIe one which would likely use 12VHP and thus if they stick to a single connector would be limited to 675W","These are definitely meant for Datacenter purposes but still 1000W is insane and will absolutely need to be liquid cooled","We call it \"The Heater\"","Because wasting energy is what we need at the moment.","Makes sense. Companies that buy data centre GPUs in bulk will be running at perhaps hundreds of megawatts.By cramming more compute into a single card you actually save power per unit of compute for a data centre of a given size.","Are we measuring computing power in watts now? Is this a competitive parameter? It should be as low as possible, right? Are the older models more than 1,000 watts? What are they trying to tell us? Fuck the climate, we are playing games and doing useless shit with ai?","Which Dell will put in a box with a 600W power supply, ship with loose screws in the case, and refuse to warranty because \"there's some liquid damage\".","They should just come with an external power supply and another wall plug.","1000 watt GPU powered by wires/connector rated at 100 watts.","\"Oh hai here's our lawyer's wanting to talk to you about breaking your NDA. Enjoy!\"","[deleted]","Meh, gimme power efficient cards w the rising pge rates nowadays. I stopped gaming and I'm trying to remove 2080 from my computer to conserve energy."],"points":446},{"text":["OpenAI fires back at Musk, and Monzo raises a megaround","Whatsamonzo?"],"points":0},{"text":["With almost no oversight, AI has quietly spread through everyday life. Filtering job resumes, rental apartment and home loan applications, studies and lawsuits have found they can discriminate based on race, gender or more. Colorado and other states are scrambling to catch up."],"points":0},{"text":["EU users can't update 3rd party iOS apps if abroad too long | Remember how Apple told you security was of paramount concern?","Barely anyone is going to make third party app stores anyways. 50 cents per install and Apple demanding a 27% cut makes it a financial nightmare.","This is meaningless if we don't know the time window. 6 weeks? 6 Months? 6 years?","The security of Apple's profits is of paramount concern. Providing any security for their users is just a marketing tactic.","And? Are there no iOS app repositories for sideloading? They´ll come soon then.","Right. But you're abroad for too long, I guess you no longer qualify as living in the EU, so the legislation wouldn't apply. At least as Apple sees it.","I had this problem the other direction. Lived in Europe for a number of years. Had to change Apple Store location to get location specific applications. It was actually a huge pain in the butt.Also fun fact, Google changes your home base location after 6 month. Ts and Cs change. It was all very enjoyable /s"],"points":31},{"text":["Teachers are embracing ChatGPT-powered grading","So AI will correct homework written by AI while a human gets paid for it and another one gets a diploma that will enable them to get a job that will also be carried on by AI.And you guys are against AI replacing humans? It's doing all the work!","Oh sure... Kids can't use it, but teachers can.","This is definitely \"I'm surrounded by idiots\" energy.Does anyone else remember the numerous examples of AI, ChatGPT specifically, providing incorrect information and then asserting it was correct?","Come on people. They don’t have grad students to do the grading, so what choice do they have?","Already have a program that “grades” student answers.All they have to do is copy off a blank class of text from the material and it gives them a 100%.","If you can’t beat them, join them.","For better or worse, teachers are embracing ChatGPT-powered grading with a new tool called Writable, which is based on an AI concept called \"human in the loop.\"AI grading tools can enable shortcut-taking by teachers, depriving students of more meaningful feedback.Friction point: As schools struggle to craft their AI policies, there's debate over where to draw the lines. Is it academically honest to use ChatGPT to grade papers? Does it shortchange students?Thought bubble: Teachers and students alike will be using ChatGPT and its ilk going forward — so the focus should be on setting guardrails rather than tsk-tsking."],"points":29},{"text":["DARPA-Funded Wireless Communication Breakthrough Takes Data Transmission to Another Dimension… Literally. - The Debrief","Nice now the Shadow Realm will see my dick pics.","That's a lot of words to keep things vague like how it's better or how much more data it can send or what it means to be 3d vs 2d for wifi.","There's a fair amount of complete garbage in this article:They write so breathlessly about semiconductors, as if this is groundbreaking new technology.They distinguish between planar processors and semiconductors. Not only are planar processors semiconductors, they were one of the first big advancements in semiconductors.\"Existing technologies in our communications devices like smartphones transmit information by converting data into electromagnetic waves that are then propagated amidst billions of users at any given time each day\"Uh... no they aren't. The number of users \"propagated amidst\" is more about the number of people using the same cell towers. Even if wi-fi, it's not \"amidst\" billions, or millions, or hundreds of thousands, and generally not even thousands.The whole article sounds like it was AI written, so it's just subpar."],"points":19},{"text":["Graphics Double Data Rate 7 SGRAM Standard (GDDR7)"],"points":0},{"text":["Crypto firm Genesis to pay $1.1 billion back to customers | CNN Business","Gemini, not Genesis. Phil Collins probably doesn’t even know what crypto is.","It is kinda funny how the crypto fraud market bounced back after FTX. Pigs to the slaughter."],"points":25},{"text":["The latest product roadmap from Nvidia shows no more GTX GPUs on their way.","I didn't even know they still made those.","Well why would they make obsolete stuff?","Does this actually mean anything? They're just names... They could easily just create a new gpu that is the equivalent but call it the ztx no?","RIP, 2008-2024","I always assumed that GTX was rebranded to RTX.","My GTX 570 ran like a champ for nearly 7 years back in the days.Rest in transistor heaven, my friend.","so no more x30 tier gtx refreshes? maybe the next business tier model will be an rtx 5030 or something.","This is okay.","nobody was expecting gtx gpus","I'd guess they are far more focused on AI GPUs than gaming GPUs right now.","And I just bought a 4070 😩"],"points":128},{"text":["Palantir wins $178M Army deal for TITAN artificial intelligence-enabled ground stations - the Army's \"first AI-defined vehicle\"","Sometimes I wonder what people think military Commanders are like. Many Commanders at BN or above have trouble with Teams or even checking their email. This notion that they will act as a rapid junction of multi-domain battlefield intel to exploit enemy weakness in real time is nothing less than pure fantasy.Just imagine your Dad trying to set up the new TV in Combat. Probably be a little like that.","So basically they are selling a mobile data center with some cameo paint on it and likely a 1000x markup","Ah yes, the old triple scoopSupply the United States Supply Ukraine Supply IsraelCongrats to Peter Thiel /s"],"points":12},{"text":["Annoying hospital beeps are causing hundreds of deaths a year","\"Alert fatigue\" is what I know this as in my field.There are books on this topic that usually refer to the proper way to handle these things as \"Dark Cockpit\". I think it was Airbus that made it popular in the airliners, it basically means that if there's nothing wrong, it should be completely dark in the cockpit of a plane (no lit up buttons etc)And an interesting related topic is Bystander Effect.","I'm actually shocked at the UX of these machines. When I needed surgery and was in the hospital for a month, my damn IV machine would beep non stop and prevented me from getting sleep.It's totally backwards and insane that thoughtless design is causing actual deaths and severe quality of life downgrade for those around them.","Last time I was in the hospital for a few days and I didn't need my IV bag anymore. Machine kept going off now and then because the bag was empty. Nurse actually came and told me how to silence it so I didn't have to keep calling them.","I worked on the bridge of big ships for many years. We call it alarm fatigue. The more they go off the less you care over a period of time. Especially when the same faulty machine alarms every few seconds because no one will fix it.","I’ve been a nurse for a decade and a half, started off working bedside for about half my career before I switched over to being in a consult service that doesn’t stay at the bedside constantly for 8-12 hours.During those years I was bedside I’d hear the alarms in my sleep or outside work, have nightmares about picking up an assignment and forgetting about a patient til halfway through my shift, etcAs soon as I switched my role and wasn’t surrounded by that anymore, the beeping and nightmares stopped completely.Working in the medical field isn’t just physically and mentally difficult, it’s very emotionally wearing, and in response to the ever increasing stressors on the job management typically points the finger at nurses “not taking care of themselves” outside the hospital as the way to solve the damage that comes with the job. It’s pretty disheartening and unsurprisingly it doesn’t effectively manage issues within the job that really don’t come down to how a nurse provides self care to themselves at home.","This is also one of the reasons why ICU psychosis occurs; the constant beeping; constant bp pressure cuff going off every 5-15 minutes; constant checking; etc. Patients are unable to get actual rest because of the various checks, unfortunately, they are necessary so unsure what the possible solution is at this time unless they move towards more \"invasive\" monitoring solutions; e.g. art lines for everyone.","If you’ve ever given birth or been with your spouse when they’re giving birth, you know this all too well. Nurses are like, “get some rest now” while the room sounds like a fucking slot machine floor.","I know it's not the same. But sometimes when I'd come home from a long shift at McDonald's during college. I could sometimes still hear the beeps to changes trays or when the grill is going up and down","From Monty Python's The Meaning of Life (1983)Obstetrician 1: Get the EEG, the BP monitor, and the AVV.Obstetrician 2: And get the machine that goes \"Ping!\".Obstetrician 1: And get the most expensive machine - in case the Administrator comes.Patient: What do I do?Obstetrician: Nothing, dear, you're not qualified.[Later in the sketch...]Hospital Administrator: Ah, I see you have the machine that goes 'ping!'. This is my favourite. You see, we lease this back from the company we sold it to - that way it comes under the monthly current budget and not the capital account. [the doctors and onlookers applaud] Thank you, thank you. We try to do our best. Well, do carry on.","Anyone else read the headline and think for a moment that the beeps themselves were killing people? As in, ‘let me shuffle off this mortal coil rather than keep hearing this’?","Spent a couple of weeks visiting a sick friend in the ICU. Obviously they were treating him for the sickness, but it seemed that there was no notion of rest in the recovery. The lights, the sounds, the unpredictable timing of visits from nurses and doctors.","My dad died in 2018. He went into the hospital on a Tuesday and passed away on that Thursday night. The ENTIRE time I was there it was a constant barrage of beeping. He was put under shortly after he arrived so he didn’t hear any of it but I was inundated. It was so bad that when it was time to say our goodbyes and to actually let him go, I asked the nurses to turn off every beep on all of the machines in the room so we could let him go in peace. I told them “I don’t want to hear a single beep, just give us a nod when he’s passed please” The nurses were wonderful and obliged, but that was such a serene moment after almost three full days of nonstop beeping. I have no idea how nurses put up with that on a daily basis, there’s no good way to know what any of them really mean.","My grandpa literally could not sleep because of this. Do you have any idea how important sleep is? Hospitals apparently don’t.","What about the machine that goes 'PING'?","All the comments I read are from hospital workers. Here's my patient perspective...I'm a lung transplant recipient (7 years this month). Ive been hospitalized probably a dozen times over the past 10 years, pre and post-transplant. Alert fatigue is a big thing for patients too. Many times I've had an alert go off and continue for several minutes until a nurse can attend to it. I understand why that is, because I have way more familiarity with nursing than a person should. But jeez it is annoying to lie in bed listening to beep-beep-beep for 5,7, 10 minutes or more.With that, I just want to add that I think the world of nurses. All my care, over 10 years and 3 hospitals, has been uniformly caring and professional. My son is training to be a nurse; I told him he is entering a noble profession.","We got a new CNO at my hospital. She said call bell wait times were too long. Instead of adequately staffing she turned up the sound of the call bell beeps. Not sure how any of the patients near the speakers can sleep.","The beeping in the middle of the night drove me crazy, as did nurses coming in at 11-midnight and then 5 AM.But I got to go home eventually and the nurses are still listening to incessant beeping day in and out. I have nothing but sympathy and respect for nurses, I watched them working hard while understaffed.","Nuisance alarms have caused a few aviation crashes throughout the years as well. Either the pilot ignoring the alarm, or even pulling out the breaker to set alarm to shut it off","I know someone who works in a government facility in the UK that maintains nuclear missiles. They have a weird reverse system which involves a constant alarm if there's nothing wrong. If the beeping stops then they spring into action.","These alarms are based off gov standards. Good luck getting those changed. One trend is connectivity where nurses/nurse stations are notified of alarms.","Yup, every single piece of medial equipment makes way too many noises and alarms way too easily. If only 1/100 times your machine alarms is an actual emergency, you have fundamentally failed to provide any useful information and it is just crying wolf.","I took my father to the ER about a month ago. Bloodwork showed he had a heart attack, but his vitals were normal. They hooked him up to the vital signs monitors. I could see his BP, heart rate, pulse, and O2 level. Every time he moved his arm the alert beep would start. After the third time a nurse came into silence it, I started doing it myself. A week later he was transferred to a nursing home for rehab. There was a constant alarm beeping in the main hallway. I discovered it was tied to the patient call buttons. If any patient pushed their button, the alarm would start, a light outside their room would flash, and a panel at the nurses station would blink for the room. There were over 100 rooms. The alarm never stopped. The aides had long stopped paying attention. The patient call buttons were useless. A long-time resident told me the only way to get help was to yell at anyone you saw in the hallway.","My son almost died because of this. He was in the intensive care unit and was on a ventilator. A radiology team came in to take some chest xrays.If anyone has been around someone on a ventilator. You know that they make a lot of loud beeps and warnings for a variety of reasons.Well these techs had to turn my son on his side to take the X-rays. When they did, the ventilator started making tons of noise, warning of changes in air pressure. One of the X-ray techs decided to mute the ventilator because it was annoying him I guess.About a minute or so later I am looking into the room and watching them, and I notice my son’s lips and around his face was turning blue. I started yelling and screaming saying he couldn’t breathe.Doctors rushed in and they had to re-intubate him because his other tube had become plugged with mucus.The techs weren’t watching his oxygen levels. Because they had muted all the alarms.Luckily my son is alive and well. But I still have nightmares of that moment and his blue face 11 years later.","Wonder if this happens at fast food restaurants?","I’ve been in and out of hospital since July. The most recent stint I was being driven mad by the beeping and being woken up every two. Slowly i got them to detach me from various things. When they disconnected telemetry i was ecstatic.","Last time I was in the hospital it was a 6 day stay and I was awake for 99% of it with the only time spent unconscious being when I had surgery near the end. The beeping was the last problematic thing there. They gave me a new hospital bed meant to prevent bed sores, the issue is it was an air mattress that constantly needed to be inflated with these little strategically placed holes right where my head was. So it was like someone was blow drying their hair at the foot of the bed while several people were all blowing different whistles at the head. Then my room was next to the nurse's station so the automatic doors would swing open and crash against the wall of my room sounding like someone was kicking my door in every 5 minutes. Lastly the room itself was kind of really loud dehumidifier room so my dry eyes and throat where deeply uncomfortable the entire time. I was starting to wonder if the entire thing was set up as some kind of CIA sleep deprivation interrogation study with how terrible it was. Only one single medical professional acknowledged how deeply uncomfortable the entire thing was when he struggled to speak with how dry the air was. My ears were ringing for a week after I got out","Wife was in the hospital trying to nap before giving birth and her oxygen rate kept slightly dipping below the 95% beep threshold on whatever machine she was connected to. So instead of getting rest, we listened to this machine beep loudly every 5 minutes for hours overnight. Complete nightmare.","Similar to modern cars - renting a Toyota right now and it is constantly alarming about different issues - at least 4 different that are triggered by normal safe driving - going 1km over speed, lane tracking, proximity..something else.Super distracting and turning them off is not simple...","This is a byproduct of the CYA school of management. Flood the user with warnings, notices, alarms, and disclosures so that no matter what happens, you can CYA and say you warned the user.It's considered a risk management strategy. What we need is a court decision holding a company liable because one relevant warning was drowned out in an ocean of irrelevant beeps.","These beeps need to be transitioned to direct-to-person notifications.","We learned this when a nuclear reactor melted down, but rich people are affected when those malfunction, so I guess that’s why they cared.","I am constantly annoyed at how nurses ignore peeping machines for hours and hours, sometimes days, while patients are left sitting next to an absolutely obnoxious peeping that prevents them from sleeping","Changing the beeps to melodies? Like my dryer? Is that really a good idea? I can just imagine my dryer song in a clinical context.♫♪♪ Yourrrrrr patient is dyinggggggg, doopidy doopty dooooo ♫♪♪","I work at a company that manufactures forklifts. One of the things I worry about is the number of lights and alarms that are constantly being ordered on forklifts because of this exact issue with alarm fatigue.I’m so glad we only use the horn in our factory. You’re not surprised by the sound, but that sound means exactly 1 thing. We also have a pretty good system for operators and pedestrians to make sure they see each other.","I 100% understand. Was in hospital in 2022 for emergency hernia complications. Went to the ER, my blood pressure was high obviously, I'm in excruciating pain but also take BP meds. Family history of hypertension. My god, once I was finally given a room and hooked up to that fucking BP machine. Every 3-4 mins it would check my BP and then BEEEEEP BEEEEEEEP BEEEEEEP BEEEEEEEP. Over and over and over and over and nobody came. Eventually I just removed the BP cuff. THEN someone came in ohhh you can't have that off.One of the worst hospital experiences I've ever had. It felt like some mental warfare bullshit but I know it wasn't. But man, 3am, been there 12+ hours, couldn't have surgery yet so still have my issue, no sleep, and this fucking machine beeping and squeezing my arm to the point of bruising. It was awful","I agree with all this having been hospitalized a couple times. But another thing I NEVER considered was a couple I was friends with were having major infertility issues which carried over into Covid. Her last attempt lead to to an emergency hysterectomy and her husband wasn’t admitted into the room due to lockdown. Meanwhile, the hospital still played the “lullaby” every time a baby was born. She said it was the most traumatizing thing as she experienced a final loss of a child and massive surgery while reminded every few minutes of someone else’s joy.","One time I was in the hospital for several days I didn’t have this issue. Why didn’t I have this issue?Their machines were connected to the floor “hub” and all the information was fed to that hub and all the warning alarms and beeping (if needed) came from there. The only time an alarm went off was if something happened and something became disconnected or the battery was gonna die.Otherwise it was just quiet.","I know this probably isnt wht they are talking about. But I just spent 3 weeks in a hospital. I almost lost my fucking mind!The first week I needed. I get it. The second week, maybe, to watch me. By the third week, they wanted me there another entire week. I was in tears and begging the doctor to let me go home and do outpatient. I couldn't take it any longer.The NON STOP beeping. The nurse calls going off every 5 minutes 24 hours a day. They only thing that kept me sane was I downloaded a noise maker on my phone and had it on 24/7. Jungle noises, running stream, rain falling on car roof. I had to keep it varied or it would drive me nuts.I was so sick, in so much pain before the hospital, that I was suicidal. I was ready to end my life to end my suffering. The hospital stay helped get me better... but mentally, it was still utter fucking hell, and the beeping and noise was a good 50% of the misery I experienced.","I was in the hospital for 12 days this past year. I barely slept. The noise and lights were constant and the medical teams started their rounds at 430am. You do the math of how much I slept!",""],"points":7944},{"text":["Spain temporarily blocks Sam Altman's eyeball-scanning venture Worldcoin"],"points":0},{"text":["Google’s Genie game maker is what happens when AI watches 30K hrs of video games.","When they ran it, it just kept reproducing EA titles and paid dlc.","Wouldn't this just be the equivalent of all those randomly generated game levels that are so boring and uninteresting you couldn't pay me to play them? Also as someone pointed out, if it's so easy for the game companies to create this from an AI then why couldn't I just do the same thing and make my own games? Why would I pay anyone for AI generated content.","Mmmm samey platform garbage","Hi Google PR team","Shovelware just got a huge upgrade... The one trick game developers didnt want you to know.","The resources these companies are putting into replacing humans is astounding. Who would this be a product for? I wouldn't buy an AI generated game, because I could just generate my own equally shitty game.At a subconscious level, when you play a game you're not just enjoying it at a surface level, but also thinking about the time and craftsmanship that went into it, and *that* is what makes it impressive. You can feel the developers love come through in every frame.All of these large tech companies are proving that all the data they've harvested from us for the past 20 years hasn't helped them understand human behaviour at all.","30k hours isn't really a lot. There are people who have that in single games (Truck Simulator, popular MMOs, etc).","ai ai ai ai ai ai ai ai ai","Remember how technology was supposed to help humanity with menial jobs? Apparently art, games, and video making is now a menial job.Soon we'll all be forced to sweep streets for a living, but hey, at least we'll be able to go back home and inject some quick AI entertainment in our brains, so that's cool.","Looks like shit","Oh look, more AI news about something no one really wants. So much investment into something that will never be practical in the long run. AI will just create bloat and insane saturation in the market that will have substantial diminishing returns.AI as a tool to help with certain aspects of development is the best thing we will ever get out of it.","i will never play a video game made by an ai","I wish they'd just leave AI out of art. I want AI to improve my quality of life, not rip the soul out of every artistic medium I enjoy.","N00b level game hours.....","I thought the AI would just design a battle pass.","Creating games is a planned, deliberate act of art, some could say, planned, thought through by creators. It has a reflection of creators minds, it means something. This is just an empty can of nothingness. Deliberate copycats. Hopefully people will oppose those lonnies who are lobbying AI.","The video in the article looks like total trash.Like with writing, even at the highest level the games AI can generate won’t be any more than derivative garbage.I don’t see how this benefits anyone except making a few bucks as people flood platforms with even cheaper shovelware.I mean, if your goal is to make the internet useless, AI certainly seems to be getting there.","I think being able to turn my own sketches into platformer games to amuse me and my friends sounds hella cool. Or imagine a fighting game where you can draw your own stick figures and select a few stats and descriptors to define their fighting styles and play against your friends. Obviously the tech is not there yet. But it's gonna get there.","AI is needed as a tool to help create video games, since they can now take decades to make and millions of $.It can help create models that can then be tweeked manuely, which should speed things up a bit. Not sure I want a fully AI only game though.","This is an interesting tech demo in its absolute infancy so of course this anti technology ￼sub completely shits on it.Perhaps sometime in the future when it’s more advanced something like this could help smaller dev teams finish up levels they have designed allowing them to concentrate their time and budget on perfecting other parts of their game. I’ve played plenty of otherwise fun games where the levels all kind of look the same because the dev team probably ran out of time/money.Personally I would love it if AI could somehow make NPC’s not just repeat the same few lines over and over.","AI is about to create a game and request the “Devs” for $10 BTC to access it","30k hours? That's like 1 single Dota 2 pro's hours.","You wouldn’t think it at first glance, but image recognition and derived context is still just applied telemetry. What seems hard to understand is that we as humans have used this method of observation and growth implicitly since we were born. One of the most valuable aspects of Twitch and Mixer was that you had volunteer players to generate data, as well as a monetized customer base that rewards good players for training data. What should scare you more is how the same training is applied to robots and physical bodies. As the article shows, a robotic arm with a camera can improve in the same way, it’s just points of articulation instead of button presses.Take it the next step forward, and you can understand why the concept of Google glass or AR headset on a human during work hours is instrumental to AGI and ultimately training your replacement.","Damn, it watched 5 Factorio playthroughs?","Great for shareholders and CEOs and No.One.Else","Still has to be better than EA","Thought that bottom left picture was maplestory for a sec","Cancer website. It’s basically impossible to navigate on mobile.","https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Game-Genie-NES.jpg/1024px-Game-Genie-NES.jpg","This looks like shit, why is anyone excited about this?","Access to AI and the most powerful computers that run the most powerful AI, will eventually become prohibitively expensive. When that happens, we're all fucked.","How does AI watch 30k hrs ? Is it just processing or does it play and analyze?","They couldn’t buy the rights for Game Genie?","Hello Half-Life 3","If you can’t be bothered to make it, why should I be bothered to buy it?","Did they get permission of the game makers to use their works in training the AI?","AI Garbage, the sequel to Unity Asset Flippers, coming soon to Steam Early Access!","AI tech is barely out of its infancy stage, and these numbnuts are already pressing it into making something as artistically complex as a game, yeah I can see anything that gets spewed out of this technology in the next, let's be kind, 10 years being a complete and utter arse. But hey, it saves megacorps cash because they can yeet more people to the curb. We are truly rushing headlong into a dystopia.","30k hrs rank amateur ;) mainly it seems 2d platformers ? Eventually it may go somewhere it needs to start with 3D games.","1q22q2qlqQAqw29l29qo9qlaqq9q292l2wpaq0q2a2alq9l92l20Q0aq020QqaAaolq9w2Al9a91aq292 Lq92ALAOqql1laqq9a9QQ292Lq9QL2lq0q922oQ92Q2A2LAAL2O1qQq29QAqo2a2alq92q02laqa929a22oA9Qoq299la","yep that's what the world needs, AI taking the good artistic jobs and leaving the menial and unwanted ones to people","I think what we need to remember is that failure is not pointless, failure can BE the point. To fail, learn lessons, and use the collapsed corpse of that failure as a stepping stone to get a little closer.What exactly is Genie really trying to do? I have no idea.But it's clearly not really being worked on to create dogshit-looking platformers. In fact, I doubt the Google team even knows what it's trying to do. My guess is they're fucking around with fuck you money just to see if anything sticks when they throw all the pasta in Rome at the wall","All the money spent on this nonsense could feed, house, furnish said home, clothe, warm, cool, educate every single person on the planet.......twice.",""],"points":3200},{"text":["After collecting $22 million, AlphV ransomware group stages FBI takedown. Affiliate claims payment came from AlphV victim, and AlphV took the money and ran.","Lmao, these clowns really believed that there would be honour amongst thieves?","If there are conspiracy theories this one is it:1 in 3 people allegedly affected50% of all hospital/facility/pharm. are unable to bill for services rendered raising concerns over mass die off of rural hospital and providersFrom this there are discussions of UHC offering back loans to faculties and providers to get them paid....Services are still down and the scope has not been statedThe fact this is not a top new story in America baffles my mind, this story is proof we need to change the whole functionality of our healthcare system.","How long until one of these ransomware attacks causes the death of an American? What will we do to Russia when it happens? Because it's definitely sanctioned, if not directly by the Russian state, by Putin's KGB cronies.","🎶Billy Mack is a detective down in Texas, You know he knows just exactly what the facts is......."],"points":81},{"text":["Researchers tested leading AI models for copyright infringement using popular books, and GPT-4 performed worst","The title makes it seem like its a research project, and not a product made by a for profit company that has every reason to mislead others.And for the anti-AI people, tools like these are likely going to be used to nuke your favorite art sharing sites (even the sites with no AI allowed) by targeting fan art.","The movie studios tried to kill the VCR as a technology because it could be used for widespread copyright violation, but they failed. Maybe we need to figure out a way to get some of these copyright owners paid in some of these cases, but this technology is way too important and potentially useful to let them get in the way of progress.","shameless silly con greedy"],"points":4},{"text":["Russian authorities used facial recognition tech to identify and arrest Navalny funeral attendees | Cameras were installed days before the ceremony","This whole time I couldn’t see how Navalny’s death right before elections would benefit Putin. But now I see how getting people to out themselves could work. Can’t lose an election if the opposition don’t/can’t vote I guess.I’m speculating.","All or nearly all government-installed cameras in Moscow are connected to face recognition. And there's quite a lot of them already - the city is in top 10 in \"cameras per capita\" rating (edit: excluding China). Face recognition was added in ~2017 and used (still uses to this day as far as I know) NTechLab technologies.Face recognition was used to detain and fine people during earlier protests (2021 protests pop out in my head). The first time I remember the system was used to issue fines en masse to pedestrians (not drivers) was during COVID.","US conservatives: \"Write that down! Write that down!\"","I figured this was happening when we saw the long lines of people at the funeral.  They all gonna get visits from the FSB now.","Shit the MacGiver sunglasses should become a mass produced product","This is the authoritarian state of the American conservative’s dream. Intimidate the opposition into suppression.","That Techspot comment section.","Imagine a regime being so weak that a dead man is considered a threat.Putin and his cronies truly are fucking pathetic.","A possible future for Americans who practice their right to protest should project 25 be allowed to become our reality?","They have been reading the book on “Democracy” from the Chinese CCP.","Putin is a bitch along with the whole Russian government. Fuck all of them.","Did people seriously not see this coming?","That's not nice.","Dystopian as fuck","Of course they did, the front line needs more bodies","Where’s fucker Carlson today?????","I wonder what Tucker \"Russia is so much better than the west\" Asswipe Carlson would comment on this","Probably the reason people were refusing to take his body to Moscow for a few days.","But those subway stations sure are nice, huh Tucker?","Surprising no one."],"points":337},{"text":["OpenAI says Elon Musk agreed ChatGPT maker should become for profit","Of course he did. This lawsuit is nothing but him jealous that he can’t get his AI to compete.","If we could keep the racist slave driving man-child far away from the ai standard that would be great.","Tell him to go fuck himself","Elon is a full of envy and acting bitter for not controlling it himself it seems.I’m really glad OpenAI parted away from that unstable guy.","He also wanted it to be part of Tesla","Elon musk is one of the most selfish greedy people in American history, he exploits workers, funds corrupt politicians and dodges taxes. The world will be a better place when elon musk is gone, the only reason he cares about this is because he isn't the wone making the profit.","ClosedAI?","Elon - “ how dare OpenAI be for profit! I wanted to be the only AI company for profit” Fucking grow up you piece of shit.","Of course. He’s got a big orange baby sucking on that teat now and musk-mama needs to get more milk from somewhere","Grok ain’t catching up fast enough he’s trying to slow the other guys down.","That is how innovation happens tho","what about everyone else ?","He should focus on Grok","Still looking for ways to make up the huge losses he suffered when he bought twitter","These people spend years and decades to build a product and now he wants them to open source it ? It's like asking me working 10 years without salary.And about the non profit and benefit humanity - His cars are expensive as hell. Would benefit humanity more if he just mass produce cars and give people for free.","Mmm I'm not sure who to believe at this point, which maybe is the point of OpenAI saying this.Elon sued them a week ago and it takes them a week to respond with this? Seems more like a thought out marketing ploy. They're both shit at end of day, I don't care but at least at face value I think Elon seems more in the right at this point.","They should run at a loss instead? Whats the point of even mentioning this? \"Open\" doesn't mean you can't run a business on it, wtf is wrong with people?","🔴we need more posts from elon about everything and tesla will for sure get to $150 🫣"],"points":398},{"text":["EU moves to slap retroactive tariffs on electric vehicles from China","If dumping is against country laws and there is sufficient proof, I don't see the problem. See what happened to western solar industries when China did a similar thing (if true)","Lmao I love how the west only likes capitalism when it favours them.Why don't we have tariffs on all the plastic shite china has been producing for decades?Oh, that might cut into our precious CEO's profits, so we cant have that.","So..... are the chinese electric vehicles dangerous as Biden said or they just want a cut for themselvs and keep the prices high for domeatic EVs 🤔 ?","Fantastic news, finally the EU is waking upwe should allow Chinese cars in eu if we do it like this: It would make sense to force Chinese companies to assemble cars and make most components like the batteries and other tech in eu and only allow the Chinese company to own 49% of the business. Eu should also make Chinese companies transfer any relevant tech including batteries to their eu partner. Why? Because China did this for decades to European car manufacturers","Protectionism and barriers to free trade are terrible except when the US or EU do it.","What? “Retroactive”? And you are talking about fairness? What a fucking joke is that?","Proof that EU and US have become lazy and uncompetitive.","Don’t put in tariffs. Rather establish import limits.","[ Removed by Reddit ]","Good. It's a vastly unfair playing field with the rebate from the CCP can at times equal the full value of the car.","Users like that will always cut their nose off to spite their face.Wait until they need to start replace all the cheaply made parts in a year.","There just just be an outright ban on any company still doing business with Russia. MG, BYD etc all still sell there.","EU is taking their marching orders from their USA masters.I find it funny that the EU didn’t have a problem with Chinese EVs until the US government started their propaganda against Chinese EVs. Go ahead and keep the downvotes.","the ccp helps to fund these cars. they made so many they have fields in china where they are rotting. they also explode. they shouldnt be allowed outside of china.","Dear car european car industry, fuck off. If you don’t invest in R&D, tax che competition is a pure shite move","It’s not even remotely fair for a country to stockpile products and then flood foreign markets with disruptive, cheap capital goods.Stop acting like this is ok. If China, NK or Russia and to participate in the global economy they have to play by the same rules and stop stealing and stop the fraud and unfair business practicesWe don’t let our citizens do this. Why would we let China?","Jesus christ the Chinese social media farms are at full blast in these comments.","“Anti-subsidy duties” how is this translated from Newspeak?","Hardcore Leninist astroturfing in here.It's asinine for CCP stooges pretending to understand capitalism and the rule of law.","Very good if true"],"points":657}]