[{"text":["Emotion-tracking AI on the job: Workers fear being watched – and misunderstood"],"points":0},{"text":["Anthropic’s Claude 3 causes stir by seeming to realize when it was being tested | The model seemingly demonstrated a type of \"metacognition\" or self-awareness during an evaluation","the word “seeming” is important there.the glorified algorithm did not actually display anything even approaching “metacognition,” unless we are also going to suggest that a rock in my neighbor’s garden is displaying exceptional patience and serenity.","It might be called meta-awareness, but it’s definitely anomaly detection."],"points":13},{"text":["Apple terminates Epic Games developer account calling it a 'threat' to the iOS ecosystem"],"points":0},{"text":["Google Pixel sales increased by 527% in Japan in 2023","Specifically speaking, the Pixel 7a, released in May 2023, is likely one of the key devices in this spike in popularity as the phone’s release lines up with a sudden jump in market share in Q2 2023. Google has also continued to make Japan a key market for Pixel, with the country being one of the only launch markets for the Pixel Fold. IDC also cites a partnership between Google and Docomo in 2023 as a contributing factor. It also looks as though much of Google’s growth in Japan has come from users opting to purchase a Google Pixel phones over Samsung’s Galaxy devices. Samsung’s shipments dropped by 39%, which seems to show where at least some of Google’s sales are coming from.Seems like it is because Google is specifically targeting Japan as a market. They even launched the most recent pixel in Japan first, it looks like","Had no time to read; did they sell 527 Pixels compared to 1 in 2022?"],"points":11},{"text":["Canonical turns 20: Shaping the Ubuntu Linux world"],"points":0},{"text":["Oregon is about to sign — or veto — the strongest right-to-repair law yet","Companies will find a work around. They always do, and it sucks for the consumer","“Oh sorry, we’ve discontinued that model and no longer manufacture parts for it, maybe check Amazon or eBay, might find one there with 300% markup. Thanks for buying our crap sucker” click","This is some Outmodes vs. Madame Gasket shit.","Hope so. They want over $450 to repair my cracked screen on my 14 pro max.","People make fun of California prop 65 regarding product cancer awareness. Just wait until you can’t buy a toaster because it’s extra parts inventory hasn’t been certified"],"points":16},{"text":["Should you update to iOS 17.4? Here's what's new","A few things, but since none of them impact my life in a positive way I'll skip the risk of new release bugs and just go about my life.","Update to Android"],"points":20},{"text":["Amazon teams with recycling robot firm to track package waste"],"points":0},{"text":["Political deepfakes are spreading like wildfire thanks to GenAI","Going to be interesting. Usually we just have to deal with the politicians lying and the MSM to take things out of context or adding 'color' to buy clicks. Now we have to deal with user generated nonsense.","Using AI, social media will become saturated with negative/attack-based content to the point where all of it should eventually be ignored & forgotten as just an endless hose of unreliable shitty media.","It’s not like another company is insuring they don’t get made, this was kinda bound to happen.","It’s not thanks to GenAI, it’s thanks to idiots."],"points":7},{"text":["Amazon's new Rufus chatbot isn't bad -- but it isn't great, either"],"points":0},{"text":["Waymo launches driverless rides for employees in Austin","I don’t know if I’ll ever feel comfortable in a car that is “self driving” in my life.","We’re family.","I couldn’t care less about a self driving taxi… but that car is sexy as hell and crushes almost all new market cars."],"points":3},{"text":["Target to launch its own version of Amazon Prime, starting at $49/year","I'll pay triple if I can search for an item and get zero Chinese fly by night temu shit products like Amazon:​Search For: Dining Room DecorationsResults:DI-DGRITILY WINE RACKS OF DINING WINESHALYYTRNOO FLOWERS HOLDERSBOOPINIGHTYASO PLATESHABILEEDOO NAPKIN HOLDER US MADE FOR USSHABALABADOODOO CANDLES FOR DINING","Don’t turn into Walmart letting third party sellers ruin the online shopping experience.","Please, please don’t tell my wife","Don't sell me Chinese bullshit and I'll subscribe","They missed an opportunity if they don’t name it “bullseye”","Everybody wants a piece of that juicy cake","It starts at $49, but if it gets running and stays running with a decent subscription base they’ll jack the price up over time. This has happened to all the other similar online services. Prime isn’t even worth it anymore. It’s not like they offer that shipping window anymore. I don’t live in an area to benefit from the other benefits they’d offer.","Jesus Christ. All these places want to be memberships.","says on the website that it will be $99 a year","Additionally, it’s renaming Target RedCard credit and debit cards to Target Circle, which will now give customers an extra 5% off purchases.But I thought the red card already gets you 5% off? Or by ‘extra’, do they mean 10% total? Cuz I doubt that.","In case anyone else was looking for dates: - launches April 7 - promotional price of $49 for a year until May 18 - beyond May 18 price goes up to $99 unless using their Target credit card","I used to get free two day shipping on anything just for having a target card and now most things require a $35 minimum purchase. Make things worse and then charge you to make it better I guess.","If they would do free delivery from the local store to my home in a few hours WITHOUT the $35 minimum then I'd be in for this. The bigger problem is that most stuff is NOT available in store and so I'd wait for days for delivery, at which point Amazon and Walmart subscriptions offer more/better perks.","Yea but then you’ll have Shipt employees knocking on your door probably expecting a tip","Cool, now start a streaming service to make it worth it.","I live 5 miles from a Target so this is not for me, it’s far easier for me to same day pickup and do a drive up.If that they don’t have it, there are two other Targets that are about 15 miles from that Target that usually does.But if you don’t have a Target close like that or yours just sucks, I can see how this can be appealing.","I’ll see what they offer for products but if it’s even half as good as Prime I’ll drop Amazon in a heart beat. Cheaper and it’s not supporting Scamazon.","Thank you!","and then the next year $100","I'll try it if they suck I'll cancel. Anything is better than Amazon right now","All these commenters make me laugh. You dudes think Target isn’t going to allow resellers? Hahaha. Ha. Ha.It’s free money for a storefront. Tax the resellers, don’t stock it yourself.They’re going to be worse than Amazon out of the gate for scams and counterfeits, because they have no experience stopping it, and a tiny community of users for reviews.","don’t tell me…they’ll call it Target Bullseye","BWAHAHAHAHAHHAHA gdmt","What are they calling it? Sharpshooter? True Target?","When you see our prices you'll ship your pants, with us now featuring Target Prime.","So which streaming subscription will you get free with this membership?","$50/ year will turn into $150 in 5 years","This isn’t an Onion article?","$49 a year will last about 1 minute.","I’m down for that.","Will they call it, Targét?","Good news. Get it early while it lasts. They’ll surely succumb to the practices of Amazon.","And here, we, go","Amazon has 12 million different products. I don't see target coming close. I'm going to pay $50 a year just so I can get detergent delivered.","Are they going to have movies on demand too or just a shopping subscription?","Can’t wait to see what’s on their streaming platform","If I was a stock trader I would be selling their stock right now. This is a stupid as fuck idea.","Why not just implement dynamic pricing? /s","This could be nice, if it’s as helpful as Walmart+ has been for me.Honestly, I’ve considered dropping Amazon Prime and keeping only my Walmart+ because it’s been so convenient.","Do they have a streaming service?","A friendly reminder that Target is in business of developing surveillance technologies that violate privacy rights and disproportionately target Black communities.https://www.bloomberg.com/news/features/2021-08-25/how-target-tgt-police-surveilled-black-neighbors-in-inner-cities","lol for what?“free shipping same day on orders over 35$” or free 2 daywith amazon i get video and music.I don’t see myself buying this.y’all enjoy!","[deleted]","I'm in","Streaming tv content, too??!!","this is not tech news, but ok","How ignorantly innovative","Monkey see monkey do. Walmart just did it and don’t care for it. Keep ur membership to urself","I wouldn't buy things at target if it was free. Target can f off."],"points":1184},{"text":["Roku disables TVs and streaming devices until users consent to new terms","I miss being able to buy dumb TVs.I don't use any built in OS on any TV cuz they all suck. Just give me a damn tv with plenty of HDMI ports.","I literally stopped myself from buying one of their TVs upon reading this story.","Sounds like it wouldn’t be too difficult to argue that you agreed because you had to not because you agree. Whatever new terms Roku has fuck ‘em.","Hey Siri Insert Michael Jackson popcorn GIF","New terms force you into arbitration and forfeit your right to enter into any class action against them.","Seriously, how many people are suing Roku? If this is just about arbitration vs suing? How many of you read the EULA of every device, including your iPhone, isp, etc.","There’s a word for giving no choice but to “agree” with something. Hmm it’s right on the tip of my tongue …","Factory Reset. Take it offline. Run your apps through another platform (e.g., gaming console, Fire Stick, tethered electronics).","I would really love to live in a world when from a legal standpoint, no matter how long it's been since purchase, you would be entitled to a refund if you were locked out of using your device due to a change made after said purchase.It'd be pretty simple too, surely? All the lawmakers need to do is disallow the whole \"We reserve to right to change these terms any time we want\" clause in the ToS that you're forced to agree with to use it in the first place. It's a pretty basic thing in contract law that one party should not be allowed to change the terms of a contract after it has been agreed to, but somehow we as consumers have been allowed to waive that with zero oversight or repercussions for the companies taking advantage of it.","Isn’t this ransomware?","Feel free to click agree, that ToS wouldn't hold up for 5 seconds in front of a judge or jury if it came to that. ToS /= Law","The TVs are a pile of garbage anyway.","Buy a smart tv don’t connect to internet and use a computer with a wireless keyboard and mouse","I honestly want to replace my living room tv with a projector and screen.","FYI, easy fix to bypass without agreeing to anything if you have something like Chromecast: block your Roku TV on the router level from accessing the Internet. unplug it for a minute, plug it back in and when it starts up you'll be at the home screen without the forced terms screen and you'll be able to select inputs such as a Chromecast to stream.","OK, but why exactly are users suing Roku? Has our data been comprised? The devices are only $25 bucks!","So, you really don't OWN anything that works you are just left with a giant paper weight or landfill item when they see fit to change the rules and software and turn it into one and then there is that spyware question and problems where they can map you environment with the screen and listen in of the speakers which acts like microphones since it is the same basic technology not to mention mirroring which gives someone else access to whatever you are watching and then that can be used to extort depending who they sell that information too or try and induce you into some other actions for their benefit.Every piece of equipment you buy is now an inroad to profits, extortions and spying for that great good and the social credit scores you have to earn by way of business and government decree?Communism at it's best.SO, nothing NEW just on a much larger scale than before.N. S"],"points":182},{"text":["EU users can't update 3rd party iOS apps if abroad too long | Remember how Apple told you security was of paramount concern?"],"points":0},{"text":["Boffins propose fiber-optic network for the Moon","Many Boffins were killed getting us this information.","The moon will have fiber before I do... great!","theres fibre on the moon but its not in my area yet","Honestly, it probably makes more sense to use satellites at first and then transition to towers once you’ve got the infrastructure to build them. Not really sure you ever need large cable build outs.","Wouldn't radio work for communication or am I missing something?Edit: the cable itself can detect the movement without setting up ground stations, so that is why","I’ve been waiting years to get fiber to my place. While other neighborhoods within walking distance has it. If the moon gets it before me I’ll be fucking pissed lol"],"points":15},{"text":["Russian authorities used facial recognition tech to identify and arrest Navalny funeral attendees | Cameras were installed days before the ceremony","But he’s gonna be “re-elected”","That’s legit 1984 stuff there.","Sure, but have you seen the bread they have!","Everyone that wants peace in Ukraine, this is what you are going to subject the Ukrainian people to!If you aren’t willing to live under Putin don’t consign someone else to that fate just to buy yourself a false sense of security!","Gross","There must be an easy way to obscure your face without looking like you are doing so, no?","Russia is a weird place technology-wise. They have the resources for facial recognition but for some reason have yet to master safety features on windows, especially in tall buildings. This will end in tragedy.","I wonder why no one wants to be part of your friendly neighbourhood Russian Mir…","A vote for Bone Spurs is a vote for this.","I could have told you that. Saw all those folks standing in line and thought - they’re going to find you and arrest you.","Pretty sure everyone who attended that ceremony knew this would happen. They did it anyway because they, like Alexey Navalny, care more about national freedom than personal freedom.","How you can support Russia as an American is beyond me.","Gee who could've ever seen this coming","The most 1984 shit. When i read this as a young man i was like “Oh shit, this is a warning, but it will be heeded and I’ll never see this in my lifetime”.It’s frightening to see the signals light up on every book with a message or warning I’ve read since i was in high school suddenly glinting in real world events.It’s like the background stuff in children of men.We need to support Ukraine and build a stronger NATO. This kind of repression is the kind of thing anyone who truly believes in liberty knows that they can’t countenance it’s continued presence in the world without jeopardizing their own.","Cheap groceries! So much winning!","What a high quality, great country you got there Russia.","Such a petty, small man. Real baby dick energy.","Screw putin, murder’n lil twerp","It’s amazing how predictive science fiction can be. Think of Ray Bradbury’s 1953 “Fahrenheit 451” with hidden cameras, or Dick Tracy comic strips from the 70s and before with the crime fighting smart watch.","He’s so scared that little weak man","“Cough cough” …. Face mask… “cough cough”","Paging Tucker…this is all you bro","Voter turnout is too low because we arrested all the voters","Anyone who goes with a \"nothing to hide\" argument needs to consider this and explain how a future government in any country would not arrest and torture someone worse than death, just because of who they are.","But Tucker gushes that the church in which the funeral was held is \"so clean\"! (Bill Maher)","Is this what you want you America Yahoos?Oh wait, yes it is.....just like the majority of Russians.","That’s so funny. Everyone was saying that they could attend the funeral without any consequences when normally u get arrested for protesting. I really wanna see 100 years in the future, wonder how this situation and technology turns out..","Coming soon to the states","Russian citizens are pathetic for allowing this to happen to their own people. When will they decide enough is enough and rid their country of these oligarchs who only care for themselves?","Coming to a state near you!","Bannon is taking notes","that is why FSB and police all wore masks duh…","That is a nervous and panicked authority, it tells me Russia can be different within.","What did you think k-g_B was doing in the week they held his body?","Such a shame all of those windows were left open.","Unbelievable and disgusting","Should use the UV LED glasses I guess","I wonder why people didn’t wear masks…?","Hikvision?","What a shithole country. Anyone born there should make it their only goal in life to go live literally anywhere else.","Big brother ugh","Well that’s another giant step towards a horrifying human dystopia. Wooooo…","Putin can (and should) fuck off and die, in either order. I don’t generally wish death on people, but if a person is sufficiently shitty I’ll make an exception.Freedom for Ukraine.Hopefully after Putin carks it Russia can have a revolution where the current system of government can be replaced with a better one, but I won’t hold my breath. I’ll settle for the total collapse of Russia as a state though.","Holy 💩","As if the rest of the world doesn’t also use this tech.","To be bilked, Russia loves to bilk its citizens.","I would imagine many of the attendees knew this could happen; they certainly knew it was dangerous. I want to think there are enough of them to stick together and not be completely put down :(","Putin is a coward","Yeah.....it is like ....cool there is a turnout.......but then of course ....dread they must know fear.....will be reprisals against them for doing that.....","How pathetically petty. The scared little bitch regime","What about 3D printed Putin heads on sticks?Give the new cameras some extra faces to keep track of","authorities holding power in a vacuum of natural competition to smooth the cracks wont last.","Sheeple","If only democracies could show this level of foresight in planning good governance…","This clickbait title, and whole comment section here that clearly didn't read the article... Holy cow","Wow that is so fucked","This surely won't be used to monitor oligarchs and tighten control.It'll make it easier for when China sneaks a loyalist into the Kremlin.","lol, I still wear a mask out in public everywhere I go. It’s the best way to keep my face out of video surveillance, my chances of catching some kind of germ is nil, I save hundreds of dollars not having to buy and wear makeup and lipstick, and you can’t smell alcohol on my breath when my friends and I are day drinking. Masks are awesome.","Who didn’t see this shit coming a mile away?","Stock in companies supplying replacement windows in tall buildings skyrockets","Repressive authoritarian regimes do repressive shit","“Originally meant to identify and capture criminals, the network is now used to spot protestors.”","This seems like a good place to put this. Reflectacles. Get them before you can’t. https://www.reflectacles.com/","And how many people was arrested?","Thoughts Tucker?","Well I guess that’s better than jumping out a window to commit suicide of course","Which is why they allowed the funeral to be so public","If morale doesn’t improve the beatings will continue","I wonder if the NSA will install cameras at Assange’s funeral after his mysterious death once he’s extradited to the US…","That's some 5d chess move","More like killary am I right"],"points":661},{"text":["The EU’s new competition rules are going live — here’s how tech giants are responding"],"points":0}]