[{"text":["7 ways Nothing Phone 2a beats Pixel 7a"],"points":0},{"text":["Over 200 Apple Watches recovered from Illinois lakes by metal detectorist and diver","It’s the bands. Unless you have a closed loop band they love to come off in the water.","Apple watches are flat they make nice skipping stones.","Are arms connected to those watches?","Are we just accepting “metal detectorist”?","Yeah I threw mine in there, terrible product","At least I know not to wear the watch in water now.","Were the bodies still attached???","Odd way to do QC","Lost my first one because of their shitty band. My second one I bought a good aftermarket band that stays on .","Sport loop or bust for activities. It’s the only way.","I blame jet skis.","Any Garmins? lol","Water resistant or not? 🤣🤣🤣","Wow","Seems a little presumptuous that anyone wants theirs back.","I wonder how many guns they pulled up?","[deleted]"],"points":565},{"text":["So long and thanks for all the pixels: Nvidia reportedly retiring the GTX brand for good | Once existing stocks of GTX 16 series cards are sold, it's game over.","Game over? They are just renaming shit it doesn’t matter lol","I mean this is kinda both news and non-news, they did a total rebrand of GTX to RTX already, and implied that RTX would replace GTX.It also means we don't have the situation where there is room for confusion between the old 5000 series from the early 2000s and the presumably about to be released 5000 series","I, for one, look forward to the XTX.","lol well that's a stupid article","Who even remembers what GTX used to stand for? Gigatexel. The 4090 has now reached Teratexel territory. :)","Weve known this for a while however the headline is misleading. It's not game over they still make RTX cards","Still rocking a 1660Ti","Dammit the 16 série isn't even worth it to purchase at normal price where I am :(I guess they will increase... Again...Better go with the 2060 at that point ;(","What happens to those with valid RMAs once the stock is gone? Do they just say “tough luck” or they get a freebie upgrade?","What’s going to happen to those 11 GT 1630 owners?","Updates for gtx cards will end October of 2024.","My 1070 still going strong","Ok, and? It's a news of the caliber of 'NVidia drops GTS and will use GTX instead, omg!!!!!!'...","Dolphins?"],"points":973},{"text":["FDA approves the first over-the-counter continuous glucose monitor | It will be available starting this summer.","They better be cheaper than prescription CGM, says the diabetic.","You wanna know what’s crazy? Even though glucometers are OTC, EMTs in New Jersey aren’t allowed to use them, since the EMSCNJ says the procedure is “too invasive”","I don't really understand this news. The Freestyle 2 CGM has been available OTC in Europe for, what, 4 years?What took the FDA so long in approving a CGM, and why only this one?","The only this works is if they make affordable and don’t be greedy.","I’m confused. It says this is aimed at people who don’t take insulin. Doesn’t that eliminate the vast majority of the addressable market for a product like this?","I bet it will be $200/month"],"points":75},{"text":["Roku disables TVs and streaming devices until users consent to new terms","Hostility towards their own consumers?Nice to see them keep up with the times.","Pretty sure that'd be illegal. Like i bought the TV, agreed to original terms. It's now my tv. i'm not renting it. you wanna change the rules and change your paid bonus service, sure, but the tv itself better still give me what i paid for.it's completly insane to think anything else.","This is what I hate about smart TVs: There’s virtually no normal TVs on the market, their processing power sucks, and it’s riddled with all this anti-consumer garbage!","For fucks sake, can the government start to catch up and actually regulate some of this shit. The fucking dinosaurs in power that can’t even figure out their emails in 2024 are really fucking damaging the country.","I won't be buying any of their crap in the future.Who am I kidding? I'd need an assistant to keep up with all of the companies that try to fuck us over.","Looks like I don’t need a Roku tv.","Thank god I haven’t connected my Roku TV to the internet since I’ve bought it.","If you don’t agree then you should legally be entitled to a full refund for the product by the manufacturer. These laws need to be updated to protect consumers from buying products that the manufacturer can render useless if you don’t agree to their demands. They basically hold the products they sell you hostage and the ransom is our consent to be fucked.","I am about to start shopping for a TV. I have a TCL Roku.TCL's screen has screen rot (significant dimming in areas), after a few years of use.TCL's youtube app is showing black screen after returning from an ad about 50% of the time. This just started in the last month. It is incredibly obnoxious. Sometimes happens more than once during the same video.TCL's youtube app starts an audio ad at startup and after a video, every time (it didn't do this when I bought it).And I am not onboard with the 'accept or your TV is bricked' terms.I will be shopping for a new TV that is neither TCL nor uses the Roku OS.","Sounds like the kind of coercion someone might argue in court negates a contract. Hmmmm","So the HP school of marketing, be as hostile to the users as possible.","This happened to my two TVs. The only way I found to avoid accepting the terms was to hold the reset button and reboot the TV using the remote, and then set the device up from scratch with no internet. Now they will be offline TVs. I also submitted an FCC complaint, and you should too!","They chose a curious path. TiVo says good luck","Understood. I will never buy a Roku product from here.","Those terms basically say \"hey no matter what you agree to not sue us.\"Honestly arbitration and any contracts like this should be completely illegal.","It would be funny if thousands of people started filing arbitration claims regarding Roku forcing them to accept new arbitration terms to use their device.","Welcome to the future consent to these terms or the former products or services you had access to will be blocked. Doesn’t really feel like consent does it?","Yeah, I got this on my secondary TV in my bedroom the other night and was immediately pissed. The fact that it's fucking legal to take a TV that I have bought and paid for years ago now and make it useless unless I agree to your new rules is shit. Fine. Don't let me use the Roku app. But let me fucking change inputs and use my TV. And the only options given where \"Agree\"or turn it off and throw it away. Oh, you can opt out by mail in 30 days... Roku is officially dead to me.","I'm absolutely puzzled why we let companies set their own terms and conditions. Keep saying this, we need to treat businessmen like children in a candy store, they will just keep fucking about if you dont.Talk about taking the piss and jamming you into any terms they want..Why is this bullshit legal? Surely we can one standard terms and conditions for fuckin televisions and the apps...","I had this happen to me last night! I don't even stream on the damn thing, I just use it as a PC monitor. I couldn't access even the HDMI inputs without agreeing to these new terms (which was bullshit about waiving rights to class action lawsuits).I bought this thing four years ago. We're already in the \"You'll own nothing\" era if they can just shut it down and lock you out like this. What if I didn't want to agree to these terms? Which frankly I didn't, but I wasn't interested in my flat screen becoming a doorstop either!","I will never buy another TV from them.","PlayStation is the same: one can’t access the console or games they paid for unless agreeing to an update. There’s no opt out, other than not upgrading and bricking your console. This and other bullying, and the Roku scam should be put to governments to be regulated and outlawed. Either we own the products we purchase or we do not. This tactic, along with subscription services for previously included features, is unethical and amoral corporate gaslighting and consumer coercion. People have to put a stop to these practices, pronto","(Former) customers will just find some other form of media entertainment. It’s not like there aren’t any other choices.","Smell that? Smells like a class action lawsuit a brewing.","Laughs in European...Forced arbitration being illegal in most EU and non-EU European countries.","I wonder if this is also why my Google integration stopped working recently. I had to completely disconnect Roku from Google home and then add it back. I bet when I signed into Roku to link them back I accepted some new terms.","Shrinkflation here too. Same price, more hassle, less TV.","Fine, as long as you can return the device for a full refund if you don't consent.","How the fuck is that legal, that’s just blackmail","Dude, this is insane. Wife turned on the TV and this new terms popped up right in the middle of the screen. Couldn’t get rid of it for about 20min. I forgot where I placed my Roku remote (I never used it lol). Trying to get rid of it using the TV buttons, no success. Finally found the remote, and now the batteries are dead. WTF? What if I am no accepting the new T&C, where is the button to disagree?","And this is why I A) only buy dumb devices when I can B) do not connect \"smart tvs\" or Smart Bluray players\" to the internet at all.I like my TVs dumb.","One of the best purchases I made 7-8 years ago was a smart tv I never bothered connecting to the internet and an Apple TV. Shit just works. I fear the day my tv dies. I hope to find a dumb tv out there lol","I know consumers will tolerate a lot of bullshit.But one thing you never do is turn their tv/internet/online media off.That is something that will guranteed a massive loss of customers and permanent reputation damage.","This wouldn’t trigger if your tv isn’t connected to the internet right?","Good, hope my piece of shit brother can't figure out how to update his fancy fucking 72in Roku tv he bought after telling me I cost too much money to keep living with him.","Piracy wins again…","\"I am altering the deal. Pray I don't alter it any further.\"","Roku doesn't really make any money until you start using its products.Over the 12 months ended in Sept. 2023, Roku sold $471 million worth of streaming sticks, set-top players, branded smart TVs, and other devices.BUT the cost to manufacture those devices came out to $538 million. So, why would Roku willingly sell its devices at a loss?When Roku filed its IPO prospectus with the Securities and Exchange Commission (SEC) ahead of its market debut, it provided a detailed overview of its business. Under the section describing its products, first on the list wasn't its smart TVs or streaming players, it was advertising. Roku's advertising business, which includes video ads, audience development for streaming services, and brand sponsorships, is the backbone of its platform.So what do you think these new user terms are all about?The reality is that the advertisement industry are ALL OVER smart TVs. They will be cheap, but you'll not be able to purchase one \"full price\" to avoid the advertising hellscape they will soon become.","This is exactly why I disconnected my Samsung tv from WiFi and changed the ssid. Can’t shut it down if they can’t access it","Something the article didn’t make clear, to me anyway, does the TV function as a TV without agreeing to these terms? For example, can I still watch OTA or an external input without agreeing to the terms?","Excuse my ignorance, but why is everyone up in arms about having to agree to new terms of service? Is there something in the new terms that is worth boycotting or just the idea of having to agree to new terms?","Note to self, never buy anything from Roku.","Apple TV 4K is the way. I have a ATV4K in my living room but a Roku Streaming Stick+ in my bedroom and I hate using the Roku, it is so slow and clunky. Switching apps takes forever.The difference is basically like when you get your first computer with an SSD as the boot drive. It seems like it is a little faster but then you go back and use a PC with an HDD and you’re like why is this taking so long. Yes the difference between an Apple TV and the most powerful Roku is that much.","I recall three or so years ago, I did a TV install for an older lady. TV required internet to finish setting it up...Quick background. Very rural Oklahoma, I work for a small IT support and management shop. Requests for setting up simple tech like this isn't uncommon. Finding a TV that requires internet to finish setting it up, that's uncommon. As of now, so far that TV is the only one I stumbled upon.I got her setup using my cell hotspot for moment, my family and I barely use half of the data allotted each month anyways. The lady however had no internet, she didn't need it (older lady, but still physically well).I don't recall the make and model, and last I knew, the lady no longer lived in said home some time later when I wanted to check up on her. I didn't see a need to find out more from there. But that damn model eludes me, and I want to know which one that was. Facts help make this reshared story more believable...","Research the laws in the EU that make this illegal.Push representatives to make similar laws.","i'd call my credit card and get this thing reverse-charged !","Huh. Looks like they missed me.","I will never buy another roku tv and sold my Roku stock Holdings users equipment hostage is a shitty business model","How to go out of business 101.",""],"points":5619},{"text":["Flipper Zero's Co-Founder Says the Hacking Tool Is All About Exposing Big Tech's Shoddy Security","I use mine as a white hat tool. A lot of my clients have secure building entry systems that I have access to. So far only one of them was secure against me cloning the fob and using it as an entrance key. Yes, they were all immediately informed. Everyone said that they were going to swap out the system to a secure model.To date, no one has actually swapped out the security system.","I agree with what they are doing. Tech has notoriously treated security as an add on and not a core part of their products.There used to be a weekly video from Hacker News Network which did a round up of who had the most insecure stuff. A few companies fixed their crap after appearing on the list. A few others were on it for a very very long time and let us know exactly whose products to avoid ( hint: HP ).I’d like to see these guys publish a list of whose crap they broke into and how long it took.","There are waaaaaaaay too many wireless communicating devices out there that if you just parrot what they say you can absolutely destroy their \"security\"","Nothing wrong with the tool being out there, existing laws should handle/cover when it's used maliciously.Just because you \"can\" hack into something, doesn't give you the \"right\" to do so.It's no different than if someone left their car door unlocked, you still don't have permission to enter.People are just pissed because it's actually showcasing how \"easily\" certain things can be broken into and reacting to it as if that's some major problem and to ban the product... doing that won't address the underlying issue.","And lock picking tools are just to show how insecure locks are.","Normal people think you are some kind of hacking wizard for having and using one.","Is t it cheaper to pay the occasional ransom than invest in something like security? Business care about the money not the customer.","Security by obscurity does not work, anyone that wanted one of these had one before. It being more accessible just means companies can't pretend these issues don't exist anymore. The flipper zero is a fun toy but is not a complicated device and intentionally limits it's own abilities. If your device can be hacked by a flipper zero your security is pathetic and needs to be addressed.","Most of the tech companies I've worked for treat security as an afterthought. Often only when they try to get a product certified does cybersecurity come up and then they search for the minimum viable solution to the problem.","God I want one of these so bad. Looks like fun","Most physical locks are simply deterrents meant to keep honest people honestMost people have the wherewithal to see an unfamiliar padlock and think, “that’s not for me”When somebody -wants- to infiltrate, they will make the effort to do so, and most consumer grade safeguards are flimsy against this, I can imagine cyber security would have some parallels? I am talking out of my ass","Just throw a wrench right into that rube goldberd","How does it work","Are they still sold out everywhere","*and money","You mean security through obscurity isn't a successful long-term plan?","Tired of the blatant flipper advertising on reddit","Regardless of their motivations for selling this product, it wouldn't be a problem if the industry didn't have shoddy security to begin with.","Tin hat on -> Alright, hear me out. This is a company with russian founders, mostly russian and Serbian employees (some Ukrainian, must admit), that wants you to scan all the security things, save them to the device, which is connected to the net via your phone app or pc. With some social engineering and gamification involved. The dolphin Flipper gets XP and gets “happy” when you scan things. Does this not ring any bells??? -> tin hat off.","The “S” in “IT” stands for “Security”.The “E” in “IT” stands for “Ethics.”Security and ethics are a core aspect of infosec and seems often lacking from information technology.","I really should buy one of these before they're banned...","Most of big tech is phenomenal at security. It’s everybody else that does a shit job. Apple/Amazon/Google take it incredibly seriously.MSFT probably does too but some of those azure vulnerabilities have been scary","You'd be surprised at how common this opinion is among hackers. If it can be hacked, then it should be hacked is what ive heard a lot. well, more accurately, they hacked it themselves.I had an acquaintance who hacked the old AOL chats to a comical extent and had even reported it to AOL and the FBI themselves but they just never fixed the things he was exploiting.He developed a hatred of big tech due to this and just thinks companies should be wrecked if they leave themselves exposed.ive seen similar sentiment expressed while I was in network security college and on forums dedicated to the topic. My view has always been \"their security is weak, thats unfortunate. hopefully they fix it.\" but many people are like \"their security is weak, i hope someone wrecks their company through the vulnerabilities, and im going to laugh and feel great when it happens\" its strange to me.","What sucks is the crooks take advantage of vulnerabilities, leaving regular ppl like me to have 3 different Authenticator apps, 5 different MFA’s. And 20 different “strong passwords” saved to 100 different sites.. I wish I could just login with my “qwerty123” password and be done with it.","Of course. And guns only shoot bad people.","So explain it to me like a complete layman…wgat the hell is this thing?","Pretty weak ass excuse to make an easily useable item that criminals can use to steal cars, credit cards, any pretty much any electronic key.","Are there any other devices like this??","Anyone know a good and reliable resource/website for flipper zero tools/code/software?","Swear to god Target is using these in all of their locations to jam phones. As soon as I walk in their store my phone is useless.","I wanna buy one before they make some stupid law against these things like they're doing in Canada.","Where to get one?","Unfortunately the argument 'our device just exposes lousy security' isn't going to get much traction in the minds of courts and legislators.If police catch me opening car doors with unlocking tools, my explanation \"I was just going to leave a note to the owners on the dashboard saying they need to invest in a better car alarm\" probably isn't going to keep me from going to jail.","custom flipper zero skins","Big tech is also working with fbi and cia and nsa, to have shoddy security and ignorant users so that servalance state can exist easier. Its not even a sicret at this point... What is scare is that, wifi can be used to literally see through walls, wonder how long the agencies have known about that feature...","Flipper Zero is all about making money, dont be fooled","sure.and yuzu was just meant for game preservation and for playing legal personal backups.","Woah I’ve never heard of r/gadets but fuck yes I love gadgets","Whatever you gotta tell yourself bud"],"points":1640},{"text":["Seven Years Ago, Nintendo’s Risky Gamble Paid Off Handsomely","And seven years later we still have not seen a new Metroid prime","It does not feel like 7 years","I think anything that wasnt the wii u was going to do great. The wiiu was just a miss on product name. People thought it was just a Wii upgrade and not a whole new console generation","I dunno. I know a lot of people wanted a console handheld hybrid from Nintendo for a while and probably seemed like a sad bet.I'd consider the Wii a far bigger gamble.The big question is if the Switch 2, most likely being underpowered compared to other current gaming handhelds and consoles, will be successful... Lol that's a trick question. Of course it will be.","Wouldn't really call it a risk. They took motion controls which were popular because of the Wii and added it to a tablet with a controller. It's more akin to people saying, why didn't I think of that.","The Switch seemed more like a logical progression of the Wii U than a gamble. When it came to the WII U there was some confusion about the tablet controller being its own stand alone device. I always believed Nintendo clued in on that and recognized they could consolidate their portable gaming and console markets into one.","'Risky gamble'? They took the handheld portion of their highest selling console of all time (Nintendo DS, and 2nd best selling - GameBoy) and combined it with the motion control joysticks of their 3rd best selling console (Wii).They did this at a time where mobile gaming was blowing up, and tablet sales showed they weren't just a fad.I'd say the 'riskiest' part of their release of the Switch was to not offer streaming services on it. I used to commute on public transportation 3hrs a day, and I would have loved to have had the option to watch Netflix on this thing, instead of bringing this and a tablet to/from work every day.","This is the only console I bother spending time with. Not surprised.","can’t wait for mario kart 8 Ultimate edition.","YUZU'S didn't","3 sets of joycons later, all broken.","Don’t worry, in another 5 years, they will cut off all support to it. Disable its access to the store. Then never do anything with it again all while showing you the all new and improved switch 2. Which should be called the switcharoo.","I’d still love a system that gives a shit about graphics instead of just offering portability.","Its amazing how they go back and forth between nearly failing and completely succeeding.","Everyone saying it wasn’t risky has clearly forgotten what things were like for Nintendo during the WiiU.So many people calling for Nintendo to just make a regular high powered system. That’s all you saw on Reddit. When it was first announced, there was disappointment especially when the price was announced. No one knew BotW would be as massive as it was. That was another gamble.In 2017, If you predicted the switch was going to be the best selling console of all time, people would have laughed at you. Heck people were saying the only reason it was selling so well for like the first year was because diehard Nintendo fans. Then it was because everyone already had a ps4. Then it was because the ps5 was hard to get.In case you all forgot the sentiment surrounding the launch date and price announcement:https://www.reddit.com/r/Games/s/dKPVe6Xm05","\"Risky\"?They knew it'd be a success.","I’d love if they were able to put a separate GPU in the dock for the next switch. We have the technology to implement it. They could even sell a base dock and an upgraded pro dock.That way you still get decent battery life while on the go but it can compete with other systems while plugged into the TV.","And is still paying off handsomely. There's a reason we won't see a successor for another year at least; Nintendo simply doesn't need one.","Risky??","Hadn’t played games for about 9 years until I bought the Switch for my son, deeming myself too old and just generally over console gaming. But now it’s MY Switch and loving the experience haha. The portability of the machine and the fact it looks great playing it on TV or monitor plus heaps of good games is an absolute winner. Looking forward to Switch 2, for my son of course…😈","It’s crazy how, if the Switch failed like the Wii U did, there’s an extremely high chance we’d be seeing Zelda and Mario on Sony/Microsoft platforms.","Gamble? When was any Nintendo handheld not successful","Nintendo could shut down the stores for all their older consoles and we would still be lining up to enthusiastically fellate. Oh, wait","Sure but what next? Imo a slightly upgraded switch isn’t going to cut it","Remember when it magically got Bluetooth capabilities five years into its life?","Of course, Nin-ten-do, as we are all well aware, stands for “Risky Gamble that Pays Off Handsomely” in Japanese…go figure","Was it really a risky gamble, it’s literally what people been asking Nintendo to do for a good 10+ years before the Switch was ever announced.","Step 1, launch with the most popular Zelda game ever","They could shit in a pan and it would sell well.","Nintendo made this and then Steam made improvements with theirs","Good. I love the thing. Play it almost every day and still have a huge backlog. Tears of the Kingdom is a masterpiece that I can't stop playing, and still have not finished because I actually want to 100% it other than korok seeds and compendium LOL","If this stuff wasn’t all exclusive, we could enjoy it on better systems, but in the pursuit of maximizing their console profits they throw logic to the wayside and everyone loses.We lose because we can’t play their games at modern quality legally, and they loose because people do it anyway but illegally. There’s no way the profit from the Switch is worth the loss of making the games all exclusive.","I still don't get why it's so popular besides people loving Nintendo games. I'm pretty sure the main buying reason/use case is not taking your console on the bus.","It wasn’t a risk at all. Kotaku are such horrible writers. I haven’t looked at that website in years and I will never go back.","And then Yuzu wanted some","Last Nintendo product I bought was a Wii, seems they have yet to truly evolve past that.","Was it really risky? They saw the success of the 3DS and combined it with the rough concept of the Wii U and it worked","Funny timing on this overwhelmingly positive article",""],"points":898}]