[{"text":["ASML delivers cutting-edge new chipmaking tool — third-generation EUV enables 2nm processors and beyond","Am I the only one to read that as ASMR and think “that’s an interesting approach to make chips…” followed by “oh no you are just an idiot”","Just placed my order","Dutch pride"],"points":5},{"text":["'Drinking bird' toys upgraded to generate clean energy from water","Everytime I see one of those I think of the Simpsons","The max power output of this set up was: 40 μWFor perspective, if this was scaled up 8000x, it would just barely be able to power an iphone on standby.Paper here: https://www.cell.com/device/fulltext/S2666-9986(24)00108-X","In this house, we obey the laws of thermodynamics!","Where’s the “any” key?","Shit, they still make them?! I remember being in a toy store in the early seventies and being spellbound by one of those as a tyke","I must be in idiot for assuming the friction will require frequent intervention (energy) to reset it.Might as well build a wind-up generator.","How feasible is this to be made at a larger scale?","Neat","HOMER WAS RIGHT","I love this","Bigger innovation than it’ll get credit for"],"points":184},{"text":["Google Phone app removes Nearby places search","Is it just me or was that article really confusing? Was that written by some shitty bot?"],"points":1},{"text":["Armies of humanoid robots to be for sale soon","Great","Do they have to go to reboot camp?","Do you want a skynet? Because that's how you get a skynet!","What happens if ransomware makes them simultaneously BSOD? 🤣","Roger roger","Hopefully this doesn't lead to a planetary dispute concerning the taxation of trade routes","what could go wrong","Drone/Robot laws coming to a city hall near you","I feel like humanoid robots defeats the purpose of robots. Shouldn’t they like.. do something better than the humanoid form is capable of? Otherwise what’s the point? We already have humanoid humans","Bout damn time. The United States government had those things holed up in mountains, with machine guns strapped to them for a decade or more.","Armies?","Why was this phrased with the word “armies”?","Look up on memory alpha about the bell riots…it’s kinda freaky how the time it takes place coincides with our potential future.","What company is to blame and how do i invest in them.","Sounds like someone needs to bring them some managed democracy.","This has no potential to end in complete disaster.","Thank god! As a child I always prayed to spend my later adulthood in a dystopian nightmare!","I can’t wait to verbally abuse my new slave robot.","Are they “3 laws” safe?","USPS likes this","Hopefully we give them adaptive AI!","So let’s say I know a guy, and he needs an army of robots…. Where would I need to call. Also are they any good at hunting bipeds?","Chappie is becoming a reality","Probably this is gonna be a hot take, but, I don't think I can be more real than this, so, Personally, I am expecting a lot of boycotting and destructive behavior towards them as well as the necessity of robot protection solutions, like well equipped security personnel at the facilities and on terrain for potential cases of abuses of delivery robots. Sounds dystopian, but there will be jobs and training for us humans in various other fields which require our fine tuning/touch, although there will be some time until people will adapt to the new reality. I know many across the web who used to complain about being treated as robots, well, to those I can tell only this: you are about to get freedom now.","Watch the movie “2050”","Good. Once both sides have them wars can be fought without human suffering.","Between this and AI boom we finna lose so many jobs 😭","Taking proxy wars to the next level I see.","Robots belong screwed down to the floor in factories. When we unbot them, control is lost forever!","Take notes, pictures - the first generation of humanoid robots is born. Can imagine in a few generations they’ll be sleeker, stronger and ruling the world.","Looking forward to my robot butler / housekeeper / cleaner / security guard / gardener / cook / chauffeur.Will skip the pleasure model.","The drone wars has already begun. The robot wars has been a long time coming. That these robots will be owned and operated by companies pretty much guarantees a corporate dystopian future.","It’s about time. I’m tired of doing my own laundry.","The Clone Wars begun has.","All the people complaining about incompetent people, illegals and lazy folks will get what they dreamt for now","Automate the wars away","It’s a fantasy that will age quickly upon realisation.","Subscription based for nice even cash flows.Like YouTube, users will develop features/ preferences, desirable features will go through a paywall …You want heated seats? (I’m Canadian) Here’s your subscription fee for that option.I wonder how long it will take for people to realize that robots may not be cheaper?Finally, you’ve outsourced, robotized your entire production process …What’s stopping me from copying/ duplicating your entire business?You’ve given me every piece of information to run your business, I’ll copy it and you’re done …Embrace, extend, and extinguish.","I think I’ve seen this movie already. Liam Neeson and Ewan McGregor were great in it.","Our lawmakers are already 3 advanced technologies behind in regulations.","Roger roger.","Subscription based … but of course it is","Can’t wait to see what happens when these iot devices get hacked. Not like they are mobile devices that can cause a ton of damage rather than being disabled until the owners pay a bitcoin ransom.","I've been waiting for 86 yrs.","But will the Amazon robot picker-packers get to pee in Gatorade bottles?","I can’t wait to buy one used","Please use AI.Please use AI.Please use AI.","The Clone Wars has begun.","KILL ALL THE P00RS!","Did no one watch the movies??","They aren't for sale. It's a RAAS, meaning you basically rent them. Great job reading the article.","Cant wait till we have robots in our home sweeping and stuff"],"points":210}]