[{"text":["A.I. Is Learning What It Means to Be Alive","Great , it seems to be ahead of us humans in that aspect then","After that, it stretches, burns, and breaks things to achieve more, GREAT!AmerInds, almost all, had ways to teach the young'uns how to just take what they need, leave more for everyone/everything else and later...These AI dipshitz seem to, ALL of them, have never learned that lesson.Now, we will soon ALL of us be subject to that lack of self control- EVEN IF the US shuts down this dangerous tech, the cat's out of the bag, it's too late to stop it...There's a scifi short story from a decade or two back... The protagonist is the UN cleanup guy that has to deal with all the \"Third World\" countries that have been experimenting with homemade singularities (black holes) for power production...The rest of the world has already figured out that down this path lay destruction for all- once a black hole created on Earth goes out of control (and nope, so-called \"third world\" countries learned the hard way that making one and CONTROLLING one are two totally different things), it would then sink to the center of our planet and begin consuming it. Us. All.But the nature of a singularity is that nobody outside the Event Horizon can know what's going on INSIDE that Event Horizon... So once someone loses control of one, ALL of our fates are now sealed, sucking down into that implacable maw, and nobody will know until somebody outside our planet notices that it's, that we're gone...This UN operative had to explain to various members of small African governments, reps or leaders of their respective energy ministries, about how this happened, the limits of human science and control. And it all ended up the same- he had to clean out the inside of his vehicle and replace passenger-side windows, again and again, as his passengers each finally figured out the gravity (ohh, I'm so sorry for that!!) of what their country had done and then capped themselves soon after."],"points":0},{"text":["Google Is Getting Thousands of Deepfake Porn Complaints"],"points":0},{"text":["Google Wallet can now show movie tickets and boarding passes from Gmail"],"points":0},{"text":["Samsung Galaxy A55 and Galaxy A35 launch with four years of Android updates","Cool beans.– sent from my five year old iPhone"],"points":1},{"text":["Pixel 8 series adds display output support with Android QPR3 beta"],"points":0},{"text":["Apple ramps up work on ad-supported Apple TV+ plan"],"points":0},{"text":["Tim Cook makes surprise appearance during Porsche event to talk Vision Pro","Wow how cool, two companies who have made it well past their glory days working together to milk every last drop of relevancy out of their wildly fervent clientele."],"points":3},{"text":["Bitcoin hits record above $72,000 as demand frenzy intensifies","Imagine the stupid money you could have made off nvidia and bitcoin…","Extraordinary popular delusions and the madness of crowds","Bitcoin hit a record high above $72,000, as the biggest cryptocurrency's surge showed no signs of slowing down. Bitcoin was last up 4.4% at $72,649 after reaching as high as $72,739.The world's most valuable cryptocurrency has been boosted by a flood of cash into new spot bitcoin exchange-traded funds and hopes that the Federal Reserve will soon cut interest rates. \"The recent surge in Bitcoin's value ... underscores the remarkable strength and resilience of the leading cryptocurrency,” Bitfinex analysts said in a research note. Read the full story for more.","Pump it Bogdan!","Yawn."],"points":12},{"text":["Microsoft's sneaky KB5001716 Windows 10 update pushes Windows 11","I want to go Linux so bad but sadly some anti cheat’s for games still don’t work under Linux.","This update fails to install on my old laptop which is way out of support for Windows 11, but sticks in Windows Update so it continues to attempt to install. I had to use the Windows 10 Show Or Hide Windows Tool to hide it.","Strange but ok","If I already didn’t hate Apple so much for pulling all the same crap, I’d give up Windows. Why can’t M$FT just stop acting like complete assh0les?"],"points":12},{"text":["A Ready Player One metaverse experience from Open coming soon!","What we are really missing at this point is the 360 degree treadmill that has you strapped in. I played some vr games where I had to push on the controller to move and it totally kills immersion."],"points":1},{"text":["Boeing whistleblower found dead in US","Excerpts:John Barnett had worked for Boeing for 32 years, until his retirement in 2017.In the days before his death, he had been giving evidence in a whistleblower lawsuit against the company.Last week, he gave a formal deposition in which he was questioned by Boeing's lawyers, before being cross-examined by his own counsel.He had been due to undergo further questioning on Saturday. When he did not appear, enquiries were made at his hotel.He was subsequently found dead in his truck in the hotel car park.The Charleston County coroner confirmed his death to the BBC on Monday.It said the 62-year-old had died from a \"self-inflicted\" wound on 9 March and police were investigating.","Being at Boeing for that long, he must have seen some shit, most notably it turning into the giant steaming pile of shit it is today.","damn they don't give a shit anymore, hope what he said is enough to proceed with the lawsuit","Boeing recently had a bad flight with dozens injured. This is a not looking like a good year for them","Holy fucking shit","Proof This happens ,not just in movies.","You think Boeing had him killed?","Wtf this is an insane move. If you think Boeing wouldn’t do something, remember they’re a defense contractor. This is some cyberpunk level dystopian shit if it was them.","“Self inflicted wound.” Right","This world is so fucked","this should be the biggest news story in aviation this year. but it won’t","So when’s the Netflix Doc coming out?","Boeing implementing ruZZian tactics of dealing with individuals who are inconvenient to them.","Well, Boeing is screwed","Definitely not suspicious at all 🤔","So this guy got Epstiened for sure. What a story. Hopefully they catch the killer.","Well. That’s a bad look.","From the article:Boeing said it was saddened to hear of Mr Barnett's passing.Bullshit!","USA is turning into Russia","“Self-inflicted” my ass 🙄","“Self inflicted” - aye right!","I don’t see why he would take his life, while in the process of defending his name. Seems fishy to me, and the I’m sure police will find “No evidence of foul play.”","Something like this can happen in US just blows my mind.","\"Self inflicted.\"","“Suicide”","Boeing prob just had him killed. Corps do have that much power now so it wouldn’t be THAT surprising.","And seems like every other day, a a boing is loosing altitude, sliding on it side, losing a tire 🛞… etc…","Basically Boeing was making insurance plays because a DoD contract is essentially a blank check if you're good at manipulating numbers. I think it's only going to get spicier from here.","I’m mean how much blacker can this movie be?","Maxxed-out.","Damn Putin","If I was a pilot flying Boeing, I would want to switch to fly an aircraft built by different maker - just saying…","Wonder who Boeing is in bed with on this one","How do you end up IN THE TRUNK with a self inflicted gunshot wound…"],"points":471},{"text":["Alphabet spin-off SIP launches Verrus, a data center concept built around battery 'microgrids'"],"points":0},{"text":["Airbnb is banning indoor security cameras inside its listings","Good, when you go into a hotel would it be ok for cameras to be all over the place? People who are ok with this are weird","When will it ban exorbitant cleaning fees?","My friend just unplugs the Wi-Fi when he stays at airbnb’s for this reason","I never understood why my friends happily get AirBNB over a hotel. Pay more, do chores, no professional support (calling AirBNB is a nightmare), and no privacy. OK you get a living room, but who cares. I'm not in Vegas to cosplay as a homeowner.","How are they gonna enforce this one?","Pervert cam is no longer wanted? Colour me shocked.","Oh snap","Surprised it took this long.","And here I thought that such a thing was already banned and illegal.","AirBnB is a fucking cancer.","Prices are gonna go up now when they can’t sell the footage of you in the shower anymore","More common than people think. I break them every time. Never suffered any consequences for that...","Unfair!!! want to watch you clean my place whilst paying me 🤤 /s","Wait, that wasn’t always a thing?? Fuuuuuuuh","First thing I do at an AirBnb is unplug the router. Then J.O. all over their stuff","I would think making this is a good move for guests who don't want to be watched while they stay in their room. People would freak out if they found out their hotel room had cameras.","now ban fees and charges that double the rental fee and telling the guests to take out the garbage out AND pay an extortionate cleaning fee","Do other countries have the housing issues that the US faces with everyone turning homes into AirBnBs? Vermont is facing this.","Wait they’ve been using cameras? So they watch people naked? How’s that legal","Prediction: hosts will put microphones instead and use AI to convert a sound stream into a rendering of what is going on","Took its sweet time","The places I’ve seen that had cameras, were big group houses with tons of travelers. The cameras were in group spaces, so hallways, kitchen, stuff like that. Not in bathrooms or rooms.The cameras in that context didn’t terribly bother me, though maybe I’d prefer to not have them. If I was a host though that had tons of people coming through, if someone trashed the place, committed violence, or other insane before I’d definitely want to be able to get it on camera so I don’t completely blame them.","I don’t ever remember any hotel I’ve stayed in leaving me a bad review for being a GUEST . For not making the bed when they charge you for the cleaning fee","Wait, this was allowed in AirBnBs?!?!?!","What? Was this not banned before?","Great, so now the cameras will be extra hidden","There were cameras???","Airbnb is a lost cause. This is one of 20 things they should have done years ago.Did their IPO and got lazy. New-rich f’s flushed that company down the drain.","An important signal as AirBNB is global and influential business.","As if it will Make one bit of difference","How were they not banned to start with?","Airbnb feels like our generations of hitch hiking with strangers. Matter of time before people realize not all stranger home owners care about them or their own well-being","Omg where’s the BORU about this?","This will have literally 0 effect on the cameras that are the problem.","Has there logo always looked like a ball sack?","You mean this whole time when I’m doing all those freeky shit at the airbnbs, they are all recorded??","Good on them, still never going to use an AirBNB.","Oh no won’t someone think of the property owners? 🤷‍♂️","Just stop using it.","Weird to me that they ever allowed them","Now it becomes hidden security camera I suppose?","Wow","Hopefully the last one I stayed in didn't have them because they would have seen a whole lot of me if they did.I bypasses the airbnb fees on the only one I've ever booked because the host was a run by a vacation rental company and I went to their website and booked through them. I saved $180ish by doing that.","It’s not already banned? It’s a clear constitutional violation.","About fucking time. I like to walk around after a shower and air off and I don't appreciate anyone other than my so watching me as a do it.","I’m a host. Release location data, please. I don’t want locals. They aren’t “coming to town to see a sporting event or zoo. Locals have parties. Dumb ass Airbnb won’t support hosts only profits."],"points":944},{"text":["Ready Player One creator debuts 'Open,' a metaverse battle royale experience","get skins inspired by the novelSigh. How is that even possible since basically the entire novel was basically references to other people’s IP?","Unless it’s in VR, meh"],"points":8},{"text":["Unplug Your Laptop Now, or It Will Stay Plugged in Forever","Most PC’s, Dell, Mac, etc either have battery management for this on by default, or can be enabled.","It seems like perhaps manufacturers should have in place systems that can tell when a laptop is plugged in and run off the incoming power rather than the battery. And maybe a program that monitors the battery for optimal usage. But what do I know. 🤷‍♂️","Worse is cycling your battery, depending on the model it is made to sustain 300 to 100 cycles. No modern laptop stays at 100% when plugged in for a long period but they discharge to 95% to have a slightly lower battery charge voltage. The higher the internal battery voltage the faster it degrades.Also laptops when being used for demanding tasks (video editing, gaming, compiling code etc) discharge batteries much faster and thus also stresses batteries.If possible turn battery charge limit on and limit it to 80 and charge it montly to 100% once to calibrate the battery controller is recommended.Basically a poorly researched clickbaity article.","At least on Macs that can run recent versions of MacOS this is not a concern.http://yo.com/article/2217188/macos-optimized-battery-charging-system-settings.html","The real problem here is laptops not having removable batteries.There are a few things that kill your laptop battery, obviously constantly keeping it at 100% is not good. But the most damage comes from the heat your laptop gives off. When used as a desktop, the best thing was to remove the battery altogether and only put it in when you plan to take it on the go.With a removable battery, my laptop battery easily lasted 10 years. But then they started to make removing batteries harder where I have to open the entire thing, the even worse they started gluing themHopefully with the new EU requirements, we will get removable batteries laptops again","OK dad","The optimal state for your battery, according to Griffith, is somewhere between 20% and 80%. He recommends charging your laptop fully and then unplugging it to run down throughout the day. You should let your battery sit in this “mid-range” zone for most of its life to prolong your battery’s performance.","Ehh I dont care, I dont use my laptop outside of gaming so I need the power.","And in this one statement ones sees the fraud being played on everyone; all these must be connected to work energy vampyre systems and energy has to come from somewhere and something and that something is gas, oil and coal, all of which become limited in supply as they are used and wasted on things that don't need to be always on of course that does not stop anyone from orchestrating the conditions for them so the NEED of some of them to be always on exist.N. S","Worse is cycling your battery, depending on the model it is made to sustain 300 to 100 cycles. No modern laptop stays at 100% when plugged in for a long period but they discharge to 95% to have a slightly lower battery charge voltage. The higher the internal battery voltage the faster it degrades.Also laptops when being used for demanding tasks (video editing, gaming, compiling code etc) discharge batteries much faster and thus also stresses batteries.If possible turn battery charge limit on and limit it to 80 and charge it montly to 100% once to calibrate the battery controller is recommended.Basically a poorly researched clickbaity article."],"points":128},{"text":["Florida middle-schoolers charged with making deepfake nudes of classmates","This is going to be a HUGE headache for school administrators.","The fact that it’s middle schoolers says a lot about where the future of this is going","Because the victims are middle-schoolers (ages 10-13ish), could this also be considered creating child pornography and the students be charged with that crime? Even if those images aren’t “really” the victims because it’s a deepfake?","Glad I'm not a lawyer because this whole thing seems like a cluster fuck with far reaching implications.Like if I draw a Pic of my teacher sicking dick I would just get detention. But this is a felony. I wonder if the wording of the law will be used by Disney to kill rule 34 pics","Felony is crazy for middle schoolers. They’re clearly trying to make an example out of these kids.","I have no doubt the incident merits such a serious response, but is there even any law to charge them with on this?","So are deepfakes only bad if it involves nudity? Is it okay to make one of someone doing drugs of torturing a cat or something else heinous.","Should I even tell my daughter about this? Would something like this be too much for her to have to worry about?","Jeeze imagine using your brain to do something good for the world instead of just using this stuff to make porn.","Clear laws are going to have to be defined nationwide for non-consented deepfake porn. The fact that you can pay a few bucks and use a premade model to make porn of anyone, which could potentially ruin their life, is fucking absurd. I especially believe this after seeing SORA.And I say this as somebody who works in AI and has seen tech (experimental and next gen models) that isn’t publicly available yet. It’s gonna get a whole lot weirder.","The boys were charged under a Florida law passed in 2022 that state legislators designed to curb harassment involving deepfake images made using AI-powered tools.Good.","I'm not surprised at all unfortunately. Kids have been doing this kind of stuff for a long time. It's just that ai is so powerful and misuse has larger consequences","Ahhh. Can’t wait for EVERY SCHOOL EVERYWHERE to make rules about taking photos in the hallways of your friends and other random things that don’t relate in order to avoid this problem.Thank god I was saved by ‘gangs’ by my school. Had I worn my hat one extra second backwards I’d totally be related to gangs now.","His punishment is photo shopping clothes back on the girls, loves it, starts designer clothing line.","This is the first time in years that I have seen encouraging news about Florida’s legal system.","In my best Meatball Ron voice:“Disney!!”","Ofc it was in my state Florida too.","Lol that’s hilarious","Is there actually laws against this? Google machine says no. (I am against it and hope there is, just wondering)","Maybe if Florida itself, was mature enough to teach human sexuality in the classroom, kids would be more informed and capable of making better decisions.I won’t need to be told that teenagers don’t have the capacity to support this kind of information. We need to institute reality and understand, they know more than the over the top Christians want to admit.","This is cursed.","I feel so lucky to not be a kid in this day and age…","I graduated high school in 2004. There was a scandal at my school where a couple of guys made a website with images and video of multiple up-skirt or breast shots of teenage girl classmates. The boys were just suspended for a week and had the website taken down. This is going to be really bad.","A lot of you advocating for csam apparently. If the kids are old enough to use the technology, they’re old enough to deal with the consequences.","I was shocked when I read the court said AI kiddy porn is legal. Seems like this would fall under that?“The Supreme Court said if an actual child is not involved in the creation of this imagery, then that is protected speech. You can do that.” It's protected speech under the First Amendment to the Constitution.\"Side note... I'm not pro fake, AII, or real school classmate porn or kiddy porn....just shocked that it wasn't all illegal.","Well at least they're learning something. My fear is that the current generation in grade school can hardly read. This is happy news. There talent should be redirected towards more positive pursuits.","Maybe Gov Desanctimonious and Moms for Liberty should start banning computers too. Idiots.","Come on, these are kids doing stupid kid things. Like taking a picture and cutting out the face to stick it on a Playboy model. Yeah it’s gotten more sophisticated but it’s still fake.Punish them and move on. There’s no need to make them felons.","Kids should just do their damn homework like I did. This is insane.","FreeDUMB to make nudes. It’s in the Bill of Rights, people.","I use this tech to send my friends pictures of themselves naked. It’s like, hey groupchat, here’s what Josh looks like with a pussy","I hope we just keep arresting kids instead of just making the service illegal to offer to people to begin with.","That is Photoshop. It is not AI if a human makes it.","Haha stupid kids they deserve that","These are children being charged with seems like a felony. This is excessive. Kids don’t know better. The parents should monitor online usage but you also can’t hold them accountable for the speed these things are coming around and the ease of access to them even when not home like via cellphones. You can’t block everything.I think it’s excessive and can ruining kids lives before they even hit highschool.We created the technology it’s our job to keep it out of the wrong hands.","Why tf don’t we have laws against AI yet? This should not be a thing the public can just haveEdit: Yall downvoting me are weird lol. Apparently you guys think its ok for fucking schoolchildren to deepfake porn of other children. You guys need a serious hard drive check",""],"points":789},{"text":["Shields up: New ideas might make active shielding viable. Active shielding was first proposed in the '60s. We’re finally close to making it work.","Some astronaut will finally be able to say “Shields up!”I’d probably giggle a little at that. XD","Gonna have to practice my slow blade","I’ve always wondered what was preventing this tech from being pursued. Huge weight and power requirements would do that…","Already had a working model.Sustainable Energy is the problem not the tech.N. S"],"points":129}]