[{"text":["myth?","wut?No. Lol. Every action creates some sort of artifact somewhere","Depends on what you mean by myth.Other than immutable laws of physics is anything 100% in this world.Can one take steps to reduce their online signature? Yes.Can someone do that 100%? No."],"points":5},{"text":["Would access to a secure platform for data exchange benefit your cybersecurity solutions?","Sounds like you're using this post as a lead gen.","oh look an ad"],"points":4},{"text":["Russia's ruling party 'hit by cyberattack' during presidential election","Hello, everyone. Please keep all discussions focused on cybersecurity. We are implementing a zero tolerance policy on any political discussions or anything that even looks like baiting. This subreddit also does not support hacktivism of any kind. Any political discussions, any baiting, any conversations getting out of hand will be met by a swift ban. This is a trying time for many people all over the world, so please try to be civil. Remember, attack the argument, not the person.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","The election is rigged anyway, so what difference would I tv make?","This is great news","And the winner is...Anatoly Cherdenko?","I am shocked! I’m sure it has nothing to do with Ukraine’s call for volunteer hackers …"],"points":43},{"text":["Concerns about cyberwar and outdated systems?","I hate to ask this, but are you a student? This post is about a decade late.","It is because of questions like yours that we have an entire field of practice referred to as Risk Management.","We've been fighting that cyber war for a while now. Feel free to up your skill set and join us.","One of the things that no one talks about is the cost of compliance at scale of a country. In the US we tend to legislate major changes into the future or after it’s clear most can meet the requirements.","It's not that we have a lack of compliance laws. We have a lack of enforcement, at a catastrophic level.Until that changes we will not see businesses caring about security, customer data or GRC.Steep fines and a wall of shame for negligence should be the normal so the general public knows who to avoid doing business with.Additionally, insurance companies need to audit anyone applying for cyber liability insurance. I literally have the, \"I don't need security / compliance is too expensive\" conversation all the time.Business owners and stake holders do not see and will not see the value as long as insurance bails them out when they lie on their insurance questionnaire.","As is usually the case with American government, changes won't be mandated until something absolutely catastrophic happens, then they will overreact with their legislation.","While many systems are legacy systems, it's important to note that several of them have not been updated due to their superior reliability compared to their modern counterparts, or the cost of these upgrades (not just in terms of money, but also downtime) would far outweigh the benefits (a vulnerability of the outdated system may have been highly unlikely to be exploited prior to the upgrade).While we need to be resilient against threats, any plan you have must align with the organization's objectives.","Speaking from the manufacturing side, the biggest problems arise from the PLCs and CNC machines that cost hundreds of thousands of dollars. There is no reasonable way to update or replace those gigantic machines without the company going under, so you build security around them instead.","Wait till you find out all that same critical infra is also vulnerable to high explosives we know many hostile states possess!","There are ways to mitigate security risks such as out of date OS's. The big thing about cybersecurity is that there is this ideal, then there is reality, a system being \"out of date\" or even the software already passing \"end of life\" doesn't mean that the battle is lost. The reality is some systems simply can't be updated, or updated very easily, and that is ok if we can put in other mitigating factors. Take an MRI machine, so what if its running on windows XP, the cost to buy a new MRI that is using more modern software might simply be not possible (they aren't cheap), so you will deploy other security tools and features to help mitigate that risk.","How is the fact that government, banking, healthcare and other critical infrastructures are still run operating systems and programs that have reached EOL not a catastrophic, epic, infinitely urgent and dire problem?It is absolutely an urgent and dire problem.Because government, banking, healthcare represent the unholy trinity of IT buffoonery and those places either are:1, run by morons (especially gov't)2, conflate compliance for security (especially banks and hospitals)3, haven't learned how to operate using security as a business enabler...... or a combination of the above.Compounding the problem is that security as an industry has a shortage of:1, people who actually have security-related skills2, people who know how to run a business.","still run operating systems and programsYou'd be surprised.I've seen test equipment still running Windows CE, ATMS and other types of kiosks still running Windows XP, there's still a ton of RHEL 5 and 6 on the backend globally, and a lot of telnet still exists in the wild -- especially in industrial applications.... and I don't see a forecast for the apocalypse within the next 24 hours.While it would be nice if we could get folks off of that old tech, the reality is there are still a lot of valid business reasons for why it exsits.With that said, what security professionals should do is not ask why, shame, or look for fucking incompetent governments to make even more laws that it cannot enforce (go read CRA, DORA, and NIS-2 sometime) but rather the security professional should look at how one can harden that existing tech to make it is secure as possible until the tech debt can be paid off.","this post just reminded me of my first course in college. damn those were good times. I was much more naive far more optimistic back then.thanks OP I appreciate this glimpse into previous emotions.","Risk acknowledgement/risk approval. Systems are deemed critical to the organization to continue operating on a daily basis - the AO doesn't want to shut them down - time is a flat circle."],"points":59},{"text":["DNS Exfiltration and Tunneling Keylogger","DNS tunneling is always interesting! A lot of Threat actors are very creative when it comes to utilizing the different type of records. An example is like in this tools where the A record response is an IP but not a place where you connect but rather to give further instruction or assign a certain bot-ID to the \"infected\" client."],"points":0},{"text":["Testing on websites created by myself","If you want to get more experience in web pentesting, you should to do portswigger labs.It will help your future pentesting career.","Did you already check your network adapter settings of your kali vm? If you run your web application on your windows host you should be able to access the website from your browser in your kali vm by just typing the IP of your windows pc in the search bar (assuming the webapp runs on standard http port 80). If it runs on another port like 4000 you can specify that by appending :4000 on the IP in your search bar.If you still can't access the webapp you might have wrong network adapter settings configured for your vm. In this case try to use the bridged mode.","I would assume this has to do with your networking.ESXi?"],"points":7},{"text":["Windows 11 laptop with password but not Bitlocker... how secure?","Not secure at all. Someone can either a) boot to a different os via USB and access all the data or b) take out the drive and put it in another computer and access all the data.Why would you not use BitLocker? If it’s running Windows 11 it should have a TPM and you should be able to enable BitLocker.","YesPotentially, yesAfter cracking your password hash, yesThat depends on the version of office and the strength of the passwords but potentially okOther than just about everything? :)","It's hell on Earth. Thanks for the free LSASS dump and entry point to your company network.","As everyone has already said this is not secure at all.Look up ultimate boot cd. There are more modern tools, but any amateur can use a tool like that and effectively own the machine in this scenario.As for accessing the drive and or the contents, that is even more trivial with physical access. You just pop the drive out and plug it into a USB to SATA/SAS adapter and browse the contents at will. Depending on the machine and how far they buried the drive you might have 5 min worth of work with a small screwdriver.Or just carry a livecd version of Ubuntu on a USB key. Boot the laptop up with it and mount the volume. Assuming the laptop has more than one USB port on it copy anything of interest off to the other USB and walk away.If you are considering such due to the admin cost / skillsets behind bitlocker etc. Why not look at self-encrypting drives? They are much more readily available and far less of a learning curve for your org. And you would be far better off than this.Also, a note about the passwords on office docs. A copy of John the Ripper or PyCrack and a CUDA based GPU and a lot of office document passwords fall in minutes.","Not secure. I have tools for unlocking that. Microsoft DART.Or I can just remove the hard drive and put it in a USB enclosure","TL; DR if the risk of physical theft is large, I.e. with a laptop, you need full disk encryption like Bitlocker.Also please consider using a real password manager like Bitwarden. Browser password managers are not very good—not even Chrome or Firefox. Be sure to create an “emergency sheet” with your master password and other recovery material, and store it securely, preferably with extra copies in multiple physical locations.Put your Bitlocker encryption key in your vault.As far as confidential documents, even with FDE, you should consider another layer of encryption. It could be as simple as 7zip. I like VeraCrypt. In any event, store the encryption key in your password manager.","regarding security of the bitlocker:https://hackaday.com/2024/02/06/beating-bitlocker-in-43-seconds/","Unencrypted","Not having an encrypted hard drive is like leaving your car unlocked.","I made a post about this recently. My friend forgot their password to their windows 11 laptop and I broke them back in. I plugged in a Kali USB, located the SAM file, and then used the chntpw command to remove the password. When we booted back into windows, it logged right into his account. If it’s a domain account, I can’t remove the password, but I could still see the contents of all unencrypted drives.","All those things are trivial to acomplish with bitlocker disabled. Any moderately competent fresh out of high school nerd could do it.","Bitlocker encrypts the filesystem so it cannot be accessed outside of the system (IE, cant access it on another system, cant Boot to something like ntoffline). However....https://www.tomshardware.com/pc-components/cpus/youtuber-breaks-bitlocker-encryption-in-less-than-43-seconds-with-sub-dollar10-raspberry-pi-picoSo TPM + PIN on boot is required if you are looking for full end to end security.Cookies can be abused, yes. You should sandbox your browser between sessions if this is a concern.Passwords should be kept in a password vault like bitwarden, Keepass...etc and not in the browser..ever.MS office documents can be decrypted using many different password brute force tools available. I had someone at work lock them selves out of an XLS and we got it unlocked in 30mins with such a tooling.Common stuff like \"dont use the same password in other areas of the system\" and \"MFA all the things\" apply here. You can even add Windows Hello to your start up so you have to pass MFA on logon. There are free credential providers out there like DUO that make it simple to add MFA to local windows accounts through the logon screen boot strap.","YesYesYesDepending on the passwordYes, everything","Yes. They can pull the drive and connect it to another computer or boot into a portable OS on that computer and access the files that way.Yes, they can steal session tokens, allowing authentication to websites you're logged into (this is how MFA is bypassed in many cases).Absolutely. Browser-native password managers are notoriously bad for this. Chrome stores all of their passwords in the %LocalAppData% folder.No. They can easily be cracked.Everything stored on the hard drive can be accessed. So yes.","Say I wanted to boot Linux from a USB drive. I changed the boot order in BIOS and had to disable secure boot to do this. Now it wants me to either disable EFS or manually type in a code from my Microsoft account on every windows startup. Any way to get both file encryption and easily boot Linux from USB?","Konboot go BrrrrrSo to answer your question, nothing is safe."],"points":80},{"text":["Licenses as part of your threat model?","I pull together our IT incident response team, (who are different to our CIRT) explain to them what is going on, what risks are associated with either and let them escalate it up and decide.In the lessons Identified I'd be asking why nobody knew about these license changes sooner as enterprise customers are typically warned 90 days in advance of these sorts of things.","Call IT and tell them to deal with it.","This is a business decision, not a security decision.First off, I DON'T have admin access to these systems or licensing logins, because I'm not the admin for the IT systems.I would offer my support, but clearly indicate that this is not a security issue, I don't have access, and how would they like me to help."],"points":3},{"text":["Root cause of SolarWinds hack?","The answer to your question is the subject of an SEC lawsuit against Solarwinds at the moment. Solarwinds stated to customers and shareholders that they had certain security processes in place, but it appears that this was not the case. At this point, reliable determination of the root cause of initial entry will probably never be known but several solid theories will come out of it.","You haven't found anything because even Solarwind doesn't know for sure how they were initially breach. There was 14 months btw initial breach and their incident response. Most companies keep security logs up to a year. At this point, only the APT team knows how they got in. But considering how poor their security was, it was probably run of the mill phishing credentials harvest campaign and I doubt they had MFA everywhere.","The CEO stated they likely gained access through a compromised O365 account. From there they gained access to specific accounts that granted them access to the dev environment.https://www.crn.com/news/security/solarwinds-ceo-confirms-office-365-email-compromise-played-role-in-broad-based-attack#:~:text=SolarWinds%20CEO%20Sudhakar%20Ramakrishna%20has,in%20business%20and%20technical%20roles.","It's been a minute but IIRC, Solarwinds claimed on Twitter that an intern's Solarwinds github access was compromised due to a reused password. The APT actors leveraged that into access to the upcoming build commits which were later digitally signed and deployed as the next update. They had already been watching internal Solarwinds CI/CD workflows long enough to know potential targets, repo locations, update and deployment schedules, and on what cadence final commits were to be digitally signed. From a tradecraft perspective, it was truly swoon worthy. Wait until you research how they tracked their compromised victims (custom encoded domain generation algorithm subdomains). And they were so patient...literally one or two actions on objective and then wait two months before the next actions on objective.Because \"blame the intern\" was so poorly received, especially in light of FireEye's \"take full responsibility\" approach when they made their announcement they'd been compromised, Solarwinds quietly removed this claim.I will say one thing having worked with some highly sophisticated red teams/pentesters, it's not uncommon to find useful logins, secret tokens, and API keys buried in git archives because the repo owner didn't properly scrub old code.","State sponsored intelligence gathering operations are still classified. We might only know 10% of the story.","It is my understanding that a Jenkins machine was exposed to the internet using the password \"solarwinds123\". They were then able to move laterally from there.","Their development was outsourced, and there was very little control over the safety of their pipeline. For all anyone knows, they were running some unpatched version of Jenkins and someone was able to contaminate the build environment. I look forward to seeing what the lawsuit comes up with, this is the example I use when I tell my clients that DevOps is not a “set it and forget it” thing. You have to watch that pipeline and everything it builds like a hawk.","Do they really still not know what happened?No.They absolutely know what happened.That's why I cringe that people in this industry parrot now that a SBOM for example, secures the supply chain. A SBOM would not have prevented SolarWinds.But for a number of reasons, the whole story is not going to be disclosed.","I remember this one pretty well; not long after it was reported someone referenced a github issue where a security issue was raised for the infamous solarwinds123 password. The issue appeared to not be actioned.Blame was then shifted to the Intern, saying it was their fault for changing it, and no one noticed for a number of years afterwards.https://www.itpro.com/security/cyber-attacks/358738/intern-blamed-for-weak-password-that-may-have-sparked-solarwindsMy understand was downloads.solarwinds.com FTP service was using said credential, and allowed access to a directory which synced with their code repositories.https://twitter.com/vinodsparrow/status/1365547782782689281From there, someone or some groups, managed to get access and added a small change (presumably to validate the change goes to prod) in October 2019.Presumably once that change (a dummy function) went to prod it appears the threat actor then made a more significant contribution which resulted in the mass compromises - Feb 2020.https://www.techtarget.com/whatis/feature/SolarWinds-hack-explained-Everything-you-need-to-knowThose two modifications have SHA values which are detected by vuln scanners. Even though the October 2019 edit didn't introduce anything malicious, it still gets flagged as malicious - this is why two versions have been flagged as affected.Hope that helps somewhat... root cause, though, always comes down to an organisational process failure.","An intern was granted over permissions to their update server and used the password solarwinds123 to that account.","[deleted]"],"points":68},{"text":["New #QuasarRAT campaign by #LazyScripter!"],"points":0},{"text":["Communicating security to CFO/CEOs","I also noticed that they use a lot of common place analogies when explaining these.There's a reason why they require colorful reports with graphics.","I spend most of my time talking to boards and their committees.CISOs in my business report into me but I am effectively a CISO in all but title.I skimmed the article and TBH I’m not completely aligned.I would be pretty annoyed if someone labelled me, my team, my peers as soothsayers.Security is an operational risk, like many others. It benefits from being integrated into enterprise risk frameworks and having documented, repeatable and transparent process for identifying and assessing risk in the context of the framework.Unlike other areas of operational risk, such as finance, boards tend to have less experience of InfoSec. They do (usually) have good understanding of risk management principles. As with many of the other teams we interact with, we have to speak their language and make it easy for them to make decisions. Quantifying risk from a financial perspective, and articulating in terms of risk appetite etc. is the most successful way of approaching it, in my experience.","There's a reason why a lot of technically-minded people don't make great executives. To convince the higher-up staff, you have to use their language: dollars and risk. They don't care about Lockbit, they care about how much money they lose when Lockbits messes their stuff up, and the hit to their reputation.People hate building KPIs and measuring performance, but this is what it's for. Translating your work into $$$ so that the CFO who doesn't understand why it takes more than 1 person to monitor alerts for a Fortune 50 company can see the effect you have when Lockbit hits every other org but yours.","The method I have found the most useful is showing examples of other companies and how much it cost them. If you want to get your building to install sprinkles, burn down the neighbor","I was having this conversation at a round table with infosec leaders and besically said this. Woogy boogy doesn't work. Quantify the risk. You need to do that while evaluating the cost of controls or compensating controls anyways. Speak their language. Your leadership skills are directly correlated with how well you can float between the technical and the business sides of the house and direct a clear vision.","Thanks for sharing 👍🏽","honestly our board pushes them more than I can - they tend to be in the risk mngt business and have a broader perspective","I think most of the responses here hit the right points.I'll just add this: align security expenditures and budget requests to the business goals.Putting a dollar value on preventing bad things is very difficult. It resonates more to say \"here's how we'll enable you make money while reducing risk.\""],"points":87},{"text":["Dfir career tips.","I'd check FRA tbh, they're hiring and it doesn't require going abroad."],"points":0},{"text":["These Video Doorbells Have Terrible Security. Amazon Sells Them Anyway.","Amazon will sell your dead grandma’s ashes if you listed it.","Breaking: Giant retail company sells product that isnt theirs to make profits despite product being poor quality","Because it's Amazon, not AmazonSecurity.Amazon just sells products and they don't really do any formal evaluation. So expecting them not to carry products that might have security flaws is like expecting the thrift store to sell brand new BMWsThere will always be people who don't use their brain when shopping. Our job is to spread reviews that explain these concepts","BEST BUY SELLS DEVICES THAT HAVE TERRIBLE SECURITY. WALMART SELLS DEVICES THAT HAVE HORRIBLE SECURITY. yada. yada. What’s the point besides a few post karma?Edit: Looking at the little engine that could… OP didn’t go down without a fight lol. Found themselves in a hole, we offered a ladder and they instead grab a shovel.","Why should Amazon care? They just want to make money? Most people buy Alexas and imo that poses a huge security risk.","Help me understand how this is Amazon's problem","Why is it Amazons responsibility to perform risk assessments on every product they sell? At what point did we decide to ditch buyer beware?The FCC doesn't have a lot of control over the cybersecurity of the devices.The article is really about the products not having the FCC ID on the packaging. The manufacturer is says they are putting it on them.Either way, the manufacturer and the third party resale are responsible for checking to make sure the fcc ID is listed.I can't find any case law that says Amazons or Walmart has responsibility for it.","The \"S\" in \"IOT\" stands for Security","Not their problem to ensure security of products….Put all IOT on a VLAN and you’ll be alright.","If I want to buy products with shitty security Amazon shouldn't stop me. I might be repurposing the technology, I could be using IoT devices in an environment where I implemented compensatory controls to mitigate their security risk. I might be using them for testing and research. Or maybe I'm being an idiot using them in a way that exposes my data. Either way it's not up to Amazon to tell the consumer they can't do that. They are not a regulating body and saying it is Amazon's responsibility to attest to the security of their technology products is absurd and anti-consumer.","I’ve stayed away from pretty much all iot/edge/ connected home things due to data security/ privacy concerns. What is considered the most secure connected home camera when it comes to encryption/policy etc?","Amazon also sells crappy pad locks in case you need more evidence for the lawsuit you're putting together... Or whatever the point of this post is.","What would you guys say is a good doorbell camera company?","OP has a fundamental misunderstanding on these things based on comments. Even if Amazon should care (and yes, they should), guess what? Every major Top 10 company bullshit is doing literal crimes against humanity as we speak.Aaand guess what? The government and and the governments policies and the law and law enforcers and judges and anyone that could potentially be affected... Do. Not. Give. A. Fuck.You're right. But nothing will happen. Just better your own knowledge to avoid these items for purchase.","Amazon cares about money not customer security","What are some best practices for these things? Everyone keeps saying put everything on a guest network but why? ANd what other tips?","Bro look up how much Amazon makes a minute…. You think they care about a fine?","this is a post for r/privacy, not here.","Is it me or is amazons selection getting worse?","It's not Amazon's job to vet the security of digital devices sold on their marketplace. Just like any B&M.","lol attempted amazon hit piece?","Why should Amazon care about this? there are probably plenty of insecure devices sold on Amazon... if it makes them money...","The organizers of a farmers market should be liable if somebody bought bad eggs at one if the stands?"],"points":589},{"text":["Properly separate your Security/BMS/IoT Staff PC's, Guest PC's?","Who have access to these guest PC and why are they even on the domain? What's the use case for the guest PC?","Manage them with intune and logical or physical segregation from the the rest of the network.","This is the whole use case for Nac solutions.This more in depth here to write out but in a gest solutions such as Cisco ise or Aruba clearpass are what I'd look into to solving this. I use both products and have used them since their inceptionsI'm more inclined to recommend Cisco ise vs Aruba clearpass overall but both products need to be backed my management and have dedicated support team that isn't one person who learns and understands the concepts of these. There's some great design guides and ciscolive videos. Aruba has some good design guides. I'd recommend you look into those to solve your needs."],"points":0}]