[{"text":["Banish OEM self-signed certs forever and roll your own private LetsEncrypt"],"points":0},{"text":["Apple in talks to put Google chatbot on every iPhone","Fuck that for a joke."],"points":0},{"text":["SpaceX Working on Hundreds of Swarming Spy Satellites for U.S. Intelligence Agency | SpaceX signed a contract with NRO for the classified program in 2021, according to Reuters.","quick gobble up those hundred billions of free taxpayer dollars. its for the pentagon so its ok. fuck these thieving grifters. they are stealing americans future. they already stole what we should have. the entire nation is collapsing while corporate handouts bailouts and flat out gifts of government cash are never even questioned for one tenth of a second.","Is the US even more schtupid than we already think?! SchMusk is a danger to everyone!","Just keep Empty Husk away from it.","Must be a slow news week. This is like half the company’s reason for existing. This was the plan the whole time. They’ve been talking about launching spy satellites with spacex rockets for 20 years."],"points":0},{"text":["Apple Is in Talks to Let Google’s Gemini Power iPhone Generative AI Features","I really don’t want generative AI on my phone","This is the point where apple stops leading and starts to follow.","Great, 1 more cpu-intensive feature to drain the battery, which gets people buying a new phone sooner.","So now your options are Android, powered by Google, or iOS, powered by Google.","Time for a flip phone! They track everything, sell all you information and now they want “ai” in the phone. Hard pass! As a guy in the wireless business for the past 23 years this scares me.","Remember the first iPhone was really the Motorola Rocker."],"points":9},{"text":["‘Massively concerning’: Under Armour’s ‘AI-powered sports commercial’ sparks controversy"],"points":0},{"text":["Aaron Levie leads Box into its third era focused on workflow automation and AI | TechCrunch"],"points":0},{"text":["LinkedIn plans to add gaming to its platform | TechCrunch","When I think of people “playing games on LinkedIn,” this is not what I think of.","why?","All resumes must now be in the format of a vertical video under 60 seconds that repeats without any volume adjustment or time-seeking.","work is not fun. linkedin is work. linkedin doesn’t need games.","As a former LinkedIn employee who saw many ideas flop, I can’t help but laugh at this. They’ve finally run out of features worth mimicking from Facebook.","What the fuck?","Phase 2: offer LinkedIn Gaming Insight subscriptions to employers and recruiters so they know which people play LinkedIn games all day during work hours.","I plan to continue not using LinkedIn","LinkedIn should add dating. I think that would be better than gaming the way LinkedIn has gone down the drains /s","They should add better security and account filters to limit scammers and robo-recruiters.Also they should do away with the constant self promotion posts from corporations and bootlicking execs.","It's already a game. Trying to find a decent job that isn't a scam.","I used to do a bunch of contract work for LinkedIn before COVID. I swear, there is this one guy who dropped absolute bombs in the toilet. Like it was so bad that they constantly had to get a plumber to unclog the toilet he used.It was truly the only memorable thing that came out of that organization. What a mess!","I thought it was already a game of whoever makes the cringiest out of touch posts","Please. Just, no.","🤡","What a 💩product. Why not fix the jobs section first? Shoving down 10 pages of “promoted jobs” down my throat before showing one relevant to my search terms is not a “search”-result.","Can't wait to play games with my recruiter who didn't read my application.","Just when I thought LinkedIn couldn’t be more cringe. DamnI can already see the HR people showing off their 100M score and telling a generic heartwarming story about how they never gave up and the game reminded them to ‘overcome any limits’ yada yada.","LinkedIn is a cancer upon the corporate world","LinkedIn is the most toxic platform rn","😉","This isnt going to work","Another weird chapter in our boring dystopia","Fitting to use a balloon in the cover image.","Good thing LinkedIn laid off a bunch of people so that they can hire contractors to build this"],"points":188},{"text":["Cybertruck Engineer Begs Owners To Stop Shooting And Abusing Their Trucks","Whenever it will be more profitable to destroy a thing in a YouTube video than it was to purchase said thing, that thing will be destroyed on video.","I mean you advertise them to be fucking bulletproof by an idiot CEO, you're gonna have idiot Youtubers doing it too!","It’s a meme truck, did you actually expect anyone but YouTubers to be into these things?","Cybertruck has lived a tortured life for entertainment - Jumped on, kicked, burned, beaten, and shot (multiple times). To quote the black knight, it's just a flesh wound, I'm invincible!Now we've confirmed is tough, maybe Cybertruck can roam freely on and off-road in peace?Or.... you said it's invincible so now we're all gonna double-down.And in all honesty if you pay that much for something and wanna shoot it, you do you. People jump on and beat Ford F150's too. Ford's fine with it.","So... the market you went after, who act exactly like this, are acting exactly like this? No way you could have known, I guess.","How did Jalopnik survive all the cuts that killed Deadspin and the other sites?","Morons","\"No\" - CyberTruck Owners","What the hell do you expect when your dipshit CEO keeps bragging about it being bulletproof?","guess what happens when you cultivate the ‘fucking moron with money’ consumer base for your product","i saw my first cyberyrick today... when he cut me off as i was slowing down to stop at a red light.","why is this even a thing?","Why do they care?","When a significant portion of the customers are content creators, this is going to happen.","If people want to shoot at empty tin cans, I say let ‘em.","Why? Unless he’s embarrassed by the ease of damage this is nothing but free marketing and extra sales from people who never would have bought a truck to shoot it.","I can’t imagine pouring my life’s passion and work into what amounts to a meme.","Rich kids acting dumb.","Maybe if you don’t want people shooting at your product, then don’t label it as bulletproof","Idiocracy","I saw one in the target parking lot today. So stupid-looking. You don’t look cool in that thing at all. You look very dumb for making such a stupid purchase. The gaps between the panels are very obvious. Maintenance must be a nightmare. The tires look like at least $250 a pop. How is this a wise investment?","Funny way to admit that stupid people bought your trucks, but ok.","They’re stupid enough to buy one. They are stupid enough to discharge a firearm that close to a piece of metal that is angled","What’s the point of them then? To make me feel like I’m playing N64 again?","I'm also tired of all the youtubers making shooting or driving videos. This is not good, advertising turns me off more","The whole idea of a truck with no crumple zones means that the occupant gets to eat all the force of the crash.","They need to stfu it's their vehicle, if they wanna out a few bullet holes in it or damage it in some way they should be allowed.","Build a vehicle and brag about it can take bulletsGets shot up because they bragged about it being bullwtp7Oof edit bulletproof","If I’m an engineer, why would I give a damn what the end-user does to the truck? It’s abuse of the vehicle so it won’t be covered under warranty. My job is engineering not fixing anyways.","MAGABILLIES shooting their own truck bought from the guy who wants to be their next cult leader.","It’s the shots of rust, it being a terrible truck and off-road vehicle that will sink it.","Why? Unless he’s embarrassed by the ease of damage this is nothing but free marketing and extra sales from people who never would have bought a truck to shoot it.","Theres a cyber trunk driving around houston. I thought i would like it, but seeing it in person made me not like it. I think its a good advertisement for what electric can do. But i would rather the ford electric truck.","\"No. I paid for it and I can do whatever I want to it\"","Well, that’s what you get for pointing your advertising towards idiots.","How dare they test the claims","I like it. Just like Peak pandemic the ones without masks… any indication that someone is a complete idiot, is a welcome sign.","Is there a word or phrase meaning “not tech news”?","Lamo…. They tend to not have spare parts so when enough of these super loyal Tesla truck people trash them they won’t be able to fix them.","Stfu. pieces of shit","The cyber truck looks like it was designed by the same people that rendered PS1 Lara Croft.","Wait till he hears whistlin diesel got one","Ha ha fools!!!","They can shoot and blow up those fugly Muskmobiles.","Why did they even market this truck as bullet proof / resistant? It's barely water resistant to start from what I saw. Shouldn't the selling point be that it's a super fast and durable (Doesn't seem that way) truck?","That’s JerryRigEverything he literally does that stuff for a living","Engineer doesn’t realize the type of idiot man children he is dealing with.","Can we blow it up instead?","You have to be off your head to buy a cyber truck in the first place, shooting it up goes with the territory.","No. If you can do it so can I. I bought it and I do what I WANT!!!!","Just FLINGING that term “truck” around pretty wildly","Yeah, Jerry! :)","What’s wrong with shooting it, it is mostly bullet proof","It REALLY hurts their FEELINGS","If you appeal to the stupid, you get stupid in return. Whaddayawantfornuthin?","Being the new stupid (EV buyer) they can’t help it. Lol"],"points":1229},{"text":["Fisker Scrambling After Popular YouTuber Called The Ocean The 'Worst Car I've Ever Reviewed'","Marques Brownlee finally got his hands on a Fisker Ocean for a review that was pretty critical. Fisker’s response might have made things worse.","Over the air updates for an unfinished product. What is this Electronic Arts Motors?","I watched the video. Outside of the steering wheel & no glove box issues. Everything else felt like something that could be solved with software.With that said. How the hell does it not have a frunk or a glove box. That alone is enough to make me not want this thing at all. Not to mention the center console tray that takes up all the space is BS as well. I get the idea to be able to maybe use your laptop while the car is charging. But execution was rough with that one. Ford f150 did this way better IMO.","Why would they name it \"Ocean\" after what the Ocean did to them last time?","Fisker investors would have been far better off financially had they put their cash into a pit and lit it on fire.","A lot of people do not understand the detail in all this.How they tried to source one direct for a while and getting a bit stonewalled. They were clearly concerned with him reviewing where it was at. MKBHD team members were in coms with them from a while. They knew he was going to review it and really did not want him to.He got one and reviewed it and they panicked.The company threw that engineer under the buss. His comments were not acceptable regardless when talking to the dealer but he really was not up to speed internally when clearly people knew who MKBHD was.How they have handled it all since has been pretty poor.","the whole electric car industry is suffering from a \"fake it 'til you make it\" business model.. including and especially Tesla.","Are we just going to ignore the part at the end of the review where he says he is rooting for Fisker and that he thinks their fundamentals are solid?Having said that, the no glovebox was a very odd design choice, imo.","Popular YouTuber meets Zombie Jalopnik","Damn, didn’t take long for the revival of this brand to tank. I remember seeing one in 2009 and thinking it was sooop cool.","For 70k I'd hope for better, even from a new model/car company. But I guess this is what happens while a company is going under. Half assed hail marys. But hey, the stock is on sale, who wants to buy?","Fisker = EA Motors lol","Ouch. Panic mode is never how you handle bad PR. Also executives of car companies should always be driving their own new cars for this reason.Betting if the CEO of car companies had to put himself or family behind his own car, suddenly there would be a whole lot of improvements ordered before customer facing production starts.Because of the bad review compounded by their poor handling of it, if Fisker wasn’t going to file for bankruptcy before, it sure is now.","Tried to finish the article but it gave me cancer.","I love the look I have faith","My neighbor has one. Wonder their thoughs","This is weeks old video.... Quite late for a response.","This seems like BS advertising. The reason it's 'the worst car ' is that there are blank buttons inside (your choice to upgrade the unit), the infotainment unit didn't display the rooftop solar panel charge addition (software update incoming), and the arm rest is different. The first I've heard of this vehicle.","Imagine buying a Tesla when you could have bought a Prius. Just because you wanted to overpay for an iPad in the dash and have advanced cruise control","Ehh, I watched the video, doesn’t seem so bad. A few quirks that can be fixed via software. And the physical/hardware issues don’t bother me at all. Lack of a glove compartment doesn’t bother me and neither does that folding tray in the center console.","i’ll bet it was jerry rig who said that 🤣 edit: shit it was MKBHD, but they’re in the same friends circle 🤣🤣","MB child stick to reviewing phones and other consumer electronics. How is this guy in anyway qualified to review cars. There are so many other great car reviewers with amazing backgrounds that should be trusted before him.","They should be thankful the crew from Top Gear (Jeremy Clarkson, James May and Richard Hammond) didn’t review it. Look what they did to Vauxhall (for the US - it’s GM), the original Tesla and the Lexus.","His review did not have the car washed.","My friend owns an Ocean and it’s fucking dope! I know they are a start up and they have their issues with quality, but it’s an absolutely beautiful car.","Ya he \"youtuber\" has charm.","So crazy that they are giving this YouTuber this much power. That is the first mistake. Always.","Seems like a lot complaining about nothing. The fundamentals are fine and the car looks great. Every car has its quirks.","Ehh... worst car? Really? Some slight UX issues and some bugs with the key fob and Bluetooth. I honestly never see myself buying this thing, but still, a real stretch.","Marques brownlee's opinion DOES NOT MATTER HE TAKES MONEY TO READ FROM A SCRIPT. EVERY youtuber that gets stuff from apple also does the same. Anyone \"reviewer\" that gets paid to advertise a product IS NOT \"reviewing\" the product.","[deleted]","Is this the scissors company? They make office supplies and cars? WTF weird.","Meh. Mkbhd’s opinion is pretty useless to me anyways."],"points":953},{"text":["Korean researchers power-shame Nvidia with new neural AI chip — claim 625 times less power draw, 41 times smaller","The word here to watch is ‘claim’ and it’s from researchers. I’m sure nvidia probably has newer more efficient chips on the design table","Key words. Researcher. Claims. Not shipping.","It’s possible we’ll start to see much more specialized accelerators that can achieve considerably higher power efficiency and performance than our current GPU’s.While GPU’s are very good for brute forcing and matrix calculations, they’re general compute solutions meant to handle a wide variety of problems. If instead you can build a specialized solution meant to handle just that one task, you can get something much more cost effective and powerful, at the cost of not being able to handle much else. Given that the researchers in this article didnt share any actual performance details or statistics, only vague claims, it’s hard to say if this chip shows any actual promise. But I think we can expect chips in this area to improve fast.","Korean researchers also claimed to have room temperature super conductors.","And what’s the cost of this chip. Could be like comparing a formula 1 car to a hellcat","Everybody making the most crazy claims they can to get AI dollars before the AI bubble bursts! It’s Dot-Com all over again!!!","These sorts of bold claims from Korea are to take with a grain of salt.","Why is the building crooked","You know if they’re really gonna do these neural chips they need to get on the enhancements to go along with it.","With what? 600 times less performance?","I've looked over the tech papers and can verify this works. I've got a degree from ITT Tech.","41% smaller?","Great, now we are going to have to upgrade to the latest n greatest to run our games. (Throws 4090 in trash).","How many times must I scream it from the rooftops:CUDA!CUDA!CUDA!*Start from a blank slate and no constraints in terms of the libraries/SDKs you must support, and remove all graphics processing requirements, then I am sure one can come up with something way more efficient than NVIDIA's designs.Might take some Intel-sized subsidy or rebate from the maker to get people to use it, though.*ROCm, please, at least now...","Put up or shut up.Get benchmarker some thing to work with and then we’ll know","Okay then go ahead and make it.","Is a general processing unit?I recently read of a company hardwiring an already trained LLM. Which is very cool idea b/c then it is able to run at orders of magnitude faster and less power — but it can’t be retrained.","A pure NPU neural processing unit is an inevitability.","Someone tell me what stock this is!","Bring it to market or be quiet.","The real reason China ain’t going to invade. These chips will be in the missiles sinking their invasion fleet","This is how wars should happen. Not guns and tanks and bombs and tanks."],"points":180}]