[{"text":["Parallel v/s Asynchronous Programming in .NET"],"points":0},{"text":["Underground AI — Unlimited Chat & Image Generation On Your Computer","Title should read \"On your Mac\".","Medium friend link without paywall: https://medium.com/@jankammerath/underground-ai-unlimited-chat-image-generation-on-your-computer-0e2a2c46b091?sk=b33fd0125e02b23a70468f1b8ddd7e5d"],"points":1},{"text":["Hamburger Animation help","Hello, I need help figuring out a hamburger animation. I got permission from the owner to extract it, but found out that the website was built by a website so it’s unreadable and as a new person to coding it’s to advance for me to figure it out.The animation is only on the mobile look and I want to have the code so I can have it on both desktop and mobile search engines"],"points":0},{"text":["Simple JavaScript code that could help soldiers and civilians evade drone strikes. Armaaruss Military Drone and Soldier Detection System (Armaaruss Model Sys Version 1)","This program has multiple functionalities. It comes with both a primary and secondary detection. The primary detection(the white bounding box) is the basic object detection using the webcam of one’s device. However, the primary detection does not react to color calibration, meaning that the output is the same regardless of whether the screen or frame is bright or dark. The secondary detection’s output is tied to color calibration, meaning that using the different filters used to alter the appearance the frame/video will affect the output of the secondary detection. You can test this on the app by clicking the “Black” button. The screen will turn black, but primary detection can still be activated, while secondary detection can no longer display a bounding box. Secondary detection is functional, but cannot see or detect anything because the screen is black—it is essentially detecting a black image, while primary detection is still processing video output. The breakthrough here is that the javascript code for the secondary detection is treating the webcam video output as an image, and not a video. A good way to understand secondary detection is to imagine continuously uploading a new image file every second. With tensorflow’s default object detection code for detecting objects on various images, uploading a new image file every second is what one would have to achieve in order to match the processes of secondary detection. This application entitled “Armaaruss Military Drone and Soldier Detection System” manipulates tensorflow script to have every frame detected and treated as an image, with the bounding boxes rendered and removed with each frame. This is what makes Armaaruss’s vision component different from other object detection applications.Thus, it is inferred that secondary detection can be used to detect object in different scenarios without having to re-train the models over and over again. This provides the possibility that drones can also be detected at night by applying the “invert” and other filters to color calibrate the frame that contains the video output. The primary detection box is “white”, while the secondary detection box is “red.”This Armaaruss application, while not quite optimized for mobile use, comes with an aerial object detection system and intruder detection system that uses a beeping sound and voice to indicate when these have been detected. The aerial object detection system will beep when an aerial object is located. The longer an aerial object is hovering near you, the longer the beeping noise. For soldiers, this could mean that a drone is targeting them. Ideally, soldiers would use the app on their cell phones and attach the device to the top area of their vehicles or to their body while sleeping in the trenches. Keep mind that sim cards must be removed and cell phone wireless connectivity must remain \"off\" in combat environments. Before deployment, soldiers should connect to wifi and start the app. Once the app is started, a soldier can then disable wifi and leave the app running as he/she is deployed into a combat zone. For detecting aerial objects in combat, android phone should be mounted to the top of the backpack or top of the helmet.In civilian environments, the cell phone, with wireless turned on, could be placed on rooftops. With internet access, a user could view the aerial scene remotely with facebook live"],"points":1},{"text":["Making CSS View Transitions Easy with Velvette"],"points":0},{"text":["Increasing velocity by modernizing a Python codebase"],"points":0},{"text":["Unveiling the Fort Knox of Cryptography"],"points":0},{"text":["New LINQ Methods in .Net 9"],"points":0}]