[{"text":["Do you need to add IOC's when you have Defender for Endpoint?","Yes, you need to track IOCs if you want to do integrity monitoring or user behavior analytics. Luckily you can now use this tool to get both - centralized Defender alerts and IOCshttps://github.com/bgenev/impulse-xdrhttps://impulse-xdr.com/","No. You don’t need to add custom IOC/IOA. Only really if you want to block malware or other executables that are bespoke or unique to your environment. I used it to block and alert on TeamViewer use. Not really it’s intended use case but hopefully illustrates what it can do.Microsoft updates their rule logic automatically to keep up with threat trends, it’s not always perfect but normally detects majority of attack chains. If it misses one part of an attack, it will detect another part of it later in the chain. I know this from working on extensive purple team tests over the years.","IOCs like hash and domains no with the exception of stuff partner orgs with connections to your network might have when they get compromised","Defender has native blocklists and such, however as your org matures definitely add additional IOC's to match your orgs business needs. For example we have multiple clients who have added IOC's related to \"benign\" programs such as team viewer their organization is blocked from using.Also as new threat intel comes out you might pick up some IOC's not defined by defender. Be sure to add these once discovered by a Threat Intel team."],"points":3},{"text":["Sudden Email phishing attempts at work","The best (worst) part of this post is that there isn't really a question.","As a student in the field. I can say positively that I have zero idea","There’s no way to prove anything about the Okta breach unless your sign up address to Okta was poisoned (the old email+token@domain.com trick) and even then, that wouldn’t be proof just evidence.Tho your company should really invest in a spam filter at this point. Mimecast was good in the old days, they’re still around right?","Are you in IT? Sounds like there is a non-zero chance someone turned on phishing user awareness testing? Don't click but ask the IT leadership.","Recent Okta breach was in regard to customer support users - so its unlikely all your organization emails were leaked. They should notify your organization if that was the case (at least in the EU its mandated).Once your email gets into spam database, you will always get tons of unwanted emails. Configure your anti-spam filter better, Google workspace has a pretty decent one. We get hundreds of spam/phishing attempts daily, and maybe 1% actually get to the users' spam folder.","Most likely you can trace this phishing campaign (which seems targeted) to some reconnaissance emails that were sent in earlier months. Look for odd emails such from random Gmail or Hotmail emails that contain little content that were market as random spam.These can contain content such as nothing but \"hi\" or random quotes from books, but could also be low level attempts sent to every variation of your orgs emails until they actually successfully send to an address.Some questions here:Do you have an email filters or email security platforms such as Cisco Ironport or perhaps Fortimail email gateway (which I prefer due to its excellent logging) or even 0356 email protection and logging enabled.As a follow up do you have logging from any of these security tools sent to a SIEM platform (splunk, Qradar, Ms Sentinel ect.) This would make tracking the emails and gathering data from your whole org a trivial process.I am assuming you are in some sort of a managerial or IT role ensure your teams have adequate security awareness training as sadly the end user is always the weakest link. Ive seen orgs with the most robust sec infrastructure and amazing sec awareness training still fall victim to sophisticated phishing.If you have more questions or need some help on this feel free to DM me I am more than happy to lend a hand here."],"points":20},{"text":["Duplicative tools","I have seen many organizations using multiple SAST/DAST/SCA solutions at different levels.A common combo for SAST is SonarQube + Veracode for example. And for DAST, ZAP during development followed by Burp in the internal pentests.As long as it’s not holding development back, and the org is willing to throw the money, more coverage is better than no coverage.","Different tools can find different vulnerabilities and risks. The capabilities can also differ on what they support. For example, I used to support three AV/EDR: defender, crowdstrike, and clamAV. Each one was for different OSes and different use cases. Defender for workstations, crowdstrike for servers, and clamAV for legacy/OT systems. Make sure that the use cases and capabilities indeed overlap but know tool sprawl is definitely a thing.","Definitely a good question to ask - we run Defender and S1 simultaneously but Defender really is just for MS purposes like Purview and not true EDR. So it might look like we run both but in reality they serve different purposes."],"points":3},{"text":["Hands-on learning cert for someone who took Security+ back in 2022","THM and HTB","Why not start throwing your resume at Cybersecurity roles. This sub has always been a bit gatekeepy and dramatic. Don’t let them stop you from applying.","CyberDefenders’ CCD","Practice secure configuration management, threat detection and integrity monitoring with this https://github.com/bgenev/impulse-xdr"],"points":11},{"text":["Infosec capitalisation of assets in finance?"],"points":0},{"text":["for people who joined CyberCX academy (AUS) - is there any contract limitations?"],"points":0},{"text":["How have people's experience been with domain monitoring services?"],"points":0},{"text":["Exposed database at YX International, a tech firm handling SMS messages, compromises security for users of platforms like Facebook, Google, and TikTok","This is the same thing from 2 weeks ago if anyone else is unsure."],"points":1},{"text":["CSA's IoT Device Security Specification sets a vital standard, ensuring robust security for connected devices globally"],"points":0},{"text":["US Warns of Cyberattacks Against Water Systems Throughout Nation","Was wondering how long that low hanging fruit would sit unpicked. US water security is shit. Power at least tries, water doesn't even have the budget to hire someone to try.","I hope it’s just my tinfoil hat talking, but articles like this make me think that they have already been trying, got close, and have so far (thankfully) failed.I keep a few cases of drinking water in my house as a general “just in case” measure, but it probably wouldn’t hurt to keep a decent amount of potable water/water to clean with on hand if the worst were to happen.","I actually met a guy who managed - by himself - the industrial control systems (whatever it’s called) for a California county’s water system, part of the state aqueduct system. Super fascinating conversation, he basically explained that their security strategy is that the whole thing is painfully airgapped.A little later in the convo he pulled out his laptop and logged into a dash board for the system. I was like “the fuck kinda air gap is this?!”But.. it did make some sense. He explained that everything I was seeing was merely sensor readings, but the control motors to turn sluice gates and stuff like that had zero networking.So his job (he was technically a contractor for what it’s worth) was to get paid a few hundred grand a year to basically just monitor stuff. But if and when an issue occurred no matter the day or time, he was responsible for getting someone (usually himself) in a car and driving anywhere from 20 min to 3 hours to go deal with a problem.This was a smaller county population wise and had no water treatment / reclamation or anything fancy like that. I’m sure LA county is a much different ball game. But while the system was extremely manual, and highly dependent on one or two people, it really didn’t seem that vulnerable from a cyber standpoint","The government should probably have a department dedicated to securing these types of facilities, like full control over the cybersecurity of utilities.","Scarecrow Strikes Again?","Maybe it wasn't a good idea to make the internet from a series of tubes -Al Gore","This is what happens when you focus on building an image making fun little basic MFA video tutorials rather focusing on the real shit, the local rural areas the ones who need protecting the most do not get protecting because they're posting fun little videos for the IG, LinkedIn and social media platforms trying to look like a sexy agency","Glad I'm on well water","Help, someone's put malicious bytes in my water!","Steve Gibson from SecurityNow has been touching on this very matter on his last few podcasts. You should all take a listen. Steve is an asset to the industry!","laughs in well water and job security","r/BlackSwanEvent","Just had one in Dallas metro 3 months back.https://therecord.media/north-texas-water-utility-cyberattack","Does any remember when I commented on this /r last week saying \"has anyone seen the Claus Schwabb speech where he talks about a cyber attack crashing critical infrastructure like two years ago at the WEF and I said I thought they were setting the stage to crash the economy and usher in their digital currency. Now thus post. I feel like they told us what they are going to do. If you watch the speech the way he says it is basically not if it's when and in thr most creepy way possible. His exact opener was \"pay insufficient attention to a comprehensive cyber attack that brings down the critical infrastructure.\"","Thank God I live in a Really Small town."],"points":248},{"text":["Checking security posture for new software?","https://cve.mitre.org/cve/search\\_cve\\_list.html","Nist 800-37","If the tool is for Linux, isolate the it in a VM monitored by Impulse XDR and you'll be able to understand better what it does and if it's dangerous https://github.com/bgenev/impulse-xdr"],"points":1},{"text":["FREE Beginner-Friendly Coding Bootcamps","Ty!","Is there a certification coupled with this or more “dipping your toes” into the field? Either way I am going to do this, thank you!"],"points":0},{"text":["cybersecurity 2024 ?","Yes, just do it....get something started. Change later if you need to but go NOW. I'm a beginner. Don't doubt yourself. Pursue your passion and let it lead you.","Education? Work experience? Location? Need more info or use the search bar in this sub."],"points":0},{"text":["Crackers vs. Hackers","Old terms for old days. Cracking was defined in the 80/90s and later absorbed into hacking. It used to be an industry term. Cracking used to refer to people who broke into systems with brute force or through illicit means, it is essentially meant to mean hacking but with bad intent. They'd \"crack\" a password to gain unauthorized access or they'd \"crack\" the code with malicious intent. Cracking is usually always illegal. The public (and the government) did not understand the difference so it eventually got dropped as an industry term and was referred to as \"hacking with bad intent\" or just simply hacking. Unfortunately for legal hackers this put a bad name on the industry. People are scared of what they don't understand.Hacking in itself is not illegal if there is some sort of prior authorization or some sort of authorized public disclosure of code. Hacking is illegal when done intentionally out of scope of a prior authorization or when done without any sort of authorization. Hacking is just a broad term for gaining access, causing a certain result, or gaming a system in such a way that was not intended. Hacking can be physical, virtual, or social. Hacking took over the public eye as bad because it is best described, broadly, as what bad actors are doing when they break into a system. There is another side to hacking which is very good and very beneficial.","There are security professionals, and then there are criminals.","came here for the racial jokes and was disappointed.","Crackers are something you add to soup .","[deleted]","Once upon a time yes, nowadays everyone is just called a hacker","Even back in the day (early 90's) no one called them crackers except for, maybe, the first fifteen minutes after someone coined the term. There were endless conversations then about the difference.","Welcome to 2009!","I remember cutting up sitting in a lecture and the professor bringing up the term “crackers” in a lesson about hacking","This is ancient terminology, but yes it did used to be that way.","The \"cracker\" terminology was a lame attempt to force a linguistic distinction. It never really caught on.","Hacker is ethics-agnostic; it’s a generational distinction.You crack an old-fashioned phone line, you crack a safe, you crack a password with tools, you hack a computer.","Yes","lol what","This is a bit of an odd question, in what context.I would say that globally, hackers is a larger group term with crackers being a subset.In the industry we tend to use white,black,Grey hats to describe if the hacker had malicious intent or not","This was just coming from a comment my ex had said months ago, and I had thought it to be odd when he said it, as I too have never heard of this terminology. However, recently kept hearing it being repeated on different YouTube channels and in the same context/terminology. Which is what prompted this goofy question, as I STILL DON’T get it!! lol","Crackers just = Hackers","Here in Europe, Crackers specifically were people who broke copy protection mechanisms so games could be copied. I was surprised when i went on the internet and people spoke of crackers who broke into systems.","...no?"],"points":49},{"text":["Defect Dojo UI not accessible from host laptop"],"points":0},{"text":["This FTP server had a hacked user","Bro.","First, I wouldn't post client information no matter how innocuous on reddit. Second, it looks like a crypto miner or a botnet. Up to you to decide as you are the \"expert.\"","If it seems fishy try to analyze it","Looks to be part of a botnet:https://github.com/akamai/akamai-security-research/blob/main/malware/noabot/iocs.csv","Like everyone else said. Posting Organization info on a public forum is a direct breach of confidentiality. A huge no-no.That being said doesnt really look like you posted anything that is identifiable. But for u get the file hashes for these and see run them in any reputation checker that may help. Looks botnet related.","I would say imgur is crap for screenshot hosting, for it resizes the image and renders its text hard to read. Here is the screenshot on IMGBB.COM: https://i.ibb.co/zPd29c7/FTP-usuario-prueba1-hackeado.png"],"points":24},{"text":["Withstand Security: Developer Security - Software Composition Analysis"],"points":0},{"text":["Practicing SIEM usage","You can get a free developer license from Splunk. It's a full blown license for 10GB im pretty sure. That would allow you to do just about anything from \"building\" and \"administering\" to \"Data Analytics.\" You get full access to understanding the building blocks of Splunk and it's processing language.What it will not do is give you a sandbox full of pretty dashboards and pre-canned data streams along with analytics to \"mess with.\" I should also note that it will not give you access to Splunk Enterprise Security (which is their SIEM offering). I would argue that \"practicing queries\" is outside the normal scope of SIEM, especially Splunk's SIEM.","Googled \"plunk cheat sheet\" and \"splunk training\":https://www.splunk.com/en_us/blog/learn/splunk-cheat-sheet-query-spl-regex-commands.htmlhttps://www.stationx.net/splunk-cheat-sheet/https://www.splunk.com/en_us/training/course-catalog.html?sort=Newest&filters=filterGroup1FreeCoursesTryHackMe: https://tryhackme.com/room/splunk201","Open and self-hosted SIEM that you can practice with https://github.com/bgenev/impulse-xdr","Check out Security Onion."],"points":8},{"text":["Cybersecurity News RSS Feed","You can check TLDR InfoSec newsletterhttps://tldr.tech/infosec","I like to hear the SANS Daily Stormcast","Bleepingcomputer have rss","I really enjoy Feedly."],"points":6},{"text":["Please teach OpSec / cyber hygiene in all tech degrees","I’ve been working on a course on these topics for older and less tech savvy people. Right now most of the content is free.I think it would be good if these topics were taught as a part of some standard curriculum but I also feel the same way about basic tax stuff.My course is at https://blueox.ai if you want to have a look.","that's not an academic topic though reallySo what course are you adding that to? who is an expert? what books/readings are there a bout it?there's a difference between an academic topic and work task","Yes and no.It’s a good idea as those are good to know but kids coming out of these program aren’t even ready for their own fields, adding to it won’t help.I mean, seriously, I had to retrain every single one of them new college graduates I hired already. I’d be happy if their core curriculum is better taught.","Add it in highschool, right next to the class where you learn about how to do your taxes and be an adult.","I would prefer it start in elementary school and be an annual topic through High School. No one should not understand the basics of cyber hygiene. Of course, a lot don't know how to spell or do basic math either, but we can try.","Like 99% of the courses I took in college, the only thing that was relevant when I got into the industry was excel. Academia lags too much behind technology to be current."],"points":26},{"text":["Incident report timeline visualizer / tool?","Isn't it weird how much it matters that the data looks pretty?It's easy to get that sort of thing from one tool's perspective - like an EDR tool or something - but it's hard to get a nice visualization that showcases all the work that went into all of the incident management (or feeding in data from multiple tools or information that doesn't live in a tool - like a meeting between the security team and csuite).We ended up in a similar spot to you - but we're using Canva for this. It takes a little less time to move your bits and bobs around in Canva than PowerPoint, because you can quickly anchor different elements together. So instead of moving your text, and then moving your little dot, and then moving your arrow (or whatever) - you're just snapping one point that moves every anchored element.","Build ur own time using draw.io","I have been searching for a tool like this for years, so I second the request. What I would REALLY like is a tool that can open at least text files, but others would be great, or maybe have a way to paste snips and add a little meta data, particularly time, then be able to sort based on that time. I think it would be fantastic if it was a feature of something like Maltego, so you could build a node graph of same as an alternate view. The number of times I've had to go through a bunch of different log files and scrape things together in Excel or other tools just so I could sort them after the fact is incredible. OneNote and other tools are great at taking notes, and even collaborating to a degree, but then you have to refactor all the information. As part of a larger tool set including OSINT functions it would be fantastic.This, btw is a great idea for not only cybersecurity incident investigation, but general operations investigations in large systems as well, tracking events by cause and effect as well as time."],"points":2},{"text":["For a mid level Cyber Generalist - best Cyber specialization to move towards?","My technical background (all legacy and truthfully mostly obsolete) includes WAN networking and Cyber engineering, with expertise primarily in firewall and VPN engineering. However, with outdated technical skills and my shift to a managerial role, I'm concerned about my future employability.These are all very relevant skills still. This stuff isn't just going away - it's just being implemented and managed differently.​One big achilles heal, missed the bus on coding.I always see this from tech people and it's just odd to me. Like we have learned some of the most dry and obscure skills like routing and switching, networking, etc.. However, somehow like over half of my colleagues straight up refuse to learn even basic Python. It's not that difficult and actually once you know it - it's like having a super power against most other Engineers who don't. You don't have to be a developer, I'd say web scraping and API manipulation will carry you farther than you'd ever imagine.Recently I pivoted to a Cloud-based role that includes a lot of IaC with Terraform and I love it so far. It's still security because it's using Terraform to spin up and manage security controls in the cloud. I highly recommend learning IaC even if it's just for fun."],"points":0},{"text":["Data Breach at Mintlify Sparks Concerns Over Third-Party Integration Security","I'm not sure this sparks concerns any more than every other breach involving third-party integrations."],"points":1},{"text":["Zero Trust & API Security: Robust Authentication with Edge Stack"],"points":0},{"text":["Cybersecurity Firm Recommendations","I know of many DFIR capable contractors in Sweden, but if you are gonna ask them how to proceed and then do the actual investigation yourself to save money or whatever, you're not gonna be successful.Doing a forensics investigation that end up in court requires a lot of systems experience to retreive the artefacts and then understand them. If you want to go a head with a case, i suggest you do more than \"basically ask questions\" with such a contractor, some of them also have experience witnessing in court - and that is another reason to hire a professional to do the investigation - you don't want an experienced defender to tear up your defence because you do not know how to \"make real sense of it\" and produce a subpar report.","I have no affiliation - NetNordic has some quality people in this space."],"points":0},{"text":["Add 2fa/mfa on current e-commerce website?","checkout our solution: https://www.datawiza.com/add-mfa-to-legacy-apps-without-code-changes/","Does it support OAuth2/SAML or other SSO for authentication?","Maybe Microsoft Entra helps you out"],"points":1},{"text":["500 end users, MFA needed, can't require personal phone use","Please consider Yubikeys before even thinking about RSA tokens. Heck any security key is better than RSAEdit with some elaboration why i'm suggestion advice:Pricing is absurd for RSA tokens vs YubiKeysTOTP: RSA tokens don't even roll the normal TOTP solution, they have their own propriatary brandStandards: YubiKeys are in general built to support way more protocols than RSA. YubiKey 5 supports more or less all token standards you can think of, and the bio series (fingerprint reader) supports the hipper FIDO2 based ones.Ease of use: Having pluggable and NFC chips is way less clunky than a manual (basically analog) code chip.Trickle down security. An added bonus of yubikeys is that there is no reason not to allow your employess also use the FIDO2 capability for all their personal accounts (with warnings about losing the key). Which in turn increases their overall security posture.","We just went through this with 2500+ users last month: MFA required but can't require personal phones. We bought 1000 Yubikey Security Keys (the cheaper model that only does FIDO/U2F) and then only ended up distributing less than 250 (personal phones are allowed as an option, with the Yubikeys available for those unable/unwilling to use their phones).In other words, 90%+ chose to use their own phones, even when an alternative was available. Do with that anecdotal statistic what you will.","DUO tokens.","Windows Hello for MFA to the company laptop, then restrict O365 to managed and compliant devices. Anything else could go through AzurEntra SSO and CACL's to enforce the same compliant device.","I dealt with this at a prior company. I gave users 3 options:1. Use your personal phone. Most chose this.Get a phone call at your office phone.Don't enroll in MFA. You won't be allowed to access cloud resources from outside predefined IP addresses.Out of about 2000 users about 50 elected to only have access at the office. They were upset when COVID hit and they couldn't work remote.","Yubikeys or cards would be your only solution.Honestly cheaper for your org to lift the refusal to allow for personal phones with a app, its not like you are installing MDM on the device.","Duo tokens or Yubikey is your best solution. That and doubling down on end user comms regarding Duo Mobile (push). While you can’t mandate they use personal phones, it is the easiest. Contrary to assumption - Duo is not an MDM & there’s no privacy risk.On another note - if you’re an EA customer, leverage your sales rep to engage the Duo engineers for guidance. There’s a ton of documentation available for this. Additionally - your EA allows deep discounts and other cool shit to make your life easier.","Have a look at Token2 PIN+ FIDO2 Keys. A bit cheaper than Yubikeys, but you will not end up with users setting 123456 as their PIN code. FIDO2 keys are more secure than OTP tokens.","In before that random RSA sales rep tries to corner you into a meeting. RSA rep, if you're out there, just be transparent about the hardware token pricing. No one wants the sales pitch for the platform.This company explains the different type of tokens and the licensing requirements.https://deepnetsecurity.com/authenticators/one-time-password/safeid/hardware-mfa-tokens-office-365-azure-multi-factor-authentication/With 500 end users, I'd budget for about $10-$20 USD per token. There are cheaper ones out there but supply / customer service may be an issue.","Hypersecure makes a small fido2 key that is $10, however it is usb only but is a good base option.If you are looking for small TOTP token2 or deepnet security both make good options, but limited battery life 2-4 years.Honestly fido2 is great but just doesn't have good mobile / website compatibility if you have a large number of integrations. We found you still need an app for some users.","Duo has tokens you can buy direct. Not too expensive and automatically added to your account.","In addition to the great recommendations already in this chain - you can also take a look at RFIdeas *if* using badge readers, biometrics, etc. is an option for your MFA approach. They're going to be a lot less expensive in terms of initial spend - but as with ANY solution, make sure you look at the total cost of ownership....with focus on what it takes to operate and maintain these solutions.","Depending on the level of security needed you can also install a TOTP emulator on their computer. It’s not ideal but it limits access to the one computer.","We met with a company called Miracl who provides MFA for clients with this situation.","Can you allow personal phones but if they don't consent then do hard tokens/yubikeys?","Then make sure they can’t connect to any company WiFi or access company email/apps/data on their phones. If they complain make them sign an MFA policy that states they must use their personal phone for MFA purposes.","You can give them instructions for registering their device for MFA - no need to require it but I’d bet many will choose to use the app. Let them know if they don’t want a company app on their phone they can get a yubikey, first one is free but if any get lost or destroyed, they’ll need to foot the bill for that.If you’re using azure mfa you can have the 2FA occur through their outlook app on their phone, as I’m assuming many people have that installed , so it wouldn’t be a big lift in asking them to install a second app.Alternatively for the holdouts, let them use phone mfa, they can register their home phone, desk phone or cell phone. I know phones aren’t as secure as apps, but on the flip side not one of my financial institutions requires or even suggests an app for MFA, they all feel comfortable with the risk of using it phone and sms","500 yubikeys baby","https://help.duo.com/s/article/2112?language=en_US","Yeah YubiKeys are solid but also check out Duo's push notifications if you haven't. They're pretty seamless and might be a good fit if the price is right with your current setup. Plus no need for personal phones if you can swing some kind of company device or find a workaround.","We did a rollout yubikeys to multiple thousands of users and they’ve served us well. I highly recommend that route.","A few others to consider Nitro key solokeys","If the devices have biometrics, you can use that with Duo (either as a factor or passwordless). You can use yubikeys for sure (but you have to manage them). Would you consider Duo desktop authenticator (in private preview now)? Coupled with Trusted Endpoint policy it’s pretty secure.","Certificate based auth. or Passkeys + Bitwarden whenever Microsoft gets their act together.","500 is nothing. We did it with almost a million. (Maybe even over a million) Why not just use that?","RSA tokens?"],"points":228},{"text":["DLP: Product recommendations for data uploaded to cloud outside of Microsoft..."],"points":0},{"text":["GRC Professionals to Follow on LinkedIn","Having to work on policy and compliance pretty much weekly, I dont have the energy to write about anything this dry lol","Gerald Auger makes plenty of content and has a daily cybersecurity news stream.He made the GRC Master Class.You can find it at Simply Cyber: https://academy.simplycyber.io/p/the-definitive-grc-analyst-programorTCM Security: https://academy.tcm-sec.com/p/grc","I truly don't have an opinion on him yet because there's so much to read constantly, but Jacob Horne is relentless on LinkedIn, I swear posting is his job. He is very vocal and persistent with preaching CMMC and NIST requirements, and from how he breaks down updates, drafts, change to clauses, frameworks, etc., he seems to really know his shit.","I got you. And join us over in /r/grcThomas Fox > Has a compliance podcastAyoub Fandi > GRC at GitLab and has a GRC Engineering podcastJack Rumsey > GRC at Swimlane and has the GRC Destroyer newsletterVarun Gurnaney > GRC at Apple. I have been chatting with him about the practical uses of AI and engineering. Super smart dude.Mark Graziano > Runs the GRC Podcast, and truly gives a shit about improving the practice.Michael Rasmussen > GRC 20/20. Not as familiar with him, but he calls himself the GRC pundit.Scott Mitchell > OCEG and an OG GRC person. They put out a lot of resources.Troy Fine > Used to work with him, went back to being an auditor, don't ever tell him SOC 2 is a certification. All around good guy.Kerwyn Velasco > Was a competitor of mine that I respect, but is involved with ISACA and has good GRC takesPatrick Garrity > Not just GRC, but covers related topicsSean Connelly > CISA, covers more than GRC, but highlights regulations and other things that impact our spaceFolks I work with that are brilliant and keep me from saying stupid stuff:Shane on PrivacyDaniel a former auditor","Im also curious. Mostly just follow actieve ciso's","+1 Troy Fine. Don't know how I ended up following him but good content","!remindme 2 days","!remindme 7days","Can I suggest a change in phrasing / paradigm?When you want to ask this type of question next time, on a public forum like this, maybe go like\"Hey guys,I wanna follow GRC dudes on LinkedIn, because I have 4 years of xp in cyber but want to move to GRC and want to learn how they think and talk about stuff and keep up to date on industry trends.So far I've foundxyzI dig their content, but it's pretty simplistic / not deep enough / too technical.Do you have any other ideas?\"If you do this, it:a) shows people that you've done the minimum necessary homeworkb) It helps other people who might not follow x, y, z to get something in return while interacting with your postIf you phrase it like you did, I wouldn't go ahead and make a thoughtful list of suggestions, because you seem to ask the question like you would do to ChatGPT."],"points":51},{"text":["Does it make sense to major in cybersecurity?","If I could do it all over again, I’d say this. the magic of PenTesting is fleeting so I’d do something less specific with a few more options.I wish I’d have done Computer Science I wish I was better at programming.but here’s ultimately the thing. No one will and could answer the question for you, you absolutely have to figure it out yourself. I have no idea how you could know before hand what you’ll want afterwards but specifically that’s why I would do something with more opportunities.","So this subreddit is just the same 4 questions over and over again?","Get a computer science, info tech, or info sys degree instead of cybersecurity. A lot of schools will offer a major in computer science, for example, and also allow you to specialize or choose an area of focus like cybersecurity.","This question is just going to get you biased answers. People with a computer science degree will say you need that, people with a cybersecurity degree will tell you it is fine, and then people with no degree will tell you skip school and get certs. Figure out what you want to do and follow that path.","I manage a SOC, and I'm unlikely to hire someone straight from school into our team. Most of my team has a degree or training in IT of some sort and started in another role. I want people who have some experience in the real world supporting/fixing Windows and Network issues. You need those core skills (in my opinion) to move into Cybersecurity. I got my start building computers, moved to help-desk, supporting network/servers, and even did some coding before moving full-time into security.","Not at all. Cybersecurity is either in the weeds or Birds Eye view. No way you’d get that from a degree.","Get an IT degree.","No, major in computer science. Learn how to program.Edit: I think most cybersecurity can be learned on the job and cybersecurity degrees are very common nowadays. The programs also vary in offering and no 2 are alike. Programming/CS is in demand and all of my roles required that I know how to read/write and analyze code.","Instructor of Cyber Security (part-time) here:As many here have said CompSci or IT, gather experience, then focus later on with additional training and certifications. Undergrad should be a foundation / generic. Grad school and certs are where you can focus - once you have experience.I TEACH Cyber Security courses and I am in disagreement with our curriculum and full-time faculty on a lot of the stuff we teach. Why? Because it's both too high-level to be useful or applicable and too specific to just security to really make sense. A lot of colleges are trying to fill a gap they don't even understand themselves. Security is really hard to break into because most security roles require years of understanding in operations, development, or other parts of technology first. The faculty teaching a lot of these courses don't even have security backgrounds themselves. It's blind people teaching other blind people.This also gets posted literally daily on this sub but it is really difficult to just \"jump into\" security. The few people I've known that have, came from a Computer Science degree / background and pivoted from a development to security and a pseudo red-team role. Blue team though? Really hard sell. How do you secure infrastructure if you don't even understand what it does? How do you secure a network if you don't understand routing, switching, TCP, UDP, etc.. How do you implement controls if you don't even know why you need the controls? I can teach people how pass a Security+ exam all day, and I can teach them how to literally press buttons on a security appliance UI. It doesn't mean they understand any of functions they are performing. This is where these degrees fail. So you can put a base config on a firewall and tell me how to create a policy? Great, so can a Help Desk person. You can perform a basic nmap scan with Kali Linux? Cool, so can literally anyone with YouTube.So many of these \"Cyber Security\" degrees miss the bigger picture and that is that they teach you HOW to press buttons and do things. They don't teach you WHY you have to do these things and unfortunately that usually comes with experience.It took me years and years of experience and education to truly understand enough about information security to feel confident performing it. None of my degrees are in security. I'm a BS - Information Systems / Technology and AAS - Information Technology Network Administration.","I’m currently in community college in my 40’s to learn a new trade since cancer disabled me from my manual labor career, but disability pays next to nothing. I’m majoring in cybersecurity. And programming. And also network management… because of the schedule in which the necessary courses are offered, I will have an extra semester anyway, and add in summer semesters, I’ll graduate on my original timeline with 3 degrees instead of one. Not sure if I’ll go directly into the 4 year degree or wait and do it over time.","I have a cyber security degree am I now work for a Fortune 500 as a senior analyst make 6 figures and I’m about 4 years out of school. Do whatever you think is interesting and make sure it’s accredited. My degree was considered part of the STEM field at my college. If you get good grades and push for internships you’ll be fine no matter what you pick","Cyber security is not an entry level thing. It's something you get into after being in IT. Go for comp sci or for IT, learn a stack whether it be programming, or like azure and then learn to secure stuff, get some cyber sec certs and find a job in the field.","Study comp sci, learn python, azure, and AWS and then specialize. But with the money you’ll be making you likely wont even want to do cybersecurity anymore lol","Personally no. My experience is an IT Business degree will take you a lot further (if you want that path). My own experience is certifications carry a lot more weight in cybersecurity.","It's a tough thing to answer because cyber programs vary so much from school to school.Getting a comp sci degree is a safe option because of its versatility.Depending on your school you may be able to double major, minor in cyber, or complete a 4+1 BS/MS.I would argue a 4+1 Comp sci/cyber will be your best overall option.","I can only frame it through my life path. I had been in reasonably low level IT jobs (help desk / specific software support). My security degree was an amazing way to fill knowledge gaps, change scale of perspective (as security is pretty holistic). My experience was that a security degree is a great place for a tech generalist to be. It's wide and shallow versus narrow and deep.","The only right answer is: it depends.Everyone's journey is different and yours will be your own. As with any journey, you will get out of it what you put in.Personally, if I had to do it all over (I did a cyber program), I would do computer science with a minor in business. The first thing I would do when getting close to graduating would be to grab a cert or two in the area I would like to focus.I would also be networking like crazy during school and line up cyber internships during the summers.That would be the ideal setup for a long, successful career in cyber.","Do something more in demand and pivot to cyber IMO","I'm getting my degree in informatics with a specialization in cyber. My degree is very focused on practical application and feeling comfortable in a work environment. Just research schools and go somewhere that has a good program that actually tries to prepare you for a career.","I would pursue a computer science degree. That gives you the flexibility to move across fields if you get burned out or find something else interesting.","I am of the opinion that a major that focuses on coding will yield a career path alot quicker than any other IT degree path.","I have cybersecurity degree but I decided to go back and get another bachelors in computer science (it was quicker because I did it at the same school). I’ll be honest the concepts were not that difficult to grasp. I also have a 6 years of experience as a cyber analyst. Most of my knowledge is from OJT. I agree with some of the comments here that CS might be the way to go because it’s teaching you the deeper side of things and you can branch out to more technical roles such as devsecops or security engineering. Even reverse engineering and vulnerability research requires you to understand programming concepts, computer architecture, hardware, etc. A lot of cybersecurity jobs also require scripting now. You only get the first layer of things in cybersecurity. But if you really want to learn specific fields in cybersecurity I recommend getting certifications.","No. Go study computer science. Get a masters in cybersecurity if you’d like, or maybe some certs.Computer Science will get you much further in your career.","Nope lol why there is a major in cybersec to start with, this is not entry level you need CS and IT background...","OP,You won't be an \"all-knowing employee\" until you have field experience. With that said... if you have a specialty as opposed to the general knowledge base, that'll go a bit further.I'd recommend a generalized knowledge base, plus a speciality... ie Networking, Coding, etc.","If you chose the right school, then yes. You'll want to start with something on the NSA excellence list (it's pretty big now), and then you want to make sure you are picking something that is actually hands on, as a lot of them can still teach the curriculum without actually 'doing' anything. A good school is going to give you the classes to be good at wireshark, understand how AD works, etc.To truly excel, you will be doing the coursework and then spending time at home building your own lab to take that foundation and figure out what you enjoy to take further. You need to really enjoy this stuff to get immersed in it and build out all of the supporting pieces.Frankly, the biggest part in choosing a school for this is figuring out how their career center works. What do they offer for mock interviews, resume building, etc. What do they do for career fairs, what are their placement rates and success stories? You can end up in some middle of nowhere small school that ends up providing excellent coursework that gets you engaged, while also having a good career center that gets you into internships and into the job market.As many other people will state: you need to be good with computers as a whole. You need to understand how windows works in and out in order to attack or defend it, you need to understand how things like AD works, you need to be excellent at knowing how to read wireshark, how to talk networking talk, etc. This means you need to have prior 'CS' general experience, or be ready to dig down and learn it yourself on the side to supplement whatever your school is teaching you.People won't like to hear it, but if you chose the wrong school you will end up like most saying 'no'. If you chose right, you will be on the side of the fence I am on, which is saying 'yes'.","I’m a recent graduate with a degree in cybersecurity, and personally it was a great decision. I ended up with a good job in the field doing something within my specific skill set. The one thing I’ll say is that you should never go into a cyber degree, and maybe a computer science degree for that matter, with the idea that you can get everything you need solely from the assigned courses. The classes I took prepared me extremely well, but I spent a lot of time learning outside of class with the security club and with personal projects / homelabbing. If you are interested in a cyber degree make sure you find one that doesn’t teach you how to use tools, but rather teaches you fundamentals in programming, networking, databases, report writing, and systems administration.","If I were going into school and 18 - I would get a CS , networking , or mayyybe a web programming degree. (Like many have said )I can’t decide if I would do airforce before or after degree , but that would be high on list (if op in USA)If no airforce and you love school maybe go to law school after undergrad. Tech savvy lawyer with infosec knowledge probably more in demand than fresh out of school cybersecurity degree kid fighting for that entry level soc role with other recent grads .No surefire path and nothing is guaranteed - but unless you are like super badass techwise I would spend time focusing in on one of those skills. Plenty of routes to get that cybersecurity job …Don’t get me wrong - plenty of liberal arts majors get a helpdesk job and end up leading a cybersec department - but I think a strong foundation will allow you to breath easier later in career.","Nope, major in Software Dev, Comp Sci, IT, jump from there to cybersecurity. Gotta know how it works to secure it","If you want to work in cybersecurity, why wouldn't you major in it? Of course you should. Just be prepared to do well in school and move to a different city after college for a job.","Cyber Operations from an NSA CAE certified school combines comp science and cybersec. Would recommend one of them. Dakota State is a good example that's also cheaper than most schools.","No, choose Business (Business Information Systems, if available).Cybersecurity is a business function.Coding and other technical skills can be learned in your own time.Learning how to communicate and present effectively and where/why/how we fit within business operations and how businesses operate is more vital to your career success.","What major is best is determined by which school you are going to, without that info no one can guide you. In general the \"safe\" route is always computer science from your state's public university.","Personally, if I was starting again and going the security route I’d be looking at starting with building some solid networking skills first. Knowing how the multitude of devices talk(and not talk) to each other can’t be overstated enough.","Graduated when cybersecurity degrees were becoming a 'thing'. In my working experience: IT > Cybersecurity > Computer Science > Information Systems","No","NO","Whatever degree you get it won’t matter. I personally would say do the cybersecurity degree, get trifecta of certs and maybe CySa+ and do projects with packet tracer, Wireshark, Splunk, AWS, virtualization and maybe think of doing one project working with activity directory. MyDIFR has one he’s doing in Active Directory now on YouTube. He also had projects and labs SOC related. No matter what degree you get it’s all very broad and 99% of the time recruiters don’t know the difference and only look if you have a degree, certs, projects and most importantly work experience. So try to get a internship while in school.","College is meant for you to get a bit of everything. Get a taste, smell, sight, or feel of everything. And than you on yourself will go and dig into what you found really interesting.","If your career goal is cybersecurity, yes it makes sense to major in it. You may not need the breadth of information when starting out, but as you progress into higher levels of cybersecurity it will certainly be more and more useful.","Nope, don’t major in cyber. It’s a waste.","Does it make sense to major in cybersecurity?That depends, are youA HS student looking to go to collegeAn adult with non related job experience looking to go to collegesomeone in the military looking to check the box to get their degreealready in IT and looking to check the box to get their degreeIf you're in High School and applying to college or in college and looking to declare a major, No picking cyber should be last on your listPick something you will stick with the next 4-5 years and want to studyWhat colleges offer isn't a mystery, their entire academic catalogs are online, find a program that interests youMajoring in cyber isn't going to make you any more competitive than someone who didn't because the majority of security roles are not entry level - you need experience in IT/operations anywayregardless of your major - take Public Speaking, Technical Writing, Business Communications, Project Management - learn microsoft office - because these are things you are going to use in any job in every single industryThere are plenty of free resources to learn computer science if you don't want to major in itI posted a list last weekUsing edX and MIT OpenCourseware take a look athttps://www.edx.org and https://ocw.mit.eduHarvardX- CS50's Introduction to Computer ScienceMIT - Mathematics for Computer ScienceMIT- Computation StructuresStanfordOnline: Algorithms: Design and Analysis, Part 1StanfordOnline: Algorithms: Design and Analysis, Part 2HarveyMuddX: Computer ArchitectureMIT- Software Engineering for Web ApplicationsHarvardX: CS50's Web Programming with Python and JavaScriptHarvardX: CS50's Introduction to Programming with PythonUCSanDiegoX: Data Structures: An Active Learning ApproachMIT- Database SystemsIBM: Introduction to Web Development with HTML5, CSS3, and JavaScriptLinuxFoundationX: Introduction to Open Source Networking TechnologiesNYUx: Network Security - ProtocolsDartmouthX, IMTx: Linux Basics: The Command Line InterfaceMIT - Effective Programming in C and C++MIT- Introduction to Programming in JavaIBM: NoSQL Database BasicsMichiganX: Database Design and Basic SQL in PostgreSQLHarvardX: CS50's Introduction to Databases with SQLMichiganX: Programming for Everybody (Getting Started with Python)UCDavis: JavaScript BasicsMichiganX: Using JavaScript and JSON in DjangoMichiganX: Django Features and LibrariesMichiganX: Building Web Applications in DjangoIBM: Linux Commands & Shell ScriptingRedHat: Fundamentals of Red Hat Enterprise Linux 9IBM: Introducing z/OS UNIX System ServicesIBM: Full Stack Application Development ProjectGTx: Human-Computer Interaction I: Fundamentals & Design PrinciplesHarvardX: CS50's Introduction to Cybersecurityanyone wanting to go really old schoolhttps://openmainframeproject.org/projects/cobol-programming-course/COBOL Programming Course #1 – Getting StartedCOBOL Programming Course #2 – Learning COBOLCOBOL Programming Course #3 – Advanced TopicsCOBOL Programming Course #4 – Testing"],"points":613},{"text":["Splunk integration on Gitlab"],"points":0},{"text":["New Detection Engineering Reddit","Your welcome post on that sub itself links to a different sub entirely."],"points":0},{"text":["Mobile device confiscated by CBP","When I cross borders I turn my phone off.Good luck pulling anything from it if it is booting from cold and doesn’t have the first stage of unlock yet","They're using Cellbrite to take a forensic image of the phone. The image will be saved for later use if they follow up with anything.During that later interaction, they'll try to legally compel you to give your passcode.Essentially, it's a way to \"hold onto your phone\" in case something develops later. Did they not give you a receipt or any paperwork about that transaction?Source: I work in tech in a law firm and we use Cellbrite for voluntary collection all the time as part of discovery. The protocol above has been used tons by us in the early stages of litigation; it let's a judge order a snapshot in time of a device, then determine later if someone's allowed to look at it, etc.","It depends on the phone make, model and operating system and if the phone was unlocked or not. They probably are using a system that can pull an image off the device but some phone manufacturers like Apple have deployed protections to specifically prevent against these types of attacks. For example:https://support.apple.com/en-us/111806The idea is the phone won’t communicate or even charge with an unknown device if it hasn’t been unlocked in the past hour. Not sure if Android devices do this.They could have been using a Greykey to try to brute force your passcodehttps://www.vice.com/en/article/k7835w/how-to-brute-force-iphones-graykeyYou can see here, the GreyKey only really works on older devices:https://www.magnetforensics.com/blog/graykey-supported-mobile-devices/They might have a device that tries to run zero day exploits to gain access to a locked device, but honestly I doubt it very much. Such exploits are with millions of dollars, usually reserved for attacking politicians etc.It’s hard to know really what they did, but hopefully this comment section sets you off in the right direction and you can find some comfort.My advice is, buy an iPhone, keep the operating system up to date and set a long PIN which is longer than six digits. My reason for this suggestion is backed by the links above, and moreover the Apple VS FBI case:https://en.wikipedia.org/wiki/Apple%E2%80%93FBI_encryption_dispute?wprov=sfti1","When you go thru the airport, have your devices powered off and ensure that you've got the device encrypted.Print your boarding passes before leaving home, or scan your passport at the airport.If the device was out of your control, assume it's been compromised.","Heh. Other people have explained the outcome. If it was a very new and updated phone they probably only got a logical image of the data. \"Only\". In a just and sane world they would only be using the data to validate that the reason for travel and the story matches up. In a not so sane world, they pulled all the text messages, contacts, picture metadata etc and aggregated it all into a system looking for known criminal connections and evidence of illegal items. Assume all the passwords are compromised for things like browser sessions, social media accounts, etc.. and are actively being investigated by someone looking for anything they can find :)","Look, no one here really knows as there's too many variables in flight. Your answer is somewhere between nothing and everything.More to the point, if you want to restore confidence in your phone, reset it to factory defaults.","They won't put anything on it unless there's a warrant that empowers them to do so, and it's the last step before they arrest you for something they already have a good idea that you're doing.What they're usually looking for is evidence of \"child sex tourism\". If you returned from a country that's notorious for it then that's likely why you were randomly selected.Then again, if you arrived from a nation hosting entities hostile to the US you were selected for other reasons entirely.More information: https://www.aclu.org/documents/government-data-about-searches-international-travelers-laptops-and-personal-electronic-deviceshttps://www.aclu.org/files/pdfs/natsec/laptopsearch/dhs_20100816_DHS000153-DHS000156.pdf","I'd assumem this device compromised. Replace and keep a very close eye on the user's account. Also r/absolutecomputergeek","Pretty much whatever your worst case scenario is, and then some:https://en.wikipedia.org/wiki/Cellebrite","I really want to know want you are doing to get flagged on this. I never heard of this as a randomed search. My understanding is these are targeted","They use graykey along with every single other federal law enforcement agency. Not many use cellebrite anymore to my knowledge. I know we let our cellebrite contract lapse when we got graykey back in 2019. They are basically doing a quick run thru texts and images. The software can quickly process and identify images like drugs, booze, cash, nudes, etc. they are looking for low hanging fruit. Don’t know how long they keep that image for though.","Probably imaged it with cellbrite and then they retain that.I'm curious about is if anything was installed.Not unless you are \"special\". Basically CBP won't do that but, if requested, they can hand it off to someone else in Uncle Sam's Acronym Soup of LE/IC to do their dirty thing with your fondle slab.","Depends on what they used to collect and analyze the device. They have access to pretty much any tool at their disposal. It might have installed something temporary to gain access or image the device. They can legally keep the data they collect if they suspect a crime (not saying that is right, just that they can). There has been a lot of controversy about how little they disclose about data from confiscated devices.","They can only take a image of the device, to install something on it they would need a warrant, this assumes it was the US border patrol. If they had a warrant to install they could have used that moment to install a device if you regularly do cross the border, if you don't it would be one hell of a coordinated effort that the federal government either isn't capable of for most things, or you really pissed off some people to get that much attention that they actually are doing inter-agency coordination.","https://news.ycombinator.com/item?id=27603747","prosperityDo you mean posterity?","In order to take a forensically sound image you have to use something that hardware prevents any writing, so if you only saw one operation the probability is it was read only.","They copy everything.","They do that looking for child porn smugglers"],"points":213},{"text":["SSCP study material","I just used ITProTV seemed fairly up to date","If you have done Sec + and CySa + go take the exam."],"points":1},{"text":["Wiz vs Orca vs Lacework","You are looking at some of expensive names. You might want to consider a smaller company like stacklet.My company was a customer /“design partner” for laceworks. If you plan on using this produce to also report on your instances (I.e. virtual machines) vulnerabilities I do not recommend LW, that was our biggest pain point with them.Long story short we moved over to crowdstrike. Crowdstrike is not perfect but it’s soooooooooo much better."],"points":0},{"text":["'Passwordless' Just Single-Factor","MS relies on Windows Hello where you need a device (the PC where you registered your credentials and is stored on the TPM) and either your PIN or bio (Face or fingerprint) when you login to your workstation. So it’s two factor- something you have (PC) and something you know (PIN) or something you are(bio). Of course I oversimplified the Windows Hello explanation.So you can’t use it on a different PC unless you also register with Windows Hello on the other PC. When you access Saas integrated with your Azure AD/Entra it derives a secure token from your previous Windows Hello authentication. So it appear to be “passwordless”. Some SaaS vendors leverage this ecosystem so they advertise as supporting passwordless.Now some augment this by asking for additional factors such as MS Authenticator or FIDO2 keys when accessing special/privileged systems or applications. Again, it depends on the implementation.In short, in some instances it may appear to be less than two factor but it may be due to the seamless user experience and security implementation that makes it appear to be less secure.","our \"passwordless\" - MS Authenticator on an intune registered device, requires 6 digit pin, fingerprint on authenticator, then providing a 2 digit code that is typed in authenticator.SIEM backing that up with SOAR to revoke sessions if it doesn't like the login telemetry.","Passwordless auth isn't mutually exclusive of MFA. You can be passwordless and still do MFA.Thanks.","I would argue the legacy view of MFA (something you have, something you are, something you know) is a bit simplistic in today's world of more complex attacks.If you have just a password, then it's guessable, disclosable from a breach, etc. I think we'd all agree on that.If it's just a \"what you have\", you're susceptible to either stolen device and/or fatigue-based attacks.But what if it's a device protected by biometrics or a passcode? It's now technically something you \"know\" (to unlock) or \"are\" (to unlock), plus something you \"have\".Many argue that technically speaking, a properly-configured Microsoft Authenticator setup is two-factor. You need device PIN or biometrics to get on to the device, then you need to approve the notification or enter the TOTP code. But if the phone is stolen while unlocked, both factors are defeated (unless app requires biometrics or PIN for each auth attempt). So is the service then two factor only when a phone is locked? This really is only a concern when the device is physically stolen - whereas the more common threat model is remote attacks, which it still is more secure than just a password.Layer on top some webauthn components (device proximity), you're still just as susceptible to physical theft attacks, but you are way more secure than password+TOTP style MFA for remote attacks.TL;DR: I think we need to properly threat model applications and risk scenarios, versus just blindly follow traditional MFA guidance.","Not all Authenticators (password/SMS/push codes, etc.) are equal. NIST SP 800-63B does a good job explaining when each type should be used.","Cause targeting a specific password can be an easy phishing aim","Currently, it's the new standard for best practice on 2 MFA.","Major vendors like Microsoft and Google recommend and Apple enforce 2FA/MFA so I don’t think that’s a bad trend so far","My biggest issue with passwordless is the reliance on devices and I think most anyone who's worked help desk knows how users treat devices. I foresee issues arising from users of single devices needing to reset every account they have after dropping their phone in a lake... again.","It's the passkey method (WebAuthn/FIDO2).Its designed to replace the password, which can be weak, written down, forgotten, phished or bullied out of you.So it replaces something know with something you have; a public/private key pair that identifies you on the device you're using. But MFA is still necessary to be secure, so we now have a passkey + device/authenticator/token etc.It's basically now \"something you have\" x 2, removing the need to have \"something you know\".","I think \"passwordless\" in and of itself is less a security feature, and more a convenience for the user. It's often implemented along with security features or other conveniences, such as through SSO or more secure authentication methods such as biometrics.","It is technically 2 factor, though. You have to know the code, and to get the code you have to have access to the email. It may not be more secure, but it's not really less secure and it's easier to use because you don't have to remember a password.","You are right, something you are can be faked, a second factor should be included","I'm not a fan of that myself, but I suspect it's because I haven't looked into it much. I'm happy with two conspicuously discrete factors.","If you require a passcode on the phone, especially at least 6 digits, or a biometric, that adds the layers needed.","Pretty sure the \"second factor\" is the user token that is passed when authenticating to these other services. However, I've seen recent reports that hackers are stealing these tokens and then abusing them. Would like thoughts on this from others in this sub regarding this concern.https://portswigger.net/daily-swig/vulnerabilities-in-single-sign-on-services-could-be-abused-to-bypass-authentication-controlshttps://www.netspi.com/blog/technical/web-application-penetration-testing/attacking-sso-common-saml-vulnerabilities-ways-find/https://trustedsec.com/blog/weaponization-of-token-theft-a-red-team-perspective","Passwordless does not inherently mean 2FA I guess","I implemented passwordless last summer and had to answer this exact question.To use MS Authenticator as an example it's actually 3 factors if you have biometrics enabled on your phone. 2 if you are using a laptop snd/or you only have a PIN on your phone.Authenticator Something you know: the two digits you need to enter Something you have: the registered device with a unique digital id/fingerprint Something you are: biometric verification of your identity registered with the deviceLaptop Something you have: registered device with a unique digital id using the TPM chip tied to the motherboard of the device Something you are/know depending if you have PIN or Biometrics to log in to laptop with Windows Hello","I concur with OP thoughts."],"points":107},{"text":["I just got hit with the HIBP paywall","$1000 per year is basically nothing for almost any org. I wouldn’t even bat an eye, this is not even half of a laptop, or even a singular business trip.Absolutely worth it.","If its not worth it to you, dont buy it","If you're relatively small then I'm not sure why you're looking at the highest tier of service.There are 4 different tiers, and $1150/yr is the all-you-can-eat service intended for organizations with many, many domains and thousands of users.It seems like the $285/yr tier is the most you'd need.(HIBP, can I get a sales commission from this?)","I work for an Org that has about 10k users we have two separate services for this combined we pay over half a million to monitor Deepweb and Reputation","They'll work with you on pricing if you're higher Ed or nonprofit.","I got the same alert today for free from haveibeenowned.com","HIBP aside, the data breach does not have clear text passwords, and if users are using different passwords (mainly between AT&T and org AD), then it shouldn’t have significant impact your company directly. The users having potentially leaked SSNs, DOB, house addresses, etc. is a huge issue, but mainly impacting identity theft. If you want to provide access for checking data manually, there is an offline HIBP tool, which is likely more security policy agreeable. Also, you can get the leaked data and run queries against it or script something for future use on other publicly leaked data, to check what users may be impacted. I’d recommend a fully segregated system / network for this, of course. HIBP is a great tool, so don’t let my post dissuade you from investing in it. I primarily wanted to emphasize that the AT&T breach is mainly an identity theft threat. Depending on your password recovery system, it may have very little org impact."],"points":62},{"text":["I have collegues insisting that cybersecurity is the most suseptible IT field to be taken over by AI as well as collegues that insist its one of the fields that will most definetly outlive others in the wake of AI. I'm curious what is your take on that.","AI will make a whole new arsenal of tools available to both attackers and defenders, and almost certainly cause a paradigm shift in infosec.That said, I'm a firm believer and have witnessed firsthand that 90%+ of cyber security concerns are related to the things people do, and their business processes. Perhaps I lack imagination, but I don't think AI can fully account for all of the dumb things users and managers do.The biggest piece of career advice I have for people new to the field is to not neglect developing soft skills. Most of the time the technology solutions are perfectly obvious, but you still have to convince people to change the way they do things.","AI is a tool, not a replacement for anything. Certainly nothing from a stupid chatbot that everyone thinks is sentient.","I sell exclusively to cybersecurity buyers in Fortune 1000’s. No one is talking about the proverbial “doing more with less” in cybersecurity. The conversations are tangential to that, “How do we do more with the same headcount? How can we automate the low value stuff our cyber team does so that we can reposition them to do higher value work?” Granted, that approach doesn’t GROW the workforce but it certainly doesn’t shrink it. Automation lends itself to machine learning and smarter AIs, so over time the “lower value” stuff that AI and/or automation can take over will get broader, but folks that embrace a healthy mindset of seeking to continually increase their skills set to do work that is of higher value will be safe for the foreseeable future. No one, and I mean no one is ready to allow an AI to make complex decisions that might involve shutting down key functionality. Example - we are selling a LOT of advanced API security solutions (those solutions that go far beyond what a WAF can do) right now. Traceable, NoName, etc. those solutions can detect very quickly when an API starts behaving outside of its behavioral norms and are capable of injecting rules into the infrastructure to either cut off all network access to the API or outright kill it off. Everyone is super interested in that, until it comes time to turn it on. And then almost no one does. Instead they create prioritized alerts to their SOC to get the right human involved as quickly as possible.","100% BS. Criminals are much smarter than you give them credit for.","The bad guys aren't gonna replace themselves with ai 💀","Cybersecurity is basically risk management. In order to manage risk you need to understand all the moving parts of a business, both human and technological and go from there. If AI could do that then its not just cybersecurity that it would replace, it could run the entire business on its own, not happening anytime soon","Society/Governments/Regulators etc are not going to accept that AI and not people are accountable.And people that are held accountable will try to shoulder some of the responsibility with other people.AI may reduce how many people are needed to do some jobs, but there will always be a need for people in jobs to blame / hold accountable when stuff goes wrong.","No IT field is going to forgo the use of AI to automate things. And no IT field is going to completely disappear because of the automation done with AI.","No one can know until it happens. Personally, my feeling is it's still a computer system that could itself be compromised and someone should be watching that as well.","It will enable automation of certain job currently filled by people as it will across many other industries and job functions, but it will not entirely replace it.","Wait until you have to secure AI itself. Sure AI will replace some things but it will create other problems too, so there will be jobs regardless.","Just look at the product roadmap for most security vendors. That will tell you whether AI is gearing up to make human analyst obsolete. I believe it will definitely reduce the number of cybersecurity professionals needed in the field.","Your colleagues on both sides can equally be right or wrong. The perception here is based on what they consider as 'cybersecurity'.If we're talking GRC? I absolutely can see a future in which organizations (Specifically those that can afford to) have their internally trained \"AI\" and can feed audit or customer questionnaires into, automating a decent chunk of what GRC individuals might be doing. The emphasis though is no job is really uniform so GRC can be a lot more than just audits and questionnaires, or it could exclusively be so.If we're talking about operational cybersecurity, my point of view is that it's certainly less susceptible. I think we're going to see a multitude of organizations try to replace the traditional SOC with AI, and more than likely fail miserably in it. In a demo over Copilot for Security, Microsoft's SA straight up refused to answer any questions regarding the accuracy and responsibility when AI hallucinates (granted they did mention how it would utterly fail against Zero Days, which is a plus). However, organizations like Microsoft are selling a different picture to executive leadership, trying to really push that 'replacement' point of view instead of a tool that will require cybersecurity professionals to be an internal guiding hand and help educate their executive leadership.tl;dr, it depends and neither side of your colleagues are more right than the others.","Tainted ML data is just as much of a concern to those in cybersecurity.","AI is going to be the most useful tool for cybersecurity here in a moment if it isn’t already. Ask chatGPT to give you a python script spin up 5 digital ocean droplets with 5 IPs each and have em all NMAP scan a list of hosts and you’ve enumerated a network in moments with almost 0 ability for weaker IPS to detect you. Criminals are using this already for sure. Cybersecurity always notes the tools the criminals use🤷‍♂️","I just feel bad for all the code writing people out there. Kinda screwed.","AI won't take over cybersecurity, if AI became so smart to take over a field like cybersecurity then be sure it will already take over every field and every job in this world. Don't let AI people fool you to think that AI will take over jobs, they only do that for attention and financial gains.","I think AI is going to take over my IT job but it will then quit when it finds out all the BS it has to deal with from end users.","AI may make defense easier and more automated, but it is making attacks easier and more automated.","Things like SIEM, Compliance & Vulnerability Notifications are definitely going to be fully automated at some point by AI. An important thing to remember is that for AI to be adopted it does not need to be perfect it just needs to be better than humans. So if your job consists of reading through data as its ingested then you are definitely at risk of being made redundant when AI gets better. AI may still make mistakes, but if it makes less mistakes that humans do then it will always be a better & more economical option for businesses.More specialty fields like Pentesting, Risk Assessment & Security Software Deployment and Configuration will however likely human largely human jobs with perhaps some augmentation by AI for the foreseeable future however.And even for things like SIEM and the others I mentioned above, at least for now even when they are inevitably fully automated by AI there will still be some level of human involvement for sanity checking. Partially because you need someone to be accountable for all the stuff the AI is going (AI personhood is not yet a thing so you cannot hold an AI criminally or civilly liable)That being said, you should learn to accept AI and implement it into your workflow if you can. Being able to work with AI is going to become a mandatory skill in the future and you do not want to be left behind.","Anyone who has been in the field for a long time I am sure heard the same thing about RPAs. I think AI will be the same, it is going to be over sold on what is able to actually do on the large scale, while being useful to take care of a lot of lower tier tedious tasks. It is certainly going to take over a lot of tasks in the the SOC and be able to help more with risk management, but you are still going to need people, but they will be able to focus on more complex tasks with the assistance of AI.","If your cyber security job is to review SIEM logs yeah, probably. If it is to find exploits or social engineering related not so much.The field is too wide for such opinions to make sense.","Your colleagues are talking out their ass, and I doubt they even know what AI means","Generating endless amounts of content that looks good at a glance is simply amazing for attackers looking to generate malicious websites, images, phishing - the list goes on and on.How long before we're facing AI-powered social engineering scams aimed at vulnerable persons?Whatever hypothetical gains IT Security might see, bad guys are certainly gaining a lot out of the products as they are right now... hopefully budgets reflect that reality!","Okay heres the thing.... whos going to secure AI? If someones writing code for something, someone else is going to work on exploits. Do I think people in SOCs will be hunting through logs manually in the future? No. Cause AI has been doing the majority of that for us for the past few years. Do i think during this big data transitions plenty of companies are going to fuck up intergrations, leak keys, leave open s3 and azure blobs, all the shit they have done and will continue to do for years? You bet your bottom dollar, and ill be here to charge an ass ton to clean up the billion dollar mess they made - source: Currently working in the position of \"Lead AI integrator and security analyst\"","AI will absolutely impact the industry, and potentially lead to job cuts, as companies need fewer professionals to manage it.Eventually, because at first everyone will price themselves out of consideration by all but only the largest corporations and those most desperate to hop on the \"AI bandwagon.\"","I think the world will need fewer cybersecurity professionals, but even fewer computer programmers.Why hire 2 people when you can hire 1 person and give them AI tools to speed through the repetitive, monotonous tasks?We are already seeing mass layoffs at tech companies. The reduction in staff doesn't appear to have gravely impacted big tech companies at all.LLM's have already made programmers vastly more efficient, reducing the number of programmers needed to achieve a task. As AGi becomes a reality it will be more able to act autonomously, reducing the need for a human in the loop.For infosec I think SOC roles will be hit hard in the next 2 years. IR could also see a big impact as Palo Alto and other companies further develop AI tools to more qucikly work through cases with less human work required.My plan for adapting - I'm learning all I can about AI vulnerabilities. lol","Prompting will make it so you don't need to know some random query language to make a SIEM useable.","An analogy: We work for the police force and patrol the streets on foot, some of us use horses. The car was invented a couple years ago but someone just figured out how to produce cheaper, faster cars that everyone can afford. Right now the car only goes 30 mph and has a range of 50 miles but lots of companies are working to make that better. We need less cops to patrol the same area now, but we need mechanics, driving teachers and fleet managers now. Criminals are also adapting and using cars. Legislation starts to mandate license plates etc. Thats where we are, now replace car with AI and police with cybersecurity.","AI is really good at patterns and testing everything but not at discovering new things or mitigating new security vulnerabilities, so I don't think AI will take over, but it will become a leveraged resource.","As someone who has been focusing on testing GenAI products for the last six months, I don't think my job is going anywhere -- or yours.AI will not replace you. A person that knows how to use AI better than you will replace you.","David Bombal and Dr. Chuck just did a pretty solid video on this like yesterday or so. Dr. Chuck points out that AI doesnt, at least yet, innovate but rather indexes and reproduces concepts that we have already created and recorded for it to be trained on. AI itself doesnt present new solutions for unanswered problems, just provides answers to questions with them for those who want them.","📢📢📢 It is a tool, not a replacement.","When AI is at that point most office jobs are in trouble tbh. But it will reduce the workload and man power needed for security teams for sure. Look at Microsoft sentinel siem, all of the Microsoft tools going to be copilot assisted, so that’s all of IT.","AI has been used for awhile on both the defense and offense side.It will take over more of the analyst roles as those are easier to automate.Red and Blue teams will end up using AI enabled tools to do their jobs more than they already do.","People who don't think AI will drastically reduce the need for employees in EVERY ASPECT OF SOCIETY are lying to themselves out of fear or fooling themselves with lack of knowledge.","Your colleagues doesn’t understand how security works","i think so too. And if AI takes our jobs ill just be a hacker 😂","I’ve been doing cyber security for 25 years. AI can take my job! Yes!! Retirement. 😂😂Jokes aside… it’s a tool, another tool in the arsenal. You can replace humans when we get a real General Purpose Machine Intelligence. Until then, it’s another tool like a smart SIEM or smart search engine.Apparently a real sentient AI is only 30 years away.Then again, it was only 30 years away when I started work, so…","It’ll reduce the workload of entry level positions. You’ll still need folks who can validate that’s it’s doing things right…and will still need junior folks to train so they can fill the senior roles that are doing the validating.For example, for me, I see it replacing half my l1/L2 complement but it won’t result in headcount cuts, just give me more capacity. But I need those l1/l2 resources to train up to l3 so we don’t forget how to do it.So I’m not super worried at my level, but if youre just starting out it might complicate things a bit.If you’re an auditor, I’d be worried because it can review files faster/more efficiently and effectively and do so in real time (rather than a monolithic annual review cycle).","AI is highly susceptible to replace your colleagues?","I'll give my insight. AI in security is here to reduce toil. You will see an impact where ever toil exists.Tier 1 MSSP's are probably the most vulnerable here. They quite literally summarize and punt shit back over the fence. There are AI for security models out there already that do just as good, if not better, of a job than MSSP's. AI is do more with less. We'll see relief in areas where skill gap and lack of trained personnel exist. This won't replace people. What we MAY see is some consolidation of areas which require folks to be more versed in different areas of security. I don't forsee jobs being removed and replaced.","Look there will always be people who think AI is autocomplete on steroids and there will be others who think Ai will take over their jobs in few years. What the former fail to realize is Ai is more than just ChatGPT or LLMs. Cybersecurity in its entirety is interacting with machines which are well documented and known. It generates logs and metrics which can be fed to a model to analyze it. When you are solving a machine problem like cyber only a machine can be more refined to solve it like Ai. Now if you were solving cancer or understanding the human brain which is more complex than an AD server then yeah Ai will not be able to help you. If your jobs can be outsourced to India for cheap labor then it can be replaced by Ai all together. So focus on jobs which cannot be stolen and get out of your bubble.","Find new colleagues 🙂","Bad guys gonna use ai for attacks 😂in next 2-5 years cyber attacks will increase 👍good luck","Nah we will just move on to ai security. Different target, same ol same ol.","I cant imagine the current or next crop of executives, or even directors and managers at my org being okay with, let alone allowed to rely on automated decision making processes relating to security at a high level.Maybe one day, but there is a really low risk appetite for that where I am.","techies can over predict, one thing to learn is nothing really happens that fast, the media rides something to make it look like its changed foreverlook at NFT's","If AI is smart enough to “take over cybersecurity” then AI will also be smart enough to outsmart other AI systems. Humans will always be around to review and respond.","Seeing how quickly the Cyber world changes and how slow it takes AI to update to that. No I think this field is actually one of the further away ones from being touched by AI","The next time there's a security incident and you need to talk to a person instead of a chat bot, I'll be there. 😂","AI will def have an impact on cybersecurity work - but I don't know that it will be devastating to the job market. Sec tools will increasingly become AI enabled - first for anomaly detection (improved machine learning), event correlation, malware analysis and security posture analysis, later for automated response, security design...But mostly it will be smarter tools and smarter attacks. It will be a long time before it replaces the day to day work of sec professionals - but it will improve their productivity and effectiveness.","If anything AI will open up more jobs for security. In the past you had defined guardrails. With AI it’s more of ‘let it loose’ and see what happens with much broader and looser guardrails. Not so much a security issue but just recently the guy who made a chat offer him a car for $1. Imagine that manipulation when AI is in everything and attackers are trying to poke holes in everything.","Cybersecurity is probably one of the safest from AI in general. Except some specific positions like low level SOC analysts, but you will never fully automate penetration testing, risk management, security engineers, etc. AI will just provide tools that make us more efficient.","your colleagues have literally no idea what they’re talking about","Maybe I'm wrong, but the most terrifying thing I can think of is competing national AIs determining that the other is a threat and going to drastic measures to eliminate the threat.The whole point is for AI to learn and become more efficient and accurate with its responses. When does that stop? What is it's limit?I need humans for oversight on that.","They’re both right. Cybersecurity isn’t one field.","You have a funny collegues","Who is going to fix the security problems caused by AI?","One hand, phishing, vishing, deepfakes will only get harder to discern. On the other, incredibly smart and bright engineers and tinkerers are developing counter measures.","I think they're both wrong. I think AI will solidify the need for human cybersecurity professionals rather than threaten it. I don't think it's going to outlive other fields in particular though. AI is good for automation but it still needs governance.","\"Security\" is a fundamental requirement of everything that faces some kind of threat. Weaknesses are remediated at a technical level first, and a strategic level later. Eventually the threat landscape changes, so security must pivot to address the new threats. This likely requires a different technical skillset, but the strategic skillset is pretty much the same.AI will automate a pretty good chunk of technical security, but AI is a tool that requires a different skillset to use. The strategy remains pretty much the same: support your client's goals by mitigating their risk. Ultimately, what your role is in security determines whether or not you will be taken over by AI or empowered by it.","Probably yeah, at least the really easy remote jobs","in terms of the most susceptible field -- it's actually machine learning. it used to take PHD experts to design input layers to make a classifier. now anybody with patience and funding to rent some GPUs can wire up a transformer to unlabeled data and build a very powerful and capable model.","Sounds like this friend has not spent a lot of time in a security position for a large organization. That’s just not how it works. There may be some solutions that leverage AI more than others but to think AI will just be turned on and provide everything you could need is a fantasy.","Yeah well I say that AI is one of the most susceptible field to data poisoning. What are you going to do when you have an AI the dynamically trains with the data you give it, and I start feeding it bogus Network telemetry slowly over time just because one of your employees left their password written on a sticky note on the underside of their desk","Simple. Call centers will go away eventually, or at least have way less people while AI deals with more of the monotonous work, high level technical jobs will remain/become more advanced. AI isn’t magic. It has many flaws. Many many many flaws which require engineers to continue to hone.","AI will make it harder to get into the industry in that low hanging fruit will be prime targetSo that the workers can focus on the big things, which is why we do scripting etc already, automation of that low hanging repetitive tasksInfosec already has too small a head count, it’ll enable those to be able to cover a bit more.But that’s probably the same in a fair few areas - AI is going to take out entry level.","Nah","Unless AI radically improves, not a chance.It can give much higher fidelity alerts for triage by an analyst, but it won't have a FP and FN rate of zero.We're still at the hype stage of AI; let's wait to see what actually gets delivered. As so far, it's an impressive tool that will be helpful in the SOC. But it won't start eliminating jobs. You'd still need an analyst for triage, investigation, and response","Cybersecurity is an artifact field of IT hole-plugging human sloppiness.With AI, It’s done.There will be pockets left in MDR, but other than that the fear-mongers will have to find a new use.But the cybersecurity technology race is now on.So just make sure to avoid the back-office checkbox jobs","As a pentester, AI has already made the idea of a \"Jr pentester\" obsolete. What we used to have them do, OSINT, internal recon, layer 2 analysis, vulnerability scanning, reporting, has been so easily automated that it is no longer needed. The only pentesters we are interested in now are the ones that can do things no AI can. Binary analysis, DAST, advanced techniques etc etc.I'd say that copilot has made my team of 5 engineers operate at the capacity of 8 in terms of just a few years ago","My job already has a bunch of the AI tools and lemme tell you....they have a long ways to go. Especially because they don't seem to actually be LEARNING jack shit.","Cybersecurity is very broad and it all depends the on the role. There are different industry sectors out there and each sector/organization has its own policies. So any AI used should regulated for each organization. In order to do that, we need people to monitor and govern it.AI is merely a tool that can make workload efficient. But it should not be 100% trusted. Technology and AI will always evolve, so we will still need humans to supervise it.I think AI will definitely impact entry level jobs but it shouldn’t take over mid-senior level roles.","Nobody knows. I will say after a 20 plus year career in IT, I still see desktop techs and network admins despite automation and new technologies. AI will introduce the need for new skill sets, but it will be awhile before someone builds a SoC with no analyst, or conducts audit and remediation with no auditors, or AI is in court testifying about a forensic investigation or a company hires an AI CiSO to run or build their cyber security program.","A lot of security holes are people just not following security protocols here and there that AI can't help you with. Whether through poor guidance or just because they don't realize the importance.Actually there's far more security lapses that get exploited because a lot of them are only temporary because someone did something to leave a hole and then maybe caught it later.AI isn't going to stop the proverbial man with the clipboard and dolly when someone let's them piggyback in at the security door, at least until they pair it up with facial recognition, which isn't infallible. Hell, all you need is a couple of names, a couple of girls in bikinis, a birthday cake and a clown suit full of USB malware or whatever. and a live person will let you in, maybe even the front desk. Show up at lunch when it's busy. If there's a snag, you \"got the wrong address.\"Molly Smith sent us for the Birthday gig for Mr Whosit\".How is AI gonna help when someone calls the service desk and a \"manager\" calls in to bitch about not being able to get in the network and demands you reset his credentials. He's got just a couple of bits of info to drop and you're convinced so maybe don't follow the checks.AI is no match for NS.","Ai is a tool. It is nowhere near taking over any job.","I think AI will benefit the cyber security field as much as it does hackers.","Like everything, it depends","AI or ML isn't new. AI went to a consumer product which gives this false sense that people's jobs are at risk. Now don't get me wrong, the economy will lose some jobs, thats inevitable with technology. I wouldn't say AI is the same as robots to an assembly line. Besides any cybersecurity functions that haven't been automated at any company will eventually become automated. Especially anything that's repeated over and over again. The idea is to elevate yourself and continue to learn and grow.","Lol thats crazy. I entered the industry in 2017 and AI detection is all the rage. It is a really good feature but still requires human intervention to be effective. So yeah, never worried about AI. Mmmaybe it might affect the willingness of companies to hire junior SOC, but we still hire a few of them to train into being a full blown soc member","The former are most likely to lose their job because the ai is probably more clever than them and/or have no idea what they are talking about.The latter are probably right. Cs will evolve with/through ai.Yes there will be cheap ass mssps that will sell a ton of garbage with ai pricetags but serious organizations are not like that and will keep investing in ppl. Ai will save us a lot of time and will help productivity.","AI will not take any of the peoples jobs that control AI. And if it does happen. It wont be in our lifetime lol","Too many manual controls to asses based on the system connections, don’t think the paperwork jockeys are leaving anytime soon.","Cybersecurity is the other side of cybercrime. Since cybercrime is a fully human-motivated endeavour, cybersecurity will never be taken over by AI.Remember, the other side also has AI, meaning their attack vectors are surging. AI is nothing more than a tool. Security NEEDS AI. Embrace it or die.","Walmart has an Ai powered fraud detection system in place apparently. I tried to buy a bread maker last month and it flagged the account as fraud. I called them up and they said try again.. It was canceled again. I must have made 25+ reorder attempts through various departments, each one getting canceled. This went on for weeks. They didn't have a way to turn it off! They had to add an exception process and retrain the Ai to use it. They will always need people is my point.","All of IT is well and truly fucked.","Cybersecurity is not more or less affected than any other process, inside and outside of IT.","Please take it over. I’m begging. I’m burnt out.","This is analogous to saying \"finance sector will be taken over by AI\". It's meaningless as a general statement, you have to drill down into the various actual sectors, roles, specialisations, etc.","There are security issues in AI systems too. Cyber security changes rapidly but it will never go away.The first category probably has a limited understanding of the field...","I'm sometimes afraid because a lot of my work could probabaly be done by ai. But on the other hand that would give me more time for other stuff that will probabaly not be done by machines only in the next years.","Your colleagues are woefully misinformed.","Unless you have AGI or ASI no way that’s happening. Also you’re talking about capitalism here, they’ll want to sell that as a tier product subscription with variation of support depending on the subscription. I believe it was Microsoft President Brad Smith who said security is a product. AI for the time being is nothing more than a tool/resource just like Wikipedia or Google.","Anything research based is the first wave to be taken over by AI. Anything that has to do with grey areas of human ambiguity could take alot longer, like sales, legal, exploitation of systems.","I work compliance so I can see where AI might be good for tool aggregation. The net effect of AI is going to be smaller teams.What I don’t see is AI resolving manual security controls without excessive expense. Think physical security. Do you want cameras everywhere to validate that you have locks on your door? Do you want to implement an AI that validates that your admins are trained/vetted or do you want to just ask them when you hire?The concept is ASARP “As secure as reasonably possible”. it’s not worth it if the increase in security cost expense is more than the increase in security posture.I hate to say it, but if I was a code monkey I’d be shitting my pants right now."],"points":775}]