[{"text":["Did Ilya see AGI? Sam Altman denies his chief scientist saw super-AI"],"points":0},{"text":["Who Trolled Amber? review: Relentless dig beneath Johnny Depp vs Amber Heard libel case makes a staggering revelation","Article doesn’t give an answer. Saved you a click.","This absolutely does not belong in this sub.","my essays sound like this article when i haven't read the book either","“Article” is nothing but an ad for the podcast.","Garbage article, also totally doesn't belong in this sub.And the answer, which they don't give, is people either watched the trial, saw clips from the trial, or heard from others who had and found out what a horrible narcissistic abuser she was hence the internet turned against her. There was no secret conspiracy over it.","The propaganda campaign against her during the trial was more massive than anything I’ve ever seen. Reddit was flooded with posts targeting her for a few weeks. It was really disturbing how so many Redditors ate it up and somehow didn’t notice the campaign going on. The only thing comparable would be the massive amount of posts from the beginning of the war in Ukraine. They had a social media and information warfare organization that was supposedly bigger than even Russia’s and the smear campaign on Heard was still several times bigger. It’s fucking scary that a private citizen can do such a massive thing while being only a little wealthy. It’s terrifying to think what a billionaire or government could do.","AI generated summary of the article:The podcast \"Who Trolled Amber?\" by Alexi Mostrous, produced by Tortoise Media, delves into the Depp vs. Heard libel case of 2022, exploring the suspicion that the online interest in the case was manipulated. Mostrous investigates the influence of bots on public opinion, highlighting the impact of social media on society and the ease with which misinformation can be spread. The podcast reveals the complexities of the case, emphasizing the blurred lines between truth and manipulation in the digital age, ultimately raising awareness about the power of external influences on public perception","My main issue with this trial isn't this stuff.It's how it's generally used now whenever a woman makes an accusation.And why are people still talking about this almost 2 years after it's done?","Impresive you say? Are you an employee?"],"points":77},{"text":["After TikTok, EU to scrutinise US-based social media apps for data privacy, safeguards against AI","Sure, fuck 'em all.","It'd be pretty hilarious if the EU starts forcing US tech giants to sell their European operations.","Are they gonna scrutinize TikTok too or are they just targeting only US companies again?"],"points":30},{"text":["Mayorkas touts 'enormous opportunities' with AI as DHS launches new pilot programs"],"points":0},{"text":["US Weighs Sanctioning Huawei’s Secretive Chinese Chip Network"],"points":0},{"text":["Chinese and western scientists identify ‘red lines’ on AI risks | Top experts warn existential threat from AI requires collaboration akin to cold war efforts to avoid nuclear war","SHALL WE PLAY A GAME?","This is fking stupid.stop centralizing everything onto cloud, and not every appliance needs to be \"smart\"Bam, AI power neutered.A hostile AI take over that can only control the front door from opening is a hell lot less risky than a AI that can take over fking fleet of cars on the street.","That's not going to happen."],"points":2},{"text":["Nvidia AI nurses could cost hospitals $9 an hour | Hippocratic promotes how it can undercut real human nurses, who can cost $90 an hour, with its cheap AI agents that offer medical advice to patients over video calls in real-time","How bout an AI social security tax?Just came up with that!Would you vote for me?","While it's true that AI could potentially replace some tasks performed by nurses, nursing is a regulated profession that requires a license. As such, it's unlikely that AI would significantly reduce the salaries of nurses.","Imagine if self-checkouts were responsible for your health.","Lmao, this is so insane. I am half convinced tech bros finally lost their minds permenantly.Sure, put postop patianet in contanct with hallucinating chatbot, what could go wrong. It's not like anybody could die if god damn if-else program starts making shit up out of the blue.Actually, if-else would be way more relient and way less insane by definition. This literally borders on parody. April first is early this year it looks like.","But what will it cost the patient? The amount of money that tech companies are pouring into AI development, research (and competition) is extreme money. Eventually they'll want it back and it won't be $9.00 an hour.Then there's the side effect (aka enshitiffication) once there's any dependence on the AI, plus how it will likely cascade to affect the whole health nursing infrastructure.And where will they scrape the data for this medical advice? Who will check and double check that it's accurate?Like anything else, knowledge isn't static, it evolves.","I’m sure they pass the savings onto the patient… right?","Yah right, How the fuck is an ai supposed to do all the work a nurse does.","AI assisting nurses and doctors would be a good thing; medical personnel are overworked as it is, anything to ease the burden would be a plus for everyone. AI replacing them however, is not good.","Nursing is more than just technical know-how. It is technical know-how in a context of interpersonal interaction facilitated by a caring human who is trained and experienced in exercising bedside manner.","Lol. So stupid.","Because when you're sick there's nothing like the tender touch of a cold hard computer screen. Actually AI has huge potential to assist staff in healthcare situations but for the love of all things good, please not instead of a human.","patient having cardiac arrestNurse Ai: Are you in need of assist- hacker takes over systempatient diesSince these AI systems have access to patient records . Hackers will know where to go to get information. You can give me some spiel about how Ai will have encrypted records bullshit. If companies can’t even safeguard Chat GPT conversations how the hell are they going to protect an Ai and the medical records it has on people.","I think nurses using AI and paying them more should be the solution","Would the informational content of these AI nurses be equivalent to googling how to take a certain medication or how to deal with side effects, etc? I assume the accuracy of these ai models are dependent on the ability of the user to ask the right questions. And if the ai models give bad, harmful advice, who takes responsibility?Ai nurses feel like a gimmick to me. Creating a knowledge base filled with faq’s that patients have access too seems like an easier and cheaper way to give patients access to basic information. Is there a benefit to ai nurses im overlooking?","Can AI show empathy?","A nurse doesn’t just provide advice lol. There is a lack of nurses in the field so that’s why they are trying to limit a certain interactions. For instance a nurse doesn’t need to be called so that the bed can be adjusted.","Oh shut the fuck up. I have no doubt companies will replace nursing labor with this trash, but it's not gonna be pretty","How is AI gonna wipe ass?","Do these \"cheap AI agents\" have medical licences?","AI is going to decimate the world economy in very short order.","This will never stick with most people. When we're sick we want human interaction and care.","Framing this as a cost is poor illustration on how this can really benefit the Healthcare system. AI won't take away the need for MRI's, blood work, or lab testing, but will offer answers to questions and care that doctors and nurses don't really need to spend more time doing. There will still be a strong need for nurses to take care of folks who are sick, post surgery, etc.","90/hr as a nurse? Where do I sign up? That seems like a crazy high salary estimate to me.","Doubt this would work","Does it write prescriptions is the question 😂","It will not mean lower health care costs. Absolutely, they will not pass the savings to consumers but just bag more profits.","And I bet it would actually work fine most of the time.That other 10% of the time though...","It might hurt telehealth nursing but AI will have zero impact on regular bedside nursing. AI isn't going to be passing meds, changing the brief on a patient, or assessing patients.","And there it is.","You think you have job security, guess again.","Um why don't I just ask ChatGPT if it's that fuckin easy","You could just automate it with voice mail.They all give the same advice, \"You better go to urgent care.\"","I was in the hospital recently to have a penis reduction and to be honest, most of the time, the nurse just came into my room to give me pain meds and asked if I needed anything. A little robot could have done the job.","Any non bedside nurse is replaceable with Ai because they always default to see your doctor. Legally, the physicians have larger liability policies for medical malpractice issues."],"points":453},{"text":["Artificial intelligence detects heart defects in newborns | Researchers from ETH Zurich and KUNO Klinik St. Hedwig in Regensburg have developed an algorithm that provides an automatic and reliable method of detecting a certain heart defect in newborns","What's the point of detecting it in newborns? Design a model that detects heart defects in fetuses so that parents don't have to spend hundreds of thousands on a baby with a severe birth defect."],"points":1},{"text":["Airbus CEO says Boeing's problems are bad for whole industry","To paraphrase: you guys f***ed up really bad","Reminds me of beach tourists plummeting from the Jaws movie","He is right because there will be extra scrutiny all across the board and only a matter of time till the corners Airbus cuts are turned up as well.","Because ppl being afraid to fly is bad for them as well","It would be terrible if we had to collude and buy you out","industry of 2.... Boing and Airbus... how convinient","Afaik Airbus has “some” fiduciary duties like not bleed an insane amount of cash by churning out endless A380s, but at the same time I have more respect for them because, as a joint EU venture, their goals are more so oriented towards accelerating the aviation industry and building good aircraft, ie the old “Engineering club” that Boeing used to have.","When you see your neighbor’s beard being cut, start soaking yours","I’m sure the executives are busy wiping their tears away with the billions from all the new orders, reduced ability from airlines to bargain and customer preference to fly Airbus!Increased regulator scrutiny had to happen, shame it took so many preventable deaths.","New if I fly im looking based on plane type.","It’s almost as if regulation is actually much better for business and economic success. And businessmen lobbying for immediate profits then booking it before it all comes crashing down is really bad for the economy.","Of course, but that's what happens when companies decide to put profit over everything else. Airbus is right -- if Boeing is doing it, who else is that we don't know about yet.","I wouldn’t be thrilled to be flying anywhere right now, I can tell you that.","Only if you try and cut safety corners to boost profits (bonuses) to overpaid Boeing execs...👍Build a reliable, efficient, aircraft that doesn’t start to fall apart mid-flight like Airbus and you’re good.","I ain’t getting on no Boeing plane any time soon…","If it's Boeing I ain't going","You know what doesn't have doors that blow off at 30,000 feet? Trains. Fast trains.","That’s why he’s smiling so much in the pic.","But Boeing just normalised murder. Surely they would be happy with that.","Oh, now it's a \"we\" problem?","It is also bad because Airbus might not resist cutting corners to produce more aircraft. And then turn into Boeing in a decade as well.","He says that while smiling","More like if i can tank all the airline stock ours won’t look so bad by comparison","Translation: “Were doing the same shit we just aint been caught yet”","I kept thinking why is Airbnb CEO talking about Boeing ...","Is that a joke about how the rest of the industry is him?"],"points":786},{"text":["Rocket launch marks big step in building China’s lunar infrastructure","SpaceX launches it's satellites and military on a weekly basis. China does what?"],"points":6},{"text":["“Disabling cyberattacks” are hitting critical US water systems, White House warns | Biden administration rallies nation's governors to security facilities in their states.","Umm this may be a dumb question but uh have we thought about maybe not having critical infrastructure connected to the Internet at all?Because I mean that seems like the easiest solution.","Russia is behind a lot of these attacks. We need to fund Ukraine to hurt Russia.","Russia has been doing this for years.","Yeah seems like we’re asking for it lacking very basic security measures","As long as the Brawndo keeps flowing we’re ok.","I wonder if this in any way involved with the big hack into multiple systems we blamed on the Russians around lockdown year. It says Chinese, but the one that’s in several critical systems sounds like the attack we found out about 3 or 4 years ago, but 1-2 years sounds too long for an attack to be undiscovered"],"points":124},{"text":["Musk Says His Ketamine Prescription Is in Investors’ Best Interests","Lmao, this is why the onion went out of business","Ketamine is a legit prescription for treatment-resistant depression. And it works quite well.They don’t typically prescribe it to be snorted in piles off your desk at Twitter while you’re shitposting though.","How the fuck does this guy have a security clearance","Elon currently has a video about the Great Replacement conspiracy pinned to the top of his Twitter so I'm not so sure of that.","So Elon snorting ket is in investors' best interests but not him going to therapy and trying to get his head fixed if that’s even possible","Hey, remember when everyone thought this guy was really smart? It's so nice of him to ensure everyone knows that he's just another clueless and ignorant rich guy.","Therapeutic uses of Ketamine aside, I think it’s dangerous giving mind-altering substances to someone with a superiority complex.","[deleted]","I've been taking ketamine for ptsd. It literally saved my life.It is an amazing medication. My provider says it is a reboot of the brain. It's a pretty good description. I find that immediately following my perception of things has changed. In my technology career, I had many \"ahha\" moments they all came while they were taking a shower. Ketamine is like a 48-hour shower full of those moments.","Government Contractor does hard drugs, news at 11…","Sounds exactly like something a drug addict would say.","Bro said I do drugs for you 💀","It's been a while since I heard something more deserving of this.Fortunately the article is gated to prevent me wasting more time with it.","elon musks ketamine prescription has nothing to do with technology","I hate Elon, but seeking mental health care would generally be in investors best interest. Thats probably not what he's actually doing though.","When poor people take Ketamine they're \"addicts\".When rich people take PERSCRIBED(?!) Ketamine, they are increasing the value of their stock.Fuck Musk and fuck this capitalistic nightmare.","How much is he taking, and how often?","Oh no, how dare he get treatment for his depression?We get it, Elon sucks. This ain’t it though.","Ket won't do anything for him if he doesn't also talk to a psychiatric or therapist to help restructure his thinking, with constant twitter he might even get worse.","I’m no fan of Elon by any stretch, but who gives a fuck if he takes ketamine. He’s prescribed it by a doctor, and his private medical affairs are nobody else’s business. It is a legitimate treatment option for patients with drug resistant depression, and even if it weren’t, people are not owed answers just because they ask questions. This media cycle is fucking stupid, and Don Lemmon deserved to have his show canceled for being so stupid.","I'm all for psychedelic therapy, but guys like Musk and Rogan aren't helping the case for it.","if youve ever done ketamine as a functional stable responsible adult you ll know hes right. its safe, the effect doesnt last long and you have a cool experience/go on a bit of a ride for a second. id say its a lot like going for a rollercoaster ride combined with the feeling of being away on vacation and depending on the dosage you get more of either. dont really understand why people have a problem with it other than the usual elon hate reddit bandwagon.","\"It's better for everyone if I'm on drugs\" is certainly a take.","I’d be a workaholic too if I got to be high the whole time","Dude could do with an ego death experience in a K hole that’s for sure.","I wish I could afford ketamine. It was the only thing that worked for me… must really suck to be that rich and selfish.","Delusional CEOs and ketamine, name a more perfect pair.","That explains so much...","Elon is Heading into Howard Hughes territory folks.","He needs to take baths more often.","I don't like musk, but medicinal ketamine shouldn't be stigmatized just because we all hate this guy.","Oh but when I do it it’s a “problem” and it’s “scaring the kids so we’re leaving”I guess I gotta start a company","prime /r/technology content here","Investors must be really dumb to give money to this drug addict com artist","So this fucken immigrant from another country comes influences politics and business and gets to do any drug he likes crazy if your rich you can literally do anything wtf","Prescription medication is not illegal","I think he should quadruple his dosage. Minimum.","It’s flabbergasting that people still enable this person.","I'm having a great time letting this guy show us how stupid he is","it's fine, try to chillout in a hot tub after you took it","Ironically that’s exactly like how my Wall Street friends say cocaine interest of firms because they pump cocaine up and shit everything.like pumping stocks and dumping it when you cash out","It is if he dies from it. Maybe Tesla will get run by someone competent.","Never ceases to amaze me how early on this guy had every opportunity to be likable and even respected. He threw it all in the shitter.","My “My ketamine addiction is healthy for me” t-shirt has people asking a lot of questions already answered by my shirt","yes if we are shorting tesla stocks. keep it up elon","Maybe they know he has a hot tub.","Whatever you say bro, lmao.","Time to get rid of this liar","Dude’s crazy","Lololololololol","Does Elon know how insane that is to say? Is Elon even stentient?","Also, there’s ketamine treatment you can get in a clinic w supervision, but I’ve never heard of a ketamine rx? I guess yiu can always find a dr who will prescribe anything, but has anyone ever heard of a ketamine rx? Except in the tiniest doses for medication resistant depression or ptsd??",""],"points":6602},{"text":["Nvidia’s latest AI chip will cost more than $30,000, CEO says","When there’s a gold rush, sell the shovels.It is expensive from consumer’s perspective, but these sorts of prices aren’t exactly unheard of for B2B and specialized applications.","These 1000s of black leather jackets ain’t cheap folks.","That's like 15 RTX 4090s","Good for him!","Keep in mind these chips are made up of 8-16 GPU's multiple CPU a lot of network chips and a dozen of NvLinks which are hyper fast data transfer hardware.So one machine is a collection of a lot of individual components design to work very effectively together.Still pricey but not as unreasonable as it sounds.","A market they control enough of to be able to manipulate the price point to anything they want. Not saying he is doing this. Just saying that Intel spent that much developing some of their future gen chips, and they still managed to sell most of them for less than 30k a piece.The demand is here. Nvidia is by far the most capable supplier. He can set the price anywhere he wants. This is how Kings are made and why monopolies (in theory) are illegal in our country.The reality is that all of capitalism supports things like this happening, as long as the generational wealth can control the new money","Google msft and Amazon are each buying thousands of cards also.","Unless CUDA could work for other chips, Nvidia will be in the dominant position for years to come","They glued a bunch of existing cores together. So it's expected they'll charge for each one.","FFS do we need 30 Nvidia stories on the front page that all seem to be corporate marketing and promotion…","What's with all the leather jacket comments? What tf has it to do with anything what jacket he wears?","I broke a couple $3k circuit boards during development at my job. I can't imagine potentially breaking a $30k board. How does this economy even work when a person can cost their company a few months of sales with one oops.","He said the first one cost $20 billion.","You don't even need to have an application for these yourself. Just buy it and rent GPU time to researchers and people that want to finetune open models. Money printing machines.","Didn't they all just buy or are in the process of getting H100 chips? Why would they buy more when they haven't really started making money on the chips they have.","Ignoring R&D, I wonder what’s the variable cost of producing one more chip. Is this thing like a 99% profit margin? Such margins must be screaming out to potential competitors to try to get a piece of this action.","And you’ll pay it too","30k capex is nothing","That's still cheaper than real intelligence.","Stock moons to $30,000","It's the leather jacket isn't it? Do I need to get one?","Nothing new. Life is just for the rich and privileged few , good for them. I'll be getting the cheapest direct cremation service pls , ty uncle Sam ☠️","Things normal people dont care about","Whenever I see ai in the name of something I automatically assume its some bullshit.Can anyone who knows what they're talking about tell me if this is some bullshit not worth reading about before I waste my time?","Oh good, I can't afford one. Neat!"],"points":701},{"text":["Meta just showed off Threads’ fediverse integration for the very first time","threads fediverse integration this translates to nothing in my brain","Facebook et al. is a cancer and it is metastasizing.Every time privacy conscious people try to get away from surveillance capitalism, it comes knocking; upset that one of us had a bowel movement that wasn't properly monetized.","Ah, we’ve gotten to “embrace”, let’s see what happens for “extend”."],"points":53},{"text":["Elon Musk’s X bans transgender Harvard lawyer for naming a neo-Nazi","\"We Delete Things if They Are Illegal\" - Elon Musk (March 18, 2024)Wow, so that didn't take long.https://www.hollywoodreporter.com/news/general-news/elon-musk-don-lemon-interview-1235855015/","im really bored of hearing about elon musk","I thought they only banned and censored illegal stuff?","Elon really does not understand \"free speech absolutist\" does he?","Also worth noting that Elon does not ban people who dox trans people. In fact, he recently followed one such dirtbag who has ties to the violent neo-nazi group Atomwaffen.","Tell me more of this bluesky...","Muskrat has the freedom to do whatever he wants and he chooses to be a whiney little bitch. Such a loser.","Elon musk. 🗑️ that’s a garbage can.","Elon Musk is acting like a Reddit moderator","She doxed them. Idk if that's what \"naming\" means, but posting someone's full name, address, etc is against twitter TOS","I'm the interview with Don Lemon he said he would only delete illegal posts, and seemed unable to comprehend Don's questions about legal but inappropriate posts. Elon said he would never censor legal posts, no matter how abhorrent.And ... here we are","Just leave this goddamn website, folks...","For those who didn't read the article: doxxing, at least as this person did it, is explicitly allowed under Twitter's community guidelines (however shady THAT may be), and this is clearly a political ban.X’s private information policy explicitly states that mentioning someone’s name is considered publicly available information and does not violate its guidelines.Edit, for those who ALSO didn't read the community guidelines in question, this is explicitly allowed. They just don't call it doxxing like we all are.What is not a violation of this policy?The following are not in violation of this policy:sharing information that we don’t consider to be private, including:name;","Who tf is left on that shithole of a platform anyway?","Stop using Twitter. Fuck this guy.","You'll notice they don't actually post what she and these others said, they only post other people's characterizations of the ban.Smells fishy.","Employees of twitter. What are you guys doing there working for a guy like him?","To be fair, I mean, the newspaper/journalist who wrote the article isn't using the person's name, because it's not been independently verified. And if you publish someone's name claiming they're a nazi in a news paper/public space, I'd imagine it'd be not entirely 'right', even if it were somehow legal -- I'd guess that'd be defamation, no?So if the left-leaning news mag won't dox the person, why are they advocating for individuals to be able to dox the person on X? It's not supposed to be 'done' by professionals, whether you're a journalist, or a member of a professional designation/body. Things like accounting designation ethical clauses would frown strongly on \"Spreading a person's name in a campaign to ruin their reputation and livelihood based on hearsay and rumors\", cause, it's unethical. So why would this lawyer get a pass?And if we're wanting to dox people online, and call for punishment/repercussions against people we disagree with politically... ok... but that platforms owned by a guy that seems to generally disagree with the left. So, if the left thinks its cool to try and deplatform/silence/isolate people they disagree with (ex. by doxing them/getting them fired etc).... why shouldn't the right do the same, on platforms they control?","It’s doxxing. Your identity politics shouldn’t protect you. One rule for all. Elon’s less crazy ban.","Goddamn, it's impressive how much bad faith can squeeze into a single headline. They were banned because they doxxed someone. Extremely common reason to get banned on any platform.","She doxxed someone.","STOP. USING. TWITTER.","Title misleading. Should be Transgender activist/lawyer doxxed a neo-Nazi online and was banned for doxxing. Not hard to understand people. Doxxing is bad.Edit: Be careful of what you wish for people. If a trans person is allowed to dox people. It’ll be just as bad when a neo-Nazi doxes people. You want it to be fair both ways, not one way because it’s convenient for you.","Doxxing is good now?","Elon is becoming like a shit version of Lex Luthor. 1/1 millionth the intelligence, racist, sexist and just fucking weird as fuck.","So, to be clear, she doxxed an alleged neo-Nazi, which is a violation of Twitter ToS, and got banned for it.No story here. Move along.","It’s his site - he does what he wants. Not happy go elsewhere. Simple.","I'm honestly surprised, it's usually chris that posts this kind of garbage.The brain washing in these comments is insane, the community guidelines are clearly against this and that is why she was banned.","This headline makes me angry!","Reddit deletes doxxing too - there's no guarantee they even have the right person.Remember the Boston bomber, we did it Reddit?","Im sure theres not anything else to this headline...","Doxxing someone because you disagree with there views. Got them banned.","She incited violence.“The 6 justices that overturned Roe should never know peace again. It is our civic duty to accost them every time they are in public. They are pariahs. Since women don’t have their rights, these justices should never have a peaceful moment in public again”Alejandra Caraballo","Look at me im doxxing then complaining.","It’s funny how the article states, “The Advocate is not naming the individual due to the lack of independent verification of his identity.” And then they post the TwHitler pic where her name is outing him.Aside from being on her side, I do think she violated their business policy.","When will people realize that they aren’t on Twitter anymore","Truth doesn’t even matter anymore. The amount of people cherry-picking the TOS to make it seem like she didn’t dox him is ridiculous.Is Stonetoss 100% for sure Hans? Is Stonetoss 100% without a doubt a true nazi? Because you can make offensive comics and not be a nazi. You can make them because you just don’t give a fuck.If he is a nazi, then fuck him. But just because someone is a piece of shit doesn’t mean the rules don’t apply both ways.","you mean doxxing?","Why does someone being trans matter. All these fucking stupid labels. who cares. its like people are trying to be interesting or liked more by applying various labels. This society needs a reboot. ww3 when","Why do we care what elon musk bans or not? This is /r/technology not politics.","Twitter is just truth social in fancy clothes. Move on everyone.","Guess Musk wanted censorship so badly he could taste it.","You can't doxx people. It's illegal.","“Free speech absolutist”","God this sounds ridiculous. Correct headline: Far-left extremist banned on X for doxxing a satire cartoonist.","So she doxxed someone for making edgy webcomics and is now butthurt that she got booted for doxxing because it breaks ToS regardless of whether or not they deserve it?","“Freedom of speech” annoying who bought that, still buys it, still believes it is an idiot.","Something something free speech","I like how the Advocate won’t use the guy’s name, but they include it in the embedded screen shots.","That dude sucks","It’s so fucking easy. Stop using twitter!! Delete it and don’t look back.","Are you getting tired of all this free speech you’re getting?","Is it an actual neo nazi or just someone she wishes to slander and dox ? Might just be a guy who likes to speak German.","lol this qualifies as news? How about all the times people get unfairly banned by reddit admins.","Doxing is illegal.","So many leftists malding that they aren't allowed to doxx people with impunity anymore.","is anyone surprised?","I guess don't fuck with his friends.Freedom to shut the f up if I don't like what you say.","This headline looks fake…just ….look….at….it","Somebody who wears a \"Protect Trans Kids.\" and doxxes people online in the hope they experience violence should be locked up.","Didn't she dox them?","So many crybabys in this thread, Doxing is illegal.","If you are still on that asshole's platform, I have no sympathy for you.","Freedom of speech as long as the imbecile agrees with it!","Fragile megalomaniac.","He owns the company, so I guess he can do whatever he wants.","Elon Musk loves actual Nazis because he benefitted from apartheid. He's on their side, the side of racism.","Oh, I know that human…","I think it’s rude to call Musk that","I say let's ban X, and leave them hating each other","What, they named Elon Musk?","That's weird I see anti right wing hate so much on X, I said Communism should be eradicated and was banned for life.","Stone Toss is a neo Nazi?!? LOL","FrEe SpEeCh","People have always hated Twitter banning some folks and not others. Nothings changed at least, in that respect.","Elon looks like he just finished his shift at the mines in Mongolia and is ready for a cigarette","Can you feel the freedom tonight 🎶","Go fuck yourself Elmo.","In other news, 1+1=2.","I got off Twitter the day he bought it.","So does Musk just sit at home high on ketamine and personally police Twitter? That’s the impression I get","Mental illness",""],"points":4071},{"text":["Users ditch Glassdoor, stunned by site adding real names without consent","Just deleted my account, only for Glassdoor to (mistakenly?) send me two emails about submitting content that violates their community guidelines.I haven't submitted any content in well over a year...","A company I used to work for would ask Glassdoor to remove bad reviews, and THEY WOULD DO IT. WITHOUT HESITATION. No request in. Nothing. Just a \"hey can you remove this?\" email and it was gone.Ever since, I've boycotted and refuse to trust anything related to the company. Not even their job listings.","HR departments from all over even as we speak are scanning company reports looking for the malcontents and the disgruntled, lol.","When I try to open Glassdoor it won't let me continue or look at anything without filling out the whole form about my current employment status, employer, etc.I thought we used to be able to look at reviews at least.","Turns out the real glass door is between the public and your personal information.","Thankfully I signed up under the CEOs name","I am old enough to remember the mantra:Never use your real name on-lineTime for that to make a comeback.Also, fuck corporates who know the cost/profit of everything, and the value of nothing.","To be clear, they are not showing the names publicly, only storing them in your profile, your comments on companies can still be anonymous.It's still bad though, they don't your real name to operate. In some countries it's even illegal, such as Glassdoor operating in Australia.Australian privacy law requires companies to allow anonymous or use of psuedonyms.They are in clear violation of this.https://www.oaic.gov.au/privacy/australian-privacy-principles/australian-privacy-principles-guidelines/chapter-2-app-2-anonymity-and-pseudonymityAnd other law that requires they keep their information up to date ( as in no wrong info ) which they also apparently failed to do when they auto linked other users information.","Shoot -- I purposefully used separate burner accounts for each of my Glassdoor reviews.","I am more than happy to have my full name live next to my scathing review of Regal Cinemas after 17 years of employment with them. Fuck them, from me with love, bitches.","Here is the form to request deletion of your info on Glassdoor and Fishbowl. Simply deactivating your account on your own doesn’t seem to do this.","Just deleted my account. Wow!","Bye FeliciaJust sent my delete request and confirmed“Thank you for verifying your email address. We will now begin to process your personal data request and send you another email with an update on your request in the next 30 days.”Oh and now:Oops, there's an issue with your submission. Below is information about the issue and how you can fix it.Thank you for contributing to the Glassdoor community.Our moderators evaluate each review to determine whether it complies with our Community Guidelines. We determined your review does not meet these guidelines. If you wish, you are welcome to edit your review here and your edited review will be reevaluated within 24 hours of receipt. If you would like more information about our Guidelines or how we assess content, please visit our Help Center for further background and insight.Kind Regards, Glassdoor","You can't trust Glassdoor anyway. A place where I used to work had a grad scheme, a \"requirement\" to pass was a 5 star review on Glassdoor praising the company.","Wow way to murder your entire business model","Ugh that website is a mess. I hadn’t checked on Glassdoor for years. It doesn’t let you see any of the features on the site without creating an account, entering your profession information and submitting a review or salary. You can’t participate without giving them your information.","Wtf were they thinking?","I just checked and my review of a terrible old employer got deleted. I kind of suspect Glassdoor has a way for companies to pay and choose what is deleted. Like Yelp, Amazon, Google Reviews….i don’t trust any reviews anymore because of shady practices.","Just went and deleted my one and only “contribution”, that was a positive one at that. Then deleted my account.","I got a new job recently and wanted to check out Glassdoor because the was a corporate office and I assumed would definitely be on there. Well it was, and it asked me to log in with my work email. I was already sketched out by the concept of that, but I understood. Decided against making the account.Glad I read this. I’ll never be back lol.","This is the equivalent of onlyfans blocking porn","Wow that’s fucked up","Holy shit I know some folks this could potentially really fuck up…","\"Since we require all users to have their names on their profiles, we will need to update your profile to reflect this,\" one Glassdoor employee wrote while reassuring her that \"your anonymity will still be protected.\"So they aren’t adding your name to your feedbacks. It’s the fear that there might be a bug or issue later that exposes your real info.Not great. But not as bad as headline implied.","Cool. Just deleted the entire account.","Deleted my account. Fuck them for trying to associate my name with posts.","Wasn't the whole reason for the site to obfuscate peoples real identities?","Deleted my account ✌️","The salaries they have listed for my line of work are about half of what they are in reality.  Levels.fyi and blind ftw","I'm so glad I gave them a fake name","Fuck Glassdoor they wouldn't let me even submit a comment in the past in another language other than English","Bye motherfuckers! Deleted acct!","That site has been going downhill for a very long time. They work for the employers now not the employees/ possible employees","Maybe the real glass was the doors we made along the way.","This is what happens when a wanker from finance becomes head of a team that actually matters.","Why should they wait for hackers to steal all their data on you and then post it for everyone to see when they can do it themselves and cut out the middleman?","Sensationalist headline. Important info buried on the article:In the meantime, her name remained on her profile, where it wasn't publicly available to employers but it could be used to link her to job reviews if Glassdoor introduced a bug in an update or data was ever breached, she feared.Still no great, but no ones real name is actively available, it’s just a risk that if Glassdoor have a security breach or change their policies in the future, then real names could be exposed",""],"points":15040},{"text":["Nvidia's Jensen Huang says AI hallucinations are solvable, artificial general intelligence is 5 years away | TechCrunch","\"CEO of company selling shovels during gold rush says that there's an even bigger gold rush coming: 'stock up on shovels!' he says.\"","Just imagine, in 5 years we’ll have full self driving, nuclear fusion and artificial general intelligence.","This dude’s been saying all kinds of shit lately","“If we specified AGI to be something very specific, a set of tests where a software program can do very well — or maybe 8% better than most people — I believe we will get there within 5 years,” Huang explains. He suggests that the tests could be a legal bar exam, logic tests, economic tests or perhaps the ability to pass a pre-med exam. That's a pretty low fucking bar for AGI. In fact, I'd argue that's not AGI at all. Standardized tests can't measure AGI because they're regurgitation tasks. Likewise, tests on a ery specific domain of knowledge obviously aren't generalized.","Does that mean that AI can take over the role of a CEO?","Is this before or after self sustaining nuclear fusion? And room temperature super conductors?","My recent experience with ChatGPTBob Dylan is a famous Canadian-born singer.Sydney is the capital of Australia.The American Revolutionary War was a territorial dispute.Besides writing limericks, I wouldn't trust any answer until the tech vastly improves.","Pfff... Free advertising for NVIDIA. Good job young man...","What if they aren't hallucinating?","Will software become that much more advanced in 5 years? I can't imagine it's just a matter of once hardware is powerful enough the magic will happen.","Nvidia found themselves in a luck position and he’s just trying to keep the hype going as long as he can. Nvidia sells boards that were originally designed for computer graphics, but they’re also just happen to be useful for AI inference. As big companies shift to using custom boards developed in-house (that they have full control over and don’t have to pay a markup on), I have a feeling Nvidia is going to be in for a big wake-up call","Very possible their team does achieve this. It doesn’t mean we will see it right away in society. They could sit on it for a couple years. The thing is if it’s true agi it will have no filters during its use. If they plug it with filters of the sort to limit its capabilities, then it’s basically another chatbot to common society."],"points":248},{"text":["Elon Musk says AI could be smarter than all of humanity in 5 years. Meta's AI chief thinks otherwise.","Today in “Elon Musk says…”","Yeah…hows full self drive coming along?","Musk also said the Tesla would be self driving a year from now. Of course he said that 8 years in a row. He also said the Tesla semi tractor would be available next year. Of course he’s said 5 years in a row. It’s almost like he’s a moron and really doesn’t have a clue what he talks about.","\"Elon Musk says...\" = automatic downvote...","Well, if Elon Musk thinks it….In any case I’m quite sure it’ll be smarter than him, but that’s a low bar.","In 2016 he said a Tesla could drive across the US within a year.In March of 2020 he said there would be no new cases of COVID by April 2020.He said his kids love him.He says a lot of things.","Smarter than Elon Musk? Sure!But as the saying goes in park care: \"There is significant overlap between the smartest bears and the dumbest humans.\"","If I leave my cereal in milk too long it gets soggy.Thanks for checking in, Elon.","Stop giving this asshole page time.","But humans are pretty stupid, it’s not a very high bar…","I rather have AI than this idiot creature","Poor thing doesn't realize AI had already surpassed him by GPT-2","in 10 years, AI will start producing young ones.","Even if we make extraordinary progress in AI development the real blocker to adoption is that the law doesn’t move that fast. If an AI is in charge of operating large scale infrastructure like power grids there’s still a company responsible for decisions and impact.Musk is also notoriously anti-regulation because he thinks it impedes progress. So his goal is to become a political advisor to help expedite changes to regulatory barriers. He’s probably scared of AI because of how he envisions the regulatory landscape shifting as a result of his own influence.","“I mean if it could somehow be smarta than me it must be smarta than us all”","Why are so many people thinking that this guy is some kind of engineer with special knowledge ? 😂He is just another trusfund kid that owns some companies, who cares what he thinks about AI lol","Who cares?","Realistically? Nobody knows.","I’d like to add that Sam’s view is closer to Elon’s than Zuck.","It’s gonna come in a lot softer than the predictions. Id say, probably 20 more years before it really has a solid place in society. Maybe longer.","Well it's already smarter than Don Lemon.","Well...it's already smarter than Elon...not that it should be used as an indicator of success.","As per Elon must timeline definitions, we've still got some good 15-20 years.","Neither of these people have any idea what they are talking about. They arent the actual engineers working on it and dont know what any of it means. There could be someone on Elons R&D team who think 5 years is an impossibility. There could be someone on Meta R&D team who thinks they could totally pull it off in 5 years","Both of these positions are opinions.Musk is thinking about possibilities while LeCun is a concerned with actually making it happen with today's technology and understanding. Also, Musk has expressed doubts about our ability to use and control the technology ethically, while LeCun's job depends on its unfettered development.When the abilities of an unknown quantity like AI increase at a geometric rate, nobody alive knows what it is going to be capable of. Considering how hard everybody is working in this area, how much money is being spent on development, and considering that AI systems have already written working code that humans can't understand, the predicting the future is a crapshoot.","It's already smarter than many non college educated Americans. We don't need a guy that doesn't program AI to tell us the future. I'd rather hear from the actual programmers and engineers."],"points":181},{"text":["Ubisoft let me actually speak with its new AI-powered video game NPCs","Is it already on the level of Skyrim mods?","Interesting demo, but the implications are dystopian.Expect AI-powered NPC’s in mobile games shilling microtransactions to 10-year-olds.","Great now every npc is gonna read you a novel every time you talk to them. One thing AI responses aren't is concise","yay endless trash dialog","'Please kill us, our existence is pain.'","Cost needs to come down to being almost negligible before it can be implemented in story mode for games. If they're offloading the AI processing onto a different backend system, they'll definitely want to recapture the cost.","psshhh big whoop I've been having conversations with Skyrim guards for years","\"hello random guardsman, can you please direct me to the objective?\"\"hello traveller, can you please put in your credit card information for me?\"","Damn that's actually really cool.​But will I be able to tell a NPC to climb a tower to reveal the map for me? 😄","I feel like this sounds exciting in theory but when it's actually in games people will want it to go back to set dialogue lines.","Man personally I think this is really good. Like think about how many nameless NPCs there are in games and how it's actually both impossible to voice/script thousands of them, or how even the ones that are scripted feel like emotionless bots once you get to the \"end\" of their scripting.This video was so cool. Clearly there is still a BASE script the NPC has, and BASE goals and dialog trees, but the AI allows it to go past that. It feels so much more immersive.When he said he was nervous to join the resistance... or when he said \"Tell me ONE WORD why I should join\" I was super impressed with the answer.","This is going to be bad and uswd mostly to get rid of voice actors and writers. The whole idea of sharing experiences with other people is going to get destroyed for this, where every interaction is going to be meaningless.","I am skeptical to use it with main npcs. But I wouldn't mind if the random crowd npcs had a chatter that way. Like gossiping recent events and stuff.","I’ve been wondering: Which game developer will take a flying leap on this controversial and intriguing tech?\"take a leap\" and \"take a flying leap\" are two separate and not interchangeable idioms, and now I'm wondering if this article was written by AI. lol","sound so boring, why would i want games like these?","It might not be ready yet but when games naturally will include AI todays games will feel ancient.","Video example here is brilliant. A glimpse at gaming in the future. All for this tbh.","That voice is just wrong. It's a common TTS/auto CC voice online. It works for Warthog News on YouTube though. Has that old time war reel narrator sound.","“Hey bloom. I’m hungry and short on cash. Can I borrow 5000000000 credits?” bloom has given you 5000000000 credits","Some company is gonna try to use AI voices to integrate ads into games. They could have the AI craft an ad into the dialogue of a game in real time allowing companies to target specific demographics and time periods. It would be really similar to internet ads.“You are Dovakiin; Dragonborn. The greatest among us.Almost as great as a cool, refreshing CocaCola!”","I see Ubisoft I gag","Walkthroughs are done for then","How long until that’s subscription based.","As someone who skips ANY interaction with NPCs, they can spew out entire libraries of AI-generated codswallop, I'm not sticking around to listen to it.","But will they let you speak with a human in customer service?","Will we get SOCOM style voice communication in games in the near future? This is what I hope for","That was really good. The AI didn't fall into the trap so many do of just being sycophants that agree with everything you say. They had personalities and goals they stuck to but went unreasonable either.It feels like a really good balance. I especially liked the drone section where he told us to stop focusing on the vase and focus on the mission. It felt very real as he still interacted but was focused on the mission like a real operative would be.The delay was the only hard part here, that and the planning session requiring you to come up with ideas. I think that last part though was intended to demonstrate its thinking and debating capacity, and it succeeded at that.I look forward to having this show up in real games.","We'll see what happens when the Internet at large gets hold of it.","Not gonna lie the dialogue was better than what I'm currently playing through in Far Cry 6.","Ok there is an actual reason to require an Internet connection for a single player game","Id rather have awesome AI for the enemies when you fight them","This tech is going to be pretty insane for open world RPGs and immersion in the future. Honestly can’t wait","This is so exciting. I Really hope it’s the future of RPG gaming.","I’d like to see this combined with PCG to make new quests/npcs as well. I think that’d be a huge step forward in the technology and if done well, could be very interesting in games.","I think this is indicative of a big problem in writing nowadays - and not just for videogames.I can recall almost every line from Elden Ring, but if you ask me which plotlines were my favourite from The Witcher 3, I'd be hard-pressed to be able to quote it as much.A lot of dialogue found in videogames today is more of a necessity: it's there for the same reasons that NPCs have walking routines, to give off a plastic veneer of immersion. Think MCU characters quipping to fill in dead air.This might be fine if you want your GTA 5 NPCs (for some reason) to have seemingly-casual conversations on their own. If you want the next Elder Scrolls or Fallout to use weird, unnatural, generated text like this instead, it might actually be an upgrade.But I think all this is going to do is make your game feel emptier. If you implement it properly, it should reflect on altering the NPC's stats, goals, etc. So that either becomes a major gameplay aspect... Or like I said, it's just there to look shiny and take up more processing power while masking the fact that most dialogue nowadays is just fluff, born out of attempts to keep conventions as the technology has developed.","[deleted]","I want AI in games, tastefully. But every one of the three Unisoft games I've purchased have all self imploded due to their anti privacy garbage. So not buy their games.","“It's possible someone stole my sweet roll either out of hunger, impulse, or just for the thrill of taking something that wasn't theirs. People may resort to theft for various reasons, sometimes driven by dire circumstances or diverse personal motivations. We should consider all sides though, as the moral implications of this act are quite complex.”","That was pretty good. As for reporter, I'm not sure what he wanted to achieve. He basically didn't want to continue the story. I know he was doing it for reporting sake but just saying, I don't want to continue/play, it doesn't get you anywhere.","Ubisoft is really going downhill as a company"],"points":667},{"text":["Firefox 124.0, See All New Features, Updates and Fixes","Maybe one day they'll fix the fucking fullscreen video feature on mobile."],"points":1},{"text":["EU's Vestager warns about Apple, Meta fees, disparaging rival products","What the fuck…"],"points":0},{"text":["[The Atlantic] Universities Have a Computer-Science Problem","Any time I see a college professor complain about the increasing lack of well-roundedness of college education without so much as acknowledging the problem of costs and ROI I roll my eyes. Why in the great everlasting fuck should anyone care about this in a society with no safety net and a $150k+ price tag for these universities? If we valued well roundedness as a society (which we should), then we'd invest in it for everyone because that is a collective ROI. Meanwhile on an individual basis, if that degree doesn't shoot me like a precision cannon into an industry that's going to pay me for my knowledge, I'm not interested in whether I picked up French along the way to spending countless thousands of dollars.","Can anyone share the cliff notes for those of us without a subscription?"],"points":13},{"text":["Anonymous Sudan Targets A Telecommunications Company in Mauritania","To make things sound more exciting you could call the telecommunications company a spy agency."],"points":0},{"text":["Researchers have developed a new 3D printing technology that recycles wood waste material without using plastic. The 3D printed objects with the texture, appearance, thermal stability, and smell of natural wood","It sounded so cool up until the final processes of freezing at -85 degreees celsius for 48 hours, and then baking in an oven.","And it makes pure oxygen, dark chocolate covered raisins, and generates electricity for free.","You know there's another technique to produce wood.","Current wood filaments for 3D printers aren't up to scratch in this regard, being around 70% PLA. Pleasingly, the new 3D printing wood ink uses \"entirely wood-based constituents and is devoid of any binder or foreign polymeric phase.\"It never occurred to me to want to print with wood but this is very cool. And some of the pictures, especially in the linked paper, are interesting. If it's for real I wish they would have shown some pictures of a sculpted violin or armoire or something.The cooling part isn't the worst thing for a first generation product, unless 48 hours is for tiny things and it becomes rediculous at larger scales"],"points":7},{"text":["Nicholas Hawkes, 39, becomes first in England to be jailed for cyber flashing","The title is misleading as he's already a convicted sex offender and he was intentionally sending images to kids","Sounds like he bricked himself.","[removed]"],"points":73},{"text":["Reddit faces patent infringement claims from Nokia ahead of IPO","What patent ? The article doesn't say.","Nokia announced this week that it has filed lawsuits against Amazon for the unauthorised use of Nokia’s video-related technologies in their services and devices. The Nokia patents concern technologies over video compression, content delivery, content recommendation and aspects relating to hardware.In particular, the Amazon Prime Video service and Amazon’s streaming devices are the focus of the lawsuits."],"points":64},{"text":["Using AI to spot edible mushrooms could kill you | AI tools are good for some things, but don’t trust your health to apps that make frequent mistakes","Is this the new version of people using their GPS and driving straight into lakes?","I would much prefer the advise of someone who knows from experience. If they’re alive they might know the difference between edible and inedible.","*as your mouth foams and your life comes to an end, you look up at your phone to read the last message of ChatGPT*\"My apologies, it appears I misidentified the mushroom. The error in identifying the mushroom as non-toxic when it was indeed highly poisonous is a serious oversight. It's crucial to remember that identifying mushrooms can be complex and risky, and should ideally be done by experts or through direct consultation with reliable sources. Again, I am truly sorry for this error and any distress it may have caused.\"","Application that is actually just a ChatGPT wrapper making an API call:“Looks good to me bro. Wash it down with bleach which is known for its many health benefits.”","Like many imperfect technologies, use it to positively identify an actual problem. In this case, you might use it to prove if a mushroom is a specific species of poisonous mushroom. If the technology can affirmatively identify that it is in fact a specific species of poisonous shroom, then it certainly does help.Even if it's not perfect, you can research the claim the AI made more thoroughly on your own. It can certainly save some time.As long as you don't try to make any assumptions about how safe it is based on that fact, it still can be useful.","Never use any app for identification, ever. Never eat wild mushrooms if you don't know exactly how to ID them. Never take ID's from people on the internet. There are lots of toxic species that have edible lookalikes. There are two deadly species that are very closely related to the common buttons you find at the market. Mycology is super neat.","Hmmm...technically that's just natural selection.","If someone dies due to an app “suggesting” that a mushroom might be edible then I am sorry at this point this is natural selection taking place.You can’t just blindly believe anything an AI model outputs.","AI has not proven good at determining true or false statements. It has proven good at editing writing style and formatting Providing new possibilities within defined scopes, for example protein folding, pharmaceutical chemicals etc that we hadn’t invented yet. Providing language within a set list of rules with defined syntax and structure to get an outcome (ie programming code)","It blows my mind that someone with the combination of technical skills to make an app, and at least some knowledge of mushrooms and AI, would even market this. Or that Apple/Google allow them to be sold.","It’s called survival of the fittest for a reason.","How about we stop eating wild mushrooms? There’s a good idea."],"points":52},{"text":["Mustafa Suleyman, DeepMind and Inflection Co-founder, joins Microsoft to lead Copilot - The Official Microsoft Blog"],"points":0},{"text":["Red Hat jockeys for pole position as enterprises cloudify critical apps: Enterprises are releasing critical applications from their safe, legacy architectures and updating them for the cloud, according to a report by Red Hat and analysts at Illuminas.","\"cloudify\" just means \"pay a third party to do it on their rhel server\"This is a bad proposition for companies moreso than RHEL. Giving all your company financial operations to another company usually isn't a good idea cloud or not. But most companies don't even realize or care how their IT departments use subcontractors or unlicensed, foregin staff in the first place.","Company who likes cloud says other companies also like cloud!","When someone says \"red hat\" I think of several things before Linux. I know they've had that name for years and years but at some point you gotta admit your name's got another common meaning"],"points":3},{"text":["US considers 4-day workweek; will it be in favour of techies?","thers no way this bill gets far at all, would absolutely love it but i have zero hope","It's not that everyone will move to a shorter work week, it's that full time employment will be redefined as 32 hours a week. This scares the shit out of fast food restaurants and walmart because nobody will work for them when they put everyone on a 3 day 8 hour schedule just so they don't have to give them healthcare.","The US is not considering a 4 day work week. Anything put forward by Bernie Sanders is dead in the water unfortunately.","Plot twist: You have to work Mon, Tue, Th, Fri.","\"...legislation for a standard 32-hour workweek with no pay cut.\"I am quite sure there will be no reduction in the amount of work I will need to accomplish in a week.","Shit, do tech folks even get a 5 day work week?","I guarantee hourly employees of any company that does this will be shafted.","Companies lost their shit about remote work despite it having little to no negative impact on productivity, so there's no way they go for a shorter work week on top of it.","Gov: Yay, 4 day work week coming for you guys!Corps: ok, I guess more AI it is.","As a construction worker, it’s not possible. I cannot do more work in less time. And people want their shit built.","They aren’t considering anything","I currently work 4 10-hour days and the three day weekend is a massive life improvement. Plus it’s been proven that four day work weeks make employees more productive.","I would love this! And then 6 months in Id realize I work on that day off anyway since my managers still email me for shit.","Rural area IT support here. If I could... I'd take an hour to two hours off in the mornings, still work 5 days a week. I don't operate, mentally, near 100% until around 10am. In favor, my boss has approved working later in the days as needed to compensate. The latest I found myself is a last minute call ticket for a client an hour drive away, I didn't home till 1am.If it wasn't for parenting priorities, I'd be more so working later in the days, be up later, and sleep an extra hour or so in the mornings. I'm not \"not a morning person\", but if something came up and I had to leave for work at 7 or 6am back to back, that's when I start getting cranky and less patient with people/computers. lol","I doubt this will pass the lobbyist wall","Is it terrible that i was like “awesome, i can have more time for a second job!” We are so eff’d.","[deleted]","Give me two 20hr days.","Please, I used to work a 4x10 and it was glorious!","Absolutely no way this passes","US will consider 4 day work week when robots are the primary employees","This is somehow going to morph into an expected 6-day workweek","Oh yes, the country without any worker rights and protection, with no mandatory universal healthcare and people having to work three jobs to make ends meet will introduce a 4 day work week for the same salary as 5 days. Sure thing. I will saddle my unicorn now and ride away.","Mmm hmm. AI works 24/7. This isn’t going to end well.","\"US Considers...\" Bullshit click bait.\"Bernie Sanders and a few other politicians introduced Bill that's never getting passed\"....","No one is considering this at all.Zero, no one.Maybe without pay and full time benefits....Americans are so gullible and stupid they actually believe companies will pay them to sit on their ass one more day a week .","Wtf you talking about, more like they want us working 6 days a week!","If you think it's hard to find someone to help you in a store now, just wait and see what happens if this passes Robot overlords incoming","I already have a 4 day work week. Can I get a 3 then? It will probably end up being a 3/14.","Nobody is considering this. Corporate American about shit themselves with work from home and many large companies are trying to undo that. As much as I'd love this, the decision makers haven't show themselves to be \"pro worker\".","But then we won't have time for all the pointless meetings?!?!","I would love a 4 day work week but we can’t even get rid of daylight savings time. Which was unanimous and unlike most topics, without bipartisan pettiness. It would be nice if we could actually move on these quality of life issues that affect people day to day instead of just talking about them…","No way the majority do this. This is a consumer nation. More more more. The more efficient we become , for example , doesn’t reduce our hours, it just means we do even more work in that time span","Just keep printing those dalla dalla bills, might as well have a single work day. Everything is fine.","We should just shorten it to 3 days a week, then everyone can work 2 jobs for no benefits.","As much as I'd love to see this pass, we can't even get a livable wage in this country. It's like introducing a bill for Universal Basic Income while they're still trying to get rid of Social Security.","The same country that wants to raise the retirement because people are \"living longer\" is going to shorten the work week? I'm not holding my breathe.","More likely the bill gets rewritten last minute to make it a 6-day workweek and it’s passed due to some weird off-topic attachment about the child tax credit or some shit.","The federal minimum wage is still $7.25 a hour if you think this is going to passI have a bridge to sell you.","The 6 day work week seems more likely","Funny thing is this is a total non-partisan issue. Everyone should want this but unsurprisingly politicians will be paid to torpedo it by the special interests bank rolling campaigns.End unlimited dark money in politics if you ever want to see popular majority policies go through.","it won't even happen, it's just Virtue signaling.","No way they’re actually considering it. I wish they would, but we have a bunch of Neanderthals in charge.","US considers?","Make the week 8 days long with 5 work days and 3 days off.","I truly think this would change our social work climate for the better. You don’t get 2 day weekends, you get one day to do shit you have to do then one day to try and relax.","THIS WILL NOT HAPPEN","Even if this passed it would only be for government workers or huge companies. Blue collar people and those working for small businesses will still have to work 5 and 6 days a week.","If you were “essential” during the pandemic, this won’t apply to you.","We cannot even agree to change Daylight Savings Time to make it permanent, what hope is there for anything else lol?","Meanwhile is China still pushing 996, ie 72 hour work weeks?Has anyone come up with the 5.25 people's schedule for covering 24x7 operations?",""],"points":4023},{"text":["Facebook, Instagram may cut fees by nearly 50% in scramble for DMA compliance","Fees? People pay to use social media?"],"points":3},{"text":["Nokia tells Reddit it infringes some patents in lead-up to IPO","Nokia owns the patent on video players that won’t start","Nokia is currently going after Amazon and HP for the same thing.Nokia own a number of patents related to codec, video UI and functionality which they filed in the early 2000s as part of their mobile business.They are just going door to door letting everybody know and I imagine saying “licence this for a reasonable fee or we sue you”. Everybody picks the licence, Nokia make a tidy sum of money and no video players need to be rebuilt.","Like what, connecting people?","garbage article doesn’t even say what it is they are being accused of stealing","Hoping someone knows what might be infringed in this situation.","They definitely don’t infringe on any of Nokia’s reliability patents!","Reddit's IPO is seriously not good for anyone other than Reddit higher-ups who will enrich themselves while dumping all over investors (that's you if you mistakenly join in).Any roadblock is welcome, fuck them.","Dude… this is true about every large company. They file a bunch of relatively meaningless patents to build a portfolio so that they can wage legal warfare against other companies. Every large company is infringing on patents held by other companies and has patents other companies are infringing on. It’s like nuclear weapons and mutually assured destruction - you rattle the sabres all you want to get concessions, but you don’t file suit until you’re desperate or have such a slam dunk case that they’ll settle out-of-court anyway.","Interesting how seemingly unrelated worlds collide","Anything that might screw over Spez and the Reddit corporate is fine by me. Go Nokia!","Reddit is social media, and I'm sure FB and IG consider it competition as users look elsewhere for content. Microsoft has a large interest in Meta, and also owns Nokia. Surprise. Lawsuit by proxy.","Don’t open your mail just before the IPO","I worked in Nokia and filed a lot of patent applications. Nokia's major business sectors today are telecommunications systems and intellectual property. Guess which side is more profitable?I have a patent that Apple has cited about 300 times. I am just waiting for a product to get on the market...But anyway, should I do an AMA?","There is a snake game on Reddit!!!??? Where!?","Isn't the largest part of Nokia's worth in their patents nowadays? They make most of their money licensing patents or suing people over patents they bought from other companies.Edit for clarity.","So what business does the hardware phone company Nokia have with software patents? Or vice versa (but I doubt reddit has done anything outside software)","Nokia Oyj has a patent on being snarky? We are so fucked!","hope nokia bankrupts this pos platform","Nokia is well known for killing their own product before it reaches market and doing their best to antagonize users, so this was an obvious followup.","One of us…one of us","Nokia black","Huffman is huffing","This is the way.","Gee, after the debacle that was the underhanded, backstabbing, lying murder of the third party apps right after cranking the API prices to absurd levels rivalling even those of Twitter, I’d sure hate to see Reddit have to suddenly and unexpectedly pay a multi-million-dollar usership fee to Nokia for the use of their technology. That’d be a damn shame for certain.“Google, is it possible to die of schadenfreude?”","...Who?/s",""],"points":5513},{"text":["Microsoft hires Inflection founders to run new consumer AI division","Sounds like acquire hire"],"points":0},{"text":["United Airlines Suffers 10th Incident in Two Weeks.","So a plane has a maintenance issue and doesn’t even get to the runway?This is how it’s supposed to work. This isn’t news, this is everyday aviation.","Haven’t we all been on flights that were delayed multiple hours for maintenance issues? This strikes me as recency bias/sensationalism.","This is such media junk. It's not even an incident, this stuff happens probably daily.","Jesus Newsweek has turned into a tabloid shit-rag. I remember when they actually used to publish news.","Glad articles are starting to point out that it’s the carrier having issues. Sure, they are Boeing planes, but they aren’t brand new in-warranty planes anymore.","breaking News! some bullshit happening somewhere","How long did we hear about train derailments after east Palestine?Just curious how long we’ll be seeing news articles about any mundane airplane maintenance issues.","Wow. UA35... same flight that diverted to LAX after dropping a tire two weeks ago.","Great! I’m flying them to krakow next month.","Their CEO sent out an email saying none of this is related and all of it will be addressed/resolved by adding one day of training.","United and Boeing are getting billions in free publicity. It could be better, but the media always gets their names right. They could write 'Boing' and 'Untied.'","Many times issues are discovered during taxi for departure.","I’m still fighting United for a refund from a flight cancelled back in January when this all started.I would advise people to fly literally any other airline.","This is what happens when you don’t pay people what they are worth and horde all of the money at the top. The pyramid will eventually implode if greedy people keep taking everything from the people at the bottom.","Shhh, don’t say anything, you might end up ‘committing suicide’","They’re just going to have to ground all Boeing jets at some point, right? Or will they not care until a major accident happens.","Another day, another United news headline","My most recent flight was delayed trying to find a fuel cap. When they finally found the right spare, they had to delay further to file paperwork because a painted arrow or something was missing from the spare, and they needed approval before flight. I found the whole thing absurdly amusing","Is this starting to look like sabotage, anyone?","Uy... reading this aboard a United plane...","Flying United in a few days. Pray for me.","John Oliver sends his regards 🕴️","It’s almost like rolling back safety regulations has consequences….","My flight was delayed to, “replace a tire.” Apparently, it only took 1/2 hour. United is going to have a crash soon.","Wishing I hadn’t pulled up Reddit during my United flight…. 🤞","Boeing stockholders must have paid off United to make Boeing look slightly less incompetent lmao.","Man can you believe flying buses have never been this low","Feels like profits instead of maintenance has us on the precipice of the next major airline disaster.","On top of all that, they break guitars 🎸","Who cares about safety? We have to appease the stock holders and isn’t anyone thinking about CEO bonuses? Geez so selfish smh","I guess those that happened on weekends didn't get reported, otherwise there would be 14 incidents /s","It could be worse","Another Boeing?"],"points":1466},{"text":["SK hynix becomes first to mass produce HBM3E chips"],"points":0},{"text":["Google Health shares generative AI, health equity research updates","The amount of data AI can process in healthcare can provide significant benefits."],"points":1},{"text":["Microsoft Hires DeepMind Co-Founder Suleyman to Run Consumer AI","Evil Mr Bean","Consumer AI, enough said.","Non-paywall report: https://www.theverge.com/2024/3/19/24105900/google-deepmind-microsoft-mustafa-suleyman-ai-ceo","Not if Frodo gets the ring into the fires of Mount Doom!"],"points":12},{"text":["China ‘develops’ maple-seed-inspired splittable drone to swarm enemies","Combiner hordes. Somehow more terrifying than Mongol hordes."],"points":1},{"text":["Robotic surgeon can now remove tumors from the tongue with accuracy rivaling—or even potentially exceeding—that of human surgeons","\"Robotic\" surgery is a remarkable advance. Much less cutting, blood loss, and recuperation needed.","ALL jobs are going to end up being automated and replaced.ALL jobs.","yo for everyone that posts stuff about elon musk's personal affairs here, stuff like this article is what you should be posting instead","Basically a CnC machine.","within a short period of time, the robot will make people unemployed, long-term robot working company to the government, the people will go to the government to get CSSA, disguised robots to support the publicRobots can help humans to do a lot of work, the news often said that doctors make patients die, and it takes 5 years or more to train doctors, nannies often steal and abuse children, site workers often have accidents, often drunk driving to the death of passers-by, robots can stop the above county problems"],"points":20},{"text":["Boeing experiencing ‘self-inflicted wounds,’ some blame for recent mishaps lies with airlines: Former pilot.","I had an ex-Boeing stats teacher in college that insisted we’d be hearing about some super crazy bad shit happening at Boeing within the next decade+. Here we are.","\"Self-inflicted wounds\" is one hell of a way of phrasing \"Murdered a whistblower in cold blood and tried to pass it off as a suicide.\"","Plus they totally didn’t just kill that guy ;)","Okay let’s break this down.The three incidents that come to mind are two from MCAS because of AOA sensors not functioning; and one from a door plug.For the tragedies with MCAS… while the training for type rated pilots on previous 737’s didn’t include nomenclature on the new MCAS system, let’s hypothetically give Boeing the benefit of the doubt.The procedure for dealing with a faulty AOA sensor and having a runaway MCAS system drastically changing trim is to shut power to STAB TRIM. Which is exactly what the pilots did on both occasions. And while this cut the MCAS system from making further changes to the trim of the aircraft, it makes it basically impossible for the pilots to manually change the trim to acceptable bounds, especially for the time of flight (right after takeoff).This is NOT on the fault of the pilots.As for the door plug, an entire step of the manufacturing process was missed, not applying the four master bolts to the door plug, which caused it to rip from the fuselage at altitude.Again, NOT on the fault of the pilots.Boeing has now time and time again shown that gaining profits for shareholders and buying back their own stock to boost stock prices are their main priority, and the engineering culture of the company has completely vanished over the last 20 years.The US needs Boeing to be the company it used to be. How they get back to that? I have no idea.","Bruh, sorry you really don't want a third rate engineer designing your airplanes just as much as you don't want the last in class doctor deciding your brain tumor strategy removal.","wtf is this title","here is a great breakdown of what has happened to Boeinghttps://www.youtube.com/watch?v=Q8oCilY4szc","Obviously this is a deflection article.","The companies cannot function without intense regulation they are so greedy they will do anything","If \"some blame\" lies with the airlines, why am I not seeing the same problems with Airbus or Canadair jets?","Ah yes, blame it on someone else. The standard executive argument.","ok some of the things happening right now can also be blamed on the airlines because the problems with the older planes should be blamed on the airlines because they didnt do enough maintenance","Check this guy’s onshore, and offshore, bank accounts.","\"some blame...\" how about ALL the fucking blame."],"points":445},{"text":["Facebook’s Algorithm Is Boosting AI Spam That Links to AI-Generated, Ad-Laden Click Farms","One step closer to the dead internet","AI knows what it is. It's the AI playing the AI, disguised as another AI.","I honestly think that a LOT of the hate online is generated by bots, either by making bad comments or liking that one bad comment.My guess would be china, russia, etc to destabilize the west. And it's working.​And yes, I know how this sounds.","AI will be the death of the internet and I'm actually ok with that.","Shrimp Jesus, don't knock it till you've tried it. Great boiled in holy water and served on an altar bread.","Osama ad-laden","This is amusing to me although Reddit probably isn't much further behind IF it turns out to be successful. People will develop an eye for AI content but AI will also improve. Maybe in a decade it won't really matter.","I've been reporting all this shit as spam when I see it. It's become the majority of my feed. What's most baffling are the comments, nobody acknowledges it's AI, let alone that there's even anything odd. Like there was one with 3 female celebrities who weren't actually ever together, they were obviously fake in my eyes, all the comments were just like \"They look great together!\"God no wonder people fall for bot propaganda so easily. These people fucking vote.","Yep, it was super cool to start seeing, for no reason, AI generated images of breast feeding mothers, one with too many nipples, some with an oddly large number of babies in the background, one with a baby that also appeared to be pregnant, another with a baby that had more than one torso.... good stuff","Who could have seen this coming!?"],"points":103},{"text":["US Supreme Court seems wary of curbing US government contacts with social media platforms","Holy hell, Reuters on the phone is unreadable. They jump ads in and move the whole screen back and forth by pages.","The US supreme court is going to get over turned on most of its rulings in about 10 years when it realigns.Honestly, Thomas and alito need to be impeached for accepting bribes. Nothing these guys have ruled on is safe from being reviewed by a future court.","Personally, I think government bodies/elected critters and government agencies should not be allowed to create social media accounts. If someone is appointed or elected to office they should be required to deactivate all their social media accounts until they leave office or government service.","U.S. Supreme Court justices on Monday appeared skeptical of a challenge on free speech grounds to how President Joe Biden's administration encouraged social media platforms to remove posts that federal officials deemed misinformationI see a huge problem with this, because the government is deeming inconvenient truths as \"misinformation\". The origins of Covid-19 comes to mind. Scientists involved in the research claimed \"An accusation that nCoV-2019 might have been engineered and released into the environment by humans (accidental or intentional) would need to be supported by strong data, beyond reasonable doubt.\"But that is not the correct standard. No cause currently can reach that standard. Rather, the standard is \"preponderance of the evidence\".So, lets look at the circumstantial evidence regarding accidental lab leak. We have the world's largest coronavirus lab that, as a usual and ordinary activity, created novel coronaviruses regularly. This lab contained a \"serial passage\" process that utilizes human tissues to amplify the contagiousness of viruses in humans. We have the coronavirus itself, which was novel and possessed an extreme contagiousness in humans.We have dishonesty. The Chinese refused to release information on the experiments going on in that lab that would have implicated or exonerated their experiments as a cause, and we're permitted to draw an inference from that. We have an American researcher who spearheaded a paper claiming that any claim of lab leak was conspiracy theory, without disclosing that he was involved in creating novel coronaviruses at that Wuhan lab.What is the circumstantial evidence supporting natural emergence? I'll tell you what they have - Jack Shit. They have interesting ideas that constitute \"reasonable hypothesis\", but legally, reasonable hypothesis defeats a \"beyond a reasonable doubt\" standard. It doesn't defeat preponderance of the evidence. Preponderance is simply adding up the circumstantial evidence, and that tally indicates lab leak as most likely.The government intervened to interfere with the discussion on the origins of C19 because, as the Supreme Court noted, \"an uninhibited marketplace of ideas in which truth will prevail\" would lead to some inconvenient truths, some of which I'll list here.All of the deaths in the US would be negligent homicides or higher since the deaths were due to the hand of another.All of us have been involuntarily made part of a medical experiment in violation of our human rights.There has been the imposition of torture, ranging from mild discomfort to being placed on a ventilator, in violation of our human rights.There has been the denial of informed consent in medical decisions, because the failure to mention that the virus was more likely than not man-made is a material omission.This concern about \"disinformation\" is masking a concern with \"inconvenient truths\". Tally up the circumstantial evidence. I see it as clearly indicating lab leak, and natural emergence isn't close. This idea that the chances of natural emergence is equal to lab leak is itself, disinformation.","Fletcher noted that the context was \"a time when thousands of Americans were still dying every week, and there was a hope that getting everyone vaccinated could stop the pandemic. And there was a concern that Americans were getting their news about the vaccine from these platforms, and the platforms were promoting - not just posting, but promoting - bad information.\"\"I know the objectives were good,\" Alito responded, but said he doubted the federal government treated print media the same way.Conservative Justice Brett Kavanaugh suggested such interactions might not be unusual. There are \"press people throughout the federal government who regularly call up the media and berate them,\" Kavanaugh said.","US Supreme Court seems wary of allowing Democrats to curb social media platforms, but will of course say \"not a precedent!\" so it will seem perfectly normal when they want to allow a Republican government to do so.Easy to see through their game, it is the only game they play. Corruption."],"points":48},{"text":["Microsoft is now blocking Russian firms from using its cloud services","Is this when we see a 2000% uptick in Azerbaijan firms using Microsoft’s cloud services?","Now? Why not 2 years ago?","Only now?! Couldn't figure doing this earlier??!","AWS should do the same","Great. Great that they’re doing it now. Any company who stayed in business with Russia since the sanctions/war kicked off is an asshat 🙄","Good. Now Valve please. Nothings more annoying than coming across Russians saying they’ll come to rape you with their war machine and laughing about it.","American shell company’s go brrrrrr.","The swift action by Microsoft is astonishing. Got to give to the private industry, it’s so responsive.","They should have done this earlier. So Russians would have put their effort into developing their own cloud services.","Took them long enough.","I think the same as many users here, why haven't they done it before? Was it difficult to consider this from the beginning? More than 2 years have passed.","What took them so long?","Good extra business for China, which they probably already using.","Now? NOW?!? Why’d it take years?!?","The have to. Russian and China hackers are attacking them all the time. From their accounts in those clouds. Don’t let Russia 💩China anywhere near your core businesses. Especially data bases","Only now?","Only now?","Bout time china next","That’s a good thing for Russia, now they have to develop locks technology, it would be good for Europe too so the world would stop being so dependent on american big tech","[removed]","I wonder what they using it for? Pr0n?","TBH its probably a good thing for Russia not having to deal with Microsoft.","Isn’t it too late?https://www.theverge.com/2024/3/8/24094287/microsoft-hack-russian-security-attack-stolen-source-code","Just now??","What took so long?!","I’m sure GCP would love to have them","USA has committed more war crimes than any other nation since WWII (I'm not condoning Russia's war crimes). It's just that Yankees are hypocritical when they act like they give a shit about some other white country, while turning a blind eye to all the genocides they've committed.","isn’t that the law? alternative headline “Microsoft surprisingly follows the law”","They will keep extending it or lose market share. Big Corporations don't trust the security of \"The Cloud\" and rightfully so.","It's about time, Microsoft put the screws to them... Patriotism over profits.","So the RNC?","And when will we see a ban on Discord and online gaming?","Explains the large drop in spam","What the hell took so long.","Wow only took them 2 full years","Can Microsoft teach Valve how to do this?The Russian cheaters are a plague.","The Russians hacked in the source code…they finally found out and probably used the cloud to steal the data😂👍","What? You want a fucking gold star or something!!?Hey fucked MS","Good! Next step revoke all Russian end user windows licenses and brick devices as they expose themselves to Microsoft services. Apple to do the same. They shouldn't be able to access any western tech whatsoever - that's only for the free world","Nope - this is 100% lies and misinformation"],"points":998},{"text":["NVIDIA's GPUs powered the AI revolution. Its new Blackwell chips are up to 30 times faster"],"points":0},{"text":["Dwarf Fortress creator blasts execs behind brutal industry layoffs: 'They can all eat s***, I think they're horrible… greedy, greedy people' | Tarn Adams doesn't mince words when it comes to the dire state of the games industry.","God forbid game developers form unions or anything so they aren't treated like disposable pawns.","I work at a major game company that is in crunch time creating an ambitious game coming out soon. My friend hired me into the company to help him finish a large portion of a project that he doesn’t have skills in. I don’t have skills in his area and he doesn’t have skills in mine, so together we make one person. And they can’t release the game without this part done insanely well.He has been working tirelessly on this game for 3 years, devoting so much time and passion, way beyond his salary.After those three years of hard work, execs came to lay him off last week. Literally walked him out of his office or the door and disconnected him from all services, now he’s gone and there is literally nobody to do his job.I am brought in as a contractor, so I don’t know what will happen to me. I talked to my friend then the game producers, and they want to continue with me and not him. So they control MY destiny now. I also cannot do his part of the job. So the game company AND me are potentially fucked by this. They’ve made a terrible mistake, especially so close to when they have to lock the game.","What is the best way to get into Dwarf Fortress? It has always intrigued me, but I never really looked into what it takes to play it.","A buddy of mine who was laid off thinks that there's a cabal involved so they don't have to pay higher salaries.Lay of 20% off your workforce, then hire them back at reduced rates after they are starving and their kids don't have healthcare.Fuck em.","Wow and tarn is such a nice and very logical dude!!! I'm shocked to even read what he said.","Tarn is a true GPretty much single-handedly modernized the crafting survival genre as we know it today while making arguably the greatest video game of all time","We are so overdue to unionize...","Could more corporate shills come out to defend the gaming industry? For fucks sake do any of you clowns actually play video games? The whole industry is a shit show with micro transactions games that are total BS and a myriad of other issues. The layoffs are just another nail in the coffin. The dwarf fortress boys are great and totally correct here. I don't even purchase \"AAA\" games anymore because of all the bullshit that gets pulled from false promises to bugs and unfinished or cut features.","This, this is why we love Tarn.","Tarn Adams has expent 22 years making one game about greedy guys that end up fucked because of it. He knows.","Looks like I need to buy Dwarf Fortress","Welcome to the digital dark ages, m'lord.","I don't know why but for some reason I have an overwhelming urge to slowly grow a clan of dwarves only to watch in horror as some randomly terrible fate befalls them.Guess I'm playing Dwarf Fortress tonight.","Finding a correlation between how poorly a company treats it's employees is a good guide to how they treat their customers. Generally these execs forget they need both.","If I saw Dwarf Fortress on a steam spring sale should I buy it? Does it help Tarn Adams or just the game executives now?","I like this guy. Get this guy into a position of power, because he does not want it. That's the kind of guy we need in power.","Game industry is feeling the same crunch as the tech industry. Cheap easy money in 2021/2022 now coming crashing down around us. Gonna be awhile longer while the industry resets, until then, yeah, bloodbath for workers. I was out of work for a lil over 6 months last year with 23 years of experience. It's rough right now for anybody job hunting in technical positions. (And no, it's not because of AI, at least not yet)","he is 100% right, all the big companies are run by MBA people that don't care about anything else but big numbers getting even bigger.","Not just the games industry, seems like it's a \"business in general\" problem to me","It was a better time when studios were owned by games developers themselves, not by some arseholes with an MBA.","It's not just gaming. As a middle manager in corp America, I have see the entire market shift significantly in the past 10-15 years. It is no longer acceptable for a company to be merely profitable - It has to hit increasingly higher revenue/profits year after year. How do they do that? Higher prices and lower costs (layoffs, cutting perks, charging more for worse insurance plans, etc.)","When the companies lay off workers instead of managers, sell that stock and never return - they just relinquished their revenue-generating employees and consequently admitted they didn't know how to mange the talents of their staffs.","It's not just gaming. Every industry has the money management making bold changes to the workplace, like after a good year they will lay off 1/5th of the staff and boom the year looks even better on paper... But the snapback of the layoffs aren't felt for a few years, and then you'll see that 'somehow' the industry is in a decline.It's been like this for way too long.Boeing is suffering the worst from being a engineering company run by finance guys. But this is every company. It's just becomes a slope of perpetual decline.1st year, lose a 1/5 of your trained employees, and push their work onto existing employees. Second year keep thing like this while dealing with employee dropout. Third year, start feeling the effects of the staffing issues, 4th year start making cut around the workplace to bring back revenue. It's probably not as simple, but I've seen this same formula ruin lives of employees","As a game developer, he is 100% on the money.","This is the energy we as consumers need to have.","Welcome to Capitalism. This is always going to be the end game when Capitalism is the primary factor for growth.You can just look at food/gas prices and see it in action and WHY it needs to be reigned in. Their profits are through the roof and you have to ask how? Raising prices and gouging people. Until unions/government steps in this is going to keep happening. You will see more layoffs, prices going up and their year over year profit ever increasing.","God I love Toady.","Silicon Valley went full toxic libertarian and never recovered. I liked the early internet days where a lot of the people building stuff were ponytailed older videographers that evolved to create CD ROMs and then websites.","Dwarf fortress my beloved.","that reminds me, i could play dwarf fortress instead of working","Toady is gaming’s Tolkien and Vonnegut. What a fella.","Tarn and Zach are my heroes. They do something they love and don't compromise their shared vision.","My team was one week from launching a free DLC update when we were all laid off. (It wasn’t released though). We had to hound the IP holder just to pay us what we were owed up to that point. They only paid up when they realized they let us go before the code was uploaded to their system and they knew we had it.","Dude isn't wrong","What happens when all executives are replaced with finance bros instead of actual game devs.","wow, the comments on here are disgusting.","Had a middle school student yesterday who told me he was interested in game development as a career.I told him that it's the worst area of tech to work in, but if he went to my friend's game development program at the local community college he could scratch that itch and then get a computer science degree after transferring to a university.","Couldn't say it better. The whole tech industry really can eat it.","IT people are Trump voters who post on 4chan all day.","My life goal is to be asked what I think about a group of people that deserve derision and to have the chutzpah to tell it like it is","The only AAA game I've bought in the last few years that didn't have Nintendo written on it was Starfield and that was a load of garbage.It's almost like these companies that treat their staff like shit also produce shit games.",""],"points":4983},{"text":["UK Scientists Develop Bra-Integrated Breast Cancer Monitoring System | The device tracks breast changes, boosting survival odds","Finally, I’m getting tired of the dozens of random women asking me everyday to fondle their tits","If it's sensitive enough to find cancer, it's sensitive enough to monitor other breast statuses... Breastmilk, for example, begins to come in often around the second trimester:https://mylofamily.com/article/when-does-breast-milk-come-in-during-pregnancy-169867State lawmakers have already expressed an interest in classing abortion as homicide:https://healthnews.com/news/the-privacy-dangers-of-period-tracking-apps-post-roe-v-wade/Breast-monitoring bras are just another potential source of information that is vulnerable to a subpoena, along with location tracking apps, period-tracking apps, and purchase histories, that will soon be used against women in red states who get abortions.The loss of the protections of Roe has been a huge blow to women's health. As shown here, society is only just beginning to come to grips with how much this loss is impacting women's healthcare.In a post-Roe world, even cancer screening tech can make a woman vulnerable to possible criminal prosecution.","Bras are already incredibly expensive. This won't help","First washing machines. Then bras? We’re in the end game now.","Does anyone else's skin crawl at the thought of placing a Bluetooth device up against their breasts???","What's with the conspiracy theory Twitter post embedded mid-article?... Claiming dental work causes 97% of heart attacks lol."],"points":19},{"text":["Judge rules YouTube, Facebook and Reddit must face lawsuits claiming they helped radicalize a mass shooter | CNN Business","\"and we will continue to review the communities on our platform to ensure they are upholding our rules.”I have seen some very offensive content on reddit that is still viewable hours after the shitshow. In some subreddits offensive comments are encouraged. I guess regular reddit users know this already. I wouldn't know how to manage such a large platform. Just my 2 cents.","[deleted]","Great… now do Fox News.","Okay look not defending anyone here just asking a question.If this goes anywhere(it wont) does that mean the people posting the content will also be held liable? What about people who see it and comment on it but do nothing to get it removed, are they also liable?","Oooooh this might hurt their IPO valuation.","\"Valuable discussion,\" right spez? And just in time for the IPO!","I’ve reported hate speech, blatant racism and bigotry and even threats of violence and been hit with the “the reported content doesn’t violate reddits policy” or whatever and it’s always mind boggling to me. Meanwhile I criticized a mods decision to remove a post in a sub that will not will not be named and I got banned over it. Kind of nuts.","Ah yes one step closer to finally getting rid of that pesky freedom of speech this country was founded on.","These companies claim to police discussions, but a 5-minute search on Reddit proves this is bullshit. There are entire subreddits dedicated to spreading hate.","How the fuck do you prove that in court?","Reddit absolutely radicalizes. How many trash subreddits have existed in the past and taken years to ban (many still existing today!) ?","And would a paper or copier company be held responsible for pamphlets radicalizing someone?","Do Twitter next.","All I know is, you watch even one video from some conservative fuckwad and youtube will never stop recommending you more fuckwads no matter how many of their channels you block.","Are they saying that social media can be used to radicalize citizens? Like say for an ideology?","Who is next, news stations?","And yet politicians and ‘news’ services walk free… funny old world aint’it?","If this is a court precedent, can truth social be held liable if anything happens and is linked back to the platform?","Judge; The frivolous lawsuits that will 100% go nowhere must take place!","well that's certainly a dangerous precedent. hopefully the ruling gets thrown in the trash where it belongs on appeal.","Humanity's still too fucking stupid for social media. Too stupid and too greedy.","Never heard of a computer shooting anybody","Elon is probably radicalizing an unprecedented number of young morons on TwitterTwitter should be the first one sued if this were to ever go forward","The content they post matters.","Somehow in my mind I see flip Wilson standing in the background going the devil made me do it.","Can we start sueing these platforms for harassment from all of thier “prank” “influencers” and other shitheads that only do the things they do because social media lets them post it.","The violence was horrific, and the perpetrator deserves punishment. As for involvement, social media is like drinking or sugar consumption; it can affect behavior, but the results are too varied to identify threads of causality. It is like a rainstorm's effect on traffic. Every driver knows the risks and how to manage them, but accidents still happen, and some are deliberate.","Wait am I understanding correctly?So 4chan And discord, 2 of the many sites that got tons of evidence of what this guy planned to do, just did NOTHING about it nor did the users of 4chan and Discord do a deep dive as to if this threat was real or not?And yet 4chan users had no problems finding out within 20mins the identity and location of that bk employee that posted a pic of himself stepping on lettuce...","What about the psychos who put the content on those sites to begin with?","Now do libraries next.","looking forward to this lawsuit being told to kick rocks eventually.also looking forward to this guy never seeing the light of day again.","Gosh. I hope it wasn't something I said..","I just hope this leads to reddit actually banning the Conservative Nazi breeding grounds.","So guns don’t kill people, social media does. Got it.","I called somebody out on r/ Conservative for his veiled threat to kill LGBTQ Democrats when he wrote “ a bullet is the only cure for mentally ill communists.”The response; I got permabanned from that sub and his transphobic comment was allowed to stay up.So yeah, Reddit is also complicit.","Not sure how to feel about this considering similar media is in the news and woven throughout “Hollywood”","Fucking good.Make Reddit and Spez pay for the bullshit he openly promotes and allows, all while daring pretend \"reddit cares\".","What about how some news outlets completely glorify the shooter with the name of him and his family after?","Reddit should face lawsuits cause of the inability to block that He Gets Us shit.","ok so someone ELI5 why online platforms are potentially on the hook for radicalization and channels like (for example) Fox News and GBNews that have been shown to present a crafted narrative, arent?","Ridiculous. Judge Paula Feroleto needs a brush up on the law , this dumbo never should have gotten a job as a judge. They must be handing out judge seats like candy these days. Her predecessors are rolling in their graves.","Is it right to blame apps instead of parents? Is it wrong to blame parents since they can’t really track everything a kid does?","There would be a delicious irony in reddit going broke because their stupid IPO coincides with a massive lawsuit that is the result of the admins coddling and protecting Nazis.","Then FoxNews NewsMax should be added to the list.","Good; it’s long past time that social media companies are held accountable for some of the crap that they allow/encourage to float around on their platforms","If you are going to put ads on your platform you are going to be held accountable for its content. Simple.","It’s the IPO stress news","The whole world is responsible for reason a kid, so why don’t you see the whole world as responsible for raising the child and make everybody pay him a dollar and that should fix the problem. Stupid is a stupid does.","Hey fellow regards at r/wallstreetbets, this may give us a chance to buy low Thursday! To the moon!","We can all name some subs, right?","And he's dead, suicide seems to be going around to anyone fucking with big businesses recently.","Now we get discovery into their algorithms at the time","But you can get banned from some subs cuz the mods disagree with you. No ability to report this kind of mod abuse, and no consistency across the platform imho.","Live by the algorithm, die by the algorithm.","This is great publicity for reddits ipo","Can’t get the IPO done soon enough","Got a previous account banned for reporting several transphobic posts in an lgbt sub","No guys it’s TikTok that needs to banned.","Waiting for the judgement of an old, orange ex-president who radicalized a large group of air heads to attack the nations capital.",""],"points":1600},{"text":["Nvidia unveils powerful chip in push to extend dominance in Al market","Early signs that the innovation is moving away from AI algorithms and models to computational power with lower costs. Also signs that, ultimately, Quantum computers are the holy grail for AI live on."],"points":4},{"text":["Samsung to create new type of semiconductor for humanlike AI","How many more of those AI tools do we realistically need?","The article is very light on details.","At first it sounded like they were trying to create a new type of transistor, but later on the focus went to architecture. Really they’re trying to make something like an ASIC. Probably something with memory on the same chip as the processor."],"points":2},{"text":["New breakthrough technology promises to change the future of transportation","I remember this headline when the Segway came out","Boiling ammonia at 1,112ºF sounds pretty energy-intensive.","from article- Experts from the Korea Institute of Energy Research are delivering the product in part by reducing ammonia to its core elements: hydrogen and nitrogen.The innovation uses temperatures of around 1,112 degrees Fahrenheit to decompose the ammonia, according to TechXplore. To eliminate the need for fossil fuels, the team uses ruthenium, a platinum metal, as a \"catalyst\" during a process called pressure swing adsorption. It's a complex mix of elements, compounds, and technology that can create high temperatures and, ultimately, hydrogen fuel.","This better not just be Silicon Valley inventing a bus againEdit: all good, it’s not a bus","Trains. Trains are the future of transportation and Im livid at how shit the infrastructure is for it.","I’ve had high hopes since Back to the Future II.","Click through to the tech explore article and checkout the graphic.https://techxplore.com/news/2024-02-carbon-dioxide-emissions-successful-production.htmlThey can make hydrogen without using Natural Gas, which is pretty awesome.","what a shitty designed website"],"points":47},{"text":["World's fastest wireless EV charger unlocks 100 kW parking spots","96% efficiency sounds amazing.Is it really that amazing or is there something not told?","and what was once dark magic is now considered a safe, convenient and efficient way to get the job done.WTF? Who the hell considered electro-magnetic fields \"dark magic'?","Didn't WAVE already develop this technology?","I love EVs as much as the next guy, but there’s no way we can have fast charging infrastructure in place any time soon.The power requirements for these is insane. Only if the charging stations are backed by batteries this could be remotely possible.Furthermore, I’d like to see the following scheme for EVs:If the government gives you a grant to buy the EV, you effectively give them a 10%~15% of your capacity to the network. That way, we can use all the batteries of these vehicles that are almost always not moving to store/get energy up to 10%~15% from full charge (so, only deplete the battery at worst until it reaches 85%).","What happens when I drop a handful of change on it, or my phoneEdit: cool random downvotes but nobody answered my question lol"],"points":164},{"text":["Nvidia Unveils Successor to Its All-Conquering AI Processor"],"points":0}]