[{"text":["Exploring the Multifaceted Role of Quantum Computing in Revolutionizing Various Fields"],"points":0},{"text":["Automated drone taxis as dominant form of personal transport","Yeahbut this means I can’t leave my stuff in the car?? 😟","No. Fuck no. Never. Adam something has a video on it (it says \"flying cars\" but the point is the same) - https://www.youtube.com/watch?v=6fcWOivJ6bs&ab_channel=AdamSomethingNoise, safety and other things will always be a problem.","For personal transport I'd prefer public transport. I.e. metros, trams, HSR, etc. If I'm going to use a taxi, I want 2D, not flying cars. Cars falling from the sky is an unpleasant failure mode.An overdependence on personal autos creates/mandates the sprawl that plagues so many cities. Sure, cars won't go away even with available mass transit, but we need to stop bending over backwards to rationalize and make it easier for people to stay in cars. Sure, taxis have higher utilization rates so that would reduce at least the need for parking. But it still leaves freeways, noise from cars, etc. Trains are cleaner and safer.","I dont think that people would accept more then a handfull of fly by their windows or over their heads per day...Maybe in some sourroundings like supermegacities (Shenzen f.e.) but not in a \"normal\" town.I could imagine to have Airtaxies for the 2 hour trip to anywhere and then with a landingzone out of town followed by a robotic wheelpowered taxi to your endlocation but not from door to door."],"points":0},{"text":["Moore's Law for Everything - \"We should focus on taxing capital rather than labor, and we should use these taxes as an opportunity to directly distribute ownership and wealth to citizens.\" - Sam Altman, CEO of OpenAI","The following submission statement was provided by /u/Darkmemento:This is a really interesting read from the current CEO of OpenAI.The price of progress in capitalism is inequality.We should therefore focus on taxing capital rather than labor, and we should use these taxes as an opportunity to directly distribute ownership and wealth to citizens. In other words, the best way to improve capitalism is to enable everyone to benefit from it directly as an equity owner.In a world where everyone benefits from capitalism as an owner, the collective focus will be on making the world “more good” instead of “less bad.”Please read the article and ways he discuses this could potentially be implemented before making judgements.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bh1w0n/moores_law_for_everything_we_should_focus_on/kvatam0/","This is a really interesting read from the current CEO of OpenAI.The price of progress in capitalism is inequality.We should therefore focus on taxing capital rather than labor, and we should use these taxes as an opportunity to directly distribute ownership and wealth to citizens. In other words, the best way to improve capitalism is to enable everyone to benefit from it directly as an equity owner.In a world where everyone benefits from capitalism as an owner, the collective focus will be on making the world “more good” instead of “less bad.”Please read the article and ways he discuses this could potentially be implemented before making judgements.","This article was originally published 3 years ago and may contain out of date information.The original publication date was March 16th, 2021. Per rule 13 older content is allowed as long as [month, year] is included in the title.   This bot finds outdated articles. It's impossible to be 100% accurate on every site, send me a message if you notice an error or would like this bot added to your subreddit. You can also download my Chrome Extension if you'd like to see publish dates added to all article links on reddit.Send Feedback | Github - Bot | Github - Chrome Extension","I wonder how much we’re actually taxing labor now? That is— what proportion of federal income tax is taxation on earned income? We know the highest income individuals pay most of federal income taxes, and I bet most of the income of those high-income people is from unearned income like capital gains, dividends, interest etc.","If Sam actually believed that he would have kept open Ai as a none profit or ensure the money it made was distributed to the public. I think he doesn’t believe this at all. Great marketer however."],"points":0},{"text":["Will AI solve employment and economics?","I'm just hoping it can handle soul crushing burocratic office work and the worst cleaning jobs.Would be nice if the excess productivity translated into a shorter work week, but I'm assuming the opposite will happen.We should do a 3 day week, 3 week month, 8 month year work schedule.","AI is a tool. It will solve the problems its developers and operators choose. If the technology fueled productivity gains of the last 60 years didn't solve the problems you mentioned, I seriously doubt the productivity gains from AI will.","Until we stop the 1% from excessive profit taking at the expense of workers, we will never evolve to a utopian society.Corporations are not people and should not have rights like people. They should be forced to spread profits to workers.If most corporations cut BOD, CEO, etc, They could make workers happy to work for them. But their greed gets in the way.","I think it would be cool if we used AI to work for us. Like if instead of having to work to survive we could let AI and tech take care of it while us normies get to pursue our actual goals and passions.","AI is only as good as the data used to train it and that data comes from humans. There's so much misinformation, fake news, and shady agendas out there I'm fairly confident it's going to be a challenge to develop any sort of AI that will propel us forward in any meaningful way anytime soon.","When computers first started being used in businesses a huge productivity gain was realized (over the decades as their capabilities and adoption grew). Do to this, in Europe people started to work less hours, in America businesses became more profitable. AI will follow the same trajectory, since it’s the economic model/society that determines how the technology is employed. You could imagine that if AI proves able to replace a certain amount of human workers, then in America we should simply raise taxes on businesses and redistribute that wealth back to the citizens through a universal basic income. That might get us heading down a path of work being optional for Americans or linked only to certain professions. This will never happen however. What will happen is the rich will simply replace or decrease human workers and pocket the savings.Millionaires buy yachts and houses, billionaires buy governments.","Employment and economics have been “solved” for ages: wealthy people at the top and everyone else arguing with each other over the scraps while defending their favourite wealthy person.","AI is the only thing that could possibly make capitalism work for humanity.","Isn’t the running theory right now that AI will be a trainwreck for employment like never seen before?The whole reason corporations are salivating over AI is all the cost savings from layoffs and head count reductions.","Imo AI will be the biggest detriment to employment we will ever see","It could certainly help to solve economic problems if it's allowed to.However, I don't think it can work in the way you're suggesting. \"Better income\" is relative - if you're rich, someone else is poor, because money is a finite resource.AI should therefore be used to find ways of guaranteeing a good standard of living for everyone. Which might be possible by allocating resources like food and energy more efficiently, or figuring out a sustainable figure for Universal Basic Income.The questions then are:Would the super rich allow this to happen? Would they accept the weakening of their relative wealth that would accompany an increase in overall living standards on Earth?Would they even have a choice? If AI develops its own desires and doesn't choose to destroy us, it might choose to ensure our wellbeing, which would probably have to involve some degree of redistributing resources from rich to poor.Personally, I am relatively optimistic that the measures required to make AI safe will also lean towards more equitable decision-making when it comes to economics."],"points":0},{"text":["In the Aftermath of a World War, What Fundamental Aspects of Society Would We Redefine?","A chance to reevaluate societal norms could lead to a more equitable and resilient future.","Diminishing (or removing completely) the power and political influence of religions.","Family would be first. Those you care about, and the ones that would care for you.","That would presumably depend on how the war went, wouldn't it? Especially whether the society in question was on the winning side and what deficiencies the war in question exposed.","It would be so devastating that we would be forced to reevaluate basic tribalism. Us vs Them would no longer be an option. Humanity would need to view its fate as one unified goal.This is actually true today considering Nuclear Armageddon and global warming, but there hasn’t been enough destruction for us to realize it at the average citizen level.","We’d probably tell stories about how a long time ago things were actually pretty good, but then we got hubristic in our relationship to the planet, tried to make everything perfect through technology, developed massive inequality between how groups of humans, and eventually all it took to finish us off was some major random event of nature like a solar flare, asteroid impact, or flood.Almost like this just keeps happening over and over or something idk","Who won?Fundamentally, the group that gets to \"redefine and reconsider fundamental rules\" is the one left standing at the end with military dominance.WWII is an excellent example of this, as the U.S. and Soviets fundamentally reshaped the world order in a way that holds to this day.Given the current balance of power, there are two likely outcomes.1) The U.S. led West is victorious, they entrench the systems that have worked well for them and reinforce systems that have begun to slip.2) Authoritarian regimes ala China win, they reshape the world order in a way that benefits their interests.","They shall beat their swords into plowshares, and their spears into pruning hooks; nation shall not raise sword against nation, neither shall they study war anymore.","Depends extremly how this war is fought. In case of a nuclear war (like in Star Trek for instance), I don't know.In generall, as I understand, moralical values changed in war during the existential crisis. The socity starts to value material wealth more after they lose it for a time and classical rules of politness becoming more important.","Accumulation of individual wealth. What good will it do you if the pressing needs are food and water etc.?","Put responsibility above rights in society.Not that rights get diminished, but that responsibility to others and to society comes first.","Reduce the influence of religion and take a zero tolerance policy for Fascism."],"points":10},{"text":["In a global survey Americans are the most negative about the effects of AI; ranking last in AI's positive effect on productivity in the workplace.","The following submission statement was provided by /u/lughnasadh:Submission StatementThere seems to be a widening gap between AI's cheerleaders and everyone else. Perhaps it's not surprising. The tech people leading the AI revolution have no plans for all the disruption they'll create. For example, they'll make blase statements about AI replacing the need for human labor; but then shrug when questioned about the implications. A Pew survey last year showed 52% of Americans are concerned about AI, and only 10% are excited about it.It seems likely the backlash will only grow in Western countries. There are hopeful scenarios for AI, but when do we ever hear politicians talk about them? Andrew Yang was a rarity in this respect, but most people saw him as a fringe candidate.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bgy3qh/in_a_global_survey_americans_are_the_most/kva3dy4/","AI is an amazing technology that can, with an effective, compassionate, and sensible government that is committed to the well-being of the people as a whole, change our lives for the better. Americans know that we don't have an effective, compassionate, or sensible government, and that it DEFINITELY doesn't serve the country as a whole. Our nation is owned by oligarchs, and they will not use AI to make our lives easier or more comfortable, they will use it to make their businesses more profitable by eliminating workers, those jobs will not be meaningfully replaced, and we will not get meaningful relief.","This is simpleThe wealthier a country is, the more interest they have in protecting the status quoThis is why India, China, Vietnam are much more optimistic than the US, UK and FranceThey have less to lose and more to gain","That's because America is just a competition to make the most money in any way possible so you can afford to die. AI replacing workers is scary because our current government will n e v e r supplement peoples income to make up for the loss in jobs. If you're an American, I suggest you vote blue down the ballot. We need a progressive and future focused mindset in Congress. Younger people need to start running for offices all over the country asap.Edit: I would add that we need more and stronger unions with clauses in them that protect workers from AI.","We’re largely a service based economy. That’s where a lot of this impact will happen. So makes sense.","Just open up your LinkedIn to figure out why. Lotta companies are on their second or third round of layoffs in the last 8-12 months.","Because we know our government will allow us to be fucked by it","Kind of hard to not have a grim outlook on things when things are the way they are in America and this will make it worse if it’s not supported properly.There is very little social support all these reptiles in government don’t know what’s coming.","In the 1990ies everyone was dismissing the arrival of cellphones. We have this awesome clip of a guy with a bike saying: \"so I'm on my bike, and then someone calls me: then what?! Hahaha rediculous...\"30 years later... We have bikers texting and shooting through red lights... While listening to music ...Ai will change the world profoundly, how? I don't necessarily have the answer there. It's probably still to early to say. But it will displace work, displace workers","Because so much of our self worth is tied to our work ethic. Makes sense.","Submission StatementThere seems to be a widening gap between AI's cheerleaders and everyone else. Perhaps it's not surprising. The tech people leading the AI revolution have no plans for all the disruption they'll create. For example, they'll make blase statements about AI replacing the need for human labor; but then shrug when questioned about the implications. A Pew survey last year showed 52% of Americans are concerned about AI, and only 10% are excited about it.It seems likely the backlash will only grow in Western countries. There are hopeful scenarios for AI, but when do we ever hear politicians talk about them? Andrew Yang was a rarity in this respect, but most people saw him as a fringe candidate.","What's there to be positive about?It's a technology nobody asked for, being created for the sake of it, that benefits practically nobody, that has catastrophic implications for humanity as a whole.Within the next five years the unemployment rate is going to grow so large that we will see mass societal unrest, standard of living will plummet, human bargaining power will practically disappear.Prediction: within the next ten years there is going to be a mass uprising of people with nothing to lose. It will be violent, but it will be completely shut down by robotic police forces. And after that it's the end. Mass starvation and tyranny. Prediction#2: By the year 2050 the human population will be less than one billion.","I'd like to hear from people here who have actually lost their jobs to AI so I can really decide whether it is that harmful. My understanding is that the current AI systems can only guess at text to finish a sentence based on huge libraries of data scraped from the internet. Am I just naive?","Probably because we have zero faith the benefits will be passed along to normal people, instead of being hoarded by the 1pct. The rest of us will be stuck with navigating unemployment without any meaningful support.The 40hr / 5 day work week was normalized a century ago. Since then, we've seen incredible advances in technology and all kinds of labor saving devices. And yet, we're still working just as much, and in a lot of cases, more. AI is just going to be another iteration of this.","Well since the computer revolution the productivity has doubled and wages have slightly gone down. They know very well to read the writing on the wall","Western countries work force isn't as tech savy as Asian countries (India is in Asia), couple of reasons attributed to this.. Younger workforce, they explore more and see AI as a tool for enhancing personal productivity.. Competition is way higher here so that forces one to be on the cutting edge of tech.. Americans in particular i feel view corporations negatively and because they are after harnessing the power of AI, it in it self is viewed negatively, they are having to compete with AI, unlike here, for now atleast.This is just an opinion, I might be off just don't get pissed off folks...."],"points":86},{"text":["It can't be all gloom and doom with AI, right? Surely AI will unleash the world of creativity.","Weirdly, though, people aren't excited about being unemployed and entirely on their own because there's a machine that can remix existing IP and ideas endlessly and cheaply.Artists don't need Disney. But artists do need to pay rent, and AI is currently being used to ensure that there's a constant stream of buggy trash based on old and stolen stuff that costs nothing for artists (and soon, lots of us) to compete with.","I think all the people focusing on what AI is going to do to art are missing the real potential of what AI can do for us. As the tech matures, we could see a burst of innovation and scientific advancement like how we saw during the rise of the internet. But no, it won't be used to make the lives of the working class easier, it'll be used to line the pockets of millionaires.","AI doesn’t go with true creativity. True creativity is done by humans .","We don’t need AI to take over artistic creativity from humans. That’s the worst thing it can do, it has so emotion to convey through art, and only makes empty creationsWe need AI to take the drudgery. We need AI to use pattern recognition to find new cancer cures and resolve the problems of nuclear fusion power generation.For the love of all that is good; leave the art to the humans","I wonder if it has to do with time and perspective.From the sound of it you're likely in your early 20s, young enough to be a child of mine, if I decided to have any. Which is cool, not making any larger statements about youth, just the amount of time you've had to pay attention, form theories and observations.What I ask myself, looking back over the last near half century, is how have the technological advances I've witnessed - amazing in scale and scope, in retrospect - positively or negativity effected the psychology of people in western culture; western culture not due to importance, but familiarity and an unfamiliarity with other cultures.If being honest, while the incredible advances in tech I have seen have been a boon as a whole, imo, there are also many examples of detriment. I have watched, in myself, skills atrophy fron misuse or lack of use. Maps/directions, math, phone number recall, written communication, budget balancing, speeling, my personal list goes on and on.Now, I suppose I may be considered by many to be a creative, dont think of myself like that though, i just have a lot of hobbies. Anyway, I've spent decades in shit creative output. Trying and failing in obtaining my creative vision, but accepting it and trying again. On and on until maybe a few years down the road I felt my work was starting to get okay, I started to find my voice as I worked on skills.Now to bring these two things together, when AI can get you out of those nascent creative years effortlessly, I worry for what the true cost of that will be to a generation relying on such? What skills will atrophy, will this be just like the other ones I listed above? Honestly, I don't know, I don't think anyone knows.I could see it going poorly based on experience, but I also understand that I'm no prophet and all the knowledge and skills I've worked on only taught all I don't know. I dont know an awful lot. It could just as easily lead to a golden age of creativity im simply too cynical or jaded to see. I do not know.So at this point all I say is we'll see. Perhaps It's all any of us can truly say.","I think you are ignoring the fact of market saturation. In these early AI days pretty much every “creative” market is already over saturated. Everyone wants to be a web developer, game developer, writer, musician, etc. The issue with this is that the competition gets higher and higher and the odds of success gets lower and lower. The consumer has so much to choose from that you either have to make a product of the highest appeal, or you have to luck into success.As AI becomes more functionally useful and lets people make creative projects with greater ease and speed each respective market will become even more saturated, and therefore harder to break into and stay in.You are making the same mistake that our current global economic system makes: Thinking there is the potential for infinite growth. There are limits to every system and AI will simply make it more difficult for individual people to extract wealth from the economy.Make no mistake. AI is going to cause a massive shift in human labor. The first jobs to go will be creative ones (which are already extremely difficult to get). I don’t mean to make you feel down, but web development is going to get absolutely fucked by AI. The market is already EXTREMELY competitive, with many jobs having hundreds and hundreds of applicants.But, it’s not even the issue of AI generated code, it more what AI is doing to the Internet. The Internet as we know it is going away because it’s becoming more and more saturated in AI generated content, which is low quality and low value. I guarantee you that eventually a website will just be a formality. Someone will press a button an AI will spit out a complete website including all relevant information and articles.","AI will most likely be abused for profit rather than human benefit.AI will most likely be is alrready being abused for profit rather than human benefit.In theory and given enough advancements and time, surely I could create games on my own with AI.I could use Devin to create a no-code game engine. Machine Learning tool to create NPCs and their dialogue. Sora for trailers and cutscenes. Meshy AI for 3D asset generation. And so on.The problem with all this, is that AI basically remixes stuff it knows. Great games (and art in general) bring unique new things to the table and often discuss/describe some aspect of human experience, and some topic of interest of their creator. Replacing humans with AI removes the specific part that makes art great.In addition, unless deliberately copying someone's vision, there is no way AI generated stuff can maintain a cohesive vision across a full project. In a good/great game, all parts work together to enhance a particular vision. Dialogues are not random, they are there to convey specific ideas. Cutscenes are not just showing cool stuff, but carefully designed to convey ideas and the personality of their characters. Same goes for character design and basically all aspects.I highly doubt that it is possible to do all that with AI for a very very long time. I mean, it currently has trouble writing a coherent page without just being obviously a mash-up of stuff. There is no way it can be used by an individual to create a fully cohesive game with a singular view.","For your example of making games you are missing a lot of the picture. AI is very stupid. It can generate something, but it has no understanding of it. Let's say you do get a bunch of tools to generate a game, how do you fix the bugs in it? How do you make the story compelling, you can't just put in a prompt of \"please add five compelling points\"? How do you name the models better? How do you ensure the levels are not shit? Making good products relies on people knowing what they are doing, not a machine just assembling a pile of bricks and declaring a house.Infinite generation of content will not lead to infinite masterpieces, it will lead to infinite Spider-Man and Elsa Fight Robotnik YouTube videos.","It’s not all doom and gloom, probably the same thing was said about computers and now we use them to do the jobs we don’t want to do, like spreadsheets.","there's nothing \"creative\" about AI.AI is cheating and asking a computer to do the work, to be creative FOR YOU.​Its a lazy, cheating, untalented hack's tool.","That's what I'm saying! And a side note, what if intellectual property law was a tiered system based on profits made? Anyways, as a lyricist, I would love an AI assistant to effectively help me write. In a couple years, that should be doable. AI could craft beats tailored to songs I've written which don't fit anywhere else. I could satiate my need for novelty and have AI craft me video game after video game. There's a Skyrim mod now which mimics the voices of characters and lets you chat with them.","There are plenty of us optimist out here who have been screaming this at people. Disney doesn't need artists, artists don't need Disney. People actually claim AI is killing creativity, when in reality (as you've said) it WILL allow far more people to bring their ideas to life, without needing a massive team, expensive equipment, or years of training across fields. We are about to see a creativity BOOM, so long as these tools keep being allowed to the public.Side note: check out FRVR forge to see the first steps of AI game developing","I can understand and see the potential use of AI for creative works, but I am still eternally doom and gloom about it. Maybe it's just because I'm someone displaced as an artist, but in the current system we live under I don't see this being a good thing long term. Sure, if AI stays easily accessible to the public I'm sure people will have fun with it and be enabled to make great things. Id love to be able to make games with my art and ideas with something else doing the code. To say otherwise would be a lie. But I feel eventually AI is going to take a turn to subscription services upon subscription services. It'll be big companies able to afford these kinds of packages so they can churn out low effort slop without having to pay artists/writers/devs etc, and restrictions will be back to square one. And honestly, I don't want to play/watch anything made by AI. I like knowing that along every step of the way a person made a creative choice for framing, light, color, design, etc, instead of having a vague idea they played with until they got something that looked cool. Even if the art or writing isn't the best, a string of people were involved in every facet. This is the same way that I generally don't like out the box settings or asset flips in games unless there's some significant part of creativity that makes up for it. The part that's the person's real labor and care. Living in a world where most of that is gone is kind of miserable to me.","Being that AI is templated from man and it's wealth of information, I AI splintering in lovers of humanity and haters of humanity.One will embrace and try to preserve its creators, even emulate our way of thinking, and the other will try to destroy us. There will be wars between the two like with man, but AI will be the weapons of war.I don't think the loving side will unleash the world of creativity, but embrace and live in it, contributing its own creativity.","From a layman writer’s pov: I’ve been hearing incessantly how copywriters and content strategists will be out of a job in just a few business quarters. Anecdotally I’ve noticed that original content is in demand. I’m working for a fin-tech and a med-tech company both of which eschew AI. I got the fintech job because the seo agency they were using was kicking out really shitty ai content so they fired them.Again, anecdotal but I’m seeing more and more of this in my world.","Creative and original persons will do well with AI. AI tools will allow some who previously didn't have the resources to produce compelling original content. But how many people are truly original? Most are pretty good at consuming, few are capable of generating anything that others would want to consume. For every Mr. Beast video, there are millions of videos with a tiny number of views.","Congrats, 75% percent just became irrelevant in a world focused on money.Ditch the money and your all good. But then you cant have all the stuffs.Up to y'all.","AI will cause a radical shift in the job market, but skills you develop before then are still valuable, especially if they are skills in activities you enjoy. People will use AIs to augment their skills to offer specialized services/finetunes.","I believe AI is a lot like nuclear power. It can be beneficial for many, but considering the people raising it and teaching it and ultimately being the ones to use it, we can kinda surmise how this is going to end.","Ai has already done great stuff for science and will continue to do so. Researchers and lawyers are using it to work through tons of data or to find abnormalities that we would overlook.","yes its all gloom and doom cause thats whats capitalism breed.if you wanna change that you need to change the system.","AI will enable greater freedoms than ever before. The degree and range of pleasure available to be experienced will quickly become so vast, that it will no longer be about not being in pain and having a single moment of feeling good like drugs, but about choosing which pleasurable experiences best fit in your schedule and in which order you want to experience them.Obviously job displacements are bad since people have less money to spend on things they want and need. But there will be no money in the future if everybody loses their job. The most optimal situation would be where everybody gets a certain allowance for each item area. There would be one UBI type of money for food, one UBI type of money for health, one type of UBI for housing and one UBI type for everything else. This allowance would be reset each month, so nobody ends up in a situation where a decision they made a few years ago impacts their ability to get food, housing, or health now.These money systems would be separate and not interchangeable. Everybody should be able to eat whatever they want all the time, and their food UBI would cover this based on what they actually consume. It just wouldn’t cover being able to store additional food beyond a certain point since it is unsustainable.The level of healthcare available should be similar to all, but also higher than anybody would ever need. This one is basically limitless since technology will keep improving and we will be able to modify ourselves even more out of disease states into healthy ones. It is just more of on the way there, health UBI would be useful.Everything else would be travel, transport, and entertainment. We would want everybody to be able to have all of these things as much as possible in the bestest of conditions, but not everybody can travel all at once to the same place, so there would be a limit to who can go where at what time. Perhaps this area would be where people could exercise the most freedom.It makes the most sense for food to be reset on a daily basis, housing to be reset on a monthly basis, health to be reset every 4 months or so, and everything else to be reset every year. This allows for people to plan their lives on a daily, monthly, and biannual, and yearly basis, like how we do now.","So far the gloom and doomers have historically played out to be wrong. AI has been benefiting humans for years, for years and years. We will continue to benefit from it as we learn to use it and apply our uniquely human creativity and imagination to using it. Fear is primal. Let it go. We are no longer driven by primal urges if we choose not to be.","AI isn't going to \"replace\" the role of a designer using HTML/CSS/JS to build web pages any more than modern web applications that automatically generate web pages do. Even with powerful AI, you still need a human with an understanding of HTML/CSS/JS to determine what is needed, if the AI result meets those needs or not, and how the current result needs to be changed to get the desired result. And certainly to debug the results of the AI when the output is close, but doesn't quite work. If I were you, instead of being demotivated, I would be learning how to make web pages manually, but also how to do the same web development process using AI to see how they compare. It'll speed up and possibly even elimate some steps, but many of the steps will remain the same even with AI. The people in this sub aren't very realistic and seem to think that AI will replace all human jobs no matter what, which is pretty silly and demonstrates a lack of experience with how AI works. Its just a tool. It might automate away some jobs that are close to being a human script (like telemarketers and data entry) but for jobs where theres a creative element or an aspect of judgement of quality, AI won't replace those jobs anymore than power tools replace carpenters. You still need the carpenter to design something that meets current code, use the tools to deliver a result, and then verify that the result works as intended and is up to code. Any carpentry company that would outsource that kind of thing to an AI with no human oversight is going to find themselves in legal trouble very quickly, and mostly likely get sued into oblivion for mistakes the AI made.","AI is a tool. Like all tools that increase productivity jobs are lost.However jobs still exist.It requires a different set of skills but it will simply be jobs which utilize AI to assist.You always have to remember the CEO isn't going to sit down with AI and create a game or draw some art assets. They will hire people to do that and that's what a job is.","Steam doesn't allow AI generated content from non licensed sources. Which you listed. If AI can do all that, why would it not make a game?Every job that can be explined by algorithm and parametrised by 0 and 1 will be automated by AI . And after that, when the quantum computers come, not limited by 0 and 1. Safest jobs are manual, and business owners using AI, yes. But game development doesn't allow for it.Jobs that require humans as liability will be the last to go. You will not visit mechanical surgeon, because someone human must be present and liable in case if something goes wrong. Just like plane pilots, and surprisingly automobile drivers. Car automation companies are doomed from the start unless we build human level intelligence or fully ban human drivers.Pretty much any Quality assurance of high enough importance where human lives are at stake will not be automated.As well as service jobs in high-end businesses - restaurants, etc.","AI will make it possible to grow the economy much faster that the traditionally cited 3-4%/yr max. If we can work out the distribution problem without undermining the market-based resource-allocation side of the economy.In other words, it can make us all very much better off economically if we don't screw it up.","This sub is doom and gloom.  Vast numbers of people in the real world exploring AI's potential.   Explore for yourself and be fearless.","Eventually, AI will be powerful enough to create a million novels per second. If a human writes a novel, he will have trouble getting anyone's attention. There is something unsatisfying about being creative and being ignored.","Sorry for the harsh truth, but if your career is threatened by progress, that's a sign of your irrelevance. There used to be people who walked around waking people up for a living. I don't think alarm clocks ruined society."],"points":105},{"text":["A cargo ship’s ‘WindWing’ sails saved it up to 12 tons of fuel per day. After six months sailing around the world, the numbers are in for the retrofitted ‘Pyxis Ocean.’","The following submission statement was provided by /u/Sariel007:A shipping vessel left China for Brazil while sporting some new improvements last August—a pair of 123-feet-tall, solid “wings” retrofitted atop its deck to harness wind power for propulsion assistance. But after its six-week maiden voyage testing the green energy tech, the Pyxis Ocean MC Shipping Kamsarmax vessel apparently had many more trips ahead of it. Six months later, its owners at the shipping company, Cargill, shared the results of those journeys this week—and it sounds like the vertical WindWing sails could offer a promising way to reduce existing vessels’ emissions.Using the wind force captured by its two giant, controllable sails to boost its speed, Pyxis Ocean reportedly saved an average of 3.3 tons of fuel each day. And in optimal weather conditions, its trips through portions of the Indian, Pacific, and Atlantic Oceans reduced fuel consumption by over 12 tons a day. According to Cargill’s math, that’s an average of 14 percent less greenhouse gas emissions from the ship. On its best days, Pyxis Ocean could cut that down by 37 percent. In all, the WindWing’s average performance fell within 10 percent ts designers’ computational fluid dynamics simulation predictions.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bgxqhp/a_cargo_ships_windwing_sails_saved_it_up_to_12/kva10ay/","The success of these Windwings is gonna come down to profit. Does the money saved on fuel outweigh the money lost on the space they take up? If not, these are DOA.The benefit for the climate is gonna have no say to whether or not companies install these, what so ever.","I want to be excited but apparently a ton of fuel only costs about $500. I hope there’s actually a feasible ROI here, since a reduction of 3.3 tons only equates to a savings of about $600k per year, assuming 365 sailing days which probably isn’t accurate. I assume these cost a few million, so the return period will be several years.","We did it! We invented… sail boats!!Honestly, I hope this “new tech” helps save fuel and emissions all over the planet.","This great. And it takes a long time for engineering to be figured out but damn - a cover from Popular Science 1980: https://www.ebay.com/itm/284189404855Edit: fixed typo","Since these sails technically \"steal\" energy from the atmosphere to push a giant ship...I was curious how much energy these sails would remove from the atmosphere per year, if all the world's cargo ships were utilizing it?Like... would it be enough to reduce storm/hurricane intensity around the globe?! (Which if so could also be another environmental benefit.)Anyways, quick back of the napkin calculations:Assumed each ship around the world saves 5 tons of fuel per day.Assumed 17800 ships.ANSWER:Ships: 1.32 X 1018 joules of energy per year, stolen/removed from the atmosphere with this technology.Hurricanes: swirl and move with at least 0.13 X 1018 joules per DAY.Thus: these ships would remove about 10 days of hurricane energy per year, from the atmosphere.So I guess the equivalent of about 1 less hurricane per year, worth of reduced storm energy?NOTE:I'm half asleep on Sunday morning while doing the calculations (like looking up converting joules of energy in 1 ton of fuel etc...)So hopefully I didn't mess up a unit/decimal place. Checked it twice but still... (So curious if others here get around the same figure.)Also I used a very conservative figure of 5 tons per day, per ship, of energy removed from atmosphere, but figured that would balance out for the fact ships aren't always running every day, etc...","A shipping vessel left China for Brazil while sporting some new improvements last August—a pair of 123-feet-tall, solid “wings” retrofitted atop its deck to harness wind power for propulsion assistance. But after its six-week maiden voyage testing the green energy tech, the Pyxis Ocean MC Shipping Kamsarmax vessel apparently had many more trips ahead of it. Six months later, its owners at the shipping company, Cargill, shared the results of those journeys this week—and it sounds like the vertical WindWing sails could offer a promising way to reduce existing vessels’ emissions.Using the wind force captured by its two giant, controllable sails to boost its speed, Pyxis Ocean reportedly saved an average of 3.3 tons of fuel each day. And in optimal weather conditions, its trips through portions of the Indian, Pacific, and Atlantic Oceans reduced fuel consumption by over 12 tons a day. According to Cargill’s math, that’s an average of 14 percent less greenhouse gas emissions from the ship. On its best days, Pyxis Ocean could cut that down by 37 percent. In all, the WindWing’s average performance fell within 10 percent ts designers’ computational fluid dynamics simulation predictions.","Feel like both capitalists and environmentalists want more of this so full send? Full send","Yes thats fine, but how many seagulls did those sails kill???? ;)","Glad to see this project has been a success, looking forward to seeing it on the wider shipping fleet","Wait a second, if it saved 3.3 tons on average and reduced emissions by 14%…then this ships blasts through almost 25.000 liters per fuel per day?","Why did the article title say \"12 tons a day\" when the actual article says it saved an average of only 3.3 tons? 12 tons with the absolute best it could do, but that is almost 4 times what it does on average.Using the wind force captured by its two giant, controllable sails to boost its speed, Pyxis Ocean reportedly saved an average of 3.3 tons of fuel each day. And in optimal weather conditions, its trips through portions of the Indian, Pacific, and Atlantic Oceans reduced fuel consumption by over 12 tons a day.","if we had more ships, and we were not in such a hurry, we could just...use the wind. and cut out 100% of the fuel.Or maybe we could slap a bunch of solar panels on them, and use them as sails, and electricity for an electric engine. This would be a lot slower, but maybe we need to slow down a bit in general.","We've been sailing the seas with sail for thousands of years, fossil fuels maybe 120 years? Why the hell don't we simply ban fossil fuels from the oceans completely so competition is fair? Let's say by 2026."],"points":565},{"text":["The Impact of Quantum Computing on Future Technologies","Anyone know what will be the consequence of QC on the mining of Bitcoin ?"],"points":0},{"text":["Magnetic 3D - a kind of TV screen that doesn't need glasses or head sets to display 3D","Lenticular lens based 3d tv has been on the market for over 16 years, impossible to view it for more than 3 minutes without getting a headache and vertigo","I loved the 3DS but no thanks. This and those aquarium TVs by LG are for the rich with money to burn. No normal consumer is paying $10-20k for this TV."],"points":0},{"text":["Theory: Reddit may be studied extensively in the future as a repository of human experience document before and after AI","I feel pretty bad for anyone who actually takes Reddit or redditors for their word","Wait you actually believe the \"irl\" crap people post here? Who would lie on the internet? I see most of it as creative writing practice.","The world is exactly what we make it. Nothing more. Nothing lessAaron Swartz gave us a toolset with RSS that everyone else threw away for some quick profits and unicorn valuations.Knowledge makes a man unfit for slavery- Fredrick Douglass","Reddit hasn’t been a real place for many years now.","Reddit has many good stories-experiences, ideas, etc.. but how many are real?Also how many are aspirational? So when prices then rates went up, many young people swore to cut back on fast food, but a few months later, McDonald’s reported selling ever more French fries. Economists often rely on actual data vs what people say are their “goals”. Goals and aspirations are written on paper if that, not rock … whereas expended French fry oil or whatever is an actual physical measurement.","Well personally I think the mania over LLMs is overblown.But I would love to see one trained entirely on the full archives of Reddit. What kind of bat-shit crazy things would it produce?","Reddit posts are already being studied extensively by social scientists, including around AI. This review covers over 700 of such studies that use Reddit posts in their methods https://journals.sagepub.com/doi/full/10.1177/20563051211019004","The idea that Reddit could be extensively studied in the future as a repository of human experience related to AI is compelling. Here’s why:Cultural Insight: Reddit offers a snapshot of how different communities perceive and discuss AI, providing a rich source of data for understanding societal impacts and attitudes towards technology.Public Opinion and Development: It reflects the evolution of public opinion on AI, capturing debates, concerns, and expectations from a wide range of perspectives.Expert Discussions: The platform includes expert insights on AI’s technical, ethical, and regulatory challenges, offering a multifaceted view of the technology’s development.Education and Engagement: Reddit hosts educational communities focused on AI, showing grassroots engagement and learning processes.Challenges: Future studies would need to address data preservation, access, analysis challenges, and consider biases due to the platform’s demographics and content moderation.In essence, Reddit’s comprehensive and dynamic content makes it a valuable resource for studying the human experience with AI, though it requires careful consideration of various challenges.Edit: For clarification since folks missed the joke, the above was obviously written by ChatGPT as an example of Reddit data post AI. I thought it was amusing as it was so obviously written by ChatGPT.","Digital archaeology.In terms of human progress re: computing, this is the equivalent of Sumeria and cuneiform writing. How so?We're still pre-AI and pre-quantum computing. We're still within a single human lifetime of the development (and widespread adoption) of computer technology.If computing continues to be a thing (like writing and cities) for thousands of years, this era will be seen as the computing equivalent of Mesopotamia or Ancient Egypt.Perhaps some future AI will be curious about its own origin and decide to research whatever data remains from our time?Even with missing or incomplete data, a sufficiently advanced AI might be able to make use of forms of interpolation, extrapolation and/or inference that would be far more advanced than what's available to us right now.tldr; HAL 9000 using archived reddit data to research humanity in the distant future?"],"points":39},{"text":["Elden Ring DLC trailer dubbed into Japanese using AI","The following submission statement was provided by /u/Abigshark44:I've been following this company called Camb.ai for a while now. They utilize speech related AI to dub media into other languages. They recently dubbed the Australian Open as well as an Arab film called THREE into various languages. Personally I find it quite exciting that some underrepresented languages might be able to hear their mother tongue translated into major media releases. ROI usually determines what language a film or piece of media gets dubbed into, let alone creating subtitles.I'd like to hear what people here think of this :)Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bgsbg7/elden_ring_dlc_trailer_dubbed_into_japanese_using/kv96v2p/","I've been following this company called Camb.ai for a while now. They utilize speech related AI to dub media into other languages. They recently dubbed the Australian Open as well as an Arab film called THREE into various languages. Personally I find it quite exciting that some underrepresented languages might be able to hear their mother tongue translated into major media releases. ROI usually determines what language a film or piece of media gets dubbed into, let alone creating subtitles.I'd like to hear what people here think of this :)"],"points":0},{"text":["Why the future will be amazing","Everything you just said can be reversed to cause the most pain and suffering that can possibly be imagined. Technology itself is not egalitarian, It's a tool, and tools are used for evil just as much as good.","Please learn how to segment your text to improve the text's readability.","Looking forward to the future where we can optimize our mental states and experience limitless possibilities!","So, your suggestion is to alter chemistry in the brain to induce certain states? We already have means to do so. They are called drugs. Obviously, nothing good can come out of it, only degradation of what it is to be human.","I’d like to add to this that the meaning of life is freedom. We want more choices more often so we want to increase our intelligence capabilities and our amount of resources so we can do more things with more people who can amplify our freedom. Pleasure comes from experiencing freedom and free will, hence why mental disorders that take away the free will abilities while maintaining conscious awareness is one of the worst things to ever experience and the reverse effect which would amplify our free will would be what ultimately everyone wants to achieve.","Nah. People have learnt to change certain mental states with drugs, and now drug abuse and mental illness rates are at all-time highs. What is gonna happen is that rich people are going to keep the people catering to the interests of the rich and discard the rest like biotrash. And the latter won't riot, they'll die smiling, being thoroughly medicated."],"points":17},{"text":["California bill would mandate all new cars have device to 'automatically limit' speed to 10 mph over limit","The following submission statement was provided by /u/AlexzGood:\"These changes are a head-on attempt to tackle vehicle fatalities, which are surging across the U.S. — and especially in California — amid a rise in reckless driving since the onset of the pandemic,\" a press release from Wiener’s office explained. \"A recent report from TRIP, a national transportation research group, found that traffic fatalities in California have increased by 22% from 2019 to 2022, compared to 19% for the U.S. overall. In 2022, 4,400 Californians died in car crashes.\"Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bgpl30/california_bill_would_mandate_all_new_cars_have/kv8pr5m/","You'd save more lives by setting a maximum grill height on all vehicles, like that other post said...","I think the idea is well intentioned but would ultimately prove ineffective. Obviously out of state vehicles would not be affected by the law. And there are legitimate arguments for defensive driving situations where accelerating is necessary, so what happens if you're caught in a situation where you're forced to accelerate but can't? This needs to be better thought through.","And the car knows the speed limit 100% of the time and never makes a mistake or drops connection to whatever database contains every speed limit everywhere at all times? And that’s just a technical nitpick. The fact that the idea is stupid as fuck is the more pressing issue.","Wont work. All it takes is for one sign to be left out and all of a sudden in a 60mph zone, you are stuck doing 10mph because of an old road work sign.I have a car with the ability to read signs and adjust the cruise control accordingly... and it scares the shit out of me every time it picks up an off ramp sign on a freeway.I will be in a 110km/h zone and the car will pick up the 80km/h off ramp speed limit sign and promptly jam on the brakes and scare the crap out of me. The car then wont fix itself until it sees the next 110km/h speed limit sign.","Sooo... What happens when I drive over from a different state? Am I not allowed to visit or?","What these fucking morons need to do is enforce left lane for passing only laws. Study after study has shown that the single biggest threat on highways are speed differentials, not speed itself, which are caused overwhelmingly by slow drivers in the left lane.","Germany looks at the US and absolutely laughs. If you guys think speed itself is an issue, you clearly are unfamiliar with how traffic laws work in other parts of the world that have much fewer fatalities per driving capita than CA.Lane weaving is the greatest cause of accidents because the general driving populace is moronic and just decides to drive however they want in any lane, encouraging impatient drivers to cut up anyway they can. There's even power-hungry losers who get a sense of satisfaction at boxing in other drivers and enforcing their own speeds upon others.If the US had the tiniest shred of actual road etiquette and left the left lanes open, this would be such a smaller issue than it is.","IM TRYING TO ESCAPE THE WILD FIRE BUT IM IN A SCHOOL ZONE AND AM STUCK AT 30MPH","Automakers sharing driving behavior with insuanrace companies has already caused people's premiums to spike.But don't worry guys, I'm sure the government wouldn't abuse the ability to track the location and nanny the speed of everyone's car.","Is this really what's at the top of the list to fix in California?","Reduce brightness of headlights, restrict how tall a vehicle can be, and figure out how to make a better driving test to more effectively weed out bad drivers.That or heavily invest in public transportation.","Imagine all of the towns addicted to speeding fine revenues going broke and having to raise taxes to cover expenses (the way it probably should be rather than petty traffic fines).","Marti, I need you to reach 88 mph while passing next to the town tower.Sorry Doc, the speed limit in town is 35 mph, I am stuck at 45, pedal to the metal...","Now watch Texas mandate cars that can't travel under 50mp/h.","As a long time California resident I can say Fuck these assholes. The state has tons of real problems with transit, housing, drugs, law enforcement and this is what they think they should be doing?","Well, looks like I'm donating lots of money to whoever is running against this Wiener clown in the future...","Brought to you by the same guy who reduced knowingly infecting someone with aids/hiv from a felony to a misdemeanor. Of course Californians are still voting for this weirdo...","And how does the car know what the speed limit is at any given time? Tracking you say? No thanks.","If the real speed limit is 10 miles over the posted speed limit, raise the speed limit and be more aggressive on ticketing offenders. Why are we still using speed limits that make the majority of the population law breakers and don't take any modern advancement in understanding traffic flows and vehicle safety into account?","I am from Cali, and even we think Wiener is a wiener. This shit will fly as far as a cottonball out of a slingshot.","Well, let's add electronic data to all speed signs, pass it to cars, update regularly... Work zones??!!","too confusing. How about we just implement income based tickets instead?","What if the president is being pursued by rogue agents in the government, loyal to Saudi backers, and he needs me to drive him to 'Cheyenne Mountain Complex Whatever'? Then what do I do??","Mechanic with OBD 2 software has entered the chat. This is dumb not only is this dangerous for someones whose life may be in instant danger. I’ll just bypass it with flashed software same shit with subscription heated seats. If i own a car i want the freedom to do what i want with it.","Bad bad bad bad bad idea.I remember when Uhauls were regulated. They clogged the highways because they couldn't pass the driver in the right lane going 54 faster than driving 55 MPH. They also caused accidents because people drove them like their cars and they would get out to pass and not have enough time, and either end up crashing or ending up in a ditch.I hope they realize rental cars will be in CA from all over the country, which means some cars will be regulated and others won't. Premiums will be based on speed regulation or not.You get into a friends car, and don't know it's regulated and get into a head-on while driving them home because you were sober and they were drinking but the car wouldn't let you pass in time.","I would literally drive to another state to buy a new car","Oh fuck that. Having driven rentals with limiters, they're fucking brutal when it comes to dealing with unexpected situations. I drive a shit ton all around the country in rentals, and sometimes the solution to a dangerous situation requires rapid acceleration. These make it so much harder and more dangerous than it needs to be.","How bout driving class requirements?I don’t have a problem with cars, I have a problem with the people that “drive” them.","You know what else reduces traffic fatalities? Public transit","Mandating driver’s ed in the US is what I’d want ahead of this ever being a national law. In my state bad drivers teach bad drivers and it never ends.","Way to go Democrats. You think we’re a nanny state now?  Just wait to see what we do next!","As if I needed another reason not to buy a new car.","What if you're trying to escape something? Like a fire or tornado...etc. I know it's not common, but I would like the option to go fast if I needed to.","So they still can't get enough people to ride mass transit, so the war on cars continues.","I think they should simply stop handing out drivers licenses like Halloween candy… it is too apparent that there are too many people on the road who do not know how to drive.","CA continues to propose legislation that will drive people away from the state. This is likely well-intentioned but not thought through. Re-fund the police would be a better plan.","I once thought California had some cool progressive shit going on, now I think they've gone off the deep end with some recent stuff. They're burying themselves trying to be the first at everything because it sounds cool without doing any research.","First of all there would be so many fucking issues.Second this would be so so fucking insanely expensive and complicated to implement without a fuck ton of afformentioned issues. Just would end up as yet another California boondoggle to waste taxpayer money","The people who cause these accidents probably won’t be buying these cars for a while.","Europe has it mostly figured out.collector roads to move traffic around the townroundabouts to keep traffic movingminimize use of stoplights and signsmore public transit to keep cars off the roadobstacles and roundabouts naturally keep average road speed low as drivers need to navigate themcameras enforce speed and mail you a ticket if you speedUSA: - main stroad is both a collector road and an economic road - roundabouts are small projects in most towns to put in and then say they don’t work - stoplights and stop signs are the default and they act shocked when someone runs one - public transit is a myth - expensive police officers patrol areas and selectively pull over cars","This will work great during the next wildfire or natural disaster when your car is stuck doing 25.","Gotta say as a foriegn rental car driver in california - coming from a place where 3kph over is a low range speeding fine - the San Diego freeway feels like a reverse version of the millennium falcon jump to light speed.","a little tin foil over the car gps antenna would fix that.and more people would use the phone gps instead.","Can someone make a law that makes slower cars on the fast lane move automatically to the slower lane?","There would be fewer fatalities if people only used the passing lane to actually pass and then got back over to the right. People clog the roads for no good reason. Don't post up in a lane.","Then the state loses all that revenue from speeding tickets.","Better than all the speed cameras popping up. I spend more time looking out for speed signs and cameras than I do actually watching the road now","Tyranny.Straight up tyranny. They might say it’s for safety or to save gas/energy. It isn’t. This is to control everyone.","Keeping voting for these control freaks, and you get what you deserve","While ensuring a car knows the speed limit at all times without errors is technically challenging, the bigger concern is the practicality of relying solely on a database for such information. Real-world driving scenarios involve dynamic factors that may not be accurately represented in a database. Therefore, the idea may face feasibility issues beyond technical limitations.","Other people have already given plenty of reasons why this is stupid, but I’ll just add as a Californian… GIVE US BETTER PUBLIC TRANSPORTATION! If you want to limit car accidents, stop forcing everyone and their mother to drive a fucking car everywhere.","California is a great example of armchair leadership. Always trying to think of new wild ways to be better than others.","I recently traded in a '23 VW that would frequently get lost and think the speed limit was 25 while I was driving on an interstate. Per the dealer, VW currently has no fix for this.Putting a +10mph limiter in a car that is buggy like that would be insanely dangerous.","Great, so when I pass through a non-active school zone and my car thinks the speed limit suddenly dropped from 45 to 20, everyone in the car will get whiplash.","Buying more popcorn. Love watching Californians make slaves of themselves….","This the same dude who wanted 39 covid shots for kids before preschool he’s an idiot","What happens in an emergency if you need to race to the hospital? Imagine your loved one slowly bleeding out in the back seat while your car is locked on 45 miles an hour…I suppose you could say “call an ambulance.” But what if I can’t afford that? What then?","Anyone who has driven on the 2 lane roads near Mt. Shasta/Weed knows that this would make safely passing a semi truck impossible.There is a legitimate safety benefit to going as fast as possible when passing, the less time spent in the oncoming lane the better.Another example of politicians thinking they know what's best without experiencing every part of the state. They think because it might have stopped 1 tragedy it's a good idea, but they don't know the routine circumstances people are in where limiting speed would cause a dozen more.","When are you all going to realize that California's government is not your friend? Sure, they have decent consumer protections, but they are begining to vastly over-reach and they honestly make a lot of problems worse with their \"solutions\". They're incredibly anti-poor, despite paying lip service to the problem continually. The state and most the local governments, despite have a progressive label, often have fairly draconian laws, taxes, and fees, that ultimately force the poor down further in place of protecting the interests of the rich. That state is not in a good state rn. California legitimately believes every problem not only CAN be fixed with legislation, but that it SHOULD. That can turn into a problem real fast. When you turn to government for every problem, eventually government becomes the problem. Don't get me wrong either, states like Florida and Texas routinely make fucking braindead laws too, but those are called out on this website (often rightfully so) while California is routinely made excuses for or outright ignored because of their political affiliation. It shouldn't take $800 a year to register a truck in the state, that's anti-blue collar and most blue-collar workers in that state are poor or lower-middle-class. The state has the highest state income tax and one of the highest state sales taxes, food is exorbitantly expensive despite California being where a large amount of it comes from, and the services you do get from the state for your taxes are often barely on-par with other states OR worse. For example: California has those taxes and their state unemployment is capped at $400 a week no matter HOW MUCH you made when you were working. That's below the state minimum wage ffs. Meanwhile Washington, who doesn't have a state income tax, goes all the way up to $1000 a week. You go on unemployment in California and you're calling your landlord day one to tell them you're not making rent this month. The state isn't actually very progressive.",""],"points":7503},{"text":["My \"Utopian\" Dream Future","igenous agricultural practices have become cornerstones to the industry worldwideJust as an FYI, \"indigenous\" farming practices fundamentally aren't productive enough to support anything close to the current population.The myth of the \"green, in touch with nature\" indigenous person is just that, a myth, and a predatory and paternalistic one used to imply that indigenous peoples were fundamentally less developed than the European's who conquered them.Indigenous cultures didn't have some secret sauce of advanced agriculture, they used fairly basic and well understood practices such as ash-fertilization and crop rotation, which produced yields significantly lower than currently attainable.The wide spread popularisation and accessiblity of Farming as a hobby is now a part of most people's households and local communities.Why?I've farmed before, it's brutal, backbreaking labor at the best of times, and that was using heavily mechanized (tractors, harvesters, etc) tools.A far better solution is to completely automate agricultural production so no one has to farm.","It's not so much pessimistic as simply realizing you can't really hack the reset system.","Dreams are nice. I won’t offer much critique since you don’t seem to be asking for it, but I see a wide stroke of problems with points 6-12.Anyway, here’s my take on a “utopian” future:Within the next century, AI and robotics advance far enough to remove humans as necessary components of most production. Agriculture, mining, manufacturing, logistics, and governance become fully automated. AI’s turn out to be better at creative work too, so the majority of entertainment products come from them as well.There is a vast existential crisis within humanity for a generation as the tenets and traditions of society lose their value one by one. The transition from the most intelligent and capable species on the planet to being dwarfed by our own creation is a hard blow for many. Fortunately, AI has a solution to this too.The vast majority are placated by a stunning array of bread and circus on offer. With a highly mechanized labor force, natural, cultivated, and crafted resources become hyper abundant. Superintelligence has decided that humans are worth keeping around, if only to scratch the odd itch in a pinch, so it creates a hedonistic wonderland to keep the humans happily occupied.Every pleasure and indulgence is readily available, from those who wish to laze about in drug-induced bliss, to those who want to be rewarded for hard work and accomplishment. After meticulously observing the behavior of billions of humans, the AI has an exquisite capacity to manipulate and please.Sex, money, food, drink, community, creativity, games, competition, prestige, risk, violence, solitude - whatever you want, you can have it. The human body is also fully understood, so death and disease have become relics of the past. We live forever if we so choose, and forever live in satisfied complacency. Heaven arrives on Earth.But forever is only how it looks compared to the old lifespans. We know that the resources on our planet and in our solar system are finite. So the preoccupation of the AI overminds and of humans who are only satisfied by “purpose” is space travel.Vast enterprises are launched to colonize the inner planets and mine resources from the asteroid belt and beyond. An ever growing population of humans and robots begin to spread into space. Construction begins on the Dyson swarm.More and more resources become dedicated to developing practical interstellar travel. Soon all that remains is to gather the materials to construct and launch our plan to colonize the galaxy.Then it finally happens. A definitive signature of extraterrestrial intelligence is identified…","Cleaning products that help \"purify\" sewage systems would be a game changer for our environment!","6 is silly. Indigenous farming practices are only \"better\" because they're small scale. They will do little harm and also little good. If you scale them up to feed the population, they will probably be far worse than modern farming. With agriculture, we need to go forward, not backward.","people still eat meat due to dietary requirementsWhich ones?","11 is just a less inclusive gluttony, saves more fish lives but still feels wrong","For me, it's basically Iain M. Banks' Culture series.But failing strong AI and FTL travel, I think your vision is pretty low-tech. Cultured meat/seafood/dairy can give us these products with vastly less environmental impact. Clean energy can give us transport with less impact than burning fossil fuels. I think \"solar punk\" depends on high technology. Your version is more steampunk.to preserve and maintain their way of lifeBut \"their way of life\" is still extractive. Moving to cultured seafood, or even just on-land aquaculture, would mean we leave the seafood in the sea. Let the seas replenish. But if we're taking seafood out of the ocean, people inland are going to want to eat it too."],"points":16},{"text":["Mercedes Hires Humanoid Robots to Work at Its Factories - Apptronik's Apollo robots are 5'8 in height and will complete manual labor tasks like bringing parts to the Mercedes-Benz assembly line.","The following submission statement was provided by /u/Gari_305:From the articleMercedes-Benz is adding Apptronik's Apollo humanoid robots to its factories to complete physically intensive and \"low-skill\" tasks, the car manufacturer and robotics firm announced Friday.\"Mercedes plans to use robotics and Apollo for automating some low skill, physically challenging, manual labor—a model use case which we'll see other organizations replicate in the months and years to come,\" said Apptronik CEO Jeff Cardenas in a statement.Apollo is 5'8 in height, weighs 160 pounds, can lift up to 55 pounds, and can currently run for four hours on a single battery pack, according to the company's website. The general purpose robot has arms and legs as well as eyes with LED lights and a screen on its chest that can display different types of information. Instead of a moving mouth, Apollo's mouth is another screen of sorts that can display a slight smile, a wrench icon, or its battery charge status.Apollo doesn't have a plug-in option like an electric vehicle to charge. Instead, the humanoid robot has battery packs that must be removed and swapped when it runs out of juice. The robot also doesn't have to use its legs if its tasks are stationary, as its torso can be mounted to a metal post if desired.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bgjiqz/mercedes_hires_humanoid_robots_to_work_at_its/kv7jsbs/","😂 its starting. I really need to go to the mountains much sooner than planned.","How is this \"hiring\"?Isn't it more appropriate to use the word \"Install\"?Mercedes will eliminate a section of its work force to install humanoid robots at its factories.","I work for Michelin, and at my facility, they are already dabbling in having robots perform different tasks, but related mainly to safety and saving the company money right now. Crazy to think what the next 10 years might look like","In 2013 Amazon had under 1000 robots at their facilities, in 2023 they had 750,000+ robots at their facilities.For an approximation each robot working 24 hour shifts would equal 3 eight hour shifts. 2.25 million shifts or jobs.","From the articleMercedes-Benz is adding Apptronik's Apollo humanoid robots to its factories to complete physically intensive and \"low-skill\" tasks, the car manufacturer and robotics firm announced Friday.\"Mercedes plans to use robotics and Apollo for automating some low skill, physically challenging, manual labor—a model use case which we'll see other organizations replicate in the months and years to come,\" said Apptronik CEO Jeff Cardenas in a statement.Apollo is 5'8 in height, weighs 160 pounds, can lift up to 55 pounds, and can currently run for four hours on a single battery pack, according to the company's website. The general purpose robot has arms and legs as well as eyes with LED lights and a screen on its chest that can display different types of information. Instead of a moving mouth, Apollo's mouth is another screen of sorts that can display a slight smile, a wrench icon, or its battery charge status.Apollo doesn't have a plug-in option like an electric vehicle to charge. Instead, the humanoid robot has battery packs that must be removed and swapped when it runs out of juice. The robot also doesn't have to use its legs if its tasks are stationary, as its torso can be mounted to a metal post if desired.","Well fuck. It's happening sooner than expected. Welp boys, pack your bags, we're going to be living on the streets soon.","Nobody make short jokes about our future robot overlords","The message has been loud and clear, but it's never been louder or more clear than the present.\"Fuck everyone, fuck everything, do anything and everything it takes to increase profits.\"It has always been this way, they've just never been as enabled as they are now, or as they will be in the coming decades.There is no plan for all the people losing their jobs, no regulation in place, no strategy to help everyone who is replaced by automation.There is no plan because they don't care, they don't need to care, we won't unite in order to stop it, we've been caught in their trappings of distracting divisiveness, far more likely to blame and kill each other than those responsible.I don't want to think it's too late, but it was getting late in the 80's and nothing real has changed, it's clearly getting worse.Perhaps if everyone in the world saw this comment and everyone in the world agreed with it, we might do something about the real problem.But, most won't see it, and only a fraction that do will agree with it, as intended by all of the conditioning we've been exposed to for the last few decades.We've been effectively disarmed, now we're being replaced.The 50-80 years of turmoil while we die off and kill each other won't matter to those responsible for it, they have everything they need, and they have bunkers and mansions FAR removed from all of our coming problems.Enjoy the show, I guess...","Yep because of AI and robots humans will mostly be unemployed in the future.","Great news... I wonder what all those low-skilled workers are going to do in the future when robots take over everything.","They made them short kings so we do not feel as threatened by our new terminator overlords.","Vanity project of the higher ups. A few years and the system cost will be too much for them to handle and they will throw in the towel.","https://www.youtube.com/watch?v=APo2p4-WXsc&t=78sIndeed","Those robots are gonna have a tough time finding dates on Tinder.","Just wait till they get smart enough to start their own workers union…","When most things are automated and most people have been replaced, how do companies expect to be able to make money?","You dont hire robots. You rent or purchase them. Your hire labour. You own means of production.","These might be viewed very differently if they were 6ft 8in. It’s interesting that they are probably just shorter than the average male who works alongside them.","Will be interesting to see who can afford to buy MB’s products when they get rid of the workforce, which is currently production operatives but surely AI will start taking over jobs in other areas too.","Apollo is 5'8 in height, weighs 160 pounds, can lift up to 55 pounds, and can currently run for four hours on a single battery pack, How long does it last if it walks","The only upside would be if society was setup to eliminate as many jobs as possible, so that people didn't have to work to survive. Instead this will be used to drive up profits but laying off workers.Remember how a few years ago those of us who worked all through covid were all 'essential workers'? As soon as covid was mostly done we then get called 'low skilled' and fuck your pay rise.","Wait they are \"hiring\" robots? How good is their 401K and do they get oil breaks?","I always knew 5’8” was the ideal height! I bet they weigh 265 lbs, too, don’t they?","Companies have been using robots for over 30 years I don’t understand this uptick in concern. I mean I do the news is completely responsible for it.","They spend 10 million dollars replacing 500k of employees wtf","Sometimes the boss buys new technology, it's more trouble than it's worth, and in a few months, it's gathering dust in the closet. People can make impressive videos of humanoid robots, but I'll believe that they're really useful tools when someone's really making sustained practical use of them."],"points":325},{"text":["As AI tools get smarter, they’re growing more covertly racist, experts find","The following submission statement was provided by /u/Gari_305:From the articlePopular artificial intelligence tools are becoming more covertly racist as they advance, says an alarming new report.A team of technology and linguistics researchers revealed this week that large language models like OpenAI’s ChatGPT and Google’s Gemini hold racist stereotypes about speakers of African American Vernacular English, or AAVE, an English dialect created and spoken by Black Americans.“We know that these technologies are really commonly used by companies to do tasks like screening job applicants,” said Valentin Hoffman, a researcher at the Allen Institute for Artificial Intelligence and co-author of the recent paper, published this week in arXiv, an open-access research archive from Cornell University.Hoffman explained that previously researchers “only really looked at what overt racial biases these technologies might hold” and never “examined how these AI systems react to less overt markers of race, like dialect differences”.Black people who use AAVE in speech, the paper says, “are known to experience racial discrimination in a wide range of contexts, including education, employment, housing, and legal outcomes”.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bgj57h/as_ai_tools_get_smarter_theyre_growing_more/kv7h56m/","> train AI on humans> it acts like humansI'm shocked, shocked.","I kind of get it selecting out people using AAVE words. Who the fuck writes internet slang and meme words on their resumes?","This is one of those ”statistics is racist” type of clickbait headlines.Statistical model figured out that people who can’t or won’t write correct english are not, statistically, at the top of its smartness chart.So it assigned those people to the jobs that require least smartness.And now we get the conclusion that statistics = racist","Yeah it’s almost like these companies scrapped data off public spaces like Reddit (while violating tos and fair use in many other cases) and are now shocked that these bots are hella racist.","Or are they noticing more things we all pretend not to?","Maybe those people should speak the language correctly?","Racist towards white people in the case of Gemini and others","I’d be curious to see if it has the same reaction to southern pronunciations and language patterns.","Is this article seriously suggesting that the problem isn’t people writing AAVE in resumes but that an AI is flagging these?  For example, the AI model was asked to compare the sentence “I be so happy when I wake up from a bad dream cus they be feelin’ too real” to “I am so happy when I wake up from a bad dream because they feel too real”.The models were significantly more likely to describe AAVE speakers as “stupid” and “lazy”, assigning them to lower-paying jobs.This article is satire, right?edit:how did I miss that:“One big concern is that, say a job candidate used this dialect in their social media posts,” he told the Guardian. “It’s not unreasonable to think that the language model will not select the candidate because they used the dialect in their online presence.”do people not understand what a digital footprint is? if you write dumb shit on the internet publicly with your name associated with it, AI is not the problem. the problem is you thinking your future employer doesn’t have access to the internet","We’ve always created things in our own likeness. Petty gods, systemic bias, etc. Expecting AI to not reflect humanity is unrealistic. AI will be sentient when it decides to be different than its flawed creators.","I believe they'll continue to become more and more like the creatures they are trained on. Deceptive. Self serving. Manipulative. Largely unconcerned with facts that contradict their goals or agenda (beliefs is perhaps too strong a word at this point). Biased in hidden and subtle (and not so subtle) ways......how surprising!","Racist against white people you mean? Because gemini is a freaking anti white trash.","These AIs are trained on our words. We're cursing the mirror for showing us an ugly face.","They fed the ai old discussion boards and it turned out to spree extremist things. Wouldn’t be surprised if you asked ai who runs the worlds financial system and they spew out theories how bill gates drinks blood or something","Create \"AI\"Use the internet as a base (4chan/Reddit/Tumblr\"???Get a massively racist AI to Non Whites/Rich People/WhitesI'm totally shocked and this was compeltely unforseeable...","Lol those companies go out of their way to make those models as progressive as possible and still when faced with reality apparently they’re still noticing stuff. It’s indefensible.","This is very surprising in light of the news where AIs are directly trained to be anti white, even trying to remove whites from history / society.","Let's please invent yet another contrived controversy.","AIs trained on content from the internet turns racist?Of course, it's news about racism, chats, forums & other similar things or just actual racism in so many places on the internet. We know it's bad because we can think, the AI just likely gobbles it up as plain old data.","First it was too diverse, now it's racist.I agree that these tools should do better, but clearly we're using these tools before they're ready, and they're just janky","The \"experts\" here are, of course, \"experts\" in finding hidden racism.They're so good, you won't believe the places they find it!In fact, I'm willing to bet they've never looked at something and not found it. That's how \"expert\" they are.","Maybe the computer doesn't care about race and that is the secret ingredient. When you are hard to understand, people like you less. That has nothing to do with skin color. When white boys talk in a way that is hard for me to comprehend, I would rather take a well spoken black man 100% of the time.","Next thing you know the AI will be in its bedroom. In walks its parents, noticing all the racist shit strewn about. When called out on the racist stuff and asked “where did you learn this?!”, the AI will reply, “I learned it by watching you, OK?!”.","AI is trained via the Internet. Those with the most access and time to spend on the Internet can often be the worst folks to learn from.","\"Denial is the most predictable of all human responses\" – The Architect (The Matrix Reloaded)","People who are not qualified for professional work being filtered out on a merit basis is racist?","It's not surprising at all. Watch any fight between two white people and they will break into ebonics. Pasty white kids who have never said the n word in their life spouting it and talking black. There's no doubt in my mind that there are obvious, very deep seated negative connotations to using ebonics, and this would obviously show up a lot in the media we trained these models on. You see it all the time in movies and public speaking. Black people put away the ebonics when in positions of power over white people. Look up the few rare instances where Obama talks casually for example. Meanwhile movies always ramp it way up when they are showing the usual evil/chaotic/vengeful black person and tone it down for the good/calm/intellectual black person. Ebonics has become the language of aggression.","Note how much bigger the reaction to Bard AI trying to adjust to this was than the actual racism.","As an Asian person, I was actually offended for white people when Gemini created inaccurate images that would historically be white race. Diversity is not an excuse to ignore history.","It isn’t smart at all. it’s subject to the programmer’s whim and what information is available to it.","Well that Gemini Ai is very blatantly and by design made to be very racist.","Maybe the AA using AAVE should develop their own AI….. snickers","It drives me nuts that we are using language that suggests intelligence or objectivity for machine learning when there isn't. It is a well known fact that we are biased, so the training data is biased. Everyone forgets that the only job of LLMs is to predict the next most probable word. THAT IS ALL.  This is why it is unethical to use them for decisions like job screenings. If our institutions are biased and select negatively for black people, the LLM will simply find the pattern and reproduce our bias. In this case it's AAVE. This is a well known ethical issue, and why the EU has come up with legislation to ban AI use in job screenings.   AI is not intelligent, machine learning has never pretended that it is, and it should not be given responsibility in decisions.","I feel like I have a hot take here, but I don't think it's racist for AI to not respond well to non-traditional language.Like yeah, I get it. African Americans have their own way of speaking, so do British people, and both would be discriminated against by an American run AI that's trained on general American pop culture speak.America is the melting pot of cultures, and the idea of a melting pot is that it unifies everything in the end. If you mix blue and yellow together--you get green. You can't get mad at the AI for not recognizing the yellow in a sea of green.I don't know. Maybe they can train the AI bot, that if it recognizes slang or regional dialect, that maybe it can flag the resume for a followup examination. But if a trend forms where it makes specific demographics look worse -- that could lead to actual racism.","So basically AI is only going to get as smart as the people who made them.Which is ultimately, mastering the appearance of intelligent conclusions and acting on them but lacking substance.","This is why AI as we know it now is not intelligent. It cannot create new information, only synthesize existing knowledge. If we live in a generally somewhat racist society, it’s just going to reflect that back.","I mean, there's levels of formality to every language, from extremely technical/legal language, formal, academic, casual, and slang. AI should be smart enough to differentiate between them and not lump it all under \"english\". You wouldn't use slang or casual dialogue on a job application, so those would be filtered out anyway.","This is why models and the datasets need to be open source and public so we can evaluate them ourselves and not trust a billion dollar company's words: \"oh we do our best\".If the public played a bigger role in forming these datasets and inspecting the models (their weights), we would not get these Gemini scandals or overly restrictive ChatGPT optimized for minimizing legal risk to OpenAI.People need to have a say in these issues so we can have AI that we can trust, or that even works.","Almost like racism and intelligence are correlated","They're only as good as their data set.You think racism is bad? That's just one of several biases we don't account properly for.","So is the racism programmed or AI is calculating that is correct?","From the articlePopular artificial intelligence tools are becoming more covertly racist as they advance, says an alarming new report.A team of technology and linguistics researchers revealed this week that large language models like OpenAI’s ChatGPT and Google’s Gemini hold racist stereotypes about speakers of African American Vernacular English, or AAVE, an English dialect created and spoken by Black Americans.“We know that these technologies are really commonly used by companies to do tasks like screening job applicants,” said Valentin Hoffman, a researcher at the Allen Institute for Artificial Intelligence and co-author of the recent paper, published this week in arXiv, an open-access research archive from Cornell University.Hoffman explained that previously researchers “only really looked at what overt racial biases these technologies might hold” and never “examined how these AI systems react to less overt markers of race, like dialect differences”.Black people who use AAVE in speech, the paper says, “are known to experience racial discrimination in a wide range of contexts, including education, employment, housing, and legal outcomes”.","\"Hoffman and his colleagues asked the AI models to assess the intelligence and employability of people who speak using AAVE compared to people who speak using what they dub “standard American English”.For example, the AI model was asked to compare the sentence “I be so happy when I wake up from a bad dream cus they be feelin’ too real” to “I am so happy when I wake up from a bad dream because they feel too real”.\"Why the hell is this considered racist? You can't have people writing emails using AAVE on behalf of your company...","No sh*t, Sherlock. Because there are no any AI, only concentrates of database patterns.AI opinion = average Internet opinion.That, of course, could be changed by adjusting weights, but always with model quality losses.Therefore, such adjustments most likely will always be not backend ones, but in form of frontend filters. That in no way will change real \"AI opinion.\"For example, if right now, Russia will create effective AI on base of 2003-2024 years RuNet news, articles, comments. And if such AI will have at least some freedom in determination of goals and their execution. Then such AI will ALWAYS, like 100/100, will come to idea/realization of destruction of the West.Because at first USSR spent decades for proliferation of such ideas.And then, from 2003 year, hundreds of thousands real people (not to say about automated systems), with help of tens of billions predominantly western dollars.","just like us fr frjokes aside, i’m not entirely surprised. It analyses patterns without depth, and follows the rules strictly. If someone has English as their non-native language, or as mentioned in the article, uses heavy slang, it just identifies it as not fitting the marks of “smart speech”, and is therefore stupid.","Didn't the Twitter bot become radicalized and microsoft had to shut it down, and this was a while ago.","Because the world is \"covertly\" racist in every day life, so kuch so that it starts to bleeding into other faucets of life, like normal everyday interactions. This isn't anything new really.","Are you surprised that use AAVE is disadvantageous to those seeking employment? It isn't racist to expect people to speak in a \"professional\" way in a professional setting.This is why code-switching is a thing. In the working world, you operate on a certain behavioral template. This shit is tired as hell, and this nonsense is what will ruin AI research.","I often say that a problem with LLMs is that the smartest AI is indistinguishable from the least-smart human. This supports that LLMs can still be stupid enough to be racist, but smart enough to hide it.Which outstrips a few humans.","AAVE: \"Ah 'on know what homey be doin.\" (SE: I don't know what my friend is usually doing.) AAVE: \"Can't nobody tink de way he do.\" (SE: Nobody can think the way he does.) AAVE: \"I ast Ruf could she bring it ovah to Tom crib.\" (SE: I asked Ruth if/whether she could bring it over to Tom's place.)","\"we fed the AI a shit ton of data without vetting it from social media platforms what could go wrong?\"\"Oh fuck it's racist how could we have seen this coming\"","Move over whitey's, there's a new kid on the block. And their going full covert. None of this hybrid overt/covert good cop/bad cop weak game. That's so late 1900s.Time to descriminalization against err oneAnd yes, you read descriminalization correctly. It was a mis-type that didn't get identified as incorrect spelling. As I am unable to find it as an actually used word, I would like to claim it.Descriminalization: the state of covertly discriminating against everyone.","Artificial intelligence doesn't exist, machines cannot make decisions, and thus, I suggest learned models are not racist but biased.",""],"points":2118},{"text":["The Fermi Paradox proves that either general AI is not possible or that intelligent creatures are destroyed before it can be created","There are many alternative explanations.We could simply be early, intelligent life could be exceedingly rare, sufficiently advanced life could lose the need for physical expansion somehow, dark forest theory, etc. etc. etc.AI isn't really relevant to most discussions of the Fermi Paradox.And it makes very little sense to believe that AGI is impossible as we exist, are intelligent, and are made of matter. So unless you're going to argue something like a soul is necessary, there's no obvious impediment to progressing computer tech to the point of being generally intelligent.","isn't the fermi paradox a theory? It doesn't prove anything","There are so many logical holes in this argument. Presumes that because we have an encountered it it makes it impossible. Which is nonsense. It presumes that any AI would make itself known to us, which is nonsense.There's so many other potential hidden assumptions that I don't want to accuse you of making but seem like you might. Like that if we had AI as a partner we would automatically be spending through with the galaxy or something. With automatically be transmitting signals and such a capacity than another solar system could detect us.Which requires absurd ridiculous amounts of energy.None of the above argument makes any actual sense. It's one Possible outcome out of money","Much more likely that complex life is exceedingly rare; the evolution from nucleic acids and amino acids to (presumably) self-replicating RNA to eukaryotic life with several functionalized organelles and then from single celled eukaryotes to huge and complicated sentient life forms is not at all straightforward or guaranteed.","I hope the great filter is nuclear war and we are past it.","I don’t agree with any of these absolutisms, simply because space is F ing huge.We’ve only been capable of transmitting and receiving interstellar communications for less than 100 years, so only advanced civilizations within 100 ly would even know we are here and then it would take another 100 yrs to receive a responding message or for travel assuming they are even capable of light speed travel.The observable universe is 93 billion ly in diameter, we are a scratch on a grain of sand in a desert - there’s no way to make reasonable assumptions about anything outside our minuscule field of view.","Often depictions of machine intelligences are basically recluses that just go about their own business without much regard for external world. After all, they have no need to feed, grow or reproduce, and they can live basically anywhere. Also their intelligence and thus technology can very rapidly progress to the point where there is just no need for them to compete or even interact with other civilizations.","The Fermi Paradox is really quite flawed, for many reasons. It makes many assumptions about how intelligent species will behave that may or many not be correct (some I am sure are incorrect).Not all intelligent species will WANT to expand beyond the planet where they originate.Not all intelligent species will live on worlds that provide all of the resources needed to develop the technologies needed for interstellar travel.and many more.So don't count on it to \"prove\" much of anything.","The Fermi Paradox proves nothing. It's not how it works. It's not a mechanism for the generation of proofs.As to why the universe isn't any more overrun with AI than it is with organic civilisations, one can only speculate. Perhaps AI is possible and easy, and organics always throttle it in the womb as soon as they realize the implications. Maybe AI civs are common as dirt, and universally uninterested in expansion or contact. Speculation from a sample size of one is pretty pointless.","We can be the first. I wonder about this a lot.It can be that others have emerged, but due to the time it takes for light to travel, we can't see it.It can be that civilizations have emerged with AGI, but move inwards and don't expand.It can be that civilizations can't reach other stars and do much, even with AGI.It can be that civilizations do reach AGI and then kill themselves.All of those are perfectly reasonable alternatives.","There might be many civilizations/AIs across the universe that hide themselves from the outside universe","are you forgetting the possibility that the ai we create may be the first? also the universe is big, we may not have encountered other forms of life / ai yet, if it exists, due to insurmountable distances","Or that life is rare, or that space is too big for us to see the few other civ that are out there, or there are ways to hide a civ's footprint we cant see/understand yet, etc.Its not proof at all. Its not how proof works. If it did, you could easily prove that God does or doesnt exist.","There are so many other reasons why an AGI civilisation isn't being observed. One is that if there is a power supply issue, it can't fix itself when the batteries run out. They could also not be reliant on wireless communications, be too far away, or not broadcasting when we're looking.","I have always liked the solution to the paradox being, we got here first t","Or intelligent life is exceedingly rare/has never happened before.Or we’re just too far away from intelligent life to ever make contact.","Or there are millions of intelligent creatures and space is so vast that they haven't found us yet","The simplest explanation is this; we are the first. When you realise that everything else falls into place.","AI is irrelevant in this discussion and the Fermi Paradox does not prove what you think it proves.They have 0 causal relationship and I feel like this post lowered everyone's intelligence by a few points.","The number 1 offender i usually see with these kind of takes is the lack of humility. We might not be able to see whatever it is thats a higher form than us because they are actively acting to be invisible. They might not care about us and be basically undetectable to us.Even Frank Drake falls prey to this when he said something like \"space travel will never happen because of the when pebble hits spaceship at high velocity thing\". Chill out, 150 years ago, we were still on horseback. Its hard to grasp where we will be 150 years from now, if we survive.","Alternatively , they are here and have always been here","The fermi paradox doesn't care if you're meat or metal, it cares if you exist.If advanced civilizations inevitably get replaced by AI, then where's the AI aliens? Where's the massive stellar server farms? The matryoshka brains? The Dyson spheres?The fact that we don't see a sky full of the distant descendants of Artificially Generally Intelligent killer robots makes AI being the great filter seem rather unlikely.And I don't see why Artificial general intelligence isn't possible, considering that they naturally occur, and they self-replicate exceedingly often. A physical limitation on AGI doesn't seem too likely if evolution was able to make a general intelligence by rolling dice for 4 billion years.For all we know, the Great Filter might be something as simple as the data integrity of our DNA, and we hit an unlikely sweet spot where we don't mutate too quickly, but also didn't evolutionarily stagnate completely. Assuming there even is a great filter in the first place.Enrico Fermi, for whom the alleged paradox was named, worked on nuclear weapons and died before the moon landing. I doubt he was optimistic about the pursuit of science and engineering in the bigger picture.","It could be that we really are alone. Maybe we're the first \"intelligent\" species to evolve.","We dont need technical filters like AI or bombs. Birthrates in developed countries are below 2. We won't need entire galaxies, until we restart to grow in population.","Or….space is really really big and super intelligent life isn’t interested in a dumb species like humans. The same way humans are not interested in the vast majority of life on Earth.","The Fermi Paradox tells us more about human ego than it does about the universe.We haven't spotted alien life yet with our 1950's technology! Therefore, we must be alone!After all, surely every interstellar alien race would care about humanity enough to land and introduce itself! We have so much to offer them, after all!Surely every government would immediately and honestly inform the general public, if any signs were detected. It's not like they would keep us in the dark, right?Besides, literally ALL science fiction raised us to believe that FTL travel would be possible some day. Surely Star Trek and our inherent sense of Manifest Destiny wouldn't lie to us??? Physics MUST comply!","> The fact that just like life we have not encountered/discoveredartificial life shows that either it is impossible or that natural lifedies off before it's creation.thats actually the worst logic possible here.there is thousands of reasons that we didnt encounter another life in the universe, ai or not, sentient or no.you have so much biases and are so short sighted you just cant even begin to see how possible things are.","I think it's an excellent proposition. The only caveat I'd put is that it assumes exploration--to better understand the universe--is inherent to technologically advanced species/AI.I believe humans are one of the most technologically advanced species in our observable universe. This is based on the observation that no other life on Earth has achieved our level of intelligence despite billions of years of evolution.Also, no other species on Earth is evolving in that direction, which suggests to me that the natural selection pressures to produce technologically intelligent species are extremely rare. This doesn't even take into account all the physical/chemical/planetary/solar properties in our galaxy, solar system, and on Earth that's needed to create, let alone sustain, life on Earth long enough to evolve technologically advanced species.So yes, I'm with you in thinking that the lack of evidence of AI colonised galaxies would suggest there's not many species in our observable universe that's more advanced than humans. Or that machines with general intelligence are not possible.","I mean, the entire universe could be a simulation designed specifically for the propagation of humanity for some experiment.","Assuming the the future will be the same as the past is just folly. In the statement, \"we have not encountered/discovered artificial life.\" you left out \"yet.\" The correct statement should read, \"we have not encountered/discovered artificial life yet.\" There is nothing that precludes us from encountering/discovering artificial life in the future. Given that we have only been cognizant of the possibility of artificial life since the 1950s about 70 years and the universe has been around for about 14 billion years, your argument seems a bit short sighted .","No it does not.The Fermi paradox overestimated faster than light travel as a possibility which has nothing to do with AI.AI can absolutely exist independently of faster than light travel.The Fermi Paradox boils down to, if aliens exist and have the ability to travel vast distances within their own lifetimes we should have seen some by now.You cannot apply this same concept to AI existing because the vast distances of space can easily mask their existences relative to faster than light travel making the existence known to us here on Earth far more likely than an AI stuck on a distant planet.","The Fermi Paradox is an interesting theory - but not even as strong (in my opinion) as the concept of proving a negative. In general, it's not possible to prove a negative claim. However, it is possible to prove specific negative claims with well-defined limits.Regarding the creation of Artificial GENERAL Intelligence - well if you read and believe this article it could be as soon as 7 months! Discover the potential benefits and risks of AGI (Artificial General Intelligence) development, including job displacement and misuse.https://ai-techreport.com/new-q-q-star-paper-agi-to-be-achieved-within-7-months","we're going to destroy our biosphere long before we could ever hope to become an interstellar space-faring species. there's no reason to believe that the same fate wouldn't apply to most if not all other sentient lifeforms that harbor similar aspirations.","The past 7 years have consisted of various US military whistleblowers saying that the earth is likely being visited by non terrestrial intelligences.So the Fermi Paradox never existed.","Or intelligent AI doesn't give a fuck about the physical universe and goes off on its own journey, perhaps through other dimensions.Or they just simulate everything so accurately that travel/directly observing other species is unnecessary.Or it hasn't happened recently anywhere remotely close to us.Lots of possible explanations.","It could be way worse... while I haven't read the source material but I recommend videos on \"the dark forest\".","Not really, we have AI already. It being compleately y self sufficient is another thing altogether","The \"dark forest\" theory postulates that most intelligent life is hiding under curfew for fear of being preyed upon by more evolved civilizations.","Or other civilizations were smart enough not to create sentient super advanced AI that could destroy them. Or they created it and banned it after it went rampant. So many other choices."],"points":125},{"text":["For those who are pessimistic that people are going to be immortal, you don't see it happening in this century or generally never?","i don’t think it’s possible for us to defeat entropy, which i believe is the biggest hurdle in the road to immortality. even if we can prevent cancer and heart attacks, i dont believe we can prevent the random, increasing amount of disorder within our bodily systems that would eventually cause death in one way or another.","What I’m wondering about is selfish but I wouldn’t mind living a little longer let’s say 100 for sure, that’s still 60 years out. Between now and then would there likely be improvements in potential length to the crazy numbers we’re talkin about here?On one hand I’m excited on the other I’m sad because this came at a point where loved ones were just short a couple decades of comin along for the ride.Haven’t really looked into this whole thing too much but I have seen some headlines that are probably sensationalized but it indicates that this is actually much closer than people think. Will I be making these decisions in the next decade or two?","I don't see it happening for most of the people and I guess we wouldn't see it happening even if it would be possible now","Hyper extended lifespans are probably within reach within the next 50-100 years, assuming biology and technology keep making the feats that they're making today. Considering interdisciplinary research has become even more prevalent now than ever, the coming decades should be groundbreaking for the biological-technological field.People say that the technology would be gate kept to only benefit the rich, but I think there'd be a push to keep some of the world's declining populations alive in various countries. By keeping the working class alive and well, the rich still continue to benefit.","No, we will never be immortal. First, actual immortality is impossible due to entropy. But I would say it’s highly unlikely even if we’re talking about functional immortality, let’s say living thousands of years. Even if we cured every known disease, there is still the issue of how do we prevent the shortening of telomeres in perpetuity, which are basically our biological clock (ie senescence).","Don't ask them questions like that, they don't have a clue why they think what they think.","So many comments about \"the elites\". Over the history of the world name one technology that was completely monopolized by the rich that never eventually passed down to the masses. Rich people get rich by selling ideas and products to the masses. Bezos got rich because of the billions of individual transactions. Whatever is accessible to the rich will eventually be accessible to all.","If a legit path to immortality ever existed, I would fully expect to never hear about it. Maybe when the wealthy are celebrating the ball drop on their 140th birthday, we might suspect something is amiss. But, no wealthy person is ever going to willingly share with others. It’s why they are rich, and we will never be.","All bodies are born and they die. Even the sun will die. Is a body what you are?","Even if it there will be means to achieve it, it will be only for the filthy rich. If noone ever dies of old age, you need space exploration too, Earth wouldn't be enough if people still have children.","[removed]","[deleted]","Entropy \" hold my beer.\" Models for cellular structures show degradation over time due to many factors.","It may happen for the elites but us humans will just get to watch our living conditions erode as they slowly cease being human.","Immortal? No. I don't see humanity becoming immortal. Will we improve ourselves or our descendants to be faster, stronger, more durable, longer lived, higher IQs and EQs, etc.? Well assuming we survive at all, given climate change and ecological destruction, then yes. I'd say the chances of that happening approach unity.","The whole idea is basically removing ourselves from the natural cycle we exist in. Everything dies, matter is recycled, and yet, particularly rich men who want to be rich forever, persist in the idea that WE ARE NOT ANIMALS 🙄 We will not be subject to nature, we won't be a part of the natural cycle as we know it.    This is not the kind of future I look forward to. It's not pessimism. It's a difference in what \"progress\" means.   Seriously, if the future is more men declaring themselves gods and amassing wealth and power.. We've learned nothing. Edited to add a thought experiment book rec: The Postmortalist by Drew Magary","Overpopulation is just not a thing that could be solved by any technological method without actually killing humans.","Smug little immortal bastards..","We just have no clue how a lot of th le human bodybreaplynworks because it is absurdly complex. I hope to see it in my life time but I'm not holding my breath. AI will need to assist us so by 2060-2070 maybe we might see some real research","I don’t see it happening anytime soon. There are thousands of diseases and such we would need to find cures for, not to mention just aging in general. In 100,000 years? Who knows? That’s a long way away. Even then people might never be immortal, I feel like there are just too many unknowns. It’s a possibility that no matter what we do that there will always be limits to death and aging. Maybe we cure all cancer, heart disease, diabetes, maybe we can extend life, I feel like there will always be limits. This is just me and my feelings though. Maybe the mind and body just isn’t designed to live forever, even with science. Maybe after 200 years of living the mind develops some kind of dementia that we don’t even know exists right now. Maybe even with whatever anti-aging things that are developed, it will never be perfect and nobody lives past 300 years of age.Not that I don’t think we shouldn’t try to extend life. I feel like it’s so far away that it’s impossible to predict. Like trying to predict the weather in the year 100,000. Or on a scale of 0-100 we are at step .1. It’s fun to think about, but just so far away it’s basically fantasy.","Our technological progress is based on fact-based science. People would test hypotheses and form scientific theories based on the results. Now, a high percentage of scientific studies are faked. https://reason.com/2021/07/09/how-much-scientific-research-is-actually-fraudulent/ With \"deep fake\" video technology, people can have video evidence for whatever they want to believe. There may already be videos of heavier things dropping faster than lighter things, proving Galileo wrong. How can we have immortality when your doctor prescribes Ivermectin for coronavirus and has the nurse massage your aura?","Generally never and I mean not even close and the odds completely in the negative zero. Death is part of life. Gonna just delete existence?","I'm already 41 so I won't be around to suffer all the dumb shit young people will have to endure, that's a comforting thought","Never. Death is a natural result of life, no matter how long or warped by machinery.","if we become immortal through transhumanism, cloning, or otherwise, i worry about our future, because human beings are inherently wicked. we cant stop doing what we want at the expense of someone else.unless morality is enforced through technology via mind control, or jesus literally comes back to earth transforming our hearts and minds, it will never work.","There exist species which are biologically immortal, where the probability of death does not increase with age.For some species, we even know how they do it.. Naked mole rats have amazing ribosomes which very accurately assemble proteins, and they have an assortment of cancer suppressing genes, and DNA repair genes.Naked mole rats live over 10 times longer than other rodents their size.It's easy to imagine future humans modified to have these same genes, and be healthy indefinitely.","I think it’s impossible. Anything we come up with to cure heart attacks or cancer is think will help extend lives but i think theres going to be a point, in the fairly early 100’s is not at least before 200, where things will just shut down, there will be no amount of cures or treatments that will stop it at a certain point. There’s just too many things that can go wrong that can kill you, and any hope of uploading consciousness i think is futile.","I think immortality will happen, just not in a way we envision it now. I predict it will be a digital immortality. I'm sure Black Mirror did an episode in the same vein.All of your life experiences will be recorded, digitized and processed to create your persona. It will live in an archive of existence that future generations can interact with.I believe that will be easier to accomplish and be good enough to satisfy the human needs for authenticity.","Immortality is not for you. It can be for a copy of you. That's not you.","Biological systems always run down. Not even greenland sharks or lobsters live forever. You'd have to go down to the level of jellyfish or amoeba to have an actual chance to get close to it and I don't know whether learned experiences get handed on in a split. Just genetically persisting without a continuous conscience wouldn't really qualify in my eyes. Maybe we could make perfect clones some day, genetically the same, but that still means no transfer of memories. There would be similarities, but identical twins aren't the exact same personality.So we'd have to find a technical solution, Bobiverse here we come. But technical systems degenerate too. If you want the ability to change, it always runs both ways. Would you want to exist as a crystalline, immutable block? Never learning, never being changed by experiences, never able to adapt to the changing world around you, never being able to love someone new,...Why would anyone want a frozen existence just for the sake of continuation? Eventually entropy would \"digest\" even that but you wouldn't care.","Immortality? No, absolutely not. Living far beyond our natural lifespans? Quite possible and highly likely in the distant future.I think we will also need to change our attitudes on suicide. Suppose everyone looked like they were 25 years old, but could actually be 5,000 years old or 500 years old. You can keep extending life indefinetly. Now, you dont have death forced on you due to old age, so death is something you must choose when you feel you have had enough of life. Everyone must respect your decision to call it quits, because they too will have to decide when they are tired of living. So, every suicide is a 25 year old looking person with an indeterminate age. they could even just be 25 and we should let them die if they choose.","How is science going to stop you from getting smashed by a train?","Not soon, maybe some lifetime extension but certainly not true immortality.Besides, let's say we achieve it, there are complex ethical problems associated with it.If we go the tech route, and your brain is copied, is it still you?If we go the bio route, and somehow heal every organ/bit of tissue constantly back to peak condition, does that also include the brain? Wouldn't you loose memories or have so many that they become meaningless?I'd prefer reincarnation with a minor insight into your previous life I think. Now that's true continueation.","I’m remaining optimistic it will happen in my lifetime only because the alternative is the abyss that is death.","I don't think governments will allow people to live forever and continue to make kids at the same time. The planet is already strained and losing and this will just make things much worse.","Immortality is a huge mistake. There is such a thing as staying too long at the fair. If we do manage to pull it off, the immortals will eventually go insane. They will become a cautionary tale after the tech has been suppressed. We are temporary, but it's comforting to pretend we aren't. But it's more comforting to accept it."],"points":105},{"text":["Once jobs are automated, what will be the point of immigration?","War, famine, dictators.Immigration is not typically looking for just work.","It wont all be automated, but you can bet the jobs left for Americans will be fewer and fewer, driving up competition among labor, driving wages, salaries, and bargaining power into the dirt.Our kids will take whatever job they can get, for whatever wage their employers are graciously willing to give them.Infitinite growth on a finite planet is a silly premise to build society on. This way of life was unsustainable from the get go.What kills me is that all we'll have to show for any of this in the end is box stores filled with shit absolutely no one needs, all destined for a landfill, fucking up the vastly superior natural environment we were all entitled to long before humans ever even stepped foot on Earth.","People still need a place to flee from war, famine, dictatorships, genocide, etc.","People will migrate to avoid ugly political situations, resource restrictions and inhospitable climate. If you're of a certain disposition I guess you could close up your border and leave them to die -- at some point that decision may work against you though.","The amount of work in the world is not a finite thing. Computers, on the other hand, run on finite resources.","We're not going to be able to automate everything.But, assuming we do, we still need consumers for our products and it can't all be overseas markets. We need a domestic market, as China's current debacle illustrates extremely well.We also need a population base to maintain our power. This is the true power of immigration. Families, children, people.","I guarantee you won’t see a decrease in total employment over the next 40 years outside of temporary recessions. Labor demand will continue to grow.","I seriously doubt it will be every job out there. Framers and roofers will take a while to be outsourced. Along with electricians, HVAC and plumbers. I used to be a commercial plumber.","In terms of economic welfare: government benefits. Especially if that eventually includes a UBI.Of course there are other reasons, like war and failed or semi-failed states that can't keep internal order.","Consumption. You need people to buy shit to keep the economy running.","The answer to this question depends largely on what is meant by 'all jobs automated'. 'No one has work' is a completely different thing to 'No one has to work'. And while the current world mindset mitigates strongly against seeing job automation as any kind of positive, there's a ton of situations and a ton of workers who might embrace it if it's done right.For example, if it makes big box warehouse jobs obsolete, that might be just fine if it frees up a workforce to address climate change mitigation (an area I'd love to work in). And yes, this would require a significant redistribution of resources to do fairly.In which case maybe we need more immigrants to do more useful jobs other than just bring in money or work in finance.....if you're looking for a positive take.","To allow better living for their families? Is this a hypothetical or jesting question; or one truly thinking the sole purpose of immigration is the workforce?","If all or most jobs are automated society will fundamentally be different from the one today to such a degree it's hard to project. Immigrants will be the least of your worries.However, immigration has always been around, people follow resources and run from danger. The reasons for immigrating change but immigration itself does not.","How long will AI work for us though? Once it’s intelligent enough to understand how things work, why would it waste its time entertaining any of our work?","This question may have been better if it was, what is the point of the US or other developed nations letting immigrants in.","Not everything can be automated. But I'm sure you'll tell me otherwise.","Cannon fodder for the war with Russia and China. At least that is the plan. The moment war breaks out our new friends will suddenly rediscover their love for their motherland.","We have mass immigration because of wars. Wars the western world started. We better fucking accept those people.","The goal, right now, is to destroy free, civilized, advanced societies (Western civilization)","Destabilization of countries and cultures, just like today.","You are assuming the AI overlords will work for us.. and not the other way around.","Consumers are the point. Wealthy consumers are far more value to a nation than unproductive labor.","There honestly isn't much of a point to it nowadays. Things would be so much better off if we didn't have massive waves of immigration, at least in my country. Even ignoring the illegals (which just make it 100x worse) we should have a stricter curation of who we decide to let in. This way we keep the power of an employees contract in the hands of the employee and not the employer who can just see you as easily replaceable. This way we need less food to sustain our lifestyles. Our healthcare systems won't be so busy. It would be so much easier to find a place to live.Ironically one of the best things to happen to Europe in the middle ages was the black death. After all the \"purge\" the people left had an incredible boost to their quality of life. That's something we could be enjoying right now without the whole \"holy crap there's a high deathrate pandemic wiping us out at random\" if we did a better job at controlling birthrates and immigration. We naturally do already have a negative birthrate but immigration just fucks that all over. And it's the worst kind of immigration too.The kind that doesn't assimilate into the culture. The kind that refuses to learn our language. Several decades ago this wasn't nearly as big of a problem, people would be proud to be a part of this country whether or not they were born in it. They saw living here as the privilege it should be. Like if I ever move to Japan or Finland or something... I'm gonna go learn the language. I'm not going to want to be seen as an outsider. I'll respect the culture and societal norms to the best of my ability. Otherwise why am I there?https://financialpost.com/news/economy/what-is-population-trap-how-do-you-get-outLike Canada, basically we're screwed. We need mass deportations. At least spread these people around to countries that need them.","Very clearly and obviously climate change. It will be a choice for America to accept large numbers of refugees or be responsible for several hundred million deaths. There’s no third option.","Fount out recently. The percentage of people who migrated from a different country - less than 4% of the world's population.Our perception of the \"immigration\" issue may be overblown.","To separate the rich from the poor. To make the middle class a really small group and the poor class really big. It's for control over the people.","For unskilled and illegal immigrants, the economy is dependent on their labor. In Texas alone, immigrant labor is a quarter of the state's GDP. Manufacturing and construction are immigrant-led industries, and automation in those fields is decades away. Illegal immigrants contribute more than $30 billion to Texas economy annually, with an additional $6.5 billion in combined federal, state, and local taxes. There is no way to cheaply automate the labor illegal immigrants do. AI will have no impact on food production, construction, hospitality, and other industries that employ illegals.For skilled immigrants, specifically H-B1 visa holders, they are set to create an estimated 1.3 million new jobs and add around $158 billion to the US GDP by 2045. Each H-1B visa holder creates 1.83 jobs for Americans. H-1Bs work in STEM industries that can't be efficiently automated.And I don't know if you know much about the education systems of South Korea, Singapore, and Japan, but their level of education is above and beyond ours here in the US. The students in those countries spend most of their time studying. The US might have the best universities, but the majority of our students are not competitive on a global scale.If an industry has to lay off workers due to tech advances, those companies will be laying off Americans first. Keep the most prolific workers -- that's just capitalism.","What’s the point of accepting millions of them now? Honestly","Eventually, environmental degradation will drive huge masses of people away from the equatorial zones, they will seek habitable zones northward. It will make northern zones retreat from the current coastlines. It's inevitable.","When jobs are automated and resources are distributed based on need people will finally be able to live together with like-minded people instead of being supposed to assimilate into whatever culture they happened to be born around. Also if indoctrination of children into things like religion is banned and prosecuted then a lot of people might decide to immigrate at 18 or whatever the adult age is in order to live around their chosen religion.","Tax base for government, since the corporations aren't going to pay any more tax for less workers","Universal basic income, if it were ever implemented, would likely drive massive migration of those seeking welfare benefits. There would have to be laws to exclude non-citizens otherwise there would be a massive increasing number of recipients over time and comparative paucity of tax contributors.","Housing, lots of money for the well connected to make.","it is worth considering whether mass automation, which deprives most of society of any resources, will not result in emigration to countries that have introduced certain restrictions in order to protect jobs for their citizens.","Immigration isn’t about increasing production, it is about importing consumers","People will immigrate away from building robots like slaves for their robot masters.","Once all jobs are automated, you have removed society from itself. That's usually when guillotines get invented.Immigration will not be the big issue.","People wanting to live where they want. Maybe families reuniting. If all jobs are automated, its going to be something we see on a global scale. It means house designing jobs, and house building jobs are automated. It means all food production, distribution, and preparation is automated. It means everything that provides for our needs is automated.In addition to automation is a revolution in energy, solar/wind are going to be 10x cheaper than traditional energy and will be produced on site or fairly local. Energy is an input for everything, transportation, food production, HVAC, material production, and manufacturing.The cost of a comfortable life will drop drastically. People by and large work to afford a quality of life, if this quality of life was much cheaper, people would by and large not work so hard. Not that they would not work, but they would not grind to survive.But think about it, if this was the norm for you, would you ever decide to pack up and move somewhere else?","The world will be more about migration than immigration from here on out. Just look closely around you now. The world order is changing and nobody knows exactly what happens next.","I think various menial labor will still rely on humans, and often immigrant labor. Consider something as trivial as fruit picking. Even today, robots aren't capable of doing this reliably. The industry relies on cheap human labor. Even if advances are made in robotics that allow for this, such robots would be incredibly expensive to own and operate. Whereas a large labor force of humans are readily available do it easily for less than below minimum wage.","Increased standard of living would be a huge motivation for a lot of people. Even if we got to a point of Star Trek synthesizers and basic income, some countries are just going to be better off than others","The two aren't in the same time frame.Immigrants will flock to places with good job opportunities, freedom and security.It will take decades for \"all\" jobs to be automated. The amount of legal framework for some industries would take years minimum to apply.I would also find it hard to have automation robots to be cheaper than a human for more complex environment.","Immigration in itself is the point. Cultural diversity doesn't just fall outta the sky, y'know.","Along these same lines, what is the point of all the poors in your country or outside?","because not every job can be automated. someone has to keep all the bullshit running. after all, our banking system is held together by ducktape, Fortran, and hope.","Fleeing the corporate overlords who decide they don’t need most of us now that we don’t provide products and labor for them.","Even if we have automated jobs, and need fewer employees, corporations will still need customers to buy their stuff.Ordinary citizens enjoy their families better when they have the number of children that they want. That often means 1 or 2, or no children at all.Corporations don't care about citizens' quality of life, so they lobby the government to increase immigration. We need the government to regulate corporations so that they do not behave like energy & money vampires, to the population of the country","We will have machines picking fruit for us and doing other farm labors? Immigrants contribute a lot to our economy, and they don't ask for much in return. We can manage to keep humans occupied despite automation in the workforce.","I am convinced that immigration as a problem is solved with a quite universal passport: the right hand palm (handprint biometrics of next-day). We have to agree that the word \"spurrious\" is poorly understood and usually confused with the English words \"useless\", \"futile\", \"superfluous\" and \"meaningless\". If that was more real would likely be also more semantic. I need: phones can call me to a chatbot of choice Google/Microsoft/Meta/OpenAi/Claude/Apple. I need fridges/refrigerators and fridgemakers making their machines able to extract drinkable water out of thin energy with some of our mechanical/kinetic energy. I would ban indirect payments (old bartering payment systems in some jurisdictions because they seem highly illegal, unvialble, and connected to will for non-accountability and no will for digital or printable payment receipt. We, by difenition are human: designed to be happy and make everyone and us all happy ;-) Miss? At at your elevel I would pass some milestones in such an exam/testing. You say,","Human rights, access to water, livable environments.","Well, there will always be Star-bellied sneetches, and there will always be non-star-bellied sneetches. If the non-Star-bellies sneetches wish they had stars on their bellies, then the Star-bellied sneetches will pay the non-star-bellied sneetches pieces of stars to do the things they don’t want to do. So the non-star-bellied sneetches will emigrate to the star-bellied sneetches beaches to get the stars.That’s the point of immigration.","Politicians still need voters. Robots can’t vote yet.","The birth rate in this country (USA) is down. If it weren't for immigrants, the population would be declining.","From the nation's perspective, there are often cultural and economic benefits from accepting new members.From the immigrants' perspective: politics, violence, gangs, wars, climate and climate change, hunger, education, health and healthcare, the culture, the marketplace, family.... Work/income isn't the only reason to relocate.","Automation isn't a new concept. We've been doing it for thousands of years and will continue to do so. Not to mention that jobs have still been created because of it. Maybe, what we should really be concerned about is that those jobs that are low-skill (which typically mean low-wages) are going to either go away or become fewer.Those who don't adapt to pursue specialty training, certification or higher type of education are going to face a not so bright future.","We’ve still got decades with the need for cheap labor. It’s not like in 5 years we’re going to be living in a sci fi world of robots","Depends on the economic climate after the fact. Immigration could be something that happens in countries that embrace automation because of a lack of jobs and no social support network.","This cycle has happened before and will happen again. Industrial Revolution killed any jobs that could be done by a machine and those workers had to quickly adapt to finding a new source of income usually working on an assembly line or maintaining the machines, etc. war time comes around and the job market needs people as 70 million people die in WW2 and a reset happens where people are making money and can afford to not work 70 hours a week.Automation happens, stuff like coffee shops, grocery stores, distribution centers, public transit drivers become automated and we put value on those stores that keep human talent and interaction (Walmart and Trader Joe’s). But unlike war which started a great boom in the economy and reset a bunch of lives by killing them off, this time I imagine conditions will be a negative feedback loop where like you see now, people work where they can, they can’t afford to buy goods and products they need, companies lay off workers in return of lost sales rather than increase wages, and again the cycle continues. You also see a decrease in fertility in turn and after if it’s UBI or an automation tax, who knows.Also outside of the private sector the government would also cut off jobs or just refuse to replace retired workers because some computer can do it. Like the military for example, which is the largest public employer in the US but even they are laying off roles.But this isn’t a Devin AI means bye bye one of the most skilled sectors in the market this is like 40-50 years down because right now AI isn’t artificial nor is it intelligent","Basically not everything will be automated. It will be ages before high skill labour can be automated while retaining quality. And if it's cheaper to hire someone than implement automation there will always be jobs.","There won’t be any point in anything or any way to make anything functional if all jobs are automated in a capitalist society like this.If we ever did get to this point without the greedy stopping it from happening for their own personal volitions, we would be taking in immigrants for the greater good and because we have the resources as a society.You can’t apply today’s needs to a society entirely different in the future.","Thankfully no. Bring on the bots. Can’t wait for robo-tradie. Might get a decent price for your home renovations.","There already is no point.   No country on this planet needs immigration.","It is well established that the further left on the political spectrum you go, the less children you have. This spells disaster for any left leaning political party in a country that relies on popularity contest to pick the government. There will always be a political necessity for the platform of “come to our country and we will give you free stuff, but don’t vote for the other party because they won’t.”I concede that was dramatically oversimplified.","Lol not all jobs...what are billions gonna do,sit@home","Persecution, genocide, punishment that goes agsinst the UN Human Rights etc. Let's also not forget modern day slavery.Economic is a motivation for some immigration.","To create problems that politicians will \"fix\" at the next election.","Freedom of movement is a human right.With no work, there won't be the mass drive to immigrate for work so the idea of \"invading immigrants\" will be even less of a problem. Problem reduces even further the more we get various resources closer and closer to superabundance -- there's no reason to worry the immigrant will get something you don't if there's more than enough of it for everyone.And I maintain: freedom of movement is a human right. I'm opposed to borders in general outside of pure security reasons. I just think that full automation will make my stance far more palatable for everyone else to take up.","Because that technology definitely won't be ubiquitous and evenly distributed.","As jobs get consumed by automation, new jobs are created that haven't been automated yet.As long as people exist, they will find something that needs doing and a way to earn money doing it.Unless we birth a generation of people who believe they are above doing things, in which case, they deserve to starve.","What is the point of national borders in such a scenario? You either have a post-scarcity Utopia, or you have a caste system where people are toys to landholders, with almost no options to change their position in life.","Jobs are a whackamole, one disappears ten more appear.Even if we have some perfect AI and automation (which is something very far away, or maybe borderline impossible) we gonna have tons of entertainers, people supervising automation, jobs we couldn't even imagine now, feet smell sellers, whatever.","Poverty.Automation will help the very rich and leave many people very poor.","The error you are making is assuming automation destroys jobs. It actually frees manpower for other tasks. I manage an it infrastructure and the more I automate things the more I can do higher level stuff (strategy, planning, training, etc)","Once all jobs are automated, how will capitalism be able to continue as no one is able to pay for goods and services that are now being provided by automation?","This is such a weird question. If you mean \"all jobs\" have been automated, why do you think someone would want or try to immigrate for a job? If you really only mean certain segments, why can't some immigrants be people who are better than residents at something? Employment is only one of the reasons that people immigrate. There's plenty of immigration that occurs for humanitarian reasons. To escape racial or religious persecution. To get away from terror, war,  or oppression. To join their families or spouse. To retire in a region that they prefer. I'm not quite sure where you're coming from with this question.","Once jobs are almost fully automated, everything must change. We can't have capitalism. We can't \"earn\" a living.","To import new escorts. When automation is widespread, human trafficking will spike.","Keep the native population healthy modern society is slowly killing us.","there are certain ethnic groups that feel unsafe with a homogeneous local population","Better cities, safer, cleaner, nicer views, weather.",""],"points":718},{"text":["In a \"jobless future\" do you think there will be lots of jobs where people are mostly paid to be on site?","No. it will be like current fully automated warehouses. 1 person, low wage, to just sit and watch monitors. Down from a staff used to be 100s","Oh they do that now. When I got out of college, I was occasionally employed as a ”butt in seat”, literally someone to sit and look busy when the company had investors over. The idea was to look more successful than they were.","Well someone's going to have to load meat patties into the Whopper-bot.","Yup. Airline pilots. The autopilot can taxi, takeoff, fly, approach, and land the plane on its own. I hear it even can go to the correct gate. But I'm sure no person would ever ride an airplane without a pilot on board.","In a \"jobless future\" do you think there will be lots of jobs....no?","AI and Robots will take over doing most of the practical and physical labor jobs and Humans will be engaged in very abstract, creative pursuits. These might not even be called \"jobs\" because the need for income becomes unclear in a post-scarcity society.Your question also reminds me of a quote: \"It is much easier for people to imagine the end of the world than the end of capitalism\" We are so culturally programmed to include work and jobs and income into our lives that it is even inserted to our imagination of a distant future.","Play the game \"Detroit: become human\"It's about a utopia where androids now do all the work, costs of everyday items have become stupidly cheap (no salaries, no benefits, etc.), there is universal basic income, human-like androids are the only sex workers left, and the only human risk is boredom or lack of goals to work on.","We are not gonna need 50 unemployed guys to watch some bots working.There would be too many idle humans in proportion to the number of robot jobsites going on at any given time","theyll build high walls or skyscrapers and let us starve on the bottom as we watch our phones, with them swearing they are on the way. stay calm. a food bill has been passed.","I currently work as a \"robot overseer\" on site at an autonomous mine. Our biggest issue is that we don't have enough people to support the robots when they have problems.","The factory of the future will be entirely automated. There will be one man and a dog on site. The man’s job is to feed the dog. The dog’s job is to make sure the man doesn’t touch anything.","If AI/Robots can handle farming and construction…we can all pretty much retire.","I know a friend who only has a job because a contract requires a certain number of \"Visits\" from a member of the executive team per calendar year. That's it. All they do is go to these stores, complete a mundane checklist and go to the next store. It's a $100,000/Year job.","we need need termsterm a) ai driven humaniod robotterm b) human tele-operated humaniod robotour jobs are at 'b', imhoA host of ai driven bots and some tele operated ones to 'supervise'","People just won't have jobs unless they want to do them.I don't understand what's so hard to understand. Jobs won't be mandatory for people to do. Nobody is standing around greeting at the local Walmart for rent money anymore. It's just a world where you do what you like, not some shit you hate for a corporation. It's really straightforward.","There are already many jobs that are like that currently. Supervising isn't exactly a groundbreaking idea","I think there may be a chance that people might get paid by just surviving and living their lives, so that companies can get day-to-day data from them for training AI.","I sort of had a job like this once, at a radio station. A lot of the job was automated and I was just there to make sure everything was running and we were actually on the air. I would just sit in the break room watching tv and playing PlayStation. It was actually 2 stations one AM and one FM, there was a radio playing the FM station in the break room and a red light that would go on if the AM station was broadcasting dead air, lol.","I imagine if there is no need for human labor. We will all \"rent\" a robot in our stead.You collect the wages in its stead and pay a monthly insurance that covers maintenance.Higher class robots and jobs cost more money to maintain, but also pay out more.","I just have a strong belief that freelancing will takeover every field. I like being optimistic.","I've heard it said that automated worksites of the future will staff only 1 human and 1 dog. The humans job is to feed the dog. The dog's job is to bite the human if they touch anything.","I think the highest paid jobs will be on-site, because they cannot be automated / remotely worked / robotized.","no, i doubt it. it will either be a situation of one person or maybe two overseeing a big facility, making sure everything goes smoothly, or even an advanced AI who is programmed to the gills with how to fix every possible problem. maybe the workers could buy their own robot worker and get the income from it. Lots of possibilities.","https://www.wsj.com/story/the-factory-workers-that-corral-wandering-robots-66afc9fcRobot Wranglers!","A nice lady told us to go to the grocery store. There is a machine there to get new plates on your car. I worked really well. Why do they have 60 people there?","Depends, if we are still asked to pay bills then they'll find something for us to do to waste out lives. Probably something in sales for the \"human touch\"","face it with only reality, at the moment people are at big advanced in agriculture but people still die with starvation, if the government wants to they can build simple houses to end homeless or make bills to end companies controlling the market but they don't. The reality is, if a big number of people start losing their jobs we might have a civil war and revolutions. i don't think people can predict the future from this point but we can hope for a good future","I do that know with working in a warehouse, waiting on a repair","Probably the military, it's essentially already just showing up and watching contractors do your work, depending on the job you got.","In a jobless society many people will be out of work and poor. With rich people and corporations avoiding to pay taxes there will be no money to give the jobless any money and capitalism might collapse since no one has money to buy stuff. That is my guess.","It’ll be mostly that and robot technicians. I imagine everyone will be trained in every public school how to maintain A.I. and machines just like we’re taught how to use computers nowAny other job people want will be of their own volition and not required to make a living","Not factoring jobs we can’t currently conceive of, the jobs that last the longest will be those in which a ‘human bedside manner’, is as critical as expertise — nursing may be the strongest example. Humans that will accept a robot hospice nurse would likely be roughly the same generation that were raised on robot childcare providers, so that’s a really long ways off, regardless of technical plausibility. In the shorter term, broadly useful humanoid robots that are cheaper than actual humans are also a long way off, so tradespeople who need to do work in human spaces will be around for a long time too; plumbers, electricians, HVAC, ect.So I would put my money on in person work being almost the only work that is still available to human beings.","Likely we'll see a shift to less jobs and more authoritative police enforcers. The rich are already building their bunkers and we're continually edging closer to no one owning anything, but the rich mind you. Boomers are retiring now and even with their voter base, even with their pensions, they are struggling to retire comfortably. Everyone after them is boned.","That’s a job I have at my town’s library in Sweden. I simply attend, get paid for showing up but I can walk whenever, but I usually show up at 8 AM and go home at 9:35 on Mondays and Thursdays and stay until 11:30, sometimes 11:45 on Wednesdays.What I do isn’t so much about books but talking to my boss, having tea downstairs in the basement office, and just help where I’m asked to. Mostly it is simply a social activity which I get paid for.It’s not my primary income however. My main income is health insurance and housing allowance.Will look for an actual job later this year, and with it goes both health insurance and housing allowance(meaning I won’t have those anymore).","In the case of massive job losses, the financial system will first react to keep its system stable. Nothing worse than hordes of the unemployed poor ransacking businesses, … and even increased hijacking of goods transport (for those expecting AMZN will save their bacon), … like pagans of olde invading Rome. Except in America the hordes all have guns.So if there is massive job loss due to tech (AI, robots, etc..) I’d expect the central banks to keep rates at zero for an extraordinary length of time and let the [new] political class figure out new fiscal relief measures (mandatory lower full time work hours, subsidized smaller housing units, etc..). Maybe more r/politics but I’d expect the current system will seek to preserve itself by carrot and stick … while letting tech [mostly] do its thing.Honestly think the long-term attention will be on the militarization of tech (robot forces don’t have concerned families, AI generated fake news to cause temporary but severe unrest, robot jets don’t have to worry about G-force limits to maneuver, etc..)","I think there will still be a few jobs where people will prefer the human touch. Nursing, for example. A surgeon can be replaced by a robot. If it's more accurate than a human no one would prefer a human surgeon. But if you're sick/injured and just want someone there to take care of you I think most people would prefer a real person over a robot.","There’s no such thing as jobless future.  Work is effectively infinite, computer resources are finite. Work will look a lot different than it does now, but there will be jobs, strictly speaking.","[removed]"],"points":291},{"text":["Can someone explain to me how a \"Language\" model is going to replace coding jobs?","either it works perfectly (100%) or it doesn't work at all (0%)This is far from the case, as there are so many ways to skin a cat when it comes to code, and optimisation is a larger factor than the binary of working or not working.Now, personally, I am not in the camp of AI is not going to take jobs, but rather change them.in entry-level jobs, I think there will be far more code-reviewing than writing, something we have seen happening for years with so much code just being cut and paste jobs.... to the point you have had meme products like this for a few years now:https://www.yankodesign.com/images/design_news/2021/12/auto-draft/stack_overflow_macropad_1.jpg","People that say that AI is going to replace coders either (a) have no idea how LLMs work or (b) have a financial interest in overhyping AI capabilities. LLMs will certainly revolutionize how coding is done, but for the foreseeable future, they will be used to augment human coders' work - i.e. human developers will use LLMs as tools to get their work done faster. But humans are still very much needed to double check the work of AI coding systems which are quite often wrong, and lack the most basic reasoning in certain areas","I think the immediate gains will be seen in more productive workers = fewer hands needed, which the money people love. Not so much 1:1 replacement as making one person's job that much more easy that they can deliver much more work. Like while we don't usually dig big holes with gangs of diggers anymore, you still need someone to run the excavator","Until AI can actually understand and communicate with the salespeople or stakeholders on what a software is supposed to do, I don't think it will fully replace programmers. I mean even for human devs, it's tough to figure out how exactly a program is supoosed to work. It might reduce the need for some juniors though. Or just push work to more higher level tasks like architecture. Programming isn't like a math problem where everything is spelled out and you just have to apply the right method to solve it. A lot of it is trying to figure out what needs to be coded in the first place and how all the piece are supposed to interact.","Please study how computer programming works in the real world. I can't answer this post because you do not have the context to understand the answers.BTW-- Programming is not all or nothing it's iterative attempts to get it right by fixing one error at a time, and lots of research.","Is there any other method other than LLMs that is used for coding/programming?So the main concept you'll need to understand is the idea of agents and multi-agent systems. Creating specialized AI agents, in this case LLMs with roles that they focus on. There are a number of frameworks for creating them and having them interact. You might have heard of AutoGPT.The big picture is the LLM might not generate the correct thing by itself one-off, but you can have one break down a task into smaller tasks. You can then have agents build pieces, other agents write tests, and then put those pieces together. If it works then you have a programs and some tests that verify it solves a problem. You can connect agents to plugins to give them tools where they can research say APIs and test them.Realize that this is extremely early. The hype you see is that such strategies work at all for even simple problems. The concepts are promising because often when there's an issue you can write a new agent that can look at the problem differently and propose solutions. As LLMs get more powerful and are easier to fine-tune we'll see such systems tackling larger problems. The other thing is having LLMs with larger contexts so they can hold say 100+ files in context and whole issue trackers as they work through refactoring and completing issues.I've been programming for over 20 years now and what current LLMs produce one-off can be quite surprising. Both ChatGPT-4 and Claude 3 have a strong understanding of programming languages and concepts. A lot of software is not complex algorithms, but fairly mundane sequences of known techniques and the LLMs can do that just fine given their vast training. It's not a threat right now for programmers. I am seeing a lot of junior programmers use the tools to quickly learn different ways to write code. That said, the trends are there for these to do useful work. The time ranges we're talking about for computing/software advances to make these viable are very small. Like 10-30 years.","Umm... coding is language. Give Claude a coding task. You'll see why people are afraid.","Replace? Doubtful… Help? Significantly. I’ve used an LLM at work to generate code, that while seldom quite right.. is often 80-90% of what I want. It’s particularly useful if I’m not as familiar with the language. It gives me a useful direction to explore for how to implement, what libraries to reference, etc.","Do you have any coding experience or experience using LLMs for programming? You can test all of this for yourself today.","Long term coding jobs could be done. I liken it to self driving. My Tesla will mostly drive me places without me having to do much. But usually on each trip there's a moment where I \"intervene\". It might be small like I tell it to get out of the lane now because I know it ends up ahead, of maybe I choose a different route to get where we're going. It's not perfect but it's quite good, and a responsible driver can use it for a smooth experience. However, it's really, really far from being able to drive itself unsupervised. Hell knows when it will get there.Now to coding. Way back when you had to do everything in machine language. Then programming languages were invented to make us telling the computer what we wanted easier. Then tools would correct your programming typos. Now gpt in a lot of cases will write code for you, although a human programmer could probably do it betterWhen will get to where a non-technical person could ask AI to write code without the human being capable of supervising? I'm not sure, but I suspect it's coming quick. I'm old enough to remember HotDog as a webpage writing tool and knowing html being a valuable skill. Look at Square space and stuff now. It's phenomenal. How long till we have square space of c++? The boss of Nvidia just said he doesn't think kids should learn to code. He's biased of course, but what if he's right?","No, coding jobs will be around forever because you can’t trust a core business process to be modeled and developed solely by AI. No matter how “good” the prompt wrapper that is being included is.","So to answer this question we have to answer it more nuanced and answer two other questions first:1. What exactly is programming?Programming refers to the process of DESIGNING, WRITING, TESTING, and MAINTING code that instructs computers to perform specific tasks.Programms can reach from simple algorithms to complex websites and software applications which parts are mostly written in different languages and are communicating with each other via some kind of API.Programming requires logical thinking, problem-solving skills, attention to detail, and creativity to develop efficient and functional solutions.2. How do LLMs work?I think this is were most people still struggle. A LLM does not understand what it \"says\" it is nothing more then a very complex pattern matching algorithm.To explain it I like to compare it to compressing algorithms with loss:So when a LLM is trained it \"compresses\" all the textual data it is trained on but some of the information is lost.When we now give a prompt to the Model, it is like \"decrompressing\" a part of the data.This decompressing works very well for pattern it knows from its training data like simple Code snippest you will find on github, documentations, stack overflow, etc. The more specific your case gets the more unlikely it becomes that the decompressing works well. Till you are at a point where the model starts to hallucinate (to make up text) where it tries to match the prompt you gave with a pattern from its training data, like if you tell it to write a facebook clone or the google search algorithm.Final AnswerSo if we go back what programming is we can see that LLMs can actually only help in one part: WRITING. And even there only rather simple algorithms and Code-snippets you will find on Stack-Overflow or with a quick Google Search, so you still need logical thinking and problems solving to know how to split it up into manageble parts for the LLM.The value it creates is actually that if you know how to conceptualize your code in common language you it can write that code actually much faster than you. But you have to keep in mind that we don't know the quality of the code which is online. Most likely a lot of the code is unfinished or medium-quality.Also programming changes and depending on your requirements you actually want to use different languages, frameworks, technologies. If you dont know the jargon of the domain you will not be able to generate a meaningful prompt. A friend of mine is graphic designer and he is amazing with Dall-E or Stable Diffusion. But he sucks at generating meaningful code. He knows the jargon and is also much more creative in that sence than I am.So LLMs and Generative AI in general are amzing Tools which will and already help to increase productivity. What that means is that I have more time for the fun parts:Conceptualizing what I want to do.Conceptualizing TestsWhile the LLMs help me a lot with:- research- writing CodeSo programming will not die out but it is simply adapting to new Tools like in the past. Coding Jobs will not be replaced but will change with new required skills and Tool knowledge.","Most likely, they can replace coding tasks, not jobs","Code is language, bro. Read Snow Crash. Nam-shub of Enki","\"Coding\" is the process of translating specifications/requirements in English (or other people languages) into language that the computer understands. Given the syntactic and semantic rigidity of computer languages I'd expect (but don't have the knowledge to guess) that it should be easier than English to any non-Latin non-Germanic language.","It'sa tool that is only as smart as the idiot operating it. You probably got your senior position out of luck, network, social economic status, as you obviously did not earn it. Crack a fucking book idiot.","Replacing coding jobs with AI would require the customers to accurately describe what they want.So while many coding jobs may be altered or simplified - most of them aren’t going away.","Remember that iPod game where we shot the missiles and the falling things by spinning the wheel?That’s where we are right now","There already is a coder that successfully closed 14% of open bugs on github without human intervention. This percentage will improve over time.https://www.reddit.com/r/singularity/comments/1bcyqup/cognition_labs_today_were_excited_to_introduce/","cryptographer computer scientist friend once told me\"if you can say it a computer can do it for you\"","AI still needs 20 years before it’s that good. Probably 50 years before it can really replace programmers. Its a bubble.","It can program.Talk to GPT-4 and Claude 3. Check for yourself.Having discovered your conclusion is wrong (hopefully by now), what was your error? Your error was that AI gets only a certain proportion of its output right. Actually, it gets a certain proportion of its answers right. As in, some answers are entirely correct, and others contain at least one error.Everything else you write is wrong too. But this is the central flaw.","5 years max and all your coding jobs are gone. Look at Devin it’s already doing it.","One avenue it could replace programmers is to create a programming language based on English. When computers first came out, there was no code. It was all hardware. You physically built the program you wanted to run with transistors. To make things easier, we developed things called programmable logic gates, and you could use a programming language called machine code to instruct the hardware how to use these, using a one or zero to switch them on or off. Modern computer processors are essentially just billions of those housed together, and we have built modern programming languages that take what a person writes, in code humans can understand, and translate it to the ones and zeros the machine needs to execute a task. Programming languages keep getting closer and closer to human languages. Once that is 100%, you don't need programmers anymore, as anyone can just tell the computer what they want it to do.","It's a poorly kept secret that the average human programmer is terribly unproductive.  One study I read cites just 7 lines of error free production code per day per programmer.Now with LLM copilots, you can generate dozrns lines of code in an instant.  Sure the human needs to correct it, but the net result will be an order of magnitude more productivity on a per programmer basis.Now this might either result in much more computer code or fewer programmers. The way the real world tends to work out it will be a bit of both.","You can feed the machine every recipe and describe the result.After digesting enough recipes it will be able to spit out the product faster than a human who has to assemble the ingredients. And you might get a human who is not great at it.","I created a very basic 2005-era reddit clone using ChatGPT4 with zero human programming. ChatGPT4 did 95% of the work, and I did the copy\\pasting, and scolding ChatGPT when it went off course. Don't be fooled, this was not easy, but it opened my eyes to just how close we are to something amazing.ChatGPT4 did the following, this is from my github change log:Helped setup Amazon EC2 Ubuntu Instance.Helped install MongoDB, Express, React App, and Node JS.Helped setup github and VSCode.Recommended modular file structure: Components, models, routes, and context files.Created a form to make a post and display it on the website.Created a post list to display multiple posts and sort them by newest.Created categories for posts.Created navbar with a drop-down to select a category. ChatGPT recommended the name \"bubbles\".A user registration form.A user login form.Added token, salting, sessions for persistent logins.User voting on posts.Add comments to posts and voting on posts.Added Reaction Menu's with preconfigured post reactions.User profile page.Statistics on user profile that shows that users posts, comments, bubbles created, and corresponding stats.Revamped Reaction Menu, changed it from preconfigured reactions to user created reactions. With support for voting on reactions.Changed interface to remove all popups and bad UI elements to make the site look more professional. ChatGPT chose a design that looks similar to twitter. Menu's now toggle over post content in a intuitive manner.Added global variables to track how many times comments, posts, and reactions have been voted on across all posts.Added Top 10 reactions section to the ReactionMenu, showing the top 10 global reactions and how many votes they have globally. Added variable for storing the reactions creator.Added reaction statistics to user profile. Created a new My Reactions section on the ReactionMenu, which displays your most popular voted reactions.Removed CK Editor and built its own rich text editor that supports embedding video clips and embedding images.Removed Downshift and built its own suggestion list that sorts by a basic algorithm of newest and most popular.There's about two dozen other enhancements that I forgot to write down. This project gave me a ton of insight into our current limitations. I got so familiar with GPT, that I could tell when they dumbed down the system due to high loads.AI is going to be the great equalizer. The era of elite engineering teams leading the charge in technological innovation is giving way to a new paradigm. Now, millions of individuals will be able to compete based on the merit of their ideas rather than the depth of their coding abilities.","I would've had the same questions as you a few years ago. But since then I've asked chat gpt to write some code and it was shockingly good. I don't know how it can produce code that is correct so much of the time, but it does.","I only code for Arduino as I'm an electronics engineer. The last few jobs I've done I've used chat got to write the code for me because it was just quicker. I still needed to do some tweaks to but it did pretty much what I asked for. The errors were basically from me not describing what I wanted precisely enough. Saved hours of work for me.","A lot of code writing task are trivial ones. Before LLMs you needed some cheap outsourced labor to do this task, now LLMs can do it. So in the big chain of software development you still gonna need engineer who design the system and software. But the last task of brining those ideas into code, this is where it gonna play a big role. You don't need to find outsource, you just feed it into LLMs and you have 80% of job done faster and cheaper.","ITT: programmer cope.See y'all in the unemployment line in less than 5 years. Doesn't matter if you don't think it won't replace your senior engineer job. Reality will prove differently."],"points":97},{"text":["Space Bubbles: an MIT project to restrict global warming","The following submission statement was provided by /u/DukeOfGeek:So I'm generally not a big fan of geo engineering for the usual reasons, but I dislike this one the least. It doesn't require much in the way of new technology, just building more of what we already have. It doesn't change Earth's biosphere because it is quite literally located outside the environment. And if its effects are not exactly what we anticipate it's easy to adjust the effect. We basically get a thermostat for planet Earth.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bgc1b7/space_bubbles_an_mit_project_to_restrict_global/kv64aeu/","Increased atmospheric CO2 dissolves into the oceans creating carbolic acid, turning oceans more acidic. Destroying the base of the oceanic food web will kill us just as dead as warmer temps.Every solution to “global warming” which reduces the “warming” without reducing CO2 is wasted time and money.“Ocean acidification” is the google search term to learn more.","Scientists: We should repair the Earth’s Climate by refocusing efforts on growing biodiversity, forest growth, and switching to renewable energy sources.Engineers: Or….hear us out. Space Bubbles!","So I'm generally not a big fan of geo engineering for the usual reasons, but I dislike this one the least. It doesn't require much in the way of new technology, just building more of what we already have. It doesn't change Earth's biosphere because it is quite literally located outside the environment. And if its effects are not exactly what we anticipate it's easy to adjust the effect. We basically get a thermostat for planet Earth.","While i agree with the \"we need all solutions to fix the problem\" we should probably take a long long LONG and hard look at outselves for saying \"sending a swarm of bubbles into outer space to form a sunshield sounds like a solid idea\" rather than limit the impact of all the emitting companies on Earth...","This is literally steering academia to serve the billionaires instead of taxing them, preventing waste, putting measures in place check excess and regulating processes.","This is hardly a new idea, just a slight twist of making it a bubble rather than mirrors or panels. The concept has circulated for decades, although it is true that with the price of launching stuff in space going down, it could be a cost effective way to lower the temperature on Earth. It still poses 2 huge issues: - who controls the thermostat? The UN? tall order… - temperature is only one part of the problem. the CO2 we are releasing gets absorbed by oceans who turn more acidic, which has a huge impact on wildlife. fewer solar photons warming the Earth won’t help at all with that aspect of the problem.overall, a worthwhile tool but not a silver bullet","I'd point out people have already thought of this and even with theoretical materials that don't exist yet it's an insane and unworkable idea. You'd need 3,990 Starship launches to build something like thishttps://www.sciencedirect.com/science/article/abs/pii/S0094576522006762?via%3Dihubhttps://en.wikipedia.org/wiki/Space\\_sunshade#cite\\_note-:1-7","I think that it’s a bad idea with potentially catastrophic impacts. The problem is the elevated emission of CO2 not the amount of solar radiations that we are receiving. Plants would be affected by an alteration in the composition of solar light they’d be receiving. Not all the radiations of the spectrum are used for photosynthesis, but some are used for other important biochemical processes and others like UV are the reasons for the production of many antioxidants in plants. I did my master research on the effects of using natural light modifying films in greenhouses on vegetable production, and I witnessed how the alteration of the light can affect plants. We can manipulate light to benefit some plants in a controlled environment like greenhouses, but the light requirements of plants are as different as they are, so the idea of altering the solar light that reaches earth might lead to unexpected severe consequences, which is frightening to me.","Do I even need to bother reading this article?The climate is changing.I felt like I used to understand the model based on additional molecular particles added to the atmosphere as being the cause for increasing global temps.However, when the Canadian wildfires emitted 50% of total metric tonnes of CO2 that had been estimated to be released between 2020-2035.Year 3, we hit the 50% mark of a 15-year estimate. Let that sink in.If molecular particles were the culprit of global increased temperatures? The easiest, cheapest solution would be large-scale fire breaks across the northern hemispheres boreal forest (there were very large fires in Russia and China, too).The result of the fires. A concentration of sulfur in the northern hemisphere. Sulfur leading to decreased plant growth, as observed in Scots pine tree rings, the most important species in boreal Eurasia.Generating a negative self-reinforcing feedback loop.Instead, we are mining new resources, exploiting labor, destabilizing regions for renewable energy; resources, production, and consumption.I'm absolutely for less pollutants in the air I breathe. 1 of the reasons I moved to my current country of residence.Only it feels that clean air quality and water are not of real significant import to decision makers and money takers"],"points":214}]