[{"text":["Airbnb bans the use of indoor security cameras","Next, hopefully ban the $500 'cleaning fee'","I switched back to hotels long ago. There was a golden age of AirBNB.....and it was lovely. But that time has passed.I can stay in a hotel in most cases.....and I prefer a hotel like Embassy Suites.... get decent space, good service, great location, and not have to worry about stupid fucking disproportionate cleaning fees.....after they have already asked you to sweep, take the trash out, and put linens in the wash.","That will definitely stop cameras from being used.","The fact that this wasn't already banned is disgusting. Stolen from aflyingsquanch from this article on r/news","How do they enforce this? Last I checked they don’t inspect properties…","They weren't already??","These are the exact problems that arise whenever you let VC-backed 'disruptor' companies wedge their way into a market capture position by repackaging existing solutions in a convenient way that skirts existing regulations. And the dumb dumbs of society fall for it everytime because people are willing to give up a lot of things just for a little bit of convenience and flash.Awful company along with Uber.","Finally!I remember seeing people defending the usage of them and I was just creeped out. I've also seen people defending the usage of cameras in long term rentals and am like, \"Uh no.\"","Airbnb sucks anyway. I was duped at one in Vermont. This place was marketed as this zen isolated getaway glamping site on a farm… it was not even 15ft off a well traveled public road on a CURVE. There was a privacy “fence” (which were just tarps), and headlights would still light up the entire campsite. One drunk driver could easily take out the whole fucking site too. Talk about “relaxing” 🙄Airbnb wouldn’t refund for false advertising either. There was no indication anywhere that it was so close to the road. The host used her disabilities as an excuse (I don’t care) and fought until the end to keep my money even thought we left 10-15 min after we arrived after an 8 hour drive.Eventually, Airbnb did refund me as I was a thorn in their side until they did so. I had already begun the credit card cancel payment process though, so they knew they weren’t keeping it anyway and then just tried to save face.They wouldn’t let me leave a review though because we technically “didn’t stay” there. They 100% sided with the false advertising POS host.Fuck Airbnb. Hotels and lodges all the way.","Sure, how will they enforce that?, plus the hidden cameras.You will be recorded in many places like that.","Next ban the use of Airbnb","The last time I used airbnb I was very nearly assaulted & kidnapped by the Russian mafia running a weird bait & switch scam in SF.  The cameras were the least sketchy thing about them.","Ban the sudden cancellations and readvertising when they realise there’s an event in town.","Airbnb cancelled my account for a “party risk” and tried to fuck me out of over $1k when I tried to book a place for family flying in from out of the state for my birthday. Fuck that company.","Fucking good.","lol! It took that long?!?!","Hotels are great. Why people still use airbnb","This wasn't a thing before? Glad I never used AirBNB","Only just now? Yikes","If their history with skirting the law in New York and other cities is any guide, they've probably just been saying its an obligation of the person operating the illegal hotel to comply with all local regulations, and doing their best to avoid any sort of liability.","Fucking finally. The place I stayed in had two in the kitchen/ sitting room, one looking down the stairs and upstairs area, another looking down the hallway leading to exit door. It was like a fucking prison. She even wanted to have another in the sink so it could look up your nose incase you didn't do the dishes.","This won’t stop. If anything it will increase the frequency of customers finding more and more","On the airbnb sub I had some heated conversations about these cameras. A lot of airbnb host feel as long as they’re in community areas (kitchen, living room) they are fine. They even tried to compare them to hotels having security cameras in their lobbies.","About fucking time. Creepy.","ban airbnb","Air BNB is effin dumb. Never in a million years would I want to stay at some randos house.I'm too of that. The house market gets fucked over because rich assholes buy these houses JUST to use as airbnbs. I hate whoever invented that shit and made it mainstream.","You mean they were allowed up to now???Holy fuck. 😂","This should have happened a long time ago. It’s the sole reason I stopped using them. That and the ridiculous cleaning fees","This is dumb. The cameras people should be worried about are the ones that the listing wouldn't disclose to begin with and that Airbnb doesn't know about.","I’m fucking sorry, was this not already banned?!?","Keeping cameras in any form of temporary living space is a violation of privacy. It is the equivalent of a peeping Tom. Personal affairs, business affairs, would all be recorded and kept on record by a third party that otherwise has no business/right being privy to a myriad of private correspondence that could occur during boarding. A legal matter, a business deal, etc.","This presents a fantastic unethical life pro tip.Bring a webcam with you and do your stay. Then set it up on the last day and \"accidentally find it\", snap a photo and then complain to Airbnb.Get full refund.Tell the people that they're cleaning fee was fucked and that's karma.","Oh kinda like how guns are banned in gun free zones","While I agree there’s privacy concerns, the camera movement started because of people trashing airbnbs. I think if many units start getting trashed it will lead to less properties available because people will just decide to rent them conveniently.","Spoilsports","Man the Airbnb hate is so massive. I only use Airbnb and I have never felt like I was over charged or taken advantage of in any way. They’re always cheaper than any hotel I can find nearby and I get much more space and bang for the buck. But if there isn’t an airbnb then of course I’ll get a suite type place but for me it’s always airbnb first hotels second."],"points":1709},{"text":["Surgeons use Apple's VR goggles in an operation for the first time in the UK as they repair a patient's spine","Misleading headline. “A scrub nurse working alongside the surgeon wore the device to help prepare, keep track of the procedure, and choose the right tools”","This article doesn't know what it's talking about. They claim the Vision Pro was designed for computer games...which is the last thing Apple had in mind. Also, they claim that AI tracks how well the surgery goes?? What AI does that? This is a fluff piece with no real information on how it's useful for the industry. They probably just had basic notes and images up to make referencing and notetaking easier as another commenter stated.","Wow that’s awesome. Those spine cases can get real long and boring, so being able to toss on some Netflix would be really helpful.","This is great, but also it's not the first AR/VR/XR device to be used this way.Microsoft Hololens: How Microsoft HoloLens is helping surgeons work together across thousands of miles | Windows Central and this is just the first article I pulled up on search.​HTC Vive, Sony VR, Oculus (maybe others) have all been used in surgery as well.","aha!, but when you use a Logitech joystick to drive a submarine....","Thats not the surgeon….","Can the goggles survive the autoclave if they get covered with infected bodily fluids?","theres no way the passthrough is good enough to perform surgery with it on lol","Fluff pieces won't work","Unless YOU are a surgical nurse, you are clueless. Stop bashing progress","It wasn't the surgeon, it was a scrub nurse who was recording the procedure - no way remotely suggesting an ER scrub nurse isn't essential but this headline is typical media over-hyped drivel.","Apple ad","Ah the Daily Heil, top primary source for medical news.","I may get downvoted for bucking the Reddit tradition of shitting on anything Apple that is priced above a Big Mac, but this is pretty cool and should help reduce error in the OR.Some of y’all need to wash the salt off","Probably YouTubing what to do in real time","Did they get high score?","Awesome. So there’s hope I can play poker while working…./reads article/….oh well.","As someone who has had a spinal surgery, I like it when the surgeon uses their own eyeballs.","Of course this happened.","I'd be super worried about keeping it clean.","“The underlying AI software also keeps a note of each stage of the operation – and in future will measure how well it went against similar procedures performed by other surgeons.”“How the fuck does Steve in Alabama keep getting the high score on these surgeries? Is he using the Konami code?”","Really cool stuff for the future. I’m friends with the owner of Exex (who created the software used here) and not even 10 years ago he was just doing movie production and photography. Eventually he pushed into AR because he saw a lot of potential, though I never expected he’d end up taking it to the medical industry.Fwiw, these glasses are currently used to track the materials and tools used during surgeries, not necessarily “assist” with surgeries in a medical way. At least not yet — who knows what capabilities AR will have in the future.","It would help less experienced individuals work together, i.e those who do not know the names of the surgical tools, tissue or organs to be retracted. I think this eliminates the guesswork. I do not see a formula 1 pit there😂","No bill you still look like a dork","I'm sure the patients end up paying for goofy shit like this.","I’m going to pass on that assisted surgery.","Imagine your doc is about to replace a hear valve with these on and he gets a pop up notification saying he has a new friend request on Facebook …..","The OR lights often have a camera built in the handles pointing at the action to be viewed on monitors. Usually for teaching purposes. The goggles add no value. If anything, if they shift, it would be a nuisance to adjust them while maintaining aseptic technique.","They are watching a how-to video on YouTube while doing the surgery","Hang on, sending noods now","why do they want me to buy one so bad?","I bet he was looking at porn","Imagine if the surgeon was wearing it and had a 24 hr surgery. They would need to stop the surgery many many times over or they would be tripping over wires. What's next? \"NFL quarterback is using apples VR to help read the defense\" lol","","Incoming malpractice lawsuit in ...","Ah, that's why it costs so much to go see a doctor.....","Why, why, why, why, why2, lehy...-Billy Gnosis"],"points":1653},{"text":["iOS 18 to include new 'hearing aid mode' for AirPods Pro, report says","I'm a hearing aid wearer and have been waiting for this forever. The sound that comes out of hearing aids is terrible. I stream music to them and it sounds like a AM radio.Hearing aids with real speakers? I'm in.","Is this all Pros or just Pro 2s?","I'm 100% deaf in my right ear. Never getting it back. I can get hearing aids that play sound from my right side in my left ear, but they all suck at filtering out human speech, or are expensive. I've tried various ear pods but the lag has been noticeable enough to annoy me. If they can fix that it would be a dream for me","Can’t wait to try these out at 21","this is amazing! hearing aids comfort and quality can be much lower than airpods","Might this come to Canada too? Dunno what the laws are like here vs. US around this stuff.","Gonna guess these will make it easier to listen in on other’s private conversations?","We can’t even change the volume of a video independently while on a call and they’re adding a hearing aid. I get it’s helpful for people in need but wtf bro"],"points":94},{"text":["Nvidia RTX 50-series Blackwell GPUs tipped to use 28Gbps GDDR7 memory with 512-bit interface","Can't wait for the 5000 series to arrive, so the prices of the 4000 series will drop enough for me to be able to afford a 3000 series.","Will still ship cards with 8gb or less","Selling Kidney to buy Apple is old news, Selling soul to buy Nvidia is new","Glad to hear they'll set aside some damaged wafer scraps for the gaming plebs to sell for 3000$ while making the real money with AI devices.","Remember when the processor used to be the most expensive part of the computer? Pepperidge Farm remembers.","That will be a cool $4,000 drop.","I can't wait to play OSRS on this beast.","People keep complaining about Nvidia’s prices (rightfully so), but yet Nvidia can keep charging that much because obviously people are willing to pay those prices. I wish people had more of a backbone and just waited.","Will still come with 8GB VRAM.","reminder that you can find used 6700xt's for around ~$250 USD that can basically play any modern game in 1440p 60fpsdon't let nvidia fuck up the gpu market again pls :)","But will they finally start using DP2.0 like AMD and Intel?","Yesterday I read they weren’t using 512.","but will it run crysis?","Can’t wait until the first variant of 5080 comes out and it’s still only got like 8gb of vram, so they can release a super or ti variant like a year later for 50% more with 16gb of vram","I fix graphic cards as a hobby. The 90s series have so many memory chips they have to put it in the back and there's no heatsink to cool them off. Those chips are only cooled by thermal pad touching a backplate and prone to be overheat/die. Not to mention the super heavy heatsink in the front sagging the pcb and causes broken solder joint.I cannot even imagine cramming more hotter rams into the card. Somebody will have a heart attack that their $4000 card dies so quickly.","Better have DisplayPort 2.1","Gave up and just signed up for GeForce Now. I can keep the sub forever and it’ll still be cheaper than buying their flagship GPU.","Wow so they can have an amazing 6GB of RAM.","Intel Arc a770 crew 💪","This would be a massive upgrade for 1000 series users and great for 2000 owners. But for the current 3000 series owners needs to see more detail to figure out benefit and cost.","Running Minecraft with RT.","Still rocking an RTX 3090 FE. Looking forward to the 7xxx series 🫤😊","Starting at the low low price of $15,000","Wondering what kind of exclusive feature they will bring this time,like dlss3.","People talking about the price but forgets the size. This will be a size of a small car.","I'm so out of the loop these days. Which one has the most Vram?","Bro I feel like I’m still breaking in my 2070 leave me alone","so what, they going to charge 2 grand for a mid grade card now? nvidia is fucked in the head.","only 16gbs worth of VRAM though","Yeah well you see...my 3060 will still taste like 12 years so ... Don't care","Consumers are like sheep storming after the hype shepart. They will sell like hotcakes and PCMasterrace will be full of \"my first setup\" or \"finally made the purchase\" posts with thousands of upvotes.","I have a 4090 now so that should last through the 5000 series and into the 6000? series.","Luckily ich bought a 1080ti a long time ago And don't have to buy a new GPU in the foreseeable future, I really don't like what Nvidia is doing and their prices.Instead I got an upgraded cooler for my old GPU, so I could overclock it and went from 8200point in superposition benchmark to 9500 points. :)Repair your stuff and don't throw money at it.","Will it be worth it? Might finally build a pc and might as well start with the upcoming gen","I wonder if it will be a good investment to heat my appartement next winter?Maybe if I add any CPU release from Intel?","Which company makes the DDR or do nvidia do it themselves?","Wouldn’t it be amazing if it was 28gbps with 8gb on board?","They can roll it and shove it into their buttocks with current prices","Do people realize you don't have to upgrade a gpu often at all? I have a 3080 and game 4k at 120 fps and don't have an issue. It would be a waste for me to upgrade to the 5000 series unless something changes significantly in the next year.","New 5090: 1 Arm, 2 Children and your car.","Looking to upgrade my 3090. Was holding off to the 5000 series. I imagine the specs will be pretty impressive.",""],"points":1462}]