[{"text":["Speaking without vocal cords, thanks to a new AI-assisted wearable device"],"points":0},{"text":["A ChatGPT for Music Is Here. Inside Suno, the Start-up Changing Everything","“We’re trying to get a billion people much more engaged with music than they are now. We’re not trying to replace artists.” Lol… i love how people call it “ to democratize” . Not a music maker but that has zero with democracy to do. You been always free to do whatever you want you just been to r-worded and lazy. I bet its all licensed data it was trained on :)","Suno appears to be cracking the code to AI music, and its founders’ ambitions are nearly limitless — they imagine a world of wildly democratized music making.Someone needs to \"democratize\" the creation of AI-based tools that can \"democratize\" other industries.","I hate this so much.Give me a real musician making real music with real instruments and real voices over this crap.","That's insane.","I'll stick to my favorite 60s/70s bands who wrote their own songs, played their own instruments, and sang the lyrics they wrote themselves."],"points":10},{"text":["Ahead of IPO, Reddit blends advertising into user posts","Enable comments on ads, you cowards","Been for a while now? My \"favorites\" are the ones that start with like [MEGATHREAD] or [PSA] or similar in the title. Like for a second it does work. Then I read the title and I'm like \"which fucking sub is this?\"","I don’t have an issue when scrolling thru to see an ad but the top comment placement is disjointing and odd. When a user clicks on a post there is a desire to engage on that topic not see something irrelevant.","This has been a thing for years now...","Reddit has never been worse, barely usable, images don't work, feed is useless and whole site seems dead. Destination? Penny Stock.","[Megathread] how does Jesus love so many people?I hate these","By the way, have you heard about Progressive - the #1 combined personal and commercial auto insurance company?","Enshittification ruins everything eventually.","The worst part about it is it’s just straight-up lying, you can’t comment on them. Don’t let them use [MEGATHREAD] in their title if it is not, in fact, a megathread!And the ads mixed into the comments are just as useless and annoying. And they don’t work, because they are so off-topic I write them off like bots.","I just keep reporting them for sexually explicit content 🫡","just even more reason to not use the app","Veridian Dynamics - we, like people, like people.","For the shitty ones atop the comments, report them as offensive because they are.Downvote every single one that looks like a post.Please do note that the former CEO Ellen Pao on cnbc said very clearly in an interview that a path to profitability includes selling user data and getting rid of content advertisers don’t like.Edit-call out correct ceo","is it just me or has the app been a lot more glitchy lately? like comments are being duplicated and also disappearing.","It’s already been a thing for years.Look at the movies and entertainment sub. They are owned by movie studio shills.Almost every post on front page of movies is same super users and any comments who mention it get banned.","Old reddit, with an adblocker, and a third-party mobile client. No ads.","Don't they know that we're the least monetizeable user base on the net? I feel like that needs to be repeated more...","As soon as Reddit goes public, this place will slowly but surely go to shit. Nothing good ever happens when companies go public.","This sub got taken over by Fox News bots so I believe it","The enshittification never stops","Old.reddit + ad blocker + third party app. I've never had to deal with ads.","There goes Reddit - none of these companies get it -- We don't like advertising! We will pay to get rid of adds, but it means ALL ads, ALL the time. Otherwise, we don't pay or use you. Learn from Google.","Like how every new movie is trending with 12 comments and 53 upvotes after 24 hours. Uh huh… clearly everyone is excited for this movie.","Cashing out and making Reddit as shitty as twitter or Facebook….","This is why I think that Reddit will fail on Wall Street. Reddit users aren’t as moronic (on average) as users of other social media platforms. Trickery will not go over well with Reddit users.","This IPO will ruin Reddit. Period.","I love anal but hate the risk. Thats why I use Trojan. Americans favourite condom brand.Keep the poo out the pee hole. Use Trojan™️","It's been like that on old.reddit.com for a while now.","I would like to know how many people like an ad. And I would love to read the comments on ads.","Ah advertising, a growing revenue source for tech companies worldwide.","Cerzasa Crystal","It was nice knowing y’all. It was a good run.","This sucks! Brought to you by Carls Jr.","It’s been that way for a long time. This headline is useless","Fuck Reddit, garbage platform","Ya the McDonald’s one is really fucking annoying. I haven’t eaten there since I was 24 - 38 now for referencez","Should of protested the app when they was forcing the shut down of bacon reader, alien blue ect… no one has any self control anymore","But Jesus really does love you….","So? It’s their site and they can do whatever tf they want. If you don’t like it then stop using it. No one is forcing you to open this app everyday lol."],"points":1822},{"text":["Landline Users Remain Proudly ‘Old-Fashioned’ in the Digital Age","I still have and use my landline at home. We live in a very rural area. Our cellular service is spotty at best. I know if I am getting a call on the landlines it is important.","My parents had to give up their landline. Last time they upgraded it and got a new number, the person who originally had that number apparently had a LOT of debt so they were constantly harassed by collectors.And of course landlines don’t make it easy to block calls.","Can we differentiate actual landline users vs VOIP users (which a lot of \"landline\" phones actually connect to a cable modem these days)","It's gotta be hard to give up a phone number you've had for 30 years.","Good to hear Robert Caro and Vivian Gornick represented in the Times.","I just ditched my VOIP landline because I was rarely using it, and paying $6-7/month in FCC fees. That's almost as much as a streaming service.","I had a landline for a while but the constant robo calls just made it an unbearable nuisance","Who can afford to pay for a duplicate service to cell in this day of innumerable and outrageous expenses?","\"Alright dear, that was always allowed.\"","I have a landline for an alarm system and my internet.If I didn't have the landline, when my cell sim card died for no good reason I would have had to spend a day or so going to a physical Verizon location instead of talking with help on the phone. TLDR: Still useful.","Old is ALWAYSE bad we must advance FORWARD not BACKWARDS"],"points":32},{"text":["The Wall Street Journal: Meet the Tech Company That Had a Better Year Than Nvidia","Super Micro Computer. SMCI ticker. If you didn't know already.","WSJ is breitbart for right wingers just barely smart enough to not use the N word publicly. They clutch their pearls about Trumps antics while voting for him and his shitty team.","So where do we think this one goes from here?","Nvidia is a chip making factory to make chippery chips to play games on it and stuff"],"points":23},{"text":["Used EV prices fall much faster than gas cars, according to iSeeCars","Part of the reason for this is that Tesla dropped prices dramatically last year, so all used EVs had to compete with that. I saw a lot of EVs in used car dealerships that couldn’t sell because suddenly new Teslas were cheaper than used ones. The dealerships or original owners are now in a tough spot, where the dealership might have to sell it at a loss, or the original owner might have to sell it for less than they owe on their loan.This was also exacerbated by the prices being too high in 2021-2022. Owners overpaid for the cars and so when Tesla had large prices cuts in 2023 that meant the owners couldn’t sell their cars to break even on their loans. This situation affected ICE owners as well but ICE manufacturers weren’t cutting prices as far. Also because Tesla has 55% market share for EVs in the U.S., when they cut prices that far it hits the entire EV sector in the U.S.","Early adopters pay more initially in pretty much any product as technology advances quickly. This shouldn't be a surprise.","This has always been the case since the 2nd gen Nissan Leaf. EV technology advances rapidly rendering past generations less competitive for the used cost. All rapidly maturing technology has a similar problem.","How much of this is because prices have been going down for new cars due to increased competition and supply?","Yes. Because you can get a $7500 rebate on a car when you buy it new. Most cannot get any rebate at all on a used one.So the moment you drive it off the lot its value drops $7500 plus whatever amount other cars lose due to \"preference for new\".Then there is the improvement of new vehicles versus old. If I buy a new Accord it's really barely different than a ten year old one in capability. But if I buy an EV the new one is far better. Charges faster, goes further. etc.When the Tesla Model 3 came out it was overall, a better car than the Model S was. That means someone could get a new car for about $40K that car that was better than a Model S. So any used model S had to be sold for less than $40K. Even though it cost $80K-$90K new. Yeah, that's gonna hurt.It's really not hard to see why this happens. And it mostly isn't inherent to EVs. It just market conditions due to how EVs are being sold right now and rapid advances in the vehicles.","I think most tech enthusiasts knew that's what's gona happen,the EVs don't break down like the gas motor ones but when it's time to change that battery,you're f'cked","Because they were artifically inflated during COVID. I remember brand new Mini Electrics costing £21,000 before COVID that suddenly became £29,000 during. Super cheap electric econoboxes at the £18-19,000 mark were dropped completely, and a glut of promised £30,000 priced cars all entered the market at £40,000+. I consider the rapid drop to be an estimation of the true value the cars had when they were sold, which was all roughly 10k lower than what RRP was.","Used car prices have been heading in the right direction after months of elevated values and inventory shortages. Even so, the values of some vehicles have declined much faster than others, with EVs doing the heavy lifting. Automotive data outfit iSeeCars' latest study looked at used car values over the past year, finding that used electric vehicles are dropping at a much faster rate than their gas-powered counterparts.While used car values have been dropping overall over the past year, used EVs have dropped like a stone in comparison. iSeeCars found that the average for used electric models fell by up to almost 32 percent since 2023, while the used gas vehicle average price sank by just 3.6 percent. Used EV pricing trends over the past year look like this:February 2024: -31.8%January 2024: -30.8%December 2023: -31.2%November 2023: -33.7%October 2023: -33.7%September 2023: -39.1%August 2023: -38.7%July 2023: -34.7%June 2023: -29.5%May 2023: -29.9%","The cost is too high. The charging network is anemic. The repair costs of even lightly injured EV is astronomical. The industry needs to get their shit together. The cars need to have longer range. The charging infrastructure needs to be financed by the auto makers. And the cars need to be made in a way that isn’t, catastrophic when faced with the fender bender.","Alternate headline. “Tesla cuts margins to boost sales dragging down sell price of the entire EV segment.”EVs aren’t inherently worse for resale value. Tesla just tanked the market. Every other manufacturer tried to make the most luxurious and feature packed EV they could at the prices Tesla was charging. Initially people said Teslas weren’t worth it because they weren’t as nice. Now that Tesla cut their margins those more expensive to make EVs both don’t sell and don’t have the margins to lower their prices to a competitive price.This won’t happen a second time. Tesla got lucky and took advantage of it.","Doubt it I still see used 2016 tesla for crazy high prices compared to 2016 gas cars lol","As someone that just bought a used electric car.Bought a 2019 full electric ionic for the same price as the 2019 fuel one.People dont want them because the tech advances too quick. A brand new 2024 electric ionic has 400km range. The 2019 has barely 200.","Uh maybe because EV tech is advancing at rapid pace, so your 2019 bolt depreciated a lot more when comparing it to an Ioniq 5 that charges 3x faster. This isn’t that hard to figure out. This is what happens when new tech emerges","You can get a model S these days for $30k! Great buying opportunity if you are in the market for a car now. They used to be like 50-60k used","Around Christmas, I got an email from Toyota promoting their hydrogen-powered Murai, a car listed at about $55,000, 0% APR load for 72 months, and with $37,000 in 'incentives' that brought the cost down to $18,000. I thought, \"Wow, a Toyota for nearly a third of the list price. Such a deal.\" The deal was legit, and the car was very nice. However, it is hydrogen-powered, and part of the deal was $15,000 in hydrogen credits for fuel. I live in a metropolitan area of almost 10 million people, which has about a dozen hydrogen stations, and the closest was twenty miles away. That might have been manageable. Then, I happened to be talking with a friend who operates a body shop. He told me they had a year-old Murai in with a banged-up quarter panel. The damage was cosmetic, but the insurance estimate totaled the car. Repairs required the removal of the hydrogen tank and related parts, which pushed the bill into the stratosphere.This was in the ad -APR offer is available through Toyota Financial Services to well-qualified buyers with approved credit. Not all customers will qualify. 72 monthly payments of $13.89 per thousand borrowed. No down payment required if qualified. $22,000 TFS APR Cash incentive from Toyota in addition to standard APR financing when vehicle is purchased and financed through Toyota Financial Services. On finance contracts, incentive will be first applied to the down payment. One incentive per finance transaction. Incentive is available on approved credit to qualified customers through Toyota Financial Services. Not all buyers will qualify. Dealer fees may apply. Must take delivery by 1/2/24.Customers who purchase a 2023 Mirai by March 31, 2024, will receive complimentary fuel for six years or $15,000, whichever comes first. Complimentary fuel term begins as of card activation or 90 days after Mirai purchase commencement date, whichever is earlier. Fuel card is nontransferable.","If anything that’s good, EVs need to develop a second hand market. Only real problem is that depreciation makes owners less likely to list, can only hope that balances out","The other problem with used evs is the older they are the sooner the used batteries may need to be replaced. And the batteries cost a fortune to take care of. So buying a used ev and then having to fix the battery is crazy expensive.","As someone who has been car shopping, the problem is one of trust in the longevity of all electric cars. I see a lot of articles about how Tesla bricks cars, how insurance companies won’t repair them, and how the batteries cost as much as the entire vehicle. No thanks.","A $15,000 battery repair will do that to resale value.","“Teslas are appreciating assets”","Tesla model s plaid dropped prices from $127k to 83k and of course this sent used car prices off a cliff.","Until there are easily replaceable for reasonable cost batteries, or battery technology advances to where wear is no issue for 15-20 years guaranteed, this will remain the case. Currently, owning an EV out of warranty is a major liability, whereas a gas car's engine can be replaced by a good used one for a couple thousand dollars.","As for so many of the comments here... imagine going to every ICE car thread and asking/proclaiming the engine is going to die as soon as the warranty period is over. What?","Without doing any research I'd generalize many people looking for their first EV are looking in the ~5-10 year-old range. At that age with an original battery, the management system will do it's best with the inbuilt metrology instruments to give a good estimate of remaining life and range, but it doesn't account for volatility. It's just a gamble that one day your old EV with great range stops working completely or has severely reduced range one day.","Imagine actually voluntarily wanting to purchase an EV, YIKES!","Good. The sooner we replace used gas guzzlers, the better.","The battery lifespan in EVs is only 10 to 20 years, and the cost of replacing them is thousands, if not tens of thousands of dollars (depending on the vehicle).When you buy one of these cars used, it has a very short lifespan left before the owner either has to junk it or incure a massive cost.This guy decided it was better to blow up his Tesla with explosives rather than pay the 22k battery replacement cost.https://people.com/human-interest/tesla-owner-blows-up-his-car-when-faced-with-22000-repair-bill/The used prices would have to drop rapidly to reflect the significantly shorter usable life of the vehicle. Is this not obvious? Who wants to buy a used car and then immediately also have to pay a tens of thousands dollar expense to keep it working?","The west should start implememnting full battery swap charging like is being done in China,they literally swap the entire battery out with a fresh new charged one in a minute with robot arms in a garage ,as quick as filling with gas or faster then the value of cars would stay stable a long time because you dont have a giant 20k $ battery degrading over time ,you only have a motor to worry about which will last years then and you always have a fresh/working battery in the car","They were much more expensive and now that the new ones are coming down in price it makes sense that the older models would have a greater drop in price.","Having needed to buy a new car after a total loss in early 2023... Feels bad man...","I mean thats a good thing though.... its a great time to buy an EV, we've gone from paying like $40k for a used tesla model 3 to like.... some cases of it being sub $20k around me","Good! I may be able to afford some first gen teslas… lol","The main issue is EVs are so new for the mass market that there’s literally a bunch of unknowns, and this lets ICE manufacturers FUD* people into more drill baby drill.Same thing happened when hybrids first went mass. My first Prius, when I bought, nobody knew how long the battery and induction motor would last, nor how long efficiency would last, nor what the future would hold for improvements.18 years later that Prius is still going with only general maintenance needs and a slow leak on the A/C I had to fix.oh sorry I meant “advertising”","You are talking about one depreciating asset falling faster than another depreciating asset. Cars are NOT an investment and should not be treated as such.","I don’t know why people are surprised by this.","Think of it like buying a 5YO pc, compared to a 6YO pc, 7, 8, 9, etc. technology depreciation is more exponential.At least until we have a vibrant 3rd party parts ecosystem and rebuild options.","BUT if you get a used electric, chances are the battery is still under warranty and the simpler mechanical systems means there’s likely less expensive repairs or maintenance. I have an electric from 2016… dirt cheap to keep on the road and I love it.","I buy cars for a living. Lots of cars, for a very large independent dealership. The ONLY value buy right now are used EVs. They're rapidly depreciating and significantly less than new while everything else is appreciating due to rising demand and limited supply. Great time to buy a used EV over the next couple months.","So how bad is battery degradation for the EV vehicles that people buy used? Does the capacity change yearly and how much do the batteries cost to replace? I don't buy used phones without a replaceable battery for this reason, most used phones without replaceable barely keep a charge.","Nobody wants to buy a used battery","It would be wonderful if the people flipping Teslas during 2020-2021 completely fucked themselves.","Not surprised. Not interested in a used battery or the price to replace it if a cell takes a dump.I’m still not interested or convinced on buying a new EV either.",""],"points":955},{"text":["Low-cost passive maglev upgrade tested on regular rail tracks.","How would this be cheaper to build and run than regular rolling stock?","How does a magnet create repulsion against a non magnetic steel rail?","Cool, but what would that system do at railroad crossings? It looks like it has wheels inside and out of the rails but at crossings there isn’t room for those guide wheels.","Nothing says safety to me like running high speed rail on top of crumbling rail infrastructure.","There are applications of this: space railway. Union Pacific actually demostrated similar technology ~15 years ago as part of an experiment to move containers between their LA yards and the LA port. While this has limited application for terrestrial earth railways, this can probably work as a conveyance system like for elevators or warehouse palletjacks. For example, imagine a million 24x24\" of these on a narrow-gauge railway within an Amazon warehouse complex moving parcels around between trains or intermodal containers. Such a system works better with a typical 48x48\" pallet though, and I can imagine it being a central part of very large warehouses and factories."],"points":40},{"text":["Increase in AI-created child pornography, police sounds alarm","Well, difficult topic, but won't pedos being able to generate AI CP images reduce the demand for real CP content, and thus reduce the number of victims ?In the other hand, I guess it could ease exposure to CP contents for people on the edge, thus normalizing it in their mind, resulting in more victims.Tricky.","CP found it's way into many datasets used for training ML models. Most datasets are simply list of links pointing to images that are downloaded before training. At any point the images those links point to can be changed to illegal material. Moreso, these datasets are so large it's almost impossible to scrub through them for illegal material completely.It is not outlandish to think that most companies hosting large image datasets are currently hosting some CP unknowingly and training models unknowingly on it.","I had a social politics course in '04 where the professor brought this very thing up as a hypothetical problem to debate. He called it \"fully computer generated child pornography.\"The class absolutely lost their mind debating it.","Some AI programs make it easy to create nude images. The developers should limit the possibilities,\" says Van Mierlo. Commands to an AI system that lead to the creation of harmful material should not be executed.So let me get this straight. He's saying that tools meant for creating artistic works should be made incapable of producing anything remotely NSFW. That's insane, especially for Europe which is supposed to be more liberal sexually speaking. The problem is when people mix the concepts of kids and NSFW, not when people make legal NSFW content.","I don't know how to say this... This seems like a positive alternative given that it's never going away","This is going to be controversial.Mind you, I work in a field that helps to stop child predators.The issue with CP (aside from being immoral) is that its use and trafficking directly causes predators to create more content, which involves abusing children. AI CP, while equally immoral, doesn’t cause more victimizing, aside from the typical gradation that a small percentage of actual pedophiles do (they see content, normalize it, then assault children).Some could see this as a form of harm reduction. I’m inclined to agree. Though on a personal note, I think it is horrible and shouldn’t exist either, but that is a utopian view.Sure, make it illegal but focus on the traffickers of real and Ai CP.","At some point, when no likeness of any real children is involved, it should stay deeply immoral but not criminal.","As long as it is not trained on real CP, there is nothing that should be illegal here","We just keep giving skynet a reason to judge.","Is there a black mirror episode where any images are made illegal?","what about ai generated pictures of other crimes? wouldn't they be just as problematic? why is it that ai cp is the issue at hand, what is going on with our society?","AI could so vastly improve work life balance at some point but immediately the worst of the worst use the tech to just ruin any positive notion about AI.","How about; Should a real person that is of the age of consent but looks younger be allowed in porn?","Some humans really just surprise you in how depraved we can be.","Eeeeeeewwwwwww.That is horrific. Gross. Lame. Beyond the pale.","Fucking gross 🤮 !","Slippery slope.","Ever a sick society and all the idiots saying it's fine. Crazy","AI image generation should be licensed and images being water marked to identify the creator","Ai hyperealistic child hentai porn should be bannedEdit - look at all the people that support child porn downvoting me 🤣","[deleted]","What’s sick is AI s being trained to make CP based on the images public available regardless of consent. So all those pictures of your family and kids are being used to train AI and make porn. And with zero ethics or regulation in this industry right now.Edit: getting downvoted because people don’t like to hear this truth. Even public cameras can take your image and post it online to be trained on without consent. As long as it all happens in public.","Fuck we are in some strange times.As a therapist that works with sex offenders and victimsAny image of a child engaging in sex should be illegal because it’s only going to increase sexual deviancyThere is no line that it’s drown…where does it stop?","The law is the fucking law...except in all other situations than this. Fuck this.","Well, I think that’s pretty much it. I think I’m officially done with humanity. It’s been a slice…….🤢🤮 I seriously think I’m going to be sick."],"points":689},{"text":["New online investment scams powered by bots to simulate fake experts","A fool and their money are easily parted.There is this hilarious masochism of considering Wall Street bad, shareholders evil and Capitalism bad, and by consequence, to reject the idea of learning personal finance as a personal responsibility.Then this shit happens. People are so illiterate they consider a \"5%/month returns\" realistic when a scammer shows up at their door. That's what, 80% a year?","Fake fake fake.","Some new online investment scams are no longer impersonating real companies in phishing attacks, but rather the company name, registration details and promised high return rates are entirely fake.“The risks here are quite different,” explained Robert Duncan, vice president of product strategy at Netcraft. “The money involved in a successful campaign might range up from [thousands of dollars] from each victim, and the victim intentionally sends money in connection with the scam. Depending on the jurisdiction, banks may treat this quite differently to authorized payments made in other types of scams.”"],"points":11},{"text":["Why quantum computing is a threat now even though it is may be 10 years away","It is only good at certain tasks, but math is one of them. Cryptography foundation is built on math, prime numbers specifically.This is oversimplified. Plenty of cryptography is not vulnerable to quantum computers, we are pretty sure. Quantum computers are not good at math in general.","Oh my god this sub loves scaremongering stories.","maybe in next 5y the bitcoin is worth 0.","This article is right. Harvest now decrypt later is a very real threat in the present, not just the future.","10 years ago, quantum computers were also \"10 years away\"."],"points":8},{"text":["'Drinking bird' toys upgraded to generate clean energy from water","Now I'm picturing a giant pumping oil derrick looking device sitting behind every house....Very interesting idea... I guess the real question is \"how scalable is it?\"","\"It also achieved a voltage output of up to 100 volts, which was sufficient to power devices such as calculators, temperature sensors, and 20 linked LCD screens.\"I'm actually stunned this seems significant, right?I recognize 100V isn't much without watts or amperage, I was going off the LCds. I forgot they come in small form, I was thinking tvs","There's a reason why they submit a claim of 100 volts but without saying anything about Watts its nothing more than a pipe dream at this point.","So it's an inefficient sterling engine powered by evaporating water?","It also achieved a voltage output of up to 100 volts, which was sufficient to power devices such as calculators, temperature sensors, and 20 linked LCD screens.Please, if you’re going to write about energy generation, look up what units are important. You can get 100 volts from of a coin cell battery with the right circuit. It’s meaningless.As you might expect, it’s not much energy. Scrolling down through the paper, they’re generating 40 microwatts.","Sampson’s memory triggered","i would totally buy a drinking bird assembly kit with a battery and controller"],"points":59},{"text":["Hackintosh is (almost) dead","Lede buried at the bottom of the article:Lest I forget — if macOS Ventura works for you, stay on it! That’s still perfectly stable without a single issue across a variety of build options.","That’s a bummer. I ran a Hackintosh for years, and really loved it. Now I run an M2 Mac and am very happy. They’re really great chips, so I don’t regret the ‘real’ purchas","Why are we self destructing all these cool techs that mega corps don’t want us to use, they just took down yuzu too"],"points":13},{"text":["Large South Korean Companies Withdrawing from China","Well let’s see start a company there and you have to share your whole process with the office of science/ industry. Any equipment your need needs to be approved or if you import it all details and designs must be shared, You have to teach the local staff. So basically your showing them everything No secrets.Then some of the staff leave and start a new company doing what you are doing. No respect for patents. Look what happened to ARM a few years back local guy just took it over lock stock and barrel. Or even Mercedes And I bet Tesla CN is not safe either …. So this is not surprising","Keep it going. All western manufacturing should pull out of China. Let them try and prop up their own economy with their own money.","Why are they there in the first place? They’re not allies and SK makes most of its own stuff or from Japan…..","Yes decouple from CCP.","Hasn’t this been going on for a really long time? I mean since 2015","Of course they are. they cant compete with local companies there.","It's karma,they all moved to China for cheap labor and left a lot of our people without jobs,China stole all their tech and now getting them out of business,the Bible warned us about greed,those that don't heed will repeat","It is a short article and only examples it discussed is the battery and car industry. Are there KIA boys in China? I would not mind KI A withdraw from the U.S."],"points":108},{"text":["VC/DC: Silicon Valley wants its cut of US military spending","Most tech companies have been laying off American employees, offshoring operation to other countries and hiring foreign workers through work visa.. How are they going to get more defense contracts ?","Oh they do huh, well build your manufacturing plants and wafer fabs in the US then or get stuffed.","Of course they do - every hog wants to get its nose in the trough when there is food to be had...","It’s the biggest pork game in the country duh"],"points":11},{"text":["LinkedIn plans to add gaming to its platform | TechCrunch","Recruiter: Your Farmville crops are impressive. I think you'd be a great fit....","My favorite part of LinkedIn is it USED to be platform to find jobs. Almost all the jobs are automated spam posts now, or one single company has 500+ listings for the exact same \"work from home job,\" but every listing is just in a different city.Then there's the posts. Everybody's just self-congratulating themselves and posting how great they're doing and how they're changing up the game with the secrets of success only they know about, and...Yeah. It's absolute shite now.","Are we in the \"let's throw shit at the wall and call it 'blue sky thinking'\" phase of a tech bubble?","We have not failed. We are simply redefining success.","Wow Bob you really killed it on the Space Invaders portion of the interview, now we’d like to move on to a Call of Duty group interview session.","It will be hilarious to see the \"grindset\" people talk about how wordle makes them employable entrepeneurs.","So that they can fail to appeal to an entirely new demographic?","Desperate times call for useless measures","LinkedIn asked for government ID out of the blue. Same trick tried Facebook. Long forgotten memories already both of these and happy about it. Such a waste of time trying to find real job on LinkedIn and Facebook is just a time sink.","Well, it’s not getting people jobs. Might as well distract them.","Why don't companies stick to what they are (marginally) good at anymore? Just make a good product, don't charge too much and people will stick with you.","Super Mario Corporation, Sim Middle Management , Job Hunt 3-D","Oh great making it even more like that Facebook dross. It’s supposed to be a professional networking tool 🤦🏻‍♂️","Here's the game. Try to find an actual job on LinkedIn.","How about you fix your fucking job search module","Makes sense. They’re giving us something to do after AI takes over our jobs.","Oh good. The recruiters can start sending Farmvill requests instead of random jobs.","Dang it I just deleted my account after never using it for 4 years","Finally a place to post about my raid clears","Like Twitch is about \"gaming\" these days. Is that how they call it now?","I’ve heard stories of people using this site to date, to trauma dump and now to game. It’s time to admit I don’t know what LinkedIn does anymore.","Finally admitting is useless for job seeking ?","What in the actual fuck is this bullshit? Have they completely lost the plot?? Linkedin wasn't supposed to be for anything but career-oriented shit...","This HAS to be an Onion headline, right?!","What timeline is this? Dafuq? O.o","what?","LinkedIn is like the tofu of social media. It takes on any flavor around it.","I want off this ride.","add what?","I started an account on LI like 15+ years ago and finally gave up about 3 years ago when my company “suggested” that we connect with as many senior managers and leave them a review touting their “ability to connect”, “growth mindset”, bullshit bullshit bullshit etc My direct supervisor called me up and told me to NOT send him a request because he didn’t give a sheeeit.","It’s the same as when offices add game rooms. Can you use it and not be viewed as lazy and unproductive?Stick to your core competency of shilling corporate simps to directors for unpaid overtime.","Finally can get a job as a race car driver.","I like game where you filter all the fake/non responsive job listings","New profile header: Got Game","I see you okay game 20 hours a week. You are not a fit for this job.","Well that’s dumb.","Linkedin is a self promotion cesspool and has been irrelevant for years. This just proves management is completely lost over there. This is beyond stupid, why would I want to play games with sales people and recruiters. 😂 They need to move further away from Facebook features not add more.","This game is the most racist, agree?","Sweet! Finally, somewhere I can upload all my sick game screenshots!","Congrats LinkedIn, we all knew you had potential, but you’ve made it. The corniest place on the internet.Well done 👍","Some men think it's already a dating platform too","LinkedIn plans to be stupid.","It’s a circle jerk of nonsense. I get harassed at my job constantly to “join the linked in network!” Newp."],"points":754},{"text":["UK And Germany Double Down On Joint AI, Clean Energy R&D Efforts","WARNING! The link in question may require you to disable ad-blockers to see content. Though not required, please consider submitting an alternative source for this story.WARNING! Disabling your ad blocker may open you up to malware infections, malicious cookies and can expose you to unwanted tracker networks. PROCEED WITH CAUTION.Do not open any files which are automatically downloaded, and do not enter personal information on any page you do not trust. If you are concerned about tracking, consider opening the page in an incognito window, and verify that your browser is sending \"do not track\" requests.IF YOU ENCOUNTER ANY MALWARE, MALICIOUS TRACKERS, CLICKJACKING, OR REDIRECT LOOPS PLEASE MESSAGE THE /r/technology MODERATORS IMMEDIATELY.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Musk's SpaceX is building spy satellite network for US intelligence agency, sources say","No shit, why do you think darpa gave spacex so much money? That was the plan from the very beginning.","I wonder why the press is just now picking this up. This isn’t even a secret — they were hiring engineers for this project 2.5 years ago. It even had the name at that point.Source: I interviewed for a job at SpaceX for Starshield","Surprise a government is sending up government satellites that aren’t available to citizens, using a cheap and reliable method to get them there. More at 10.Next you will tell me a government is using ford trucks to move materials to build a secret building.","good thing spying doesnt depend on secrecy","Raw article url: https://www.reuters.com/technology/space/musks-spacex-is-building-spy-satellite-network-us-intelligence-agency-sources-2024-03-16/","Lol coming fall of 2026… “Musk sells US intelligence to Russia.”","Musk should not be involved in this.","Why would they trust that knob? Weren’t they watching what he did to Ukraine when Russia yanked Musk’s chain? Then again, this is the same country that lets China mass produce a good amount of their medicines.","This timeline is getting dark af.","So the guy that cut off satellite communications with Ukraine when they threatened Russia is now in charge of US intelligence gathering? EDIT: https://www.snopes.com/news/2023/09/14/musk-internet-access-crimea-ukraine/ Musk did not turn off Starlink coverage. He just refused to enable it and thus thwarted a Ukraine attack on the Russian fleet illegally stationed in Crimea. The fact remains that Musk is a loose cannon with ulterior motives or divided allegiances and I hope the DOD keeps an eye on him.","So companies do what they get paid for to do? That is news?","That's what I don't understand. The Musk is very anti US on Twitter but keeps getting government contracts. For a guy who's pro Russian and anti Ukraine he sure does get plenty of $$ from tax payers..","Ohhhh my GOD what a breaking story!!!!! This is so crazy who would have ever thought.","https://www.rand.org/","Huge mistake to let an enemy of your country build your spy network.","There’s gambling happening in this place!?!","Read that as: Musk was able to scam even the DOD!","Least secure intelligence sattelites ever when Richie Rich might turn them all off on you.","Give Elon sole ability to build a spy satellite network? Clearly nothing can or will go wrong","Musk is also more likely to help Russia and China.","So he can sell the info in the East?","Correction: for Russia's world domination","Back door keys will be in Moscow and Beijing.","It'll be ready RIGHT after Hyperloop. I mean full self driving. I mean auto semi trucks. I mean solar roofs. ... ...","Sources?? You mean, the news and the company itself ?","Nationalize this company now.","...but starlink gets internet to muh trailer out in the sticks! Sure he's bad, but that's like his one good idea guys!!We keep trying to warn you. Involve yourself with nothing of his. Fuck SpaceX. No, it's not okay that you pre-ordered your Tesla before you knew, get rid of it. I don't care about his fascist AI. He knows nothing of free speech. The dude spends all day nodding along to actual nazis on twitter, and he's planning a central place for himself in the coming reich. If you don't divest yourself from him, financially and mentally, we are fucked.","Musk paid by US to supply intel to Russia.","This is a terrible idea. But I’m sure it will work out fine. He’s a very stable genius.","US seriously needs to consider using its asset forfeiture/national security laws to reign in on spaceX. It's too connected to our space program/defense, to have as many outside influences as it does. Part of me thinks the Intel community/CIA is using elon as a russian honeypot to learn about what they are doing. Give starlink access to russian military, and US knows what all of russian military is doing overnight. That's just one guess...All I know is none of this NASA/spaceX bed making makes any sense to me, considering Elon's stated opposition to several US government agencys. He's not particularly a consistent feller, either.","But but but big government evil.","Half the satellites in orbit now are owned by SpaceX. More than China and NASA combined. He is certainly trying to take over space.","… that will have a capability to be controlled by SpaceX at any time, like if the money stops flowing or Elon wants to give it to some guy in Eastern Europe.","I love watching all the rabid Musketeers rally around their hero Musk and defend every action of their tech messiah.","This guy will sell the data to Russia and anywhere else for an extra buck","It won’t be secret for long. His buddy in Russia will have a back door","hes gobbling up that sweet unlimited taxpayer cash. disgusting.","So, is Mysk’s spy satellite system in hacking and communication compatability with Skylink (or whatever its name is) the Ukrainian and Russians have now?","These days I wonder more about \"which faction\" than if it's for the USA or not. Is it for the billionaires to spy on the populace. Is it actually for an advantage over other nations? Or will it be used against us like the rumors that Musk's satellite system was being used against Ukraine and the benefit of Russia? (I really don't know -- just pointing to the rumor here.)I used to be a bit cynical about these things. But I feel like we put all this effort into \"security\" and we already lost the war -- we just weren't told what war and who the new boss is. Well, which rich person is it? Does it matter?It seems the modern day equivalent of the way Alexander the Great or Genghis Khan use to subvert their enemies. But it's been perfected so you don't even KNOW any more.We'll collect all this data for Uncle Sam, and someone will load it into a UHaul truck because the right person got a hand job. But, hey the technology will be cutting edge folks. Really exciting stuff!","Why not putting NASA working instead of giving this kind of intel (and money!) to this fascist shit head?? How?","How long before they get shot down?","Duh! This shouldnt be news. Musk receives a lot of funding from the us gov especially nasa.","We are not going to Mars anytime soon now that the Moon is back on the menu."],"points":528},{"text":["Chinese government escalates its own push to police generative AI | Despite the vast ideological differences and sharp geopolitical competition, the Chinese government shares many of the concerns that Biden administration officials and lawmakers on Capitol Hill have voiced","The Washington Times is a right-wing news media company founded and run by the Moonies, a literal cult.","AI for Me and not for Thee. They are afraid of it, afraid it might give the lower class an upper hand.","Authoritarianism is based on a lie. Trying to twist an AI around a lie is going to severely limit its usefulness."],"points":2},{"text":["India’s ‘Silicon Valley’ is running dry as residents urged to take fewer showers and use disposable cutlery","Resident of Bengaluru, India over here. The following discussion will make more sense with a map of the city open. https://maps.app.goo.gl/UHV1YqUVuGvKXspt5This is a governance failure spanning at least 30 years, and in that span, all 3 major parties as well as permutations of coalitions have held the seat of Chief Minister (head of the state/province) for a significant amount of time.The older parts of Bengaluru were built with a municipal freshwater connection (Kaveri river water, from the KRS dam). Malleswaram, Basavanagudi, Jayanagar, early phases of JP Nagar, etc.However, areas newer in comparison, rely heavily and often exclusively on bore-well water. Sometimes, these bore-wells go deeper than 2000 feet before they strike water. Naturally, the water table has dropped and the underground reservoirs and aquifers are going dry fast. This includes the newer areas like Whitefield, KR Puram, Bellandur, Nagwara, and Electronics City.All this has happened in the de-facto absence of any regulatory environment for the exploitation of underground water sources. When a regulation can be overlooked by a bribe, it's not a regulation at all.Now, the newest of this lot, idk, since pre-COVID or so, don't even bother with borewells or Kaveri water. They rely completely on tanker water. Areas like Devanahalli (where the airport is!!!) and the far reaches of the Whitefield-Sarjapur belt are like this.Yeah. A long line of water tanker trucks outside the apartment complex.Now, in summers of drought, the demand for these tankers goes through the roof. So these guys have been extorting homeowners. In their infinite wisdom (/s/s), the state government decided to enact a price cap (that they have no means to enforce) and tried to requisition the trucks for the government to deploy (in which they would naturally be very inefficient and very corrupt).So suddenly, many places can't get a tanker at all. QED.The root cause of this is unplanned expansion with thought only to cutting up the land and selling it to developers, without a single thought to infrastructure, including roads and road layouts, piped water and piped sewage, electrical distribution and public transportation.The various divisions of the local and state government have only been bothered about land acquisition, allotment and resale. The BDA (Bangalore Development Authority) runs amok and the BBMP (the municipal government) is hand-in-glove. Everybody's happy as long as they get their cut.The population of Bangalore was around 4 million in 1990.Now it is around 15 million. 2024.","Dude the world is about to get fucking insane. It’s almost like famine & plagues kept the human population at bay of entirely self destructing.","Fewer showers??","Use disposable cutlery? Isn’t that how we got in this mess in the first place?","The problem is coming up right now because of the lack of infrastructure of course, but that’s workable right now (will be a problem in the future) The major issue last year was lower rainfalls, leading to lower amounts of ground water recharge. Plus major lakes which store water and recharge groundwater are under repairs in the city at the moment, so they are without water as well.It is hoped that with the upcoming monsoon in June, and the lakes opening back, things should become better","That is what you get when country run by corrupt and citizens only care about religion. This isn't specific to one particular city. It is only getting attention because it is 'Silicon Valley'","A billionaire created hellscape.","I know a person who came first time from North India and was asking the landlord “is this BTM layout “. BTM is a residential area close to IT companies. He went on to say that as a child everyone in north India is told to do engineering go to Bangalore, rent a house in BTM.How can one city sustain so many people whose only aim is to settle in Bangalore.No cities developed, apart from Bangalore, Hyderabad and Chennai to some extent Pune.","Ex-resident of Bangalore here. I saw the writing on the wall (or in the well) and quit the place 8 years ago when the first of the regular major water-scarce years hit.Best decision of my life. Found a job in my home state that paid better than my Bangalore job at a quarter of the living expense and much better quality of life.","The lack of compassion for regular Indians in this comment section who are just trying to make a living and have to deal with this government failure is astounding. You have a comment blaming religion when the article is clearly about policy failure? Then you have the dog whistle “Indians are smelly” comments making jokes about Indians not taking showers. The reality is that only the poor who do not have access to clean or safe water do not take showers. Every Indian who can regularly showers. Rather than be compassionate towards citizens who are facing issues under their government which is common across all countries many in this thread would rather be racist. Oh and yes Indians do use cutlery and don’t only eat with their hands","India is the fucking worst place. Dumb and dirty.Spent months of my life living there. Never again","Plastic?","Will the regional lack of water cause large population movements?","\"He's just like me, fr!\" - California Tech Bros","India can use their good friends Russia to fix it.","Fucking corrupt morons. Hope their city dries up.","Maybe what they need is contraception","How does fewer showers interfere with the regular Indian cadence?","Sigh, it's not even summer yet.","why did they make too many ppl like nobody said anything in the process lol","On Urban side, Two things India can do to save waterDish-washers need to become a thingToilets need to to be “dry” with use of commode-fitted bidets instead of handheld bidet washes","Every day I realise how freaking lucky I was to be born in Quebec...","I saw with solar powered pumps using underground fresh water for crops the droughts are made worse. Too much food and not enough water would be a funny way for the human race to go extinct.","Single use plastic as the solution for water shortages. What an age to be alive.","disposable in India is “throw in da river all our plastic”","‘Silicon Valley’ aka Scam Call Center Mecca. You can work up quite thirst while trying to get grandma to purchase $300 in gift cards.","[removed]","Why so many indians","Yes use disposable cutlery because there isn’t enough plastic and trash in India’s waterways already.","Fewer showers? I doubt they would need to change anything to follow this guidelines. The stench speaks for themselves.","Well, that's all you need, is less water to bath in, in an already very nuanced smelling country.","[deleted]","People choose Congress and it's freebies and are now paying the price ."],"points":1536},{"text":["Robot turns itself to liquid to escape cage and then reforms just like in Terminator 2","No it didn’t","This is a ridiculous headline","clickbait article","Exaggerated. We haven't reached that kind of technological advancement.","It’s the piece about CAPTCHA right below the article that’s really interesting.","[deleted]","It's happening"],"points":90},{"text":["Armies of humanoid robots to be for sale soon","Oh you wanted a raise? Meet your replacement.","They better be able to fix themselves though, because without humans fixing them, they will fail.","... those don't quite look like apocalyse robots to me. Wake me up when we get some sick attack dog robots for that Metalhead future."],"points":10},{"text":["Bill Maher Says Artificial Intelligence Should Be a Bigger Concern Than TikTok | \"Shouldn't the tech bros have been made to work out the bugs before they unleashed it on humanity?\"","I mean, he's kinda right but why is this an article? Do people really respect the opinion of that smug asshole?","Bill Maher is a fucking idiot and he has been for a long time. Dude is a contrarian just for the sake of it.","I don’t think the bugs are the problem but what data it’s trained on and the ethics and values of who applies the weighing to indicate the preferred outcome.","AI is a bigger concern than TikTok. But TikTok is also a concern, and we don’t live in a world where we just ignore one problem because another problem is more important.","He fundamentally does not understand, and that is OK! This is complicated stuff, but why is his opinion noteworthy?","That's why I've always treated my electronics good since I was a kid in the 80s. When the AI driven robots go on a rampage on humanity. They'll spare me because I was so nice them growing up.","isnt the american economic philosophy to cash in first and deal with the consequences later?","Thanks, Bill. We'll take your concerns under advisement. Great timing, as usual.","Work out the bugs? 😂","Why would anyone care what a failed comedian with a mediocre comedy-political show 3 leagues below Jon Stewart say about … anything?","Bill Maher, noted computer scientist and software expert","Seems like everyone is talking about his character instead of his comment. Focus on one subject at a time y’all.","Bill Maher: Always pompous, mostly wrong.","First of all, we can have more than one concern. Why would being concerned about TikTok mean we’re not also concerned about AI?Second, they could be related concerns. TikTok is a black box. They show all sorts of videos you don’t necessarily look for. That algorithm could be steering people toward extremes or toward propaganda. It could be AI powered to scan your history and chose the videos to get you where they want you.","San Altman is a greedy idiot","The collective greed of humanity to profit off of AI will ensure there's no room for accountability if/when it goes rogue on us","Secret… they don’t really know how it works!!!","This right here is my biggest complaint. AI everything is being forced down our throats, and it is barely half ready for any of the tasks it has been assigned to…","This technology should have been under world review before releasing it to the masses. The cat is out of the bag, so to speak… and now the finger-pointing and blame game will commence when something truly awful happens as a result.If only common sense weighed more than greed. Oh. That’s right… “If common sense was common, everyone would have some”I agree 100 percent with Bill Mahar.This could end up being the biggest blunder in human history.","The fact that this guy states passing a data privacy law should prevent china from misusing American data. The Chinese literally have state backed hackers selling services against America (isoon). Chinese are totally using TikTok against Americans, glad to see it go.This is what I think is happening. Chinese are seeing which of their propaganda hits the hardest through aggregated American data and capitalize (in their communist way) on that misinformation.","Bill Maher is still a thing?","This is so stupid. AI as it exists today is nothing more than a probabilistic text generator. It cannot truly reason. It does not even think in between queries.There is no threat presented by current AI beyond that of its ability to teach people things, and its ability to help people lie. And if people learning or lying is scary to you well, I guess you'll have to make it illegal to hire people in third world countries to lie on the internet for you too, and ban all libraries.","Bill has no fucking idea what he’s talking about. “Shouldn’t they work out the bugs” …? What bugs bill. What do you think bugs are. You mean the massive number of unknown ethical considerations and socioeconomic inevitabilities?Learn to recognise a paradigm shift when you see it.","Oh wow he has an opinion on something he knows nothing about. Wildly surprising.","I would retort that the concerns about A.I. are a bug, due to pressures attempts are made too iron out at least some of them . The concerns about tic-toc are features , there will be no attempts to iron them out without pressure.Also can't mister we can walk and chew gum at the same time see what we can be concerned about both things?","Marr is no longer relevant- except maybe as a laughing stock","Shouldn’t someone be funny before they’re unleashed on humanity and labeled a comedian?","Why does everyone here seem to hate him?  Did I miss something?","The old-out-of-touch-boomer arc of Maher is some of his funniest work","I can’t believe that I’m agreeing with Bill Maher on something but here we are","If only I gave a single fuck about what Bill Maher says, does or thinks.","Why are we constantly talking about a sci-fi bullshit scenario: the danger of AI is that a company will be able to license a machine that eliminates all staff that isn’t grunts and puts most workers in the boat with current people experiencing homelessness. Billionaires generate wealth from societies. Some sort of at least basic housing, food, medical treatment, occupation must be possible for a society’s inhabitants. We need a new model of what a society does and is for.","Most bugs are only found when unleashed on humans.Looking at you Boeing..m","OHMYGOSH he’s so close to understanding. AI is the only reason they actually want to get this done, so China can’t continue to train their models on American data.","Tik tok is ai, its a data collection & propoganda platform.","Reddit has such a hate boner for Maher bc he sometimes says mean things about democrats.","AI has been around a long time. People are paying attention only now. Too late.","I am curious, does american tiktok users see China propaganda on their tiktok fyp?","The same can be said for the ORANGE ONE.","I mean, I say something aloud and all of a sudden it’s a Tik Tok ad. What’s up with that?","The funny thing about the whole ordeal is the notion that we will have any control. Sure we can try but there will be hundreds of not thousands of other iterations that will go nuts","All they had to do is spread enough money around and the media alone fell in line to praise it's creation. What could possibly go wrong?","Content-free article.","It’s not an either/or problem. Both are problems that need addressing","He can also be miraculously uninformed about issues, especially during interviews, but that doesn’t stop him from thinking he knows everything about the topic and pushing his uninformed opinion. That’s what stopped me from watching the show.","Who gives a shit. The U.S. should repeal FATCA before anything.","You can never work out all the bugs in AI……","Well they purposely implemented the bugs.","We can have more than one concern.","“….your scientists were so preoccupied with whether or not they could that they didn't stop to think if they should.”","That hack doesn't know shit about fuck and thinks smug contrarianism is the same as intelligence.If Biden was cracking down on AI instead, Maher would act all high and mighty about how much a danger TikTok is and how he's apparently the only one smart enough to call it out","Computer programmers have mostly said, \" release this version, and we'll fix the bugs with an update.\"Why would they change now.","The answer is yes, the reason they didn’t is greed.","When has that ever happened? We could all say the same about nuclear weapons, plastics, sugar, you name it. Alas…humans.","Tech Bros, just like political bros, hollywood bros or any other group just want the money. They don't care much about humanity more than any other","The imonky way to work most of these bugs out is to have a certain size of a userbase to hammer away at it.","“Why doesn’t the government just make laws now about all future inventions”-a very stable genius-","Capitalism unleashed it on humanity. Tech bros would’ve happily spent the next 20 years putzing with it.","Everyone I hear someone talk about AI I roll my eyes. The cat has been out of the bag. It’s gonna bring huge change and there’s no bill that can stop it. America can be the frontier or we can let other countries reap the benefits, which means military domination as well.","I just can't believe this is the bill that passes without issue when there are so many other things American Politicians should be focused on.","Of all the people I would take tech advice from, he would be the last","The stopped clock is right for a second.","Ah yes, AI should’ve been like everything else the Tech Bros did where they totally worked all the bugs out of it before they unleashed it on humanity.","See the new EU litigation program, already in place? Will evolve with progress!","Has there ever been a technology that we worked out the bugs before we unleashed it in humanity?","I can agree with this. Something something broken clock twice a day","It's not a bug it's a feature. All the evil that can be done by AI is because it's in the hands of evil people.The clear and present danger of AI is not the Terminator scenario. It is that literally any evidence can be manufactured so we can't reliably trust anything anymore. It has been proved that even peer-reviewed research can easily be published with monetary incentives. \"Pics or it didn't happen\" became \"vids or it didn't happen\" and now we can't trust those anymore. We are living in a post-fact world and are seeing the consequences from flat Earth to maga. I don't need Bill to tell me this.","That's not how technology works. Unless a given product or category of products is specifically dangerous in some concrete way, or falls into a protected category like medicines, you are free to sell it to customers. There isn't a panel of smug, ignorant assholes who have to sign off on technological progress before it can happen.Also Bill Maher can eat my whole entire asshole with butter. Idiot antivaxxer piece of shit.","I freaked out about AI when this got unleashed, but the more you use it, the less I am worried about it being too smart.My main fear is now it being too dumb, and people trusting it with stuff that it shouldn't be trusted with.","Marking these bugs; ‘as designed’","Can't we work on both?","He just described the video game industry, that's pretty standard operating procedure","bill maher was the first redditor","This is the first time i have found myself rooting for AI.","“made to” lol","The correct phrasing should be: AI and TikTok are both concerning. It’s just that one outweighs the other. Not saying TikTok is not concerning. I’m very pro TikTok ban.","He’s not wrong, but Bill Maher oversimplifying this huge issue as a “tech bro” thing is bizarrely tone deaf. As if it would’ve been adequate to call the manhattan project a bunch of “phys bros hanging out at summer camp.”","AI is being beta tested in public right now and has been for a decade","I don't understand the hatred AI gets. For Chat GPT, you're supposed to take its output with a grain of salt. It's not a god, it's just a program designed to emulate shit people say on the internet. All AI technologies are imperfect for this reason.For image generation, yeah it was trained on a bunch of art people made, but that's what human artists do all the time. They're not stealing your work any more than you're stealing from every piece of art you've ever seen.It sucks that people are going to lose their jobs due to automation, but you don't ban the automation. You tax the rich and take care of the unemployed.The technology is never the problem. We are.","You used to be worth listening to, Bill! But then you got old and stopped thinking about things, and instead it was just a stream of feelings. An old man's feelings about a world he no longer understands.We either die a hero or live long enough to become a muppet","A broken clock points roughly in the right direction twice a day.","Someone should have been made to work out the bugs in Bill Maher before they unleashed him on humanity. He’s such a sanctimonious asshat.","Boomer yells at computers.",""],"points":1380},{"text":["Musk's SpaceX is building spy satellite network for US intelligence agency, sources say","Of course it is, it's a military contractor.","Doubtful he's aware of payload specs, and this is just a delivery/platform deal.","Ah yes have the treasonous incompetent south African billionaire with psychological need for approval build you satellite network. What could possibly go wrong?","Elon should not be trusted with military tech.","A company publicly contracted by the military to launch spy satellites is now launching spy satellites for the military?! What shocking and unexpected news!","I knew it, and you would be foolish to think that the rest of the Starlink satellite network isn't integrated","They already have several spy satellite networks.","Shhhhhhhhhh!","That dude should have NOTHING to do with national security. Enough of this Musk obsession. Elno is a grifter and Narcissist.","? Of course it is!","I thought it was already done by now","I used to skate by this place on my way to Amazon warehouse I worked at in Hawthorne ! Crazy what’s going on with spaceX. Military contracts o_O ?","If they say they are building one they’ve probably already been built and functional for a very long time.","Not me just realizing X must named after spaceX","Always through that a camera system on starlink made sense. With that amount of coverage. Even without massive optics the sheer speed between pictures would have a lot of value.","I don't think I'd trust Musk to not sell access to it to Putin...","Why?!? Musk is obviously compromised by foreign governments so why would the U.S. trust him?","Is there a billionaire who didn't get rich by selling to the fucking Pentagon?","Shocker!!! I would never thought this would happen Elon how could you. But X is safe of giving data to government right....RIGHt","Of course he is! He’s doing everything with his various companies that the US government should be doing with our tax money but does not.","US intelligence should not be trusted with SpaceX tech.","Shhh. You’re not supposed to say anything.","It’s a joint operation with Russia’s FSB, whether the U.S. knows it or not.","Tell our secrets! Oh, wait….Musk told everyone already!","So he can purpose it for use to the highest bidder?","Will those satellites also provide information to the US military or russian only?","Unless the US Intelligence agency is running a fake operation in a “friends close, enemies closer” attempt to monitor Russian Mole Musk, this will end poorly for the States.","Why would you trust that guy?","The fact they trust Musk with something like this is ridiculous.","No wonder the government isn't saying a word about Musks personal behaviors of late? Now it all makes sense...","I feel like SpaceX working with US intelligence is more of a potential and more dangerous foreign threat than something like TikTok (which I also think it is). Musk’s wealth depends greatly on his success in China with his EVs, and his ethical compass being somewhat broken (understatement) should be a concern when granting his companies government contracts.","Military contractor, subsidized by the government.","So Russia already has the plans then.","US intelligence builds spy satellite network for Russia","Sorry to ruin it, but not for US ...","Soo he's gonna shut it of whenever someone is mean to him on twitter?","Aka: getting paid for empty promises that he will never deliver, just like everything he has done for the last 20 years...King of vaporware."],"points":303},{"text":["Doctors are turning medical generative AI into a booming business","This would be a huge asset to me. I currently spend 3-5 hours every week out of work focusing on charting. Being able to streamline this would give me significant extra time in my life","This article is a bit hyperbolic. Anyone who works in health care knows we are at least a decade behind the rest of the tech industry due to all the regulations and monopolies.","Highly valuable practical application, this is the kind of stuff AI should be used for.","So just voice to text? Nice of course but calling it AI is a bit much.I already use this daily. A few years ago you would dictate into a tape, or a digital tape and then a secretary would later write it down. Then you would read it again before you validate into the clinical file.Now you dictate and it writes down on the go, you correct the mistakes on the go and you can have it released immediately. Saves a lot of time.Yes it makes some big mistakes sometimes, but so did the secretaries when they misheard what you had said. So hallucinations aren't a major problem in this context, especially because you see them happening in front of your eyes.","This is just like having a scribe, but potentially cheaper and with less staffing problems. Or more expensive. Who knows. At least with a scribe if there's a mistake there's culpability. Idk what will happen if these AI generated charts aren't proofread. But then why bother using ai if you have to go over the charts at the end of the day anyway?","It’s all good until it hallucinates something and the doctor doesn’t notice.","These systems will ALL come with a catch. You'll need to send all the data back to Megacorp. And Megacorps can't be trusted with this much data. Oh, yes, it will be \"anonymized\" just enough to put the fig leaf over HIPAA. And if you believe them, I've got a bridge to sell you.","I’m a physician and have used DAX. It’s not as good as you think. It does capture the conversation, but not the flow. Go down a tangent and then come back? Dax doesn’t understand that.At one point it was basically transcribing the whole conversation and all it did was change the patient saying “I” to “Patient states” or “she.”","What happens when it hallucinates?","I want this for my life in general. Does anybody know if there already is such a thing?","That'd a good step. Taking notes and writing summary. But that's not really a tech breakthrough.Here in Canada, we have a universe-sized problem with lack of doctors. I wouldn't mind an AI solution where it would * ask me the necessary questions looking for symptoms * look through its billions of historical medical data * suggest a diagnosis * suggest a medical plan * let it be reviewed by a real doctor (this step is only for those that are afraid of scary robots) * I'd then be on my merry wayI think the technology is already there and the correct diagnosis would probably be higher than what a human doctor would recommend. The issue is probably the fact that humans would be scared of this solution and doctor's unions would fight being replaced even through this major crisis.Because currently, the alternative, is basically no doctor for most of the population.My two cents.","I read the article and it sounds like voice to text, rebranded. Voice to text has been around for a couple of decades?","When are patients going to get access to all their medical information on an AI platform. I want every single doctor visit, dentist visit to be recorded in my AI doctor who can tell me 40 years later what conversations I had back then etc. I was at the dentist yesterday and they couldn’t tell me what was up with and old filling I had done cause I hadn’t had it done there, as it was in a different office. So many other opportunities to empower patients.","Companies like Microsoft’s Nuance Communications, Abridge and Suki believe their solutions will help reduce doctor’s administrative workload and prioritize connections with patients.   I don't think that the connection will change, but they'll be able to take more patients.","Here’s an idea: fire half of hospital administrator and hire more doctors. The issues isn’t the charting, it’s the staffing ratios.","We have had models capable of detecting cancers and other things in MRIs and scans for almost 10 years now. I don’t know what the hold up is with deploying these things into the real world. Hell I built one by myself 10 years ago in grad school. We should be using AI everywhere in the medical field. It is going to save lives. It’s the best application for ai.","Erick Jensen put one of these on me years ago and has been trying to ruin my life ever since.r/homeassistant73%1/4DANGEROUS THINGSNEXT RFID + NFC Chip ImplantNTAG216 13.56MHz ISO14443A NFC chip15577 125kHz RFID chip (preprogrammed EM41xx 40 bit ID)2x14mm cylindrical sterile broglass implantAccessories! Field detectors and RFID Diag card Included!u/d/GobBluthHelpAnyone performed the Dangerous Things RFID/NFC implant? Thoughts? What havebyou been using it for?dangorous thing","Please help me","I really need someone to help me this \"GANG STALKING\" is out of control, I've been getting harassed for years now and no one believes me I don't know where he implanted it or when or how but Erick Jensen is ruining my life!!!!!!!","Doctors routinely cover for doctors. They “police” themselves and rarely stop a bad doctor from practicing medicine. How many ways can this go bad? All for profits.","Dystopian nightmare fueled dreams what have you wrought upon us today?","When is AI going to be able to cure diseases such as mental illness, Chronic fatigue syndrome and long covid?","They first thing to be replaced by AI in the medical field will be any doctors that rely on algorithms and don't do bedside procedures.So like PCPs will probably eventually evolve into an AI monitored by a physician in the background until the AI is vastly more efficient than the physician.When they figure out how to let AI do medical procedures they won't need docs or nurses like me anymore. That is the future. I whole heartedly welcome it, if the data in fact shows better patient outcomes.","Fabulous /s. Hey Siri, could you record my entire extremely private medical conversations and provide a transcript? Can you upload it to MyChart for me? Maybe someday if you’re feeling generous, would you mind selling my anonymized data to whoever for “research”? I’m all for helping overburdened medical professionals but I’m also well aware of how valuable such data is to so many different industries. Hmmm just hmmm…","AI is stupid and weak."],"points":333},{"text":["Podcast Episode: 'I Squared' Governance","Podcast interview (with a transcript you can read instead):Imagine a world in which the internet is first and foremost about empowering people, not big corporations and government. In that world, government does “after-action” analyses to make sure its tech regulations are working as intended, recruits experienced technologists as advisors, and enforces real accountability for intelligence and law enforcement programs....In this episode you’ll learn about:- How a lot of the worrisome online content that critics blame on Section 230 is actually protected by the First Amendment- Requiring intelligence and law enforcement agencies to get warrants before obtaining Americans’ private telecommunications data- Why “foreign” is the most important word in “Foreign Intelligence Surveillance Act”- Making government officials understand national security isn’t heightened by reducing privacy- Protecting women from having their personal data weaponized against them"],"points":5},{"text":["Talking on the Moon: The quest to establish a lunar mobile phone network. \"No one is going to accept the Apollo video quality\"","Oh Hell no...we want it in 8K or IMAX, if you don't mind.","Giant MPEGs are what you takeWalking on the moon","This is exciting because it will be the foundation for a Lunar power grid and Lunar road network.","And none of this 1.3 second delay business. We can and must do better than this!","I really think we should go with a wired connection here, just for the quality.","The rational people will accept it if they understand why it's difficult to send high quality video back to Earth.The irrational people will assume the brilliant minds at NASA are just incompetent or it's intentionally bad quality so we won't notice it's fake.","I'm having cellular Telco support flashbacks- \"No, Jim, you won't have signal at the bottom of that crater\"","Same with Mars, they need to build out a GPS network with dozens of satellites orbiting around it, plus Cellular, laser (direct line of sight) data transmission for future rovers, and explorers.","We need good service on earth still.","How long before foil-hat wearing crazies are living on the moon but protesting a nano-cell at the end of their living barracks hallway?","We literally just want billionaires to pay their fair share.","Not sure what this has to do with technology. This is just a matter of robust engineering and logistical costs."],"points":137},{"text":["Speaking without vocal cords, thanks to a new AI-assisted wearable device","\"Im not racist! Its my Throat AI...\"","Something like this would be incredible. My mother had MND and has lost the ability to speak. I can’t tell you how much something like this would help.","Future HR interaction:HR: “Billy, we need to let you go. You can’t work here after that crazy, racist rant you went on yesterday.”Billy: “Dude, it was the AI that generates my speech!”HR: “We need your badge and key.”*inspired by a different AI story I saw on here earlier ;)","I know AI is a threat to us humans in many ways but i can’t wait to see what it can do in science and medicine.","monkeys paw curlsBut you have to talk in tiktok annoying girl voice","It’s coming right at us!","Homer having a beer with Stephen HawkingMoe: “Alright, it’s closing time. Who’s paying the tab.”Homer: [robot voice] “I AM.”Hawking: “I DIDN’T SAY THAT.”Homer: [robot voice] “YES I DID.”","Ai bad, they should pay a real human to translate the throat movements into speech, not cheap out with this word-stealing machine","Breaks my heart seeing these comments making fun of a good invention that can actually help people who need it. Have Reddit users became a wanna be standup comedy people? I hope something good happens out of this breakthrough.","Yeah until the AI starts making you say racial slurs","So whats the device’s name? I didn’t see it in the article","\"Sam Altman is a hunk of a man. I wish to be his man-wife\".","fuck it I’m bout to give my dick a voice.","Maybe we could listen into dreams","Next step, Ender‘s Game subvocalization","Don't they already use this in the Mission Impossible films?"],"points":107},{"text":["Epic Games takes on Apple and Google in Australia over alleged misuse of market power","Can’t imagine why apple hates epics so much! /s","No shoes, no shirt, no service.A business doesn’t need a reason to not do business with another.","Who knew Epic Games and the EU would be America's best hope for tech regulation"],"points":22},{"text":["Cerebras Partners With Qualcomm, Launches 3rd-Gen Wafer-Scale AI","WARNING! The link in question may require you to disable ad-blockers to see content. Though not required, please consider submitting an alternative source for this story.WARNING! Disabling your ad blocker may open you up to malware infections, malicious cookies and can expose you to unwanted tracker networks. PROCEED WITH CAUTION.Do not open any files which are automatically downloaded, and do not enter personal information on any page you do not trust. If you are concerned about tracking, consider opening the page in an incognito window, and verify that your browser is sending \"do not track\" requests.IF YOU ENCOUNTER ANY MALWARE, MALICIOUS TRACKERS, CLICKJACKING, OR REDIRECT LOOPS PLEASE MESSAGE THE /r/technology MODERATORS IMMEDIATELY.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Thanks article spamming bot."],"points":1},{"text":["Samsung races to beat Intel to market with glass substrates for chips — revolutionary tech boosts processing capabilities.","Oh this reminds me of the IBM Deathstar hard drives","So.... isolinear chips. I'm not being glib in a sense, there's been talk about home computers becoming snap-in modules for additional compute, like putting in a second video card or stick of RAM, but in a way that's (theoretically) infinitely scalable.In theory the computer of tomorrow might look a lot like the Star Trek counterpart, basically a box full of slots where you can hot-swap not just media, but computational power. Not enough power for your AI generative MLP fantasy world? Order a few more transparent chips and slot them in. We can even put an LED in the slot so it lights up."],"points":19},{"text":["CNBC: How Tesla became the top-selling car company in Norway","This high adoption rate can be attributed to the generous subsidies the Scandinavian country has offered to electric vehicle owners as well as its investment in charging infrastructure.So basically Tesla benefitted from heavy subsidies and being the first EV presence there. We'll need to see how it goes with other companies stepping in.","A Tesla puff piece","I can hear /r/EnoughMuskSpam snapping at this piece.","LOL - https://www.reuters.com/business/autos-transportation/norway-union-warns-it-may-block-tesla-cars-meant-sweden-2023-12-06/"],"points":20},{"text":["Tech layoffs are becoming the new normal | Salaries have also stagnated, layoffs are second only to the dot-com bubble","What’s weird is during the dot com bust layoffs, the companies stocks were going down. This time they are at all time highs","Mega profits....hey lets get rid of some workers and we can pocket even more. Woo hoo.","That’s because companies have decided they will just do more with less because the only thing that matters is shareholder value. Tech is no longer a field run by innovators, it’s a field run by money grubbing MBA fucks who don’t know the first thing about engineering a product.","I’ve heard from other recruiters that their compensation team partners are getting pressured to keep offers in line with average or 40th-50th percentile (vs opening up to upper ranges of job code compensations, 75th.. 90th.. of range).It’s not explicitly being said in corporate, though it feels like corporations are collectively using this period to pull back on comp increases. It doesn’t help that for every tech job I post, we see hundreds of applicants for just the one role driving down the need to spend long periods of time searching for talent.","Sucks all the way around. Ive been an engineer for nearly 24 years and the amount of turnover due to layoffs is causing a ridiculous amount of knowledge to just disappear into thin air. So much wasted talent and wasted money. An over abundance of middle management that do nothing and bring nothing is staggering. When you terminate long term talent you lose all of their historical knowledge and skill. You bring kids in right out of college who work for nothing devaluing everything who are all book therory and no real world experience. A.I. isn’t going to save tech","I work in this industry, and I’ve never seen a more, for lack of a better description, “anti-worker, weirdly libertarian, anti-union, temporarily embarrassed billionaire” workforce in any other industry.I won’t go into the usual anti union arguments because we’ll soon get to hear all of them straight from the horse’s mouth in the replies to this comment but suffice to say, even as part of this workforce it’s hard to feel sorry for it when they’re so anti union and for such stupid, often imaginary, reasons.People will scream until their voice gives in that unions won’t prevent layoffs, except they absolutely will if enough of the work force is unionized, especially in a scenario like now where the majority of layoffs are accompanied by record financial performance.","This is just part of the normal boom/bust cycle -- wait for the upcoming AI winter and watch all of that fade.","I can't wait for it to subsequently bite them in the ass.","This isn’t like 2000. They are not laying off these workers because business is doing poorly. They are laying them off to support their stock prices. Like Zuck said, he is going to double down on being lean and efficient. They saw what Elmo did at Twitter and realize they could squeeze a lot more out of the corporate class.","My company fired 20% of their people, we were 600 people, as excuse they want to become profitable, while we have massive stability issues on our platforms because code is tremendously trash, and we have to build new platform, from a 4 company merge, fixe all current, maintain it, and add new features.So we need to do much more than before layoffs with 20% less people","\"We've devised a system so 'Agile' that you don't need workers, you don't need research and development, you don't need innovation anymore, just pay us\" -- consultcult that killed real agility and love Welchian setups McKinsey, Bain and Boston the ThreeMs that send in the low level up or out consultant making things up to extract value.","I work in the industry and frequently help with the interview and hiring process. I can say that most of the applicants are awful. Like, have clearly never coded or debugged anything awful. On paper they look great then in person have seemingly never run into a null pointer exception in their entire lives. Seems to me there are lots of people who say they can code and can't find work, but don't know the first thing about enterprise IT development. When we do get the occasional applicant that actually has a few years of experience and can demonstrate they understand what they are doing, they are an instant hire. Maybe the job market is tougher for fresh grads, but we have trouble finding applicants that actually understand programming and haven't just made a website over the summer. I think the real issue is the market is just flooded with posers that probably makes it difficult for experienced engineers to cut through the noise as well.","What roles are being laid off? My company can't hire enough IT hardware field techs atm. A union would be really great right about now","There appears to be some FUD floating around about how salaries are tanking/high pay tech jobs are gone/tech layoffs at tsunami levels and recruiters are taking advantage of it to rope in some low experienced suckers.The only hard part of the jobs market are competing against the bots, flood of literal shit applications from unqualified (usually foreign) boot camp grads and recruiters/managers using headlines to scare people into taking lower pay or a ridiculously scoped job.Take it from someone who just left a tech event and rubbed elbows with some of the most experienced in the industry, the demand is very high while the supply of qualified remains its lowest levels in years. Which means if you know what you are doing then you are going to be making well above some of these joke salaries.","Unions are what keep idiotic MBAs in check.","If we’re being honest, Covid created a mini dot com bubble because all of a sudden a lot of services transitioned online. All these tech companies went on massive hiring swings and now that things are slowing down, they’re cutting that excess back to more realistic staffing numbers. So this may as well just be a mini dot com bubble bust that was expected and the companies are being proactive about.","They better learn to code","It all felt inevitable.Any senior manager in tech just needs to look at Reddit and see all those “i make a huge salary working 15h a week” to know they’d bloated.I can’t imagine we’ll ever recover to 2022 levels.It’s like Pharma in the late 00s.","All the devs that worked on AI 🤖","Are actual decent software engineers losing jobs though? Genuinely curious.","salaries have stagnated but they are still way above the median in the US.","If tech companies are losing money they will lay people off so the rich people running it stay rich. If tech companies are making lots of money, they will lay people off so the rich people running it can be more rich.","Protections start at the gov level. Until the US enacts actual protections for all workers we will continue to be walked all over.","Degrading tech posts has become the new norm.","I am a manager in the tech field. My company made a ton of investments in non-tech functions these last few years that have not panned out or provided our customers with any value whatsoever. It’s mostly these teams vice the engineering heavy parts of the company where layoffs have happened.","I have a lot of friends that work at Google, a couple at Amazon, and one at Apple. They’ve all been unaffected so far. They all think this is because the tech sector was so inefficient from an HR standpoint for so long. A common refrain is that they all had coworkers that they didn’t know what they did exactly and once they left, it seemed to have no effect. It’s never a good sign if your position can close and no one really notices.They also mostly think they’re way overpaid—$250-400K for desk jobs that are way less stressful and demanding than what their spouses all do.","join the Union lady's and gentlemen.","the company I work for is replacing everyone with Indian h1bs. literally every new hire.","Depends on what part of the tech industry you are in. I'm in tech sales and it ain't bad. We growing!","As one displaced from a northern Californian town most quaint, by this erstwhile horde, I can find neither joy nor its rival In their comeuppance, But merely a wish that it be swiftly consummated, And rental prices fall earthward as from a heaven Most diabolical in its want of thrift.","Record high profits, executives pocketing everything while salaries crash. Yep seems about right.","It make sense even if we hate to admit it. As someone working in a faang tier company, the work has had high pay and lower amount of work for a long time: essentiallly pays better than investment banking with half the hours. Soon the market adjusts (more people get into cs or tools are created to make swe lives easier) which will generally make the market more competitive.","Companies are figuring out which remote employees are worthless","I guess they don't need so many people working from home anymore. Strange......","Yep they’re trying to reset tech compensation. We’re fked boys","The massive layoffs are to scare the ones still working to be grateful for their low paying positions and not rock the boat to much. But mean they discussed it just 6 months ago at a world forum. Keep the poor around to keep the middle class working.","Millennials: \" Dot com bubble..WTH is that?\".","Does anyone know what is the condition of new AI engineer titled role?","Layoffs are necessary to normalize the industry and raise the bar. Software has become a go-to choice for people no where else to go. Youngsters are studying SWE to get that 6 figure salary. It has become almost like a shortcut to the easy life.Then again these layoffs don't discriminate. If you are going to do layoffs, do it based on merit and performance so that you raise the bar.","what is the incentive to become a tech worker?",""],"points":2542},{"text":["There's another Chinese-manufactured product that poses a national security risk to Americans: Electronic locks, such as those used in safes, Senator warns","Electronic locks are a security risk no matter who makes them. Most of them have incredibly weak backup key lock mechanisms","\"It would be one thing if these backdoors were only available to US government agencies, but they are not,\"I mean, one, it wouldn't be any different. It's almost like that's the whole reason backdoors should not exist in the first place.","If you genuinely think a Chinese agent is going to break into your house in the middle of the night to hack your safe, you need to reevaluate your life.I get the west is paranoid of China but this is now getting into paranoid schizophrenic territory.We're doing the \"Red Scare\" all over again.","Just ban everything then! Good job!","So there hasn't been a single instance of a Chinese spy sneaking in to a secure facility and physically opening a safe by usage of the manufacturer reset codes that were gained due to the manufacturer being a Chinese company, but a senator thought that idea up and is really scared by it? We're clearly in a political time where US politicians are encouraged to come up with elaborate fear scenarios about China that sound alarming but aren't based in reality.","For most things that you would put the electronic lock on, you are fine. Probably the most precious thing you put a lock on is the front door of your house, and break-ins usually occur through a window or sliding glass door.I guess if you got some serious shit in a safe, it might be worth caring, but it’s usually going to keep a person out, and if someone wants in; they are getting in through other means anyway.","I'm tired of people from the US polluting every single forum on the internet with their boring dumb-ass fearmongering and propaganda.","Ladies and gentlemen, it’s official: CHINA is your 2024 ELECTION BOGEYMAN!","The only time I'll trust a lock is if the lockpickingLawyer approves of it lol","I will stop buying Chinese goods when American companies or resellers stop charging 500% or more for their goods than what it costs to make them.","Democracy producing the best and brightest talent.\"It would be one thing if these backdoors were only available to US government agencies, but they are not,\" Wyden wrote [PDF].Openly admitting that the US government tolerates systems that they have backdoor access to.","yeah, better off using master locks.​/s","Let’s make everything we own in China! What could go wrong?","China bad amirite The amount of propaganda is insane on this sub","Apparently we no longer possess the skills to create electronic locks in the US. /s","What does Israel have against electronic locks?","I'd never use an electronic lock regardless of maker, for many reasons.","So you know if china figured they could take the hit of their economy they could ban exports of ALL their products to usa. That would hurt them but also kill their consumers as well. That would be a political nightmare","Current US tactics: if you can't compete, come up with scary lies about competitors.","Any lock on a door is just a deterrent. Any door can be opened with enough time. This discussion is moot.","Not just electronic locks. Bought a new smart watch that came from China, along with a Chinese made app to connect. It immediately launched a service called 'Content Manager' and started uploading the contents of my phone to some unknown server. Uninstalled the app and Content Manager kept running. Ended up killing the process and removing all of its permissions, after verifying that it wasn't a normal system process.","The fact that it’s Ron Wyden means it’s probably true. He’s the one congressman who knows how technology works","Ban those too."],"points":499}]