[{"text":["Did Ilya see AGI? Sam Altman denies his chief scientist saw super-AI"],"points":0},{"text":["Chinese and western scientists identify ‘red lines’ on AI risks | Top experts warn existential threat from AI requires collaboration akin to cold war efforts to avoid nuclear war","Blocked by paywall"],"points":0},{"text":["Silicon Valley wants to deploy AI nursebots to handle your care | Hippocratic’s web page suggests providers could soon simply purchase its nursebots for less than $9/hour to handle such tasks, instead of paying an actual registered nurse $90/hour","Nurses don’t get paid $90/hr lol probably half that normally 🤗","I had a nursebot text me today and give me the same incorrect information about a mammogram follow-up seven times in a row. I wondered about the legality since the first message she sent was introducing herself as a registered nurse. Can a bot really claim to have professional medical qualifications?! It was incredibly frustrating and alarming to be talking about something so serious; if I hadn’t read my own test results, I would have just accepted what she said but I knew it was contradicting what I had already read. Super scary","Hilarious. Now get it to do CPR and place an IV.CROCK OF SHIT","There is automated aftercare at the children’s hospital where my kid had elbow surgery. It’s horribly impersonal and it may ask a yes or no question when there is some serious gray area in the middle that it doesn’t cover. I found the system annoying. Put it in a format that is like a survey where you check boxes. Don’t pretend it’s a person that’s there to help you. That shit is demeaning.","Ooooo don’t like this one bit. When I’m in the hospital, one of the only things that cheers me up is knowing that real people actually care about what’s happening to me. This is fucking egregious. Instead of halting the ever-worsening nursing shortage by, y’know, paying the damn nurses what they deserve, they do waves arm THIS.","The problem with some Ai claiming it’s a nurse is one thing this software will never have, Critical Thinking skills.","I do not like this, or where it is going.","Get profit out of healthcare"],"points":34},{"text":["United Arab Emirates is using cloud seeding tech to make it rain","On them hoes?","Arrakis will be green again","I have heard conflicting things about whether this is potentially going to deprive other areas that are depending on that rain. Idea being that places which would have received rain from clouds if they hadn’t been seeded won’t get it, ie rain “heading” for the Amazon doesn’t get there because it fell somewhere in Nevada instead.Anyone know anything?Also if it’s in the article please just ignore that fact and pretend you brought the information from home, to share with the rest of the class.","They've been doing this for years now.","Fun fact: one of the scientists who discovered cloud seeding was Kurt Vonnegut’s brother.","The UAE has been doing this for quite awhile","Cloud seeding began with applied research at NM Inst of Mining Technology in Socorro, NM, in the 1940s, I think. People have been trying for quite awhile to get it to rain.","Is this anything new?","Not new news. We’ve done this since at least the 70’s","15 years ago, I had a friend who watched YouTube videos about conspiracy theories and always tried to get us to watch them with him. He showed me something similar, about how governments can control the weather. We laughed and that was that. Guess he was right all along haha.","In America we have found success using money over titties to make it rain. The people seem to like it.","How many times does this article need to be written?","Weather manipulation from planes? You conspiracy theorist.","Oh god this is how Pluto started.","are there negative side effects?","I would expect no less from UAE.","Prevalence … How common is cloud seeding? It is a cheaper alternative to big-ticket technological solutions such as the desalination of water piped inland from the Pacific Ocean or Gulf of Mexico. Cloud-seeding programs to boost both rain and snowfall are now under way in Texas, Utah, Colorado, Nevada, Idaho, New Mexico and California.Jun 23, 2023👀","Wouldn't it be easier to just pump water from the source and build a giant sprinkler?I mean, we already send oil all across the world using pipelines.","Dance powder is not a long term solution.","Here come the conspires.","They’ve been doing this for well over 10 years now. I lived in Abu Dhabi from 2012-2015 and this was something they were actively doing at the time already. So this really isn’t news","They’re terraforming to create a natural phenomenon where it will build clouds and rain 🌧️","Great idea","Hahaha. I wish them no luck.","So is the us","Do you want Rainpiercer? Because this is how we get Rainpiercer."],"points":213},{"text":["Microsoft hires Inflection founders to run new consumer AI division | TechCrunch","Their R&D budget must be great!"],"points":0},{"text":["Ubisoft let me actually speak with its new AI-powered video game NPCs","Great now my characters will be joshing me about always playing video games and never going out.","I’ve wondered how long it would be till I saw an article like this.I imagine this is going to be incorporated into GTA 6, and I’m very much looking forward to it","Yeah this was inevitable and frankly it was always supposed to be the way, games have been trying to generate content for a long time, now we have the technology to do it.","THE FUTURE!","People are expecting this to be the promise of a new age of immersive characters in video games beyond anything we've ever seen.In reality at best you're gonna hear slightly different versions of NPC's talking about the weather or telling you about how they saw strangers with curved swords the other day.At worst it'll probably be a new low in the slow descent of the \"quantity over quality\" and \"content over creativity\" trend that's been particularly egregious in AAA lately.","I’ll pass on Ubisoft games. Prefer to own my games and not support shit companies.","If there was anyone who was gonna try to put less effort into their games it was either Ubisoft or EA","This is going to be the future of gaming.","Ai articles are often long winded with little substance. Hopefully this isn’t the case with gaming.","Does AI know the Secret of Steel?","Still wouldn’t ever install another Ubisoft game. Like EA, they just reskin old content, throw some new dialogue in, and bam, another polished turd churned out the door.","How long till it turns racist?","Lets hope they done learn to reprogram the game and then later us😒","What was powering Ubisofts NPCs before?","Now I can have more meaningless dialogue to accompany my hollow and meaningless side quests in Ubisoft games.","Great, a game with an expiration date…","All they want to talk about would be tower liberation mechanics."],"points":93},{"text":["Pokemon resets some users passwords after hacking attempts | TechCrunch","Porygon at it again"],"points":0},{"text":["Nvidia and Qualcomm join Open Source Robotics Alliance to support ROS development | TechCrunch"],"points":0},{"text":["Gitai's autonomous robot installs panel outside the ISS, showing orbital repairs in action | TechCrunch","pretty pretty pretty cool","We all know where this is headed, drill baby drill! - with droids."],"points":3},{"text":["SpaceX to sell satellite laser links that speed in-space communication to rivals","MTG will be proven right. Space lasers and forest fires. /s edit on name","So basically China and Russia will have these in a month or two."],"points":8},{"text":["Tech giant Nvidia unveils higher performing ‘superchips’ to power AI","Yeah their stock price is down today but it really seems like there’s a lot more growth available here.","Soon enough it’ll be AI designed chips for use with AI apps and worst case scenarios can start being gamed","That picture definitely looks like it was taken from an 80s neo-noir cyber crime film, and thats the villain","“Project Gr00t, which Nvidia said was not named after the Guardians of the Galaxy movie character Groot…”Oh, I guess it’s named after that OTHER Groot","Did he color his hair just for this?","The non-orthogonal socket placement really bugs me.","Plot twist: they always had these, they were just waiting for the stock price to fall to unveil them to get another pump in.","While Nvidia in first place with advancing AI technology, what are some areas in computing or AI technology that their competitors like Intel and AMD change to make them stay in competition? Nvidia’s technology is revolutionary and creating the standard of modern computing","I see three faces.","Why do all tech guys have that collarless leather jacket look goin on?","Nice periwinkle hair","🫧","More and more power required. These are not good for the world.","How many leather jackets does this guy have?","Haha it looks like a face. I have no thoughts on anything else","This dude needs to unveil a new jacket and hair tint","Why does everyone who runs a tech company shop at the same clothing store.","If AI is used to harm the economy. Do you put Jenson in prison?","Maybe CEO can afford to get a wardrobe consultant.","Nvidia made AI faces out of superchips","I love it when tech CEOs/bros try to dress cool. They always look so uncomfortable and confused the entire time.","What if all of this is just smoke and mirrors?","Looks like still straight from ‘the Matrix’.","But can they make a super chip to cure peoples/my depression?","Render","Obviously the leather jacket justifies another 20 fold market cap valuation. Bag holders Unite!!!","Since they gave up on gaming and cryptomining now their jumping to the next fad/fraud."],"points":185},{"text":["The AI Act is done. Here’s what will (and won’t) change","They're going to have to be more specific on the ban in healthcare use. One of the more promising things I've seen was having the AI 'first look' at scans looking for anomalies and then having a human check the flagged stuff. Instead of a single (or few) passes by a human you get the equivalent of a 1000 second opinions on if something is suspect or not. and they can do it for absolutely everything and everyone. No reason those cuda cores should ever be idle.The police stuff is pretty neutered. They can't use it... unless it's for 'serious' things like terrorism. If it's like the US where everything is terrorism or extremism or kiddy porn related then basically they'll only be unable to use it for traffic tickets... unless it's 'serious' traffic like where they need money. Really not sure how corrupt their policing is over there though so maybe this is a real restriction.","‘Hate and violence have no place on Reddit’.😂","The one thing I know about laws written on paper is that they are not bullet proof and are therefore a road that gives one a false sense of security that lulls one into sleep and the only real defense from tyranny is eternal vigilance.N. S","I wonder what the ban in teaching will entail.I don't believe it's a sound goal to try and replace teachers - but why couldn't something like ChatGPT or similar AI programs be used to speed up creation of test or study materials?On top of that - how's it work when AI surrounds everything happening around the classroom? Just about everything on the internet either already has or eventually will feel the touch of AI.Kids will use it to cheat so why not instead invest time in teaching them how to use it as a tool and to safely navigate around it's biases. I'm genuinely having trouble finding sources so I'm truly curious what the thought process is.","Act 1 always ends on a hopeful noteAct 2 is when all is lost and hopelessness reignsThose who make it to Act 3 have the best chances of anyone, if they’re on the right side of history"],"points":79},{"text":["Nvidia Announces GR00T, a Foundation Model For Humanoids | The company also announces long-term support for the Robot Operating System","This is the type of news that goes under the radar but is actually making history when we look back.","Is Nvidia actually cyberdyne??","Buncha AI robots shouting “I am GR00T!”","Next step is printing their own organs. Dope.","I assume they’re baking in the three laws… right?😳","Cool, so I'm fucked. I work a labor job that is likely to be replaced by these fucking robots.I have no skilled trade, secondary degrees, or education. Might seem like an overreaction, but I know of lots of forklift jobs that have been replaced by self driving robots just recently...","Groot was the tree guy right?","Skynet, this is all Skynet","Wait so is Nvidia actually Skynet? One love","I guess we'll see if their GR00T is really ID10T.","Render"],"points":59}]