[{"text":["Roku Data Breach: Over 15,000 Accounts Affected","So, all of the accounts."],"points":0},{"text":["How to analyze installed or downloaded Android app for security risks directly on device"],"points":0},{"text":["Red Team gear for CV projects"],"points":0},{"text":["Burnout"],"points":0},{"text":["Genuine feedback"],"points":0},{"text":["Is Man-in-the-Middle, white box, and black box testing *actually* being changed? If so, is it really just for \"political correctness,\" or is there more to it?","CAPEC now calls ot Adversary in the Middle. Whitelist is Allowlist and Blacklist is Denylist. This is a very US thing, though.","\"Machine in the middle\" is what I tend to use, as it's more precise and keeps the MITM acronym so it's highly recognizable. I haven't heard On-Path, but eh, it's reasonably clear from context clues. I doubt professionals would have trouble with black-box/white-box vs closed-box/open-box or similar.For context, I also teach, and I would differ from your professor in that I'm not going to tell you that a specific term is \"phased out\" because that's not how language works. Language is a tool for communication, there is no standardization body for \"how people communicate,\" and language around the world is constantly evolving. Case in point, I have no idea what a \"rizzler\" or \"gyatt\" (sp?) is and I don't really care to find out, but both are likely new terms for existing concepts that are preferred by a specific social group.As long as we're both understanding each other & comfortable within our dialogue, then we're cool. If your professor is requesting to use specific terminology, then you should likely use it in your class to ensure clear communication between yourself, professor, and other students - but don't be surprised if you hear other terms around whether \"phased out\" or new phrases or what-have-you.Personally, I use non-gendered/non-colored terms by default when I teach, but I describe what people might recognize - ex. my slides are titled \"machine in the middle\" but I'll include other recognized terms like \"man in the middle\" or \"packet sniffing\" to ensure anyone who's heard other terms ties their existing knowledge to the course material. It takes no effort on my end, and I've yet to hear any complaints or notice any drop in exam scores, so it seems like everyone's communicating just fine.","How long did it take for developers to get over the master branch in git being renamed to main? That was a riot for like, a week.Is it over the top? Yes. Will anyone get hurt by this? No. Will it make more sense to future generations than it does to us old timers as we yell at the kids to get off our lawn? Maybe.","It’s really not that big of a deal. Whatever the next batch of words will become industry standard and then that’ll just be the default. Long as the replacements make sense it’s fine really. Only reason we might be hesitant is because its been the default for a while. And we, if anyone, should not suffer from “well its always been this way” mentality that plagues every industry from making good changes.Theres lots of good changes like whitelist/blacklist being replaced with allowlist/blocklist which for me just makes more sense anyway. I remember being puzzled over what a whitelist was when I first ever messed with a games server like 13 years ago but if it had been called an allowlist I would have gotten it.Things change fast these days anyway. Might as well get comfortable being flexible.","Are we thishelpless as current professionals in the field or upcoming security professionals that we can't stand up for these basic termsWhy do you feel these terms need protecting? They are not special important things, they are terms which are subject to change. I feel no need to “protect” terms used in professional parlance, per sé.Allow and block list makes it pretty clear what we’re talking about, no need for white/black.","Whitelist and blacklist are as intuitive and self explanatory as allowlist and denylist if you grasp the cultural context of words “white” and “black”.Black represents bad things like a black god “czarnybóg”, Satan being portrayed as black, darkness and stuff.White represents the opposite, like sanctity, divinity, pureness, innocence…It doesn’t have anything to do with racism in the US, those terms come from natural dread of the night that comes to every kind of humans.Being ignorant of the most common themes in cultures all over the world is not progressive, and replacing them “because racism” is a sign of massive ignorance.Finally they sounds better, less mouthful than “allowlist” and “denylist”.Man in English language refers to any human. Statements like “all man are born free” don’t imply no gender. Same with words such as “mankind”. Unless you would like to change it to “mankind, womankind and childrenkind too” those changes are just some peoples’ silliness and I think they should not be respected.","I don’t really care, do you?","I never heard about MITM being called On Path, but if they are doing this it's indeed because of political correctness. Same with whitelist - blacklist being renamed to allowlist - blocklist.","AitM is fine, at first I wasn’t sure why we needed a new one, but we got female adversaries, too, probably, so that works. It explains the concept more concisely. Black/whitebox become what?","I’ve been in the field 3 years and this is the first i’m hearing about any of this"],"points":66},{"text":["Are you Cloud Security material?","Good group, highly recommend joining","Please, God, take me back to on-prem.","I think people take the word \"Cloud\" too seriously as its own thing. On-prem security skills will always translate to the cloud. The mindset of securing a machine/server/an entire infrastructure doesn't change whether it's cloud or not. Cloud is just another word for \"your data on someone else's machine\". You could have differences in tools on how to manage different security baselines. Authentication, Auditing, Vulnerability Management, Security testing itself, those all still follow the same principles from before, just using different tools. Once people get over the buzzword factor, they should quickly find themselves understanding Cloud easily.","How long do these typically run for?","Look, nobody STARTS in cloud security99% of new grad security engineers in tech start in cloud security, because, well, it's all cloud.Just because you didn't doesn't mean others can't.Do you think Cloud Security is unapproachable?It's not, it's the bare minimum standard to be considered a competent security engineer today."],"points":19},{"text":["How does AI impact cybersecurity today and in the future?","Automated attacking and defending. Probably soon you’ll need AI tools on defense as humans would react too slowly.Patching windows will shrink even more.","AI is both a tool and a threat, but not in the way most companies leverage it. I see so many companies saying \"we use AI to keep you safe\" but it's the same crap from 12 years ago that didn't keep anyone safe then and sure as hell does not keep them safe now.Some companies have started to use more advanced forms of AI in hopes to stave off the AI vs AI battlefield which I see CISOs saying \"it's coming!\" when in reality, it's already here but they are so removed from the day to day of the threat landscape they are basically clueless.Many think AI is going to replace everyone, in fact it's going to create opportunities as someone needs to validate the automation isn't being fed incorrect data and thus piping out hot garbage that people think is gospel.My past 8 years or so working with the most advanced forms of endpoints security leveraging true next-gen AI (not machine learning) has shown me there is definitely hope but far too many are fearful of adopting or just plain cannot understand it and therefore steer away from it.​TL;DRAI is both good and bad and will require humans to validate what the AI is being \"fed\" during it's training. The AI vs AI war is thoroughly fun to be a part of though and it's the best part of my day throwing AI generated variants against programs to see how they handle these threats!","I can have it create a very effective and damaging worm and not write a single line of code.","It's actually surprisingly bad at cybersecurity so far.The literature shows a less than human ability to identify and explain secure code failures in particular, and penetration testing efforts have been less than impressive in arbitrary environment. Sorry, I don't have the reference, but there are some out there to be found.My take is, legal side will be replaced most quickly, some areas of lower level RM, and eventually SecOps - starting with Prevention - self-optimising NFW, WAF, traffic inspection, informing and automatically updating, or scheduling updates, for solo human operators to prod.Then Detection after, of outliers, anomolies, SIEM initial triage, etc. Feeding into the same cycle. Finally Response - taking outlier and live data to perform Identification, Containment steps, and with generalised AI it could go much further.So, if you want to be \"AI safe\" in your career, focus on those aspects which it is not showing much of a talent for, and ensure you can talk about ML such that you get put into the \"can help us make ML work for us\" category and not the \"Can be replaced by ML\" category at work.Its going to be good at DF (but not excellent, further pushing DF toward an expert only market), bad at GRC beyond scoping and gap analysis perhaps. Other areas, remains to be well tested.","It's going to replace people YOLOing AMC and other meme stocks.But that's just an opinion. 👌","Im at the HIMSS conference this week, and this is a major topic of conversation. A couple of initial thoughts: 1) AI’s deepfake video technology is already causing problems. Google “$25 million Hong Kong CFO” for a wild new example of someone getting tricked into sending a huge wire transfer to a bad actor. 2) Quantum computing is on the way, and once we have quantum powered-AIs, things are going to get very interesting. 3). Continuing on the quantum front, quantum computing will render all of our existing encryption algorithms obsolete. New algorithms that are “post-quantum” are in review and should be approved for widespread use later this year. 4). AI offers both security threats and benefits. On the benefit front, AI will enable us to identify threats faster and automate responses to common threats, allowing us to reposition security talent to higher value activities. 5) on the same note, AI is also going to empower bad actors. So the arms race is on.","There's probably many posts discussing this question but I want to know how people in the field see AI.Probably feel the same way as the last time this was posted.","AI is severely overhyped, it will MAYBE be useful. It is good at creating crap that doesn't need consistency, but if you ask it to repeat a thing twice, the results will be different, and that is not acceptable in any field that needs consistency like cyber security. Some things are not up for interpretation.I have yet to see an \"AI\" stop a cyber attack, all i hear are PR bullshit from vendors. The \"AI\" we have today is not the AI we are looking for.","In a sense we're using a coarse AI in endpoint protection tools and log analytics. Coarse in the sense of a smaller set of rules and probabilities.I suspect AI proper isn't going to add much in the way of additional value other than monitoring and alerting type stuff that will go to a human agent to validate and act on.From the offensive side, it will be a godsend for phishing campaigns.","Basically the major impact area is blue teaming, The talks on the internet suggest SOC L1 will be completely replaced"],"points":26},{"text":["Vulnerability Summary for the Week of March 4, 2024 | CISA"],"points":0},{"text":["Tenable.sc users?"],"points":0},{"text":["Phishing campaign","Without more info its hard to say, but if you think you are being targeted I would start going through them to see if you can identify patterns in the phishing emails, there are probably emails you are missing that have gotten through (and hopefully your users haven't clicked on anything).","Yep, we use Microsoft defender for which you can enable impersonation protection for some users. This results in a warning banner in outlook if an email is received with a from name that matches something in our list of names that is outside of our domain. We use this mostly for execs who tend to be spoofed the most.This banner will appear in emails with senders like \"Mr Ceo evil@gmail.com\" where emails should be from \"Mr Ceo mrceo@mydomain.com\". Assuming you use defender you can find impersonation protection in your phishing protection policiesEDIT: I've used other mail gateways that have similar policy options. If you're using something else and don't know where to find this option I recommend reaching out to support or your csr contact for the vendor","What is your email setup? The most effective answer is awareness, followed by awareness, but you ought to have spam filters, virus scanning in place to the extent its possible","There are special records in the DNS for your domain to restrict spoofing. DKIM records limit which mail servers can send mail for your domain name. The google mail help pages explain how to configure your mail server to do this. If you don’t manage your own mail server you will have to talk to your service provider.If mail is being sent with the correct personal name but the domain names behind them are different from the company name you can set up some filters so that mail from employee names which don’t come from internal servers is placed into spam.Many email clients like to show the friendly name rather than the email address so you could configure the mail server to strip the from name and to use the hidden email address instead. Tim Smith then becomes something like qqeezz5686@freemail.spamhaven. Staff can also be trained to examine the friendly name for every incoming mail but this is time consuming so configuring the client software or the mail server can be a great time saver for staff that have busy mailboxes.Spam filters are an important part of any defence strategy. One of the most common and effective is spamhaus.","1) Training. Ensure that your employees can recognize a phishing email and provide training on how to test links for malware, negative reports, etc.2) Malware scanners. Deploy good malware detection tools (there are numerous vendors to choose from now, and many do a heck of a job when it comes to real-time detection of threats like this.3) Email security. Make sure your admins know about DKIM, DMARC, SPF. https://www.howtogeek.com/devops/dkim-dmarc-and-spf-setting-up-email-security/#:~:text=The%20DKIM%20system%20offers%20a%20way%20to%20verify,spam%20folder%20but%20it%20could%20be%20dropped%20entirely.","I'd recommend getting some Anti Phishing software, like It is highly efficient, especially when dealing with a lot of emails.Besides, it is super cheap."],"points":7},{"text":["K8s LAN Party - a Kubernetes Network Security CTF"],"points":0},{"text":["Musing on Auth: How we Authenticate"],"points":0},{"text":["French state services hit by cyberattacks of 'unprecedented intensity'","Logic result of recent foreign policy of the french state"],"points":0},{"text":["Bug Bounty Payouts","In the US the vast majority of government programs are unpaid, but a few pay. And I’ve been in some private programs and contests for gov orgs that paid."],"points":1},{"text":["Labyrinth Deception, extending ways of response: Fortinet"],"points":0},{"text":["Companies with larger security budgets are more secure than those with smaller ones - YES or NO?","Maybe.","Larger org -> more complicated environment -> more things to secure -> more budget required","Premise is overly reductive.","Not necessarily. Usually a bigger company has a bigger attack surface, and may have a lot more bad technical debt consuming both their budget and their manpower.","Companies that know what their threat model is and consistently assess where their gaps are in addressing that threat model and then empower professionals to close those gaps in the best way possible? Then yes, larger budgets will generally lead to better security outcomes.Change any one of those qualifiers, though, and the answer is \"maybe but it's largely up to chance.\"","At larger places where I worked I’ve seen other teams toss money at various overlapping tooling and never operationalize them.","NO","No, one clik on a malicious email and your done. No amount of money fixes the user.","I work in threat intelligence at enterprise level. When you're dealing with huge global brands, risk is directly proportional to the size of an organization's public DNS presence, especially in retail and financial services verticals, but tooling and expertise are leagues ahead of mid range companies.The SOC teams and threat hunters I deal with have vastly more resources at their disposal than SMB outsourced security teams, and a better understanding of their attack surface, but risk comes with the sheer number of subdomains, third party services, and DNS records they manage on a daily basis. They often need to defend (enumeration) and attack (phishing detection) within the same workflows. It's a minefield.All-in-all, I'd say yes, because the security teams are more talented and better trained, but there's secondary challenges too.","Not necessarily. There's much more to being secure than spending money. But it helps.","Mostly, most secure is likely a small place with a lone neurotic sysadmin where the employees all listen to him somehow. 😂","More money does not automatically mean more secure.","More money, more problems. Anyways, same like in football (soccer). „Money don’t play”.It is all about right strategy. With more money you have less limitations, but still high budget will not do the job ;) so NO, budget level does indicated security level.","Not necessarily.","No","It depends.Why yes I am a professional, why do you ask?","Vague AF question, no bulletproof answer for it.","No budget != Security","If there any departments other than IT/SOC then no. People get social engineered far too often.","No. How secure a company is depends how good the good the leadership is and if they are serious about being secure or only serious about SAYING they are secure. Budget has little to do with it. If they are serious they will find the money.","I would say no amount of budget can counteract the insider threat of careless/ignorant end users. Some companies(mine included) throw money at tools, but have done little to curtail the end user from falling for obvious phishing attacks. I had a user actually fall for the CEO giftcard text a few months ago.Edit: Let me not put it all on the end users. IT professionals often have bad habits as well that render security tools worthless.","Multiple factors to consider outside of budget.","You can throw all the money you want at cyber products but unless they are implemented, configured AND monitored, they are worthless.It depends on the people, the leadership, and the culture.","Not necessarily. Can they be? Absolutely, but if they aren't spending the money in the right places or more importantly they aren't listening to the security team, then no. A company with a smaller budget that implements from the top down, works in a methodical manner, and has higher ups that listen to the experts, is going to be way more secure than a company that just throws money around and doesn't listen to their SMEs.","Depends on who is leading the security department.","Did bigger work for the Titanic?If whoever is steering the ship isn't laser focused and LEADING their respective crew in the right manner then the size of the ship is just as likely to be a detriment to their security goals as to be an advantage.","Most likely, if they have access to better detect and prevent products there is less chance of malicious code being ran.","Too much info is missing. You can have a large security budget and choose the wrong stack and still get screwed.You can have all the best programs and have an employee weaponized against you and still get screwed.Just in 2023 we saw massive companies with more than enough money for a massive cyber budget get completely bent over by groups, and they were not using advanced tactics in their attacks at all.It's a crap shoot and really comes down to what you have but more importantly how well those leveraging the products can implement and update them.","It depends on how the budget is applied, as others have said. Just having more money doesn’t correlate with having better security. It’s a false equivalence.","The have the financial freedom to be more secure","The Federal government has one of the biggest budgets around and is one of the biggest employers in the country.Yet they get breached over and over again.","\"more secure\" is a large subject, it depends how you want to take it and how do you evaluate the risks: on which references would you base your opinion? ISO27001, NIST or any similar? But, what if they are good in doing documented procedures, but bad in execution? It also depends on who they are, if they are more exposed to state threat actors, organized groups, etc Another example, an company can be very large, but built on a lot of legacy and irreplaceable but obsolete and vulerable systems. Same for large companies that do a lot of mergers and acquisitions: they have the money and the workforce to grow, but they inherit obsolete systems that would take a lot of resources to migrate, so they leave everything as is and end up with a very heterogeneous information system. One last example, a big organization that invest a lot of money into security solutions, with state-of-art EDR, XDR, and whatever they can buy, but without any cybersecurity culture and no knowledge of in-depth security. Would you consider they are \"more secure\" because the probability of an external attacker compromising their information system from an exposed asset would be very low, but any threat already inside (e.g. phishing, physical intrusion) would be able to fully compromise everything in less than an hour? In conclusion, it depends, mostly of the strategy of the organization regarding cybersecurity, there are no general rule that applies here.","No. And as long as top leaders think that simply throwing money at “security” means they are more secure the answer will continue to be “no.”","Budget is a probabilistic factor in maintaining cybersecurity posture.","You can spend all the money you have, doesn’t mean anything is being properly configured or managed","No","\"yes\"","I’ll take “false dichotomy” for 500, Alex.","Depends on how efficiently the money is spent.","Sometimes","Not always, it’s all in the implementation!","No! It doesn’t take millions to be secure, it takes knowledge, planning, consistency, and cooperation.","Larger company, larger budget, more users = less secure.","It's not the budget it's the users","No. Large companies will buy every security product available by lack the manpower to implement them or update them. They are more willing to expend budget on tools than hire appropriate staff.","Ohhh and the recent Microsoft breach says No.","Depends on the Vulnerability management standpoint and making sure they're patching. This can be a lot more challenging in a bigger company."],"points":217},{"text":["BC Security will be offering their Ironpython DEFCON workshop for free March 19th"],"points":0},{"text":["Small business security overhaul","Find an external party to run your security if your clients are demanding higher security. Otherwise consider switching to Microsoft e5 as it is very complete and it can grow with your company.If you want good security you will want to reduce your attack service aka standardize on servers and endpoints","I use Huntress EDR and MDR. It is co-managed with an external MSP, but I am going to deploy it solo for an expansion we are doing. Works great, is cost-efficient, and it comes with the Huntress team that monitors and reacts 24/7.","MSSP providers exist and it's a very competitive landscape. This is 100% something to outsource. You don't have the bandwidth to monitor everything yourself 24/7.","Wazuh might be an option for you. It’s an open source SIEM & XDR tool, John Hammond has a great YouTube demonstration video on it. I don’t have any experience with the tool myself but I plan on implementing it into my home environment for some fun experience.","Your best bet is to hire an outside consultant, possibly a vCISO, to help guide you. They can advise where you should start with protecting your business by prioritizing the threats (fraud, ransomware, attacks on your servers, etc.) and what defenses you should set up first. Security tooling is not \"set and forget\", it is \"set and watch closely to see attacks against your stuff\".It is common to see early-stage startups like yours not do much security at all, even if customers ask for it. Once you have some revenue and can make one of your devs responsible for security monitoring and alerting, then you can have more focus on it.But if you're really fixated on the OSS tools? OSSEC, Security Onion, or Wazuh. OpenEDR from Comodo comes recommended (I haven't used it). Velociraptor for Incident Response artifact collection (not prevention).","Would you ask an automobile engineer to work with city gov't and develop laws about driving cars? That's what you've been tasked with.The problem is we've allowed the equivalent of used car salesmen to call themselves security practicioners for the last 20 yrs, looking at you CISSPs.Hire a staff security pro, even a part-time position, or hire a consultant.IT pros transitioning to security have a hard time understanding the role and dev's are no different. Most overspend by hundreds of thousands of dollars because they don't understand how GRC and tools work together.","Great resource to hit the basics: https://www.ftc.gov/business-guidance/small-businesses/cybersecurity","My best advice is to do the least customization as possible since misconfiguration is where a lot of vulnerablities show up. Also since the company is small there may be off the shelf solutions that are relatively cheap that you can adjust your process to fit so I'd Find paid solutions and price them out. When compared to the learning curve and your salary with the risk of misconfiguration it might actually be much cheaper to pay for off the shelf solution","This is a XDR solution from Trend that meets the criteria you've listed. I'm a SME on this product. Feel free to dm if you have questions.There are a lot of vendors out there, highly recommend doing your own research.https://www.trendmicro.com/en_us/business/products/one-platform.html","Wazuh is your answer, gotta build it out though"],"points":26},{"text":["Associate of applied science cyber security","The jobs you should be looking for with a 2 year degree are going to be entry-level help desk jobs in IT.There, you will start to build experience and you can move into security as you grow in your career.","I finished my BS at age like 24/25 so I wouldn't worry about age. I do worry about the promises by your advisor. At best the only thing available directly out of an associates would be help desk or tier 1 tech. I would be shocked if a security position would swing your way not trying to deter you just trying to be real.","Dont listen to any negativity. I got an associate's in cybersecurity and a few certificates, got hired a few months later as a junior cybersecurity analyst. I'm older and other factors on my resume helped, but there's no reason not to. Look into local or online colleges that will take an many transfer credits from your community college as possible. Get that associates and roll it into a bachelors. My school took 82 transfer credits between my community college and the first time I went to college a few years ago. I'll have my bachelors soon. 21 isnt old. I changed careers at 37. Spent about a year and a half working on comptia certs and my associates. I'm dumb, if I can do it so can you. Look into free community college, check if your school uses Grant's to pay for your comptia or az certs. If you really wanna go for it, join the reserves and go to school for free while uncle sam covers all your benefits. Theres lots of options for a 21 year old out there. Dont be afraid to make big changes to your life. Get focused, be hardcore, believe you can do it!💪","So many \"entry level\" cybersecurity jobs are not actually entry level. They require a moderate level of understanding of the environment at least. I believe you can start with a help desk job even now, depending on your curriculum and it would help you both financially now, and for your career. I would prefer someone with a help desk and/or sysadmins background in cybersecurity over a  \"CTF warrior\".Also, the associate degree is as useful as what you make of it. Would you rather learn stuff so you can utilize later? Or do you just want the degree? Though, questioning these shows that you are someone who wants to understand and plan ahead. Or at least, you are trying to minimize the ambiguity. That's something I admire. I have seen so many people, even after graduation, they don't know why they studied and what do they want next.Edit: syntax and typos","I was 30 when I went back for my degree, so you should have no problems there.I have an associate's and I never put it on my resume. It really doesn't gain you anything. The jobs you will qualify for won't care about college degrees and those that do care will want a bachelor's at least. Keep an eye out for programs to help you transfer to a 4 year program. You'll be better off in the long run.","Don’t feel old. I’m 27 working on my sec+ cert","We just hired a new IT Branch Tech at the branch I work at. He is 29 and just graduated with a 2 year degree in cybersecurity at the local community college. He worked for several years and realized he wanted more in life. So in his late 20’s he wanted to back to school. He also has a security+ certification. He may not be working in cybersecurity yet, but now he has his foot in the door.Also Im 50 and im going back to school for my masters. I just finally finish my BS degree 2 years ago. Never too old to go to school.","While a degree is better than not having one to get started, certificates are usually better. While you are in school and have access to a .edu email account, try to work with your counselors and professors to get certificates in the courses that you are taking.Also, I agree with the other comments about experience. Think of Cybersecurity is a specialization of IT in general. Learn IT and how to build systems with a \"Security POV\". I always say \"you can not build a lock for a door if you do not know how a door works\".","Look for some GRC roles.They are not as technical heavy but still allow tons of exposure to lots of technology, business processes and security tools/processes.You get you observer a lot of “how things work” and see lots of broad areas in security without being siloed into one area at first.I did the same thing starting out. Same degree no Certs. It was still relatively entry level and paid decent.But it’s better than help desk, it’s in the Cyber world, and nice hours haha. I’m using this time to find my focus and continue training","As someone finishing a A.S. In Cybersecurity at 25, you are not too old, but I wish I just went general ITI tried CompSci and was bad at it so I switched to CyberLook at the curriculum of your schools Cyber degree and compare it to the IT one. At my community college the stuff taught in the IT degree would’ve been much more beneficial to learn for a beginnerI have 4 years IT experience already so I figured I’d go Cyber but it still feels like a mistakeI feel like a better path for someone who really wants to get into cyber and can’t do CompSci for whatever reason would be Associates in IT, Bachelors in IT, and then if you really wanted you could do a Masters of CyberCyber is just MUCH harder to get into as a beginner than IT is. Cybersecurity degrees aren’t BAD per se just don’t feel right as your first degree","I went back the same age as you. I did my associates and now I'm months away from getting my bachelor's in IT(concentration in network and security) and I have 4 certifications already(my focus is cloud and cyber).If you continue to pursue your education for your bachelor's, make sure your classes that you will be taking are transferrable directly to the major you'll want.For example, in NJ, there is njtransfer.org and you would input the course code and see if the credit transfers over. A had 5 different advisors from my community college telling me different things before I finally found out that this is how the system works. Plan ahead so you don't waste your time.I highly recommend you get some certifications before you graduate. It will really set your resume apart. Note that I said certifications and not certificates (looking at you Coursera). Also consider doing some projects to demonstrate that foundationational knowledge. It's a never ending learning curve in cyber","I would say for jobs - foot in the door and pivot to whatever comes your way.It's harder to get in from the outside for many organizations. College and certs are the icing, but who you know and experience is the cake. I have CISSP, CCNA, Sec+ and a B.S. in Cyber.Yet - I found it hard to get my name in through to HR. Maybe I was how I wrote my resume? idk. But I got a job offer real quick once they started seeing my face around the building (got an internship) with pretty good pay. Also - labbing is really big in Cyber, if you can set up a lab, document it via youtube or whatever (it's not for others really - it's just nice to see progression) - you can really get some heads turning.","I went to a community college then a 4 year college, only difference was I did part time at the community college.I would first look at which university's you can get to for your 4 year degree, and pick which degree you should get at the community college based on what bests transfers to those college's. An associates in cybersecurity particularity really makes no sense as nothing you can learn in 1/2 classes would give you enough depth for anything solid, at most basically equal to a sec+. Also, an associates really will only help you get into the most basic entry level jobs like helpdesk or desktop support, as they generally don't carry enough weight without experience for system admin's or network admin type of work.","most companies want to see a bachelors these days, especially if you don’t have experience. I have the same degree and it took me like 2 years to land my first cybersecurity job but my friends who did their bachelors got hired right after they finished","You should be able to get an IT job while you're in college, especially if you're attending school part time.While you're in college, leverage all the resources that your school makes available to you: computer labs, professional contacts & networks, student discounts from vendors, and more.Just whatever you do, don't go into school expecting that the degree will land you a job. Hiring managers will want someone who can practice their skills and learn quickly, and it's best to find a way to develop a portfolio of sorts to show that you can do the work.","You are young!!!! I’m an immigrant and I’m going back to college in US, almost 25yo 🤯","Get all the certs you can that go with the class you are taking for instance. CompTIA A+ would go with your IT fundamentals and basic computer troubleshooting class. Cybersecurity is not an entry level job.","Too old?! You're literally college age. You are decades ahead of some people getting into this field.","Don't limit yourself to GRC, or tech support. Depending on your goals a software engineering/ ops gig could be hugely beneficial.","I got my AAS in Information Assurance and Cybersecurity from a local community college in Maryland. Spoke to my advisor and found out they had a 2+2 program with a local university in IT. So I was able to transfer 64 credits to that university and get my BS in IT. I was 24 when I graduated because I started college right around 20.Keep in mind, I did not finish highschool. I had a below 1.0 gpa basically the entire time I was in highschool. Just never went or cared, so I legitimately had to teach myself how to learn and take notes during the entire first year or two of college. Had to learn math from scratch. Had to learn how to write papers from scratch. All that stuff. It was challenging as fuck but I put the hours and effort in and learned a ton in my time at college. Sat in the front of every class and went to office hours and study sessions whenever I could. I am by no means the smartest guy in every room.I bartended on weekends while in school and had a regular patron who worked in the hosting industry (lots of web servers and databases). We became friends over a 2 year period, and I eventually asked him to mentor me; which he accepted. He had me work on some projects, and we would hangout and have beers and play guitar and shit from time to time.I was in my last year of school so he eventually asked me if I was interested in an internship (of course I was). I worked as an IT intern for about 6 months before they hired me on as a full time sysadmin. Worked as a sysadmin for a year and legit just kept asking if I could help with more advanced stuff. Eventually I shifted into a systems / linux engineering role where I was migrating, securing, patching, and automating system and network infrastructure for all kinds of clients.Ended up getting the go-ahead to work as a 'digital nomad' for about 6 months before getting laid off from that job (best thing to ever happen to me). Then worked varying contracts while traveling around eastern europe for about 4 months. Mostly Ansible and Linux related work. Some quick contracts to keep me from day drinking too often lolRecently moved back to the states and found a sick Security Engineering job for an MSSP and I'm loving it. Love the work I'm doing here and the people I work with. Most stress free I've ever been and since it's a small company, my opinions are definitely taken seriously by management. Nobody is breathing down my neck all day or anything like that. It's great.Anyway...I would say college is what you make of it. Your degree doesn't mean shit if you do the bare minimum and are just going to get a piece of paper and leave. I loved college and took advantage of all the opportunities that were presented to me there. Made lots of friends as well.If you are persistent and ambitious when setting and achieving your goals, you can get into the cybersecurity field without a degree. In my opinion, I would go the help desk / sysadmin or junior dev route to get your foot in the door though. It's unlikely you'll get security role without some foundational work experience these days.Also, ignore all this \"wahhh it's so hard to find a job\" nonsense going around the tech community right now... there is opportunity everywhere. If you can solve problems, are personable, and can sell yourself well, you will find work. Basically, what makes you stand out from the other 100+ candidates? Nobody wants to pay a guy good money who's just like everybody else.","I got an associates for support tech at 26, did that for a few years and moved in to entry level soc, you'll be fine. As others are stating, get certs. Have continued passion for learning and learn on your own. I'm now a threat intelligence and incident response analyst III.","I am in the same boat. I am getting my associates in IT. I don't know where to go from there. I want to get my foot in the door i'm 22 years old.","I’m getting a AAS in cyber security. I have a couple certs but applied to 4 internships and everyone called me to set an interview up. Took the first offer which was the lowest paid at $22 but I believe in the company the most. You have to find ways to stand out though. A bunch of my classmates aren’t getting anything and only do bare minimum to get by.","I got out of the Army at 22 and started school. I started with an AAS in Informatics. From there I got a part time help desk job at a school. I bounced to another school for full time sysadmin and now a security engineer.The AAS is great to start, but understand this field isn’t the type where you get a degree and you’re off. I worked hard for certs, built my resume/linkedin, did independent study and labbing etc. You will be studying forever so long as you wish to progress.","I started CC at age 21. I did not feel old at all and you shouldn't either. Plenty of students were around my age or older.I would say start looking for some entry level help desk jobs or internships asap, don't wait until you finish. Also, start working towards certifications asap as well. Just don't wait until you finish your two year degree to start doing everything.Good luck!","Also in a GRC role. Transitioned into that on the power of my AS in IT and a Security and Administration background, and a Security Clearance. A lot of the 20-somethings I work with have maybe a Bachelors in a relevant field. A Sec+ (or one of a set of other less common certs) is needed to advance, but not to start. Having the Sec+ would give a leg up. A few years ago, anything computer related wanted you to to talk about what you were doing with your \"home lab\". If you can, maybe spin up a small domain of virtual machines to putz around with.","Too old? Lmao!","Community college or an applied associate's is a great way to start. Expect an entry level position, but that coupled with some relevant certs over time is going to help you quickly climb.","Don’t sell yourself short, everyone in tech is crying… i got a job in tech without a cert, been in helpdesk for 6-7 months and already am interviewing for information security admin at a bank. The field is intimidating cause how massive it is but if you’re willing to go back to college at 21, youre more motivated than 80% of people in the field.","You're 21, you're not too old for anything.","If you go to the website cyberseek.org, it’ll show that the security+ certificate is desired on close to 80% of cyber roles. So I’d try to get that certificate if possible. “Security+ from CompTia” . There’s lots of resources online and especially on YouTube to help you prep for the exam which would be cheaper than getting the training from CompTIA directly, but the call is yours to make. That cert should help a lot! Then you should be solid imo without the work experience","9 years exp here, started in 2015 as a Sys Admin. 28 years old now. Associates in IT at 19 years old. Just jump in and get it done, you won’t regret it","Great that you are going back to school. There are many paths to work in the field with some working the help desk and moving up. However, since you are in school, I highly highly recommend getting a cyber internship. This is big as you can get experience and work with different teams for exposure. Also, with enough time, you will most likely get a full time offer. Also, do not just do your school work. Aim and get certifications. By the end of two years, you can get experience with an internship in the field and certifications along with it.","Too old... I started IT professionally when I was 26. Started college for the first time at 28.I'm making 115k todayThere are people that started older.","If it's at CCC just DON'T!","These are solid questions. You can absolutely get a help desk job and maybe even a social analyst job. Intern also is solid. Depending on where you are the govt has some amazing internships.","Lol. I was doing this exact thing in 2019, and I was 27. You're not too old. However, don't let anyone fool you. You will only be qualified for low-end help desk jobs and aren't going to get an entry-level cybersec job because there isn't really such a thing. I had an AAS in IT with an emphasis in info systems and cybersec. I got hired to be a desktop support tech and do help desk stuff, too. Six months later, our company was bought by a bigger one, and I got more than a 20k pay bump to do just help desk work and got a mid tier position because of my desktop experience. I settled in, and with another 8ish months of working my ass off, I was top 3 in the help desk in most statistical categories my company cares about. I got a promotion after another 6ish months and a good pay bump. Now I'm the highest position on help desk that isn't a supervisor. I'm paid well and specialized in an area that allows me some freedom to help other IT departments within the company. Here's the kicker. I've been in IT for almost 3 years, and I realized I don't really even want to be in information security anymore. IT is such a diverse field, it's very likely that after spending a few years in it, you'll find something you'd rather be doing. Good luck, man, don't stress. It'll work out eventually.","I started my associates as soon as i turned 21 as well, and literally my first semester i was able to get a helpdesk internship which led me into a permanent part time employee at the company and now I am able to cross train and learn some things from our cyber security team and also learned a couple things from our network admins , i think helpdesk is a really good place to start and most dont require any certs they just need you to be motivated and also able to have good people skills","I went to college. Ive seen ALOT of folks around 25yo in the same class when I was only 21. No one will care about your age, nor its never too late :)","I started college at 26 and graduated at 30. I had an easy time because I got along with my advisor and professors, because we were closer in age. I even dated one of them! You can't do that at 18 lol.. I worked at my college too. They give you more lienency when you are older. I didn't have any issues getting along with my classmates either. I'm still friends with some of the people from my degree program. Mostly it was a good experience.I did one semester at 18 and said it's not for me. I'm glad I went back. I actually don't use the degrees I got at all either. I majored in computer graphics and English, and I do small business IT consulting. I made the mistake of telling one of my clients my college background. Now she calls me \"the artist.\"","I wouldn’t feel worried about starting at 21, I started about the same age when I started my degree. I found internships to be a great way to get a foot in the door, maybe ask your advisor about any cybersecurity internship opportunities."],"points":153},{"text":["How do you guys handle smishing campaigns?","Security awareness training for staff","Ask them to forward the text to 7726https://consumer.ftc.gov/articles/how-recognize-and-report-spam-text-messages","you can use a free url scanner like checkphish","If more than 5 users report receiving the same kind of smishing messages you can may be send a security advisory or a notification to the users mentioning about an ongoing campaign (include small details about the message) to increase vigilance.In your case having low employee count plays in your favour.","Mobile device management with BYOD capability","Blocking the numbers is useless. They are random numbers pulled from spreadsheets. But make sure everyone is marking the numbers as SPAM.There is SPAM protection on Android phones too. But that's not a viable way to stop.Check if these inbound messages are using the RCS Encryption protocol. Maybe you can block by the protocol or origin country used. The older SMS protocol is soon to be depreciated.https://fortune.com/2019/12/16/androids-what-is-rcs-messaging/This is the phone carriers responsibility. But they haven't done shit to protect customers.EDIT: sorry didn't mean to reply to the comment.","You can keep yourself safe by doing nothing at all or block the sender.","Get everyone off of SIM based MFA for one thing (looking at you, Apple). Include notification storming in your targeted attacks training, and perform your own smishing campaigns like phishing, to raise awareness. Note; some jurisdictions are in the process of changing how insecure SS7 is, and the law is evolving, so take legal advice on smishing campaigns you want to run"],"points":37},{"text":["Is CVA from mile2 any good?","I'd recommend checking out https://www.sans.org/cyber-security-courses/build-lead-vulnerability-management-programs/mile2 although having been around a while, is still almost unheard of in private sector. The question might be, why didnt you go for E Council or GIAC, etc. In practice, although the materials when I last reviewed them with a team member some few years back seemed not very different to anything else, the presentation was not great at that time."],"points":1},{"text":["AI Security Presentation help","I do this presentation a lot:ElevenLabs to clone someone's voiceChatWithGPT to interact with ChatGPT using the cloned voice (https://github.com/cogentapps/chat-with-gpt)I edit the ChatGPT system message with facts relevant to the person who's voice I cloned, and even provide it with a fake bank account number, etc.I've been working on incorporating a live face-changer app, but the lipsyncing isn't great.","Check brightalk. You can find several presentations regarding AI and security. You can find more than you estimated. And you'll see that current AI tools help offenders more than defenders.","The main threats are still:higher quality soceng at scalefuzzing/static code analysisunique malware creation (though it isn't good yet)Not a lot of new or novel threats are emerging just yet.I also tend to mention things like WormGPT: https://flowgpt.com/p/wormgpt-6","Don't forget to add that it's been in use for years for pattern recognition and behavioral analytics","My engineering team uses ML jobs/detection rules (in our SIEM) to identify anomalous activity..... (i.e Impossible Travel, Rare User Authentications, etc.)"],"points":11},{"text":["Password sharing","Take a look into a password management tool that offers password sharing. (See 1password I think supports it?). You can have IT centrally manage it and add/revoke teachers. You can even set it up where teachers can’t even see the passwords, only have it autofilled for them.Edit: literally says “tired of sharing sticky notes?” On their page for corporate solutions.https://1password.com/features/secure-password-sharing/"],"points":1},{"text":["ShellFeck: A BrainF*ck Inspired Shell Obfuscation Proof-of-Concept"],"points":0},{"text":["Is SANS GCIH worth it if I already have the CISM/been in the field for 5+ years?","If you've already taken the training, then yes get the cert.","If your org will value it for future promotions, or if you think you might be job hunting again someday in the future, it's probably worth. The most expensive part is already paid for, after all","GCIH reads very well for relevant roles, the exam is $900.","Yes get the exam attempt and add it to your resume, definitely a very in demand certification.","If you got the training, I'd do it.Also, if you have DoD 8570 requirements to hit the CISM doesn't apply to all the same roles GCIH does.","You've done all The work doing the training, so do the certification.","Certification has value. However, consider maintenance /renewal fee as well. The certification maintenance fee is a non-refundable $479 payment, due once every four years at the time of registration","TAKE THE EXAM!If your company paid for the course, why not take the examHow is this even a question?","It's so easy, just take the test. I don't add weight to it, but it doesn't hurt. Source: have one myself","No, not out of pocket. SANS + Cert programs can cost 8k per class and test. That's 80 percent of a Uni of Texas and Georgia Tech masters degree. Get a masters degree instead and never worry about certs every again."],"points":41},{"text":["Advice for writing secure code for a non-cybersecurity engineer/student?","OWASP’s secure programming guide would be a solid place to starthttps://owasp.org/www-project-secure-coding-practices-quick-reference-guide/stable-en/01-introduction/05-introduction.html","Basics of CyberSecurity come down to reviewing settings, options; Cut out the fat.Do you need it hosted on the WWW or can it be hosted locally?You're using Python... How many libraries / modules and what's not used / not needed? Better yet, could you get by with Django or Deno?","Try Snyk Code. It’s free for individuals and has an IDE plugin for Pycharm/VSCode and runs in a few seconds for small projects. You can also check out some free Secure Coding lessons in Snyk Learn.","Get trained.CSC410 from CertNexus is decent. Linux Foundation also have a secure development course. Both make a good, structured start to your learning."],"points":13},{"text":["Server network security management software?","Sounds like Cisco Tetration, or whatever they're calling it."],"points":0},{"text":["How do you feel about the future of Cybersecurity?","Saturation sharply falls off as you move up the experience demand curve. Two things can be true at once. Anecdotally:  Everybody and their niece was telling me they were thinking about getting into cybersecurity just a few years ago. As Ive advanced Im finding less and less peers that are even in my age bracket. I suspect theres an inverted bell curve representing the quantity of qualified candidates at certain skill levels. I meet “old guard” type individuals frequently. The kind of guys who grew up hacking/phishing etc in the wild west 90s and early 2Ks who went legit and are now leaders or wizard technicians. The amount of mid career people like young security architects or deeply technical skilled labor seem to be much more rare. And then there is a massive saturation of entry level candidates. Recent grads, L1 - L2 SOC analysts, people who fantasize about going from retail to pentester, bootcampers, etc. all gold rushers.There’s massive saturation up front, then a level of attrition that gets higher as you progress. I tell people seeking advice or expressing interest that this isnt “easy money” or a fast way to a high salary. Theres no free lunch. But if you stick with it, the reward IS there.","A notable challenge is that some businesses don't prioritize security, affecting both hiring and compensation in the field.This is and will always remain the biggest hurdles.We have to look at it from the business owner/CEO perspective, does cybersecurity improve the profit margins, and shareholder value?No, not directly. Because if we do our jobs properly nothing happens and they feel like they're wasting their money. We're a 'cost center' in the budget. So cost centers are always underfunded and under prioritized.That is until the day, you get breached or ransomed. A lot of these folks don't see the value in dropping a couple hundred grand on hardware, software and services, plus personnel to prevent that until they can't process invoices and get paid.Even then they don't get it.What ever org needs is an executive level evangelist to promote how cybersecurity actually improves the bottom line, as well as the value of the organization.I work in the M&A world and every single due diligence I go through there's a section on cyber where they pick apart the posture of the orgs and the history and these things have a direct correlation as to the value of the org being acquired.","Been in the game for over 25 years. There will always be work for talented people. The people that get into it just for the paycheque are the ones who tend to get disgruntled or frustrated.I remember the IT crunches in the late 90s. Talented people generally didn't stay unemployed for too long, it was the quick-buck-people that left the field.We get people applying who have installed Kali in a VM and think that's their meal ticket. They're in for a rude awakening.","It's not saturated. In my opinion, the qualified talent isn't there yet.Many businesses still don't care about cyber other than the bare minimum. Lots of education to do.Cyber leaders need to speak the language of risk and business alignment, not just shiny whiz-bang new tool with AI/ML. Justify the expense.Cyber governance is woe-fully lacking in nearly any/all orgs that I work with. Cyber and IT governance is a huge overlap.Security, unless you're in AWS or a service provider, doesn't move the needle like gaining customers and improving margin. It's a margin drag -- Security needs to show value and operate as lean as they can be while being effective. Speaking that language is critical.SOURCE: Cybersecurity consultant.","cybersecurity will continue to be a growing, in demand field as long as cybersecurity regulation continues to expand.I don't see regulation slowing down any time soon, the EU is a harbinger of things to come.","This is like asking if they are still going to have door locks in the next decade.","Up until last year, I would have said that Cybersecurity jobs were only worth the work if the organization was serious about cybersecurity. Otherwise, you were a scapegoat when a breach happened. Organizations were not serious and did not spend the money to build or maintain a cybersecurity posture that was worth a crap. The fact that news reporting cared if a company got hacked or not did not help.Now, I think that is changing. I think Cybersecurity is getting more and more serious view from a national and global view. More and more government organizations are creating privacy and reporting laws. The United States Federal Government has changed it's view (Executive Order on Privacy and SEC requirement for reporting breaches). If the United States were to pass something like the EU's GDPR, you will see many new cybersecurity positions be opened and a lot more money spent in the cybersecurity realm.","It's saturated in people who want to work in cyber security. Dry as bone in people with the capability to work in cyber security","I think IT in general has a massive amount of saturation\\abundance of people at the bottom, and this is also true for cybersecurity. I do think though that both IT and cybersecurity in general will be in great demand, and there is gonna be no end to the work load. In terms of right now, I think we are just seeing the contraction that we saw in 2001 (I wasn't in the field back then, heck I was in grade school) but I think that is what is occurring right now. For the future in terms of IT in general it will be booming, as I have noticed that new users (meaning younger) aren't as skilled with computers of when I was their age (cause technology has gotten easier to use), and cybersecurity will always be in demand cause there will always be criminals and no true endgame to this field.","\"the reality is that fewer individuals successfully obtained certifications, stuck with it, and secured cybersecurity positions.\"Is it more difficult than becoming a competent full stack software dev?","Ive seen a few things, there’s always jobs, but not always jobs people want to do. I graduated during the summer of 2020 and the lockdowns and I took the first job I could get, which was nights weekends in a SOC. When I graduated, you were required to take two levels of networking classes(CCNA, and CCNP Security). Now the most recent graduates from my university didn’t take any networking classes, and were told you don’t need to get any certifications, except for the CEH, and go directly to become an ethical hacker. I understand from the universities perspective that this is more flashy and can get more people into the program, but it feels like I get rich quick scheme. None of these kids come out of college with any practical knowledge and all of them are told to expect to be paid north of 100k for being a pentester. There arnt near as many pentester jobs, and those that do exist don’t want people who have a CEH.","I think it’s hard for those with no experience to start working and lots of people want to get into the industry! However, I don’t think that necessarily means it’s saturated because most employers would love to grow their SoCs and security operations. In my current job and in the places I’ve interviewed with there are definitely a need for competent and experienced security engineers!I’m very optimistic about the future of cyber security because many companies are getting popped all the time and there will always be a need for good, security-minded engineers.","The next stage of war will be cyber attacking critical infrastructure. We haven't even scratched the surface.","How do you feel about the future of Cybersecurity?Hard to tell, things change so quicklyIs the cybersecurity field genuinely oversaturated?In certain areas, yes. In others, no. It depends what part of the field. Definitely oversaturated for the early career roles. Mid level seems to be undersaturated. Senior level seems to be a little oversaturated as well.While there was a trend of quick six-figure promises in IT, the reality is that fewer individuals successfully obtained certifications, stuck with it, and secured cybersecurity positions.Who sold you that? Was is the cert companies, bootcamps, and others who seem to benefit from selling you this vision? I've been in the field for ~4 years, haven't broken 6 digits yet 🥲","there's no way top cyber talent is over saturated. threats are everyday. (i'm not in technical cyber, in the grc side) and i recognize the baseline talent you need to be in top cyber. It's essentially computer science and as far as electrical engineering, and more.","Entry level roles are over saturated(which you can see by the hundreds approaching on thousands of applicants to those roles) but the second you start narrowing down to mid/senior level with a specific niche, most of those positions have under a hundred applicants.","I feel very good about the future of information security! I am hopeful that soon the people who entered the field for a paycheck without having any passion for the mission will depart towards whatever new shiny thing they can find, like AI or somesuch. And I am hopeful that we can continue to marginalize the whiners who don't understand that the real world involves tradeoffs and make simplistic rants about business leaders not caring about security or how security would be solved if only everyone listened to their shallow and impractical ideas.Then the rest of us can focus on the real work of making companies and organizations safer in the face of significantly increasing threats. There will continue to be a good payday and an intellectually interesting job available for folks willing to contribute to that.","This is asked every day. Stop asking it. It's getting annoying now.","Saturated? For the best part of a decade theres been a skills shortage (well, imo a training shortage). I've not been as close to that recently but I know in the UK at least hiring for some roles has been a challenge.Not prioritising security isn't a new problem either, you'll find many firms don't do so until they've been hit. (See NHS UK, Talk Talk and a plethora of other businesses that took a hit, then suddenly started hiring Security Staff). The biggest issue then, and is now, is Security is a cost centre & a cost prevention centre. We don't generate profit, we prevent loss. So trying to demonstrate that to those with the purse strings is invaluable, if you've got directors/heads of that can't articulate that effectively youre gonna have a bad time driving security as a focus in that business.As for certs, I dunno, I've worked in IT for 20 years, 10 of that in Security and I hold a grand old total of fuck all certifications. I know they are a requirement for some roles (Such as Government ones) but things like CISSP, CEH, etc have lost their value over the years with the exception of maybe something like OSCP. At least in the UK and in my sphere anyway.Quick google of 'cybersecurity skills shortage' and there are a plethora of articles, including \"4 million shortfall\" which is pretty significant. https://www.csoonline.com/article/657598/cybersecurity-workforce-shortage-reaches-4-million-despite-significant-recruitment-drive.html","From current view of cybersecurity, it seems that the number of job positions are increasingly available since many professionals are quitting the industry day-to-day from stress issues. The workload will be very heavy since there will be many more technologies to be studied for ensuring security of information. Still cybersecurity will be in demand regardless of the downsides of being in cybersecurity.","Just like many fields, cybersecurity will ebb and flow when it comes to \"saturation.\" Future-forward aspects of this field will relate to OT and AI. Security concerns with OT are HOT right now; especially within manufacturing and utilities. Their goal is to keep operations safely uninterrupted, and the challenges abound there. Utilities, for example, need expertise with legacy systems, as well as digital transformation to update networks. Adversaries are constantly hammering away at critical infrastructure. AI is causing its own plethora of security issues, and it's moving at blinding speeds. \"Cyber,\" as a broad field, is not yet saturated, and the more targeted you are in your own certifications and career searches, the more valuable you are to an organization.","My hope is the rush to AI will create more jobs and help the entry level folks in the door.AI will have its own risk, infrastructure, maybe even regulating bodies to dictate how it and the data it uses should be secured.Where I live there is a TON so senior pentesting jobs with no one to fill them so the skill gap is still present but only in the experienced side of the coin.","Wanting to get into cybersecurity and actually acquiring the knowledge and skills to be able to do so are two very different things. Many people are sold a pipe dream of “if you just get these certs you’ll be on the gravy train of working remotely and making six figure income without having to do a whole lot of actual work.”I’ve been working and studying for career change over the last 2+ years. Preparing for GPEN certification over the next couple of months and despite exponential increase of knowledge and skills that I have gained I realize that I have only began to scratch the surface and see myself continuously learning and gaining new knowledge and skills until I decide to retire.The future of cybersecurity means that many who are in cybersecurity need to continue to learn and adapt and that all these “cybersecurity training” and bootcamps scams will cease to exist in 10 years once people realize you can’t learn cybersecurity in 6 to 12 months enough to actually land a remote job that pays 6 figures.","I didn’t make six figures until my first cyber security role about 9 years in. And even then I’d argue I got that much because they saw value in my development and DevOps background. It was less than DevOps positions would’ve paid (I was at a non profit previously) but with no on call outside of emergencies","Really excited for quantum computing to destroy everything","I think a bunch of people in tech are getting layed off, that know a lot of deep dark secrets.There was an article here what two days ago about security guys turning to crime.Point - things don't get better because you let a bunch of people go. There will be a consequence. The need for security will only increase.","It’s filled to the brim with people without experience wanting jobs that require a lot of experience.","Microsoft source code vulnerabilities exposed by nation states are exploited in the largest 3rd party risk management nightmare ever, disabling western economies and governments.","Q: Is the cybersecurity field genuinely oversaturated? A: Absolutely! The entry-level positions tend to be quite saturated, but after gaining around 5-6 years of experience, you'll find the competition starts to thin out significantly. Just my $0.02.","I have to break it down to help show where it’s saturated.Credentialed no experience Experience in tech, no credentials. Experienced in tech and security Credentialed experience in tech Credentialed experienced in tech and securityExperience in tech mean you were like a dev, IT sysadmin, or something in those veins. Security experience is information security experience.The over saturation is in credentialed no experience. Those folks need to go work as help desk, sys admins, entry level devs, or QA. Generally anything entry level where you get exposure to standards and tech.The reason is school and boot camps are being pushed hard. Generating folks with high expectations and no experience.I’d say three years ago those folks got hired asap because most people didn’t have proper credentials pre pandemic. So getting a cissp was a big thing even with folks with experience.Now that things are cooling off and people are being laid off, where there is an opening- organizations are looking for certain things to further qualify candidates. So no, it’s not fully over saturated. It’s just over saturated with folks with no experience.","Was a contractor at BT and slowly becoming deskilled, could not get a gig with any of the big names.Took a huge paycut to work for a tiny pentesting company to get back in the game (80ish > 26k). Got back up to speed.Never really been one for certs, just relied on experience, but did put the graft in to get GXPN.Now director of a small cyber sec startup outfit. Earnings are tiny again, all my savings gone. Slowly starting to make a bit of headway. Hopefully will turn out ok!","Maybe it’s time for us to switch to cyber offensive.(I’m kidding before anyone loses it)","Just a quick reminder to everyone reading this.You absolutely do not need a degree to work in this field. Do not let others, recruiters, and or HR people gatekeep this field.I do not have a degree and I was able to get a job as a Security Analyst, went into Incident Response, and now have a cushy high paying Security Engineering job.It is definitely not an easy gold rush field where you come in and get a shit ton of money and end up in a cushy job fast. You will have to give it 110%, earn certs and fill out a whole lot of applications in an insane job market, but it is possible.As others say a degree can help or maybe put you up higher in the hiring pool but it comes down to your skillset, not JUST getting and or having a degree.","Job security is better than a nun's","Don’t focus on cyber security. Focus on digital forensics as a whole then cyber. Easier to get into a firm or company when you can do both. Most forensic examiners can do both cyber and deadbox. Ask a cyber guy to do forensics on a cell phone they will probably forget a chain of custody and all the very basic things. That will get them hemmed up in a litigation case.","No. The answer to your \"Is the cybersecurity field genuinely oversaturated\" is NO.Too many people applying for a job is not a thing I care about. Too many \"GOOD-FITS\" applying for a job is something I'd care about and call oversaturation. There are FAR too many not good fits. People who just don't know enough, have enough experience, or just don't fit well enough into the current team to warrant further pursuit.It's exactly like dating. It fucking sucks.","I was back in school (nearly a decade ago) and studying again because I enjoy cybersecurity. My criminal record made finding a job I felt was worth the stress and the payment nearly impossible. I had a bunch of life events come up and then moved and didn’t finish school for the umpteenth time. I personally have always been super into infosec since I was a kid. I see it all the time the people that are there for the money never stay they burn out and grow to hate it. The people that actually have a passion and a love for it have a hard time because of stupid barriers to entry. I was considering finishing my degree but honestly it looks more profitable to just become a cyber criminal and my freedom is more important to me than money. So for now I’ll stick to farming and taking it easy as much as I’d love to work in the cybersecurity field it seems to be misunderstood and always has been. Companies don’t understand the importance until everyone learns that OpSec is their job too these large corporations will always be playing catch up.","Lol I’m literally sitting here setting up a VM to do an active directory lab trying to learn and remain hopeful someone will take a chance on a newbie. One of the things that drew me to IT from education was that fact that learning new things and developing new skills can put you in a position to earn more money. As a teacher I would research and research best practice and implement what I learned in the classroom, and get good results but my salary has barely went up the last 10 years. I think two things can be true at once. People can want to get into the field for the earning potential primarily and have a desire/will to learn. I’m a year into studying 4-8 hours a day while teaching full time with a wife and kids and actually loving the journey (haven’t started applying yet). Yet if there was no earning potential I would have definitely chose something different as I followed pure passion for almost 15 years in education and see that is not always the way. It’s funny what I hear from a lot of the cyber veterans is “don’t do this if money is the driving factor” is what I would hear in education for so long and now you have a bunch of burnt out teachers waiting on a pay day that will never come no matter how well you master your job. I think it’s always a balance between doing it for the money and the love of the craft, in education I see a lot of teachers who have degrees in art or music and they can’t really do anything else but teach and they regret it. With that being said I do understand that in order for me to get a job I have to learn and out in time because I’m competing with the 20 year old kid who has spent 10 hours a day building computers since he was 5 years old Lol. So I don’t take days off of studying but it’s not just the love of learning that driving it’s definitely the thought that eventually my hard work will pay off.","Personally, I believe that while there is a growing demand for professionals in this field due to the increase in cyber threats, there are also challenges such as competition in the job market and the need to keep up to date with the latest security technologies and techniques. I think the key is to keep constantly updated.","I think AI will play a critical role as humans can't do it all at the same time and mid size companies doent have the budget","I’m pretty fed up with it. I moved onto non-cyber pastures after 3 years of education and months and months trying to get into the industry at any level higher than entry level. I even did an internships where I got certified in Fortinet and became very familiar with Fortigate. Did anyone give a shit? No.Screw my education. Screw my 7 years of IT experience. Screw my leadership experience. Fuck my Net+, Sec+, and CASP+ certifications. They don’t want you, and if they do, they want you for 40k a year. Bullshit, all of it. Infuriating.I wasted a lot of money and effort on that degree. And all I got for it was a middle management position paying me too little for the job thanks to my age. And I’m one of the lucky ones.","Won’t artificial intelligent computers be able to brew into systems better than any human can stop them. I see an arms race between AIs hacking and AIs protecting. But serious, will AI have the ability to become the best hacker ever? Will nothing be safe anymore?","My two cents is that if you have skills that are transferable, you'll be useful as long as you're not replaceable by AI.If you can do dev and understand security concepts, you can fit into any number of roles. If you just know web app pen testing, you might find that when security funding gets squeezed, you find it hard to get employment","I've not read the other 91 comments, but generally I feel very optimistic. It's an exciting time to work in cybersecurity.Context: every large organisation has a cyber security security capability (whether it's an individual or a team of 100). The interesting thing about this industry, is that organisations across industries massively vary in maturity. You can work on cutting edge tech, researching the application of LLMs to security defense, or you can work for a massive global organisation that is living in the past and needs to undergo huge transformations - you'll be able to do everything from scratch. There's lots of opportunity and the industry isn't going anywhere.Six figure promises: this really bothers me and has gotten out of hand. But, that's not to say it's not attainable if you focus on skills development, getting the right experience, you'll certainly be on the path (location dependent). I wrote an in depth article on this via my newsletter - link in bio.Market conditions: 2023/24 has been really tough for security. Layoffs, budget cuts, hiring freezes etc. I hope we see a reversal towards the end of the year and teams get the resources they need.Skills shortage: there is demand, it's just not for entry level people that need a lot of time and energy to train and get them up to speed. Companies want experienced, battle ready pros that will hit the ground running (catch-22 - if we don't get more people in the space, this shortage isn't going anywhere!)Opportunity: this space is there for the taking. You're absolutely right when you reference different methods - 50% of jobs don't make it to job boards, it's through referrals and recruiters. How do you get these opps? Build an online presence/personal brand around your area of expertise - that's your differentiator in the market place.","I honestly think it’s going to get broader in terms of the types of jobs you can get in the industry. Anything from Law to Policy to Psychology to Traditional positions.Basically the stereotype of the SOC analyst or a Bug Hunter is just the start.","Lots of so-called security experts, but a massive lack of talent and vision.","Bleak. Very very bleak. Everyone wants into Cybersecurity because it sounds sexy and movies and tv shows make it sound all cool and sexy but when you get into people realize what a shitshowingly boring it can be (or should). And then you begin to realize that corporations truly don't care, they put up a good face and say the right things, and do what is mandated. But as soon as you start making changes to protect the organization as soon as you start trying to spend the money that needs to be spent, you find out how \"important\" cybersecurity really is.","Its a field like any other IT. Some companies have more need for dev than server and networking, some have more need for cybersecurity and sales.","If it’s so saturated why do they keep leaking our shit!","I’m exhausted. So I’m moving on. But I’ve been in the game a while. Moving to engineering. Yeah, I know, no peace there either, but I have a thick skin during reasonable business hours.","I feel really good about it. I'm so fortunate I'm in at 23. I feel good about my future.","The entry / intermediate level roles are completely saturated.There is demand for senior roles.","Bleak","I hope it has a future, because I've landed in it by accident and want to stay.","A notable challenge is that some businesses don't prioritize security, affecting both hiring and compensation in the field.This is only a problem for mediocre and bad talent. Good talent in this field is paid exceptionally well. New grad straight out of undergrad are paid more than the average doctor. I make more than the vast majority of doctors and I work from anywhere, including out of the country when I want to. All with a BS and no half million dollar medical school debt.The short answer is if you want good comp you have to be good talent, that's about it.","I think there are lots of CS professionals looking for jobs atm, and while there are plenty of companies that need them, hardly any of them realize this yet."],"points":703},{"text":["New OpenSecurityTraining2 class: \"Trusted Computing 1101: Introductory Trusted Platform Module (TPM) usage\" by Dimi Tomov of TPM.dev (~8 hours)","Topics include:* Use of TPM for digital signing and sealing secrets* Use of TPM for HMAC and hashing* Use of TPM as a secure storage* How to enable the TPM's protection against physical-bus Machine-in-the-middle (MITM) attacks* Protecting external data using a TPM* Understanding TPM internals and capabilitiesThis class takes students 8h21m on average to complete.","sweet. love you and your team's work :)"],"points":11},{"text":["cyber Security architecture","There is no such correct answer. There is only what is most appropriate for the specific combination of your goals, threat model and resources.","Wazuh. /thread","Listen dude, I’m being nice. If you’ve never had a teacher treat you like I’m treating you then your education is fucked.Put some effort into it, and I will be your best resource I promise. So far you put precisely 10 minutes of effort into this.Take the time. Write out the context of why you want this is it for a school project? That’s fine! Do you want to start a business? That’s awesome! But write it out. Take one hour and write it out.See what you get.","Ten Seconds in Gemini.google.comPrompt: \"I'm currently focusing on cybersecurity solutions utilizing open-source tools. I'm seeking recommendations for the most effective tools in several areas, including SIEM, SOAR, IDS/IPS, incident management systems, and security monitoring. Could you please suggest your preferred tools in these categories and explain why you consider them to be the best solution? Your insights would be greatly appreciated.\"Answer:It's important to remember there's no single \"best\" tool for every situation. However, here are some highly regarded open-source options in each category you mentioned, along with their strengths:SIEM (Security Information and Event Management):Wazuh: This free and open-source XDR (Extended Detection and Response) platform goes beyond traditional SIEM. It offers log collection, analysis, threat detection, incident response, and vulnerability management, making it a powerful all-in-one solution for security teams [1].SOAR (Security Orchestration, Automation, and Response):Open XDR: While not solely focused on SOAR functionalities, Open XDR provides a strong foundation for security automation. It allows you to build custom playbooks to automate incident response workflows, improving efficiency [2].IDS/IPS (Intrusion Detection/Prevention System):Suricata: This popular IDS/IPS offers a powerful engine for real-time network traffic analysis. It's known for its flexibility, extensive rule sets, and ability to integrate with other security tools [3].Incident Management Systems:OpenTicket: This open-source ticketing system is specifically designed for IT security incident management. It streamlines collaboration, tracks incidents, and offers reporting functionalities [4].Security Monitoring:Security Onion: This Linux distribution combines multiple open-source security tools like Snort (IDS), Suricata, and Wireshark (packet analyzer) into a pre-configured environment for comprehensive security monitoring [5].These are just a few examples, and the best choice for you will depend on your specific needs and environment. Here are some additional resources to help you decide:Free Cybersecurity Services & Tools: This CISA resource page provides a curated list of free and open-source cybersecurity tools categorized by function [6]. https://www.cisa.gov/resources-tools/resources/free-cybersecurity-services-and-tools25 Free and Open Source Cybersecurity Tools for Businesses: This article offers a broader range of open-source tools beyond the categories you mentioned [7]. https://heimdalsecurity.com/blog/25-free-open-source-cybersecurity-tools-for-businesses/Remember, with open-source tools, you'll often need to invest more time in setup and configuration compared to commercial solutions. However, the benefits of cost-effectiveness, customization, and a vibrant community can be significant.Could you please suggest your preferred tools in these categories and explain why you consider them to be the best solution? Your insights would be greatly appreciated.","Nope. Couldn’t give less of a shit about you. You simply present a demand, without context, without reason, just “tell me about all the time you’ve put into open source projects so I don’t have to bother! And I’m not going to give you anything either!”Try telling me you’re a student and looking to have other people do research for you so you can be lazy.Go try a half dozen projects. And if you can’t find any, try the magic go-ogle. Tell us why you like this one and not that one. Tell us what you need to do! Tell us what it’s for!Put some fucking effort in. Ok?","Wazuh, UTM Stack, OSSIM (alienvault)! but as Mangy said, no such correct answer.","ClamAV for literally everything!!!! Just full stop right there and don’t worry about the rest of that junk. If you can’t do research you aren’t going to be able to configure and monitor any of that junk anyways. Why hire analysts when you can pocket that cash in a bonus? I recommend you open all ports on your firewall too because then the money flows better. /s","God this sub is so toxic and hostile to a guy just asking for your personal recommendations/opinions."],"points":75},{"text":["Security Bite: Hackers breach CISA, forcing the agency to take some systems offline","Two CISA systems breachedA CISA spokesperson confirmed the breach in a statement, saying hackers gained access by exploiting vulnerabilities in internal Ivanti tools. The Utah-based firm provides IT security and systems management software to some 40,000 customers, from large organizations to government agencies worldwide, per its website.“The impact was limited to two systems, which we immediately took offline,” CISA stated. “We continue to upgrade and modernize our systems, and there is no operational impact at this time.” The agency didn’t specify whether data had been accessed or stolen.The Record, which first reported on the incident, cited a source with knowledge of the situation as saying the hackers compromised two systems that were part of the Infrastructure Protection (IP) Gateway, which houses critical data and tools used to assess critical U.S. infrastructure, and the Chemical Security Assessment Tool (CSAT). The latter houses some of the United States’ most sensitive industrial information, including which chemical facilities are designated high-risk, Site Security Plans, and Security Vulnerability Assessments.","Everybody gets got.","Show me an org running Ivanti that didn't get a bit of heat over those CVEs...","If only CISA had known that a vulnerability existed in Ivanti.","Well better CISA than our agency","https://xkcd.com/932/","The Infrastructure Protection (IP) Gateway comprised of two systems, and it appears that a firewall cluster served as the point of entry.","Be careful commenting about this, the CIS@ Simps are strong.","Just came here to comment: hahaha hahaha US cybersecurity is terrible, please do something."],"points":221}]