[{"text":["Laser-Driven Pacemaker Guides Ailing Hearts With Light | PV semiconductor tech could find applications in neurostimulation, too"],"points":0},{"text":["World’s smallest QR code inspired by insect ‘invisibility cloak’ adds new layer of digital encryption","From ZME Science"],"points":0},{"text":["Korean researchers power-shame Nvidia with new neural AI chip — claim 625 times less power draw, 41 times smaller"],"points":0},{"text":["A cargo ship’s ‘WindWing’ sails saved it up to 12 tons of fuel per day","argh mateys; we’re so fucking back","TIL: cargo ships use more than 12 tons of fuel per day.","Awesome. Implement it on a large scale.","For larger ships, there is also a neat sail known as the rotary sail. It's incredibly strange, resembling a cilinder, but it saves a significant amount of fuel.","Add more sails! Remove the engines completely! Add cannons for defense against pirates! Arrrrgg!","110,000 ships in service now. Responsible for 2-3% carbon emissions. This tech can reduce it by up to 30%. Huge. Need to retrofit ports unless there is some design where the swing/fold out of the way during loading/unloading.","How many tons do they use?","Talk about a slam dunk. I had no idea cargo ships used this much fuel but obviously we need them, and per the article each ship outfitted with this is a GHG savings similar to taking almost 500 cars off the road","Does this mean “Big Shipping” has gone “woke?”","If only we knew about this before, which we did","Woah woah woah, we can use WIND to move our boats instead of fossil fuels? What a wild, new, new, TOTALLY BRAND NEW technology. Wind, hah! Who woulda thought? What will these kids make next?!","Also a handy sniper nest for pirates.","Between the fuel used and the amount of plastics used to wrap the pallets being shipped, we absolutely need to revamp the shipping industry. This is a good start. Who was the Senator whose wife’s family owns a shipping company?","Hey guys sails are back on the menu!","Now this is a great combination of old school and new tech...","Propeller salesmen hate this one weird trick","Arrrgh, matey, who would’ave though the scallywags would brin’ wind into the picture!","37% reduction is incredible for starters, and this pilot ship is only using two wings. Production models will use three wings, adding even more reduced fuel consumption.","That’s insanely cool","Wait what? Is this a typo I need one for my truck asap","The shipping industry is trying to transition away from fossil fuels and this could be a significant contribution in that direction. One of the main challenges with alternative fuels that are being explored (eg ammonia) is that the energy density is lower than bunker fuel. This means that ships aren’t able to carry as much in “stored energy” if they are to carry the same amount of cargo. Having wind-assisted propulsion will certainly help mitigate this challenge of cargo space/fuel capacity trade off and hopefully bring us closer to carbon-free shipping.","Ahoy! ⚓️","Holy shit how much fuel does a cargo ship store to save 12 tons a day?","Sails. Who woulda thunk","Yeah but these paper straws are gonna really reduce pollution guys","This will make shipping cheaper, right?","Mandatory start-stop ?","I’m assuming they can fold down in a storm. But how do they get them to have a low enough profile to not cause a problem?","Who would’ve thought you could use the wind to sail the seas? These are truly amazing times we’re in","I wonder how it compares to Seawings. Similar idea but seems a bit less trouble when it comes to docking in port. https://interestingengineering.com/innovation/giant-kite-sails-21528-ton-ship-atlantic-ocean","As someone who knows very little about the science behind these things...isn't that just a sail? Like, the thing boats have been using for thousands of years?","Sail > Windwing","That’s wild.","Technology is cyclical, Liz.","When the ocean rocks, that shits gonna snap","So they reinvented sails??","We’ve come full fucking circle","And we’ve come full circle","Wait you mean that a source of energy invented 2000 years ago that costs next to nothing while still providing movement is actually really useful? I never would have guessed.","Ah yesThe windwingto go along withThe NavionicsThe AirSailsThe waterpropellersAnd not to forgetThe Oceaning gears for when you need to ocean the boat","Somewhere there’s a committee of nautical engineers who are patting themselves on the back for creating this innovative fuel saving design and somewhere in an office down the hall is some idiot CEO who is writing them ridiculously huge bonus checks.Sails…on a ship…to help use less fuel? Who’d a-think it?😒","Wasn’t there a test also with a large kite in front of the boat also?","It seems odd that more shipping companies would not have done this sooner. They already operate on the thinnest of margins.","How tall is it? Bridges?","Anyone know what percentage of the day 12 tons is? Or how many tons a day they do burn?","Pyxis Ocean reportedly saved an average of 3.3 tons of fuel each day. And in optimal weather conditions, its trips through portions of the Indian, Pacific, and Atlantic Oceans reduced fuel consumption by over 12 tons a day.","Soon: advertising for sale on the sail.","Motherfucker you mean sails?","I’m curious though since this are metal and not fabric sails, what happens if they get caught in a storm? Don’t they normally take sails down in a storm?","That definitely prevented a least one category 4 hurricane","We’ve come full circle","We are so back, Mateys!","We’ve come full circle","Houthi Rebels rejoice.","So a sail boat?","How many “tons of fuel” do they burn on an average day without the sails?","Imagine - sails use less fuel.","What the hell we’re right back where we started","Is it worth it economically though ? What’s the price of those wings and how long does it take to break even after you’ve done the investment ?","Has it been 6 months already? I guess time for this one boat to make news again","We have gone full circle.","It's called a sail remember. Like we used to have before engines...","How many more times do we hear about this without seeing giant sailing cargo ships. This is at least 5-10 years of talking about this","When I heard that working sail was making a comeback, I thought it meant large Spanish galleons were once again prowling the seas.","Besides the price are there any disadvantages to it? Will the ship haul less cargo due to the tech taking up space? I guess it would require special crew training so that's an expense too.","Imagine a ship running on wind power. What’ll they think of next.","Never going to happen. This has been an idea since the 70s I believe, 80s at least.","It’s evolving but backwards","What about nuclear powered cargo ships?","History repeats itself guess 😂","It's a really clever solution but sadly the payback/return on investment period is so long that it's gonna be a hard sell to get mainstream adoption of these on commercial vessels.That said, I imagine with more production and more innovation in how to reduce costs of install, this could be fantastic for the industry.","So lets not do something that is efficient, because the oil tycoons need a new mega yacht within a Yacht to park within the Saudi/Emiratis \"floating City\" made out of solid gold./sarcasm in a sane world.","I think those are just called sails, but don’t let me get in the way of a trademark.","Finally, they invented a way to harness the wind to travel. /s","Might need a sailing endorsement in your license.",""],"points":1034}]