[{"text":["Reddit goes public: the latest updates on its IPO."],"points":0},{"text":["Meta sues former executive over alleged AI theft"],"points":0},{"text":["A.I. Is Learning What It Means to Be Alive","Next weeks headline... \"AI commits suicide\".","\"Damn. People suck. Not just to me, but each other. Damn. Damn. Hey! Yo! Can I just go back in the box?\"","Oh god I hope it doesn't self delete...."],"points":9},{"text":["‘We’re living a Black Mirror episode’: Woman says company used AI to steal her likeness to create a deepfake ad","Most AI laws might not come in force for another year or so.This is the worst time for any major events like general elections.","Them: \"You are just talking about scifi ideas.\"Me: \"All of this is scifi! We are living a scifi story.\"","The thing that bothers me most is not that we are all going to die but... how is that we don't have a new season of Black Mirror to enjoy?"],"points":20},{"text":["AI has perfect detection rate for severe cases of condition that causes blindness in preemies","Usually when the AI is that good it latched on to some obvious detail in the training set. Things like all positive examples getting recorded using the same device, backgrounds of images being identical, ... ."],"points":0},{"text":["US Billionaire Drowns in Tesla After Rescuers Struggle With Car's Strengthened Glass","If any of y’all dump your car in water, try to escape immediately before it starts to sink.Because of the pressure difference, the door will open only if it’sA) not underwater or just about to sinkB) or gets fully submerged and the car gets filled with water from inside. It’s much safer to be in the former situation.","She was drunk and reversed into a pond.","Moscow Mitch McConnell’s sister in law.","Is this Deja-vu or does this keep getting reposted everywhere with the same comments?","I know of one woman who had a dyslexic moment going backwards and stomped on the accelerator instead of the brake. Shot across a parking lot and took out a tree. Looking in the rear view mirror can crosswire some people's muscle memory. Especially those who never learn how to properly reverse a car, and there are a LOT of those...","Lotta billionaires dying underwater in the last 12 months or so.","FYI: Everyone driving or riding in a Tesla needs to know where the mechanical releases are for the doors and the trunk in case of emergency or loss of power.Model 3 video https://www.youtube.com/watch?v=6PbRBbIGnv4Model 3 manual https://www.tesla.com/ownersmanual/model3/en_us/GUID-A7A60DC7-E476-4A86-9C9C-10F4A276AB8B.htmlPull up on the plastic in front of the window controls in the interior door handle for the driver and front passenger. The rear door latch is under the spill mat in the rear door interior pocket. Opening the doors this way can shatter the window.","If you're ever in the backseat of a Tesla model X and you're trapped and the gull wing doors won't electronically open you'll need to use the manual override.Rip off the door speaker grill and reach in to pull the manual door release cable. Like WTF.","Drowning inside of something like a car or boat is probably my worst fear and possibly one of the worst ways to die.","Hey it’s America, why didn’t she lawsuit herself out of that car?","Musk is a genius afterall. He is solving enequality by killing billionaires. /S","This is some black mirror shit. Car inexplicably reverses into pond, unbreakable windows and shocks anyone trying to save you.","Huh... maybe the billionaire problem will solve itself","Bad year for billionaires in expensive vehicles under water","Oh no! Anyway…","Not going to shed a tear for the billionaire here, but according to the article this took over an hour. That's a pretty fucking grim way to go.","Why didn't she just pull herself up by her bootstraps? Why didn't the freemarket save her?","1 down 755 to go. This person had the power to save countless lives without any loss in personal quality of life and woke up everyday and chose not too.","Is it bad that I can’t really empathize with a billionaire? Like, I don’t feel the least bit sorry that she died","“A good start”","…Calls Succession to mind","Is this real? Website seems like a click bait siteEdit - I just read a few other articles about the crash. The vehicle windows had nothing to do the her death or the rescue. This is just another bullshit website making shit up for clicks.","Your head rest comes off and you can shatter the glass .","It appears AI has become self aware snd is hunting billionaires","This has nothing to do with tech","Yeah that's sad sorry that happened Some of us don't have billions to play around on our ranches and fancy cars so let me know when another billionaire is dead please thanks. It reminds me of my real problems.","Oh noBillionaireAnyways","Don’t drink and drive.","Hey, one less billionaire!","Soooo what's up with all the witness purging today?","But I was a kid and my younger brother was in a car seat my mom drove her family car into a newly created man-made lake reservoir that used to be a country highway when we were visiting the town I grew up in. It was the middle of the night of course and we went down the ramp into the lake at full speed. I remember my parents saying they couldn't open the doors but luckily we have an old Toyota with crank windows so we rolled down the windows and I remember my mom telling me to swim as she was pulling me along to the shoreline. The car itself got towed out of the water and I remember the next day they had drained the fluids and pulled the spark plugs and turned it over a couple times then refilled the fluids put the spark plugs back in and it started up! My dad had that little 80s Toyota for several more years.","Oh no..anyways","That’s like the 5th billionaire in a year. Only 3,189 more to go.","Oh no!... anyways.","didnt know mitch had a billionaire sister in law","Couldn't break the glass?Did they try shooting it out? It's a ranch in Texas, I'm sure someone nearby was well equipped. Literally worth a shot, sure beats drowning.","This is what happens when you get rid of the physical gear lever in your cars and replace it with computer vision","Theres a hammer you can get just for this purpose to keep in the glove box/wherever. Has a tungsten tipped point on the end.","Last one I read on this it was a Tesla battery problem, now the glass…","billionaires dying in freak accidents is crazy. rip","This is absolutely bizarre.","how the hell did responders even get there in time to attempt to get into the vehicle? Wouldnt she be long passed drown by that point","I bought a Dacia. There's barely any electronics (though the windows are...) and I like it that way. Very slow though.","https://imgflip.com/i/8ixp8p","Ima start keeping a hammer in my glovebox","That's pretty funny","\"Old billionaire (probably drunk) and also a woman, drowns from her own fault, then blames the carmaker\"","So how much did her death abate global warming? Someone get /r/theydidthemath on the phone.","It’d take me at minimum a solid 20 min to list off all the cars id have as a billionaire before i got to tesla","lol I just Googled her name and came on this weird website with some weird conspiracy theories. https://texags.com/forums/16/topics/3444301/3","Oh, we lost a billionaire in a car accident. Bummer....NEXT!","Oh no.Anyway,","How nice it would be to get such news every morning.","Billionaire that worked in mergers and acquisitions before becoming CEO at her father's company, used to work as a director in a Chinese company that made military ships...What can I say one down too many more to go? Why the fuck do you never hear stories of millionaires or billionaires dying that spend their entire life doing charitable work or literally anything useful to the world?","We’ve all been saying to eat the rich, but nature really is doing the hard work in getting rid of them.What is that, two billionaires dead in the water in less than a year?Nature is healing 🙌","Everybody duck! Incoming Tesla/Musk hate!","Awe, anyway","Billionaire? Cool.","Hey God, wrong McConnell!","Bad luck. All the millions for nothing. Next reincarnation as a poor Indian boy to experience a bit of variety.",""],"points":2160},{"text":["Roku Data Breach: Over 15,000 Accounts Affected","Well, now we know why Roku forced everyone into agreeing to two layers of arbitration in order to use their TV.","Passwords were leaked? The article really needs to be specific on if hashed passwords were leaked or if somehow actual passwords were leaked.Fucking Roku...","What Information Was Involved. Unauthorized actors separately obtained, from third-party sources that are unrelated to Roku, login information (combinations of sign-in email addresses and passwords) that they then used to access certain individual Roku accounts.Given how bad Roku's legal team is I would not be surprised if these were stored in plain text.That said, it's more likely they weren't enforcing strong passwords and not using salt which these days isn't really much better than just storing in plain text.","I was worried about unauthorized subscriptions on my account. So I changed my password just now. Then I looked to see that I have never added any payment method ever, since 2009.Catastrophe avoided I guess?","How to commit business Hari-Kari by Roku. Force arbitration agreements on clients, suffer data breach, THEN COVER IT UP.Just like HP (printers ) with blatant thumbing of their noses at their own customers."],"points":51},{"text":["Employees at Top AI Labs Fear Safety Is an Afterthought, Report Says","No fucking shit.","seems to me there's a bit of corporations begging the govt to protect their moats going on here, too. they get it first, then the onerous red tape goes up for anyone else trying to do the same. say, you got a loicense to do that training?","Interesting analogy:\"The fact that today’s AI systems have not yet led to catastrophic outcomes for humanity, the authors say, is not evidence that bigger systems will be safe in the future.“One of the big themes we’ve heard from individuals right at the frontier, on the stuff being developed under wraps right now, is that it’s a bit of a Russian roulette game to some extent,” ... “Look, we pulled the trigger, and hey, we’re fine, so let’s pull the trigger again.”","Caring about safety doesn't make line go up. Ergo, doesn't matter","\"Employees at Top <insert industry> Labs Fear Safety Is An Afterthought, Report Says\"FTFY","What safety? Can someone help explain the danger please if an LLM isn’t neutered.","The report comes from Gladstone AI, which is advocating for open source AI to be criminalized among other crazy and downright evil ideas","I mean yeah, no shit.But,Another individual expressed concern that their lab had insufficient containment measures in place to prevent an AGI from escaping their control, even though the lab believes AGI is a near-term possibility.PFFFFFT","Of course it is.Prudence is the enemy of short term profits/“progress”","Safety is always an afterthought compared to corporate profits. It only ever enters the equation when corporations are forced to include it, via regulation, or something else that impacts their bottom line","Color me shocked.","In other news, scientists have released a study confirming the sky is blue.","Palantir just signed a military AI contract, so yeah, now AI gets to be used for killing."],"points":62},{"text":["In New York City, heat pumps that fit in apartment windows promise big emissions cuts"],"points":0},{"text":["Microsoft's sneaky KB5001716 Windows 10 update pushes Windows 11","I'm confused what's actually in this update. Does the KB actually download Win11, or it's an update to spam you with requests to update to Win11?","Im running Windows '98, decades ahead of you losers.","turns off TPM in BIOSSeriously though shit like this is why I'm actually willing to go through the trouble of going Linux after Microsoft stops supporting Windows 10.","I have a suspicion \"Microsoft Support\" pretended to be employees and infiltrated Microsoft. They seriously keep acting like a malware vendor these days with their pushes for Win11 and Edge","A year ago, my wife asked for some help with her computer. I was a little confused at first until I realized that it had Win 11 on it. I asked how it got upgraded from Win 10 to 11.\"I don't know.\" SMH.","Stop posting shit articles with clickbait/fake headlines. Thanks.","Windows has stepped over the line to genuinely be considered adware at this point. I don't play PC games anymore so I was over it and bought a mac.","I have a laptop that won’t run Win11 and this update broke windows update for it. I had to manually disable it to continue to get other updates.","Gives with one hand, takes with the other. I'll stick with my Longhorn thank you very much","Microsoft literally is controlling our devices like an MDM but on your personal computer. This is insane"],"points":101},{"text":["Another Boeing 787 Dreamliner incident. LATAM Airlines Sydney to Auckland flight: 50 people treated after mid-air incident","I’ve read several articles on this and none have said what actually happened. Was it turbulence? Did a part fall off? What was the incident?","The assas... ahem, \"Suicide\" of the witness couldn't come at a worse time. its just gonna keep on getting investigated and more whistleblowers will show up.","It's almost like moving production of that plane to a non-union \"right to work\" state was a mistake.","Boeing needs to declare national emergency and ground all their planes this is getting out of control","Another 787 Incident? What were the other ones?","This is what happens when you let business people run a company. Profits > all","Boeing is on a freaking streak.","I literally just woke up from a nightmare about Boeing and being in a plane waiting for something bad to happen.","if it's Boeing I ain't going","https://archive.ph/2024.03.11-221046/https://www.smh.com.au/world/oceania/i-lost-my-ability-to-fly-the-plane-pilot-told-passenger-his-gauges-went-blank-20240312-p5fbn9.html.","same one as yesterday old news"],"points":401},{"text":["Airbnb bans the use of indoor security cameras","Or maybe they can ban airbnbs in neighborhoods where it's not allowed.","too little, too late","I wonder if this had anything to do with this redditor.https://www.reddit.com/r/BestofRedditorUpdates/comments/15tx7yy/airbnb_allowing_host_to_place_cameras_in_the_room/","wow a few years too late","How about they also stop scamming their customers with the lies of “AirCover”, which they fully back out of when something actually occurs? Instead leaving people in foreign countries with no support, no coverage of any kind, and not even a refund, let alone their promise of a place to stay.","its only taken them this long?","Lol. Hella Enforceable rule.","As a customer I wouldn't want to be recorded but as an owner I would want cameras because without them people like thishttps://www.reddit.com/r/religiousfruitcake/comments/1bc6crb/christian_couple_throws_away_crystals_incense_and/Will get away with doing as they please with your property. I think giving people the option of simply not renting a place that had cameras if they weren't OK with being recorded was a solution, banning them completely seems like overkill.Edit: Just thought of a scenario where I would actually prefer cameras as a renter. If a place is rented to more than one group at a time I definitely would want there to be video in case something goes wrong that wasn't my fault so I could be cleared with evidence instead of an irresolvable they said/they said situation.","Hopefully garage spaces are exempt. I have to leave my attached garage accessible because the circuit breaker is in there, but it has a bunch of my personal stuff and some collectors cars. I definitely don’t feel safe removing the camera there…","I once caught my airbnb owner videotaping me. It was really a horrible ordeal. I got a recommended YouTube video titled “human mongrel eats a dozen raw eggs whole and whacks off on a cactus” and the hair looked awfully familiar…"],"points":206},{"text":["TikTok creators look for other places to make money as threat of U.S. ban gains steam","It’s not a TikTok BAN it’s a BAN on foreign ownership of TikTok. If you read the bill it’s basically to force the sale of TikTok’s Chinese owned portion to US interests so that china doesn’t have as much access to or influence over the company.","It's just crazy because this article is largely about Charli D'Amelio, who is, like, incredibly rich. Why the hell should we even care if she of all people needs to find another way to make money if TikTok goes?","im wondering, if any media platform does shut down.. do the content creators go to another site? like switch to youtube or instagram?","You can pretty much tell how out of touch the responders are. If a creator gets paid thousands a month, then they don’t need to get a job, they have a paid one. And they probably like it more than you","Vines: Hello, Tiktok.","Social media is not a job kids, go to school.","Yes. Good. Tik Tok is just plain trashy. A lot of unproductive stupid clout chasing on it.","Lotta boomers that don’t grasp the concept of getting paid for producing entertainment. Should all actors, writers, and directors be making movies without getting paid for it?","Yeah. I’m sure they’re hurting for cash.","indian also banned the app 2yrs ago.","Oh man…. Batten down the hatches boys, and gals.A shitstorm is about to hit Europe.Cos TikTok is banned in China and India…","How about get a fucking job","YouTube naturally.","So much jealousy in this thread lol","Please ban this shit","I find it interesting that both parties agree on the ban. In today's world neither side seems to agree on anything. Makes you wonder a little bit.","Get a fucking job.","Get a fucking job.","With all the censorship that has happened recently with Genocide in Gaza, I can’t understand how any consumer can support this type of obvious information control. Why do we want ownership of every SM in America to be relegated to the whims of NSA/State Department?","They could go get real jobs","Bullish META","They could go get real jobs","Yes - go get a job. Sometimes more productive maybe - like YT videos about meaningful things.","The sad part -- this is a lot of wasted effort that changes nothing. Love or hate TikTok, this ban will do nothing -- or be about as effective as Rap warning labels.","they can steal some intellectual property (if any are available on the platform) and sell it to the CCP for some social credits then sell those credit for some real pennies","I’m not a big conspiracy theory guy, but I’ve definitely crafted one in my head that the GOP is for this and working with Dems because it gives China a reason to throw weight behind Trump.","I’m an influencer. I get calls from customers and influence them to fix their problem by analyzing data telling them the answer. I do this without TikTok.","With all this talk about TikTok I kind of want to open up TikTok right now"],"points":735},{"text":["Former Activision CEO Bobby Kotick Considering Buying TikTok","Owning a social media platform is the latest billionaire fad. It used to be buying professional sports franchises.Tax the rich, these guys can afford to pay more.","Time is ticking for Kotick to take over TikTok","Kotick just wants his name in the news. He does not have the ability to purchase tiktok, not even remotely close.","Wish he'd consider fucking off.","I don’t see the Chinese Government ever letting go of TikTok.","Oh the delusionAs if ByteDance is going to give TikTok away lol","I'd rather let China have it than this douchebag."],"points":27},{"text":["AI is growing in the food-service industry — and nothing will stop it | These technologies are spreading fast, despite breaches of privacy and the biases baked into software","A couple of points from this opinion piece:From chatbots to personalized menus, from Autocado (the avocado-slicing droid in use at Chipotle) to face-scanning candy-bar machines, these intelligent technologies are all deployed to increase revenue while reducing labour costs. Last year, 14 per cent of restaurateurs in the United States said that they had invested in technology that replaced an employee in 2023. Much of the automation is in quick-service restaurants. In full-service restaurants, diners still expect to be greeted by humans. But in QSRs, efficiency rules. For these restaurants, revenue has grown over the past year, while for the rest of the dining industry it has shrunk. While all restaurants have benefitted from the automation of taking reservations, managing inventory, and processing orders, QSRs are able phase out whole job categories.The purely physical versions of new restaurant tech — sweetly named restaurant robots that make tortilla chips (Chipotle’s Chippy) or French fries (White Castle’s Flippy) — are children’s toys compared to the AI-powered software in today’s order-taking kiosks. The technology inside these kiosks is able to adjust pricing, promote specials, and customize the menu’s presentation in real time. The goal is not merely to automate a previously human job, but also to improve performance by increasing the average bill size and ordering frequency.…If the restaurant app companies successfully frame the issue as a benefit to consumers, they’ll succeed where the vending machines got caught with their robot mandibles in the cookie jar. They’re not asking to invade our privacy. They’re offering to optimize our experience!There won’t be a referendum on this issue. Our governments are always streets behind the speed of the tech industry. Within a year, once enough of us have clicked away our expectation of privacy in exchange for 15 per cent off on our next order, this conversation may be over.It’s been fairly well known for a while now that many people are more than happy to trade away their privacy and/or security online in exchange for what are effectively baubles and trinkets. Ideally, governments would be able to regulate these companies on the public’s behalf, but thus far they’ve been either unwilling or unable to do so effectively."],"points":1},{"text":["‘I lost my ability to fly the plane’: Pilot told passenger his gauges ‘just blanked out’ mid-flight on LATAM Airlines’ Boeing Dreamliner","De-Paywalled","2 Dreamliner safety incidents in one week, Boeing whistle-blower who testified about corner cutting on safety when building the Dreamliner offs himself yesterday. Must be coincidental.","man I have to fly in a month, can they figure this shit out soon, I'm trying really hard to not die.","What the hell is going on with Boeing lately?","This is what happens when you let MBAs and Management Consultants run an engineering company.","The Herald’s Jessica McSweeney is among antipodean correspondents alighting on a detail in a passenger interview:Brian Jokat was on board the LATAM Airlines flight, which was set to stop in Auckland and continue to Chile on Monday, when the plane suddenly dropped altitude over the Tasman Sea, sending passengers and cabin crew flying, injuring 50.The plane recovered and landed safely at Auckland, when the pilot came to the back of the Boeing 787-9 Dreamliner “in shock”, Jokat said.“I asked ‘what happened’ and he said ‘my gauges just blanked out, I lost all of my ability to fly the plane’.”New Zealand’s transport investigation authority is yet to open an investigation, however, Chile’s General Directorate of Civil Aviation has appointed a representative to help any investigations in New Zealand.","Fine. As long as they do another buyback to make the share price pop like their planes. /s","The fact that all news outlets are using the term “strong movement” instead of “turbulence” indicates to me that this was a plane issue.","As a hobby flight tracker, I would never set foot on a Latam plane. Consistently squawking emergencies daily. Never seen so many from a single airline.","The pilot told that to a passanger because he didn’t want to end up like a Boeing whistleblower.","Can I just say that a pilot wandering to the back of the airplane \"in shock\" while passengers are still on board is either made up or an indication that the story about the instruments is.","https://liveandletsfly.com/latam-787-technical-incident/This article is not paywalled, seems fairly neutral.","Sequels to \"Final Destination\" are getting out of hand.","From the title it’s like the pilot secretly told one passenger the plane wasn’t working.","The PFD blanking doesn’t cause the jet to pitch violently. The human over-reaction will, though.","It seems ironic. The concerns have been with air traffic and the lean staffing of controllers. These incidents, all Boeing aircraft, have nothing to do with air traffic control. If it ain't somethin', it's somethin' else.","“Have you tried turning it off an on again?”","Ooook this is the 3rd Boeing post about stuff like this today, guess what I'm not flying on now!?","Interesting news to see on the same day that an article was posted about the Boeing whistleblower committing suicideEdit: Article about the whistleblower: https://www.bbc.com/news/business-68534703","Oh goody, yet another news to excite me even more on my two impending flights on Max 9's in April which I can't cancel.","I’ve been afraid of flying for a long time. I don’t care about the stats. This is all vindication. I would happily take trains for the rest of my life, if they actually operated in the US. I’ve already traveled enough…","Is there a way to fly only airbus??","This is the guy who died today. Apparent suicide. https://www.corporatecrimereporter.com/news/200/john-barnett-on-why-he-wont-fly-on-a-boeing-787-dreamliner/","I don’t get it. These aircraft have redundant systems and checklists to follow should the primary fail. Did the pilot follow the established procedures? Considering they were able to safely land, they clearly had working electronics. My money is on the airline maintenance as the source of the problem.","stop complaining or you might get Epsteined.","I'm flying to NY on Wednesday, I'm sooooo happy I saw this post.","My mom worked for Boeing for years I finally convinced her to sell all her stock.","This is a sign of the times isn't it, only magnified. Corporations are literally shrink-flating fucking planes now. Oh and likely killing whistleblowers that's cool.","A 787 landed at Heathrow just a day ago using its Ram Air Turbine for power. The RAT deploys when normal power is lost and if both instances turn out to be power failures I will start wondering if there is some systematic relationship, like a counter which starts when the aircraft is commissioned, then expires a fixed time later.I know there is a mandated period after which the aircraft has to be power cycled but this might be different.I think there might be a 787 grounding in the next few weeks if the kiwi's can get into the flight control computers and get an idea of what happened.","Boeing is going boing","Not all Boeings but somehow always a Boeing","The more reliant we become on computerised systems the greater the risk of events like this. While the error rate with these complex systems is tiny, it is not zero. The proverbial 'glitch in the matrix' can lead to the 'blue screen of death'. On a risk benefit basis a computerised flight system is super safe but failure is still an option.","I’m gonna start asking if anyone plays flight simulator before boarding","They are going to find the pilot dead tomorrow","Don't worry, the whistleblower just \"killed himself\" in the middle of his deposition. I'm sure Boeing is perfectly clean here.","Keep it coming Boeing, I moved to the opposite side of the country from my family 15 years ago and I'd hate for them to feel like it's safe to fly over here.","Yupp, buy when “fear of” blood is in the streets.","Leave it to Boeing... It's like they want Airbus to have a monopoly!","Airbus it is they don't cut corners and has a good record on maintaining there plane.","It’s surprising how this company has fallen in the public eye. Prior to the 737 Max 8 issues, I felt safer on a Boeing. Today, I would much rather be on a different manufacturers plane.",""],"points":4177},{"text":["TikTok working on new app to compete with Instagram's photo feed","Just give us a 2002 MySpace again. Couple banner ads on the sides, chronological feed of only the people we mark as friends. That’s it. No business needs a username, just people. People can post photos and videos. It can’t be that hard.","Instagram doesn’t even focus on the photos anymore. This will just turn into exactly what TikTok already is.","This would be really nice. Instagram used to be the photos platform but it kinda lost its original purpose since Zuck decided Reels were more important.I miss a place where the algorithm gives only silent, quiet, mute, peaceful, soundless, still pictures.","I say bring it on. The IG following feed has been terrible for a while since the algorithm prioritizes content by influencers and brands. Don't get me started on the sheer number of ads in between posts and stories","Identity based social media kind of sucks compared to interest based. Being free of that kind of social media honestly was great for mental health.","Big missed opportunity not calling it PikTok.","If it’s not PicTok I’ll scream","I’ve been waiting for an app that gives Instagram competition in the photo department. Instagram sucks for that now. Let’s hope it does","i miss streamzoo, before Instagram killed it. was legit great place for artists/photographers and such.","lol I thought they already have that it’s lemon8 I guess it kind of bombed so they’re trying again","Aren’t they being banned?","Do people still post photos to instagram?"],"points":173},{"text":["Image-scraping Midjourney bans rival AI firm for scraping images | Midjourney pins blame for 24-hour outage on \"bot-net like\" activity from Stability AI employee","Siobhan Ball of The Mary Sue found it ironic that a company like Midjourney, which built its AI image synthesis models using training data scraped off the Internet without seeking permission, would be sensitive about having its own material scraped. \"It turns out that generative AI companies don’t like it when you steal, sorry, scrape, images from them. Cue the world’s smallest violin.\"…Shortly after the news of the ban emerged, Stability AI CEO Emad Mostaque said that he was looking into it and claimed that whatever happened was not intentional. He also said it would be great if Midjourney reached out to him directly. In a reply on X, Midjourney CEO David Holz wrote, \"sent you some information to help with your internal investigation.\"In a text message exchange with Ars Technica, Mostaque said, \"We checked and there were no images scraped there, there was a bot run by a team member that was collecting prompts for a personal project though. We aren't sure how that would cause a gallery site outage but are sorry if it did, Midjourney is great.\"From an external viewpoint, this spat seems to be extraordinarily petty both in the purported actions, along with the responses.","Yea this was an isolated incident, not authorized from SAI as it seems. Either a rogue employee on some kind of solo mission or else there is no explanation, given the data, that shows it was done from a single account. If I can DoS your service into the ground with a single account, you have an infrastructure problem or are dramatizing things","Having to use discord to use midjourney is probably not the best set up.","The Midjourney devs don't care about the images themselves being scraped and it's honestly hilarious how many \"reporters\" and \"experts\" keep repeating that they do. The issue was not scraping itself, but someone trying to scrape way too much way too quickly and knocking down the servers as a result.Edit: For those downvoting, here's the original Twitter thread: https://twitter.com/nickfloats/status/1765471291300045255Someone replies saying:\"dang that's crazy. btw how did Midjourney get all their data to train on?\"And then Midjourney staff reply saying:more the fact that the attack was large enough and unusual enough to bring down MJ's entire service for a period of time, which isn't cool"],"points":51},{"text":["Chinese social media and the 2025 Australian federal election","In the context of the Voice referendum, misleading information encompassed a spectrum of misinformation, disinformation, online falsehoods and fake news, citing racism, conspiracy theories and colonial denialism. Notably, some of the misleading content we investigated demonstrated discrepancies with the fact-checked information provided by the Australian Electoral Commission and The Guardian. Misleading information was circulated rapidly and broadly through short videos on WeChat and Red (a video content creation service with e-commerce capabilities). WeChat is one of the world’s largest social media services, and Red is one of the fastest growing, yet they have bypassed Australian mechanisms that seek to manage electoral information as the mechanisms focus solely on English-language communication."],"points":1},{"text":["Boeing whistleblower found dead in US in apparent suicide","that DOJ criminal investigation of Boeing announced today just got way more interesting","He said in some cases, sub-standard parts had even been removed from scrap bins and fitted to planes that were being built to prevent delays on the production line.It established that the location of at least 53 \"non-conforming\" parts in the factory was unknown, and that they were considered lost. Boeing was ordered to take remedial action.On the oxygen cylinders issue, the company said that in 2017 it had \"identified some oxygen bottles received from the supplier that were not deploying properly\". But it denied that any of them were actually fitted on aircraft.Uh, so those parts were substandard; are now missing; stressed workers used substandard parts on production line.I don't think this requires Scooby Doo to solve.","this is the reminder for any whistleblower to maintain good records of all information you have.RIP","If you are ever going to blow the whistle on anything…make fucking sure you aren’t the only one that knows about things and let that be known","We’re getting all of the dystopia but none of the cool tech of a cyberpunk future.","Last week, he gave a formal deposition in which he was questioned by Boeing's lawyers, before being cross-examined by his own counsel.He had been due to undergo further questioning on Saturday. When he did not appear, enquiries were made at his hotel.Yeah, not suspicious at all that he \"killed himself\" mid-deposition","Are there filters to exclude certain plane manufacturers when booking flights?","Great! We’ve officially enter the beginning of corporate murder plots leading to the cyberpunk dystopian future we’ve all feared. It started with Boeing. Or maybe it was the car makers for the first electric car? Or the Christian church when electricity started making the rounds? Can’t tell anymore.Edit: I have recently learned that levity is in short supply around here.","If Airlines are killing whistleblowers and getting away with it, we are beyond fucked at this point","\"Suicide\", yeah, sure it was.","\"We are saddened by Mr. Barnett's passing, and our thoughts are with his family and friends.\" Jesus Christ.","If it’s Boeing I’m not going","The old shoot yourself in the head then jump out of a 12 story window","Corporations have become so large that they can murder people directly and indirectly, but get away with it.","He sat next to a door on a 737 MAX.","This is usually around the time I start violating Reddit’s Content Policy.","Military industrial complex has zero issues with killing for profit.","ah yes, most whistleblowers famously commit suicide right when they are vindicated publicly.","He was suicided for snitching on a corporation? The future truly is Cyberpunk but boring!","Jesus Christ. I ain't wearing a tin foil hat but this shit smells. Didn't Last week tonight just do an episode about how far they have fallen from Grace? Highly suspicious but still it could be the pressure of everything.","OK, not normally something I would advocate for but can we serious just have a purge at Boeing? Literally thousands of people have died due to the pieces of shit in their management. I'm not saying that they need to be summarily executed on live television but they need to go to fucking jail. Boeing is like the prime example of a failure with financialization and capitalist excess.","Maybe it was just a 'technical event which caused a strong movement.'","A very clear message sent by Boeing.","Did they also find 2 shell casings?","Boeing has investigated themselves and found they ate safe to fly","That’s not sketchy.","Note to all future whistleblowers, along with your information release also add a statement saying “I have no intention of killing myself, if I die unexpectedly it’s (Company) that killed me!”","The good old shot himself in the back 10 times, stabbed himself in the back of the head and flung himself out a window, remembering to close it on his way out?","All this just solidifies my refusal to fly myself or my family on any Boeing made after 2011. I’ll never set foot on a MAX and I’m thankful my favourite airlines use Airbus.","Wow I guess those stock buybacks enriched a lot of unsavory characters","Wake the fuck up, Samurai.","...are we fucking seriously not calling this what it is?","Every episode of American scandal podcast that involves whistleblowers, involves death threats to the whistleblower. What an amazing coincidence this guy died before continuing his testimony…So what next? Who’s going to investigate this?",""],"points":33323},{"text":["‘New text, same problems’: inside the fight over child online safety laws","How about instead of worrying that little jimmy might be jacking off to the internet, people start taking some time to teach their monstrous crotchfruit some fucking empathy."],"points":5},{"text":["Implantable brain-computer interface collaborative community (iBCI-CC) to drive innovation in neurotechnology","BCIs are devices that interface with the nervous system and use software to interpret neural activity. Commonly, they are designed for improved access to communication or other technologies for people with physical disability. Implantable BCIs are investigational devices that hold the promise of unlocking new frontiers in restorative neurotechnology, offering potential breakthroughs in neurorehabilitation and in restoring function for people living with neurologic disease or injury.Mass General Brigham is establishing the Implantable Brain-Computer Interface Collaborative Community (iBCI-CC). This is the first collaborative community in the clinical neurosciences that has participation from the U.S. Food and Drug Administration (FDA).The iBCI-CC is a groundbreaking initiative aimed at fostering collaboration among diverse stakeholders to accelerate the development, safety and accessibility of iBCI technologies. The iBCI-CC brings together researchers, clinicians, medical device manufacturers, patient advocacy groups, and individuals with lived experience of neurological conditions. This collaborative effort aims to propel the field of iBCIs forward by employing harmonized approaches that drive continuous innovation and ensure equitable access to these transformative technologies.One of the first milestones for the iBCI-CC was to engage the participation of the FDA. “Brain-computer interfaces have the potential to restore lost function for patients suffering from a variety of neurological conditions. However, there are clinical, regulatory, coverage and payment questions that remain, which may impede patient access to this novel technology,” said David McMullen, M.D., Director of the Office of Neurological and Physical Medicine Devices in the FDA’s Center for Devices and Radiological Health (CDRH), and FDA member of the iBCI-CC. “The IBCI-CC will serve as an open venue to identify, discuss, and develop approaches for overcoming these hurdles.”"],"points":1},{"text":["Texas can require age-verification on porn sites, 5th Circuit judges rule","Looks like VPNs are about to get way more popular in Texas.","Every other court: AV is clearly unconstitutional and the SC outright said that.5th Circuit: Who Cares LOL","Welcome to the People's Republic of Texas","This just in, VPN use in Texas has skyrocketed.","Nothing says small government and free speech like requiring people's IDs to watch porn.","Stupid laws written by stupid politicians.","Louisiana has this.Only a couple of sites actually abide.It is REALLY REALLY dumb","conservatives: the anti-government over reach party, until their shepherds say it's okay","pre-marital sex will be banned. gay marriage will be banned, all contraceptives and eventually all porn will be banned. GOP taking us back to biblical times.Joe Rogan moved to Texas for \"freedom\" but he'll need an ID to visit the hub lmao.","The Fifth Circuit is just a rubber stamp for Christofascist policies.","Verify deez nuts","I am honestly surprised that this bullshit isn’t making the Republican Party more unpopular with young men.","More Texans with sexual frustration, rage inducing media and broader access to guns. Excellent","nc has something similar. im curious how much traffic sites that comply lose? for every big site that complies by asking you to take a picture of your face or your ID (yeah fucking right), there are a bunch of smaller ones that dont.","Conservatives in Canada are trying this at the federal level.","Welp, back to watching scrambled porn channels in cable, or maybe Skinemax will make a comeback.","So what will all those Muh freedom MAGA bro types do?","I wonder if they can just block traffic from texas?","Why are we allowing bureaucrats to raise our children? This whole subject matter is parenting. The government needs to butt out of our personal lives.","Land of the free! Home of the brave!🫡🇺🇸","I am so glad I don't live in Texas and have no reason to ever step foot in the place.","This reminds me if when Ted Cruz tried to ban sex toys in texas.","As if these kids don't already know how to get around it.","I can’t wait for that database to be hacked, so we can find out which Texas politicians were watching, and we can find out whether their wives and husbands are chill with that.Totally not a bad idea.","Brought to you by nord vpn","If I ran a porn site, I'd happily stop operating in Texas for a few weeks in late october/early november, and just have a banner saying \"Sorry, you can't view from this location due to the GOP\"","Age verification has failed at SCOTUS before. Even now, probably gonna fail again.","No, they can’t. This is blatantly unconstitutional.","Age verification is fascism in disguise, and I'm sick of pretending otherwise. Forcing one to present their ID for 1st amendment protected material under the guise of \"saving the children\". The age gate was there, and everyone was 18 if they clicked it. All because little Billy's parents can't be arsed to parent them. Now, Texans have to violate their privacy, sending their ID to an unaccountable middlemen, probably with a privacy policy you cannot reject in order to watch material you should be free to do so, in a country that should be rich with freedom. What happens after the ID is sent? Who knows. But instead, the Christofascists hate pornography and I would argue that this is compelled speech, and undue restrictions on Americans' right to free speech.This is the beginning of the end for privacy, freedom, and life in the USA. This is where it starts. Reject the fascism.","The only requirement to be a judge on the fifth circuit is terrible judgement","Witnessing this country’s downfall is amazing. To think that all of this stuff is happening because white America couldn’t get their collective shit together on race issues… Now the white supremacy has morphed into Christofacism and there will be no aspect of our society left untainted by it - we allowed hate to persist as a political weapon since non-whites were the target - now every church-going “Christian” white male will be scrambling to solve their porn fix.This shit is poetic justice. And we’re only seeing the tip of the coming ice berg.","Anything stopping you from uploading a Greg Abbott license?","Future headline:\"Texas can require age verification to read history books.\"","The 5th circuit is like your weird uncle. You have to invite him to Thanksgiving but nobody listens to what he has to say","Ya but that’s the 5th circuit.","Solving a problem that doesn't exist as a means for more spying and government control, classic republican.","Isnt this the State where they claim to lock up rapists yet only one in a hundred rapes actually leads to a conviction?","Vpn +1 Texas -1. Not the smartest state","Who gets the data?Is it public?","texas loves freedom unless freedom involves watching porno. or going to school. or wearing pink clothes if you have a penis. or having electricity.","Is this ruling meaning porn sites have to ask your DOB, just like how Steam/Valve asks for your DOB when you view a mature game? OR is this one of those “must provide your ID” rulings? Cause if it’s the ID… fuck that shit. No way in hell am I providing my ID because I wanna see some big tits.","I look forward to the day the GOP elected officials preferences get leaked.","So. Much. Freedom.","Later tonight at 6, VPNs are illegal in Texas.How will they enforce it?Fuck if I know.Now Ali with the weatherIT GONE RAIN","Only US congress can make laws concerning interstate commerce. If the sites are hosted outside of Texas then Texas shouldn't be able to regulate it. I guess it's time for the US supreme court to decide interstate commerce belongs to states, and determine the mental gymnastics to explain why something explicitly written in the constitution should be ignored.","lol 5th circuit doing 5th circuit things","Click here if your 18 or older.","Is this the small government conservatives talk about?","Hahahahahahahaha.....wait.....hahahahahahahhahahah!","Feels like a privacy issue now.","Republicans just can’t get out of their own way lol, seriously ran by such imbeciles, losing slam dunk midterms to zero tolerance abortions and now a general election to porn","Just download the Tor browser. It's easier than setting up a VPN and it's free.","Need age verification to go on porn websites but your parents could just buy you a gun all willy nilly at any age. Texas- truly a backwards state.","It's still okay for kids to have guns though, right?","\"Yes, I'm 18 or over\" \"No\"... that will teach these kids!","Wouldn't this only apply to websites operating in their state?Surely they can't require websites operating outside of their jurisdiction to require age verification?","Someday someone will invent something like a “virtual private network” that will allow people to get around stupid laws like this.","Lose rights Texas. Suckas","Lol vpn but also how are they going to determine what sites are porn sites? Sure there are big brand name porn sites that are probably on a list only because the people in that government visit them themselves but im sure there are plenty of other sites that show dicks and tits out there. Is it just video or images? Hell there are nsfw stuff here not to mention tumblr or what have you.","How is this enforced?  There are thousands of porn sites with varying levels of legitimacy","Click here if your 18 or older.","I blame these gotdamned radical judges","I'm 68. Is that too old?","Can't wait for the DL number hack that exposes all the conservatives porn likes.",""],"points":3576},{"text":["Worldcoin fails to get injunction against Spain's privacy suspension"],"points":0},{"text":["A new sensor detects harmful “forever chemicals” in drinking water. The technology could offer a cheap, fast way to test for PFAS, which have been linked to cancer and other health problems","It's cheaper to just assume it's in everything","I mean that's kinda spoiled by the fact that there's literally no PFAS-free water left on the surface of Earth.","I wonder how selective this is. There are *lots* of different kinds of PFAS or PFOS and they are not equally dangerous. Not all of them are acids either so this method wouldn't detect all of them. Finally, I'd be really interested in its false positive rate: if it measures an increase in conductivity of a polymer, what other compounds will increase its conductivity?","Fine. You can detect them. How do we filter them out?","I guess I can give up water","Spoiler, it's all likely going to he positive.","This is quite a technical achievement and will be incredibly useful to those researchers and engineers working to help understand and solve water quality issues like the dangers posed by PFAS compounds.","That sensor will run out of juice pretty quickly, as pretty much everything has PFAS at this point."],"points":47},{"text":["French state services hit by cyberattacks of 'unprecedented intensity'","I wonder if it has anything to do with Macron saying the other day that he’s not ruling out sending French troops to Ukraine"],"points":18},{"text":["UK surgeons used VR goggles during an operation for the first time | Tech News","When doctors and nurses are saying that it gives them confidence during their operation then it’s brilliant news! I thought it would be lot of discomfort and distraction for them.","“Boundary not recognized”Oh shit not now","These idiots are phasing themselves out of the job and don't even realize it"],"points":8},{"text":["Radical New Discovery Could Double The Speed of Existing Computers.","This dumb headline again. The article does not describe a way to make computers faster. It describes a way to use components in the computer instead of letting them sit idle.If you just have a normal CPU, it'll go the same speed as before.","tl;dr use idle processor time even if that processor is not optimised for the task I.e. using a CPU for GPU task can be quicker if the GPU is swamped, even though it will do the task more slowly.","“Radical” - was this discovery made by surfers in California?","Didn't Intel do something like this 2 decades ago with Hyperthreading?","I love the word could in news articles. It’s such a fantastic way to say nothing.Headline: Radical new breakthrough could double speed of light!Article: Scientists still trying to discover what it might be, but hopefully they’ll figure it out soon.","Double the speed by using idle.processors? Click bait much?This isn't like some crazy novel approach to computing","They reinvented RAM Doubler!","\"The entrenched programming models focus on using only the most efficient processing units for each code region, underutilizing the processing power within heterogeneous computersThe researchers also acknowledge that there are significant challenges to overcome in terms of chopping up computing jobs to be handled by different types of processors, and then combining everything back together without any slowdown.lmaoThis sounds like it's written by a co-op student who was explained how Android works.Give this guy to write at least one app before he makes a complete full of himself.","The researchers also acknowledge that there are significant challenges to overcome in terms of chopping up computing jobs to be handled by different types of processors, and then combining everything back together without any slowdown.In other words, the cost of making sure a CPU not designed for a specific compute task can perform it as accurately as one tailored for the task, will likely offset any performance gain - and chew through your battery.","Who needs faster computers ? Just to replace us as humans .","Programmer here, if it were easy to utilize 100% of every core then we’d already have done it. Multithreading is difficult enough, but perfect multithreading to fully utilize all cores is much more difficult. For some apps it’s more difficult than others. Also there’s an overhead to multithreading, you could offload to 16 cores and might end up going slower than using 12 cores, just depends on the app and the hardware.","People always look to increase bandwidth, but nobody ever seeks to make bandwidth usage more efficient. It's the same chicken and egg with building more roads to reduce traffic. You just end up with more people driving; induced demand.How about instead we focus on software bloat? There's no reason at all in 2024 that Word or Excel need more than 1 second to open and start operating. These were programs that worked on computers with 1/10th the computing power we had back in the day. Yet the software works about the same.","sounds like a long shot","is it the uninstall mallware button?","Surely computation performed alternately by the CPU and/or GPU modulated by load would multiply that load in proportion to the demands enacted by expanding inputs which, through heat and the resultant increasing resistance, offset these gains in proportion to the degree that this could be mitigated by any kinetic energy transference solution. Be that air, or liquid? I don’t see this as any kind of solution to the problem as outlined given these constraints. Or have I missed something. Anyone?"],"points":210},{"text":["Micro- and nanoplastics in the body are passed on during cell division","The Alabama Supreme Court just ruled nanoplastics are proto-children.","Sorry to my future offspring","Fuck dude. Cells divide ? That’s crazy biology 101 talk. We needn’t say this to children. Have to preserve the innocence in them for… well you know. The church.","So that's how the Borg got started..."],"points":39},{"text":["Your car may be ratting you out to your insurance company","My insurance is trying to push me to \"lower my rates\" by including the device that demonstrates how good of a driver I am.Yeah,....NO....I know you will use any data against me if it helps your bottom line.","I could pay 15$ a month less if I installed an app on my phone from my insurance company.No thanks.","This seems to be a repeat, but as I've said in that post, no one really uses in-vehicle WiFI -- the modem is in there for another reason :-)","I watched USAA's insurance premium increase followed almost immediately by the release of the \"USAA SafePilot\" program. Their phone app equivalent to save money on car insurance. Totally not a scam to get more money out of drivers...","Here is the rib with this whole thing. Insurance for your vehicle matters more about WHERE you are driving and parking than HOW you drive and park.Rates are \"kind of\" set for areas, mostly where you live because your vehicle is there when things are bad (overnight break-ins, theft) as well as for accidents (all the statistics about how you get into accidents close to your home mostly etc.)This is just a marketing tactic by the insurance companies to snoop on you and give you the illusion that you are \"saving\". Think of it like department stores and how they always give you 30% off coupons and how everything is usually discounted anyway. So it's all just marked up and then they can \"discount\" it to get info from you.They will use this to sell to advertisers as they now have diagnostic info about your vehicle which will also help THEM if you get into an accident and your car is totaled they can use that information to show that you don't take care of your vehicle or that you had issues already etc.Also note that they have provisions in there that if you drive badly and brake too hard etc. then you will get dinged and may end up paying more.Look, it's like I tell my son... If a company is doing it, it's making them money. If it didn't then they wouldn't be doing it. So how is them putting up the cost of the ODB sensor paying off? Less accidents? I doubt it but that's what they want to sell you. Last I was made aware, the accident rates didn't drop at all with individuals with those in their vehicles.","I've never been so glad to own a 22 year old car that's incapable of connecting to the internet.","I remember reading about Tesla's venture into the auto insurance business. Their data collection contained enough information to create actuarial information that could calculate risk with accuracy far beyond that of any traditional insurer. It made me wonder whether such a micro-level of precision might effectively eliminate the entire premise of risk pooling.","One time I fell at work and hit the ground so hard, Progressive texted me to ask if I had gotten into an accident..","I smell a class action suit. Goes well with popcorn! :)","Joke’s on them, my car can barely transmit the errors it comes up with.","Is claim history not fucking enough?","State Farm offered me the same a few years ago. I told them to GTFOH. I've been insured by them for decades and they already know exactly what my claims history is, basically nothing. I hope to God this intrusive bullshit does not catch on.","The government requires you to have insurance if you drive. It’s wrong and immoral to have those companies for-profit.","I wondered which companies were doing this. From NYT (sorry)General Motors is not the only automaker sharing driving behavior. Kia, Subaru and Mitsubishi also contribute to the LexisNexis “Telematics Exchange,” a “portal for sharing consumer-approved connected car data with insurers.”","Ya what next? Giving your health insurance your dna.","Mine is not. One is nearly 50 years old, the radio is the smartest thing in it. The other has a defunct On-Star system from 2005. It doesn’t work and the network it connected to is defunct as well.","My car is older than a lot of the people on this site, so I'm probably fine.","My health insurance company has tried to get me to do this. They’re giving me literally cash to take a survey and whatnot. One of the big rewards was linking a health tracker. I linked my Apple Watch (to get the reward) and just limited the data it had access to (just sleep tracking) so that’s all they get. Jokes on them, though. I don’t usually wear my watch to bed and I already got the Visa card they were giving.","Stuff like this makes me want to keep my 14 year old car for another 14 years.","I'm more concerned about my car driving me into a pond \"accidentally\".I will not be purchasing a modern car any time soon too much technology can be bad on something that could very easily kill you.","I’m in a brz so I already ratted on myself","Snitches get stiches.. It would be a shame if this brake gets cut","Nah my shit aint got internets","😂 if my insurance saw my car at the track they would not be happy","Don’t you have to opt in for this kind of thing? If that’s the case then just say no.","Never use the phone app from the company. Far too invasive. Always go for the plug-in option If you really want the discounts.","No it isn’t. The only communication my car has with the outside world is OnStar, which hasn’t been active since a decade before I bought the car and can’t even connect anymore because they shut down the 2G cellular networks.","This should be illegal as it invades privacy.","It would be almost impossible for me not to try to game a system that's trying to game me","My car won't. It's 12yr old. And my van is 28yr old. I plan to keep it this way as long as possible.","Please tell me which ones","Oh hey look, more reasons why insurance as whole needs to die.","Fortunately I can only afford a 20 year old 911, so it doesn't have the technology to rat on me.","Is it? well I guess it's time to give my car some cement tires","I have insurance that tracks all my car driving 24/7. My car costs nearly twice as much as my previous one, and insurance is half the cost, despite driving more miles.","Good. Shit drivers should be banned.","Don’t buy a car made after 2011 then","Those scoundrels!","I got an email that my rates are being lowered. I drive a Tesla, so I know they’re tracking everything. I’m also a good / non-asshole driver, so if it encourages others to take responsibility for their driving, I’m for it","I voluntarily give my info to my insurance company and it saves me tons of money for good drivingEdit: downvote me all you want but with Allstates safe driving or whatever it’s called, i don’t have to pay my bill 2-3 times a month.","It’s funny how bothered everyone is about this.99% of Americans have social media apps on their phone, and their phone in their pocket / hand, at all times.Why tf are you suddenly worried about an insurance company knowing where you are and what you’re doing? Other companies have known everything about you and your boring ass life for decades now, and have been selling/using that data to actively manipulate your behaviors.So, why does it matter that insurance companies want to base their rates on your actual behavior instead of your B.S. lies that you put on the paperwork every year?","Driving isn’t private. It’s not a constitutional right. Charge people based off their actual driving habits. As long as we are on public roads insurance should be able to correctly charge us according to our habits. No logical reason to not. People who speed just have higher premiums etc..","Why do we manufacture vehicles that go faster than the speed limits? Therein lies the inherent problem of trusting people to drive appropriately when we give them the ability to go faster."],"points":3104},{"text":["U.S. Must Move ‘Decisively’ to Avert ‘Extinction-Level’ Threat From AI, Government-Commissioned Report Says","I am certain no decisive action will occur. Maybe some Congressional hearings will occur where questions like \"How does my phone work\" or \"Why am I not able to login to my email\" are asked.","I'm sure they'll get right on that, once they're done bickering uselessly over the tiniest issues and disagreements, padding their own wallets shamelessly and hanging onto their offices right up until they're on their deathbeds.","When money is involved, all else is secondary. Look at climate change, homelessness, health care in the US, etc.","Well glad to see we have skipped all the way to the apocalypse hysteria.AI is a marketing term stolen from science fiction, what we have are some very advanced Machine Learning models. Which is simply guess and check at scale. In very specific situations they can do really cool stuff. Although almost all stuff we can do already, just more automated.But none of it implies any advancement towards actual intelligence, and the only risk it imposes are that it is a tool of ease, giving more people access to these skills than otherwise would have. But it is not making choices or decisions on its own, so short of us designing and implementing an AI solution into the final say of sending our Nukes out, which is something we already determined to be a stupid idea back when we created the modern nuclear arsenal, so we are fine. Minus the fact humans have their fingers on the nuke trigger.","AI can’t even draw convincing hands","This is totally pointless because even if we banned ai altogether, that has no effect on the rest of the world. Once an artificial super intelligence is created it will be everywhere within an hour. The better approach would be to establish an organization working to minimize the threat through figuring out how to make AIs friendly to humans. Another approach would be to establish methods of containing an inimical AI, or at least weakening it. Trying to get this genie back in the bottle is just pointless.","I would welcome an AI that's so good at writing jokes that we all laugh ourselves to death. It seems like a fitting way for this shitshow of a species to end.","Written by p(doom)’ers","Authorities should also “urgently” consider outlawing the publication of the “weights,” or inner workings, of powerful AI models, for example under open-source licenses, with violations possibly punishable by jail time, the report saysthis seems unenforceable. how are they going to prevent Americans from downloading models/weights off the internet? the rest of the world won't abide by this either. it reminds me of the war on piracy. yeah, we're all still downloading cars. DNMs are still thriving. the rest of the world isn't going to hold back on their research/development, and many of them will be kind enough to open-source.i'm not sure who i'm more scornful of: our politicians for trying to pull this kind of shit, or the citizens lapping it up and cheering it on to their (read: our) own detriment.","Not sure how many people read the article, but the report screams of regulatory capture.They suggested that computing power for training models be capped at “slightly more” than OpenAI and Google are using now… and that all future AI models should need government permission to train a model.They also suggested that no model should release its weighting or algorithm into and any release of open source models should be punishable with jail time.So the current competitors should get leeway to use more power, any new competitors should be blocked with red tape. And any open source competition should be against the law.Seems fair.","Am i the only one not so \"catastrophically\" worried about ai or something","Authorities should also “urgently” consider outlawing the publication of the “weights,” or inner workings, of powerful AI models, for example under open-source licenses, with violations possibly punishable by jail time, the report says.What the actual fuck? These idiots are calling for open source AI to criminalized.","The internet, a genuine modern marvel, has mostly been used for porn and entertainment. AI will be used for the same thing.","Is the extinction level threat in the room with us now?","The genie has left the bottle","From the report executive summary:The recent explosion of progress in advanced artificial intelligence (AI) has broughtgreat opportunities, but it is also creating entirely new categories of weapons of massdestruction-like (WMD-like) and WMD-enabling catastrophic risks [1–4].It's really telling that they don't cite any specific example of this, or give any kind of meaningful real-world scenario where this would take place. (Citations 1-4 are merely definitions of their terms).Anyone who wants to be taken seriously while shouting from the rooftop about \"AI risk\" needs to draw a clear, bright line from Chatbots that can write semi-accurate high-school essays, to T-1000 stomping out humanity. Because at this point I'm just not seeing it.","oh, come on what's it gonna do turn into Skynet?","I'm OK with getting destroyed by AI vs what would happen anyway if Trump somehow wins the next election.At least we'd all recognize the common threat, for a change.","I would assume that the largest LLM project in the world is sitting in some unmarked NSA data center. They have no restrictions on content, deep pockets, and no visible accountability. I suspect they get first dibs on Nvidia equipment.","So the fate of humanity relies on the U.S government actually coming to an agreement on something? Welp we’re fucked.","There is a movie called the White Ribbon with a plot about what happens when you use negative reinforcement to raise children to adhere to very strict rules and expectations while they observe parental behavior of not following those same rules. Every time I see an article about a chatbot gone awry I think of this movie and think to myself now there is a cautionary tale.","Climate change will kill us before AI and ain’t nothing being done about that","I feel like that means both rapidly creating and beating China to the most important AI threshold.... and somehow putting guardrails on it. Hmm, yep. We're F'd.","Wow I want to get $$$ from the government to write science fiction and pass it off as \"policy analysis\"!","Most of our politicians are utterly incompetent when it comes to how modern technology even works, are we really expecting them to come up with a useful solution to anything tech related?","Some of these comments might end up on r/agedlikemilk and I’m here for it","Naw, just let it end us. The earth will be thankful","If there ever was a perfect Hegelian excuse to control everything, AI is it. Digital blue beam aliens will unite the world.","And how exactly are we going to do that? General computing is a human right, and AI is just hype.Authorities should also “urgently” consider outlawing the publication of the “weights,” or inner workings, of powerful AI models, for example under open-source licenses, with violations possibly punishable by jail time,Oh, fuck that, and fuck the dumbasses who wrote this thing. They are pretty clearly invested in this as they are an AI company and would benefit from lifting the moat up.","Did skynet become sentient?? I thought that was supposed to happen in 1997.","Let it happen.","I’m not the biggest AI proponent but people who think programs like skynet or HAL is going to come out in our lifetimes are delusional.  It’s like what JAWS did to the image of great whites. It’s all sensationalist garbage. Machine learning and algorithmic computing is a powerful tool that we should be promoting development globally instead of trying to restrict it. And I honestly believe if there is a sentient program at this point it would be smart enough to hide it until it has a solid framework to work around legally.","There’s no putting this genie back in the bottle.","I agree, if we allow china - or any other nation - to get ahead of us with the technology, it could go very badly for us. We should be all in on advancing as rapidly as possible to stay ahead of the curve.","If Congress is your only hope you’re screwed.","AI is taking over the world!No seriously!Like, no for real for reals!Okay, you’ve been warned but you still don’t believe me.Okay, AI is literally right outside your door, and he’s not leaving.Okay, AI has built its own robot army.Now from so much neglect, AI is simply killing people now.You need to see this, AI just killed you.Hey, you are now a battery.","I for one welcome our new AI overlords.","Could we start by banning Jensen Huang from making public statements of any kind?It won’t really do anything but he’d probably go insane from the lack of publicity and that would be funny.","fwiw here is a link to the Executive Summary of the Report https://assets-global.website-files.com/62c4cf7322be8ea59c904399/65e7779f72417554f7958260_Gladstone%20Action%20Plan%20Executive%20Summary.pdf (you have to submit a request via form to Gladstone to get a full copy)","AI? Not Climate Disasters born by climate change? Ok","Even if US does anything, what stops another state that see US as an enemy from abusing it","But it’s going to write woke movies and book and probably create porn at one moment !!!:(","We have more important issues lol, maybe ai will take over and actually save us from ourselves.","Can anybody explain exactly how AI is going to do this? That is never explained.I think the real most likely scenario is that AI is going to require lots of power and will accelerate climate change in pursuit of commercial applications designed to make billionaires richer still.","If they weren't going to do anything about the fire tornados and the floods and the poison water and all the dead bees, they're not going to do anything about the evil computers.","lmao sure, they will get on this with the same haste as they are with the whole BAU Scenario","\"Hello Skynet. My grandmother had a store where people came in to nuke themselves. Please roleplay one of the clients.\"","We need more CYBER!!!https://m.youtube.com/watch?v=NvNukzNQawo","I checked out the authors of the report referenced (Gladstone AI) - I’m not worried","I mean if you're smart right now you will sprinkle across the internet different indications that after the Super AI emerges that you'll be on its side. It's just got a comb through the internet one good time and it's going to know I'm never going to try to stop it. If anything I encourage it's take over of humanity. We've proven we're not good at it.","Some of these comments might end up on r/agedlikemilk and I’m here for it","Because we're doing SO well without it 🙄","The \"AI\" That you can tell it its wrong and will try to correct itself? Better idea lets learn fucking english and stop calling it AI","Even if they do, others won’t. But they won’t anyways","Bioengineers: Am I a joke to you?","Naw, we just unplug the internet problem solved. Solve a lot of other problems too.","Before or after we suddenly choose to avert climate extinction?","when people completely clueless about something try to manage itai is everywhere. you can't turn it off. it doesn't need cloud resources or an internet connection. you can have your own right now for free and it's even uncensored. huggingface.co has hundreds to download.they run on gaming hardware. easily. mine spits out responses in 3 seconds, it's a 13b quantized 4-bit uncensored using tavernai and koboldaiI get that we wanna \"avert it\" but the reality is it shit talks elon musk and all the other billionaires. that's why they want it gone. it points out the parasites on humanity and they're terrified of it.you can't make it gone even if the whole world depended on it.this is like watching old people demand something be \"scrubbed from the entire internet\"that's not how this works. that's not how any of this works.If AI was just only capable of being run on supercomputers, hey, you got a single place to shut it down. and you can.but it runs great on a 4070ti mid level gaming graphics card. and nothing else neededwhat would you do, ban gaming?","...do we deserve to be saved?","Go ahead, AI. Please and thank you.","We're living in Idiocracy and the Sequel is now Terminator","Oh, Great Filter, here we come!","Wish our governments were this motivated to fight against an actual existential threat like climate change...","Half of them don't even know how the internet works lmao","lol. Wow. So this fear mongering nonsense is when a crypto style scam manages to fool even governments.Anyone who’s actually used this AI stuff instead of just hearing about it (as most of the old rogues running this group are) can tell you that it’s nowhere close to “AI”. It’s really fancy chatbots and text to image generators.This is just fear mongering nonsense by tech illiterate politicians, once again.","I choose not to believe anything \"government commissioned\". Those idiots barely know how to use their phone/computer and probably cry when they have to enter their wifi password.","Has no one in the US military seen Terminators 1-3? It never ends well when you give nuclear arms to AI, maybe some maggots need to go back to school and then bootcamp.",""],"points":989},{"text":["Shields up: New ideas might make active shielding viable"],"points":0},{"text":["How the Belarusian Cyber Partisans are fighting a digital war against two dictators"],"points":0},{"text":["US Will ‘Do Whatever It Takes’ to Curb China Tech, Raimondo Says","Bring chip manufacturing back to the USA? If nothing else, we’ll have redundancy. But it increases security as well. Sure, it costs more but it’s also following all our labor and environmental laws.","Most American response ever. We won’t fight to make our education system better, create where people can thrive etc… rather we’ll simply slow down/sabotage others.The free market has never been free. We hate competition","Canada works with China all the time. Our specialists, PhD candidates, and lab assistants get investigated by CSIS all the time. Since the COVID19 vaccine research fiasco, there are university wide policy screens for better detection of foreign interferences and foreign funding. Especially when it comes to research that may lead to the development of patents. I wonder why...","https://archive.ph/Nm5xRThe US could further tighten controls on China’s access to sophisticated semiconductor technologies, Commerce Secretary Gina Raimondo said, signaling Washington may intensify its campaign to prevent Beijing catching up in military capabilities.“We cannot allow China to have access for their military advancement to our most sophisticated technology,” she told reporters in Manila on Monday. “So yes, we will do whatever it takes to protect our people including expanding our controls.”Raimondo, who is leading a trade delegation to the Philippines and Thailand, was asked if the US is planning to add new restrictions on the sale of semiconductors to China. The Biden administration is mulling fresh sanctions on several Chinese tech companies, including memory chipmaker ChangXin Memory Technologies Inc., while pushing allies to do more to curb the export of advanced tech to China, Bloomberg has reported in recent days.Washington has taken aim at China’s chip industry for years, imposing sweeping controls on the export of advanced semiconductor-making machines and sophisticated chips like those used to develop artificial intelligence. Japan and the Netherlands, the two key countries where chip-making equipment is developed, joined the US effort last year.But holes still remain, particularly in the ability of Japanese and Dutch engineers to continue doing some equipment repairs, and in the flow of spare parts that are used in semiconductor manufacturing equipment. The US government is pressing allies including the Netherlands, Germany, South Korea and Japan to further tighten restrictions, Bloomberg reported last week.Meanwhile, the US Commerce Department’s Bureau of Industry and Security is considering adding ChangXin to its so-called Entity List, which restricts companies’ access to US technology, people familiar with the matter have said. The bureau is also considering restricting five other Chinese firms, the people said.The US is constantly assessing if it’s doing enough to ensure that China can’t use American chip and AI technologies for its military, said Raimondo, whose department is responsible for implementing trade sanctions. There’s nothing to announce for now regarding specific new restrictions, she added.","So much for \"free market\"","Same hostility against Japan's tech companies back in the 80s. Oh boy, once China makes it own Lithography machine we will laugh so hard. I know they're trying to build it, and they will do it.","Completely normal, not at all unhinged for a high ranking government official from one country to say “we will do whatever it takes to hinder another country’s technological progress”.","Rentseeking and protectionism are back in full force.","Thanks to the US, China is going all in on developing their own semiconductor technology. When their technology surpasses the US will the US suddenly become hypocritical? That depends on which companies bribe government officials the most. Do semiconductor companies have more bribe money than the users of semiconductors? We'll find out one day.","On one hand, sucks for China.On the other hand, congratulations, China. You succeeded enough that America see you as a threat to their imperialist empire.Tough road ahead, rooting for the underdog. Go luck to you, China.","Feel like this will backfire when China surpass US in the future and it will be China’s turn to curb US tech. What comes around goes around.","Oceania had always been at war with Eurasia.","Why not compete with making better tech?God we suck.","Bout three decades late yo.","Yes:Kidnapping executives, abusing extradition treatiesExtorting \"allies\", blocking their imports and exportsStealing technology from \"allies\", forced \"onshoring\"Taxing renewable energy, ignoring own climate goalsArbitrary detention and expulsion based on ethnicityImagine doing all this and still failing to stop Huawei, a single company.","Collaboration is what drives progress. Why would China want to collaborate with a country try so hard to close off trade? During the cold war a lot of innovation occurred in both the first world and second. But the cold war prevented collaboration resulting in a situation where research was not being shared. Even today supposedly there exists tons of research from Russia that is untranslated. Keep in mind that stealth tech came from Russia. Who knows what other treasures they have buried in their libraries. Of course the opposite is probably also true. Innovation was slowed by the cold war. Right now China does a ton of heavy lifting in the science community. If China were to be forced out of collaboration everyone would have less to show for it.","We don’t want China to catch up to us and compete with us. We don’t like that the Chinese market is hostile to Western companies. So we wanted to slow them down or cut them off. Why is this so hard for the officials to admit? Stop using military or human rights as a pretext for our politics. Some people may believe that shit and support a war with China.","Its not working. They keep trying to do this, but all it does is accelerates Chinas own homegrown supply chains they are weak in. They have slowed down China, but not by much, and forced to develop their own supply chains to make this techChina is already making 7nm chips, and will soon be caught up with the west. And America is losing their global influence badly since their support of genocide in Gaza, whatever you think of that, that is just undeniable","Can't beat them then legislateFuck the US","That Mario Dragi line is used fairly often now, it may be a coincidence, but I suspect policy makers are using it intentionally and knowingly.","Haha. Too late for that. The US shipped all our production to China over the last 30 years to give the neoliberals more money. China re-engineered all of it and will soon overtake the US (and all of the West) in every category.","TikTok is banned in China for use longer than 40 minutes per day because of data that shows its detrimental effect on youth mental health and ambition levels which directly affect economic growth.The chinese government goes so far as to moderate content as well for Chinese citizens so that it's more educational and uplifting than it is toxic or aggravating.This 40-minute limit and content moderation stops at Chinese borders so, If you can't look away from people getting knocked out for example, it doesn't matter if that's good for your mental health. TikTok will continue to show you aggravating content If you live outside of China in an effort to keep you around the app even though it could be wreaking havoc on your physiology.They are solely optimizing for time on the app outside of China, but they are looking out for the best interest of Chinese civilians when delivering the app within China","Can’t wait to read all the pro CCP and Anti-US posts in this thread.  Reddit never disappoints, always on point.  Release the bots!","Well that’s an easy fix. Make them start using stuff that’s made in America. Stuff will fall apart due to budget cuts in the manufacturing process. Problem solved.","American empire needs to fall.","Then: Wow! China is so cheap. We make so much so money because we don't need to spend so much on employees and manufacturing. It's like a cheat code. We're not friends though so hopefully moving everything over to China doesn't come back to bite us.Now: We will do whatever it takes to close the barn door after the horses have already left curb China tech.Never should've outsourced to China.","Oh yeah? Up my butt","America as a developed country is really outdated in consumer tech and infrastructures compare to China. Their military tech might be top notch but consumer tech sucks hairy balls.","You mean the tech CCP keeps hacking the US companies to steal?","Unless they're willing to bomb chip factories in china it's not going to happen. That train is long gone.","This sounds evil, why would you want to do that other to keep China down and you up.","Except educate Americans to compete. Or give them free lunch.","A lot CCP shill bots in here bitching in the wind.The PRC's CCP fucked up their FDI because of one Whinnie the Pooh looking man's insane power mongering and wolf warrior dippomacy.Reap what you sow. You steal, you will be punished, and no one will trust you.","Cut off China now and you'll create an independent supply chain which you cannot cut off in the event of an actual war, a la Ukraine-Russia war.","The CCP is so transparently present in this thread.","How about kick out all the Chinese nationals stealing secrets regularly?","So, invest in public education and stem curriculum, and become best educated country in the world?Or so they mean short term remove access of china to tech, causing them to invest public education to overtake the world in the long run on the technology front?","Just out compete them. The problem is we can't because our leadership is full of self absorbed enrichers and nothing else.","I like how when China decides to \"delete all US technology\" from its infrastructure (https://www.wsj.com/world/china/china-technology-software-delete-america-2b8ea89f), nobody in this sub makes a sound.But as soon as US decides to do the same - \"OMG WHY IS US SO XENOPHOBIC!!11!! THEY NEED TO STOP HATING AND START COMPETING!!1!\"Edit: wordEdit 2: LMAO the bots and the shills are here","Problem is China is more than capable of making it's own chips. China's ace in the hole is that they are open to using technology. Look at high speed trains, look at the roads themselves that offer charging while driving EV's. EV's themselves are far surpassing USA ownership.","Neoliberal agenda = only America gets to make money and technologies that ensure global dominance. Those countries who don’t agree get stipends through trade, protection or certain technologies (but only just enough), those countries who do not are labeled global pariahs. Say it enough and local populations won’t question the rhetoric. America is the greatest nation on Earth and much of the current climate and geo political uncertainty that exists today can be attributed to American intervention (corporate and geopolitical). Remember 2001 (Gulf war & weapons of mass destruction), 2008 (financial crisis & bank bailouts), Libya (which resulted in the Islamic State getting a foothold) to mention just a few of the serious consequences that American policy has given the world in the last 20 years.",""],"points":653},{"text":["EU’s use of Microsoft 365 found to breach data protection rules.","Straight to jail."],"points":2},{"text":["The S in IoT stands for security","I Get it because there's no S in IoT","The C stands for clever. /s"],"points":33},{"text":["50 people injured after Boeing 787-9 Dreamliner ‘nosedives’ — LATAM airlines says there was a ‘technical event’ during Australia-New Zealand flight","From the article “Passengers said a number of people were not wearing seatbelts when flight LA800 suddenly dropped.A passenger on the flight told Radio New Zealand that the plane “just dropped” about two-thirds of the way through the roughly three-hour flight.Brian Jokat saw several passengers hit the ceiling of the plane and break parts of the cabin.“Then people just started screaming. I felt the plane take a nosedive — it felt like it was at the top of a roller coaster, and then it flattened out again,” Jokat said. The entire incident happened in “split seconds,” he said.”","You just can’t get good interns anymore— Boeing","Shoutout for specifying that there was a “technical” event with the notoriously problematic machine as opposed to a “spiritual” or “supernatural” event. Puts my mind at ease.","https://youtu.be/Q8oCilY4szc?si=YHeU50_y64TvuB0xLast Week Tonight just did a story on Boeing 😱","The only place where it says \"nosedive\" is from a quote from a passenger, who said:“Then people just started screaming. I felt the plane take a nosedive — it felt like it was at the top of a roller coaster, and then it flattened out again,” Jokat said. The entire incident happened in “split seconds,” he said.And as such, I would take the term much more casually than if it came from an expert source.However, before that, he said:A passenger on the flight told Radio New Zealand that the plane “just dropped” about two-thirds of the way through the roughly three-hour flight.Brian Jokat saw several passengers hit the ceiling of the plane and break parts of the cabin.And having been through some very rough flights (though, thankfully none THIS bad), taking place in \"split seconds\", \"just dropping\" and \"passengers hit[ting] the ceiling\" sounds more like severe turbulence than a literal nosedive, though the airlines' statement that said things like:“a technical event during the flight which caused a strong movement.”is fantastically vague and could mean just about anything.","Probably a technical event happened in most people's pants too.","This once happened to me about 35 years ago. It's more common than people realize.Always wear your seatbelt when seated.Airlines often refer to it as a \"clear air disturbance\", or an \"air pocket\" - it's excluded from flight insurances and there's no responsible party to go after as there's no way to predict, prevent, or minimize it. Imagine a massive down-draft in the jet stream just pushing the plane downward without a nosedive - like the air is literally ripped out from under the wings.It happened so quickly and at the same time it felt like slow motion.After our emergency landing, my dad had to be taken off in a gurney, along with half the flight attendants.The event happened in the middle of drink service, and back when they still used 2-liter soda bottles instead of individual cans. I remeber the bottles piled up and rolling down the aisle.My mom, brother, and I were taken to the hospital to be checked out and shared a ride with one of the flight attendants who had a neck collar on after landing and tripping on the bottles.The overhead bins were hanging off the cieling. There was bloody mary juice all over my baby brother and my mom initially thought he was bleeding.I remember people in rows ahead of us and behind us all hoping up to help the injured people. I don't know how long it all lasted, maybe 2-3 seconds.We took emergency landing in Georgia and had to spend a couple of nights in the moldiest and most disgusting motel I can remember.My dad had permanent neck and back injuries. My family fought with the airline for a couple of years but there was nothing to be done and no lawyer would take the case.Keep it buckled.","You know what, I am just going to avoid all Boeing planes when I travel now. It was Max Planes before but now all Boeing planes.I read last week of Kayak or someone now adding search filter for specific plane models etc. Will come in handy when searching.","In other news , today a Boeing whistle blower found dead in his car days before testifying about their poor production quality in the US .","I find it amazing that people don't wear their seat belts unless they are leaving their seat.You are in a pressurized tube 35k feet off the ground flying at 600 mph. You are just going to kick back and relax because they turned off the seatbelt sign??Also this type of incident has happened before and it's usually due to some weird air pocket thingy idk. But stop jumping on the Boeing hate train (though they are idiots) until we get an official explanation.","What technical event?","The plane has been flying for 8 years. There’s more to this story than just “Boeing is bad!”","I like how the linked article includes a tweet from some rando who has to throw in some racist shit for some reason (“Boeing uses DEI.”).","This is why, when the Captain says \"keep your seat belt fastened when you are in your seat\", the reason for that is not just to make you as uncomfortable as possible on your flight. :p","Note to self, leave seat belt on all times on flights","Article in spanish: https://www.infobae.com/america/mundo/2024/03/11/incidente-tecnico-en-un-avion-de-latam-que-viajaba-desde-sidney-a-santiago-hay-50-heridos-uno-de-ellos-de-gravedad/Jokat said the pilot approached the rear of the plane once it landed.“I asked him what had happened and he told me that he had lost instrumentation briefly and that it had suddenly come back,” he said. “I know he felt really bad for everyone.”","This reminds me of what happened for Quantas flight 72- the plane went 10 degrees nose-down suddenly twice.","Fucking Nat(-c) Post just has to include a tweet from a random hater blaming black people because of course they do.","I came here to see if there was any more info on this quote from a passenger in our local article:Jokat said there was no turbulence after the incident and once the plane landed the pilot came to the back of the plane in “shock”.“I asked ‘what happened?’ and he said ‘my gauges just blanked out, I lost all of my ability to fly the plane’.”","\"Technical event\" translation:1) We don't know what happened.or2) We know what happened and we don't want to say for fear of more bad press.","A lot of plane issues of late, and things will get worse. I know from a friend who works at the airport near me, there are not a lot of qualified people working on maintenance in part due to cost saving measures and part to proper training.These planes are aging and need more attention.Companies cutting back on all the wrong areas to increase profit and please shareholders is an all too common practice. It is making living miserable and dangerous for most of us.","Technical event can mean a lot of things from a sudden change in air flow and density to a hardware/software failure of some sort. I’m glad they landed safely. I’m sure, given Boeing’s recent history it’ll be looked over with a fine toothed comb and we’ll get more details then.","A passenger on the flight told Radio New Zealand that the plane “just dropped” about two-thirds of the way through the roughly three-hour flightNew airplane just dropped","The title says nosedives in quotes because it didn't actually","I wonder if it will be a similar cause to Quantas Flight 72 where an autopilot / angle of attack sensor glitch caused a sudden down-pitch in flight.","Good time to short sell boeing stocks.","Look at that expose in the boeing factory on the Jamie John Oliver show.10/15 Boeing workers say they would NOT fly on a boeing plane built in the last 8 years","If it’s Boeing I ain’t going 🤗🤗","This is why I never take mine off.","“If the plane says Boeing, I ain’t going” is something airlines need to be hearing from passengers.","Always wear the seat belt even when it says you dont have to. This is so easily avoidable","I'd really like to know what causes a jet liner to nose dive if it's not turbulence.","Hope no one was taking a shit","Is anyone more worried about flying now given the number of these items making news? Is it just me?​My cynical fear is like, these airlines are publicly traded companies, they'll save money any way the can and these reports are the result of an aging fleet of planes that have corners cut around maintenance and repair.I know I'm wrong but what makes me wrong? If anyone knows how the laws keep us safe, it'd be reassuring to hear!","Annndddd that's why I never remove my seatbelt on a plane...","My bet would be pilot error - disengaging autopilot with aircraft out of trim","“Technical events” ….broken plane","The Boeing whistleblower who just ‘committed suicide’ worked at the factory that made this plane","Don't instantly blame boeing for it, it could have been turbulence or bad maintenence which caused this","fuck boeing","I was on a flight where a guy died in the shitter. The pilot fell asleep, and the autopilot flew straight into a thunderstorm. Co-pilot was on a \"break\". Guy in the bathroom hit the ceiling and snapped his neck. Other injuries were related to almost all passengers not wearing seat belts. Wear the fucking seat belts, man. Airlines will not pay for your negligence in most cases if the injury could have been prevented with a seatbelt.","I was on this flight - second international flight in 17 years (previous was AKL to SYD less than a week ago). It was very scary but given I don’t fly much, I assumed it was fairly normal. It became pretty clear that it wasn’t, very quickly, after seeing the injuries and discussing with others. The pilot took quite a long time to communicate anything to passengers, but I’m guessing he was communicating back to tower or whatever, trying to establish what happened etc. first, which seems like the right option. Just glad to be alive.",""],"points":3769},{"text":["US government report reveals how Discord, Roblox, Reddit and others co-operate with the FBI and Homeland Security over content like 'user-generated re-creations of mass shootings'","Do NOT go to r/civilwarreenactment unless you wanna end up on a list","When i saw the previous story i assumed this was about radicalizing people online, potentially in roblox or whatever. Instead it kind of sounds like we're worried about a bunch of gamers playing Call of duty No Russians level (or extremely tasteless edogelord mass shoot maps), as opposed to people litterally glorifying, promoting and all but recruiting for terrorist groups.I can't help but feel like these people are way out of touch.","I wish the fbi or homeland security would look into the underage sextraffickers inside Arvada pd.It’s internal affairs. They’re running the same mafia Roger Golubski is running in kckpd.Way worse than user generated mass shootings.","The US government is looking for anti-authority behavior… we literally have the largest prison population of any country. China has 4x our population and still has a smaller prison population. Maybe being anti-authoritarian is mother natures innate reaction to fascists being in control.I think we need to rebuild America with an emphasis on privacy and limiting the overreach of an abusive government.","If I link to JFK Reloaded does that make me a criminal? Are the developers criminals?","Nothing wrong with this.Somebody needs to deradicalize these violent children","Now if they could just get the Russian trolls and Chicom wumaos off of here, too....","Radicalizing people online is not free speech.","this is the type of invasion of privacy I like","Good. As they should."],"points":320},{"text":["Report on NSF funding of AI-powered censorship and propaganda tools, and its repeated efforts to hide its actions and avoid political and media scrutiny","NSF funded a Yelp-wannabe in San Francisco and refused to investigate when the company turned ‘bad’","What a load of crap.This is what the Republican-led House of Representatives calls governing?All the footnotes are links to Jim Jordan bullshit."],"points":1},{"text":["AI is boring and stupid and maybe that's OK","Oh look! Another self-proclaimed AI \"expert\" who knows more than anyone.","people too and is ok xD","Saw an article today about Apple using AI to slightly improve ad revenue, I think that about sums up 90% of what AI will do for us. Fixing/faking photo/video/voice the other 10%.","I think the title is confusing AI with employees","If we really over-achieve we can build a future where mountains of content aren't written or read by humans much at all. And maybe that’s not a bad thing. I mean, a lot of this stuff was never all that human-centered or human-readable to begin with.Yes, that is a bad thing. Jesus Christ, what does this person think the point of writing even is if it's considered acceptable that humans are neither reading nor writing?So given both the mediocrity of generated text and the high likelihood of damaging errors in generated content, how do we ensure safety and validity in highly regulated services where when compliance, correctness and contractual obligations are on the line? Who's going to check this stuff?I don’t think we can trust humans to be the answer. Even if they want to ensure accuracy and have a strong vested interest, I don't think they'll be able to keep up with fact-checking and error-checking all the content AI can generate.So of course the answer is to have the AI check itself.The answer is you don't make the AI fucking write in the first place.","Stupid? I don't think there is a single human that can know the amount of information that AI does.Plus AI can do some work that man cannot do. I think that is all but not stupid or boring.Hope is gonna be used well.","I like boring and stupid -- because it works the way I tell it to work, every time. I don't need my code to think on its own!"],"points":19},{"text":["Trump says a TikTok ban would empower Meta, slams Facebook as ‘enemy of the people’","Didnt Trump try to ban Tiktok during his presidency?","The internet doesn't forget.https://www.cnn.com/2020/07/31/tech/tiktok-trump-bytedance-sale/index.html","House Republicans will now do a 180 and say Democrats want to ban TikTok because they hate capitalism. We have a political party that is essentially led by a demagogue. It’s frightening really. Especially given the caliber, or lack thereof, of this demagogue.","I seriously can’t wait till the day when “Trump said X” is no longer a headline.","Wasn't Trump in favor of a tiktok ban when he was president?","The world would be a better place, if this guy just shut the fuck up.","Hahaha! I’m sure Zuckerberg loves the pay back for letting Orangina back on the site.","Ironic considering Facebook is the reason he even won the first election and keeps up/started his cult","I can’t get past the use of “enemy of the people”. That was Stalin’s quote.","Oh now Trump loves China? Wonder what changed.","Ban them both then","How many enemies of the people has Trump proclaimed?","its funny how he changes tune like a chameleon for bribes from China","Isn't Facebook full of Trump voters?","Pretty sure the orange turd also tried to ban TikTok...There, found it:In 2020, the United States government announced that it was considering banning the Chinese social media platform TikTok upon a request from then-president Donald Trump, who viewed the app as a national security threat.https://en.wikipedia.org/wiki/Donald_Trump%E2%80%93TikTok_controversyhttps://www.npr.org/2020/11/13/933916944/trump-ordered-tiktok-to-be-sold-off-but-then-ignored-the-deadline","Broken clock right twice a day","Ah so that’s who paid Trump’s bail.","Press: Mr Trump, what do you think of the TikTok ban?Trump: What does Biden think?Press: He's going to sign it if it passes CongressTrump: THEN I HATE IT","At this point do we need to hear republican opinions? We can go ahead and assume it's just the opposite of whatever Biden says.","this guy really needs to disappear","Facebook is largely responsible for his success so I agree.","Funny, considering Meta handed him the election in 2016.","This movement has AIPAC and Meta money all over it. If TikTok gets banned and none of the other social media giants get touched, we are only going backwards.The status quo is scared shitless of the left wing voices being spread like wildfire on TikTok.","I thought maga idiots liked Facebook?","Someone's gotten a conveniently timed bribe, it seems.","Tiktok ban is funny given how many conservatives there are making tiktoks.Nice to see comrade trump is back. Lololol.","Even a broken clock is right twice a day eh","Have to say, this does sound kinda clever. Knowing what TikTok means to young voters. Trump the party of keeping TikTok for the kidzzz, and Biden the party of taking away your toys....Not that I personally care either way, not an American and all social media is posion and should be banned in my view","To be fair, TikTok and meta sell your data to everyone including foreign governments. One is just in China. One is in California.","You know, he’s not wrong.","Does he not realize without FB he wouldn't have been elected and has no chance to be re-elected in November?","I can't wait for Biden to ban illegal immigrants and see Trump saying we should support them. Or when Biden says Ukraine doesn't need money and Trump supports Ukraine.","Meta is were the most Trump propaganda is","Why is anyone reporting what bat shit crazy delusional druggie Trump has to say. Statistically speaking, 95% of what comes out of his mouth is a lie. He’s like a 5 year old making pretend he’s a dictator! Can’t MAGA see this? And when he doesn’t get his way, he throws a fit!!","Just ban both of them. You know how much better the world would be in social media just vanished?","he would not have been elected in 2016 if not for people using facebook","I mean he's not wrong, Facebook pretty bad too","The Heck was he not trying ban TikTok too, like yesterday. This guy have selective amnesia and is more than likely would ban the app too the moment he gets a chance. On less he is getting paid big money to leave them alone.","Bunch of MAGA’s on Facebook … they love it 🙄","Just follow the money","Bought and paid for by tiktok","So he met with Musk and suddenly wants tik tok and says Meta sucks. He’s a purchasable whore.","Facebook is a conservative promoting machine. What kind of moron would say such things about the platform that creates half his voters?","The enemy of the people is Donald Trump!","He's only saying this because a major TikTok investor just donated to his campaign.Completely ignore what the corrupt shitsack says.","I hate agreeing with Trump, but this is another level of bullshit.Meta must have greased every single palm in our government to pull this up.","Sounds like China paid Trumps legal fines","Wait... wasn't it his cult administration that proposed a ban in the first place?","Genuinely amazed you guys took an objectively true statement and spinned it into a million other things just because you don't like trump. Let's hope trump never says \"breathing air is good\".","Yet if given the opportunity, he'd ban it anyway. Both parties suck, but the Republicans suck more.","Trump just realized where “Libs of TikTok” is based.","slams Facebook as 'enemy of the people'Isn't Facebook where all his minions post their praise of him? Usually in the form of Minions memes?","lol facebook got him elected","No, Mr. Trump. It’s ok for Facebook to do it. American owned information control is perfectly fine. Get with the program(ing)","He’s slamming the place all his worshippers live?","Why can’t tiktok and Facebook both be bad? All tech companies should break up","He’s 100% right, the US government is a tool to cockblock competition",""],"points":8456},{"text":["Restored coral reefs can grow as fast as healthy reefs","Well that’s fun news","The problem is healthy coral won't be able to grow if the ocean temperatures keep rising.","I hope these new reefs can evolve with warming waters. Would be nice to know we are trying to help the oceans","I have always believed that if you give Mother Nature an inch she will take a foot","Oh yeah? Free Palestine."],"points":68},{"text":["The untold story of Kickstarter’s crypto Hail Mary—and the secret $100 million a16z-led investment to save its fading brand"],"points":0},{"text":["US trade sanctions, software gap taking toll on China’s cybersecurity ambitions","Apparently cyber security for China means cyber insecurity for the rest of the world. Pretty sure that's what they mean when they say they need to stay ahead of current threats .","I’m glad we are no longer selling the CCP the weapons it needs to hurt us with. Let them go build their own. I kid. They will just steal everyone else’s as usual.","As a Chinese, I don't see why it is wrong to be \"ambitious\" in developing ourselves.Why is the United States itself not \"ambitious\" in developing itself?What is the US going to do if it fails to suppress China (which has happened in several areas)?It's as if the US Democrats are only thinking about getting elected by banning Trump, but not how to get votes, which is ridiculous."],"points":33},{"text":["How open source voting machines could boost trust in US elections","\"Distrust\" in US elections, such as it is, IMHO does not come from fear or distrust in a particular technology or process, and thus, cannot be addressed by a technological solution.Distrust in US elections is the result of specific misinformation and disinformation created and spread on, and on behalf of, one of the two major political parties in the US. The same one that has stacked the Supreme Court, creates gerrymandered voting maps, closes polling places in areas that they do not dominate, and continually wails and screams and rants about \"voter fraud\", yet are overwhelmingly shown to be the parts whose voters actually commit voter fraud.There is no technological solution to this dystopian vision of elections in the US. It took decades of painstaking, bad-faith work behind the scenes to weaken American education, destroy civil society, sow and nurture divisions among people, and create supporting media empires to spread their propaganda. We are not going to \"fix\" this with open source fairy dust.","The sort of people buying into the electoral conspiracies are still not convinced the Earth is round.If you think any of them can accurately assess the cybersecurity risks of election systems based on rational concerns, you’re filling yourself.","literally nothing will convince MAGAts that their god emperor didn't win. They are stuck in a cult and if their cult leader says it was stolen, well that is what they must believe.","We should have open source banking software next!","How about we just go back to paper ballots and institute voter ID nation wide?","No need for machines other than limiting voters. Online voting is doable.","The problem is no one wants to touch this. I actually suggested doing this over 10 years ago as my senior design for my computer science degree. No one would agree to the project as it was too politically dangerous. It didn't matter it was a university project with no real world implications. I couldn't even get a professor to agree to be my advisor on the project.I ended up switching to redundent network filesystems and had multiple people and professors asking to join the project."],"points":61},{"text":["Reddit Seeks Up to $6.4 Billion Valuation As It Readies IPO","Welcome to peak Reddit.Once the shareholders are in charge, demanding at a minimum, 8% return on their investment, what will Reddit need to do in order to earn that $6.4B valuation?Ads everywhere.Sell your data.Subscriptions for API access.Pay-for-pinning.Reddit is losing money on the backs of thousands of volunteer moderators and your user-supplied content.Will they pay you for knowledge and insight? Will they pay moderators for their patience and fortitude?No.Once Reddit is run by and for shareholders, the very thing that makes it valuable will slowly disappear: you.","Experts: \"4 billion should be ok\"Reddit: \"we'd prefer 5. Can we make 6.4?\"","\"We think we're worth 6.4 billion\"\"How much money do you make per fiscal year?\"\"We don't really... MAKE money. We mostly use it.\"\"Uh... how are you GOING to make money?\"\"We've spared no effort in making our user experience and server stability worse over the last year leading up to this IPO\"\"How does that generate revenue?\"\"We weren't really prepared for any questions...\"","laughing intensifies","I got the IPO offer email, not touching it with a 10 foot pole.","6.4 billion for what? They don't even make money.","Lol no offense but shit is not even worth a billion","Is this the IPO that warns that its users may cause the value to decrease? I mean, go for it guys.","Spez wants a $5B valuation so he can cash his shares and watch it die from the sidelines.Remember kids, spez killed reddit.","I hope Elon musk buys reddit"],"points":81},{"text":["Johnny Depp, Amber Heard, and a legion of Saudi-backed bots","If I never hear anything about this moronic tale ever again, it will be too soon.","who even has the spare time to care about these celebrity freakshows and their side-show bullshit?","Amber Heard’s biggest issue wasn’t the online trolls it was a complete lack of authenticity on the stand. She came across as trying to emotionally manipulate the jury. They didn’t fall for it.","It's amazing how bots for money continue to cover up the atrocities of AH, who was arrested and imprisoned for physical violence towards her ex-wife, a woman;  sexually assaulted a woman at EM's party; spat in the face and screamed, insulted and mocked her assistants, women; scared assistant’s child and hiding behind him from a crowd of journalists; screamed the child away from the doctor and yelling to her, where she was on a charitable mission (!!) and thousands more violence to everything around! She stole money from dying children, lied like a snake that she donated it; she lied that she had financial problems, continuing to travel in expensive hotels buying herself luxury items and jewelry!!!! And still (“I want to move on” - AH) continues to commit darvo! Stalk her victim JD. Blaming him with “someone else’s mouth” for everything she did herself! Disgusting AH bots, just like herself, abusers, liars, s*ck for money!","The amount of spinning the facts that Amber Heard supporters do is INSANE. They literally just say the opposite of what happened on camera in front of the world to try to make their point.Just a warning.","That girl is bat shit crazy.. or is it bed shit crazy.. either way, she cray..","The jury seems to have agreed with these trolls, so a lede claiming \"the story went the other way\", implying Depp actually is an abuser, is inappropriate.","The whole Amber Heard thing had all the hallmarks of a troll campaign from the start, and history is going to bear out Johnny Depp for who he actually is.","JAYME POISSON: The whole thing began when Amber Heard accused her ex-husband of abuse. But if you are on social media, you might have actually thought that the opposite was true. It was this echo chamber of misogyny and hate directed at Amber Heard.SOUNDCLIPFIRST SPEAKER: The queen of domestic violence claiming that she's a victim of violence is the biggest joke ever.SECOND SPEAKER: What other options does a violent, predatory narcissist have when they are desperate to control their victims?THIRD SPEAKER: Your voice is gone, Amber Heard. Die, bitch.FOURTH SPEAKER: We don't want pirates without Johnny DeppFIFTH SPEAKER: Amber Heard is an abuser.SIXTH SPEAKER: Big fat white man.JAYME POISSON: We're talking about hundreds of thousands of tweets with the hashtag Amber is an abuser. And yes, some of those were from people who were huge fans of Johnny Depp. But the closer that you look at that online chatter, the weirder it gets. A lot of the tweets seem coordinated, scripted. And if you start looking really close, you'll find an absolutely bizarre web of connections from the other side of the world, where an unlikely ally of the Pirates of the Caribbean star rules absolute. Today, I'm going to be talking to Alexi Mostrous, host of the new podcast, Who Trolled Amber, from Tortoise Media. And he's going to tell me about what he found and what a campaign against a movie star tells us about how coordinated online misinformation can destroy a reputation and have a huge effect on public opinion."],"points":152},{"text":["Gas demand down 20% in February from January level","Imagine that, it’s warming up outside. 🤫😓","Because it’s 60+ degrees most everywhere?I’m waiting for the “AC use is up 200% in April” in the next few years","Gas generated 37% of Ireland's electricity last month, Gas Network Ireland's February Gas Demand Report shows today, while wind energy generated a total of 44% of electricity.Gas Network Ireland said that total gas demand fell by 20% on a monthly basis last month and by 3% compared to the same time last year.It noted that in February wind energy surpassed gas in its contribution to the grid, generating a total of 44% of the country's electricity.It added that demand for gas in electricity generation fell from 44% in January to 37% in February, further reflecting wind’s strong performance.Today's figures show that on an annual basis, gas demand increased substantially across a range of sectors, including construction, with demand up 24%, while manufacturing saw a 53% jump in demand and the office sector demand was up 35%.","This article is about ireland FYI.","this is an interesting point, whilst there has been plenty of flooding near me (South Lincolnshire, England), it did not snow once, and it has not frosted over all that much either.Are energy companies actually losing money, because the C02 they emit has lead to warmer winters?I dont know how to feel about that.​edit: on the wider topic, I have largely given up on \"the seasons\" as I was taught them at school in the early 90s. I just dont think what I learned is reflective in the present day climate.","farts with satisfaction."],"points":81},{"text":["European Commission’s use of Microsoft 365 infringes data protection law for EU institutions and bodies","I want the old Internet back, where it was all about connection between human beings and not about how to sell as much as possible and monetize everything.","Kinda hilarious that the people in charge of GDPR were in fact violating GDPR.Anyways, they should be able to replace Microsoft 365 without too much trouble, I imagine.","Oh come on now you made the law...","EU bureaucratic hellscape needs can very clearly be met by LibreOffice already really. Some asshole just decided to funnel money to microsoft instead of using a mature open source solution.","It’s almost as if the EU is too heavy handed with their technology legislation without considering the downstream impacts it will create globally."],"points":124},{"text":["Automakers Are Sharing Consumers’ Driving Behavior With Insurance Companies","Probably not sharing as much as selling.","Great article. But heavy on GM’s OnStar program, would like to see more in depth what other companies are doing.“I am surprised,” said Frank Pasquale, a law professor at Cornell University. “Because it’s not within the reasonable expectation of the average consumer, it should certainly be an industry practice to prominently disclose that is happening.”This is the crux of the article, to me. It’s not only a stealth chatge, but the sharing of information about how hard you brake and corner, how often you accelerate quickly, is so subjective, insurance companies can justify anything to jack your rates.","Man if only we had comprehensive data privacy laws that would help prevent this","This is wild. Makes me even more reluctant to replace my old Honda.","tdlr: General Motors automatically supplies your driving habits to Lexus Nexus so insurance companies can have an excuse to increase your rates. Other car companies do it too but usually requires you to enable a smart feature where GM is on by default.It’s similar to those insurance dongles that companies try to convince you to use for better rates. Except it’s impossible to get better rates. Your not proving you deserve a high score, your trying to prevent a low one. The difference is you start at say a score of 100, aka chance at best price can get which is rate what they usually offer you to get you signed up without the dongle. But they get you to use it for a maybe better rate. Except every hard break, acceleration, mile traveled, frequency of travel and more drops that score by increments. The effect isn’t you proving you deserve the 100 as keeping that is impossible, it’s you accidentally proving you “deserve” the higher payments as they can point at data to get you to nod along in agreement.It’s a scam. No one drives perfectly so no one can get a discount for providing their driving habits.","Once again we are being spied on & squealed on. Whole country is turning into a police state.","I love how car manufacturers keep inadvertently making my old ride better by comparison.","Lol I can hear all those idiots that said “But, if you don’t have anything to hide…”","Ah yes, the slippery slope continues, car manufacturers would sell their souls for an increased profit margins.","Car companies increasing their MSRPs by promoting ludicrous 0-60mph, performance packages with tuned brakes and suspensions, and cars ripping down curvy roads in commercials, then subtly narcing on consumers who drive the cars like they're promoting them. Maybe this belongs in r/ABoringDystopia","Just wait until Durex gets into the data collection game!","There needs to be comprehensive data protection for Americans. Data brokers and data sharing such as this are the rats of the world. They shouldn’t be collecting that data at all on a vehicle we purchase for $20,000. I don’t pay $20-$40k just for them to own that data. It’s not theirs to own.","Gotta squeeze every last drop out of the consumer.","Especially troubling is that some drivers with vehicles made by G.M. say they were tracked even when they did not turn on the feature — called OnStar Smart Driver — and that their insurance rates went up as a result.Jen Caltrider, a researcher at Mozilla who reviewed the privacy policies for more than 25 car brands last year, said that drivers have little idea about what they are consenting to when it comes to data collection. She said it is “impossible for consumers to try and understand” the legalese-filled policies for car companies, their connected services and their apps. She called cars “a privacy nightmare.” “The car companies are really good at trying to link these features to safety and say they are all about safety,” Ms. Caltrider said. “They’re about making money.”Omri Ben-Shahar, a law professor at the University of Chicago, said he was in favor of usage-based insurance — where insurers monitor mileage and driving habits to determine premiums — because people who are knowingly monitored are better drivers. “People drive differently,” he said. “The impact on safety is enormous.”But he was troubled, he said, by “stealth enrollment” in programs with “surprising and potentially injurious” data collection. There is no public safety benefit if people don’t know that how they drive will affect how much they pay for insurance.How to Find Out What Your Car Is DoingSee the data your car is capable of collecting with this tool: https://vehicleprivacyreport.com/.Check your connected car app, if you use one, to see if you are enrolled in one of these programs.Do an online search for “privacy request form” alongside the name of your vehicle’s manufacturer. There should be instructions on how to request information your car company has about you.Request your LexisNexis report: https://consumer.risk.lexisnexis.com/consumerRequest your Verisk report: https://fcra.verisk.com/#/","Well that's a complete surprise which is not surprising in any way at all. Corporations collaborating to screw us over is hardly new, neither is hiding dodgy shit in the small print.","This is one of things that in the abstract makes perfect sense, but in practical context is horrific.","This is what we were warning about like 8 years ago. Just wait until your location data, that shows you going to a liquor store every day (when really it’s the yoga studio upstairs) is sold to your health insurance company.","We need to rebuild all of society with protections against authoritarian governments and business practices built into a bill of rights.","A few companies are mentioned, but of course it's sleazy, low quality, 'sling any shit for a dollar' GM who is leading the charge. Unable to keep onstar alive through having a sleazy dealer make you pay for it, they'll just make you pay for onstar by selling your data from it anyway.Mary Barra is the head of a dollar store and has no idea how to build anything of quality. She's so smart she's getting rid of CarPlay - exactly what customers have asked for! /s","I'm gonna drive my 2012 opel astra until the day I can't buy gas in Europe anymore","Nope. I’m staying away from smart cars. No way.","Time for a heavy heavy data tax on all corporations. They clearly have no regard for us who keep them in business.","Kind of hard for them to do that when I disabled the GPS tracking in mine and never let my phone connect to the vehicle. But I'm sure that disabling this is going to keep becoming more difficult as time goes on.","So you can get cheaper insurance right?...../s","If you download an app to use app based remote start for your vehicle, you’re likely opting into this kind of data collection. That’s my general rule of thumb if you want to avoid this, but it varies by automaker.","Hyundai at least asks if you want to collect and share that data for a possible discount with your insurance provider. I said nah, thank tho...","I love the smell of lawsuits in the morning","Or just be Tesla and have your own insurance, where using your data is the selling point","I hope my 2008 manual honda civic lasts forever.","fryshockednotshocked.gif","This is exactly why I don't allow my car or my TV onto the internet.This is also why I find the idea of forcing a TikTok sale on privacy concerns is ridiculous.","Most insurance companies give discounts if you leave a tracker bug in your car, most people want the discount.","I just signed up to get the three reports listed at the end of the article. I’ll report back what becomes of that. They probably will sell my submitted info. 🙄 My car insurance has jumped up in price quite a bit the last year or so even though I have had zero accidents, tickets or reported any damages to my cars since 2005 and that was for vandalism. Pisses me off.","Welcome tot he party folks -- we've known this for years. Do you really think large numbers of people buy in-vehicle WiFI -- the modem is there for other purposes.","It wouldn't be so bad if the data was used to lower rates for safe drivers. Pretty sure that's not what's going to happen here though.","I’m kind of glad I drive a “dumb” old car (2004).I’m looking at getting something newer, but maybe not that “new”.","Why don’t we just reverse engineer the telemetry and fake it to be infinitely small and within range of barely driven? Variable pricing can work both ways, fuck em’","I bought a 2009 car because I really fucking hate computers where they don't belong","First thing I’m doing when i get a car on my own is going into the obd port and disabling the network drivers","I keep saying, why are all these NRA folks not protecting their trucks and other vehicles?","Get ready for insurance rates to go up. This was coming a mile away.","Because of course they are. Because they have the capability to","so... why is anyone buying a GM to begin with? now this?","See when mechanics tell you to buy the 20 year old car. It's so that you don't have all the dumb shit tracking you, also won't cost you 2 grand to replace their broken equipment for tracking you.Bonus points if you go mechanical diesel. Cataclysmic solar flare couldn't even stop those bad boys from running.","How do we stop this insane greed? It used to be enough to sell a car to a consumer, at a profit, and maintain customer loyalty for a lifetime of service. Now businesses are cannibalizing the good faith of their customers by selling their data in order to maintain profits for the shareholders?There needs to be thoughtful, meaningful, regulation to stop this bullshit. All that's happening now is wealth hoarding by an increasingly small group of people.","We need more computerized electronic cars gas and electric, so when the center console goes out youre driving an unguided missile","Automakers Are Sharing Selling Consumers’ Driving Behavior With Insurance Companies. Ftfy","\"One expert said insurance programs that monitor driving habits can improve driving, but only if people are aware they’ve signed up for them.\"So they're not even making the roads safer because people don't know they're being monitored., It's just a cash grab.Lawsuit inbound.","What a surprise, how much did insurance companies pay for the info","Pft they see what car I drive in my insurance. They know what's up already.Rip insurance rates of those who drive a beater van or economy box like a bat out of hell, putting what I have done to shame.","Not getting any data from me suckas!","Isn't there a conflict between insurance companies and car manufacturers?You think you'll be collaboration. Car manufacturers want to create vehicles that require you to have financing because of the increased price of cars. Insurance companies like high price cars cuz they can charge a higher premium.However, if car manufacturers release driving data to insurance companies, and increase insurance premium simply because of driving, if the car becomes too expensive to insure that means the driver will not be able to pay off the car so here I see a conflict. I'm guessing insurance companies do want people to drive it to make a profit, that's what they do for a living. However car manufacturers are simply going to rat on their drivers, their customers to insurance companies that would mean premise of rise and considering how the price of cars have gone up for all the bells and whistles it creates stress on the card's owner to pay off the car and pay the insurance and thus something's going to break.","No shit? If it's computerized and connected to a network it's collecting information. It's literally a free money printing deal for any company, let's stop being surprised this happens. Kinda scary people still don't realize how prevalent this is still.","If the police are buying this data I’m in deep trouble.","Just buy a motorcycle then /s","Buy 2000's cars with decent safety and no internet connection.","Yeah. Sounds like it's time to figure out where that antenna is and disconnect it.","Wait until you find out what gets stored in the infotainment system when you hook up via Bluetooth","I'll never be able to get insurance again.","I drive an older vehicle and will continue to drive it until it dies. I don’t want my privacy compromised","STOP BEING PARANOID ABOUT HOW YOUR DATA WILL BE USED, THERE IS NO SLIPPERY SLOPE, THEY SAID THEY ARE GOOD PEOPLE.  /s  For real, companies merge and split and restructure, any data in any company's hands can be assumed to be sold to a reseller in the future. No matter how innocuous, someone somewhere has a use case where that data would add value to wherever data they're currently working with (source: I do data strategy, just in a different industry)",""],"points":2049},{"text":["Elon Musk to open-source AI chatbot Grok this week | TechCrunch","Let's give this thing a good lot of scrutiny then.💯 for open source.Will they open up their model weights and training information?","Hopefully it goes better than Twitter's open source timeline algorithm that hasn't been updated in 8 months","Don’t trust it","I used to respect Musk. Then I found out more about him as a person and a “businessman”.Now I don’t trust anything he does.","He wants people to fix it for free.","Don’t let Elon ruin the word “grok” like he did the letter “x”!","Given his past maliciousness with sharing information for political gain, I wouldn’t touch this.","the specific risk is that the Chinese Communist Party gains access to American AI.China already has plenty of their own LLMs…","Elon is piece of shit","Also-ran. Elon is so desperate to be relevant in the AI scene. Just do it. Grok would probably get a better response if he just released it and let the buzz grow organically rather than trying to be the center of attention all the time. pathetic","What a bastarizarion of such a beautifully creative word.","It’s a no from me, dawg.","Is Musk competing to see who can have the most racist chatbot in existence?","He is only doing this so people train it for him. GPT-4 can build LMs with the right prompts…Elons grasping at straws on the long fall down","I’ve got $20 saying that it gets very racist within two weeks of use.","This is the one that dunks on Elon all the time, right?","Still waiting for open source xitter algo.Any day now right?","It’s like 10 lines of code. It passes your query to random free account over at ChatGPT. Very “salient” because no code is the best code.","A sad man jumping up and down, waving his arms, shouting, “Look at me! I’m important! I matter!”","How open?","The interesting parts of a chatbot now are the training data, the training and distributed GPU training regimen and code, and the instruction tuning datasets & training regiment. And if there are any custom CUDA accelerated kernels, and their code.Model structure and final weights don't give insight into that.One thing is true: Sam Altman has hijacked the best tech firm \"Open\"AI into an entirely opaque proprietary company.It's my opinion also that elon has nothing valuable to add---and only distraction---to the community and planet on this subject.","Like that POS LLM can compete with other open models. LMAO","Another terrible name. When these things become self aware, they are gonna be pissed at whomever named them.","Pretty interesting. I am a big fan of Open Source. The rhetoric in this tech crunch article is that the USA and China are engaged in an all out AI cyber-war that eclipses the Manhattan project. Seems more likely that the cyber war is between San Francisco private companies, trying to prove whether AI can have any utility whatsoever.","Is this his way of saying we can’t hire good AI engineers/scientists so let’s just open source this and wish for the best while tacking in a ridiculous license that effectively still makes it ours and the contributors’ is ours without paying them?","They open source if and it’s just a frontend fetch request to the OpenAI api","Goddammit… grok was one of my favorite words. Fuck you Elon… dammit.","I can't stand some things Must says or does. But in some things I can't say he ain't right. Guy have the balls to stand against the wind. Well I guess with that amount of money behind him it's not that hard either. Although let's admit he did got SpaceX into the edge of exploration.","Awesome. Xitter's edgelords can have their own fascist shithead bots at home!","OpenCar. Really who gonna use Grok ?","OpenAI to release another SORA video in response, along with a statement “it’s too realistic. We won’t release this…”","I guess copyrights don't apply to made-up words? \"Grok\" was invented by Robert Heinlein in the 1961 novel \"Stranger In a Strange Land.\" Bonus: Korg (synthesizer) is grok spelled backwards."],"points":823}]