[{"text":["Nvidia has virtually recreated the entire planet — and now it wants to use its digital twin to crack weather forecasting for good","Oh, this is the first step towards whole world simulation. Like the one we are in right now.","Virtually recreating the whole planet won't make the Lyapunov exponents magically disappear.","Time to finally hit run on the simulation...Display's earth simulation of an inhospitable planet in 100 yearsTurn it off.","I heard you like simulations….","I wonder which company’s whole-earth simulation we’re living in…","I read this as them assigning this task to Nvidia in the simulation 😆","And then the inhabitants of digital earth created their own microscopic earth in digital form so that THEY could predict sports results. So on and so forth all the way down.","If they can even get two weeks out I'll be impressed.The very idea that you can model the entire planet is the dumbest shit and Hayek's knowledge problem shows how the approach is inherently flawed as everything in totality cannot be understood and tracked by a central authority, yet here we are, still thinking if we just have bigger computers we can tell the future. I'd legitimately take a bloody palm reader over another expert with a dataset.","“It’s a simulation inside of another simulation!”","Michael Crichton had it right with Westworld.","Civ7 you now have to manually move every person within your empire each second…","As someone who actually works in this field:LMFAOThis is the dumbest thing I have possibly ever read.Either Nvidia knows full well how stupid this statement is and is blatantly lyingOr has gone completely off the deep end of Mt. StupidFWIW: I have worked with folks at ORNL, Penn St’s Climate Lab, and UT - as well as folks working on the IPCC CRU models.We haven’t even collected the data Nvidia is claiming to have.Either they are lying - or (more likely) they are completely fabricating the data to make a “full” digital twin.Typical CS/CE folks going “we understand natural science better than natural scientists” despite being so uneducated in the topic that they don’t realize their entire model is built on completely falsified data.","spoiler: they won’t","Do it and we will see if the weather man is that bad","Nvidia…Bunch ‘o’ round earthers….","Rehoboam","But did they model the butterflies too? Otherwise the hurricane predictions are going to be spotty at best.","They’re just making shit up now","lol sure 🤣","Yeah, but I bet they didn’t. And I bet they can’t","This would be dope for video games or virtual learning.","Where can I find the Oracle? I have some ordinary questions...","We're going to pump so much energy into a realistic weather simulation that we accelerate climate change more per minute than all the cargo ships on Earth could in a year. No need to forecast anything then","Aren’t we pretty good at weather forecasting?","Doesn’t Chaos Theory says this is… impossible? Beyond so many days…","Wait until the Earth Simulator starts to fail to detect Climate Change disasters and we have to simulate industry polluting the world to get good data.","Isn’t earth.nullschool.net a lot like this can anyone eli5 why or not?","The technoCores master plan coming to fruition. Cant wait for the Kiev institute to suck us all into a black hole","Maybe we are just someone else’s virtual construction…","Once this feat has been accomplished Nvidia corp. will crack down on any movement that impacts the veracity of their perfect weather model. Sounds like the plot of the ultimate dystopian novel.","That’s an odd way of saying they’ve simulated the weather.","I’m having a BBQ on July 4th, 2026 can anyone tell me what the weather should be?","But can it play Doom?","I wonder which Alien bought the Inception addon pack.","Pointless as no one can control it, only watch it happen. Sounds expensive.","Can we just get decently priced GPUs back","I’m starting several butterfly farms to throw them off.","Hard to account for earthquakes, volcanoes and manmade calamities. Trash in coastal regions during hot days deprive oxygen in which the weather cycle gets effected. Studies show heated updrafts in the trashiest locations.","Except that’s going to become impossible in very short order. As vital systems begin their collapse, reliable patterns won’t be marked by indicators you can model around. Intense weather will spring up more quickly, in unexpected regions, and the best we can hope for is for infrastructure to be beefed up before then.","Misremembering our understanding of the future by imagining we understand the past."],"points":709},{"text":["World's fastest wireless EV charger unlocks 100 kW parking spots","OK, it might be too early in the day for my brain to be working well, but I could not find a link in the article to the actual paper.Like seriously, EV’s are my job, and I’m genuinely wanting to review the paper in depth to see how difficult it would be for us to commercialize it. We have wireless inductive charging, and I’m a huge fan of the concept, but the current commercial state of the art is pretty pathetic as the article accurately describes.","Sorry man just want to put my phone on this for a bit..","The system was measured at 100 kW, with 96% efficiency – comparable to what you'd get from a very good cable and plug.How is a cable and plug only 96% efficient?","So figure 1KWh/minute until tapering.Similar to most superchargers not including the 250KW variants.","\"This can increase battery charge state by 50% in under 20 minutes\". That's amazing!!","Is plugging it in that hard?","ICE cars will still park there"],"points":36},{"text":["Incorporating a phase-change material into concrete, researchers have created a self-heating material that can melt snow and ice for up to 10 hours without using salt or shovels.","So what happens when the material breaks down and starts entering the local ecosystem?","And after the snow melts for up to 10 hours, the resulting water will refreeze into black ice. Can’t wait!","Awesome. All roads will now be icy smooth on the first snow day.","Great, just in time for when the majority of the US will no longer experience major snowfall","Lets focus on not having car sized pot holes first","Florida has been on to of this for a while now.https://www.wusf.org/environment/2023-07-05/a-new-radioactive-road-law-has-florida-environmentalists-concerned#:~:text=A%20new%20law%20signed%20by,also%20holds%20radium%20and%20uranium.\"A new law signed by Gov. Ron DeSantis paves the way for phosphogypsum to be used in road construction across Florida. The material is toxic waste created while making phosphoric acid used in fertilizers. It also holds radium and uranium.\"","Bring that sh*t to Montreal Asap","Something tells me they aren’t going to go and redo the roads that this would help","We could just have trains guys....","There’s a big leap between “the road is warmer for a while” and “there will be less snow on the road”. Sure, if the temperature drops from 50 to 30 and it snows, the road will be warmer and there will be less snow. But if the temperature was below 40 for 10 hours before the snow, there would be no improvement. How many snow storms are preceded by warm weather, by less than 10 hours?","Won’t cause cancer we swear!","Some of the salt contracts in the Midwest were signed “in perpetuity”, plus it’s a great tool of obsolescence for the auto industry. I do not expect to see this ever.","What happened to the solar powered tarmac that was here <10 years ago, we are still using the same stuff.","Just in time for the end of the warmest winter in recorded history","For people worrying about toxicity, the phase 'change material' used is paraffin. Notably non-toxic.","Sucks that roads are not made of concrete.....","How many cycles before failure","Why are they always going after our snow days! >:v","if salt is a problem can i sue for damage to my car?","Even with its flaws they’re working hard to make sure no one misses work.","Let’s dump massive amounts of money into technology we do not need and likely could have adverse environmental side effects.","Don’t mess with our snow days. ~tx","Raleigh’s storm bubble intensifies.","They cant even fix potholes where I live though","Witchcraft!","Next thing you know they’ll openly talk about haarp","Why not use uranium, melt snow and ice permanently/s","I remember years ago, (probably about 10-15) a story about a couple who invented these interconnecting heated colored light up road blocks. Not only would these blocks melt snow but they would warn drivers of animals or car accidents. I thought that invention was the most incredible thing. I wonder what ever happened to that? The last I remembered, was people complaining about light pollution and they questioned the longevity of the product.It's just completely nuts that we drive on outdated roadways. It's the year 2024 and can't even get traffic lights to sense if there's anyone on the other side, so we don't have to sit at a red light for 5-10 minutes.","Der takin away our jobs!","Just in time for global warming. Cool, another useless technological advancement for mankind. Next do aeroplanes.","There are whole state economies dependent on fixing roads, we easily could have much much better roads but don’t because of this.","They can melt snow without a shovel!!?? /s","Or what happens when 10 hours of melted runoff RE freezes on another spot on the road?","What happens in extreme heat? A product made from petroleum, oil, or coal. What could go wrong.","10 hours is too long to wait for snow melt on highways. Snow needs to be removed as it falls.","ah but snow and ice usually keeps coming back for checks notes 4 months a year."],"points":313}]