[{"text":["Why do LLMs give different responses to the same prompt?","At the end of the model, it generates one token. When we see it do that, we see that output as text, but under the hood, it's generating a list of numbers, with each item in the list corresponding to one of the tokens it can pick. For example, GPT-4 has about 100 thousand tokens it can choose from, so the list of numbers it generates at the end of the model is a list of about 100k numbers.Each number represents the model's guess at the probability that that's the next token. For example, in the sentence \"I went to the\" the model might say that there's a 60% chance the next word is \"store\", 20% for \"house\", etc etc. The model assigns a probability to every token, and the probabilities are basically never 0, so it may be that there's a 0.000001% chance that the next token is \"дом\" for example.Then, this probability distribution is passed through a softmax function where temperature is applied. In many cases, the model will be 99.999% sure of the next token, but you don't necessarily always want the single most likely next token because variety is good. The temperature setting smooths out the probability distribution, decreasing the likelihood of the most probable token choices and increasing the probability of less likely tokens. If the temperature is set appropriately, this results in more varied writing without going off the rails and choosing totally inappropriate tokens.After the temperature and softmax are applied, one token is picked randomly in accordance with the resulting probability distribution, and that's how you get the token that the user actually sees.This skims over some of the details because they're not necessarily relevant for your question. It's a bit more complex than this but I'm on mobile and this more or less covers it without me having to write a ton. Hope this helps!"],"points":2},{"text":["What if the first AGI is fleshy?","Should be fine, I’ve been fleshy since birth and hadn’t encountered any issues .","That sounds like child birth but with extra steps and without any of the sexy parts."],"points":2},{"text":["Xianxia- [RPG] An Advanced RPG Made For Gemini AI [ Comment to Access]","Hey, I would like to give it a try. I am a software engineer, and dnd player. Can you give you some feedback if interested."],"points":0},{"text":["learning AI as a highschooler","fwiw, it seems like the near-future direction of coding will be with natural language rather than programming languages.If you’re a sophomore now, you’d finish college with a CS degree in 6 years. not trying to diminish your excitement, but I believe a large percentage of programming (not all but most) will be fully automated in 6 years.that means the job market for people could/probably will be dramatically smaller. I don’t have any alternative advice for you here because this dilemma impacts nearly all professions.edit: I’ll add that the most useful skill you could be doing is what you’re already doing. be fluent with using AI systems. work on general problem solving skills. learn to critically think. it’s difficult to plan with much more specificity than that given the uncertainty and inevitable societal restructuring.","The machine learning guide podcast is excellent if you’ve not found it yet:https://podcasts.deptagency.com/mlg","r/learnmachinelearning would be better to check out. Good luck!","You might want to check out Stack Exchange sites. They're like Reddit but have a more technical focus because they started out focusing on programming. Here is their AI site...https://ai.stackexchange.com/","I'd also add to find a secondary topic that is an interest of yours. The reason why is to apply your knowledge of machine and deep learning to that area. As you're already interested in it and willing to learn it makes applying techniques all the more thrilling.It could be video games, card games, engineering problems or biology ect but the more you focus on an interesting secondary domain the more motivated you'll be to implement techniques.","When you command the robots can you ask them to spare me?","While focused solely on ChatGPT LLM, these videos could be fun:https://spreadsheets-are-all-you-need.ai/index.html#watch-the-lessons","Andrew NGS coursera course is really good intro"],"points":8},{"text":["How long until AI eliminates the modeling industry?","Eliminates? Probably never. Reduces it by 90%? Probably 5 years","I already built a ML driven solution for Walmart that eliminates some need for models. We leveraged complex mesh’s and good old fashion ML that not only diversified the selection of models for each piece of clothing, but dramatically reduced costs for shoots.","I feel like one thing everyone here isn’t talking about is that fashion brands and such don’t just use models as a personal wearing clothes, but also to bring their fanbase onto the product.When you have Zendaya in an ad for clothing, they chose her not just as someone who can wear the clothes. They brought her fan base to the product, and to draw attention for being well known.","You should read some William Gibson. Start with the Bridge Trilogy.","Japan commercial Ai model september last year https://youtube.com/shorts/tVtxLkKi90w?si=nleDQrIAAOyRLB2xRozy and Zaein are Ai spokesmodels in Korea that are generating revenue for companies.All Ai kpop group. Almost 25 million views for this music video. https://youtu.be/1wGOHbcQKIc?si=go9Gqp9nxaEvVpXP","100% never no matter how good image manipulation gets there will always be a luxury component for using real. Though what is is real and what is generated is going to get way way harder to tell.The model rocks up for a few photos then a system generates 1000's more in all the different combinations of clothing and pose required. Though there is a small step to having stock images of registered models and choosing the attributes you want for the clothes and just clicking a button.When you factor in AI I think more that it will stick you into the photo/video in a very flattering way so the clothes look awesome on you.","For movies I think a minimum of 5 and probably around 10 years before an AI actor can be a drop in replacement for a real actor.You need a 100% generated scene, and you all the actors to be generated and all the props to be generated. While they may all have been scanned in, you need them all to work 100% in a 100% simulated world with the appropriate lighting and physics.If you are just talking about just a background actor, it all ready exists, there is a reason why it was only a 5 year contract in the recent strikes, in 5 years their bargaining position is going to be in the gutter.","Friend of mine worked in the retail fashion industry in London back in the mid-2000s and even then they were shooting models only from the neck-down so they could pay them substantially less. Can only imagine how much of a boon to her industry AI is going to be.","AI is still very hard to control. I use Midjourney and Dall-E and have generated 10's of thousands of images. I'm also involved in two different community arts organisations and I do graphic design for advertising and publicity for one of them. Plus I'm an artist myself and since I like to work with human subjects I often use AI to develop reference images to draw or paint to as part of my process.For serious commercial work, whether it's commercial advertising or fashion illustration, etc, you need complete control. The Art Director knows what they want and you better have every detail right.But image prompts are basically suggestions. You might have a ton of detail in them but the AI will still make its own decisions about many things.WRT fashion, it's not just a matter of putting this outfit on that model. It's also the way the clothes hang or fall on them, how stiff or fluidly they move as the model moves; if the model is wearing layers it's how two pieces of fabric slide WRT each other, or how the colours complement or contrast with each other, or how much light shines through, etc.Cheap fashion catalogs already Photoshop different dresses on the same model, but no serious fashion designer is going to use AI to replace a runway show until the AI is WAY more advanced than it is now.","It won’t. It’ll just change it. There used to be vast offices full of draftsman but they were replaced by CAD. Ai is just a force multiplier. So one person can do way more.","AI won't eliminate any industry. It will restructure most of them, but there will still be humans wearing clothes in 100 years.","Unrealistic beauty standards … I mean wouldn’t AI generated people make that even worse?","Levi's is already doing it.https://www.theverge.com/2023/3/27/23658385/levis-ai-generated-clothing-model-diversity-denim","Places like Nikestore.com are using all AI for their models","catwalk with AI? don’t think so","[deleted]","slapping their products on an AI generated modelThey can photoshop their products right now. They can photoshop the ugly out of people to make them attractive.Will movies and tv actors eventually be replaced by AI?They already are, haven't you watched a Pixar movie? Or what about the live action Jungle Book?I don't see AI doing anything other than making it easier to accomplish these things.There has been a lot of talk of what I call the \"magical AI problem.\" We can easily imagine a future where the AI just sticks clothes on a model and it's perfect for your billboard. But we can't easily imagine the limitations.","It's kinda ironic too - we pay (female) models so much and it's the \"easiest\" thing in the world: be born pretty. Now, I'm not saying it's common, just that they didn't have to do anything to achieve that: win the genetic lottery and eat less. AI is here to ruin that too.I'm thinking I'm going to start to create some AI influencers to take those annoying jobs too"],"points":131},{"text":["Best free \"learn AI bit by bit in five minutes a day\" courses for beginners/know-nothings?","I would start with asking ChatGPT the questions you have, and then diving deeper into the aspects that interest you most. From there you can branch out to find more focused tutorials.","AI is a very broad field, you have to be very specific with what you want to learn about","There is no learn AI, you just talk to it like you talk to other humans. You know how with Billy if you want him to do something for you, you need to use a bit of flatery? And Samatha, just insinuate that she can't do it and her ego will kick in and she will do it.AI has quirks like that as well. You will learn them as you use them."],"points":2},{"text":["does anyone know an ai that's similar to chatgpt but isn't censored?","I've heard that NovelAI is uncensored and private. It helps people write all sorts of lewd stuff so probably works ok for slasher films. But ask around r/NovelAIBut it's not a chatbot, afaik (I haven't used it, personally) ... so coming up with ideas is probably not its strong point--- actually writing the ideas is.If you need an uncensored GPT chatbot, you're best off running one locally. If you're not very technical, your best bet might be using https://github.com/nomic-ai/gpt4allYou don't need a GPU either, it'll run on CPU. Of course, not as quickly. It's pretty simple to set up and run. Easy to select a model, or switch between them, there was at least one uncensored one available, though I can't vouch for how useful it is. I don't use it, I'm just aware of it.","try r/LocalLLaMA ?","Consider running your own? It's a lot easier than you might think and free.https://gpt4all.io/https://ollama.ai/https://lmstudio.ai/https://jan.ai/r/LocalLLaMA","yeah... slasher films.. 'and stuff'","Maybe Claude","Jailbreak it and it gets a bit more lenient"],"points":10},{"text":["One-Minute Daily AI News 3/16/2024"],"points":0},{"text":["A weakness about AI art","Post the prompts you used.","\"for now\" it's certainly difficult to make a sequence or something like an action with many object or interaction with just a prompt only. Try to make a rough sketch then tinker it with control net i guess","https://www.bing.com/images/create/skier-trips-and-tumbles-down-forming-a-comical-gia/1-65f6614e964a4fc5832e821af1370839?id=xMq0MSPEblvKhtrov2CFqA%3d%3d&view=detailv2&idpp=genimg&thId=OIG4.HzXghnq9tX9mpjls7Mp3&darkschemeovr=1&FORM=GCRIDP&ssp=1&setlang=en&cc=US&safesearch=moderate","AI art gens have certain flaws, since it can especially get confused when certain things overlap or there are multiple specific things.To this end, either use an AI with better prompt adherance, or photobash/sketch a composition that illustrates what you want and feed it into the AI.","https://www.bing.com/images/create/cartoon2c-chase-goes-wrong-and-the-coyote-falls-fro/1-65f6621e23bc490fa9641b5c89f1df74?id=S18zSO%2bg7Xa%2b4MW%2bIvuAgQ%3d%3d&view=detailv2&idpp=genimg&thId=OIG1.uBkMJvgTflJmExqb5Myb&darkschemeovr=1&FORM=GCRIDP&ssp=1&setlang=en&cc=US&safesearch=moderate"],"points":8},{"text":["Having fun generating plant pictures... 10 trained models and counting 🪴","FANTASTIC! Show this to the newly (post-Covid) resurgent houseplant people. Only when it’s pretty as possible tho, to lessen the chance they attack on sight due to AInxiety lol.Have you tested on some of the newly popular genuses? I would try Anthuriums (for the leaves, not the flowers!), Hoyas, and Calathea. Calathea musaicia perhaps? 🙇‍♂️🥺🙏For a while I’ve wanted to make an app that recognizes plant species in these popular groups, but all the existing apps were clearly built and tested for very surface-level distinctions between the traditional genuses, with a little support for super common species. An app that could do modern plants reliably could be a big money maker! You would not BELIEVE how much money people spend on plants as a hobby…","Impressive!!","What your training process?","Just curious, are you fine tuning using something like LORA or are you training custom embeddings?","Trained models? Could you elaborate?"],"points":4},{"text":["This doesn't look good, this commercial appears to be made with AI","wutyou do realize that the primary economic motivation for creation of AI technology is to reduce business costs... and if I had to guess, the AI look might be a \"feature\" for at least a while, even if it is goofy","Speaking as a visual effects artist that works in commercials and actively uses and knows most AI software this is not AI. This is low budget animation.","Looks bad. But I think the general public still won't notice.","Most definitely. And it's terrifying. They got them crazy eyes","I’m confused. Did you expect companies not to use AI?","It's just cheap 3D banking on an overdone style to look somewhat cute and modern. Ads like these have been around for ages.","Looks like they used a liquify effect in post to give it that creepy, exaggerated look, but otherwise it doesn't have the hallmarks of being AI generated. AI still has a problem with noise, and this is fairly noiseless. The backgrounds are consistent, have parallax, and are noiseless as well. AI also has a problem with keeping consistent textures on moving objects, and these are all consistent, especially the pillows. The models also have the telltale signs of rigging, especially around the armpits where there are weird deformations one would get from using a sloppy rig. The only AI capable of producing something of this quality is Sora and that's not yet available for commercial use.","I don’t think it’s AI","I hope that all TV looks like this soon, so that people will find better things to do with their time.","Probably cost em 1/10th the price to make it though","This advert served its purpose.. which was to... advertise","This is actually better than the usual Rac commercials. Societies ducked bro","who the hell watches commercials outside of the rare random days where ublock origin needs an update?they could air commercials for hardcore porn and I'd have no idea.","Yeah…this isn’t AI. Gross art design, but not AI.","It doesn't look like AI at all. This is too consistent, and perfect.It's more likely to have been made in blender.","You don’t think a company should be allowed to use AI to cut corners? 😂","Cant wait blockbusters made by AI.","Maybe the quality isn’t the best but a place like rent-a-center is never going to have top quality graphics for their commercials and in the past they’d probably have even uglier cgi.","You’re right - it doesn’t look good.","Looks like a simple 3D animation that any beginner can pull off, why do you think its AI?","Companies need to be careful implementing this in their branding, could ruin their brand if the vibes get too weird..","You guys know this art style existed way before AI right?","Like howdie doodie or HR puffenstuff were any less scary.","Theyre in the wild now","I'm confused about why something like AI should be relegated to being used to \"mess around with stuff.\" AI has the potential (<- key word) to change the world in countless ways. And we're worried about commercials?","Well, this is bad.... But it's the worst it will be. Its only going to get better from here. Soon we won't know the difference.","Yea I already noticed this on YouTube a couple months ago. So many ads with messed up fingers. Obviously this is the perfect utility for Generative AI so it will improve and become omnipresent.","It needs tweaking, yes. But damn. It's amazing.","Can't account for bad taste.","Yeah the moment I saw this I knew it was AI. This is like the 4th one I’ve seen though","This doesn’t look like AI…","You can tell its AI generated because it has no soul; that spark of creativity and personalization is missing. There is no \"story\" underlying those scenes.\"man standing amazed with popcorn in front of new tv\"\"woman doing laundry amazed\"\"man on couch sitting down happy\"","How can you tell it's AI rather than simple CGI created by a human?","It's not AI , AI animation doesn't have this sort of consistency between frames, even state of art tech like SORA has issues with temporal consistency","AI is worthless until its given to an already expert person, To get to an expert position someone needs to know the things. Let this startups make the VC money once the money is gone hype will also","it feels too coherent to be AI, nothing in the background is shifting, the blur is consistent, etc","Ugly","I've seen a lot of billboards done with it too","What the fuck to you expect? Rent-A-Center caters to people who can't afford furniture. Of course they are going to cut every possible corner, such as actors for their video ads.","Whatever it is, it works. You shared it and now we've all seen it.","I bet AI was most certainly used in the pitch meeting 😂","omg that is the weird but looks like ai is taking the jobs quicker then ever","Visit us at Uncanny Valley","well, i certainly wouldn't feel threatened in my job after watching this... nonsense...","Reminds me of that meme commercial from grubhub xd","Is it, or isn't it? If we're here, what matters is the debate, not the answer.If folks with interest and expertise in AI can't tell the difference, then practically speaking there is no difference.","So, I just watched a commercial. Was that the point?","Assuming this is AI, and I wouldn't be surprised if it was, the cost of producing this ad compared to a typical one with a bunch of animators is astronomical.Even if it looks bad, we now know of a company called \"Rac Exchange\". The ad did its purpose, weird as it was.","If it’s AI, they got the fingers right.","IT LOOKS LIKE A CYBERPUNK 2077 AD","I had a good chuckle at \"using AI to cut corners\". There have always been technophobes and always will be.","\"looks like\"? So you don't actually know, or have any evidence then... If you don't like ai, fine, that's your perogative. If you don't like this aesthetic, fine, that's also your perogative. But you'd better have the evidence to back up your claim, otherwise you're part of a witch hunt, and a huge problem for artists caught unfairly in a petty cross fire.","[deleted]","Funny, I think this is just a model adding a style.I have seen the woman in tv who is spilling the cleaning stuff.","Drugs mmmk","wah wah wah someone call the wahmbulance","This commercial would traumatize children who are up too late holy fack its horrifying.","Putting creatives everywhere out of work. For profit. Capitalism.will finally meet a point of implosion soon.","Budgets for these commercials have always been tiny.Of course they typed it in to AI."],"points":499},{"text":["Someone who claimed to have worked at Disney before is saying that Pixar will go through a massive layoff very soon due to advancement of AI such as Midjourney. Thoughts?","Anyone who embraces AI to try and increase profit margins will be undercut by someone else also using AI. There will be a race to the bottom in quality with the rise of content mills and anything AI generated will get lost in the sea of other AI generated stuff.By firing animators and artists they’re throwing away their only creative advantage they have over AI.Inb4 “but AI can generate such crazy stuff!” - you never met any artists, they often have to be reigned in so they don’t turn in crazy content with limited appeal.","If they were smart they wouldn’t change a damn thing but executives are greedy so RIP Pixar it was nice while it lasted. AI comes to extract the soul from something else. It should be used as a tool and if anything spur more hires hopefully we get there someday soon.","There is profound misunderstanding about AI in these posts . AI isn't sentient or capable of artistry , AI is nothing more than a generative tool. AI related layoffs in this industry would happen today only in the context where these companies are shifting resources to invest in AI ( this is what is happening in the tech industry) , not as artists being replaced by generators. There is no AI generator capable of fully producing the work necessary in this industry.My BS meter went off the scales when they mention a company would rather use a paid service that has no infrastructure for that purpose , namely Midjourney, instead of using a free one that has ample extensibility like Stable Diffusion.Honestly it is far more likely that these studios already have SD models , which they fine tuned to be used as an assistive tool for artists. It is what makes sense with the current technology and tools available.Just because people say they are something on the internet it doesn't mean it is true and even if they are what they claim it doesn't mean they are giving out truthful or complete information on something.","Them first, us next.","This all BS","Wonder studio does way more damage to these crew members","It’s going to get harder to produce the ‘making of’ shows when an AI machine is increasingly part of the production workflow.","The whole article, not to mention the comments section, is highly speculative.So far very few people have been laid off in any industry where you can draw a direct-line to AI as specifically causing the layoff.","Looking at this thread one advice was to be a solo story teller using AI tools, but if distribution movies remain the same while production gets disrupted due to AI, will in the short term studios only are going to benefit and not solo storytellers? Somehow now i feel all these money and talent been poured to get generative AI breakthroughs was to get corporations and studios to get bigger and bigger while reducing there expenses and individuals and salaried class are just happy with free or freemium tools they can play with. I am guessing at some point something like french revolution may happen at large scale in the world to bring down the system that unreasonably benefits from technology","\"someone who claimed to....\"who cares. If this person worked there they have proof.If this person doesn't work there anymore then how are they supposed to have access to this kind of information that wouldn't be shared with 99% of employees?learn some critical thinking people. anyone can claim anything online.","If not, do you see any possible red flag to this guy's claim? If so, which ones?"],"points":90},{"text":["Is anyone else worried about the future of AI P*rnography?","I really think it’ll get to saturation, and then reach an inflection point where people will stop giving a crap because it’ll be impossible to verify or deny, and it’ll just become pointless to care about it.","To be fair... no. The contrary.Sure, it will lead to some deprivated stuff - which is also around today - but this time it wouldn't involve real people.I also hope, on an egoistical level, to be able to customize erotic content, for example add diversity or toys.","Porn without real people getting abused seems ideal to me.","I guess if you have to find something to potty about, this is one topic.","well all the people complaining the industry exploits women now with ai you dont have to!","AI P*rn is going to be too powerful one day“Command reports that Washington has fallen to the AI porn. Men, it’s been an honor. Save a bullet for yourselves because that robotussy will not show mercy.”","I'm not even sure what that means.\"They thought it would be global warming, nuclear war, or gain-of-function virus research. And they were all wrong. In the end, what brought down humanity was porn that was simply too powerful to deal with.\"","It's going to be very, very popular and pervasive for a minute.Those Taylor Swift images were...allllmost to the point of reality.It's going to make some really weird fetishes.I think eventually it's like clip art.It's more interesting to pay for the real thing.But we have 5-10 crazy years any it's going to destroy porn careers before they come bouncing back.","OP, could you clarify your terms a bit? What do you mean by \"powerful\"?Are you concerned about Deep Fakes enabling the creation of porn featuring...well...anyone at all?I'm going to guess you're not concerned about the labor issues of customizable eroticism putting industry workers out of a job or, at least, suffering from a lessening of demand.","The growth of porn, especially with the latest AI and VR technology, is a prime example of what's called a supernormal stimulus. This means it's so exciting to our brains that it far exceeds anything we'd normally encounter in real life. With AI and VR, people can simulate experiences of love or sexual activity without being with another person. As these technologies improve, the digital world becomes more attractive, making our real, everyday lives seem less interesting.However, as much as these digital experiences can be exciting, they also have a downside. They can disconnect us from real life and from the people around us. It's easy to get caught up in a world where everything feels perfect and immediate, but that can make us miss out on the real, meaningful experiences that make life valuable.I believe that this trend might lead us towards a possible 'great filter' scenario, where our reliance on digital experiences over real human connections and activities could contribute to human decline or even extinction. The idea of the great filter suggests that at some point in a civilization's development, there's a barrier that is very hard or impossible to overcome, and this could very well be ours.Now is the time to recognize this and start making changes before we get too lost in the digital world and it's too late. I don't want a future where digital experiences are more important than real life, especially if it means heading towards a path where humanity could fade away. Breaking free from this cycle is important, and I'm already working on it. It's about choosing to focus more on the real world, with all its flaws and beauty, and less on the digital one. This way, we can enjoy the true richness of life and real connections with others, ensuring we steer clear of any path that could lead to our decline.","Aye why no bring on the ai porn nobodys getting affected x","I would rather people get off to AI porn over unregulated porn.","I’m not scared of that at all. There’s already so much of it. How can we possibly have more?","Im more worried about things that matter.","Excited is probably more the word I'm thinking of...","Not at all. I think there are a lot more important things that will be impacted. This is the bottom of the list of concerns for me.","No, why, starting an issue about what. A private media is in the eye of the beholder and no business if others, that's why it's private. Ps: it's not my kind of thing but this seems to be a discussion to shake things up that belongs to private sphere. Or in other words, non of your damn business to go peeking and rattle emotions on oh look. Commercial it will be exploited like something aligned to the oldest profession in the world, yes and so? No demand? Very disturbing tendency to try to govern private life.","dude, where's my car","No, when it comes to AI - porn, jobs, etc.. should be the least of your worries. A new omnipotent digital god that may or may not care about you should be near the top.","Nop, I prefer “abused” avatars versus real people being abused.","no because it can't be worse than the actual terrible things humans have done and filmed... yes it can be really f'd up but people have abused and tortured other people since the beginning of time, and now they are able to film it... the amount of torture/abuse footage out there is disgusting and authorities already have a hard enough time going through it and tracking ti all.nothing can be more disgusting than it being REAL. at the least the disgusting awful things AI will make didn't actually happen to some poor soul.","I just hope it's better than no I pornography.","Am I worried about its future? Nah, it should do fine. /s","I’m hype","I don't see the issue, even if the content contains children. It is much better for the content to be fake than real. And oversaturating with fake will kill the real.","What ,that it might find us ugly and deny us? Also it sound like you definitely have been logging hours contemplating it.","\"asking for a friend\"","\"asking for a friend\"","Half the poeple in this sub are waiting for a VR porn world that never ends. The only worry is its not cumming fast enough.","It'll be both sad and interesting to see people falling in love with an AI porn girlfriend who they can have conversations with, and who responds to their unique individual preferences. I also expect people to be tricked/scammed using the technology.","I feel like it should be a crime to deep fake someone as p*rn without their consent","I am trying to decide if I should get onto making ai porn of myself and putting it out there, so that in at least some of the fake porn of me I would look attractive in a way I enjoy.Currently no lewds of me even exist, but I suppose with ai that can change any time.","Keeps me up at night","Comments are incredibly naive.Imagine real life but a slight variation. What if the January 6th guys had preluded that day by spending more than 10 hours a day in an AOC rape simulator? How much worse would that day be?AOC already has hundreds of AI porns of her right now. They may not be VR and interactive but that’s due to a lack of commitment rather than lack of ability.AI porn is deranged and should be banned. Honestly, porn should generally be banned. It’s not a victimless crime. People who disagree are kidding themselves on its impact. This is a very dark path we should nip in the bud."],"points":238}]