[{"text":["Smart rings’ ultra-precise movement tracking take wearable technology to the next level","I'm getting tired of making sure everything is charged.","Watches, then rings, then earrings and finally butt plugs. Outta sight!","It's a load of crap nonsense. Noone is saying anything about finger movement tracking.","please stop inventing more e-waste for the sole purpose of harvesting private data. what do i need a smart ring for?","","Whatever these rings end up doing please let them passively charge. Idc if it's solar or thermal or mechanically somehow but please don't make me take it off to charge more than once a month. Preferably I'll never have to.","Any editor who allows the phrase, “to the next level” deserves to be fired.","Noone wants these things. Ad posts here wont help.","Put it in a different box, without the manual and give it to you girl on Valentines day. If you have any suspicion about the embroidery workshop she goes to every friday evening.","Garbage.","What kinda dystopian nonsense is this?","I much prefer meta's wrist mounted finger tracking solution","Perfect for trusting couples","I was thinking more like gps enabled, like an air tag.","Perfect fit for the modern cheating household"],"points":280},{"text":["Logitech's Mevo Core is a Micro Four Thirds live-streaming camera","Kinda neatat $1k just for the base unit though.... nah.","Blackmagic Micro Studio Camera 4K G2 is much better at $995 with true broadcast features like 12G-SDI in and out.","Can someone ELI5 what a four thirds sensor is?","I'm not sure why you would buy this when you can get a Panasonic LUMIX G100 with a basic lens that's about 3/4 of the cost of just this body, while likely offering better quality.","with less features, and for the same price, as the Blackmagic Micro Studio Camera 4K G2, who would honestly buy this?","I worked on a promo for these and they we're pretty cool. Anyone comparing them to other cameras need to understand this is not marketed to you, it's a plug and play system to easily stream/record multicam content. Think small sports, music performances, where you're not hiring someone to capture it but doing it yourself.","These micro43rds-in-a-small-box cameras can be popular with astrophotographers, just get a telescope eyepiece adaptor and then you can control the scope motor drive and take photos automatically from your computer.Mind you, I'd want to know more about this camera's spectral response and noise performance before buying one.","wow a grand for each sensor? naw no thx.","Looks like my 8 year old GoPro 5.","Did GoPro make similar camera? Size wise.","Right on time to fleece Air B&B hosts","What are the lens mount options?"],"points":229},{"text":["UK Scientists Develop Bra-Integrated Breast Cancer Monitoring System | The device tracks breast changes, boosting survival odds","<image>","Let me guess, they go on Dragons Den and the bra spontaneously catches fire during the presentation.","Nah even though the premise is good but I don't want IoT on my bra","As a man with a family history of prostate cancer - does it come in a butt plug?","Let me guess, it’s WiFi/Bluetooth enabled and there’s an app with poorly implemented security and a data breach that’s just waiting to happen. There are enough breasts on the internet, we really don’t need statistics of more.","How much does that cost?","Boob science leading the way!","Does it have a built in radiation unit for making clear pictures? Ooh, and for the USA: does it detect swelling normally related to pregnancies, so we can incarcerate mothers to make sure they give live birth?","\"Bra company explained the 36gb data uploaded was individual case, normal users usually range from 12kb to 24mb of data usage\"","That would be amazing for me because every other day when my breasts hurt I’m panicking that I’ve got breast cancer","There is no way it boosts survival odds. Early detection of breast cancer is a myth. If it were true, death rates would have plummeted when the mammogram was invented. We have a slight decline in breast cancer deaths due to survival rates increasing because of drugs. In 2016, I was told I had 30 months. I’m not dead yet.Only stage 4 is fatal. No one dies from stages 1-3. A full 30% of people with breast cancer are stage 4. That number has not moved at all. If early detection worked to prevent deaths, that number would decline.Stepping off my soap box.","Are we trying to sell breast data now?","Hey, I’m here to see the doctor, my bra won’t quit beeping","Dildo version coming soon for male user","They have my support 🤫","when are we getting prostrate briefs?","Can we men get the same thing for the balls and ring of fire ? thanks.","I’m most curious about the accelerometer applications of boob data, personally. DOA Beach Volleyball hasn’t had an entry in a bit.","But it’s Bluetooth which actually causes cancer","This great news! I took the same genetic test Olivia Munn did and like her I was told I don’t carry the gene, but after seeing what happened to her I prefer stay cautions, this sounds like a great alternative.","This sounds more like a research proof of concept than something that makes sense for mass use","will it work on my moobs?","I can't wait to never hear about this again","This should be able to detect unwanted grabbing too. Put a creep alarm in it!","So stupid","[deleted]","Given the cost of a well built bra, I can't imagine this would ever be in any way affordable or practical. Even as a medical device there are much better ways of going about this.Plus imagine the anxiety. It's bad enough out here without getting a titty alert, go to the doc, and oh, you're ovulating so yeah. Or having to cancel an alert cause you took a nap wearing the bra and your boob crept out of it.Perhaps this could be a step to a different, more practical tech, but this ain't it.","Next up: period tracking panties.This is beyond creepy","Surely there's now way adding one of these to your daily life is good for your mental health","This is not a recognized method for detecting cancer, I'm not saying it's a sham but it is far away from properly approved methods, I also imagine it's gonna be expensive, so I have a hard time understanding the use case for this. Is every woman expected to buy a boob scanner that hopefully works and use it regularly? Is that better than a visit to the doctor once a year? There's gonna be a lot of people that won't use it correctly, what do you do about that? Are you going to just trust that everything was done correctly? There's a reason why Doctors and techs perform this tests."],"points":377},{"text":["Stretchy Circuits Break Records for Flexible Electronics","I read circus three times.","this is going to be a leap in compact technology. big leap.","“A new sensor array can read Braille faster than a human fingertip”Okay why didn’t anyone tell me my fingers can read."],"points":25}]