[{"text":["AirPods Pro to Gain 'Hearing Aid Mode' in iOS 18","cut to: thousands of ios users discovering they needed hearing aids all this time","As a hearing aid user, I can’t wait for this. The sound quality on any set of hearing aids is laughable. Hearing life through a megaphone.","This is fantastic … I hope the battery life is improved also","Spy mode. As a sociopath I welcome the ability to eavesdrop undetected.","And since you could get yourself an iPhone and Airpods Pro starting at about $1000, that makes them marginally cheaper than most \"medical\" hearing aids too.","Pierce really was streets ahead. Ear-noculars are going mainstream.","This will be nice since as a Vet I’ve had to wear hearing aids since my 20’s so control the sound of freedom ringing. It having to switch out to these back and forth will be nice.","I hope than can come up with another design as well to allow people to sleep with them in and still be comfortable.","It would be great if it just let me use one AirPod without having to toggle it on each night.","Don’t they do this already?There are many setting in existing AirPod pros that help as hearing aids. You can even upload to your phone the tests graphs for your hearing from a professional audiologist.I have a relative using them and he is really happy with it.For a fraction of the cost of dedicated hearing aids it works really well.Only downside is battery life: it is very limited compared to hearing aids.I wonder what this update brings to the table.","I really hope this happens, so much emphasis is placed on augmented reality vision, but augmented reality hearing, can have actual instant benefits. From preventing hearing loss in loud places, to voice clarity enhancing for conversations. Personalized sound stages. Directional hearing. Singing in tune.","As someone who has hearing aids (currently phonak audio L90-R, Oticon opn 1 before that) I’ll be curious just how good this software and feature set will be. It may be very generic, as there is a ton that goes into actual hearing aids, the software and hardware that make them work. Either way, if it helps people in anyway shape or form it will be an absolute win.PSA, working with an audiologist and getting hearing aids was LIFE CHANGING for me and my family/friends/colleagues who “dealt with” my hearing loss. I encourage anyone who has hearing problems to look into it. You have to set your ego aside, it’s not a weakness and no one will care that you have this issue. If you don’t have the means, there are charities that can help as people donate older models as they update/upgrade.","Anything on tinnitus","Hearing aids are very rarely covered by insurance, FYI","What?","Would be great! I imagine its helps me hear people over the tinnitus constantly ringing.","As is usual, Apple reinvents something already on the market but are generally more successful doing so.. it’s why I buy the stock lol","As a person with only one ear, I would be happy if they could create single pods, because the micro and stuff don’t work very well on the left side with the right side on the box.","My friend with poor hearing tried my aeropex bone conduction headphones and found them really clear for podcasts. But we tried going direct mic-to-headset and every way we tried just had way too much latency to be useful as a hearing aid.","I can see this causing issues in schools with teachers unaware that they actually can be used as hearing aids. I see lots of stories of kids with diabetes phones being taken away despite using it to track blood sugar levels.","My husband hears better with these than his 3000 hear aids","One of my family members already uses them to abate noise so they can hear conversations they are a part of better. That + Clarity Boost should be a game changer.","I use AirPod Pros Bluetooth linked to my Eko stethoscope at work. It’s much clearer than using the traditional stethoscope earpieces with the tubing. I’m kinda looking forward to this new upgrade","I have zero faith in this. They can't even figure out how to deal with wind noise.","Will it be a simple software update? Or new hardware?","Looks like they got me. I’ll be purchasing.","I want to hear each and every raindrop.","WHAAAT?","They should fix audio drifting first","Will it be medical grade tuned for each ear, etc....it's starting to look like one of those midnight miracle aids commercials I used to see onnTV which basically amplified sound for the people with hearing issues but were not medically tuned to your ranges it was basically set to some basic ranges of hearing...even after this if you still had issues you need medical grade hearing aids...","I’m still waiting for real time captioning to glasses. If siri and dictation can generally hear and write out what you say why can’t this be used for hard of hearing?","Surprised it took this long","Will have to keep an eye on this, my mum has issues with her hearing aid, with its cost and battery, may be worth me buying it for her if it means a majorly improved user experience and quality of life.","Why bother? My Jabra hearing aids do fine and they come with a government subsidy","Cool. This’ll help me hear stuff after seeing the Crucifux back in the mid 90s.","As an HIS… this wont replace hearing aids nor be as good as them as hearing aids are programmed to your hearing loss. Yes costly but worth it.","I might finally move back to iPhone.","I misread this as \"hearing God mode\" 🤣 imma go to bed now","I have tinnitus and the transparency mode helps a lot with managing the associated hyperacusis","Intrigued to know how the software will deal with range isolation, tonal variation and loudness. If Apple have a way to replicate the software in a hearing aid, then this will be great. If they're just amplifying noise, then this is a gimmick and one which will make hearing people think \"oh, that'll help the Deaf, because they're all the same and just need it turned up to 11.\"","Wauw this is amazing","Hard pass. Mine lasted about a year. Just give me the cords. I’ve had the same corded ones for about 5 years.","My plantronics bluetooth from 2011 had that same feature 😑","I have Galaxy Buds and there’s in option in Wearable that boosts surrounding sound. First thing I thought of was how well it would work as a hearing aid. Guess Apple finally caught up?","The most overrated and overpriced product"],"points":568},{"text":["Chinese researchers turn diamonds into good conductors of electricity | Scientists used graphene, another form of carbon, but a good conductor of electricity to transform their new diamonds into conductors.","Dr. Frieze has had this technology for decades now.","Soon, it’ll be diamond wires….. make copper thievery look like child’s play by comparison.","Diamonds have always been able to conduct Electricity, they have also been used as timing chips in experiments but were too deemed too expensive to be used in commercial products, artificial diamonds tend to be easier to mass produce with a uniform consistency that nature generally does not provide and in the old days specialized stone cutters and mappings of occlusions was required to get a product consistency in natural diamonds.More Stolen Technology?N. Shadows","I wonder if they can merge the latest graphene battery technology and this and create some real cool stuff"],"points":13}]