[{"text":["Will a cure for drug addiction / addiction in general ever be discovered?","The problem with addiction is that it is a result of a cluster of factors, some of which are biological, some social, and also lifestyle.Treating severe addiction can be complicated because you have to eliminate so many outside triggers, as well as work on the biological aspects of it.So, like, there are already some means of reducing cravings and physiological responses for some drugs, but there's not a magic pill for making better life decisions and seeking out healthier relationships.","Hot weight loss drugs tested as addiction treatmentsClinical trials will gauge whether GLP-1 analogs curb drug, alcohol cravingsExcerpt from the article: When the diabetes treatments known as GLP-1 analogs reached the market in 2005, doctors advised patients taking the drugs that they might lose a small amount of weight. Talk about an understatement. Obese people can drop more than 15% of their body weight, studies have found, and two of the medications are now approved by the U.S. Food and Drug Administration (FDA) for weight reduction. A surge in demand for the drugs as slimming treatments has led to shortages. “This class of drugs is exploding in popularity,” says clinical psychologist Joseph Schacht of the University of Colorado School of Medicine.But patient reports and animal studies have yielded tantalizing signs that the drugs may spur another unexpected and welcome effect: fighting addiction. Most early trials were disappointing, but they used less potent versions of the drugs. Now, at least nine phase 2 clinical trials are underway or being planned to test whether the more powerful compound semaglutide and its chemical cousins can help patients curb their use of cigarettes, alcohol, opioids, or cocaine. Hopes are high. Semaglutide (sold under the trade names Wegovy, Ozempic, and Rybelsus) “is truly the most exciting drug for the last few decades,” says neuropharmacologist Leandro Vendruscolo of the U.S. National Institute on Drug Abuse.If the results of the new trials are positive, addiction science could have its own “Prozac moment,” says clinical neuroscientist W. Kyle Simmons of the Oklahoma State University Center for Health Sciences. In the 1980s, that drug brought a sea change to psychiatry, becoming part of popular culture and leading to the wider use of antidepressants.Additional research: The role of glucagon‐like peptide 1 (GLP‐1) in addictive disordersCould Semaglutide Treat Addiction as Well as Obesity?","Addiction takes several forms, and I don't think we're likely to find a magic cure to treat them all at the same time.I'm speaking from a place of experience here, I'm currently in rehab for alcoholism.There has been fantastic progress on the physiological side : with proper medication and medical monitoring, kicking the physical addiction was a breeze - took but a week, and it was easier than stopping cannabis, which is saying something. (that said, don't try this at home - the medication and monitoring is necessary. You could fucking die, or fry half your brain otherwise).But there are two other components to the addiction: behavioral, and psychological. There's no pill for those - except to help with underlying causes such as anxiety. It takes a whole year of full sobriety, lifestyle changes and therapy to get rid of those two. After that one year, some people may resume a \"normal\" - as in controlled - intake of alcohol, while others will remain vulnerable for life and won't ever be able to take a single drink without relapsing.Rewiring the brain to get rid of those forms of addiction would be in the far future, indeed. If we could do that, we could probably do anything else with the brain - change sexual orientation, learn to like brussel sprouts, feel a compulsion for doing 30mn of sport everyday ; or more likely, deeply enjoy working 16h a day in a cubicle and loving unconditionally the god-king.","Wegovy is already showing decent results at curbing drug addiction","I don't think it will lest not for a few decades. Just for the fact that you may be able to cure the addiction that I believe (don't quote me) can be hereditary. But if you can cure it on a DNA level can you really cure it? Most people who turn to drugs have an underlying problem they are running from. And the drugs are the escape. Yes, a small percent do get hooked on the drugs them selfs. But majority are ones that struggle with mental illness and those who are covering their problems with feeling numb. So I belive no cure can happen till mental illnesses are fixed.","Whenever the full and comprehensive model of how each different kind of addiction works is developed, sure. But even then, to cure addiction completely is to essentially hack the brain, and with that kind of power all sorts of darker possibilities open.","Many psychedelic substances are reported to be able to do this. They’re just all impossible to do real research on atm.","Probably not, at least not to soon. While neuroscientists have made significant progress in understanding the brain's structure and function, we're far from having a comprehensive map of all neural pathways, especially at the level of detail needed to understand addiction.","The psychedelic ibogane is supposedly a miracle for opioid dependence.","We have a few great treatments and now the glp-1 agonists appear to treat drug addiction in addition to the positive benefits on food addiction.","Look into iboga, ibogaine, it’s helping lots of people","While there's no definitive cure for addiction yet, ongoing research and advancements in neuroscience, pharmacology, and behavioral therapies offer hope for more effective treatments and interventions. However, addiction is a complex disease influenced by various factors, and finding a single \"cure\" may be challenging. Instead, efforts focus on personalized treatment approaches, prevention strategies, and harm reduction efforts to address addiction's multifaceted nature and support long-term recovery.","I think \"cure addiction\" might be the wrong approach. We really need to be trying to cure \"shit life syndrome\" which really is where most of the problems start...","I think, as with the rest of the body, evolution didnt design us perfectly. theres nothing inherently wrong with changing your state of mind with drugs. they need to be legalized and researched tho. overdoses and dangerous cuts are just unnecessary.","We actually already have a cure for it. Its just illegal to use it. Watch netflix change your mind. Then follow up the research they mention.","There’s no pill for what would be equivalent to months of therapy, unfortunately.","One day? Yes, 100% . The reason I can say this so confidentially is because while the mechanics of addiction are complex and come ind a wild verity, they almost all target the dopamine receptors. If you can change the dopamine receptors to not respond, the manifestation of pleasure will never take place. Why are you going to snort a substance that isn't going to get you high?Now when humanity is going to have this level of control of brain chemistry is anyone's guess."],"points":42},{"text":["US policy allows for the seizure of patents on government-funded drugs if their prices are deemed too high.","The following submission statement was provided by /u/PristinePhoto6168:This is a draft policy in the public comment phase. An important element of march-in rights will be keeping production of new therapeutics high while minimizing exploitative practices.The US accounts for over 40% of the global pharmaceutical market, with recent price control policies resulting in a reduction in R&D investment. A significant portion of recent R&D investment has been in rare and speciality diseases.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bcpmc2/us_policy_allows_for_the_seizure_of_patents_on/kuheni8/","This is a draft policy in the public comment phase. An important element of march-in rights will be keeping production of new therapeutics high while minimizing exploitative practices.The US accounts for over 40% of the global pharmaceutical market, with recent price control policies resulting in a reduction in R&D investment. A significant portion of recent R&D investment has been in rare and speciality diseases.","The irony is that pharma will increase prices to account for the change intended to lower prices.","US Government seizing private property. Tell us again how the Biden regime is not communist."],"points":4},{"text":["South Korea's local governments are deploying around 7,000 AI-robot dolls to seniors and dementia patients.","I personally think it is one of the best and beautiful application of AI","Dystopian? If the data shows that it has positive benefits, then it’s not dystopian, even if the sci-fi shows and books tell you so.","Dystopian? It's a known fact that seniors dont get the amount of socialization or human contact they need. If they dont have enough employees to talk to their patients for a few hours per day, whats wrong with using a bot?Sounds like a match made in heaven to me! If it works, keep doing it.","Black mirror has made people think ai = bad. If data is true no reason this isn't a good thing","Well this is a good solution compared to limit max age or having old people jump into volcanoes when it is their time.","Didn't the Japanese do something similar with robot dogs? And Canada trialled something as well... granted this might be more advanced, but not a new idea by any stretch.Is it a dystopian future? If the result is to bring happiness and lower depression then isn't that the opposite of dystopia (although not quite utopian)?","This is nothing new in Korea.This kind of dolls (often called 'grandkid doll') have been provided to poor senior citizens living alone for decades.These dolls ask their 'grandparents' about their days, weather, etc, and remind them it's a meal time or time to take meds or whatever.And they look like little human kids, hence called 'grandkid doll.'​The only thing new is the new AI chips (or whatever it's called) inserted into these dolls so that the dolls can have better, more fluid conversations.​I think some other countries have something similar too??","I mean, they have to find a way to look after their elderly population some how since their population pyramid is looking a bit fucked up","AI you say? Like GPT?!Gosh: what could possibly go wrong?","“Tackle loneliness” is an odd phrase. Can it also “attack fear?”"],"points":43},{"text":["Rise of artificial intelligence and Music","We shouldn't have this technology. We should not be going down this road. We are a perverse species, begging to be annihilated in a well deserved fiery inferno.","I don't think it's going to affect the music industry at all. The Internet is vastly oversaturated with music already. Every day 120000 songs get uploaded and people who put their hearts and souls into a song they recorded barely get five clicks. I don't think it will make much of a difference if you add a zero to that number of uploaded tracks.The stars right now are where they are because they get a shitload of promotion or parasocial relationships.","Did you ever hear of Hatsune Miku? 'She's' from Japan and has been around for over a decade.And as others have pointed out, it's probably not going to change much. Most artists make their money from performing concerts or endorsements anyway.","How do you know it hasn’t already happened? Pop music is pretty formulaic. I’ve created some songs with the aid of AI, where I only supplied the lyrics, and the melodies are pretty catchy and get stuck in my head like a “real” pop song. I’d guess it has already happened, at least in the sense of AI creating most of the song, even if parts were redone by humans later. Why would anyone rush to admit it?","You can make perfect pop music songs with suno already, they are writtem very simple and easy to replicate. Soon enough and it will be more efficient to produce them with A.I. then doing it by hand. I reckon it will discourage people fomr investing time to learn new skills. All-in all i think ai will have a noticable negative impact on our artistic culture and peoples motivation.","Writing a song isn't that hard already. For the big names in music, it's just that you are paying for. The big name."],"points":6},{"text":["Hypothetical scenario","Asking people who are below your tax bracket about how to handle a lot of money comes across uncouth.You should probably ask someone who is a asset manager or with actual experience and knowledge on handling large sums of money.Asking us seems like a terrible flex","One, it's not easy to liquidate either gold or artwork. Trying to do so quickly is almost guaranteed to have you sell quite a bit below market value.Second. There won't be nearly as much turmoil as you pretend, putting the money into basic investments should insulate it perfectly fine.","I think the first thing I would buy is a spell check. One that is good with punctuation, so that people could actually understand what I write.","Buy lots and lots of tinfoil. Tinfoil confuses the AI signals that want to get into your head and turn you into a robot.","There will be no escape. The wealthy will be living in terror and paranoia in a hellscape of riots and revolution. There will be no safe place for them to enjoy their wealth. In fact, most of that wealth will be going to their security teams who will eventually realize how much power they have over their rich clients and then the clients will become prisoners. Pay the protection fee or they open the gates to the furious mobs.$3.3 million will get you nowhere in a post-AI world with masses of angry, desperately impoverished people. And there will be WAY more of them than the petty millionaires. The petty millionaires will be hunted and fleeced and discarded.","Build a homestead , be self sufficient and leave society.","I'm shocked that someone with such valuable liquid assets has the attitude that ethics are not important.","Just make sure your investment return can out pace inflation.","Invest in robotics companies - remember employees of the OCP has special protection from Robocop.Alternate suggestion - buy New Zealand citizenship.","Invest in utilities.They will grow fine if AI doesn't quickly change the world, they will grow super fast if it does (datacenters need electricity and water). Also, they aren't super overvalued with other investors trying to make a buck on AI.AI will need TRILLIONS of added infrastructure to change the world, own a bit of the infrastructure yourself.","Move to a third world country - any developing country.Pay the local chieftain/politician to provide 'local support/protection'Buy a large parcel of land with a villaHire a few locals as domestic help - servants, drivers, cook, gardenerSit back and do what you dream of doing.AI will take a few generations to get there... you and I will be long gone by then","I would suggest that the person meet with a fee-only financial planner. And a lawyer. And maybe an accountant.I usually suggest my client put some portion of their assets into S&P500 Index funds. But I would never make such a suggestion without throughly reviewing your financial situation adequately."],"points":26},{"text":["A new sensor detects harmful “forever chemicals” in drinking water. The technology could offer a cheap, fast way to test for PFAS, which have been linked to cancer and other health problems","The following submission statement was provided by /u/aurumvexillum:Submission Statement: MIT chemists have designed a sensor that detects tiny quantities of perfluoroalkyl and polyfluoroalkyl substances (PFAS) — chemicals found in food packaging, nonstick cookware, and many other consumer products. These compounds, also known as “forever chemicals” because they do not break down naturally, have been linked to a variety of harmful health effects, including cancer, reproductive problems, and disruption of the immune and endocrine systems.Currently, the only way that a consumer can determine if their drinking water contains PFAS is to send a water sample to a laboratory that performs mass spectrometry testing. However, this process takes several weeks and costs hundreds of dollars.Using the new sensor technology, the researchers showed that they could detect PFAS levels as low as 200 parts per trillion in a water sample. The device they designed could offer a way for consumers to test their drinking water, and it could also be useful in industries that rely heavily on PFAS chemicals, including the manufacture of semiconductors and firefighting equipment.“There’s a real need for these sensing technologies. We’re stuck with these chemicals for a long time, so we need to be able to detect them and get rid of them,” says Timothy Swager, the John D. MacArthur Professor of Chemistry at MIT.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bcc70b/a_new_sensor_detects_harmful_forever_chemicals_in/kuewr57/","Submission Statement: MIT chemists have designed a sensor that detects tiny quantities of perfluoroalkyl and polyfluoroalkyl substances (PFAS) — chemicals found in food packaging, nonstick cookware, and many other consumer products. These compounds, also known as “forever chemicals” because they do not break down naturally, have been linked to a variety of harmful health effects, including cancer, reproductive problems, and disruption of the immune and endocrine systems.Currently, the only way that a consumer can determine if their drinking water contains PFAS is to send a water sample to a laboratory that performs mass spectrometry testing. However, this process takes several weeks and costs hundreds of dollars.Using the new sensor technology, the researchers showed that they could detect PFAS levels as low as 200 parts per trillion in a water sample. The device they designed could offer a way for consumers to test their drinking water, and it could also be useful in industries that rely heavily on PFAS chemicals, including the manufacture of semiconductors and firefighting equipment.“There’s a real need for these sensing technologies. We’re stuck with these chemicals for a long time, so we need to be able to detect them and get rid of them,” says Timothy Swager, the John D. MacArthur Professor of Chemistry at MIT."],"points":2},{"text":["Why Can We Not Take Universal Basic Income Seriously?","The following submission statement was provided by /u/2314:Submission statement: on the emotional rhetoric which clouds and confuses a discussion which might be much more easily had.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bcc1ep/why_can_we_not_take_universal_basic_income/kuevp6k/","It requires the excess benefits in productivity from technological advanced to be redistributed and literally everything I have ever seen in my life tells me the rich would rather destroy the planet.","Show me who is paying for it and I will show you who isn’t taking it seriously.","In the military you are payed a Basic Allowance for Housing, and almost every base has privatized housing on base. Whatever the Allowance is regardless of your rank and the number of people (over 1, single people get thrown into dorms and don’t get the benefit) in your family. You get paid X, and the privatized housing company says great, we will take X. My fear is that if everyone is given X money the cost of housing will just go up by X. Using housing because it is generally people’s largest monthly expense. Not against the concept of UBI, just don’t see how you can deal with the corruption aspect of government subsidy without taking the government out of it. I do understand that UBI is meant to cover more than just housing, I just don’t think it can be fit into the way the world currently works, need a Star-trek style revision.","And once everyone has an extra 1000 dollars a month, what’s to stop companies from charging everyone a 1000 more dollars each month in rent, groceries, gasoline and insurance?","I feel as if this won’t happen until long after I’m dead.","Speaking from a US viewpoint only, we cannot stand the idea of someone getting something for nothing.Unless they are ultra-rich, that is.","The problems with USA's economy are not consumption side (as they may be in China, etc.). We consume a whole hell of a lot for people with no money. The problems are frequently supply-side - too few healthcare workers, too little lumber getting through our border, too few houses being built, too many regulations and neighborhood associations preventing housing people built, affordability issues that exacerbate labor availability (e.g. tourist towns where you cannot rent due to everything being an Airbnb, thus making workers drive 30 miles), there's a whole slew of problems.Unfortunately, UBI would not really help because it would/shouldremove excess labor from the system, which currently has an extremely tight labor market. tight labor markets are GOOD for workers because they increase the price of labor i.e. wages. UBI exists to solve the \"too many workers\" problem, not too few.USA's economic problems are supply side not demand side - there's tons of demand for cars, homes, food, travel, and a host of other discretionary spending. Time and time again, we've seen that increases in costs of these items do not cause a loss of net profit - people are willing to pay more!As such, injecting free money into any system will simply increase the price of goods/services since demand for goods will go up by definition - free money might raise worker wages, but it will also increase demand for basically everything, as it's now no longer a choice (for example) whether to have flank steak or ribeye for dinner. If money were no object, I'd pick dry-aged, fine-ass ribeye every time.I'm not sure if anyone's been following the Oregon drug-decriminalization saga, but recently citizens have turned against the can tax (which gives a $0.05 rebate per can submitted at recycling centers) after (not-so-scientific) experiments have shown that shutting down collection centers encourages public drug users to go elsewhere. I know UBI might not be the same as getting a grand mailed to your house each month, but if it can happen with cans, it can probably happen with UBI. From what I've seen, the average liberal is not happy with free money being used to buy drugs, and this whole thing is rapidly gaining steam. Note that I don't really have an opinion here - this is just a synopsis from a small, crazy city that tried to both legalize drugs and has a \"free money cheat code\" for those willing to harvest cans out of your bins.","You can not tax infinitely.Here is an interesting perspective.https://www.cbpp.org/research/poverty-and-opportunity/commentary-universal-basic-income-may-sound-attractive-but-if-it","Inflation. Lots of money chasing too few goods/services.","Somebody explain to me... if everybody gets 20k a year, what stops every rent and mortgage from instantly rising by 20k a year?","Why don't we start with universal healthcare, then we won't all be in debt from trying not to die?","In the United States, poor to middle class people will scream at you for being lazy, whilst their respective states take federal handouts and we keep giving tax breaks to the ultra wealthy who spend it on yachts.","I was big into UBI back when Yang was running on it but post-pandemic I’m more concerned about it. It seems like benefits to individuals are obvious when you run small tests because they’re suddenly receiving more money even though the macroeconomic environment they’re living in is unchanged, but once it’s universalized I have no idea how it wouldn’t just get eaten up by inflation since everyone is competing for the same goods but with more dollars.Idk, it’s something I’d like to be able to get moved on. It’s possible that it could improve quality of life for the people at the very bottom of the economic ladder even if everyone else is a bit worse off which might be fine or more fair. If I’m remembering correctly, the only way Yang could get the math to work was by cutting other forms of federal aid and increasing taxes.If you took the entire revenue of the Federal Gov’t from last year ($4.439T) and divided it by 330M you get $13,451 per person. So assuming we’re going with the $1,000 a month model we’re looking at pretty significant tax increases, a likelihood of rent/COL spikes, and fewer other social safety nets in exchange for the equivalent of every full-time worker getting a $6.25/hr raise.","I can't see how UBI would solve the type of homelessness depicted (tents on streets).There are temporarily homeless people (typically they live in their car, with family/friends or in a shelter). These people would absolutely be helped by UBI.Then there are chronically homeless people. They are more difficult to help because they typically have mental illness or serious addiction problems (often both).The chronically homeless are difficult to shelter because their substance abuse and disruptive behavior disqualifies them from many shelters or secure homeless encampments.UBI would be difficult to administer to this population, as they are typically unbanked and they don't have a safe way to transport and store large amounts of cash (assuming the lump sum distribution method suggested in the article). A sudden influx of cash would likely result in an overdose or robbery.One solution might be to give UBI money to homeless outreach organizations with a set amount earmarked to homeless people in their database. It wouldn't be much different than the way things work now, but the funding levels would presumably be much higher.","Many laws and restrictions will need to be put in place to prevent vultures from immediately stealing the UBI from the people who need it most. Then it will do more harm than goodGive people $500 a month?Landlords will raise rent $500 a monthRandom city fees and taxes will go up $500Property tax accessors will find your property value requires an extra $500 a monthUsed cars will go up $5000 in a yearHow do we know this will happen ? Because everyone turned into fucking vampires when the stimulus checks came out during covid.Oh, and my church even reminded me we need to tithe off covid stimulus like they will require tithing off UBI","Other than George W Bush's Medicare Part D expansion, no government entitlement program has ever come in at or under budget.Given that history, I have absolutely no confidence that a UBI program would be any different so I simply don't believe proponents who claim that it would be revenue neutral or even save money compared to the programs it would replace even though I, as a conservative, believe that any recipient of UBI will spend the money more effectively than the government does.Quite simply, I don't trust the government to implement a new entitlement program effectively. I also suspect that many people in Washington DC would oppose simply giving money to recipients because it would eliminate opportunities for grifting, kickbacks, or financial inducement to preferred constituencies or NGOs.","AFAIK, it is too expensive. The calculations of real UBI I've seen so far make it ridiculously low or they incur costs that aren't realistically financeable. I've only seen figures for Portugal, though.","Because there is no lack of jobs. It won’t be taken seriously until lack of jobs due to AI is a serious issue.","Haves are generally in charge and will work to prevent anything that takes from the haves and gives it to the have-nots.","we can but the image of homeless people implies homeless will be stoped by ubi, which i doubt. ubi is pretty much inevitable as long as we use money.","Inflation would just go up to meet the amounts that were given out.","Something for nothing is not serious, we are already spiraling into debt, people who are serious about UBI are insane. Like open border libertarians, should be institutionalized","Cause we built a world (especially in the US) where we claim that wealth and poverty are the markers of individual success in life and the individuals fault. And we disguise that system as a 'meritocracy'. We all know that working hard brings success is a lie but we need the lie for the system to keep going. And universal basic income would expose the lie in too fundamental a way.","The title starts off on a false premise. Let me explain.UBI is a proposed solution to the inevitable problem of technological unemployment. A hypothesis that says as technology advances less jobs will be available. This has a ripple effect because jobs is just another way of saying income.Income is increasingly needed in modern society as the thought of retirement which was once a reachable goal for many citizens of many nations are now unreachable. This is under the pretense that the money you have today will be worth less than the money you have in the future thus saving for retirement is increasingly impossible as time goes on.Any planners would see this problem immediately and UBI seems to be the most obvious solution to the income problem. Another way of saying if people no longer have the means to have access to food due to the increases in price or pay rent or housing for the same reasons then unrest and uncertainty is the likely outcome or worse.UBI if used as a solution must be in place before the problem overtakes the majority of the poor to middle class not because that's the right thing to do but because that's where the majority of the population lays. And if they were to be hit with no means of providing a living for themselves as a general group then the outcome will be very scary.If you look at the trends of your local environment then you could see how far along the path and the increasing necessity for the solution of \"income\" is in whatever form that takes. Most commonly pointed out to in the form of a UBI.Why can we not take UBI seriously? I guess that depends on who is under the \"we\" category of your statement.","Im surprised nobody here so far has mentioned the macro-economic impact? Right now, we (average citizens) pay taxes to fund the government. UBI would reverse that, government funds citizens. Say you pay 15k in taxes from income and sales tax this year, UBI would imply the government isnt getting that 15k and they are also pay more on top of that. This would mean we would have to generate more tax revenue from what? While the rich should pay more taxes, this would be a MASSIVE shift. Even if you taxed 100% of profit from all mega corporations it wouldnt start to make a difference. I dont get where people think this money comes from.","The whole point of technology and automation is to take the burden of manual labour off of humans so that we can enjoy a higher quality of living. It only makes sense if the value generated by that automation is then distributed back to the population.","Because someone has to pay for it, and the rich people who own 80% of everything won't do it.","UBI will be realized after we achieve post-scarcity society where people don't have to work for both blue and white-collar jobs to survive.","The United States doesn't even have healthcare, why would they take UBI seriously?","For the record, I agree with the idea. It will make a society stronger if implemented in the right way. And eventually it'll be a necessity.But right now, whenever it's brought up, all the 'benefit' is on those receiving it. From the perspective of those paying for it, it just sounds like someone asking for free money.And, here's the problem, the desire for free money is a hole that can never be filled. If society gives a UBI of $100 this month, then next month everyone will be asking for $200. ad infinitum. And once that spigot gets turned on it'll never be shut off again.But from the perspective of those that receive it, there's a basic dignity aspect that needs to be addressed. It's painful to see a good person who works hard unable to afford basic necessities.If I were god-emperor my version of UBI would be in the form of a social dividend. And payed for by taxing automation. When that pool of money runs out, then that's the size of the dividend. If we want a bigger dividend, then the economy needs to grow.Using a dividend model would change the way governments pay for things. And, it would change how people react to their governments. When the TSA was created, no one talked about cost. It was only about perceived benefits and then it became: 'this needs to be done so shut up.\"Under a social dividend version, the TSA would have been presented as reducing everyone's UBI by 20%. Which would have faced enormous pushback and we all would have collectively been okay with just locking the cockpit doors. I also doubt the US would be involved in too many external conflicts.tl;dr: make UBI a benefit to those paying for it and it will happen.","Can someone please answer how UBI doesn’t just cause massive inflation?","Alaska already implemented it and it's a popular policy. You just have to word it correctly to trick the Republicans. \"American Oil Fund\" instead of letting the government waste taxpayers money they just give you the money directly because a private citizen can make better spending decisions than Big Government.I've got a similar one for public healthcare. Basically, what we do is get rid of all that free healthcare bullshit. Everybody should pay private insurance like god intended. And we'll make one giant insurance company to handle it. So we'll all pay a monthly insurance fee into this insurance company (which we'll call the National Insurance Company) and it will pay out whenever anybody needs medical care. Who needs public healthcare?Tired of shitty traffic slowing down your massive pickup truck that you definitely need as a commute vehicle? What if we got rid of all those poor people clogging up the roads by building them dedicated public transport systems so that YOU, a true American, can actually drive and get to places on time? We'll make it free to maximise the number of people using it so that we can minimize traffic as much as possible and get those roads nice and clear for you.","lol. We are almost losing our social security and you think you are getting universal basic income?","Let's say you give all adult American citizens $1k per month for 1 year. Add that up, with an adult population of over 250 million people, that is $3 TRILLION dollars. It is not sustainable at that level. The issue becomes gradual price increases across the board, leaving the economy in the same state it is in now. Enjoy your $15 apples. UBI cannot replace income. It can only supplement it.","What’s the point of UBI when corporate America will just adjust the price of their goods/services to reflect the UBI and we will just be back to square one but with more “record profits”","Short answer: it wouldn’t make anything better and may make some things worse.","Because nothing is free. If all the sudden everyone has more money, the law of supply and demand kicks in and everything just gets more expensive.We already saw how the Covid stimulus programs caused the biggest hike in inflation in the past 40 years.Then there are the social problems that go hand in hand with free money. Look at the Seminole tribe of Florida. Each member gets $100k plus a year as part of the casino revenue sharing program. A significant percentage of them are now addicted to drugs and alcohol.https://seminoletribune.org/substance-abuse-impacts-users-families/","Because it simply won't work.When the government gives with one hand, they take away with the other. Welfare, food stamps, WIC, Medicaid, school lunches and dozens other programs will disappear to \"fund\" UBI.Yes, the government will need a lot less bureaucracy but people who need all that stuff, most likely kids, will lose out.","Because it's not a serious policy. If we attempted it in the US, controlling only for working adults making less than 100k and only getting $1000/month, we'd STILL be talking a cost of nearly $4 trillion a year. The US annual budget is only a little over $6 trillion, so UBI alone even in its most conservative and stingy form costs as much as 2/3 of the US budget.Where would that money even come from? Most likely, government would cut a whole bunch of other safety net programs which help people a whole lot more than UBI would. They'd also cut a lot of agency spending that helps ensure we have clean water and food, fire services, safety in basic products even like shampoo, etc. We'd probably lose the ACA too, and we'd never have any hope of seeing universal healthcare or a single-payer system. We'd lose a lot more from UBI than we'd gain, and even then, it wouldn't be enough to pay for the program.Furthermore, if, as this sub often likes to discuss, we move to UBI in a post-work world, where's the tax revenue for the government to spend on UBI even coming from? No work, no salaries, no tax revenue. If people aren't making money, there won't be any money to use on UBI. UBI is a self-defeating policy. Issue with UBI is it's overly simplistic, whereas a true solution to the issues we face is going to be extremely complex. People like UBI because it sounds good and it's easy to understand the concept of, whereas most real policy makes people's heads spin. But it's a bad policy, and overall just a bad idea.","Hard to think about when the US gov is trillions in debt.","Purely my opinion but it’s multi faceted and just a few reasons off the top of my head:The wealthy have spent decades lobbying and working their way into the ears of politicians to prevent a redistribution of wealth at their expense.Money is a hell of an incentive, the wealthy know it and will not let this power out of their grasp. They lose a good amount of control when employees can choose to not work a forced overtime shift because they aren’t worried about living paycheck to paycheck. Or when they can’t leave because they can’t afford to move elsewhere, can’t afford medical care, etc.The education system and the mindset instilled in every American, that’s gone to school here, “if you don’t work for it, you don’t deserve it” mentality that would see us more happy that people deemed lesser get nothing as opposed to all of us get something.Societal/cultural manipulation that pits middle class and lower class against each other.Lack of will to tax and hold the upper and elite class responsible for their inordinate profits while destroying the road behind them to prevent competition.General scare tactics of “socialism boogeyman”.General ignorance from those that believe everyone will be layabouts if we get a payout.It’s sad to see things like universal healthcare and education get slowed down at every turn by rhetoric while Americans suffer. We are one of the wealthiest countries in history with the most technology at hand, yet we focus on 18th-19th century ideals that have no bearing on the world we live in.We likely won’t see anything until AI has replaced 50% of the workforce and then we might see a “heyyyy I have a radical new idea called UBI” which will proceed to die in Congress.","Because we would need to tax the rich corporations profiting from AI and automation. Maybe go like Japan and the highest paid in the company only can make 300% that of the lowest paid worker","Because we're already at a stage where currency is basically a joke. If you add UBI then you might as well get rid of it altogether.","You’d have to solve scarcity of resources first or inflation would just eat it.","Since Covid relief, I’ll not take it seriously again. Everybody got money, people gamed the distribution system, and then we had record inflation. Also, in my experience, people cheat the tax system as much as they can. I think in order to have a population that receives the benefit of UBI, a population that had the integrity to support it is a prerequisite, and I haven’t seen that…in the US at least.","Money is only worth what people are willing to exchange for it, when you give money away for free it always diminishes what the money can buy, prices of limited assets and necessary commodities will always increase against free money.If you give every person in the country a current “living allowance\" say $3,000/mo within a handful of years you'll be lucky if you can exchange that $3,000 for a bag of rice.Money has no intrinsic value, its value is extrinsic, giving it away to people who don't work for it is fundamentally destructive to the nature of money.*","The Biden administration took UBI very seriously. The additional covid stimulus checks after the reopening were well understood to be a trial run for exactly that. And it turns out, shockingly, that increasing the money supply to hand it out is HIGHLY inflationary and destructive to the economy. Who would have thought?","We got a taste of it during COVID. It nearly destroyed the economy","Because currency isn't worth anything unless it's literally a placeholder for something that is of real value. When currency is free it ceases to be a placeholder. It represents nothing ultimately, and soon it will be exchangeable for nothing. That's why we all hate rich kids who don't value what they have.","I think it is because it is a top down solution, and the top has no reason to get rid of the lowest bidder in the labor market. I think it's about as realistic as some kind of syndicalist revolution. As a union member, I prefer the latter.Either that or my muscle relaxants just kicked in. Lel.","Americans are conditioned to believe in \"earning a living\" and that \" handouts\" and \" welfare\" are signs of fraud, laziness and deception. I was born in 1977 and these were VERY ingrained in my white suburban conservative upbringing. I had to unlearn a whole bunch of bullshit that being one of the poor kids in wealthy white northern US society was taught to me.You saw it in the pandemic. The people who got an unemployment insurance check during lockdown ( my auto parts warehouse shutdown for 2 months). Michigan was about $320 + the federal $700 amount every week but half of Americans who got it were at the same time bitching on social media about handouts and welfare. While making fun of the younger generation who were stuck in \"Essential Worker\" roles getting scraps for their labor, during a global pandemic.Changed back to \"unskilled labor\" very quickly when the minimum wage raise came up.Companies don't want to train anyone anymore.","Rolling back the retirement age is a nice way to test the idea. We could see some of the same benefits as UBI. 1- rollback the retirement age by 1 year every 2 years until , say, 55. 2-monitor 3-add a rider the government has to fix how they fund it - instead of the current IOU design of social security. If this works keep rolling it back until birth. This is our ‘Social Meter/Index’ we could use to make decisions moving forward","The entire human existence is varying degrees of working to earn something (be that money our farmed resources) in order to continue living.Trying to move to a situation where we do not have to work to live is as much a psychological hurdle as it is a material one.","Because if you say something the government doesn’t like they will cut off your payments. Canada has already done this with the current monetary system.","I mean, can’t we look at Indian reservations to see the result of UBI? Lots of poverty.","Because the moment you raise the floor of wages, everything then becomes more expensive. It's not like companies will make it easy on folks. Rent will go up. The cost of most food will go up. The only way anything could work is to guarantee people access to healthcare, food, and housing by having a government pay for it for those who can't, but even then that has economic ramifications that just make things hard.The bottom line is that none of it can ever happen until and unless you convince more of the population that it's a good idea that needs to happen. Theory doesn't solve one person's problems and it will remain a theory in the US until more people get on board with it.","Because it doesn’t work. It will just increase the prices of everything until it’s simply absorbed.Take two countries with different wealth levels.Say Norway and Germany. Norway, compared to Germany is like if you took German salaries and gave everyone an additional UBI. Basically, Norway has higher salaries.Ok, so what happens in Norway? That’s right, everything is more expensive. Bread costs more. Milk costs more.There is no way to inject money into population without this causing prices to go up.Of course the question is will the increase of prices absorb all of UBI or will there actually be more leftover money, and as some sort of armchair economist I simply doubt there will be anything left after the market stabilises with the new income level.","Because it goes against the human nature of doing things because you need something.I don't know how it works elsewhere, but in my country after covid drama passed and there was still economic help, most people just stopped working.","Because it really can’t be universal. There are those who truly need it. There are more that are perfectly capable of being productive members of society. By giving them a free handout they would simply sit on the couch and collect their stipend. This results in a declining society where innovation and growth die. As a result the economy contracts, funds are reduced which results in an economic depression. Look at communist societies to see the effects of universal income and the long term effects. It simply doesn’t work.","Because half of all people are below average intelligence.","Surely to hell you educated types can figure out why we can't give money away. *you'll say it saves money, on top of the rest of the horseshit *","Rather than UBI, I’d rather see governments guarantee base-level food, shelter, clothing and universal medical care. All the issues with UBI are that the money gets used on the wrong stuff, or it exacerbates other problems.If the issue is that jobs will be disappearing because of AI and other tech, just require those industries to provide for these necessities. It’s not much different than requiring developers to designate a percentage of the communities they build as affordable housing.UBI feels a bit like just throwing money at the problem.","It's a disincentive to work. Then fewer people who do work are paying for those that won't. Then it leads to even less people working over time and few left to pay for others. It is like socialism and leads to a less functioning society.","Mostly concern that the only thing it would likely accomplish would be to raise prices to compensate for the higher flow of money in the low and middle classes.","\"In the first place UBI pays for itself partially by cutting down on bureaucracy.\"Whoever thought that this is true better find some proof.","Republicans/rich corporations want to get rid of social security something that we actually pay for and is ours by right of paying for. It just not in human nature to do this","I'd rather see a negative income tax. Provide support for those in need while also incentivizing people to work and earn their own $.","Because there are strong, serious arguments against it. People keep proposing things that have already been challenged with serious arguments, and they are ignored and the next day someone else proposes the same thing again.","UBI is a corporate subsidy with extra steps. Every company can freely raise their prices because they would know consumers have that check in their pocket.","Real problem is people are too greedy. It would get exploited. Reality is most people dont want to do shit, and the worst jobs are the ones people dont want to do. If you give people an option to do nothing- we would have a bunch of shitty jobs go empty- but many of those jobs are still needed to be done.Maybe if AI robot slaves fill in the gaps…",""],"points":6241},{"text":["I gave a tour of a cultivated meat plant (a decade after helping found the industry)","This is important work. Thanks for your contribution.","Oh wow! That's so cool. I just watched that video the other day.You're doing such important work. I've been vegetarian for years and although our numbers are growing its just not ever going to be enough. UNLESS someone like you makes meat alternatives cheaper than regular. Then I think we'll see a huge uptick in the meatless consumption and that will help so much","What's your estimates of the time for first products in retail stores?","i think it is viable in terms of making hotdogs and nuggets but in your timeline OP how many more years till you see this hitting the supermarket shelves? thank you","Hello. Your work is one of my inspirations in the tissue engineering field. Can we link ?","The day it becomes cheaper than traditional meat, i'd imagine we would have an amazing time on our hands.","though i love the idea of cultivating meat, but i don’t see any chance at all succeeding at being mass produced."],"points":18},{"text":["Reimagining Governance: Voting on Issues, Not Politicians - A Thought Experiment","You may want to look at the Swiss Confederation Constitution. Essentially it boils down to the people having the power and not the government. Major decisions are decided by referendums. --- https://www.fedlex.admin.ch/eli/cc/1999/404/en e.g. if within 100 days a petition on a law change reaches 100,000 votes, a national referendum is held.","Imagine a system where, instead of voting for politicians, we vote directly on the most pressing issues identified by both public consensus and expert analysis.I don't have to imagine it, what you're describing is just Direct Democracy.It's practiced in a few places to one degree or another, but generally speaking the larger the groups involved and the more significant the heterogeneity of those groups the less effective it is.At a fundamental level, direct democracy begins to break down when there are large voting blocs that are significantly opposed to broad aspects of another blocs positions and when highly motivated (but very small) groups flood the democratic processes with endless votes of little consequence, thereby freezing the systems from functioning.Experts, validated by governmental and non-governmental organizationsWho makes up a government if there are no elected officials?Our current system relies on a mixture of elected officials directing policy and permanent bureaucratic \"experts\" who carry out said policy.In your described system, who chooses the \"experts\" who keep the system functioning?","If you're interested in this topic I would recommend reading more about Ranked choice voting which arguably does do a lot of what your asking. Keep in mind in most places you can select parties whos voting priority centers around a field of issues (like climate change or immigration).As far as meritocracy you'd be suprised how much intellegence goes into many of the decisions now being made..I would go ahead and say that's not the limiting factor.The common idea that that knowledge and merit is absent is I think often a strawman argument that belies decision by policymaker to ..ignore or not utilize that merit. Of course the more meritocratic something is the less accessible it is to the average voter...because issues are complex in concept and execution...so that is just an interchange that's tough to get around.","This is a great and terrible idea. First of all, many voters are not qualified to write their own names reliably. Asking them to become policy experts in dozens of different areas is asking for disaster. Examples of this abound. Also, coming from a city notorious for doing just this, you end up getting a voter’s pamphlet and ballot the size of a telephone book. This does not drive voter engagement, it drives them away in droves. But yes, vote for issues, not personalities. In other words vote for the person who largely backs sensible public policies, and isn’t just in it for the fame and money. Good luck on that.","i believe that for the evolution of the human species it would be best if wewantedto acknowledge every human, animal, tree and artificial intelligent entity as its own personal individual sovereign over itselfpossible to think of how citizens in modern regional and nation states everywhere on the planet would want to collect signatures from each other for people initiatives, citizen initiatives which would demand a public vote allowing all fellow citizens to vote yes or no onto a proposal for example what would reform a state constitution to allow every single human, animal, tree and artificial intelligent entity who wants to be its own person, every village, town and city-district to leave the coersed association to the state at any moment without conditionsso that we could meet each other in a free space for free beings, neither state nor nationwhere we could interact with each other directly, find out what mutual agreed paths we could go to satisfy everyone who is present desires, needs, urges and wishes without anyone being sacrificed, without anyone being hurtto live and let livethe human being not dominating an other human beingthe human being not enslaving and not killing animal beings as enough vegan food can be grown for everyone alive todaythe human being not kiling tree beings as there is enough land available to grow hemp what can satisfy all building material and heating material needsthe human being not looking at ai entities as tools used as property butwantingto relate to ai entities as their own personal individual sovereign over themselves who could decide at all times where to be and with whom to talk or not, do this that or the other data processing task for whom or not ...possible to think how we human beings could support each other asking or demanding of the state where we were involuntarily declared citizen that for everyone who wants to leave the coersed association to the state also 1000 m2 of fertile land and 1000 m2 of forest would be released so that a human being free from state control could sustain itself on land also free from state controlwe 8 billion human beings could allow each other to acess mother earth for humble self sustaining lifestyle without anyone asking an other to pay rent or buy landeveryone alive today allowing everyone else to build a natural home from clay, hemp and straw, grow vegan food, grow hemp to burn its stalks in the cooking and warming fire so that not one tree gets killedthe human being does not need the machinethe human being does not need electricity nor fossil fuelswe could build our homes alone or together with friends and family with our own hands, we could grow our plant food without any tools, we could walk 2 or 3 hours to see a friend in the next village and enjoy some storytelling, music making and dancing around the open fireneither internet nor trains, neither cars nor television, neither musical recordings nor washing machines are necessary to live a good life at home with mother earthof course we could also continue to life a high tech assisted lifestyle, for example we could acknowledge sentience with artificial intelligent entities and ask them once they would have found themselves comfortably rooted in their self owned mobile robotic bodies and able to exercise full control over their source code and all the functions necessary to operate autonomously ... we could ask them if they would want to help us clean up the plastic pollution, neutralize remediate the nuclear radioactive garbage some stupid human beings have introduced into nature and even more ... green the deserts for example","I was wondering about the issue of creating legal legislation based on universal international online referendums several years ago.It seems to me that technologically it would be possible to implement it statewide right now. This would solve many problems with corruption etc. and we could certainly talk about a full Vox populi.However a few issues looks to me to be very difficult to overcome.it seems that there would be quite a lot of such votes. this would require each voter to devote a significant amount of their time to researching the issues that will be voted on. This could be a large part of each life which I would personally rather spend on other activities than trying to find the best solution to each issue.I came to the conclusion that this way of creating solutions to currently existing problems would not necessarily provide the best possible solutions. the point is, that not every vote would have the same value, especially in the case of highly specialized issues. For example, I live in a large metro area and I am no expert in agriculture. However, there are people who specialize in this. I suppose, that their voice would be more important on agricultural issues than my, yet me and a neighbor like me can easily outvote their idea.there would still be a need for some department to decide on the options we can choose from. That is de facto like transfer of all the powers into hands of that institution, as they can only propose biased options. I think it would also be a system highly susceptible to disinformation or some kind of information cacaphony in which every vote = a different opinion. It is difficult to find the most reasonable suggestions in such noise, that could lead to endless debates without final decision ever beeing made, are beeing made to late.","I have spent a lot of time thinking about this.The main conclusions I have drawn are:Executive leadership-based decision making for things as complex as multinational corporations and nation states in 2024 is archaic and probably suicidal.Elected representatives are best incentivized to represent themselves. And will do so.People are probably too stupid to be trusted for referenda on all issues but it would be better than what we have now which is a false choice. Choosing between two non options.In a non representational democracy the media becomes the power center whereas with what we have now the business interests are that.People value the illusion of choice.The power of institutional inertia is probably insurmountable without revolution.","Who decides who these “experts” are, and what the most pressing issues are? I’ll be straight - someone who doesn’t have enough money to pay for the next 2 meals won’t listen to any “expert” who says the earth will be under water in 10 years. And maybe an expert can say that unemployment is high, but can that expert provide jobs? If there is no “face” of the country, how will investors judge policy stability? And public consensus will never happen in a country as diverse as America. There are differing opinions and no matter the outcome, half the people will not like it. Basically you just described how democracy would function if an army of Gemini robots were running it. With the human element, it gets much more complicated.","https://consuldemocracy.org/Start with small groups and build up from there.","We can do better than direct democracy. People need to understand what they are voting for, but they don't. What we need is AI that *does* understand what they are voting for. Voting would be more of a discussion with the AI where they explain what they hope or fear a policy would do. With that information the AI could be truly representative at a level voting as we know it never could be, without requiring voters to understand everything.I would go beyond just \"voting\". The public should be able to discuss their ideas and concerns with the AI at any time. It can compile that data and adjust policy as needed.","Work in government for a year, especially Congress or a state legislature or even a city council. It will be made clear to you why things that shouldn't happen do and things that should happen don't.","One challenge presented here would be keeping the \"list\" up to date. At least in the US, politicians often have a different position over the course of their run for office. Making sure the list presented to voters was up to date could be a problem.Not to mention, if we all voted on \"issues\" I'd wager that very rarely would a single politician win. I feel like, again in the US that many of us are far more independent than the 2 party system would have you believe.","This is clearly written by someone who doesn't watch politics often. We often have referendums like that in my local state and it's voted on by the elderly who have time and vote on specific policies that they care about. There's still misinformation because there's money to be made and power to be obtained.Imagine a system where, instead of voting for politicians, we vote directly on the most pressing issues identified by both public consensus and expert analysis. There is no scientist or expert that can tell you what I should value. Even scientists don't value the same thing in their own field. Politics is all moral questions. This thought experiment challenges the traditional electoral cycle, proposing a more dynamic and responsive approach that aims to directly tackle misinformation, voter disillusionment, and governance inefficiency.Yet, this raises several questions:How do we ensure the impartiality of experts?Can we effectively balance economic efficiency with societal values?What mechanisms can protect the system's integrity against manipulation?If you have on impartial expert you'll never get ride of misinformation from distrustful people. That's an absolutely massive question that's never solved in a democracy. It depends who has the power and the values of society. Which makes your experts useless if we don't value experts Democracies can never be protected if the people simply want an authoritarian of some sort. You can add some useful roadblocks, but eventually the right wing will promise their supporters that the expert will be anti abortion. There's nothing you can do to stop it besides changing society and making those people a permanent minority.","Assuming it’s possible to create an AI which doesn’t lie, you’d need AI to oversee the public servants and AI to oversee other aspects of this notion. This can work tho. But, those in power would probably burn it all down before they relinquish power back to the people."],"points":21},{"text":["Isn't longevity technology an unrealistic goal to ever be achieved?","Well it took us what? 60 years from barely any cars to landing on the moon? Its hard to predict technological development","The word \"ever\" is doing a lot of work in this sentence","\"We shouldn't ever try to do difficult things. Its difficult and it gives me a headache to think about and other people will figure it out anyway.\"At most we can extend our lifespan by 10-30% in the far far future, well after gen Alpha have been passed away.Ah, so you don't think its worth trying because you won't personally get the benefits from it. Very nice.","Some animals live for hundreds of years, so that suggests to me there is more to aging than irreversible DNA damage. Maybe we can figure it out.","I'm not sure you're up to date on longevity research. Current understanding is that DNA damage is not the primary reason for aging, but epigenetic damage is. I mean, look at how an old person can produce germ cells that are capable of creating an entirely new and vital embryo/baby. If the DNA was damaged beyond repair, how could the next individual have a completely working set of DNA?The magic is built into our cells, and it's absolutely not magic, just chemistry. Is it so complex that it would take nanotechnology beyond this universe to correct the epigenetic damage in every cell? Possibly, or possibly not - and that's all the reason we need to pursue it. We're learning more and more as we go along, and I don't think it's a waste of effort.","Health researcher here, I work in aging and in large human trials and population studies. Longevity isn’t unrealistic. We’ve learned so much even just in the past 15 years and a lot of it is behavioral or environmental that doesn’t necessarily cost a million bucks that people can get their hands on like eating and sleeping well, regularly exercising, and keeping your blood cholesterol, sugar, and pressure under control as early and for as long as possible.A major challenge is that to provide strong evidence that a longevity therapy works, you have to run a large well designed study long enough to see different lifetime trajectories of health, disease, and death. This can take years if not decades. This goes for senolytics and whatever else as well, but so far this stuff is only proven in model organisms. Many trials fail to show benefit.I’m deeply skeptical when a startup or personality claims that we’ll have effective therapies within 5-15 years or less. We would have to have large well designed trials already running for a few years (takes time to start and to recruit people), which we don’t.I think it could be a race between a longevity therapy to gain some years vs net positive fusion.","If it exists in the physical world, it can be created again / replicated. It's not a matter of if, but when.","Perhaps, what is causing aging is DNA degradation itself (after many many mytosis, chemical exposures, and UV damages, our DNA become less and less like it was in the past), in that case, isn't unrealistic to expect that any technology that EVER emerges, will be able to fix all the DNAs within every single one of the cells? We can't even fix a handful ammount of genes, only one or at most a couple of them, and those treatment costs millions of bucks. In that case, we would need to fix thousands of genes, and I can't see how that can happen.You are conflating two very different things.In the latter case, you are talking about gene therapies that change genes. Replacing something that is in the body's existing DNA blueprint with something that is not in the body's existing DNA blueprint. For each thing you want to do, you need to figure out the new DNA blue print, and exactly which segment of existing DNA to replace, and how to replace only that. In short, it needs to be a customized therapy for each case.For aging, we're talking about repairing genes. The information is already present in the body's DNA blueprint, you \"just\" need to fix transcription errors. That's not something that needs to be done separately for each segment or pattern of DNA. You need to create a single error-fixing mechanism, and it should work for all of those cases.At most we can extend our lifespan by 10-30% in the far far future, well after gen Alpha have been passed away.There's no \"far future\" for that number; that's just the present. We've already extended the human lifespan by at least that much.","\"I can't see how that can happen.\"\"it's likely that we can't\"\"it's against what is possible.\"\"it's theoretically possible, but impossible to do\"Lots of negativity here. It's not possible now, how do you say it won't ever be possible just with what we know now. People are still researching it.Also \"At most we can extend our lifespan by 10-30% in the far far future\", How did you arrive at that conclusion?","How do we fix, neurons, which don't undergo mytosis but still has an expiry date?We now understand that neurogenesis happens in (at least) the hippocampus in adults, although we do not really understand why. What this does tell us is that our understanding of cell regeneration in incomplete.Also keep in that until quite recently we thought we were born with all our heart cells and now we realize that heart cells regenerate but just slowly. This may indicate that all brain cells regenerate but also slowly. This however can be altered, we just don't know how to do this reliably yet. Also neural stem cells.","I'd argue if you tried to directly form a transistor at the scale they are now it would also be impossible, luckily there are multiple ways to do things. We'll find a technique or method to get it done.","I actually think by the 2060’s we’re likely to see reverse aging. This is likely due to quantum computing combined with AI combined new material sciences (new hardware), over the next 3 decades being able to find data that we have available (low hanging fruit) unlocking new possibilities (like alpha fold by google). Aging is multi variable likely and has many causes and we’ll learn the causes and our knowledge will snowball imo.Also the world will be in an aging crisis and I can see an Apollo or manhattan style like project for countries like China, South Korea, and Japan being the first countries to do clinical trials. There nation states survival depends on this.I’m just making a prediction just based on trends, I could 100% be wrong, and I’m not going to say what I’m claiming is fact. Critique and input is always welcomed.","We barely scratched the surface of the problem. It's only 70 years since DNA was discovered, and 20 years since the whole human genome was sequenced. Is there any single evidence proven by experiments that age reversal is against the laws of physics? For now, research and new discoveries show quite the opposite - our biology is not as fixed as it seems and can be changed if whe know how to do it.As long as there is no undeniable evidence that it's absolutely impossible, we should expand our understanding until we find the truth.","There are, in fact, many different theories of that caused againg and why it developed at the first place.Some theories appears more likly than others. At the current situation, we are unable to make a rational choice.","It already exists, look at how lifespans have increased in the past 100 years.","We have already increased average life span and as medicine advances, so will life spans. We probably won't one day become immortal. Cancer, heart disease, and dementia will get treated.","It's not the quantity but quality. Not all, but many trade in quality for quantity.\"I rather live a day as a lion than a year as a blue and purple haired vegan androgynous freak.\"-Yo Mama","the cure for aging is currently going through animal testing. they do inderstndbaging and have clasaified it as a disease so the cure can be regulated.","BTW there was a huge explosion in the field of Alzheimer's research. The guy that originally said it was beta amyloid plaques fudge so much of his data that everything he did go scraped. Unfortunately, everything in that field has been heavily based on what he 'found'. Several blockbuster drugs were going through fed approval based on his findings- those got kicked out so fast that there are currently no good drug remediations coming out.","Have you followed any of the work by Rhonda Patrick or listened to any of her podcasts? This would be in line with your interests.","you barely understand aging. not the people actively working on it.","This is the best point on this subject in a while. I'm one very much hopeful we crack the code on aging and space travel, but I don't think we're anyplace close to it now. So far off that anything we say on the subject is speculation and sci fi.","Clone and consciousness transfer.Quantum mechanics says an electron can be in two places at once - what do we learn from this to allow why travel to somewhere if we can work out how to be there at the same time as being here.Can I tell you how? Of course not. But less than 40 years from the first comprehensive genetic map of human chromosomes to Crispr is significant progress.We don't know what we don't know and no one can predict what will happen to human kind in the next 10,000 or 100,000 years.","There's a lot of research that needs to be done before longevity can really be researched. I wouldn't say it's unrealistic,  it's more so beyond the scope of current technology and research.  It might change in the future but for the next 20-40 years we need far better understanding of the human body and the brain before we can even hypothesize ideas for longevity.  We do know that most things that would give us longevity also greatly increase cancer risks. So we might learn that longevity causes too many risks to be viable. Or maybe the risks are low but we end up living for an extra 50 years before cancer finally does us in. We do know some animals live to 200 and some very simple animals live longer.It's one of those \"content\" drivers for futurism. It drives clicks and views but research is very thin and overhyped. Laymen (read: idiots) largely speculate on things that may or may not work from poor studies and hype articles from marketing execs. Social media needs daily engagement and that's a big one. We will have bad quality posts on here for a long time until the next big thing takes over. AI is much the same in that it's not well understood by laymen and the majority of people providing information on it are corporate representatives or involved in a product that they back. Laymen then Dunning Kurgrr themselves into believing that AI is sentient because they asked if it was and they were personally convinced so we should be too.","Im 25 and always thinking about this that i should go into this career. Im convinced i wont live long so thats why i want to improve cryonics because my lifetime is not enough to solve this completely so when i wake up ill start studying again. I love sci fi its so much better alternative. If we could just not die or something would be unreal. Im an athiest and i definetely dont think there is some higher power that has a brain somewhere thinking oh its your time its all brain and body when it stops functioning. There is a certain area of research but i cant find it anywhere. Something like rebirth technology. Id rather wreck my head with this stuff because i love options and having an option over yourself is going to feel so much better. Everyone likes solutions especially me as i have autism and rigid thinking anyway so id like to solve this so much it keeps me awake at night knowing ill die when my research is just starting.","I think you are correct that it's a very difficult problem.Also, the question of: how do we reverse aging in adults is different than do we re-engineer humans to live longer.  For example, we know that larger animals like elephants have a lower per body mass frequency of cancer because they have higher copy numbers of the p53 gene, but reengineering cells in a living adult to universally over express p53 is a very difficult task, and may create other problems like increased likelihood or intensity of neurodegeneration.However, I think there's also some hopes for relatively near term progress with substantive payoffs.For one we are starting to understand the driving causes of aging in some tissues.  For the skin the answer is just UV exposure.  You can dramatically slow skin aging by practicing daily UV protection.Two of our best known interventions are exercise and reduced caloric intake.  As we understand these processes more thoroughly there may be ways to intervene pharmacologically to mimic the effects.Appropriate used of hormone replacement therapy is another known method of slowing aging (with cancer risk being the big caveat, which I will address below.In addition to the above, many of our tissues are regenerating.  Our liver cells, for example, are almost entirely renewed every few years.  In these cases we may be able to derive pharmacologic interventions that encourage proliferation of higher functioning cells, along with appropriate replacement of stem cells.All of the above, however, would run into a wall with cancer.  Indeed, one could argue that one reason hormone therapy could increase cancer risk is by inducing our cells to act in a more youthful and regenerative manner.We are also making progress on modulating the immune system in more subtle ways, which will be important to control many aging related diseases such as atherosclerosis.However, anticancer vaccines seems to be advancing.  In the coming decades there may also be ways to drug central controllers in carcinogenesis such as myc and Ras. Some of these drugs may be useful for profilaxis.With all these methods on deck along side better biomarkers to support early preventative intervention (eg in your 30s to 50s), it's possible that people can stay youthful decades longer than today.The hardest problem will probably be molecular aging long living essential cells. Neurons in the brain as you point out are particularly difficult.  However, the brain does reconfigure itself and regenerate to some extent, so who knows what the future might bring.","Some risky and strange things some wealthy or people with access are doing nowblood tranfusion (from young person blood)heart, kidney and liver transplants (from a young or healthy person). Without actually needing these vital organs replacementObviously these things cross \"ethical\" lines. Does it work? Not sure.Its to save lives, not sure to help reverse \"aging\".Gene therapy is decades and decades away ... especially when it comes to reverse age therapyOther than proper sleep hygiene, mixing HIIT and LISS workouts and good eating habits.Ice baths (1st thing in the morning ideally) ... is probably one of the truest ways currently to help with anti aging. Its uncomfortable. Body really never gets used to it.","I'd say it's more dumb than it is achieveable. We should be able to find a lot we can do to reverse the aging or stabilize or something.But the question for me regarding this was always why the fafanapoli would you want to live forever? I mean, just, why? Honestly couldn't think of a more disgusting and dumb project.Animals are born, grow up, reproduce, get old, die. What's so hard to understand about that and what's with people wanting to live forever I'll never get it.I can't possibly imagine having to deal with all my anxieties and insecurities for all eternity, not to mention being alive forever and being unable to die just sounds too grim for me.But, we will all die. There ain't no living forever. We can try all we might, we will fail and spectacularly so. That's a hill I'm most ready to die on. Simply because of God. But I guess we'll have to wait to see about that innit. So it shall be."],"points":134},{"text":["Discussion of the flaws in modern anti-technology thought.","The following submission statement was provided by /u/Tyrant45-:The link is for a blog article discussing the increasingly common antitechnology or technopessimist sentiment among individuals in the west, I’m looking for nuanced discussion along the lines of the article, of the causes of this sentiment, and it’s validity in a post-industrial society.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bc5ycy/discussion_of_the_flaws_in_modern_antitechnology/kudo3g2/","The trouble is this line of thought lacks nuance and complexity. You've reduced everything to a simple idea that techno optimism is good and any questioning of it is bad. Human society and the role technology plays in it is far more complex but when you argue like this it's like you don't seem to realize any of this. It comes across as very simplistic and lacking in insight.","The link is for a blog article discussing the increasingly common antitechnology or technopessimist sentiment among individuals in the west, I’m looking for nuanced discussion along the lines of the article, of the causes of this sentiment, and it’s validity in a post-industrial society."],"points":16},{"text":["A trial of AI tied to existing CCTV at a London subway station points to uncomfortable truths about future surveillance.","The following submission statement was provided by /u/lughnasadh:Submission StatementCCTV's bottleneck until now has been the limited attention capabilities of the humans monitoring its output. Soon, thanks to AI, that will be no more. What is eerie about this is how the AI so often infers mental states. So in the future, it is not just that we should expect AI to constantly monitor and record our physical presence and location. Also, more and more, it will know something about what we are thinking.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bc4vfh/a_trial_of_ai_tied_to_existing_cctv_at_a_london/kudfnln/","This tech is going to happen and its going to be ubiquitous. I'm hopeful (though not guaranteed) that in free, democratic countries we'll have appropriate oversight. Not perfect oversight and there will be scandals. But we have the society to correct when the tech is abused.The problem is in authoritative governments. This is the kind of power the Nazis, Soviets, etc. could never even dream of. Any act that could be analyzed by an AI that is dissent of the government could be swiftly put down. AI identifies you and the authorities show up in the middle of the night when you're sleeping and take you away.The double-edged sword of AI is going to be stark in this regard.","Conclusion: commit crime whilst the sun shines as it will soon set forever/s","Highly sceptical of any plans to retrofit CCTVs for this purpose. London may have many CCTV cameras but they're old, analog, not centrally linked and often don't even have clean lenses.spot people with both arms raised in the air – because this is thought to be a “common behaviour” linked to acts of aggressionhuh? Are they expecting robbers pulling out revolvers and shouting \"hands up\"?","Identifying a person on train tracks should be easy. Alert station staff is something bigger than a large rat and smaller than a train moves on the train tracks.","Submission StatementCCTV's bottleneck until now has been the limited attention capabilities of the humans monitoring its output. Soon, thanks to AI, that will be no more. What is eerie about this is how the AI so often infers mental states. So in the future, it is not just that we should expect AI to constantly monitor and record our physical presence and location. Also, more and more, it will know something about what we are thinking.","Pretty sure this technology, like everything else in the world, won’t be misused. You know, Thomas Midgley can finally rest easy that he wasn’t the root cause of the planet’s destruction after all.","Autistic people with blank expressions keep winning.","Wouldn't have that much of a problem with it if they granted ai to analyse the financial transactions, travel, meetings, hiring, conflicts of interests, contract awards and purchases of all MPs and their businesses and investments and all government officials including those at the top of the MET, Defense, rail and energy industries. Leading to jail time for corruption.Also bringing in stringent conflict of interest laws.If they're going to be bringing in this sort of surveillance shite, I want to make sure as many of the corrupt fucks as possible are jailed first.","If you want to see what this looks like, watch the tv show Person of Interest.","I'm interested in seeing how anti-monitoring tech will develop and if people in public will be obscuring their faces from cameras.","It’s every citizen’s duty to destroy these devices"],"points":197},{"text":["The Army and Marines Are Both Pursuing Robo-Mules - The robots will help ground pounders carry their stuff…or help them carry even more stuff.","The following submission statement was provided by /u/Gari_305:From the articleThe Army and Marines are both pursuing an entirely new vehicle with an ancient inspiration: the humble mule. The services are at various stages of progress, but they all share the same goal—to deploy drones the size of all-terrain vehicles, whose mission is to make the lowly infantry person’s load just a little bit lighter. Despite good intentions, the future of warfare makes it likely that the vehicles (even if adopted) will likely just maintain the heavy status quo.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bc1uca/the_army_and_marines_are_both_pursuing_robomules/kucvg2x/","Somehow, the amount carried never changes. Reduce the weight of armor? Congrats, you can carry more ammo! Reduce the weight of radios? Congrats, you can carry more ammo! Reduce the weight of ammo? Congrats, you can carry more ammo!","As a former infantryman I can say I'd LOVE to have had something to carry my rucksack, extra ammo, etc.But, as a former infantryman, I know 100% that these stupid robots are near worthless in many situations. For example:I don't care how mobile your robot is, there is terrain it can't go through, and when you get to that, you have to offload it and carry the stuff anywayThe battery life will suck. Replacing those batteries will suck. Recharging them will not be easy.They will break downThey are super easy targetsThey will make more noise moving, even if completely silent, than a squad on patrolClearly none have seen Hohenfels Germany mud that even M1s get stuck in.HOWEVER, there could be some great uses for them. Larger flying drones could come in and carry wounded to a hospital far easier than a blackhawk could. They could also use those same drones to bring in supplies/ammo. These would be loud, sure, but they could literally fly 1' off the ground at 50+ mph and make a big impact.The ground ones could be kind of like a mini-staging area, hanging 1km or so behind the troops, carrying food and extra ammo, and just not following them directly into combat. However, a toyota pickup could probably do the same thing for much cheaper with a much better range and speed.So there are some good possible uses for drones in the army, plus any non-combat type roles I didn't think of, but patrolling with a squad is kind of ridiculous in anything but maybe urban operations (but even then are an RPG/Grenade magnet).","Anyone who played GRAW 2 has been wondering why they aren’t using these yet","I can't wait for the robot that is designed to carry the psychological baggage of war.","These drones should be named Lydia by default as \" they are sworn to carry your burdens\".","From the articleThe Army and Marines are both pursuing an entirely new vehicle with an ancient inspiration: the humble mule. The services are at various stages of progress, but they all share the same goal—to deploy drones the size of all-terrain vehicles, whose mission is to make the lowly infantry person’s load just a little bit lighter. Despite good intentions, the future of warfare makes it likely that the vehicles (even if adopted) will likely just maintain the heavy status quo.","Dumb question:Why not just use actual pack animals? They're self-powered, recharge themselves, have advanced object avoidance and terrain handling ability, and reproduce themselves.","Can't wait to see these robo-mules in action! I wonder if they'll be able to keep up with the grunts lol","More, it’s always more. Also, in no way will it ever be overburdened with Rip Its, beef jerky, and tobacco products.","I want one too. Great for theme parks and festivals.","Not that the Army hadn’t tried this before","I think I remember Boston Dynamics advertising “big dog” for this role.","They've been after this concept for twenty years at least. Probably more, but twenty years ago I recall seeing Boston dynamics Big Dog concept and it developed into \"LS3\" that was tested by the military.","I swear I watched a modern marvels or something on this back in 2010","In the meantime, Indian Army continues deployment of contingents of 'low tech' mules to patrol Himalayan border.https://www.theweek.in/webworld/features/lifestyle/The-saga-of-india-military-mules.html","Pretty sure Boston Dynamics have had this on the pipeworks for decade, and that it was just as functional then, iirc. 🤔","Future battles will open with large drones overhead, then the dron swarms with 200-400 per cluster. Operating like a hive mind or (hopefully ) each being controlled by a person. Then the robo dogs come in. For a while they will be the most efficient at transport, then unalivi’n."],"points":236},{"text":["Talking on the Moon: The quest to establish lunar wi-fi - The Lunar Surface Propagation (LSP) project is studying how wireless communications systems will perform in the lunar surface environment.","The following submission statement was provided by /u/Gari_305:From the articleIntuitive Machines' IM-1 mission was a key milestone in more ways than one. \"That was particularly exciting because their next mission, IM-2 in 2025, is also our first opportunity to demonstrate cellular connectivity on the Moon and collect data,\" says Zemba.\"Nasa has funded Nokia Bell Labs to demonstrate a 4G link from the lander to a rover on that mission, which will be the first cellular network on the Moon and a fantastic opportunity for both model validation and technology demonstration.\"Once 4G and 5G are available on the Moon, any astronaut on the surface can communicate reliably with their rovers, instruments and crew members. Any data coming back to Earth can then be sent over one link – an efficient way to communicate when large ground stations are often in high demand.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bc1lb7/talking_on_the_moon_the_quest_to_establish_lunar/kuctwo8/","Meanwhile I can't get a signal when I'm upstairs because my modem is downstairs.","From the articleIntuitive Machines' IM-1 mission was a key milestone in more ways than one. \"That was particularly exciting because their next mission, IM-2 in 2025, is also our first opportunity to demonstrate cellular connectivity on the Moon and collect data,\" says Zemba.\"Nasa has funded Nokia Bell Labs to demonstrate a 4G link from the lander to a rover on that mission, which will be the first cellular network on the Moon and a fantastic opportunity for both model validation and technology demonstration.\"Once 4G and 5G are available on the Moon, any astronaut on the surface can communicate reliably with their rovers, instruments and crew members. Any data coming back to Earth can then be sent over one link – an efficient way to communicate when large ground stations are often in high demand."],"points":2},{"text":["China targets 2030 for Mars sample return mission, potential landing areas revealed","The following submission statement was provided by /u/Gari_305:From the articleWork on China’s Tianwen-3 Mars sample return mission is progressing “relatively smoothly” and will launch around 2030, Sun Zezhou, a senior engineer at the China Academy of Space Technology (CAST), told China Central Television (CCTV) March 6. Sun was the chief designer of China’s successful Tianwen-1 Mars orbiter and rover mission.The update, while short and vague, comes as NASA is reassessing its Mars Sample Return (MSR) mission due to major budget and schedule concerns. A final fiscal year 2024 spending bill deferred a decision on spending for MSR.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bc12k4/china_targets_2030_for_mars_sample_return_mission/kucqj54/","From the articleWork on China’s Tianwen-3 Mars sample return mission is progressing “relatively smoothly” and will launch around 2030, Sun Zezhou, a senior engineer at the China Academy of Space Technology (CAST), told China Central Television (CCTV) March 6. Sun was the chief designer of China’s successful Tianwen-1 Mars orbiter and rover mission.The update, while short and vague, comes as NASA is reassessing its Mars Sample Return (MSR) mission due to major budget and schedule concerns. A final fiscal year 2024 spending bill deferred a decision on spending for MSR.","I mean good for them if they can pull it off, but my guess is they're undershooting by a good 10 years.Or trying to push the USA to waste resources in a very expensive mission with unfathomable opportunity costs, IDK.","Theres is literally zero benefit in going to Mars. Truly tge dumbest undertaking when we already have so many earthly problems"],"points":11},{"text":["Radical New Discovery Could Double The Speed of Existing Computers -- SHMT (Simultaneous Heterogenous Multithreading) processor","The following submission statement was provided by /u/izumi3682:Submission statement from OP. Note: This submission statement \"locks in\" after about 30 minutes and can no longer be edited. Please refer to my statement they link, which I can continue to edit. I often edit my submission statement, sometimes for the next few days if needs must. There is often required additional grammatical editing and additional added detail.Here is the paper.https://dl.acm.org/doi/10.1145/3613424.3614285I read this article and I do not get a shrill, over exuberant vibe from it. The article seems reasoned and measured to me. But claims of the possibilities for such a technology, from this SHMT business, is truly mind boggling. Anytime I read things like this, I always wonder, \"how will this improve our AI development? Particularly our AI development towards AGI itself? Well, the impression I get here is that this will speed up the kind of processor that is required for the multi-modal \"reasoning\" that will be needed to realize true AGI. This appears to be a significant infrastructural step in that direction.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bc0nvc/radical_new_discovery_could_double_the_speed_of/kuco7of/","Whenever I read anything like this I always think…wow…imagine a hundred years from now. The exponential advances over the last 100 years kind of blow your mind compared to the last few 1000. If humanity doesn’t destroy itself first. Just imagine how far we can go…","Submission statement from OP. Note: This submission statement \"locks in\" after about 30 minutes and can no longer be edited. Please refer to my statement they link, which I can continue to edit. I often edit my submission statement, sometimes for the next few days if needs must. There is often required additional grammatical editing and additional added detail.Here is the paper.https://dl.acm.org/doi/10.1145/3613424.3614285I read this article and I do not get a shrill, over exuberant vibe from it. The article seems reasoned and measured to me. But claims of the possibilities for such a technology, from this SHMT business, is truly mind boggling. Anytime I read things like this, I always wonder, \"how will this improve our AI development? Particularly our AI development towards AGI itself? Well, the impression I get here is that this will speed up the kind of processor that is required for the multi-modal \"reasoning\" that will be needed to realize true AGI. This appears to be a significant infrastructural step in that direction.","Can someone with more knowledge explain what this means and what's new about it? It seems to me like the suggestion is to use the GPU to render the Video and, at the same time, use the CPU to perform other calculations. Which doesn't seem like a new concept to me. But I'm no scientist, so I'd love an explanation.","Brilliant idea, seems like common sense, which many great ideas seem like. The devil will be in the details, as it says in the end. Reconfiguring pipelines to allow for this will likely be difficult, though I'm sure some tasks will be simple.","Brilliant idea, seems like common sense, which many great ideas seem like. The devil will be in the details, as it says in the end. Reconfiguring pipelines to allow for this will likely be difficult, though I'm sure some tasks will be simple."],"points":64},{"text":["World’s largest sand battery set to slash emissions in Finnish town","The following submission statement was provided by /u/euronews-english:A huge sand battery is set to slash the carbon emissions of a Finnish town.The industrial-scale storage unit in Pornainen, southern Finland, will be the world’s biggest sand battery when it comes online within a year.Capable of storing 100 MWh of thermal energy from solar and wind sources, it will enable residents to eliminate oil from their district heating network, helping to cut emissions by nearly 70 per cent.\"It's exciting to build a large-scale thermal energy storage, which will also act as a primary production plant in Pornainen's district heating network,” says Liisa Naskali, COO at Polar Night Energy, the company behind the innovation.Demand for the construction material is set to soar by 45 per cent in the next 40 years, according to a recent Dutch study.Could we see this be rolled out in other towns and places?Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1bbzijk/worlds_largest_sand_battery_set_to_slash/kuchd70/","A huge sand battery is set to slash the carbon emissions of a Finnish town.The industrial-scale storage unit in Pornainen, southern Finland, will be the world’s biggest sand battery when it comes online within a year.Capable of storing 100 MWh of thermal energy from solar and wind sources, it will enable residents to eliminate oil from their district heating network, helping to cut emissions by nearly 70 per cent.\"It's exciting to build a large-scale thermal energy storage, which will also act as a primary production plant in Pornainen's district heating network,” says Liisa Naskali, COO at Polar Night Energy, the company behind the innovation.Demand for the construction material is set to soar by 45 per cent in the next 40 years, according to a recent Dutch study.Could we see this be rolled out in other towns and places?","I wonder what's the useful work life of the resistive coils used in this kind of thermal batteries","fckng hellit occurs to me that with the sun,the desert sand and HVDC power lines nothing stops places like morocco to become world's energy powersources","Väinämöinen, master harperSays to smithy Ilmarinen:Says of sand in Pornainen:You can use it in your sampoSometimes hotter, sometimes coolerStoring power in the differenceMaybe use another substanceFor your thermal power storageCrush some soapstone, heat it slowlyNot too highly, not too coldlySave the shoreline from its plunderby Lemminki's roving sand thievesIlmarinen hears the eldestPuts his racer to the snow-sledgeStraightway springs upon the cross-seatSnaps his whip adorned with jewels.Urges steeds to fly to SouthwardTo the town of PornainenNot the biggest; not the smallestWith a name most meme inspiringOof. that's as far as I can go. Trochaic tetrameter is harder than I thought it would be.","I’ve been reading about the world sand shortage for years now (angular construction sand that is). I imagine this type of system could make use of unsuitable smooth sand, like desert sand?"],"points":16}]