[{"text":["I migrated my Windows to a new SSD and now I have an EFI partition showing up as my D drive, and I don't know how to fix it.","Using imgbb.com or similar, please post a screenshot of disk management (make sure the lower pane is fully visible)?"],"points":0},{"text":["CMOS fail after returning back CMOS battery"],"points":0},{"text":["How to connect camera to rode nt5 mics?"],"points":0},{"text":["PC turns on, but no display and no power to mouse/kb"],"points":0},{"text":["64bit apps not working on 64bit system (Windows 11)","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Registry hack for 24bit rate Bluetooth audio?"],"points":0},{"text":["DIMM slot latch difference, can't put the same ram into the other socket"],"points":0},{"text":["This device is forbidden","What did you do!Seriously, probably get a new device."],"points":0},{"text":["network keeps disappearing entirely"],"points":0},{"text":["BSOD K Mode Exception","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Mirror my PC screen to my iPad","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Search for remote control software for windows on the app store"],"points":0},{"text":["Last resort option fixed my problem, but... caused new problems"],"points":0},{"text":["Some Keys on Keyboard stopped working"],"points":0},{"text":["Ethernet doesn't work after switching to a new broadband provider","Same hardware? What hardware? Who installed it? Do any devices work?"],"points":0},{"text":["Scratched motherboard trying to install aio, will it be okay?"],"points":0},{"text":["How do I fix this?"],"points":0},{"text":["asus prime h610m-a d4 bios version 1603","No, you should anyway since it patches security vulnerabilities get 3202(latest)."],"points":0},{"text":["4070 Super not working"],"points":0},{"text":["Can I move old laptop HDD to my new laptop as extra storage?","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","You can add it without any problems, given that the new laptop has proper connectors for the old HDD.Just keep in mind that when you connect it, enter bios first and check the booting sequence, and make sure that the SSD is first.","As long as you set boot priority property, you should be fine."],"points":2},{"text":["V380 IP WiFi camera - dead after attempted firmware update"],"points":0},{"text":["Possible to run two distinct OS installations simultaneously from 1 machine?","No, you can dual boot between them but that'd mean a restart, you can't just live swap between running operating systems that would need to initialise the hardware at boot, something they can't do if another OS is running","I think what you're trying to accomplish is impossible without a compromise somewhere.If you want 2 OS's on the same machine, different hard drives etc, then you'll need to dual boot. But this means you need to restart the PC every time you want to switch OS.You could have 2 devices and a desktop KVM to switch between them to switch between them. This will double the cost as you'll need 2 machines and a KVM. Or if the 2nd OS is fairly light (eg a linux distro) you can run it on a raspberry pi which are fairly cheap.You can run a VM inside your machine. I know you said you don't want this but this is probably the closest you'd get to running 2 machines simultaneously and being able to switch between them.If your machine can't run a VM, you could look at running one in Azure or AWS for a cost, similar to the pros and cons of the VM above."],"points":2},{"text":["Ram for my Hp 15-R247TU Laptop.","Check your current stick's specs using cpuz. I would not mix ram."],"points":1},{"text":["TV won't turn back on"],"points":0},{"text":["Why is my CPU temp skyrocketing?","It might sound stupid but did you take the bit of plastic off the bottom of the cooler the bit that sits on your cpu if so have you checked drivers an have you looked at how your thermal paste is sitting on the top of the cpu dose it have a good spread over all of the heatsink","It could be that the pump in the watercooler has stopped working."],"points":0},{"text":["My external hard drive WD won’t appear on my computer or any recovery sofware","Attempting data recovery without proper knowledge or skills can result in permanent loss in data. Prior to data recovery, it is best to create an image of the failing drive. For important data, it is recommended to send your drive to a data recovery professional. For more data recovery help, please visit /r/datarecovery.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Seems like the disk is broken.If data is important you can take the disk to a repair shop and there they can save data.","Try /r/datarecovery ( make sure to give the drive model and filesystem used )"],"points":0},{"text":["Noice cracking while using Bluetooth Headphone/Pro Controller."],"points":0},{"text":["Manage Chrome bookmarks"],"points":0},{"text":["Random iCloud login pop up on Windows laptop on startup.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["USB-C TO HDMI OR MINI DISPLAY PORT TO HDMI","It's possible your USB-C port does not support DP Alt Mode (for outputting DisplayPort video via the USB port).Only some USB-C ports provide support for DP Alt Mode and these USB-C to HDMI adapters usually require DP Alt Mode.To make matters worse, there is no easy way to verify whether your USB port supports DP Alt Mode other than to check the computer specifications from the manufacturer's website (it will usually say something about DisplayPort video in connection with the USB port if DP Alt Mode is supported).Edit: I just looked up laptop model. It does not appear to have DP Alt Mode, but it does have a Mini DisplayPort connection which you can use to connect an external monitor (with an appropriate adapter).","Considering the age of the laptop it isn't really a given it supports video over USB-C. Does the USB-C port have DisplayPort (DP) symbol or perhaps a Thunderbolt symbol (usually a little lightning)."],"points":1},{"text":["Black pixels during scrolling a mouse","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Messenger is so loud"],"points":0},{"text":["Can someone help me with taking off school restrictions on my macbook air 2023?","Does it legally belong to you or to the school? Because if it belongs to the school, this post violates rule 8.If you legally purchased/acquired this, then the school should be willing to deactivate all their restrictions.","School computers are for school work"],"points":4},{"text":["Mouse cursor disappears in some games"],"points":0},{"text":["Pc crashing","Check the CPU temperature, just to be sure.And I wouldn't rule out the PSU. It doesn't matter how many Watts it has if it is weakened. I suggest to try with another PSU."],"points":0},{"text":["Why are my games running slow even if I have good hardware specs?","That Sonic Generations, are you running the Windows version, or its console version with emulators? 8300H & 1050 are quite old, have you checked that the cooling system is still working? Overheating can force the component to throttle down.","This laptop is NOT a beast by any means. Cpu is not so bad, but GPU is pretty weak and only 8gb ram? As others said, thermals can be an issue too if it wasn't cleaned and or repasted ever.And also some games are not well optimized.","As you wiped it, look in windows update - especially the Advanced> Optional section. There may be some device-specific instructions waiting to download.You could download a program called CoreTemp to keep an eye on the temperatures your CPU is reaching at different load levels. The ultimate fix for overheat is usually to remove the heatsink and replace the thermal paste which sits between heatsink and cpu/gpu"],"points":0},{"text":["my pc doesn’t show WiFi and Bluetooh networks","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Did you install chipset drivers? Specs?"],"points":0},{"text":["I have an Audio issue i was for a while somewhere else maybe 30 seconds it sounded normal then the songs started being distorted","this is what i was listening to i changed to other videos too and it still isnt correctthe song: https://www.youtube.com/watch?v=KHics_yhI5I"],"points":0},{"text":["Logitech MX Keys Keyboard","Check the keyboard’s batteries to see if they need replacing/charging."],"points":0},{"text":["Wifi issues on PC","Buy a repeater to strengthen your signal."],"points":0},{"text":["cmd error 605","Use the source switch https://rtech.support/docs/guides/dism-sfc.html . You need to do an in place reinstall. https://www.tenforums.com/tutorials/16397-repair-install-windows-10-place-upgrade.html"],"points":0},{"text":["Am I hacked?","Just try cleaning your mouse and touchpad.","Disconnect from the internet, it's you if it still happens.It's 99% something your end.","Change your mouse and disable the touchpad, if it still happens then you are hacked, if not then it's an issue with the mouse or the touchpad."],"points":0},{"text":["Monitor goes black when video loads"],"points":0},{"text":["Is there any free option for creating a same QR code on another website?","QRFY can be used to create both static and dynamic QR codes.In reality, QR codes are always static in the sense that the information contained in a particular QR code never changes, however it's possible to have a QR code that points users to a URL that will dynamically redirect the person to another website/URL. This allows you to update the final/destination URL the user is redirected to at a later date.If you use QRFY to generate a static QR code, it should just link directly to your website or whatever you tell it to point to and the QR code should never expire or deactivate.If instead you use QRFY to generate a dynamic QR code, this means that whoever scans the code will first be directed to a link on the QRFY website and then QRFY will redirect them to whatever your chosen URL is (which you can update later).In the case of a dynamic QR code, you are entirely dependent on the platform (QRFY) to redirect users to the correct URL and they can charge for this service. If you don't pay, they can simply decide to stop redirecting users to your chosen URL. There is nothing you can do to get around that. The QR code will permanently point to QRFY and you have to depend on them to get people to the right place when they scan the code.Non-profits can get special pricing. I suggest you contact QRFY ASAP to see if you can get the dynamic code reactivated just for a month or whatever at a discounted rate.","No, a QR code simply encodes text. In this case, a URL. The same image will always point to the same URL.I'm not going to sign up to find out how it works, but I presume they give you a URL on their domain, and then redirect visitors to the client's site.Get in contact with the print shop and see if you've got time to amend the job. If you're able to replace it, make sure that the code points directly to your own org's URL","An additional thought: I don't know exactly what kind of materials you're getting printed - or the quantity - but perhaps if all else fails, you can get stickers printed with the new QR code to apply over top of the old one?","Here you go: https://goqr.me/de/Just Type in your Text and the QR-Code gets updated."],"points":9},{"text":["My gpu or the games I tried?"],"points":0},{"text":["Weird keyboard issue"],"points":0},{"text":["Lots of lagging, poor performance, crashing during games, what’s wrong with my pc","Use hardware health monitoring software. Third party, popular ones are hwmonitor, hwinfo, and openhardware monitor ( make sure you enable logging)."],"points":0},{"text":["PCIe x1 not detected on B550","You are correct. According to your manual's block diagram, the PCIEX1 slots are on the same bus, but don't share bandwidth with, SATA3 4/5 and PCIEX2, and the LAN connectors. There should be no bandwidth issue. There's only one switch on that bus and it's between the X2 and SATA 4/5 connectors.Have you tried unplugging the cables to SATA 4/5 and plugging the USB card into the X2 slot? Just to rule out the card, or some basic issue between the card and the PC?","What USB cards? Some faster ones need more than an X1 slot.Also, they might not show up in BIOS, and windows will probably auto-load the USB host drivers, making them difficult to see in device manager unless you know what to look for.Plug some thing like a keyboard/mouse/flash drive in to check if the card works.Note that some might need the external power connection. The PCIe slot provides no native 5V source."],"points":2},{"text":["Monitor won't connect?","Disconnect your 2nd Monitor from the powersource and wait for 10 Minutes then plug it in again.Had the same Problem too with my Asus Monitor."],"points":0},{"text":["Specific Translation app required","I have never used this https://github.com/wotschofsky/discord-live-translator"],"points":0},{"text":["Turning laptop on without opening it","Check your laptop's BIOS if it has \"power on by USB\" (assuming you're using an external mouse and/or keyboard) or \"power by AC\" (plugging in an AC charger turns it on)."],"points":0},{"text":["What the hell is wrong with my iPhone 11?","Check the battery health in the settings in the menu. Suspect it needs replacing.","Get it repaired amigo","What the hell it just happened again but it was on charge and rebooted to the same percentage","You need a new battery. 80% or lower is when it needs replaced. When you get close like where you’re at, you might notice rapidly depleting battery. Get OEM Apple. Do NOT get 3rd party. 3rd party batteries can’t be calibrated and you’ll never know you battery %. 3rd party batteries also wear down faster with the lack of proper calibration"],"points":2},{"text":["My laptop doesn't turn on while charging"],"points":0},{"text":["Chrome Pop-Up on Android","Reboot to safe mode by holding the power and volume down buttons until a menu appears, and release both buttons. Now tap and hold the Power off icon until Safe mode appears, tap it.Once you're in safe mode, remove any recent apps you've installed, in Settings, search for \"Display over other apps\", revoke the permission and uninstall any apps that have it unless you really trust the app.To go back to standard operation, just reboot the phone normally."],"points":0},{"text":["FAT32 File download help required.","a FAT32 FileFiles don't have a file system associated with them, it's the file system that your drive is formatted to. This file system has that 4GB limit on files that it's able to store.If the file has to go on this drive, it will need to be reformatted.!!! This process will delete all data on the drive !!!Copy everything you wish to keep from the drive to someplace safe (or multiple places).Once your data is safe, open \"This PC\" in the file explorer, right click the drive (make absolutely sure you've got the right one!) and select \"Format\".exFAT is the file system I'd pick - it doesn't have this limit and works well on Windows and MacOS. Most modern devices should support it. The only reason you'd want to keep using FAT32 for mass storage is if you have old equipment that can't read exFAT volumes.The alternative will be to download to your boot drive, which will be NTFS and will also handle the large file. Then you can split it with an archive tool if you really must.It's possible that there exists a dedicated download tool out there somewhere that can split as it goes, but I consider this an XY solution","If you're on Windows and don't plan to use the partition on any other OS, you can just convert the file system to NTFS by opening the terminal and entering convert x: /fs:ntfs (replace x with your drive letter), all files already inside the partition will remain. It's readable on macOS (but not writeable unless you purchase a third-party app) and kinda usable on Linux (it might refuse to write if you take out the drive from Windows without using the safe removal menu, or reboot to Linux without disabling Fast Boot).If you can afford to backup and format, exFAT is nice since it's supposed to work with pretty much any modern OS and even portable devices, but if it's not a flash drive and instead is a partition on a USB HDD/USB, remember that resizing exFAT partition can be very annoying (much easier to just backup everything, delete the partition and create new ones)"],"points":1},{"text":["My HDD is dying, isn't it?","Post the drive's SMART data from CrystalDiskInfohttps://rtech.support/docs/factoids/cdi.html"],"points":0},{"text":["CPIE CABLE"],"points":0},{"text":["PC plays creepy music randomly?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Do you have any siblings?","Disable any startup apps you don't recognize and restart your PC. Then check to see if it happens again. Also open your volume mixer and see what app shows their volume level increasing while the music plays.","I've heard something similar to this before but I'm not sure if it's what you're dealing with. Some people experienced their steam music library opening and playing some creepy music a while ago and it turn out it was a \"teaser\" for a horror game coming out on steam or something. I've never heard of them doing things like this but I swear I've heard of this happening to people before. The thing is though, this happened a while ago and I'm not sure why it's still happening to you as the game has already released by now. Maybe ask steam support about it.","From your video I see you are on windows 11If you open your Run dialog (Windows Key + R) and enter sndvol.exe it will open the old windows 10 volume mixer and show which app the sound is coming from"],"points":1},{"text":["Apple ID hacked?","Did you receive a notification that a new device has been added to your account or is there a new device listed in your Apple ID? (Settings - Your name)","Check in settings/name what devices are signed in to your account.Then change the password and sign out all other devices. Change your device code as well."],"points":2},{"text":["Galaxy Tab E \"Play Services keeps stopping\" won't go away","Settings > apps > (google) play services > storage > clear cache & data. Then check playstore for updates to it."],"points":0},{"text":["Usb overcurrent detected, system shutdown; remove protection IC","I got this error once on my system, for me the fix was to.turn off the computer,.turn off the psu for a 20-e0 seconds until the capacitors drain, and then turn it on. For me this worked!","Have you attempted to unplug your case from your mobo's USB headers? If there's a short in the case's sockets or cables this is how you'll find it"],"points":0},{"text":["Increase Capacity in Google Appointment Schedule"],"points":0},{"text":["Should I drain my old phones battery?","Charge it to halfway every few months.","From my experience, dead dead batteries like to swell up.Cycle them every now and then.","afaik if you store a device to not use its recommended to fully charge itso charge to 100% and put away, the battery should survive better.","The recommendation storage charge for most lithium batteries is 40-50%. Both flat or near fully charged are not good states to leave lithium batteries for long periods of time.","Mine was sitting dead for 4-5 years (broken tablet) thankfully nothing happend just the battery capacity was dropped to half an hour and took 2+ hrs to charge"],"points":3},{"text":["What Frontend Developers at google are doing?????","Must be user error as these apps are available on my (S24 Ultra)in dark mode."],"points":0},{"text":["Right Arrow Key doesn't move text cursor.","https://www.youtube.com/watch?v=soiV5WPF8ts for a better explanations"],"points":0},{"text":["Headset audio issues(windows 11)","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Discord muffling my audio"],"points":0},{"text":["Samsung 980 Vs 990 OS drive","You can simply clone the 980 into 990 using Samsung Magician's Data Migration tool and you won't have go through hassle of doing everything again"],"points":0},{"text":["Are there any instances of cameras being installed in the back of iMac desktops / has my apartment been bugged?","my 2000 iMac desktopI'm guessing this is a typo, since a 24 year old iMac G3 didn't have a webcam.Imacs do not have a rear-facing camera. Either you have a USB webcam plugged in that's behind there, or your iPhone is back there and you turned on Continuity Camera.The third possibility is that you had a very vivid dream.If someone had access to your computer, why wouldn't they just use the built-in camera? Why would someone plant physical devices (bugs) in your home anyway, are you in the CIA?"],"points":0},{"text":["Spilt some water in my Xbox series x vertical fans what should I do?"],"points":0},{"text":["Crashing and then WiFi disappears.","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Problem with Realtek audio driver","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","nvm guessed I fixed it? I ended a task in task manager labeled something like Realtek audio driver(3)"],"points":0},{"text":["Just spilt water on the usb cable for my Xbox controller","If no water was inside the pc inside the port or the controller, then you are fine.If the wire was frayed then make sure it is completely dry","No"],"points":0},{"text":["Windows 11 Update Leads to RAM Frequency Inconsistency: Seeking Resolution","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Task Manager is often wrong, check with CPU-Z or something like that."],"points":2},{"text":["random rar file appeared on my desktop"],"points":0},{"text":["Desktop PC hangs","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Install the latest AMD video driver.Also consider updating your system's BIOS. No generic instructions can be provided for this, it depends on the brand and model of your computer and/or its mainboard.If that doesn't help then it's probably best to test the system with OCCT and see if you can trigger the problem with a high CPU and/or GPU load."],"points":0},{"text":["My Laptop [LG GRAM16] downloads from steam 4x as fast on wifi than my Desktop PC [Amd b450] with a cat6 despite both having Samsung nvme SSDs (Laptop is pciegen4, PC on gen 3)","wifi 7 usb adapter/pcie adapter + wifi 7 be router............hyper fast"],"points":0},{"text":["LG B9 randomly crushed black levels and horizontal white line that stays on after turning TV off"],"points":0},{"text":["help with my wifi router....","Depends.. what's the model of your old router?  You might be able to install some custom firmware such as DD-WRT that would enable that feature: https://wiki.dd-wrt.com/wiki/index.php/Repeater_Bridge"],"points":0},{"text":["(Windows 10) I recovered a missing video project of mine in my videos document, now I want to know when it happened via access history","When I recovered it, it just says when it was modified/accessed which is \"few minutes ago\" And That I havent turned on the last access history thing."],"points":0},{"text":["Is there some test that i could run to ensure that my GPU is working properly?","I did not ddu when installing a new driver ( just installed)Could be this.Or.Is your PSU rated high enough for the new card?"],"points":0},{"text":["ALT CODES ARE NOT WORKING!!!"],"points":0},{"text":["Calibrating my Tv"],"points":0},{"text":["Video Sound"],"points":0},{"text":["Issue detecting internal HDD","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","If it doesn't show in the BIOS under storage devices (not boot devices), then it probably broke. If you're looking at boot devices then an empty drive may not show up depending on the exact logic in the BIOS.Most likely it just broke though. Various test, for instance those by Backblaze, show HDDs get considerably less reliable after seven years."],"points":0},{"text":["How do I get rid of robustsearch.io"],"points":0},{"text":["Question about force shutting down a PC","You are right to be worried, force shutting down your PC isn't entirely safe. If it still works right then it's probably fine though.However, especially if you have a cheap SSD, you should minimize how often you do this. We regularly get people on here that bricked their cheap SSD by doing this. Kingston explains why that happens. If you don't properly shutdown an SSD its firmware metadata can be corrupted, causing data corruption, or worse, a failure of the firmware, bricking the drive.If you have quality SSD though, then the risk of this happening is pretty small. They have much better firmware and more protection against metadata corruption."],"points":0},{"text":["Pc crashes, then boots to bios without detecting boot drive","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["How to disable HUD on new geforce experience beta app","Alt R"],"points":0},{"text":["I think everything on my computer is scaled up just a little? Driving me crazy","Also just realized I think my desktop shortcuts are pretty big as well","1366×768 is a weird ratio. Start with setting it to 1920×1080. If that's still weird, keep trying the different options. If your screen goes black, don't worry. It'll time out after 15ish seconds if you dont click \"keep\" and revert to the previous ratio."],"points":0},{"text":["Graphical glitches on my screen? Happens mainly on ui","Does this happen on other applications too?We've recently started to see this failure mode more often, basically triangles that have the wrong coordinates. GPU acceleration on all modern GPUs is based on triangles.I'm personally not sure if it's just a software issue, or if it's a hardware issue.You can try running DDU and installing the latest driver from your GPU manufacturer (AMD, Intel or NVIDIA).","I saw similar things in a failing gpu a few years ago. It was memory errors. 1st thing id be removing any kind of software like norton. And delete the gpu from the device manager and restart."],"points":1},{"text":["Desktop turning on but with no display","Also when I turn it back on the bios thingy doesn’t show up. Honestly have no clue what to do"],"points":0},{"text":["My new cheap laptop isn't working and keep spinning for hours"],"points":0},{"text":["WiFi not connecting to 5Ghz, but will connect to 2.4Ghz","wifi is an absolute last-resort for a gaming pc.run a cable if possible.what's the wifi adapter? what's the router?"],"points":0},{"text":["I need help(analog sticks)"],"points":0},{"text":["Boot issues - Help identifying fault"],"points":0},{"text":["hashing no longer works after power outtage, CPU at fault"],"points":0},{"text":["PC turned on SVM Mode by itself"],"points":0},{"text":["TEAM MONETIZATION SENT YOU WARNING SEE WHY, FB PAGE HACKED?","Change your passwords on all accounts, enable 2FA anywhere it's available, and remove all permissions for FB on third-party apps. If you're using browsers to manage FB, remove all third party extensions"],"points":2},{"text":["Green tinting on PC display"],"points":0},{"text":["If i use usb on an hdd system","Cheap portable USB drives usually have even less performance than internal HDDs. Expensive drives might have better performance, but if you often need to update/replace the games, don't expect the drive to last long."],"points":1},{"text":["Can't fix \"This video file cannot be played. (Error Code: 102630)\""],"points":0},{"text":["Dead motherboard?"],"points":0},{"text":["MY KEYBA0RD IS STUCK TYPING IQWERTOPUY[]\\","You bought it knowing it was broken?Ask your friend what they spilled on it.","Manufacturer of the keyboard would be useful - Razer, or whatever.I can think someone did a keybinding or Macro? it seems that the L is exchanged for 1, and o for 0.You can also try looking here: https://www.reddit.com/r/MechanicalKeyboards/comments/7rldmr/help_crtl_and_caps_lock_switched/ or this one (keyboard chattering https://www.reddit.com/r/MechanicalKeyboards/comments/86zl8f/help_both_my_mechanical_keyboards_suffer_from/","Edit: deleted my reply.See if you can look at macros like the other guy said or see if there is a way to reset the keyboard","It has liquid damage. It cannot be repaired."],"points":3},{"text":["half an internet connection on one computer. Why is that?","Run a network reset. Just type network reset in your windows settings.Click network reset > wait for your device to automatically reboot (takes 5 minutes) and then sign back in once it has started again.","Check your DNS settings, likewise check your net mask are they set to auto. if it's windows, upgrade"],"points":0},{"text":["Today, once again, Windows 10 nags me with full-screen pop-ups at startup, and I'm very annoyed.","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Would a multi billion dollar massive company be able to track who has been connected to their wifi?","I mean if they have logging setup yes, any device that connects to WiFi can be logged. They would be able to see MAC address, IP address it was assigned, device name, type of device and again if they have logging setup they could even see traffic from that device. This is a very broad question honestly, any more specifics on why you are concerned?","Are you using a company device or installed software from the company? If so, they can even see anything regardless of what wifi you use.Are you in guest wifi or employee-only wifi? Guest wi-fi usually has less scrutiny but they will check the log (normally contains the time, MAC address which reveals device type, assigned IP, and what site/IP you're connecting to) if they have a reason to (data leak, legal request, DMCA notice, etc). Employee-only wifi obviously links to your identity.Are you asking this because you connect to mainstream porn sites/social media, torrenting, copying sensitive data, or sending a whistleblower email while connected to the wifi? The further you're on that list the more effort the IT will spend in tracking you down.","Company equipment, I can find a lot of info. BYOD on guest vlan, I'd have to sit around and stare at logs for a while. I might get dumb lucky on an http url and read website.tld/folder/unsubscribe=?jane.doe@gmail.tld. Or I can be a real jerk and turn down all data for a device to dial-up modem speeds.","I work for just a small company and every device is tracked in radius logs and firewall logs. Can see times, Mac address and credentials used. Plus any traffic that device did.","If they're as powerful as you say, you would connect to a honey pot network and have everything rummaged through. likely, without you even knowing it was happening, their main network would be thoroughly protected.","Turn WiFi off","I used to do WiFi tech support. Large companies capture data automatically. If you hit a trigger like going to a prohibited site it will show up somewhere with your device info. I used to read logs to see what was happening to solve connection issues. Usually no one looks at it carefully unless there's a reason. Yes they probably have the info and possibly they care enough to do something about it. Generally this is all automated and then reviewed by someone.","Always assume yes.It's not something that takes a billion dollar company. My home network tells me the device model, MAC and types of traffic (I can tell if a guest has been on pornhub).","Depends on how they're treating their cybersec policy. Sometimes it's strict as hell. They know who you are and where did you surfed (they cann't read your messengers, they're encrypted). Sometimes they barelly give a shit, unless it's porn during work hours.If there are single use codes for access to WiFi - doubt it.Too many if's, to say exactly","This is not budget related, the list of connected / have-recently-been-connected devices and the websites they visited is literally a browser and a couple of mouse clicks away even for my home network.","Yes but the likely hood of them caring unless somthing dodgy has taken place is next to none","sounds like a question a law abiding citizen who is not going to participate in illicit activity would ask"],"points":21},{"text":["Older hardware = more buffering?","Yes the older tv in the living room is slower due to older and lower end cpu & much smaller amount of ram which then Iptv apps fill up the Ram fast also require more cpu processing."],"points":0},{"text":["I have a LG C9 tv for about 5 years and it seems it’s losing its brightness, is my tv about to die?","OLEDs do indeed gradually loose brightness as they wear out"],"points":0},{"text":["Mouse being weird?"],"points":0},{"text":["HDD Upgrade Gone Wrong"],"points":0},{"text":["Laptop (windows) no internet, resolves after a day or three","DNS setting perhaps?"],"points":0},{"text":["call recordings in file manager by \"unknown contact\""],"points":0},{"text":["HP Server Help"],"points":0},{"text":["Tonor Q9S RGB won't turn on on startup"],"points":0},{"text":["Cpu Bottle Neck","Drivers installed and updated?Plugged into the GPU and not the motherboard?Have you checked the temps?Any changes to BIOS?"],"points":0},{"text":["Monitor suddenly turns black and fans going loud","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["[Windows 10] Mic is very quiet despite everything being at 100"],"points":0},{"text":["PC fans going max speed and screen goes black"],"points":0},{"text":["Microsoft Visual C++ is unavailable"],"points":0},{"text":["How can I change the font size of a particular software? The program itself doesn't have option to adjust its font size.","Right-click the launcher icon, open properties, switch to the compatibility tab, and change the high DPI setting, you might find an option that works to force the app to follow Windows settings.Depending on how the app stores its settings, you might be able to modify them through Resource Hacker.Note that some UI libraries aren't smart enough to adjust element sizes when the text size is changed, so you might get cropped text or overflow to the next line."],"points":0},{"text":["Dell G3223Q nothing but static from onn hdmi splitter"],"points":0},{"text":["can’t sign in on outlook because of the authenticator app"],"points":0},{"text":["BSOD - minidump attached","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","I'd like to mention i've completly reinstalled windows 3 times now (all from the same bootable usb)","The crashes in the mini dumps are from memory corruption.At DDR5-5400 you're still overclocking the CPU's memory controller, it supports up to DDR5-5200 with two modules.Also, it looks like you have BIOS F22a installed, but BIOS F22a is no longer listed and only F22b is listed. It's possible F22a was withdrawn because it's buggy. Try installing F22b."],"points":0},{"text":["Memory not fully used?","Try using HWinfo or hardware monitor. It may be that it hasn't been installed properly or they have sent you the incorrect model.","Can you share the screenshot of Task Manager-Performance-Memory? Also Resource Monitor-Memory-Physical Memory. Use imgur."],"points":0},{"text":["How do I plug this into a monitor?","There are DisplayPort and DVI ports in those loose holes in the middle. Be careful when connecting a cable or adapter because there's supposed to be a plate there."],"points":0},{"text":["Can I Change the Graphics Card on this Laptop?","No."],"points":0},{"text":["Is my GPU go goa gone?","Reinstall GPU drivers using DDUReseat GPU in motherboardTry different HDMI / DP cablesOther than that, it could be the GPU beginning to show some signs of issues to come.Or it could just be a glitch. I recommend keeping an eye on it and if it keeps happening you may need to send the card in for repairs if possible or replace the card."],"points":1},{"text":["Need help with BSODs","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Computer not booting. Black screen without cursor","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["System Thread Exception Not Handled BSOD","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Help with airpods please"],"points":0},{"text":["Is it safe to use hotspot with a compromised cell phone?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","What led you to believe it got infected?In general, if infected, it is possible for a lot of different kinds of attacks, yes. However, the payoff is low (how often do targets tether from their phones) compared to other internet connections/ vectors.","Your phone handles all the traffic between your laptop and the internet. If you can't trust your phone, you can't trust the internet coming from your phone, it's that simple. If you don't trust the postman, would you use him to send a letter to someone else? Of course not.Whether your concern about your phone is reasonable or not is another story."],"points":2},{"text":["A blue box pops-up when highlighting text"],"points":0},{"text":["GPU Drivers Keep Crashing in Game After fresh install","What about running the game in lowest quality? It could be one of the effects like ray tracing that is causing the crash.Have you tried going back to an older version of the driver? It could be a bug in the current one.Just as a test, this is 472.12 WHQL: https://www.nvidia.com/download/driverResults.aspx/180555/en-us/I would try the clean install and skip geforce experience IMO. See if it crashes again.Also do you have an 850 or 550 watt PSU? If it is a 550, you might be hitting the limits.If you are running dual monitors, I would keep the APU active and use it as the secondary. Additionally with multiple monitors you should make sure you are playing in Windowed Maximized instead of Full Screen. Full Screen with 2 monitors causes monitors to freak out and can crash your game when you try to toggle the desktop."],"points":0},{"text":["How to disable the keyboard and trackpad on a laptop so I can only use an external kB/m","Unless you physically disconnect the connector I don't think it's possible.","No one can help unless you include the make and model of this computer.","have you tried disabling them in device manager? I assume that would work, idk"],"points":0},{"text":["Lenovo Thinkpad x240 black screen"],"points":0},{"text":["It does not let me view my antivirus or factory reset my pc (Windows 10)","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Why can't i change my country on internet afterall?","reset your advertising id on your phone.https://www.reddit.com/r/PrivacyGuides/comments/suqioz/how_to_delete_the_advertising_id_on_android/your current id is branded with all of the ads and trends you are seeing."],"points":0},{"text":["Screen and keyboard unusable upon startup, but only for ~10 minutes"],"points":0},{"text":["PC can't install anything, with some weird (useless) exceptions.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Is there a way to mirror a laptop screen to multiple TVs wirelessly without using WiFi?"],"points":0},{"text":["clearing space? i think","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["PC randomly starts stuttering while gaming","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Likelihood of email getting hacked?","There’s tools that can automate trying combinations of address. The same way a brute force attack on passwords work, just randomly try’s combos. Highly unlikely someone would do that. Emails usually are targeted. But you do have less of a chance for some data breach to cause your email to end up on black market list. Regardless still use 2fa and a strong password."],"points":2},{"text":["Is there a way I can monitor my PC battery level from my phone?","Repeatedly plugging and unplugging like that will usually do even more wear than leaving it plugged in all the time.","Just limit your laptops max charge to 80%"],"points":0},{"text":["Forgot Pattern"],"points":0},{"text":["Disabled ipv6 / dhcpv6 on my Motorola MG7700 to play Madden on PS5, and it ruined connectivity on all other devices. Help."],"points":0},{"text":["Fans Accelerate Alarmingly Fast When I Shut Down."],"points":0},{"text":["Aurora R12 Software issues"],"points":0},{"text":["M10 aws buds: left side not working"],"points":0},{"text":["GPU randomly disconnects and then reconnects","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Huion Kamvas 13 drawing tablet pen keeps freezing every few seconds. All drivers updated"],"points":0},{"text":["Anxiety induced questions about uefi, bios, and worm malware","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Strange Alienware GPU issues."],"points":0},{"text":["Router Not Working With Power Issues"],"points":0},{"text":["Mouse wont appear in games on my pc"],"points":0},{"text":["Sensitivity broke after update"],"points":0},{"text":["Completely stumped on sudden laptop issue"],"points":0},{"text":["PC power completely shuts off randomly","Trial and error. Do you have another power supply? You want to ensure to troubleshoot as soon as possible if it is the PSU. Consent unplanned power outages can wreck havoc on PC components if there are any power surges.If the power is shutting down versus your PC cycling to the start up due to a software error then good chances it has to do with your power supply. Either it is faulty, or possibly your system is demanding too much power from a small PSU."],"points":0},{"text":["Fps Drops","When the performance starts to degrade, what is the temperature reading for your CPU/GPU?"],"points":0},{"text":["Graphics Card Causing Pink Tint"],"points":0},{"text":["What does it mean SSD 231 Life left?"],"points":0},{"text":["Trying to get windows again","Have you tried reinstalling Windows, or are you asking before you attempt? Windows should pick up on your laptop's hardware ID and automatically verify you"],"points":1},{"text":["Help with bsod diagnosis / crash dump analysis","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Xbox Gamepass PC Hello Neighbor 2 issues"],"points":0},{"text":["I have a problem with Messenger desktop on windows 10 and 11, whenever I try to log in it shows me the massage Error \" Unable to complete request. please try again later. \""],"points":0},{"text":["\"Check your backup\" - Windows 10 backup"],"points":0},{"text":["How much money can you save by turning off the wifi and ethernet?","He wants you to sleep basically. If you're still going to school, get some proper sleep.","He isnt saving any money. Internet plans are mostly unlimited subject to fair usage.The power saving is negligible.He wants you to sleep and be healthy.Sleep and be healthy dude.","Negligible. He's not doing this for cost savings","I’ll just let you know, the router / modem is almost certainly not being turned off. There are lockout conditions that can be set in most modems / routers.On another note, get some good sleep, trust me, you will need it, sleep is more important than you realise","Your parents have no obligation to keep your Minecraft server up and running 24/7. Get some sleep.","The savings are negligible. He is restricting access as he does not want you and/or someone else accessing the internet during those hours. In most instances he could specify exactly which devices he does not want to have access.I use this myself for one of my kids that has a tendency to stay up late when he has school the next day. Yes, I made him aware of the reasoning, I didn't lie to him like your father is to you.","He just wants you off the internet, the 50 euro's will be the monthly cost for the internet package most likely, not what you're saving unless you're on some limited data plan(which barely exist anywhere that isn't the US anymore) and you're using so much data it's costing loads but as far as I know all european ISP's offer unlimited data.But, as he's your parent, he can do that if he wants, there's no need to make up the lies, but it doesn't mean he can't stop you doing it","I think it's because he wants you to sleep during these hours...","I was going to say calculate the wattage draw, but you've done that. If it helps him sleep, but realistically, he probably isn't saving much.","Only you can talk to him about it, man. Time to raggle. It's a good opportunity to build some trust with your dad. If it's not a deal, meh. At least you tried.","it may not be electricity that he's trying to save on, it could be bandwidth. not everyone has unlimited data on the dsl, cable or satellite and those providers charge for going over your limit on bandwidth. everyone that says most providers are unlimited need to do some research on the subject.","Look dude, reading through your post - your dad is smart enough to know about your server and that cutting internet isn't really saving anything.You're very much still a kid and no one on this thread can push against what looks to be him setting reasonable up boundaries for internet access. I've used child locks and curfews to help curve my own bad habits so it's not impossible that this has nothing to do with you.Sit down and have an honest talk with your old man.","Last I checked, ISP billed by the month for a given bandwidth and possibly with a data cap.The only way I can see this saving money is if your server use consistently causes excess data usage and your father gets billed for extra GB of data.","Just so you know, it's Wh and kWh, not W/h. W and kW are rates, Wh and kWh are amounts of energy.","Might save a small amount but not enough to justify the hassleAt best might save enough for a few coffees or a meal at a fast food restaurant","Well He’s not saving money on that for sure. If you’re asking because you need to keep the server running either ask him that and provide evidence that’s why you need the internet or get your own","Even without a network connection, your server is going to use electricity while it is on. So, your dad is going to save zero electricity.","He’s feeding you shit. But, props to your dad. Most parents wouldn’t give a fug.Get sleep.","An It guy can't win against an electrician 😂","Its not the router thats the issue, it's obviously the server you're running. Turning off appliances on standby is incredibly low savings , like literal pence. Disconnecting a server will undoubtedly save money.","i have a convection heater running 24/7. it runs me 1kWh or in my state just shy of 6 cents an hour. that's $1.44 a day and $43 a month. that works out to about 47 euros. your router is running at 1/100th of that.","I know you said you don't want to pay for cloud servers but... you should pay for cloud servers. For the type of stuff you're doing you could probably get a cloud environment set up for less than $10/month (unless you have a huge amount of Minecraft players or something). Not only would it solve your main problem but you'd get a lot of other benefits:A lot of security burden (although NOT ALL) will be taken off youIf your security gets compromised anyway then only your cloud environment is in danger instead of your house network.You won't have to deal with hardware issues, excessive downtime, etcYou'll have tools like snapshotting that will make recovering from disasters a lot easierIf you want to experiment with a new type of service (which it sounds like you enjoy doing) you can just quickly spin up a server, do your experiments, and then tear it down when you're done. No having to fuss with imagining a bare metal machine or any of that mess.Every server gets its own Internet-facing static IP which makes managing the networking side of things WAY easierIf your server suddenly has a surge in traffic you can click a button and it automatically has more resources to accommodate it.You mentioned you're running some stuff in containers - a lot of cloud providers let you just run containers as-is without even needing to put them on a dedicated server at all.Seriously, look at what resources your current setup actually needs (NOT the total amount of resources your machine physically has, but what resources the services are actually using) and then price out what it would take to get those resources on a Digital Ocean droplet or something. You'll probably be surprised how cheap it can get.","Turning off the wifi and ethernet for 6 hours a day saves roughly 1.8 kWh per month. At 33 cents per kWh, that's less than a euro, far from the 50€ your dad mentioned. Seems like the savings are minimal, and the impact on your server and its users might not be worth it.","a basic g/n router might draw 2-5 watts, a bit more powerful multicore mimo dualband whatever might draw double or triple for high end models. disabling wifi will save you a watt or two..to have better understandint, just a typical pc idling (doing nothing) + monitor turned on will burn 50 watts at least","Simple. Pay the money.","It is exactly what you suspect, if the router is online and the radios are off, it is a few cents a month. He is doing a good parently thing and making sure you're not up all night on social media rotting your brain. Hard to understand when you're young, but it is actually important for your health.Not to mention, less RF radiation while sleeping is not a bad thing.","He's doing it so you won't watch porn at night.Just a desktop (say 400 watts) is easily 4 or 5 old-fashioned light bulbs and anything connected to the 'net is going to use more power if it's working than if it's idling.","you need a new father","Sounds like dad is more concerned about your 'server farm', which might be consuming a lot of power. Multiple disk arrays and the gear that support them consume a suprising amount of power, even whe \"idle\".Or he has an issue with you being a sysop in the wee hours. Maybe have an honest and civil conversation with dad about what his concerns are? You may be able to reach a mutually acceptable compromise.","If he's an IT guy, could you talk to him? If you're already asleep, it don't matter if everyones connection is cut.But talk to him about the server, what it's doing and who's using it. He may be willing to set up a thing just for it.","A lot of money and heart aches from radiation for sure 😁","lol its a side effect of your servers to runners as hard all night probably lol","Okay, first - it is probably a measure he uses to stop y'all from being glued to the screen.Another thing is - there could an FUP in place and he is saving data that way. Not sure how much traffic is on your network but I've definitely been in place where I blew through my FUP thanks to Steam updating COD with a 60GB download while I slept.Then I had to buy more data - hence, not having to do that saves money.","It'll depend on your plan, but 12-6 might ironically be the time you'd want the router on....It's not uncommon for metered plane to not count data use during that time frame. So you could cache content to watch offline on your various devices then without it counting against your terabyte/month use...","Simple people without hobby and joy, hate people who has both. Humans are selfish and jealous.","routers use almost nothing for power and internet bills dont change based on usage. Probably saves less than a dollar like you mentioned.","In my country depending on what data plan you have their used to be an instance where you had higher speeds at different times. I think the cost is only different for the data at certain times. However I think this was only true for LTE mobile data and ADSL lines. Never heard of fiver working like that and the electricity is just an excuse to be a dick. If you're struggling to sleep he should take you to a doctor not just cut off the internet at night.","Intellectual yet idiotOr he doesn't have the emotional intelligence to set a boundary of \"you need to sleep at these hours\", so he makes up this low iq reason instead.Does he insist that the 2W led lightbulls are turned off religiously when not in use as well? Thereby saving 1.5kWh or 45cents per month?","Your father is a good one with restricting the internet for you two. Don't spend much time on that thing. Between 16 and 24 is peak. There you can outperform females in education. But not if you are distracted. And that's the internet.","1: Sleep. If you turn off everything and just close your eyes you will be able to easily sleep at 10pm let's say. 2: Your server eats waaaay more than the internet. In fact it can actually eat quite the amount if you run it all the time. Yeah yeah, only 300w or whatever but 24-7 that does add up and some countries have rules, like you can only get x amount of cheap electricity and then it costs much more.","Honestly, I'd try to get a chat with your dad, explain him the server situation, and make him trust you in not being awake using the internet when you should be aesleep, if he is an IT guy he'll understand the server thing, and he may be proud if you tell him you did the maths for the power cosumption of the routerGood luck","the fact that you were posting early am means that the reason is that dad wants everyone asleep and not using the internet, too bad about the server, just leave it off as well","Did you calculate your server's energy consumption?","Your dad’s dumb, if you turn off the WiFi the whole night, it’s gonna work extra hard to WiFi the house up the next day.","Tell him if it’s about the money, you’ll chip in or do some chores around the house. If he says no, it’s for other reasons.","If you add your server consumption @300W/h, it's around 20 euros per month.","Anything to do with router / modem, if it aint broke dont touch it. Also the power is negligible.","Maybe you should come clean.... Just tell your parent you got a server running and you promised you will go to sleep.","How old are you both?He likely wants you both to shut up and go to sleep.","I've started turning my PC and ps5 and all my tech off at night until i come home from work, and im saving around £15 - £20.Say it was a stable 20. That's £220 a year if you put it in its own pot. That's more than half the cost of a digital ps5. About the quarter of a high end gpu. Or 3 triple AAA launch games, a deposit for a package holiday, blocks of driving lessons. it does add up. I think your dads being nice and trying to give you the hint to power down your devices overnight without having a confrontation about it. When i was younger my step dad used to turn the router off cos i stayed up late. Or used to cut the power to my room. If i asked him to foot the bill for a 24hr minecrafter server hed probably kick me out.","He's lying to you. Or he's severely misinformed. Or someone lied to him.If he's really an IT guy, and you're really sleeping at those times, tell him to whitelist the server and go to bed. If your server isn't running on a separate computer, well your dad's an IT guy, chances are he's got an old system kicking around that'll be perfect to host this server of yours.Sounds to me like you have trouble sleeping and your tech dad is trying to tech solve it instead of human solve it. You need to figure out why you can't sleep. There's too many possible reasons including medical than I could possible hope to armchair diagnose here, but you need to figure that out. And your dad needs to figure out how to do parenting right. Your account is two years old, minimum age to be on reddit is 13, so you are a minimum of 15 years old, that's too old to be lied to about stupid shit like this.Your father should be saying \"I'm turning off the internet after midnight so you will go to bed at a reasonable time\". He should not be lying to you. 15+ years is more than old enough to be honest with your child.And if he does truly believe he's saving 50€ a month with this, you and your brother should be seeing some of that, 20€/month each sounds decent ;)","Maybe suggest to your dad that you set up the server outside your room so there is no perception that it is impacting your sleep.I would guess sleep is the real issue here.","He’s not saving costs, it was a white lie to give you a healthy lifestyle.","Buy a 5G router and take a cheap data sim with it","Less than $5 a month","When a tech-savvy dad meets a tech-savvy son... It's bullshit, but he has a point. 12-6am is sleeping time unless you work shifts or nights.","If you see red dot.. turn off :D","100000000000 € jährlich","Yeah no. It's not going to save €50, not even a year. Unless you are still using dial-up. I don't even know if you can still get dial-up, can you?","Hahahahah","Tell him to invest in home security cameras, then once they are install point out to him without Internet he won't get notified of a possible intruder at night.","Those are acceptable no internet hours for people using internet they don't pay for imho","What is the cost of running your server during those hours? Maybe that's where the save in money would be coming from. Or as others have pointed out, he just wants to make sure you are asleep during that time.","Some internet services charge a flat rate for data exchange over a monthly amount. It could be this","Depends, here where I live you pay a fixed monthly fee regardless of how much bandwidth you use, but some places charge for bandwitdth so he might or might not be onto something.Modens/routers use very little power so there's no way he's save anything more than a buck or two by shutting them downSince he's an \"IT guy\" I don't thing he's being ignorant, he's either paying for bandwidth or trying to make you guys go to bed in the right time.","Your maths is correct, your dad will save less than 1€. He’s not doing it for cost savings,","I wouldn't have access to Amazon. The savings could be quite substantial.","He wants you to shut off your massive server a few hours a day. What kind of power does it eat? Anyway, it's his house. If you don't like his rules get your own. You don't have to agree with his thinking, these things are not your decision.","Who runs a server on wifi?Wire it up and let him disconnect the wifi","You’re not paying for the internet so you don’t get to decide if you get it. Sucks, but that’s the rubHe’s saving more than just the power on the router, he’s saving power on all the devices that wouldn’t been connected to the internet. Even if the device is still on it uses less power than if it was hooked up to the internetThat server was probably using a lot of power","If he is an IT guy, surely he would understand that your server needs to be online all the time? Or does he not approve of the server?Tell him what IP it is and he can track and make sure that is the only thing running at night (ie making sure you're asleep).Frame it as you learning. He might be happy and turn the internet back on if he knows your interested in IT, etc...","I don't know how old you are but it's still his house. To save money is a nonsense reason. It has to be that you're still a minor in his house."],"points":629},{"text":["Speakers making static noise?","If you're using a 3.5mm aux cable out of your PC and into the speakers, then it's most likely electrical noise interfering with the internal sound-card, which is then being amplified. That sort of noise can change depending on what's happening on the PC, typically people notice it when at very loud volumes and they move the mouse around or whatever.If that's the issue, typically an external USB soundcard can fix the issue, as it allows it to be away from any of the electrically noisy components. I'd recommend something like the Behringer UCA202 as a cheap solid choice for a little external USB audio-device."],"points":1},{"text":["Issues with trying to migrate OS to a new SSD"],"points":0},{"text":["Philips tv 4000 series no remote"],"points":0},{"text":["Armoury Crate • G-Helper • PC help??","I can’t take it anymore. I am convinced enough. I am gonna download G-helper and stop the Asus services as instructed by G-helper. I hope I don’t harm anyone by doing this bc I plan to (again) ask if MicroCenter can compensate me for my troubles and I need to be sure that I didn’t mess my machine up by installing G-helper and uninstalling/stopping the Asus stuff that is apparently bloatware?","I understand that more details can help so Maybe this might help someone…Here is a lil more embarrassing detailed version of a part of my query:Does uninstalling the ASUS stuff that G-helper says to uninstall mess up the laptop? (Like returning to your laptop after taking a break only to find that your laptop decided to p much shut down on it’s own despite being charged (if I came back to my laptop within minutes, np, but if more than an hour or so, every time it would shut down), and now you have to turn it back on (hit the power button and have it boot up when I should have just been able to click a button and have all my work right there as I left it before sleep/hibernation), and pray to God that whatever you had open saved/is recoverable, or any issues with heat?)I went to tech support from MicroCenter several times for the same issue. They tried multiple things. One of which was taking my hard drive out and putting into a new same model laptop. Another was changing the settings of hibernate and sleep. Another was some Windows issue testing (they actually found a problem with windows and that’s why they decided to take the hard drive out and put into a new same model laptop from off the shelf. The problem yet persisted and in the end they p much said to just get a brand new same model laptop with store credit and start anew like total clean slate. Meaning I have to set up everything all over again and that took me days!! (this is considering I have my files backed up to an external to transfer over) … And I have work to do rn!!! So now I’m trying to resolve this concern and avoid having to deal with this issue any longer I can’t it anymore it’s been weeks and it’s affecting my health with where I’m at rn. I just want to do right please if anyone can help it would mean so much I’m sorry if this is stupidThank you all so much for your goodness"],"points":0},{"text":["Help."],"points":0},{"text":["Google FRP lock removal"],"points":0},{"text":["Changed RAM and now monitor isn’t working","Have you tried re-seating the RAM?"],"points":0},{"text":["USB WiFi Adapter failing to connect, while another connects just fine","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["PC wont shutdown, only restarts after power outage."],"points":0},{"text":["Headphones can't read my sd card audio"],"points":0},{"text":["Get the command it's trying to run","It seems pretty bloody obvious to me, something called ESportal Anti-Cheat Client, I assume something you've downloaded to play counter strike given your post history."],"points":0},{"text":["Issues with MSI/Windows Installer"],"points":0},{"text":["Does google ban multiple emails when charging back","The one associated with the purchases that you chargeback will be impacted."],"points":0},{"text":["Boost wifi in room with Ethernet port","If there is only one port, and you want to boost the network you have different options, but I would recommend that you buy a wifi extender of the brand of the router, but when buying it, check if it also has an ethernet output (not only input). If not you have to buy a switch also (simple 4-port switch should be enough). Integrate the extender in the mesh, so that you dont have two wifis with the same ssid and passkey, but have one wifi with different sources (your phone etc. will connect to the one with better signal).","A switch and a wireless access point."],"points":0},{"text":["Out the box TV boot looping"],"points":0},{"text":["Lost USB dongle for E-Yooso X-31 large wireless mouse"],"points":0},{"text":["Windows instalattion on a NVMe - ASRock B650M Pro RS"],"points":0},{"text":["Need Help With Razer Wolverine Ultimate Controller on PC"],"points":0},{"text":["Wireless headset mic doesn't work on startup?"],"points":0},{"text":["I spilled some soda on my HyperX alloy Keyboard. I disassembled it to check out the damage. Is it fried or I just need to Clean it ?","The fact it did actually still respond would indicate to me it's not completely broke and it's likely some residue or trapped remaining liquid is causing some odd behaviours.Best bet is to use something like isopropyl or pure denatured alcohol and some q-tips/cotton-buds to clean up any residue on as much of the PCB you can get access to. Although you may want to be careful, as q-tips can get snagged on small surface-mount components, so don't rush things or be aggressive around those tiny little components and accidentally pull anything off.It's worth noting it's not uncommon for there to be oily looking smudges around solder points, which might just be flux residue from when it was being soldered (depending on how it was assembled). That residue isn't harmful, but you can clean it up anyway just in case."],"points":0},{"text":["I have reused my retail Windows key on my new PC, what happens if I now turn my old PC on?","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Bill Gates will personally come to your house, and smack you around.His goons, will similarly, smack your dog around.","Nothing in most cases, microsoft has gotten really lax with key management over the past number of years.At worst it some day gets the \"windows is not activated\" logo on the bottom right of the screen, but it's not going to stop working.If the key worked on your new machine, happy days","It should deactivate itself.","The old PC will eventually be deactivated automatically. When it is, it will act as a regular unlicensed Windows install. Until then, it will behave as a registered version of Windows.Note that from a licensing perspective, your old PC technically becomes unlicensed the minute you register the new PC, regardless of how the Windows installation/MS licensing servers behave. MS is not so strict that you won't be permitted a reasonable timeframe in which to transfer your data etc. But you should discontinue use of Windows on the old PC as soon as you can."],"points":4},{"text":["iPhone Voice Memo Recovery"],"points":0},{"text":["Do I need a bigger SSD, or more RAM?","I don't think it is SSD problem, when the game loads SSD did it's job. Can you check task manager , performance tab when lag happens. Is CPU or GPU at high % ?"],"points":0},{"text":["Phone sensors enquiry","Not sure what everyone has with their phones \"hacked\" at the moment.This isn't like in the movies.Smartphones nowadays are nearly impossible to hack without a mayor exploit or when installing something from a untrusted source.","If your device is compromised, they can easy be re-enabled by software. But it's a lot harder to get mobile malware than you think and almost none of it wants your camera or microphone.Mobile malware wants your login information, passwords and app details it doesn't care about what you look like or sound like.It's also not the camera and microphone that \"get hacked\",it's the device itself, the camera and mic are just peripherals like a mouse and a mic and webcam would be to a pc, your webcam can't get hacked, but the computer which controls it","Until someone breaks / hacks the phone and activates it, maybe.All they have to do is get you to download a virus that activates the camera or drop-sensor.(So functionally - no impact, sorry.)"],"points":2},{"text":["Redragon K617 Fizz keyboard long pressing/spamming of certain keys"],"points":0},{"text":["(win11) quick accsess disappeared","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Lenovo Yoga 7 14ITL5 no post"],"points":0},{"text":["Armoury Crate help??","I watched a few vids on YouTube andI can’t take it anymore. I am convinced enough. I am gonna download G-helper and stop the Asus services as instructed by G-helper. I hope I don’t harm anyone by doing this bc I plan to (again) ask if MicroCenter can compensate me for my troubles and I need to be sure that I didn’t mess my machine up by installing G-helper and uninstalling/stopping the Asus stuff that is apparently bloatware?I am still looking for help so if anyone has any knowledge they can offer to help it would mean so much to me!!!"],"points":0},{"text":["\"Double\" boot or \"false\" boot problem"],"points":0},{"text":["Missing Folder Window, But Can Access in Recent Folder"],"points":0},{"text":["Weird lag issues on a lot of games"],"points":0},{"text":["Windows 11 not opening any programs","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","After a system restore to yesterday's date, I was able to open a web browser and then immediately the PC is doing the same thing. Still unable to open any programs.I haven't downloaded or viewed anything beyond my usual games or websites and this all started happening after helldiver's 2 was installed."],"points":0},{"text":["Computer speakers buzz, but stop if I connect headphones via a splitter."],"points":0},{"text":["PC Rebooting when rendering in Video Editor and Handbrake"],"points":0},{"text":["My pc is slowly breaking","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","I think your MoBo is dying not your whole pc, if you have a friend that has a similar build you can test de individual parts in his MoBo"],"points":0},{"text":["Windows 11 help with network settings.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Rt Click on systray connection,Network and Internet SettingsAdvanced network settingsEthernet (or whatever interface)More Adapter Options"],"points":0},{"text":["Rectangle shaped screen glitch"],"points":0},{"text":["PC monitor keeps losing signal and its really starting to annoy me","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Happens with my father's computer a lot. Or it did until I went in there.PLEASE READ EVERYTHING in the following 2 paragraphs before doing anything.Very basic question - have you tried unplugging and plugging it back in, in both ends? Usually it's a loose cable into the port, but there could be a bend (and subsequent crack) in the cable itself. It could have gotten dislodged by an object falling onto the cable and pulling it ever so slightly. My father had a paperweight actually fall and pull it out of the socket just a hair.When you go to unplug the cable, don't just \"yank\" - actually feel whether the cable is loose and and has give, or if it is tight in the port.","I'm literally having the exact same issue, it started happening after a Windows update but I'm not sure if the two are related. When my monitors lose signal, I'll hear the audio but then it's like everything stops.Shaking my mouse doesn't wake up my monitors, I have to do a restart where it works fine. A part of me thinks it's my PSU but it feels so inconsistent. Because while it has happened while gaming. It also happened while only having Discord open, so it's not like my PC was under stress.It's so weird and I have no idea what the issue is."],"points":0},{"text":["While i was browsing stuff and entered sites here and there, i kept getting pop ups where avast would start warning me and stuff multiple times, as well as when i tried closing them, something about mal/phishing. I had the avast vpn on, but then after closing them i turned it off, am i still safe?","remove avast."],"points":1},{"text":["Omen hp 870-224 will not turn on"],"points":0},{"text":["Bad bass Amplifier","I'd take it to a service center, most bigger cities have one and they're usually not advertised. I wouldn't take it to a guitar center or something."],"points":0},{"text":["2 32gb USB stick just died","Sounds like the USB sticks are not faulty at all, given you can read them from another computer.Linux and Windows partitions are not necessarily interchangeable, meaning a USB Stick created in Windows may not be readable by Linux, and a USB stick created in Linux may not be readable by Windows.I'd presume you have formatted your USB Drive with an incompatible file-system for Windows.Does the USB stick show up in Windows's Disk Management? Can you manage/create/delete the partitions from this tool?"],"points":2},{"text":["Assistance with redirect issue","That would be an issue the website developer has to resolve, eg the State's Unemployment Website maintainers. Your browser is protecting your PC from a faulty website by stopping continued redirects. Effectively, the website has a loop, resulting in your browser being stuck in a loop. Load A -> Load B -> Load A -> Load B -> Load A... eventually your browser says \"something isn't right\" and stops going in a loop, showing you too many redirects.A lot of Government/State websites require a specific Operating System and Browser to accessed successfully. They aren't budgeted very well for developers to accommodate every phone/browser/device, and sometimes you HAVE to use \"Google Chrome vXXXX on Windows X to access this site\". I would consult the website's requirements for your browser if you haven't. Else, this is something they need to resolve on their end. It may even be temporary, and I may suggest waiting 24 hours and trying again."],"points":1},{"text":["airpods keep disconnecting from laptop","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["corrupt files in game","You would need to consult with the developers of \"inscryption\" as to why they have determined your file to be corrupt. This is a restriction/block they have programmed in, and as a result, you will need to consult them on the reasoning.The best this forum can provide is a suggestion to restore from a backup. Anything further you need to work with the creators of the product you are having issues with."],"points":1},{"text":["Keyboard randomly misses keystrokes"],"points":0},{"text":["Help keep finding random files on desktop","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Your desktop is syncing files with your Microsoft OneDrive. The files are syncing from another device logged into your account, which is creating empty Microsoft documents. I wouldn't attribute this to anything malicious, simply that someone or some device you are creating blank documents on, inadvertently. They may just be drafts.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":1},{"text":["UPS Powerstation","I would advise contacting the product manufacturer for assistance,https://switchedhome.com/contact-us/","This could be anything up to a faulty battery. If the unit is new then it should be under warranty."],"points":0},{"text":["Whatsapp backup"],"points":0},{"text":["I'm fed up with continuing to log in into my game regularly purchased on Epic Games.","No not possible","you know you dont own your games right? even your physical games. you own the right to access the game and hold a temporary license. idk how far back that goes but i know since the xbox one/ps4 era started its been that way.for example, if lets say Konami decides since Kojima left the studio they dont want anyone to access his work anymore and they prohibit access to MGS:V files they could do that. and no one would ever be able to legally open the game after that.there is literally nothing we can do about this since one of the higher courts decided endorsed this when it came to their court (idr the case i literally watched a video about this the other day)i cant find the video"],"points":2},{"text":["cmd popup and closes on startup","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Unlikely that it's a virus. A virus probably wouldn't make itself known with a startup script. But seeing command prompts flash on startup is not unusual.Many applications are not monolithic and use shell scripts that trigger engines, daemons, and other components that run as separate applications in concert with the main interface. Adobe Creative Cloud is a famously obnoxious example.You can easily track down which software is prompting those startup scripts by going to the Startup Apps control panel and disabling each active app in turn with a reboot in between.You may also want to look under the Startup folder to see if there are any deposits there. The folder exists within the AppData folder, which is normally invisible. The easiest way to get there is hit Win+R for the Run prompt and enter shell:startup.","If it happens every time it is either a startup item or a scheduled task set to run at user logon. You can use a utility like autoruns from Microsoft to look through everything that runs when you boot in a single interface. If it was just a one time event, then it was likely an update running a script. It isn't uncommon to see various Microsoft products kick up a command window for a second after login. From OneDrive, Office, Teams, I have seen this many times."],"points":0},{"text":["Wifi adapter issue on a laptop","Model of the laptop please.And more likely than not, it has to do with an FN switch and some icon in the F-row of keys."],"points":1},{"text":["Wifi adapter issue on a laptop"],"points":0},{"text":["Laptop Fan problem","I would have to guess you did not purchase an equivalent fan, and as a result, it is not working as expected. There's no more to a fan turning on than supplying power. If power is being supplied to the fan, and the fan is not functional, either the fan is incorrectly or is faulty.","Model of the laptop?When you put in the fan, how did you connect it in? Did you attempt to unplug / replug the wires to ensure it was getting power and a signal from the laptop?I was going to say - had a piece of plastic break off on the bed. A few hours later, the laptop was making a clicking noise. Thought it was going to die - NOPE. That little piece of plastic went into the fan / fan blade (like that scene from Finding Nemo with the rock in the tank?). Opened up the laptop and used an air duster to blow it out."],"points":0},{"text":["Installing the most recent geforce experience update (551.86) caused pink dots on screen and Code 43 on Device Manager"],"points":0},{"text":["system wide sound levelling for streaming","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","The best tech solution to this is adjust the volume and possibly look into a sound system which allows in-line equalization where you can tune the treble/bass, frequencies, as you need.Alternatively, this sounds like it may be more related to a medical issue and less a tech issue. Ensure you have talked to a licensed Audiologist"],"points":0},{"text":["SSD Clicking noise (coil whine?)","Given you have correlated the noise with the fans, I would suspect simply that the fans are being turned on due to heat coming from your new SSD. The clicking is most likely the power supply providing power to the fans, spinning them up, and/or just the clicking sound of the fan itself starting."],"points":0},{"text":["My computer decided to hate samsung","I'd check why by consulting your system logs. This most likely is located in Kernel Messages dmesg or system logs /var/log/(messages/syslog)"],"points":0},{"text":["Spilled tea on my PC tower while on and it's still working","I work in IT and want to play a game!I tell you what every one of my customers do and let you decide what to do. Simple rules. The majority of my customers are intelligent persons like PHD, proffs and doctors and whatever, i dont care anymore about titles and just judge people by how much they annoy me or not annoy me.Everyone who got his Computer wet this or that way does exactly the same procedere while its mostly wet and still dripping: TURN THAT THING ON TO SEE IF ITS STILL WORKING. IF IT IS NOT WORKING TRY TO POWER IT ON A FEW TIMES WHILE CHARGING IT. Let it drip out and wash some drops off and repeat. Go to IT, tell them what you just did and ask them if the Computer can be broken. Dont forget to mention you could normaly log on Windows like always but opening Outlook make a loud bang and your screen turned black. Repeat your question a few times. Ask if its because you opened outlook and mention again you could easy log on windows and also mention that your fingers are still wet from typing your credentials.Think im kidding you? Yes i lied in my first line. I dont want to play this game! You are on your own to figure this out.","Yes. Full stop.Power down. Look it over. Clean up mess with iso alcohol. It doesnt matter if the \"important\" parts get wet, it matters if anything that can conduct electricity gets wet frying other parts of your PC.","In your other comments you state that you can't open the side panel cause you don't have a screwdriver. How can you know there's no tea behind it? Or in other hardly visible areas like under the PSU, or in a drive bay? You ask a question, everyone tells you power it off, clean everything thoroughly, and dry after. If you ask for advice, be ready to accept it. If not, don't waste your time even asking, and our answering.Sure, your pc could be fine, but I really wouldn't take that risk unless you really don't care about throwing your pc away. In a very extreme case it could also lead to fire, sooo... It's your choice I guess?"],"points":2},{"text":["icloud storage help!"],"points":0},{"text":["Easiest way to backup entire windows 11 computer and restore","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["why my computer only boots when I select an empty boot option?","If you connect another bootable media to the PC it may result in the incorrect disk/partition being booted from. The HDD you connected is not simply file storage, it also has an installed Operating System installed, most likely non functional, and is causing your PC to get caught up attempting to boot it.To resolve the issue, disconnect unexpected bootable media."],"points":0},{"text":["Bose QC 20 noise canelling humming, stops when touching metallic surface"],"points":0},{"text":["How to install windows 10 on a new laptop?","https://rtech.support/docs/installations/install-10.html"],"points":1},{"text":["Strange issue when using Smart Fan Mode"],"points":0},{"text":["Changes in sound"],"points":0},{"text":["No Power on Laptop after screen replacement"],"points":0},{"text":["Cloning External SSD to internal SSD"],"points":0},{"text":["Ethernet is not being detected"],"points":0},{"text":["Having WiFi issues","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","A client had an issue that took 3 months of their research to fix (it took me an hour, and most of that was because it was an old slow laptop).Does it recognize other Wifi networks without an issue, but just fails to recognize yours? Or does it do this with all wifi networks?I would suggest finding a stable connection (or using your phone and then transferring the files), and downloading any wifi or network drivers, to start with. Some of the newer routers put out a weird signal that cause issues and makes them reset.","Have you checked your power plan settings to make sure it's not throttling your wifi?","Thank you for the suggestion. Just checked my power plan now and it is set to max."],"points":0},{"text":["What is this chime??"],"points":0},{"text":["Report DDOS/Stress attack?","This was preformed through what I believe is NFO.","There's nothing you can do, if they are attacking servers of the game company, only they may take legal action, you cannot take legal action against them or get any kind of revenge.No idea what NFO method is and I've been around IT security for years, sounds like they're coming up with crap things and using paid booters on websites.NFO could be the server hoster they use and they're just using paid for or compromised servers within there, but again, not anything you can directly prevent"],"points":2},{"text":["(First time on reddit. New Here) Is my Synology choice correct?"],"points":0},{"text":["Step father's PC messes with the internet?","This would indicate his PC is causing interference. This could be that his PC is setup with an IP Address that is conflicting with your network, resulting in traffic being sent to/from his computer instead of the internet, or that his PC has malicious software running resulting in extreme load on the network.I would first try to replace the cable from his PC to the router. Its possible the cable is damaged, wires are crossed/bridged, resulting in unexpected/bad traffic on the network.Second I would reset the suspect PC's network settings, https://www.lifewire.com/how-to-reset-network-settings-in-windows-10-4684679","Sometimes (but not always) a red ethernet light is there to show a device is connected at a lower speed than the actual port can handle. If you look at the network connection on the pc you might find its connected only at 10Mbps.It could be the pc network card if its very old, but most likely the cable is faulty."],"points":5},{"text":["Games looked good and now they dont","Have you got Nvidia Geforce Experience installed?Sometimes it will \"automatically optimise\" games and change graphical settings it thinks will fit your computer, in my experience trial and error works better.Have you checked your settings to make sure you are at the detail preset you want?Render scale set to 100%?FRS or similar settings disabled in game too?"],"points":0},{"text":["Windows virus?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","I believe what you are referring to are Ads. I don't have children, but I get advertised baby products. You may not play the game, but that doesn't mean the company didn't pay to show you the ad anyway."],"points":0},{"text":["No sound on my laptop windows11 need help","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["How to transfer data from Android phone with a dead (blacked out, flashing green) screen?","It is not possible to read the data from the phone without it being powered up past the lock-screen. (If this was possible, there'd be no point in a password/pin/lock-screen, if you can just plug it in and pull the data)If you are unable to get past the lock-screen, and enable USB-transfer, the device, the data is unfortunately unrecoverable."],"points":0},{"text":["How do i connect nintendo switch to my pc","What motherboard do you have that has hdmi input? if not built by you, what model is the machine, can you send an image of this HDMI input as I'm unaware of any motherboards ever having hdmi inputs, this sounds like an expansion card of some kind but without an image, a make or model and more information, we can't helpThere's many reasons this may not be working, you've given no information whatsoever","I would consult your PC's manual for how to use the HDMI Capture functionality. HDMI input comes into the computer like a \"webcam\". Dependent on your HDMI Capture functionality, you may need to simply select this Video Input/Webcam for Discord.","i do have the deck and i just can't get it to work","That HDMI port is to send a video signal out to a monitor, not in from a device. You’d have to purchase a HDMI PC Capture device to do that.","If your computer has a built in HDMI In port, it would come with the necessary drivers and other software to capture that input. If this is a third-party capture device (PCIe card, USB dongle tc) it should also come with the necessary drivers etc, or they would be delivered via Windows Update.Once you are able to confirm the video capture works with the vendor supplied software, you can try it with other software. You should be able to select this input as a video source for OBS, Discord streaming etc.If it doesn't work or you didn't get any vendor software, in all likelihood you're mistaken about the HDMI port being for video capture."],"points":2},{"text":["Storage on PC not showing correctly on main hard drive"],"points":0},{"text":["Airpod Pro 2 adaptive listening issues"],"points":0},{"text":["Internet disconnects entirely only when playing an online game, have to reset network and restart PC repeatedly to make internet work again."],"points":0},{"text":["File previews not loading (windows 10)"],"points":0},{"text":["Xbox controller","Your issue is most likely nothing to do with your controller, and more to do with the software product you are trying to use.A Controller is not much more different than a keyboard. It doesn't matter what keyboard you use to play your game, it matters what key-bindings are setup. In your case, the software product is responding to the Xbox controller joystick movement, but is not responding to other button presses. This is up to the software product to respond to the key presses, your Controller is functioning fine. Effectively, consult the application developer/documentation."],"points":1},{"text":["Biometrics Problem"],"points":0},{"text":["My isp’s signal was too high and my modem was overheating. What causes the signal to run too high?","Cable modem? Junction box could have had a lot more hookups previously which were removed, maybe you have a signal amp in loop Wich used to be needed. we had a vecima system at the place I used to work at and dealing with signal strength was an ever ongoing battle","Similar to a speaker, when the room gets noiser and noiser, the speaker is turned up so it can be heard. As the noise is reduced, it sounds like the speaker was never turned down."],"points":1},{"text":["IPhone randomly gets brighter","some people upload in HDR there unfortunately nothing can be done about this. and cannot be disabled."],"points":0},{"text":["Trying to delete .tif files","You want to delete all tif files in a directory and subdirectories?","If you've confirmed that the files exist, despite what the del command is telling you, then it could be be file ownership issue.Open a command prompt as administrator and enter the following command:takeown /f \"C:\\path\\to\\file\\example.txt\"","How many TIFF files do you have?del *.tifwould delete all the files.See https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/del for details."],"points":0},{"text":["Windows Laptop Making Up 400GB of Storage"],"points":0},{"text":["Dualshock 4 controller controls my pc.","I assume you shut down steam entirely and it still does it?Go to your hardware tab and check for HID-compliant mouse. Are there two showing? If so, try disabling one (if you get the wrong one, you WILL need to use the PS4 controller to fix it likely, since you just disabled your main mouse). Do the same with the keyboard if so.If neither of those, I would assume some program is doing it, and disable all startup programs then re-enable them one at a time until you find it."],"points":0},{"text":["Samsung Gallery is not syncing with OneDrive (but Onedrive with the Gallery does?? It is possible??)"],"points":0},{"text":["Files on USB drive won't show","The data could be corrupted however before that try doing this.Open Windows \"File Explorer\" > Go to \"Tools\" > \"Folder\" Options > Go to the \"View\" Tab > Check \"Show hidden files, folders, and drives\". Finally, click \"Apply\". This will make sure that the files and folders are not in hidden mode."],"points":0},{"text":["Why's my gaming notebook underperfoming? Help?","In a general sense, yes, laptops/notebook performance is lower compared to a desktop. \"GTX 5080\" on a Desktop will perform much differently than a \"GTX 5080(M)\". Similarly, \"i7-9750\" on a desktop will perform much differently than \"i7-9750(H)\".I would ensure you are plugged into a wall outlet and take a look at your temperatures to see if the system is heating too much resulting in a need to slow down the computer to prevent overheating."],"points":0},{"text":["Computer booting/starting issues after installing additional SSD"],"points":0},{"text":["Hard Disk constantly loses power and restarts"],"points":0},{"text":["Laggy laptop and windows updates take hours","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","The HDD is what's really killing you here, though the CPU is kind of a dog and 4GB is gonna be basically maxed out just by the OS itself.But even if you had 48GB, Windows 11 on a HDD tends to be rough until it's all settled in, and while updates are installing it'll be all but unusable. Especially if it's a slow 5400rpm drive, which it probably is.In other words, get an SSD. And while you're in there, see what the RAM situation is (1 slot or two?) and if at all possible bump it up to at least 8GB, if not 16."],"points":0},{"text":["Is the *Lenovo ThinkPad E531 64-bit* upgradeable to *Windows 11*?","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","You could force it with Rufus or edits, but it will not be very fast"],"points":1},{"text":["Blade 14 exceeding geekbench score but not reaching cinebench’s score?","this is the expected cinebench link and this is the link to the expected geekbench scores"],"points":0},{"text":["I need help with security","No they can't.","Seek a mental health provider to at least get evaluated please.","Maybe but it’s unlikely, what phone do you have","IOS is a pretty damn secure system. What do you mean 'get in your screen. That doesn't make any sense. If you mean bypass your lockscreen without any interaction with the device? Yeah, stop being paranoid.","Unless you let them install apps that allow monitoring, they cannot."],"points":6},{"text":["External hard drive has been scanning and repairing for 2 days."],"points":0},{"text":["Games exit/crash within about 10 minutes of Game play on new prebuilt","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","sounds software related"],"points":0},{"text":["Displayport out stops working during boot up."],"points":0},{"text":["Appropriate waiting time","If you have another plan lined up for the device, such as you've found another place for diagnosis, I would indeed go ahead and request your system back. Though, don't expect to not be charged/hassled, as even bringing your system into their place of business is billable time, albeit very minimal.Else if you want the PC back just to sit there and continue to be non-functional, I'm unsure of the gain."],"points":0},{"text":["My headphones started acting weird."],"points":0},{"text":["How to save online forms with the scrollable text area/text input fields expanded","If this is a Windows PC, I would recommend trying to print, then choosing save as PDF where you choose a printer."],"points":0},{"text":["Nintendo DS","While not easy, with enough skill and time you may be able to make a manual repair on the cable. You just need to re-connect the respective wires together. I'd suspect this would more more work/effort than just purchasing a replacement part."],"points":0},{"text":["Need help with surface laptop and peripherals"],"points":0},{"text":["Having Thermal Issues with PC","Improving the cooling of components within the PC isn't going to reduce the actual amount of heat it's producing, it just means the 600w or whatever of heat it's producing will just get pushed out of the PC case into your room quicker.The only way you're going to reduce the amount of heat it produces is by reducing how much power it uses."],"points":0},{"text":["Samsung phone microphone not working"],"points":0},{"text":["Monitor no signal after adding ram","Do a cmos reset. Try switching them around. If neither of those things work, try booting with only the 8gb stick.","also check if your ram is seated correctly."],"points":0},{"text":["Open files with physical button","The Elgato Stream Deck hardware does not support mobile operating systems, per their product page.Also the word you're looking for is \"specific\"."],"points":0},{"text":["Intermittent Slowness"],"points":0},{"text":["Gaming PC issues."],"points":0},{"text":["BSOD After Logging In","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["laptop not Turboboosting","Open up the Windows Power Options and press the Restore plan defaults button for whatever power plan you are using. The Balanced power plan is the default plan that most people use.https://i.imgur.com/kwrBkku.pngMake sure the Maximum processor state is set to 100%. Setting this to 99% disables Intel Turbo Boost. If this does not solve your problem then your BIOS might have a bug. Most likely just a Windows bug.When using ThrottleStop, clear the Disable Turbo box, press the Save button and exit ThrottleStop. The next time you run ThrottleStop it will clear the Disable Turbo setting. ThrottleStop does not make any changes to the BIOS or to the Windows Registry so you will have to run ThrottleStop each time you boot up. Follow the Task Scheduler Guide to start ThrottleStop when you log into your Windows account. Problem solved.https://www.techpowerup.com/forums/threads/effective-clock-speed.293296/#post-4749675"],"points":0},{"text":["PC really stuttery after upgrading GPU","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Okay so my first guess would be error with pcie slot. I had something like this before and I moved it to an X8 slot and it worked perfectly. Second guess would be bad PSU. Third guess would be bad gpu. Bc the gpu is the most recent component installed, the chances of this are pretty high. Also it’s unlikely but ram can cause general instability so I’d reseat ram just to be safe. On am4 my motherboard used to be extremely picky and would give me errors if it experienced any movement bc that would disrupt the ram position"],"points":0},{"text":["My screen goes Light Green, Brown, Black and Pink.","The first step would be to check that all your external connections incl. ports and cables are good and then installing/reinstalling the latest driver for your card"],"points":0},{"text":["Laptop crashes, BSOD, I have minidumps and crashlogs.","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Unfortunately, this is a hardware issue. Your system drive is malfunctioning for some reason. The usual recommendations are:Reseat the drive in its m.2 slot (it's surprising how often that works)Make sure the drive is getting good airflow. Heat can cause the drive controller to malfunction and reset which makes the drive disconnect - which is not something Windows expect to happen to a system drive. When was the last time your laptop was opened up and thoroughly cleaned of dust?If the motherboard has more than one m.2 slot try the drive another slot.If none of the above stops the crashes then you likely need to replace the drive.","From the dump you provided, you're getting an WHEA_UNCORRECTABLE_ERROR (124) in GenuineIntel.sysWhich... unfortunately doesn't tell us a whole lot, lol. It leaves things open to the processor, RAM, chipset, video, etc. Have you run a memory diagnostic? Have you tried the Intel Processor Diagnostic Tool?I've previously encountered a very similar thing that was caused by an Intel graphics driver; I know you've said you updated everything, but do you happen to know if the graphics driver was updated around the time the BSOD's started? Either from the Windows Update history or manually? It's entirely possible that you're experiencing a bug caused by the latest driver, that didn't exist in the prior release."],"points":1},{"text":["Question about a flash drive.","I plugged it into a different computer and it still didn't show up.Should I take it to Best Buy and try to get all the files off of it?","make sure nothing inside USB like pocket lint...​maybe try a different OS like Windows, Mac, or Ubuntu"],"points":0},{"text":["I can't understand how to use windows file recovery, please help..."],"points":0},{"text":["Possible GPU failed on integrated CPU/GPU? Can it be fixed?"],"points":0},{"text":["PC is so slow","First: post a screenshot of your task manager (ctrl+shift+esc to open) We need the full specs. What exact model of i7 processor. What is cooling it? Is your windows on an SSD or a HDD. Is your monitor plugged into the mainboard or the graphics card?","There are many tutorial to speed up your Windows18 ways to speed up Windows 10https://www.computerworld.com/article/3029168/how-to-speed-up-windows-10.htmlPersonally, I like to disable System Restore, but this is dangerous, if you get attacked from Ransomware.I think modern Anti Virus (paid) have special protection feature to prevent this. E.g. Norton Antivirus Plus or Norton 360. I use this product for my personal computing usage."],"points":3},{"text":["Question: Swapping out my old motherboard for a 'new' one but both are in the same series","If it's in a similar series of boards and the same CPU, in most cases I wouldn't have thought you'd really have to worry too much, and Windows should at least boot up fine. Although you may want to just reinstall the chipset drivers just in-case, and you may have to reactivate any Windows activations.It's generally only when you're switching to a completely different manufacturer's chipset that you get huge issues that usually require a complete reinstall. Or presumably if you've got any of that Bitlocker drive-encryption stuff enabled, which is presumably tied to the trusted-platform module thing on the motherboard."],"points":0},{"text":["I broke the HDMI ARC port on my soundbar. How can I fix it?"],"points":0},{"text":["my xbox controller is broken"],"points":0},{"text":["How do I take off the fan of an AMD cooler from the 2006 era?","Flip the black piece to the other side, then push down on black piece until the metal hook comes off that side. Then lift it up and push down on the other side until the hook can come off the plastic piece holding it on."],"points":1},{"text":["laptop doesnt see disk in boot menu"],"points":0},{"text":["HP DeskJet Ink Advantage 2600 All-in-One Printer series"],"points":0},{"text":["A repeater is connected to your system. PROBLEM"],"points":0},{"text":["No dial tone on VoIP phone after installing new router (TP-Link Deco X50)","VLAN tagging most likely."],"points":0},{"text":["MSI KATANA 15 B12V i7 RTX4070 16GB RAM 1TB SSD laptop freezes and resets while playing games."],"points":0},{"text":["GPU and iGPU confusion","You have both a dedicated GPU and an integrated GPU (iGPU). Your computer picks which one to use based on the task. For simple tasks, it uses the iGPU to save power. For tougher tasks like gaming, it should use the dedicated GPU.To make sure your dedicated GPU is being used: Check power settings. Set to \"High Performance.\" Update both GPU drivers.In GPU control panel, set dedicated GPU as default.Usually, no need to disable iGPU. Let your system decide based on the task."],"points":0},{"text":["Can I connect my Apple monitor to my windows pc?","I assume by apple monitor you mean an iMac ? Only certain ones can be used as a monitor and it hasn’t been supported for sometime. The last model that supports that was from 2014.","Which Apple monitor is it?"],"points":1},{"text":["Multiple Slave Router","You should only have 1 router. That is 1 device acting as router. Possibly the routing functionality of the other 2 devices was turned off making them act as a switch/access point. Which is what they should do in your situation.A power outage or something could have caused the device(s) to default and turned them back into a router. Can you log into the devices? Only your main router should have dhcp enabled and be handing out ip adresses."],"points":1},{"text":["Issue with 5.1 Audio from Smart TV to Denon AVR."],"points":0},{"text":["iPad to TV?"],"points":0},{"text":["Please help, my phone is stuck on a light blue screen saying it updating, but it has been like that for too long and the cancel key just shows the Samsung logo and then it shows the light blue screen again","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["SSD seems to be having an error. Checkdisk is estimating 500 hours to scan and repair. What the hell do I do?","Backup anything that currently is not. RMA or buy a new drive."],"points":0},{"text":["Brand new HP battery not charging beyond 79% and needs calibration"],"points":0},{"text":["Custom pc randomly shutting off"],"points":0},{"text":["Can I change IrfanView image zoom method?","Yeah, you can tweak IrfanView settings to change how it zooms. Look for an option called 'Resample during zoom' or similar and disable it. This should let you see the actual pixels when you zoom in, without the blur.","Go to View -> Display options (window mode) -> untick Use resample for zooming"],"points":3},{"text":["Problems with PC: not sure if it's WiFi issue or computer based issue.","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","It's not about your WiFi. It's more about your computer not being strong enough for these games.First, make sure your PC is good enough for these games. Check the game's requirements and compare them with your PC's specs.If your PC is strong enough but still has problems, it might be getting too hot. Big games make your computer work hard and get hot. Make sure it's clean inside and all fans are working.Also, update your graphics card drivers. Old drivers can make games run badly. Go to the website of your graphics card and download the latest drivers.Lastly, use Task Manager to see if your computer's parts, like the CPU or GPU, are working too hard when you play. If they are, you might need to make the game's settings lower or think about upgrading your PC."],"points":1},{"text":["Nvidia 4080 black screen on one monitor but not the other"],"points":0},{"text":["Games crash upon launch with new components ( 4090 / i9-14900k )","If the GPU does indeed reflect the right amount of memory in Speccy or GPU-Z, maybe boot from a Windows To Go instance and see if the issue is your Windows install. If so, repair or replace as needed."],"points":0},{"text":["BIOS can't recognise M.2 NMVE SSD"],"points":0},{"text":["Stripped screws in phone","Take it to a repair place."],"points":0},{"text":["Lenovo laptop"],"points":0},{"text":["Can't connect my phone to Insta360go 1"],"points":0},{"text":["Safe to use a hotspot at work for privacy?","If the computer is provided by your company, or you're logged in with a work account then assume that you can still be monitored, even if you're not using their wifi.But if it's a private device, then you're probably fine.","vpn is best, boss will know someone is using it, but not who or what","You have a vpn connecting to your companys domain?","there's bluesnarfers","Get a vpn"],"points":9},{"text":["Forced Alt-Tabbing in Games"],"points":0},{"text":["Space on C: drive randomly fluctuating? Windows 10","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","If the space is slowly going down over time, and then it goes back up again on a restart, then it's likely just the Windows page-file growing in size over time. The page-file is used when there isn't enough RAM available, so Windows offloads some stuff onto the hard-drive as a temporary measure.It can grow in size if you load up anything particularly memory intensive and Windows needs the extra memory, and then I assume it usually doesn't shrink back down automatically until you restart and it clears everything out and starts afresh again.If you want to identify what is using up your hard-drive space in general, you may want to download something like TreeSize Free or WizTree; which can quickly give you a breakdown of what's using up your hard-drive space."],"points":0},{"text":["Windows 10 install not working","\"No Boot Filename Received\" sounds like a PXE error, which means it doesn't for whatever reason see any bootable devices locally, so the PC is trying to network boot. Which isn't what you want it to do.F10 is usually the boot key for Intel motherboards; when you try pressing that repeatedly immediately after turning on the machine, do you see the boot menu? If so, is the USB stick visible there?"],"points":0},{"text":["Will core i5-13400f run with 6000 ddr5?"],"points":0},{"text":["Windows 10 wifi problems. No wifi option in Network Settings.","That you most likely have a wifi card somewhere in your computer thats not happy, or shorts out or something.My desktop computers both got a small small wifi card, in a similar slot like nvme ssd.You might have to remove that.That's just me guessing wildly tho.","Have you checked to make sure you don't have your PC in flight mode?"],"points":0},{"text":["Hearing sounds that sounded like someone else's mic over my computer","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","This is usually caused by radio interference getting picked up by long audio cables acting as antennas."],"points":0},{"text":["Hackers got into my outlook and now I cant get in.","i assume you have tried to reset your password https://support.microsoft.com/en-gb/office/my-outlook-com-account-has-been-hacked-35993ac5-ac2f-494e-aacb-5232dda453d8"],"points":0},{"text":["HDMI Switch","You don't need a switch. Just turn on both monitors and set the second monitor to mirror the first. It will mirror the first any time you turn it on.","Windows, Mac and Linux can all do what you're asking natively just by changing the display settings."],"points":0},{"text":["New laptop buzzing freeze","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","The laptop is Acer Aspire 3 NX.K6TEU.009"],"points":0},{"text":["How to connect a 7.1 surround system to one line-out?","Not a tech expert. Just a long time PC user here who loves my name brand sound cards and surround sound systems too. Some google searching shows many people unhappy with the audio capabilities of that board when it comes to compatibility with certain surround sound systems.Looks like your options are to try your luck with an optical cable but that will probably result in only a stereo signal at best.I owned a first generation Xonar DGX which remains my favorite sound card to date. But it had a similar quirk to what you are describing. Some of the first gen DGX did not play well with official drivers and it would cause driver corruption that would result in audio crunchiness, lagging and crashes. I would have to use something like DDU to clear out the old audio drivers using the audio driver uninstaller part of the program. Then reinstall the drivers again to regain functionality. Then I found the UNi XOnar Drivers, unofficial drivers, that worked much better. I don't use it anymore but it still was my favorite card.If you cant wait or get audio through the optical try cleaning out the old audio drivers with DDU. Reinsert the card and try clean installing the official drivers. Hell, try those UNi Xonar drivers if you want to.","What is your 7.1 system? Kind of hard to figure out how to connect to it not knowing that."],"points":0},{"text":["Galaxy S8 battery hypothetical"],"points":0},{"text":["Sudden RAM issue.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Update: Installed newest BIOS, updated graphics drivers, nothing. Still only utilizing 2GB. I do see where it says “Hardware reserved: 30GB” so that’s what I’m trying to fix now"],"points":0},{"text":["I have an expanded energizer power bank how do I get rid of it","In the US and Canada, look up your location at https://call2recycle.org."],"points":0},{"text":["Audio preview and control won't go away."],"points":0},{"text":["Monitor problems driving me insane!"],"points":0},{"text":["Bulk screenshotting websites and turning into PDFs"],"points":0},{"text":["Pc booting issue"],"points":0},{"text":["How to install software on external harddrive?","Not really, for the exact reason you describe. A lot of software follows some general conventions about where they put their data.There's a big advantage to doing this, if you separate stuff like user settings and data in the right place you can avoid accidental deletion and different instances of the same program can access the same files.Look for a 'portable' version of the software you need. Often times there's either an official or unofficial version that can be simply dragged and dropped onto a USB drive, and which has been specifically designed to keep any persisted data in the same place as the program.But if there's no portable version, you'd have to resort to something much more advanced like creating a bootable USB stick with it's own operating system that you can then load on other machines. But the instructions for creating such a thing is beyond what, I atleast, could reasonably describe in a reddit comment."],"points":1},{"text":["PC suddenly started crashing and freezing during bootup","Check for temperature related problem. Your CPU HSF clogged with dust? Thermal paste dried up? Check for GPU dust also.How to Clean & Service Intel CPU Heatsink https://youtu.be/chCi5RdLYqg?si=oRxKTk-XFIXTj8VbHow to Corectly Deep-Clean Your Graphic Card https://youtu.be/DujnvdhGphk?si=-QsA-dPTKUOtnYTDThere might be error related to CPU temperature recorded in BIOS.Try to clean RAM contact with soft pencil eraser or contact cleaner spray.How to Clean RAM Using Eraser https://youtu.be/AO0mYuhGYls?si=bJJqPXJSWwsWhC5m"],"points":0},{"text":["Can't fast charge when connected to laptop with USB-C port"],"points":0},{"text":["trying to use my Apple earbuds mic (wired)"],"points":0},{"text":["OST In use issue"],"points":0},{"text":["Google critical security alert ?","Yes, it's legit. Usually refers to an unrecognised device attempting to log into your account with your credentials."],"points":1},{"text":["Run a script when a program is launched or closed in Windows 11","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["High ping while gaming even on different internet connections.","This needs a lot more info.What are your specs, OS, what connection you use, are your drivers correct, etc.What do you mean with internet lag on an offline game?"],"points":0},{"text":["Need help with old Sony Vaio laptop"],"points":0},{"text":["Booting Lenovo V15 G4 AMN; Stuck in Windows"],"points":0},{"text":["Need help with drivers.","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Go to device manager, there should be 1 or more entries that are expanded (vs normally collapsed tree items) with a yellow ! next to them.Right click it (them) > properties > details > in the drop-down pick 'hardware id's' and post the top 3 lines of it/them"],"points":0},{"text":["Computer stuck on desktop","What kind of computer, what kind of specs, the issue specifically being: you're unable to use the computer for anything BUT the file explorer?If that's the case this happened to me a few months back."],"points":0},{"text":["The strangest and weirdest issue I have ever witnessed in my life. WINDOWS 10 PC","It might...?How specifically did u make the macro?If there's software w/ ur KB, u could try deleting it, or resetting it.If it's activating completely on its own, then you've kinda got an issue","The Razer blackwidow has on-board memory so you can store things like Macros and lighting profiles and use them on other devices.You need to remove the macro with Razer Synapse, it should be visible if you install it again.","Create a new user and see if it still happens there.In your current user, open task manager and check the list of startup programs. Post a screenshot of it if you want some advice.","Autohotkey scripts would show up in the running apps area on the bottom right of your task bar (the up arrow or tiny app icons). Have you tried deleting the script itself instead of just ahk?"],"points":1},{"text":["HDD PCB Swap without keeping the data","Yes you do, you'll need to transplant it to the donor.","If you don't care about the data this is not a worth the time and money to do. Especially not for a 6TB drive."],"points":0},{"text":["Should I upgrade my Sennsheiser HD 4.50 BTNC for gaming"],"points":0},{"text":["Problems with windows"],"points":0},{"text":["pc doesn't start","Hey, It's a good idea to post exactly what model/type of hardware you're using.Say, for instance: kingston 16gb 3000mhz(even adding some serial number)."],"points":0},{"text":["I Gave Myself Permission to the WindowsApps Folder and now I Can't Open Any Windows App, Please Help.","https://github.com/AgentRev/WindowsAppsUnfukkerThe script naming is not the most professional, but you can look at the source code and see it's not doing anything malicious."],"points":0},{"text":["May this RAM issue overheat my problem?","If you suspect your computer might be running low on memory, please see \"How to know if you need more RAM\".Please ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Notebooks in general running way hotter than PCs because of their small build factor.In your case it can be a clocked fan or dried thermal paste. Or your hardware is to weak to run these games.","Don´t think less ram usage would help your temperatures. When you laptop is old, maybe its fans are dirty and you should clean it. And look if it gets enough airflow, so using it on the bed or so can block off air to your fans and cause overheating.If nothing else helps, maybe limit fps to 30 or 60 so your cpu/gpu has to work less and keeps cooler."],"points":1},{"text":["Inadequate laptop perfomance in games"],"points":0},{"text":["Windows virus?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Do the malware guide recommended by the AutoMod, or completely clean your drives.Does not seem safe."],"points":0},{"text":["Is a 900 watt UPS enough for a gaming PC that outputs 600 watts?","Yes it should work for a gaming pc"],"points":0},{"text":["W11 IDLING AT 80% RAM?!","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","It could be many things, like how many startup apps you have (I use AutoRuns64 from Sysinternals Suite to take most of them out, along with Scynex to get rid of Telemetry and Bloatware) along with if a certain app like chrome needs to cache web pages, ram leaking all the good stuff","Hard to answer with no information.Post a screenshot of task manager sorted with the highest ram usage at the top."],"points":0},{"text":["Help blue screen","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Pen is detected by the laptop and can hover over items but won't click","There is a chance the tip might be worn or there's a bit of dirt between the nib and the pen"],"points":0},{"text":["Desperate about ongoing driver issues and and BSOD problems on my new pc","UserBenchMark is inaccurate and biased. It should not be used to determine a problem, compare hardware, or perform benchmarks. It is in our blacklist for this reason. For more information regarding why not to use UBM, visit: https://www.trustpilot.com/review/www.userbenchmark.comI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Need the dump files."],"points":0},{"text":["Windows virus?","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Deleted videos on my phone keep coming back","Sounds like something is syncing the videos back to your phone","Update: the videos came back and the ones i deleted from Mi video didn't, so i guess that's were the issue is. Still, they are not all in one folder in Mi video, but are distributed in two, so i can't understand why only those videos come back and not also the others or any other file at all, i can't find any useful option about sync in there."],"points":2},{"text":["Random PC Lag across various applications during daily use"],"points":0},{"text":["Running 20-90% on any program or action, help.","To put it bluntly, this machine is not very strong. The J3060 has a Passmark score of 665, whereas a CPU worth $200 (the i5-13500) has a Passmark score of 32,067- a power difference of nearly 50 times.Aside from that, it's also likely using an HDD instead of an SSD so the 100% disk active time is also causing some of the performance issues."],"points":1},{"text":["Assistance Required: Gigabyte Laptop Display Issues"],"points":0},{"text":["Sd corrupt/capacity lost"],"points":0},{"text":["Evident id"],"points":0},{"text":["Recording phone call on desktop computer"],"points":0},{"text":["Internet connection doesn't work on every browser for 15 seconds after you open it","Little update: microsoft teams have the same problem","Both Edge and Teams are actually just modified version of Chrome that are disguising themselves as being other apps.Can you try downloading Firefox and seeing if that has the same issue?"],"points":0},{"text":["Someone Reset my Brother's Phone through Google's Find my Device","Rule 3. Can't help you. It sounds like your Google account on the device was compromised. If they reset the phone via a browser (not locked, reset). They probably have a new phone unfortunately, no way to get it back."],"points":0},{"text":["iPhone 13 Black Screen"],"points":0},{"text":["Is this problem my graphics, monitor or drivers?","Yes, it's most likely was used in mining or just died. Main crystal or vram is dead. This causes artifacts and not being able to initialize videocard as your device manager says."],"points":0},{"text":["Monitor setup?","It will be depending on the spec. of the two monitors and the laptop.What are the two monitors' brand and model ?The brand and model of the laptop ?Normally, a dual-monitor sharing KVM switch should be good enough. However, different laptop may be required some converters/ adapters to provide correct video output (s) to the KVM switch."],"points":0},{"text":["intel optane memory service"],"points":0},{"text":["Cudy router is not receiving a signal"],"points":0},{"text":["PC crashes when G920 is plugged in","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["how to turn on advanced BIOS"],"points":0},{"text":["How to fix corrupted external SSD","I’m not totally sure about this, but I remember reading somewhere that doing a full format could potentially save a disk if the corruption isn’t too severe.","Do you have all of the data you need backed up from this drive? You have not made that clear."],"points":2},{"text":["Only one side of headphones work"],"points":0},{"text":["Webcam making into Victorian child","You need light. A desk lamp behind the laptop may be enough to improve things a bit."],"points":0},{"text":["What's the worst thing that can happen while testing mystery laptops?","I removed the ripped display, camera and digitiser cables to avoid shorts. Would it work without?Yep, without any problems.Also, if i were in your place, I would remove that battery. That's kinda the only thing that can actually catch fire and it might be damaged. Apart from that you should be good to go."],"points":2},{"text":["Monitor randomly gets \"No signal\" and switches to laptop display"],"points":0},{"text":["Please help me find a solution to easily switching my monitors and USB devices between two computers!","short answer. you cannot.Switches and KVMs add enough latency that you cannot maintain really high framerates like that. At best, do direct connections for your monitors, so that you are always connected, and then use a KVM for everything else."],"points":0},{"text":["HP Laptop CPU Caps at 0.39 GHz","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Steelseries Sensei Ten freezes unless unplugged"],"points":0},{"text":["Why are mouse keys not working? (Windows 11)","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["How can I tell in my Timetec SSD drive from Techno Intelligence is fake?","Timetec literally just rebands cheap drives, they basically already are fake. Though they are the correct size, so a 2TB drive is a 2TB drive.But the way to test this would be to run one of the many storage size verification tools like Validrive or FakeFlashTest. But note that any tool that actually verifies the size of the drive will waste an entire write cycle on the drive.","Never go cheap on parts that store your files.Especially these no name brand are often fake. Maybe they just bought it from a untrusted seller.Get a reliable brand. Ssd nowadays are cheap."],"points":6},{"text":["Computer won’t fully shut down.","your hibernate file is not setup for that PC. boot in safe mode and remove the existing swap and hibernate files.google in this case, i haven't done either in a while.the hibernate file is used on windows shutdown to store information so that the next time the PC is used, it can boot faster. This is also why sometimes after moving a drive to a new computer, it tries to repair the install because the hibernate file contains information on the old computers drivers and thus fails to load things properly."],"points":0},{"text":["RAW HDD after deletion of a 101mb partition that was unallocated"],"points":0},{"text":["error and not booting","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Intel i7-9700K stuck at0.79/0.80GHz please help!"],"points":0},{"text":["Internet connection is bad on pc but perfectly fine on phone whilst on the same WiFi and in the same room","Do you know the model of your WiFi card? You can find its name either in the Device Manager or in the Task Manager under the performance tab."],"points":0},{"text":["Lost all my files on my Micro SD Card"],"points":0},{"text":["How can I use my headphones without switching 3.5mm plugs in my KVM setup","If your KVM switch have an USB 3.0 sharing port, please plug an USB audio DAC unit onto the shared USB port,you can have the DAC unit provide both 3.5 audio i/o and USB converting sharing for audio and microphone."],"points":0},{"text":["System license violation","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Check prior replies. Might have a fix. Example: https://www.reddit.com/r/techsupport/comments/r1j5m3/system\\_license\\_violation/"],"points":0},{"text":["About to pull my hair out. How to gather data Teams connection issues"],"points":0},{"text":["PC Video Game Download Speed","Steam can display download speed in either bytes (B) or bits (b) per second - have you double checked whether you were seeing megabyes (MB) or megabits (Mb)?6 megabytes (MB) = 48 megabits (Mb)"],"points":0},{"text":["Need help with terminal commands in Linux (AlmaLinux).","Commands presented below are done as root.Assuming you have given your VM a new disk (5G, that's done through VMware). Let's say it shows up as /dev/sdbpvcreate /dev/sdbvgcreate mynewvg /dev/sdblvcreate -n myvol1 -L 3G mynewvgmkfs.ext4 /dev/mynewvg/myvol1lvcreate -n myvol2 -L 2G mynewvgmkfs.ext4 /dev/mynewvg/myvol2Binary math when doing things like that sometimes doesn't quite add up 2 + 3 != 5. So, the last lvcreate, could be of the form:lvcreate -n myvol2 -l 100%Free mynewvgThen create your mountpoints, edit your /etc/fstab and mount. Obviously what I just said is something many people do. You could have some sort of automount arrangement or other thing happening that actually mounts the filesystems.Bonus: I'm out of disk space on /dev/sdb.Been awhile since I've used the \"workstation\" product, more familiar with VSphere. So, I'll present two approaches. The first one is more generic and will work with most anything.Create new disk in VMware, let's say it shows up as /dev/sdcpvcreate /dev/sdcvgextend mynewvg /dev/sdc... you now have more space to create more LVs... you could grow existing LV as welllvextend -L +1G /dev/mynewvg/myvol1resize2fs /dev/mynewvg/myvol1The other technique is to grow the existing PV disk, /dev/sdb. Assuming you can do that in your hypervisor, and assuming you can do that while the VM is up:echo '- - -' >/sys/block/sdb/device/rescanpvresize /dev/sdb... you now have more space to create more LVs... etc."],"points":1},{"text":["Second monitor not working specifically with new laptop","HP Elite book 840Which one?the second monitor.Which ones?"],"points":0},{"text":["Dell laptop (W11) randomly rebooting - critical errors, kernel-power, bug check 159","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Not sure how to boot my PC up for the first time?","i guess you have checked that the hdmi cable actually works by using it on something else","If the fans spin up to 100% at boot and never spin down, I would verify the CPU is socketed properly and the CPU power cord from the PSU is firmly attached."],"points":0},{"text":["Virus escaping factory reset","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Re install windows via USB stick.The reset option isnt really great Or secure.And use only Windows defender paired with a ad blocker"],"points":2},{"text":["NVIDIA quatro 880M drivers out of date","Kepler is indeed mostly abandoned now, but there's still a lot newer than the one you've got there, currentest should be this https://www.nvidia.com/Download/driverResults.aspx/218807/en-us/","Honestly, quadros aren't designed for gaming and it's a card from 2010. I'm sure you COULD run some games on it, but it'll likely be a pretty bad time. Have you tried setting the installer to windows xp/7 compatibility mode?"],"points":1},{"text":["RDR2 KEEP GREEN SCREENING"],"points":0},{"text":["My new PC is lagging","is it all of the drives? it's possible one of them is slower. if not I don't mean to give the obvious answer but I guess check Internet speed. toggle between wired connection and wireless, wifi antenna in the room maybe as well. hope that at least helps a little bit"],"points":0},{"text":["My SSD keeps losing space","You can use a tool like WizTree to find out where that space is being allocated.","How big is the drive? At 450mb a minute the drive would be full pretty fast relatively, since that comes out to about 650GB per day."],"points":0},{"text":["Ram Lifespan ProblemsOn Gaming PC","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Sounds like motherboard issues, especially if 3x sets of RAM all failed when attached to it. I'd start there, assuming your BIOS is current and that didn't solve the issue."],"points":0},{"text":["Memory Ram Problem","Check in Resource Manager > Memory > Commit total and see if that gives you a better idea."],"points":0},{"text":["Computer keeps sort of tabbing put every 15 seconds or si"],"points":0},{"text":["Beginner trying to Dual Boot","Your BIOS already supports UEFI. Try this guide and see if your UI is the same as the B390.Sorry I can't help with the dual booting aspect- but I'd rather not comment on something I have little experience with."],"points":1},{"text":["GPU too hot","Solved: just the airflow. 10m on 100% and still on 45°C.","I'd just go with a repaste if needed, but pads and paste aren't going to fix a bad airflow config.","I'd probably fix the airflow in your case first.","Did you check the thermal paste before you bought the GPU?Try and get a better case for your PC. In the mean time, undervolt your GPU and install MSI afterburner, the automatic fan adjustment’s do really well with keeping the tempers lower"],"points":2},{"text":["\"Wi-Fi doesn't have a valid IP configuration\"","What is the bad config, a 169 or something else?"],"points":0},{"text":["How do I restore deleted files?","check the recycle bin, if they are in there then you can restore them if not then they are gone","First of all.Backup your files.Propably a damaged drive.Best would be to clone the drive and try the file restore on the new drive.Than use a recovery software and see what they find.But if it was just the 86 folder I wouldn't try to restore anything. Only some programs get stored there.Get a new drive and Re install windows.","You should turn off the computer immediately before continuing triage. I'm not 100% sure, but if it's an SSD you're on the OS may continue to issue TRIM commands and cause more data lossWarning from the /r/datarecovery sidebar:REMEMBER: If what you are trying to recover is important GO TO A PRO! This includes your own data, or customer data. Odds are VERY HIGH that you will lose your data forever if you are working on this without expertise.I'd ask for an opinion from the aforementioned sub once the computer's off.","Windows' chkdsk can lose references to files when \"fixing\" a broken file system. I don't believe there would be a way to get a list of what was lost.If I were working on this myself, I would be looking for a way to safely get a whole disk image, then look for all my important data on that image, backing it up as I go"],"points":0},{"text":["Looking for some kind of SD-card holder","You can get the CAD files for the tray, and then visit a sub like r/3Dprintmything to get a copy printed."],"points":1},{"text":["LCD Line on Monitor"],"points":0},{"text":["CPU compatiblity list & part number trouble","if it's not on the list, they either didn't test it, they know it's not compatible for some reason (usually memory controller incompatibility), or they tested and found it doesn't work for some reason. You can try, and you might get lucky, but it's unlikely it'll work unless the CPU is distinctly on the list."],"points":0},{"text":["Is there a way to fix corrupted replay from shadowplay ?"],"points":0},{"text":["Is this normal behavior for an SSD?","It can if there are lots of small files, try a benchmark test like crystal (disk?) benchmark"],"points":1},{"text":["Fort forwarding advice","If you are having issues with port forwarding checkout this wiki article.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","First, to answer your second question, yes a dynamic DNS service like No-IP would allow you to give them a domain name instead of your IP, but that name would resolve to your IP so they would still be able to look it up. in order to connect to you their end must be aware of your end's IP address.With that said, simply knowing it is not the security concern you may think it is.The dynamic DNS service does make it simpler with regards to changes in your home IP address assigned by your ISP, which typically changes every few days to weeks. You won't have to look up the new one when things stop working. It will just resolve to the new one each time so long as you are running an update client on your end.As for security, it depends on what firewall features you have on the router doing the port forward. The same IP address issue applies here as did above, you'll have to know theirs to enforce strict whitelisting and theirs will likely change over time. You could restrict it to ranges in which theirs are in. For example you can lookup the IP they currently have on ARIN and it will tell you the block it belongs to and the owner. You could whitelist source traffic from those blocks, or even more narrow pieces.If you want to be as secure as possible, start strict with the risk of it not working and relax restrictions only until it works...then tighten again 😂."],"points":0},{"text":["My Acer Aspire 5 (A515-56-53RZ) gets hot even with light tasks and DPC latency occurs"],"points":0},{"text":["Split audio on OBS more than once?","Only if it comes from a separate audio source, like a separate application. Two audio sources from the same program (ie two Chrome tabs) won't work, at least with the default setup. But if you were to run one in Chrome and the other in Firefox, you'd just have to ensure that you don't add an Application Audio Capture for Firefox.You'd still need something like the VB-AUDIO virtual input/outputs so you can tell Firefox to play to that line and capture it, or the application.EDIT: Now that I'm thinking about it, you might be able to use the VB-AUDIO pipes to do what you need if you can tell a specific Chrome tab to play to a certain output device. If a single tab can be used to go to a VB-AUDIO pipe, you can add the pipe to OBS and just mute the output in Windows."],"points":0},{"text":["My pc suddenly turns off after some minutes or hour! And then it starts turning on and off again! This issue happened after i cleared some dusk from the pc!"],"points":0},{"text":["App is not compatible this ipad","yep its what happens, apps only work on certain versions then you have to get a new one if you want to use the apps"],"points":0},{"text":["So I was fixing my Tv and disconnected something that made a portion of my screen to go black"],"points":0},{"text":["POST Error : Possible dead MoBo or CPU?"],"points":0},{"text":["My micro SD card has 14 gb in system","sounds like the sd card was formatted in something that your PC does not understand (like exfat or ...) - open the sd card in disk management and see what it says.","Leave the card in the camera and connect to the computer via USB (Assuming the camera has a usb port of course)"],"points":0},{"text":["having a partitioning issue on Arch linux","I don't think anything would let you modify your root while booted, and everything else has to be unmounted.Make sure you've got backups of all important data before continuing. As with anything to do with managing partitions, this is a risky operation.I'd get an install usb of a distro with a desktop environment, boot into that, and do it with gparted.You can't extend or shrink a partition from the start, so in this circumstance you have to shrink the home partition, then move it back to the end, before extending the root. As such, you need to work out how large you want the root before you start.I don't have any experience with shrinking a partition that's been in use, hopefully it lets you go as far as you want to. The move operation might take some time.https://rtech.support/docs/disks/gparted"],"points":0},{"text":["Z790-E using slot M.2 GEN5 with SLOT X16 GEN5","First slot drops to x8 when the gen 5 M.2 slot is used no matter what's used in the first slot.Performance difference from the GPU being at x16 vs x8 will be negligible, but so would the real world performance difference between gen 5 and gen 4 for the SSD."],"points":0},{"text":["My Fortnite client is freezing at the menu screen or when i'm loading into a game. I've done all the updates, have verified my fortnite files, and have updated all the drivers. Do you think there's a problem with my build","definitely not a problem with the build I don't think. i assume you've already tried hard reinstall, (uninstalling and deleting data from PC, then reinstalling) but if you haven't I guess do that. otherwise the only other issue I've seen like this have been graphics related. I know you already updated your drivers and whatever but id try to diagnose further in that sense. Hope that helps"],"points":0},{"text":["My mouse isnt working"],"points":0},{"text":["Rootkit in efi detected in antivirus","If you suspect you may have malware on your computer, or are trying to remove malware from your computer, please see our malware guidePlease ignore this message if the advice is not relevant.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","What was the path/filename?"],"points":0},{"text":["PING while using a VPN is drasticly lower than connecting directly","VPNs run on servers in massive data centers with commercial ISPs. Part of the reason your 'ping' is lower is because these servers are sending and retrieving data on fiber far faster than what you'd get residentially. These data centers may even host the content (or parts of it) themselves. The major bottleneck here is your home internet. The time it takes your home network traffic to reach the VPN server is likely going to be close to 30-40ms."],"points":1},{"text":["Windows 11 Lag at Startup","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","what is your os stored on? what's disk usage like? What's trying to run on startup? Have you disabled any unnecessary processes from there?could be a result of a struggling drive or too much trying to start on bootCheck the above, try a sfc scan , disk check etc"],"points":0},{"text":["USB not allowing big file to copy","You are likely using fat32 Use NTFS or exfat and you can copy those files. You can also split files or segment them ."],"points":2},{"text":["BSOD","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Spam either esc , enter, f10 , f12 while powering on the machine , one of those will get you into Bios. Its slightly different depending on mb manufacturer.If you cant get into windows properly, What you need to be doing is creating a windows USB installation stick and booting from that, and troubleshooting from there.What even is the BSOD error code? Not really given any of us much information to go on"],"points":0},{"text":["Windows 11 skips the Booting Screen","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","I know this might be a stupid question, but what if you use the advanced system start up (on settings) and choose restart with advanced option and then go to trouble UEFI settings under the troubleshooting option?"],"points":0},{"text":["Deleted program file","Sounds like you have to reinstall Windows.Don't ever mess in the registry.Even though it was an accident.","can someone guide me in installing windows? i have the installer in my usb already but i dont know why it wont autorun","it worked but it only says that device ran into some problem and it needs a restart","look for dsim and sfc and run the commandsif that does't work do and update install of windows which will keep all your settings and programs , there are other options but one of these should work"],"points":2},{"text":["Windows 11 skips the Booting Screen","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Laptop games will lag","Since I don’t know what your specs are, i’ll assume you have decent laptop for now. Try to open up settings and see which gpu you’re using, you can find those settings in graphic settings I think in system settings > system > display > graphics. You can also easily find which gpu you’re using by viewing it on task manager as well."],"points":0},{"text":["Monitor or GPU breaking DP cables?","I think it's more likely the cheap cables are just failing on their own. Nothing a GPU or monitor do during normal operation should allow them to break display cables.If either were sending excessive voltage/amperage through the cables, which is pretty much the only thing that could break them through use, then the monitor or GPU should be malfunctioning as well."],"points":1},{"text":["getting spam from names I know","This happened to me several years ago. Sometimes the email addresses were even the real email addresses, though most were not. I can't be sure, but my guess is that this was the result of one of the many huge data breaches, in my case Verizon, where at the time I had my email service. That breach included the contacts of several million users, mine among them. Search for data breaches of any of the email providers you have used and maybe you'll find it.","Data breach, or possibly LinkedIn or some other social networking site. I had someone impersonating a boss over and over for a while.","Get Spam phone calls asking for my brother or my mom fairly often. Phishing Indian scammers. They get some idea of who's who from your facebook profile and then target you after finding your Linkedin or wherever else they can find your email. No hacking necessary. Just hoping you're slow enough to let them get their hooks in. I talked to one of them once, and they were pretending to have an outstanding balance for my brother and wanted some of his info."],"points":5},{"text":["Is this problem even identifiable or do I need more info"],"points":0},{"text":["Cannot log out of Instagram on Mobile Browser"],"points":0},{"text":["My headset does not let me listen to audio while I am in a call","That's just how Bluetooth works. When you join a call the headset is switched to its Headset mode. This enables the microphone but reduces the quality of output audio to mono.The thing is, over Bluetooth you can't both get stereo output and microphone input as Bluetooth only supports two concurrent audio channels.You can work around this by selecting the Headset profile as your output device for all sound, but then it will be in lower quality and mono.","This is a feature I've used when I was on a tech support desk.......my music would play and when I needed to get on the phone, the music would pause. I was bluetooth to my personal computer and hardwired to my company computer. It worked rather well.I don't think this can be turned off, but check this post. The first one in this list........"],"points":1},{"text":["My MSI Katana Laptop just had a fatal error. Computer is fine now, but are the end times near?","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["PC Black Screen of Death haunts my rig","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Non line of sight distance measurement"],"points":0},{"text":["Help! I'm stuck on blue screen and I ask technician about it","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","Could be both, no way to tell without eliminating software reasons, which could be best done by fresh windows install - with deleting everything on system disk (backup important things before doing it, and disconnect all other drives)."],"points":0},{"text":["Which 2TB or 4TB PCIe gen 3.0 SSD has the highest TBW and is the fastest ?","We often have to bend rule 5 here, but a straight answer here would be a pretty flagrant violation.Some things to note about TBW rating:TBW is not purely a physical property of the drive, it also represents the manufacturer's risk tolerance - how many drives they are willing to replace before the warranty period expires.More bits-per-cell stored (SLC, MLC, TLC, QLC, lowest to highest) comes with greater capacity, but also greater wear on the cells, and as such a lower projected lifetime (for a given capacity). This will be represented in the rated TBW figure, you may have noticed this.A higher capacity drive of the same model is going to have a higher TBW rating - scaling roughly linearly with its capacity - solely by virtue of there being more cells to spread the wear across."],"points":1},{"text":["Can someone help me interpret these mini-dump files?","Getting dump files which we need for accurate analysis of BSODs. Dump files are crash logs from BSODs.If you can get into Windows normally or through Safe Mode could you check C:\\Windows\\Minidump for any dump files? If you have any dump files, copy the folder to the desktop, zip the folder and upload it. If you don't have any zip software installed, right click on the folder and select Send to → Compressed (Zipped) folder.Upload to any easy to use file sharing site. Reddit keeps blacklisting file hosts so find something that works, currently catbox.moe or mediafire.com seems to be working.We like to have multiple dump files to work with so if you only have one dump file, none or not a folder at all, upload the ones you have and then follow this guide to change the dump type to Small Memory Dump. The \"Overwrite dump file\" option will be grayed out since small memory dumps never overwrite.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","The dump files look like storage. No idea which one, but it's one of the NVMe SSDs.","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":2},{"text":["How to reverse? I toggled off “always trust this”"],"points":0},{"text":["Monitor not connecting via HDMI","Making changes to your system BIOS settings or disk setup can cause you to lose data. Always test your data backups before making changes to your PC.For more information please see our FAQ thread: https://www.reddit.com/r/techsupport/comments/q2rns5/windows_11_faq_read_this_first/I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Mails when google host our mail-server","Try allow listing the domain or the e-mail address or the sender IP address."],"points":1},{"text":["Delete files from storage on google drive?","You could move it into a partner's storage"],"points":0},{"text":["Problems with simultaneous operation of two monitors"],"points":0},{"text":["USB-C port on Macbook works but at the same time doesn't"],"points":0},{"text":["Shadowplay application stops recording in-game and discord audio after New Headset"],"points":0},{"text":["Sonos with Youtube"],"points":0}]