[{"text":["How AI is disrupting the demand for software engineers: data from 20M job postings","What evidence do you have that confirms this is caused by AI and not other causes?","Without evidence, I might rewrite your research with AI to show that it is the war on Ukraine and the Middle East that did it.","Sounds legit"],"points":20},{"text":["Comparing JavaScript Frameworks part 1: templates"],"points":0},{"text":["Character Selection Menu (Unity)"],"points":0},{"text":["Programming/coding"],"points":0},{"text":["From One to Many: Expanding the Scope of Toxicity Mitigation in Language Models"],"points":0},{"text":["GitHub - gabotechs/dep-tree: allows visualising a \"code base entropy\" using a 3d force-directed graph of files and the dependencies between them.","Summary to save a click:The dep-tree tool is designed to assist developers in maintaining clean and decoupled code bases. It features the capability to visualize code base entropy through a 3D force-directed graph, which illustrates the files in a project and the dependencies among them. This innovative approach helps in identifying and managing complex dependencies within software projects, promoting better software architecture and easier maintenance.If you don't like the summary, just downvote and I'll try to delete the comment eventually 👍Click here for more info, I read all comments"],"points":3},{"text":["Meta glasses, request from someone with no compsci background","I don't see why you've posted this in /r/programming?Also, from the sidebar:Do you have a question? Check out /r/learnprogramming, /r/cscareerquestions, or Stack Overflow.But since your question has about nothing to do with programming, I wouldn't try those either.Maybe check out https://www.reddit.com/r/RayBanStories/ ?","Would it be possible for someone to do it, maybe. Could you do it? Probably not, well not without learning tons of new skills. New hobby?Facebook would have invested resources in locking it down as there are privacy concerns in hacking it. Turning off recording LEDs etcs.Realistically you would need someone else to create a project to wrap up all of the technical bits and make it an easy to use process that non technical users can install the custom software and or possibly a replacement app.I've had a quick Google and there has been some interest in hacking the device but I can't see any actual project i'm afraid."],"points":2},{"text":["Cordova vs. Capacitor: should you make the switch?"],"points":0},{"text":["Using Promise Theory to solve the distributed consensus problem"],"points":0},{"text":["HTMX and Web Components: a Perfect Match","Key points:The post discusses the synergy between HTMX and Web Components for building interactive web applications without complex frameworks. Web Components allow for creating custom, reusable HTML elements directly in the browser, making them framework-agnostic. HTMX enhances this by enabling any HTML element to make HTTP requests, simplifying the development of SPA-like applications without needing to write JavaScript for data fetching. The article walks through creating such components, configuring them externally for flexibility, and integrating with HTMX for dynamic content loading, showcasing the ease and power of combining these technologies.If you don't like the summary, just downvote and I'll try to delete the comment eventually 👍Click here for more info, I read all comments"],"points":0},{"text":["OpenAI releases Transformer Debugger"],"points":0},{"text":["Musing on Auth: How we Authenticate"],"points":0},{"text":["Bouncy Ball - Compare Web Animation Techniques","I hope you like the summary below:The link compares different web animation techniques using a bouncy ball animation as an example. It highlights various methods including Vanilla JS, CSS, Canvas, jQuery, GreenSock, and several others, illustrating how each can be used to animate a bouncing ball. The project serves as an educational tool for developers to learn about the strengths and weaknesses of each animation technique, offering a hands-on comparison to help choose the best approach for specific scenarios.If you don't like the summary, just downvote and I'll try to delete the comment eventually 👍Click here for more info, I read all comments"],"points":0},{"text":["Underground AI — Unlimited Chat & Image Generation On Your Computer","Medium friend link without paywall: https://medium.com/@jankammerath/underground-ai-unlimited-chat-image-generation-on-your-computer-0e2a2c46b091?sk=b33fd0125e02b23a70468f1b8ddd7e5d"],"points":0},{"text":["My original post was removed from moderators, it kinda look spammy i guess 🙃, I will try to give more context: this is my first article on Medium talking about 3 solutions for making file management in terminal suck less, using Zoxide, Lf Manager & build Tmux-fzf script, I looking for feedback","Maybe it was removed because it's not programming content.","Please have somebody who’s fluent in English copyedit you article before posting next time.","I don't understand this paragraph.\"Imagine this scenario, you’re working on file in Tmux, then do quick shortcut open lf in new window, to open any file from same directory \"I think there is both an issue with me not having the necessary knowledge, and also something abou the language. I'm not sure how to explain how I do not understand, lol. :)","What is brew? Is that article targeted mac users? If so, did you forget to say so? :) (commenting as I read)","I, for one, would like to see a bit more analysis. What are the advantages and disadvantages of each tool? Why would I choose one tool over the other? This would be more substantial than glittering remarks like “once you use it suddenly want to use it everywhere”.I wouldn’t say zsh is a prerequisite? I presume these tools work with any shell. Also I wouldn’t list the tools you’re introducing inside the prereqs, if you’ll be guiding us through installation anyways.One thing I do like though, is the quote at the beginning. Really draws motivation for such tools.","What is tmux? I don't know, so many other readers will not know. Is that a mac thing? :)","I'm trying to provide feedback. That's what OP asked for, was it not? But all my feedback has been downvoted. Whats the deal? Perhaps Reddit is just not the right place for getting/providing critique.u/Hefty_Information_39 I need to go to bed now. I know my feedback was very sparse, but thats all I had for you. I like the concept of your article, and I will definitely revisit.It's nice to have nice tools :) Nice tools sometimes make tedious jobs less tedious, or even ejoyable."],"points":42},{"text":["Fx JSON viewer now supports YAML"],"points":0},{"text":["The Motivation for the Plato Programming Language"],"points":0},{"text":["Integration testing of business logic using dockerized PostgreSQL with Test Containers in C#"],"points":0},{"text":["I made code2prompt - A CLI tool to generate LLM prompts from your codebase with prompt templating and token counting"],"points":0},{"text":["ChatGPT vs Gemini: Which one can write better code?","currently, Claude opus is neat.","Gemini is extremely flawed from what I heard in my news feed, so chatGPT is my pick.","Who cares. Both fail to replace a human."],"points":5},{"text":["Async Unit Testing: The Comprehensive Guide"],"points":0},{"text":["Speedometer 3.0: The Best Way Yet to Measure Browser Performance"],"points":0},{"text":["A look at Nix and Guix [LWN.net]"],"points":0},{"text":["A few words on writing good strategy documents (and presentations)","I've read similar stuff about company values. If they all are anodyne words like \"integrity\" or \"caring\" they are not values. They are meant to be the backstop rules for conflict resolution.Alice wrote a report. Bob didn't like the findings and tabled it. Alice went over Bob's head and presented her report to Carol. Bob is now mad at Alice and tries to fire her. Alice goes to HR. Who should be fired, Alice or Bob? Depends on what the values are. Well, what does your HR handbook say? What does your company value more, truth/facts/correctness or discipline/order/subordination?"],"points":0},{"text":["Improving Performance in Firefox and Across the Web with Speedometer 3","Seems like the final scores are much lower than before and pretty much all browsers look slow speedometer 3"],"points":0},{"text":["Transitioning from big tech to a startup","Need to provide my email to read it so never mind"],"points":2},{"text":["Speedometer 3: Building a benchmark that represents the web","Obligatory reality check when it comes to modern web tech \"optimisations\":https://idlewords.com/talks/website_obesity.htm"],"points":3},{"text":["Introduction To Low Latency Programming: External Processing"],"points":0},{"text":["You’re not a weak developer if you don’t always show off your technical excellence","No I'm a weak developer because I don't know what I am doing.","So much text just to say that providing business value is more important than developer's personal experience. Which is a fine point, but it easily gets pushed too far. I'm sure a lot of developers will be happy delivering business value if their respective businesses show any kind of appreciation rather than fighting stress with free pizza.","Low-relevance clickbait title by the authorArticle is really about keeping customers happy/informed via iterative development & delivery.","I'm struggling to promote what I code because I'm coding like 14 hours every day.","If the quality of your systems matches your writing then I fear for your customers","I disagree.And no, I'm not still a little bitter over that time I wrote a perfect query to solve a difficult problem. Literally one of those rare times you stand back and think \"Holy cow, I actually wrote... that! I must be better than I thought!\" And then two days later they said \"oh, we don't need that anymore\".","I'm reminded of a video I saw talking about Ringo Starr, the drummer for The Beatles, and how unfairly maligned they are - there are deeper cuts where they demonstrate more advanced technical proficiency, but it's not what the hit songs called for.","Weak or strong just feeds egos. I am here for the money.","Fuck the business, you’re an artist!","There's no point to being good at something and never being able to put that skill to use though. It would be like having pro baseball skills, and playing tennis instead.EDIT: Delivering value for end-users should be what you're doing with tech skills.","Success stories have no value in terms of information content. It is in the failure stories that we learn.","\"Hey guys, refactoring is eating up our budget too much so we cut it to save time! And to hide the real problems and shroud everything in an illusion of progress we cut down stories into tiny little things with 95% overhead and 5% actual development! It totally makes everyone (!!!) happy - EVERYONE - that's why we wrote a blog post about how good it is to ignore what your devs say and toss their happiness to the garbage!\"","Technical excellence is what developers are graded on, no? Isn't it the manager's job to provide the customer perspective when the developer is too focused on another thing?Another article which provides another data point that leadership is failing to provide the organization proper directionality so that engineers can make appropriate decisions.","No one dev blog is going to ever solve this because it's a real legitimate trade off where it's impossible to predict the future implications. If I write this faster now and don't plan for x,y,z in advance will we make more money and have a stronger strategic position? It depends on a billion details, how much is having it out now worth, how bad is it in a year if everyone in the company acts this way and now you have a product that you can't iterate on successfully? How likely is that to happen? How costly is just rewriting your product in a year? All of this matters, and people both use this for an excuse to be sloppy, and people use \"doing it right\" as an excuse to agonize over structural decisions that don't matter and something pointless takes 6 months. Both happen constantly.","A good dev solves the problem at hand while creating minimal negative impact on existing work.A strong dev facilitates and elevates the rest of their team.","Hit 'em with the flex.","I've worked at companies where business is so dominant, they start to wonder why the developers are getting slower and slower and decide to further reduce time to fix those dubious \"technical things\", if it wasn't already at 0 to begin with. And then I've worked at other companies where I had the simple freedom to fix the technical things, started getting really productive on delivering the stuff business wants, just to encounter some developer who doesn't care about the business side as much and decided to build his camp on hill \"Code Review\" to show off his never ending skill on nitpicking technical details and re-framing everything as super dramatic, even if it is just opinionated (he viewed it as \"technical excellence\" but was scared of non-technical tasks). Maybe I should change jobs and go into animal care or something rewarding... thanks for reading until here.","Yes you are.You \"lack a sense of urgency\".You are being let go."],"points":561},{"text":["Meta System Design Interview Question: Design FB Live Comments - Broken Down By Meta Staff Engineer"],"points":0},{"text":["Building a Chatbot for Hacker News and Stack Overflow with LlamaIndex and ClickHouse"],"points":0},{"text":["Raster Data Analysis With Spatial SQL And Apache Sedona","I'm curious if folks have use cases in mind for working with large-scale raster data? What sort of examples would you be interested in seeing?"],"points":0},{"text":["Is bosque going to become a viable product ?","A lot of things from Microsoft Research don’t become products. They once wrote an OS entirely in managed code, but few of us will ever see it.","FWIW, Bosque has moved here: https://github.com/BosqueLanguage/BosqueCore ."],"points":31},{"text":["A new approach to Agile refinement sessions","That’s great it works for your team. Agile is about agility, so this may not work other places and that is ok. Getting stuff done is what makes software great.","We do a similar thing. We have an informal “pre-refinement” step where tickets of various quality are just pulled towards people (sometimes devs/sometimes the PO) who make sure that all info this ticket references js reachable, that the ticket is concise, that it conforms to our somewhat (intentionally vague) format so it reads easy, and that all people who must contribute something to this ticket in the form of questions, have already answered these questions.Doing that we had a massive increase in work output, better tesability, we spot inconcistensies earlyer. Everyone’s far more happyer with it. Only adds a couple days at most to a single ticket’s time between creation and closed, but pays back for it by having less rework or time wasted in the sprint itsself.","Yeah give me more work so I can never write a single line of code. All that is important is that the PO does minimum job","AGILE = POOP"],"points":30},{"text":["A Beginner's Guide to PostgreSQL Index Types"],"points":0},{"text":["Comparing JavaScript Frameworks part 1: templates"],"points":0},{"text":["Kafka Offset with Spring Boot - Piotr's TechBlog"],"points":0},{"text":["How to practice isometric software development","As someone who has been doing isometric software development for years, my advice is to throw your computer out the window and start coding with an abacus. It's how the true masters do it.Anything worth doing takes time and practice. Just don't forget the coffee and curse words along the way.","https://www.youtube.com/watch?v=6hj5z6HlR2Q"],"points":1},{"text":["How to add search to a website using flexsearch"],"points":0},{"text":["Coding Challenge - Fornite's Outage Monitor"],"points":0},{"text":["How I hacked a course platform built with WordPress [with explanation]"],"points":0},{"text":["Squeezing Last Bit Of JavaScript Performance For My Automation Game","This is a TL;DR cause time is precious:This post delves into the optimization journey for CivIdle, an automation game that succeeds Industry Idle, focusing on enhancing JavaScript performance. The author explores the transition from using TypeScript/JavaScript to potentially using WebAssembly or C++ for better performance, ultimately sticking with TypeScript for UI and WebGL for rendering due to its efficiency with web platforms. By adopting Pixi.JS for faster WebGL rendering and optimizing code to reduce computation time and resource allocation, significant performance improvements were achieved. Techniques such as object pooling, texture optimization, and code refactoring for efficient memory use were employed. The post highlights challenges and solutions in optimizing game simulation and rendering processes, illustrating the impact of various optimization strategies on game performance.If you don't like the summary, just downvote and I'll try to delete the comment eventually 👍Click here for more info, I read all comments"],"points":0}]