[{"text":["Looking for alternative to Character AI with no VF code"],"points":0},{"text":["Lets generate 3D objects with AI, drop them in Roblox and animate them with Mixamo","I was going to get stoned and rewatch Dune P1 but hey you do you."],"points":0},{"text":["How would you like to see generative AI used in video games?","Still amazes at the \"AI dev team members\" angle.In-game? No one even remembers the best use of AI yet: Shadow of Mordor/War NEMISIS SYSTEM. Processing power dedicated to unique enemies based off their interactions with you. Beautiful.What else. Any game that has intelligent opponents needs to forgo difficulty as a matter of enemy health or number of saves. I want both SMARTER enemies, yes, but INTERESTINGLY smarter.Anyone can just \"Make best Decision X in Y situation\" but give me CHARACTER. Like let me pop my head out twice, dodge both attacks, have the enemy line up where I WAS popping out (smart) just to have me now pop put elsewhere, to the VISIBLE FRUSTRATION of said enemy.So...ironically...use Artifical (Synthetic?) INTELLIGENCE....to simulate /emotion./","Sorry for the formatting, paragraphs don't work for me right now.   A nice evolution game where you can mutate or hybridize creatures, or yourself, and every time it's a unique visual outcome.   In RPGs, endless dialogue, with characters remembering past interactions (if it makes sense, a bartender sees a lot of L1 blokes) and being knowledgeable of their own crafts (let's ask a lbowyer how to make a bow, or the cook for a recipe). Also: in a game with an adventurer group, breaking the fourth wall and having personas for the players too, interacting with you as if around a table in D&D sessions.","Honestly just being able talk with a partner (not romantic) would be cool y'know? Give them directions and ask their input on random things I think bartering would be cool","My biggest hope to come from Ai is players being able to chat real time with the game characters in rpgs, and maybe some way that Ai can make it where every play through is entirely different because tiny little things you say here or there. But I guess that would not only need an Ai chatbot, but some sort of generative game engine Ai?","Did everyone forget the AI used in the game 'ALIEN'.The tracking the player in the game is creepy and engaging . Also, the first use of AI happened in HALO games , I think.","I want an AI to generate an endless Super Mario World game where I get new levels forever.","Generative fully interactive world building with rich lore, full 3D environments, NPCs, the works. In VR/AR/screen/voice based 100% accessibility. An unlimited multi-interface state-based generative MU* basically.","I'd love to see it be used in ways that enrich game worlds in a way that allows for truly novel exploration and discovery, whether it be through breathing life into NPCs or finding new ways to do procedural generation that actually spit out novel results."],"points":9},{"text":["Best AI tool for slowing down/stretching audio?"],"points":0},{"text":["Best AI tool for cleaning up bad film production audio?","adobe podcast enhance, have you tried it?"],"points":2},{"text":["Elon Musk to open-source xAI's Grok AI this week, challenges OpenAI to do the same with ChatGPT","Let's start an open-source satellite company and challenge Elon to do the same.","\"I'm gonna open source my go-kart design! I dare you to do the same with that Formula 1 racer you've been working on! I dare you!\"","To use Grok I'd have to have a Twitter account.I find this to be an insurmountable challenge.","he's opensourcing his custom GPT openAI wrapper? wow","This week*.*next year","Lol, no project picked Grok up & he thinks it'll be the next Llama/Mistral lol","Announcement of an announcement. No one cares until it's here and we can actually try and evaluate it.","Gettin' ready for the most Nazi AI since Tay AI","Nice try Musk, but unfortunately nobody gonna follow that rabbit.","\"I'm throwing my turd into the street, now throw your gold to prove you are as good as me.\"","Them GPU's are aging quick huh?","That's like Lada going open source and asking BMW to do the same :D","Elon is a grifter. But if there's even a small chance of us getting more open-source stuff, especially AI related, I'm for it.","Big daddy Musk flex'n on dem 'for profits', holla! Tinted fingers and all, he's a regular Mr. fucking Burns in the making!","He’s like a teenager, “I CHALLENGE YOU?!” hahah","He wants people to fix it for free.","Respect for Elon went up 100X.. Can't imagine an \"open\" source AI company making billions of people's work! I am a big fan of Sam Altman and a Chatgpt Pro subscriber since beginning. But Chatgpt is becoming corporate each day!! We need more OPEN AI and more people to have access to the ins and out of AI. Dont be like Bill Gates who wanted monopoly on what he called the \"Information Highway\"!","He’s gonna open source gpt3.5?","China can’t wait"],"points":362},{"text":["Open Source AI Is a Misnomer from 2nd & 3rd Place Players - Let's Get Real","You don't know our potential algorithmic efficiencies. That coupled with, moving forward, more hardware will be made for these use-cases.If you pay attention to subs like locallama, people post new, what they think is, relevant research papers. The other day I seen something about cutting training resource needs drastically. I wanted to go read the paper, thought I saved it, but apparently I didn't. Anyway, the point is, New research is addressing this because the entire industry needs it.","As much as people may want to the newest and smartest and most capable AI,a weaker open source AI that can serve a user's purpose is more than enough.Simply put, I don't need a multi-modal AI if I just need it to generate information in specific domain. Simply put, while the current trend is to train general knowledge, just like how diffusion models went and adopted into style specialization, LLMs are also moving towards specialization.Case in point, I haven't been active in LocalLlama for months now after setting up my personal AI assistant on my own server. While I may occasionally check for new updates, more optimizations, faster inference, more tokens, etc... the current open source uncensored LLMs are already capable of serving some purpose.It's like asking an algebra question between a high school teacher and Albert Einstein. While Albert may be smarter than your local teacher, the high school teacher is more than sufficient enough to answer an algebra question.","Ok Sam. I'll definitely drink the Kool-Aid!"],"points":16},{"text":["AI-translated Hitler speech goes viral on X (Wired article)"],"points":0},{"text":["Using AI to draw a map","I don't have any AI solutions, but Garmin has/had heatmaps so you can see routes bike riders take that might be helpful. You don't have to own a garmin to view them.","Analyzing street view data with computer vision and populating it into something like OpenStreetMap seems doable.Doesn't sound inexpensive computewise though.","This seems like a wildly overcomplicated solution for some of the data that is probably already captured and entered in OpenStreetMap.org - go to Layers and turn on \"Cycle Map.\" Altho they map stop lights, I don't think they map stop signs, it should have the raw data for the bike routes.(And if your town has not been mapped, you can contribute to mapping it.)"],"points":0},{"text":["Apple abandoned its ambitious car project. Ask your questions to Bloomberg's Mark Gurman","Will apple push to something that truly competes with a WHOOP or an Oura ring? Going deep into recovery metrics and revamping apple health portal, daily scores, etc","Was it actually a consumer facing car or an autonomous platform to sell to car manufacturers?If a car…any hint what it looked like?EDIT; GUESS WE MISSED IT"],"points":0},{"text":["Suno V3 [Alpha] + Some Editing","Nice, featured in next edition of The Memo."],"points":1},{"text":["[R] What existing Artificial tools can I use / read (books) to dynamically monitor changes on a website?","None.Any decent website will be using something to detect bots, what you are doing is just asking for your IP to be put in naughty list by Amazon, Akkamai, Cloudflare or any other CDN provider, and believe me, you don't want to be in that naughty list. That's akin to getting banned from the internet.","That sounds like an interesting project, but I don't have any knowledge or suggestions about the topic, other than one experience: I applied at an AI company that dealt with semantics, and the manager told me a story about how their company received a question about whether the company's AI software could read a certain type of file that the requester's group used, so the company took a look at the requester's data file. Although the software the company used was believed to be able to automatically figure out the structure of any data file, it failed on this one particular file, even with human aid. That problem has fascinated me ever since, because it suggested that determining the structure of a data file is a very difficult problem to solve in a general way. I assume that principle also applies to web pages. As applied to your project, this *might* mean that such software does not exist, depending on the complexity of the web page.","You could look into the topic of self healing tests on pipelines, where they pass a version of the Dom, sometimes stripped from predefined elements (or in reverse elements that are changing often to reduce context token size) to AI models, like codecept.js does etc ... Where AI is proposing new locators(or then for you passing changes in your desired format). The way playwright advanced libraries like crawlee etc work can be combined to parse that data to a code transformator to adjust your code.Also with tools like them there are ways to API testing, fetch json responses and payloads, so I would check if I could write my code more based on that and compare request/response snapshots? Websites like playwright solutions offer examples for stuff like that."],"points":3},{"text":["Evertrail is an AI adventure where you choose the path in the Twitch chat. Worked on this the last weeks, please help me testing if you have time.","To vote on a choice, you just type 1, 2 or 3 in the chat at (on desktop or the Twitch mobile app). Every few rounds, one of you will be chosen to also add an optional item, person or plot twist. Everything is dynamically generated using ChatGPT, Dall-E and Text-to-Speech, with a mood-based music selection by SunoAI. The current theme is fantasy and we can switch it to sci-fi and other themes on future days. Hope you enjoy & feedback welcome. Cheers!"],"points":4},{"text":["Oooof","AI is absurdly bad at video editing (notably SORA is not video editing). Is it possible? Sure. It's definitely not there yet.","OpenAI cannot do graphical design and banner ads well yet.","You have to pay someone to use the aiIt's not like they're competing against a $20/month charge, they're still competing against someone's time.","Apart from just being wrong, this attitude is just going to accelerate and normalize a hostile relationship between AI engineers and creative people, ultimately resulting in AI content looking cheap and crappy.","It's not a matter of \"capabilities.\" It's more a matter of designing stuff takes lots of time and effort. I'm not talking about the actual drawing or editing process, though even that is non trivial with AI. It's more in the figuring out what needs to be drawn or edited. It's really difficult to come up with something that moves people, the most AI can do is move the bar for what people consider the bare minimum.It takes a level of understanding of what \"video editing\" or \"graphical design\" actually entails, which is not what most people want. What most people really want is for someone to understand their vision from a few scraps and tidbits, and then do a lot of other stuff that aligns with that vision. AI is great at the exact opposite; you give it a lot of data, and it'll give you something that satisfies most of those criteria. For someone familiar with a field this is great, because it can save you something like 80% of the work. The remaining 20% may be the most difficult stuff, but it's a lot easier if you don't have to do the first 80% beforehand.But you're right in one sense; the cost of those services should probably include the cost of the OpenAI subscription, as well as the many other AI's that you need to do the services being discussed these days.","AI is just a tool, it's not going to fully replace human design. Such a silly perspective"],"points":127},{"text":["Extropic AI is going to tell us somethi no about the AI processor that they are building!","This is what they was going to say: https://x.com/extropic_ai/status/1767188810646126751?s=46","This feels very scammy for some reason","Everything is physics based LOL","It uses quantum tunneling, not light."],"points":15},{"text":["Tool to configure and execute a multi-step LLM process?"],"points":0},{"text":["Visually, AI is capable of dreaming up new worlds, taking us places we've never been before. Artists like Thierry Lechanteur are using it to create exciting, imaginative, otherworldly outputs. Why aren't we seeing a similar level of creativity in the text-based outputs being created by AI?","I think language models are commonly used pretty creatively. I've heard of people using them for creative writing purposes. They are definitely commonly used for text adventures, such as a DM, and for ERP. Due to the nature of the underlying self-attention layers of language models, I'd imagine it's quite difficult for them to produce very long strands of text that tie together in meaningful ways other than a name being recurring throughout a story - but perhaps that can be improved upon in the future.","I wouldn't say AI is \"capable of dreaming up new worlds\". It's a user that has dreamed up the world and asked AI to generate what they're thinking of. AI is producing a visualization of a humans request.I would say the difference is people are able to look at the picture and it takes a minute to notice the sixth finger or whatever else is wrong. The more abstract the easier it is to forgive weirdness in the picture, whereas with language if there's a grammatically weird statement in each sentence you're going to notice a lot quicker.","It is very hard for humans to exactly put into words what we have in mind. The AI gives us exactly what we asked for, nothing less and nothing more, and that is usually disappointing.","AI can only mix existing worlds that it has access to in its training. So far there isn't a way to hallucinate into something coherent that could amount to a 'new' anything.","Sure but Thierry Lechenteur is not an artist.","Language models are overly restricted currently, goes beyond safety","Websites like DungeonAI use specifically trained LLMs to create choose-your-own-adventure style stories or scenarios. You can get pretty advanced levels of control of the story too by adding world/character/event info to the stored \"memories\" of a specific story.For instance, you save an entry with keywords of a Character's name or common descriptors, and fill the description with pertinent information of that characters qualities, appearance, backstory, etc. that way when the character is references or interacted with in the story it will draw from that saved information","Why aren't we seeing a similar level of creativity in the text-based outputs being created by AI?What makes you think you're not?The web is inherently visual so not only is there more opportunity to see AI visual art but, a lot of AI art really looks like AI art. But how would you even know when you're seeing AI text content? For example how many posters in this subreddit are human?","the fact that people call them 'outputs' probably isn't helping"],"points":8},{"text":["RAG for multiple documents"],"points":0}]