[{"text":["Google Pagespeed Error"],"points":0},{"text":["Best approach to customize Tailwind theme?"],"points":0},{"text":["null body in express PUT request"],"points":0},{"text":["The quiet, pervasive devaluation of frontend"],"points":0},{"text":["Website startup wisdom needed","If it's just a static site then you can store it in a private Github repo and host on a static hosting provider such as Netlify or even just in an S3 bucket."],"points":0},{"text":["Stack evaluation for Website + Digital Learning Platform"],"points":0},{"text":["Device Emulator for Testing/Presenting?"],"points":0},{"text":["How to wrap long text inside, <Text> in Chakra UI?","I'm pretty sure this is just default html (<p>) behaviour when you don't have any spaces in the string... if it's really a url like the sample suggests then just stick it inside a Link tagactually just googled and this might help: stackoverflow answer","CSS?"],"points":1},{"text":["How to add search to a website using flexsearch"],"points":0},{"text":["Any tips about own portfolio website?","Yes, definitely get your own domain for your website and email. Especially as a developer in the web-realm.As for the showcase, personally I prefer the portfolio-page to be minimal, and let the work take the stage. It's weird if you have the most fancy 3D-Superman-Website, and there's only a ToDo-App and two old Github links.But that's just my opinion on the matter, the most important thing is that the page represents YOU, and you're happy with it.","Focus on displaying your best work, not just aesthetics. Overcomplicating with too much styling can overshadow your capabilities. Consider a custom domain for professionalism—it's worth the investment."],"points":2},{"text":["How common are remote dev environments?","It is common when the software relies on a lot of other servies that are hard to replicate locally and keep updated and keep access rights manageable.With remote development you only need access to your remote instance from your pc wherever it is and not to all the services it depends upon.It is usually the cto who has a preference who makes the decision. I worked with both and remote is easier to manage with a large number of users in crying locations and a lot of dependencies. Local is more flexible and better supported by dev tools.","Meta does this.It really depends on how complicated the team is, what technologies your team uses. There is no right approach to it.The commits in a feature PR can be squashed on merge, as is the case for trunk-based git workflows.","We have moved from local to the cloud with development environments. We use virtual machines with dockers and containers.All devs can participate in development as they see fit, testing is done in the same environment without having to move code anywhere.For us, the cloud has brought cost efficiency and especially speed in development. On top of all this, customers have direct access via Ngrok tunnel to test/see what the work looks like.","We're using a hybrid setup where parts of the app that aren't running on localhost get proxied to the remote services. Best of both worlds imo, but comes with its own set of issues.I can't imagine working with your setup without losing my last bit of sanity.","We support remote environments at work, but I prefer a local setup for more control and faster speed. If an org has good devops and fast servers, it could be as good as better. It is nice to work on a project and have everything preconfigured. For fast changes, a remote dev environment is quick and easy with no troubleshooting local issues. If unsupported, it can mean spending all day trying to find out why something isn't working.","The money people always try to make devs use VMs and remote into an environment because its way cheaper than buying decent laptops for everyone.It's also a pretty terrible dev experience compared to running everything locally and should be resisted at all costs.","Yeah, it prevents \"but it works on my machine\" nonsense in projects that have a high amount of dependencies.Doesn't apply to every kind of project, but it's certainly something I've encountered. It's especially common in Big Data projects."],"points":14},{"text":["How bad is this","The multiple hellos have me more nervous than the line count.","Well, I would cry if i needed to work on that.","How bad is what?","Hot take: It's probably fine if you're the only person working on this (and will never have to be concerned about handing it over) and it's generating the revenue you want...","Are you putting all your widgets in a single file? You know you could just split them into their own files ;)","If you have to ask then you know the answer xD","I'm working on a Node/Express project like this at the moment, and it certainly makes things harder than they need to be.In a language that's so capable of modularity, it does make you wonder how things got to this sort of stage.","That looks like Flutter, and I can't decide if Flutter or React is the worst. Those line numbers are horrendous though. Also, switch to English, comrade."],"points":23},{"text":["React js - how do I create a dynamic navbar","Use third party Library such as antD or daisyui. They provide pre built dynamic navbars"],"points":1},{"text":["Headless CMS with multilanguage + commerce included?"],"points":0},{"text":["How can I improve my CSS?","CSS battle is not good for practice. You learn stuff you should not use on production.WC3 has a good guide. Best for learning CSS is to make little projects and make them work on every browser/devices.","icodethis has small daily challenges where you build components with html and css. Doing those regularly will help.","Kevin Powell channel on YouTube is a great place to learn css","Kevin Powell on YouTube","Seconding tailwind.I kinda hate tailwind, but it's actually a decent way to get better at regular CSS","Just use tailwind"],"points":5},{"text":["How do users make their own stylesheets?","Safari on desktop has a custom stylesheet. I use it to hide all the nonsense on websites I visit regularly like reddit.","I use an add-on called Stylus. There’s probably browser-native ways to do it, but I didn’t bother looking.https://add0n.com/stylus.html","I always thought this was how things like darkreader worked"],"points":11},{"text":["PLEASE HELP!!!!!! Wix Project pages question"],"points":0},{"text":["Vue vs Svelte: Which is better?","I like Svelte but the two are very similar. This is an entirely subjective question.I would look at Nuxt and Sveltekit as the ecosystem is probably more important than the component library syntax","Both are very capable, can’t go wrong either way.That being said, Svelte’s syntax is more concise, scores better in performance benchmarks and because it doesn’t use virtual dom by default you can just use the whole JS ecosystem. Using frameworks like Vue (without Vapor) and React means having to use specific Vue/React libraries, with Svelte you can just tap into the vast JS ecosystem.Vue’s biggest upside is that there’s a bigger chance you may use it someplace because they’re already using it.","Just to be a bit of a voice of reason rather than bias here... There's a reason multiple frameworks exist (I know... This is JS and \"multiple frameworks\" is an understatement). It's because each is a better choice compared to others given certain requirements. No one framework is the \"best\" overall.","Having used both, I think Svelte is a better version of Vue. I prefer the templating syntax (although I prefer JSX other both) and also don't like how Vue uses strings for everything (@click=\"someFunction\") vs (onclick={someFunction}).Checkout Svelte 5 vs Vue 3 in Component party","Amount of libraries and jobs in Svelte are much less. It's hard when you have to waste your time building your own package for a small thing because you can't find one already built.","Vue because its compiler does not override javascript built in keywords/logic","jQuery","Consider team expertise, project scope, and performance requirements before deciding.","svelte because no virtual dom"],"points":28},{"text":["Sending video frames from client to server"],"points":0},{"text":["announcing freenginx.org","Quick rundown:Maxim Dounin announced the start of freenginx.org, a project aimed at continuing nginx development free from corporate interference, in response to F5's new management decisions that conflict with the open source project's long-standing security policies and developer autonomy. Dounin's decision comes after F5's actions contradicted an agreement allowing him to maintain his role in nginx development voluntarily, leading to concerns about the project's direction under F5's control.If you don't like the summary, just downvote and I'll try to delete the comment eventually 👍Click here for more info, I read all comments","I would need a far more compelling reason to switch to Freenginx than just this incident, which I do agree with their stance at face value"],"points":9},{"text":["How to Send Email from PERN App's Contact Page?","Check out Formspree."],"points":0},{"text":["capacitor-community/stripe vs @revenuecat/purchases-capacitor vs glassfy"],"points":0},{"text":["Use the same domain/DNS/Email for all projects?","For side projects, a huge monorepo managed by Nx. So I can easily share stuff across different projects. Also I always start with TypeScript for everything, because I can share common code across API and FE.Inside the monorepo I have another directory for code managed by Bazel. For things like Golang/C++ servers. But these are rarely needed.","I use porkbun as my registrar.I have a terraform template I use for all my side projects which sets up a project in GCP with a DNS entry, Google Cloud Run and MySQL or FireStore. Then I just point porkbun to GCP nameservers. I use SendGrid for sending emails and Google Workspace for receiving.These days I can set up a full experimental project complete with a domain and production ready GCP structure within minutes and I'm pretty happy with everything."],"points":2},{"text":["WSL2 is slow working with Stripe API + Pushing to git.","Could be related https://github.com/microsoft/WSL/issues/8171","I use WSL daily and never had these issues. I’ll flip through the settings tomorrow morning and see if I see anything you can mess with. Just commenting so I can come back if I find something.","Sounds like your files are on the windows filesystem instead of inside of WSL. To be super efficient everything should be inside of WSL. You should launch your VSCode instance from WSL as well. That way your dev environment is entirely inside of WSL. Sure Windows offers a layer to work between the two but it's not exactly fast as you are seeing.","Which directory are you in, in Ubuntu? Tell me the path.","Sounds like your files are on the windows filesystem instead of inside of WSL. To be super efficient everything should be inside of WSL. You should launch your VSCode instance from WSL as well. That way your dev environment is entirely inside of WSL. Sure Windows offers a layer to work between the two but it's not exactly fast as you are seeing."],"points":20},{"text":["how to do a website like this?","CSS grid","By creating it one by one. One stop at a time.","Sounds like a job for a web developer.","search for masonry that may help","The real thing you should do is, if this is for work, suggest edits because the UX is so bad. As a person looking at this design, I have so many widgets and squares that I feel lost and I have no idea what I'm supposed to be doing here.Now, if you really must do it, CSS grid along with some grid template areas should do the trick.","By coding it? What kind of question is that. If you want more specific answers ask more specific questions.","Electron or react native, whatever backend. Lawyers. Account managers. Content isn’t free.","Can you be more specific?Is the question: How to make a website page that looks like a bunch of rectangular tiles? Or is the question: How to make an entire website that features pages like the examples in the frames?"],"points":40},{"text":["I need career advice"],"points":0},{"text":["Is it worth messing with the url structure of Shopify?","Honestly, messing with the URL structure of Shopify can be a bit of a pain. While it may irk you that you have limited control, sometimes it's best to work within the system rather than fight it. People have definitely found ways to customize it, but it could end up being a headache. Consider the trade-off between aesthetics and functionality before diving in. Good luck!"],"points":2},{"text":["Free hosting with Google Firebase?","GitHub Pages also works. Probably better for your use case if you have no backend whatsoever.","Yes, whilst there are limits many services have generous free tiers like Firebase, Oracle Cloud, Cloudflare pages, etc. The whole idea is that they take the loss now so you stick with them when you start spending money.","Many services offer a free bottom tier. You might also want to check GitHub pages and Netlify.","Many services offer a free bottom tier. You might also want to check GitHub pages and Netlify."],"points":8},{"text":["How and where to store Spotify API access token?","Store it on the server. The client shouldn’t even be aware of the token.","When working with API access tokens, it's crucial to prioritize security. Storing tokens on the client-side is risky due to potential exposure and manipulation. Therefore, it's recommended to store tokens on the server-side. You can use server-side sessions, databases, or environment variables to securely store and manage access tokens. Using environment variables is a common approach, ensuring sensitive information like tokens are kept separate from the codebase and inaccessible to unauthorized users. Additionally, consider token expiration and implement mechanisms to refresh tokens when needed.","Gosh I been learning oauth and i was just mortified the way ppl say to store it in session history. the thing with oauth is it isnt rlly complicated, but idk why the videos always use horribly insecure examples. Now tbh this rlly depends on the site too. If you’re usin openid to get the user to log in and u set a rlly limited scope then it might not be that big of a deal. If not then u need to use the BFF pattern to either save the token or keep it in a http only cookie. doubt you’d want to store state, and if the token is too big just just split across cookies. much luck."],"points":2},{"text":["How do you explain to non-techs about necessary code cleanup?","Are you doing this because it's the best thing for the client? Or because you don't like the codebase? It's often better to let crappy code just sit there and not hurt anything.","Oh! I’ve got a really good read. It’s a post from Martin Fowler EXACTLY about this subject. It’s called Is High Quality Software Worth the Cost?It’s excellent. He makes a business case for how there isn’t a trade off between quality and speed. But the best part is that it teaches you how to frame it for non technical leaders to understand.Here it is: https://martinfowler.com/articles/is-quality-worth-cost.html","That’s the fun part. You don’t. In my experience they never give a shit.","I compare it to living in a house and never cleaning. You can get away with it for a short amount of time, but eventually it becomes a horrible, disgusting place to live, and the longer its left the longer it takes to tidyCode is no different. If no resource is allocated to paying off tech debt, the entropy of the code base increases. Any change takes longer, regressions become more likely, and you increase the risk of losing good devs","In most of my experiences, like another commenter said, you don't. They don't listen. But if you want a list, here; When explaining the necessity of code cleanup to non-techs, it's essential to frame it in terms of business benefits rather than technical jargon. Here's how you could approach it:Emphasize how cleaner, more organized code can lead to faster development times for new features and bug fixes. This efficiency ultimately saves time and resources for the company. Explain that maintaining messy code requires more time and effort, leading to higher costs in the long run. By investing in cleanup now, they can reduce ongoing maintenance expenses. Highlight the importance of addressing security vulnerabilities in the codebase. Emphasize the potential risks and liabilities associated with leaving these vulnerabilities unresolved. Point out that a clean, modular codebase is more adaptable to future changes and enhancements. This scalability ensures that the website can grow with the company's needs without significant rework. Remind them that a well-maintained website reflects positively on the company's brand and enhances the user experience. In contrast, a clunky, error-prone site can frustrate customers and damage the company's reputation. Position code cleanup as a strategic investment that sets the company apart from competitors. A modern, efficient website can attract and retain customers, giving the company a competitive edge in the market... Blah blah blah. But there's pretty much no way they will care to listen to it all. They'll figure it out eventually on their own time.But, when discussing specific projects like scrapping the mobile site and making the desktop site responsive, break down the benefits into manageable chunks. Emphasize the iterative approach as a way to minimize disruption while steadily improving the site's quality. Emphasize your expertise and experience in handling these matters, reassuring them that you have the best interests of the company in mind. Offer to provide regular updates and progress reports to keep them informed and engaged throughout the cleanup process as well.","You just put it in terms they measure by. “If we don’t cleanup xyz, then feature “abc” and “def” are going to take # of sprints longer to complete and we will be delivering new features x% slower.”Only do this if it’s true otherwise who gives a shit","Don't come up with your own argument. Here are some articles about studies you can cite.You can document a few of the issues and estimate the percentage of their code base that is affected.The Cost of Bad CodeThe Cod Quality Advantage: How Empirical Data Shatters The Speed vs Quality MythBottom line: crappy code requires 3x as many hours to implement a new feature. Makes sense, right? You have to untangle the garbage, rewrite the garbage to make sense, and then add a new feature.Good luck. I'm fortunate to work with management that understands there aren't any corners to cut in software that are worth it.","Amazon had a tenet for its principal engineers Respect What Came Before that summarizes this situation nicely https://www.linkedin.com/pulse/i-once-had-someone-tell-me-talk-down-them-mohammad-quraishi/​But sure that might not answer your question directly, so let me try to tackle the root of your problemHow do you explain to non-techs about necessary code cleanup?The answer is your dont explain. You need to make a case (using real data) for why the cleanup is necessary from a business perspective.Examples,We had 30 customer facing bugs over the past yearOur engineer team spends X Hours each week on manual work that could be eliminated.We are unable to update to a stable version of software because we are dependency on a legacy library.From their illustrate how long it would take (or how much it would cost to fix this), and provide the equivalent cost estimate if you avoid fixing it.Once this information is available your business will be in a good position to make a call about whether or not changing this cod is worth the investment.Finally, this makes sure there is actually a problem with the code, and that its not just a personal preference that you are trying to impose","\"This is the worst kept code base ive seen in my entire career. It's a time bomb and a time sink. Hire a consultant to verify my claim. It takes me twice as long to do something for you as it normally would.For now, I'm happy to keep going. I'll do my best to keep overages reined in. But I want to put an offer on the table to eventually fix this for y'all. Including the security vulnerabilities. If that sounds like something you would be interested in, please let me know and I'll put together a proposal and roadmap for how to structure the clean up and rebuild. Again, I invite you to utilize a consultant to check my roadmap, it could inform our plan even further so it would be a value add.\"","I do not do it, I just put that time in my feat crunching time.","Dunno if this analogy fits your situation exactly but I've often thought about how to beat describe tech debt.Think of building an app as building a town.You start with a road and hobble together a couple houses and you have a town. You keep adding houses but eventually your little road is too busy and causing problems. It needs some extra lanes but there are houses in the way. At some point you need to demolish a row of houses so you can add extra lanes.You can add the lanes and replace the houses and keep going OR you can build a super highway in preparation for even more houses at the cost of spending more resources now but saving them in the future.Can use the town analogy in a lot of ways, like we built a town and we can keep expanding and it turning into a chaotic mess, or we can bulldoze the town and rebuild it with everything it needs to become an organised city.Or something..","I'm a senior dev with 20+ years of experienceThis. Tell them this. If they don't listen to you then it's best to walk away because I guarantee you they will start blaming you when things eventually implode.","You’re just gonna have to accept that it’s not perfect and that you got hired to make small changes and not the rewrite their entire code base, it’s a tough pill to swallow. I feel ya man, i just changed jobs and now i’m suddenly responsible for 70+ individual websites who are all complete piles of garbage but unless they’re paying for a rebuild than my job is to maintain, if a client is paying next to nothing then they get next to nothing, you gotta put your pride aside and adjust your expectations and adjust your perspective on what you’ve been hired to do.","You are definitely a really competent person, and probably the only suggestion I feel to give you (from a person who has less experience then you) is to keep the discussion completely oriented toward what's best for the business, and not purely for the dev work.","When you’re talking about projects this size and a business this size, they break everything down to costs and what their return going to be.There’s too much to break down here but if there are as many bugs as you say there are, they are likely spending a good chunk on customer support or if they are using it to sell/operate then their agents or staff are probably hindered by the system and not making as much as they could. These are two good angles to tackle but it requires an in depth analysis of costs, problems, internal operations and a lot more.But if they are making billions it likely the system is already working quite well and you are going to be pushing shit up hill to people who don’t care about spending $100k+ rebuilding the system to save a few hours of development a month, that is not a good business decision. If you can get them to save money that impacts their bottom line then you may have a case but otherwise it’s not worth the headache.","You just put it in terms they measure by. “If we don’t cleanup xyz, then feature “abc” and “def” are going to take # of sprints longer to complete and we will be delivering new features x% slower.”Only do this if it’s true otherwise who gives a shit","Infrastructure. They're the government and at some point they'll need to build new roads and bridges or chip manufacturing can't function.","Just make a line chart with an exponential curve showing that the longer a codebase stays without refactoring while new features are added, the longer it takes to add newer features and fix potential bugs. Source: reddit.com","You don't, just chip away at it piece by piece as you touch the different parts of the code.","Emphasize about security risk. Non tech often freaks out when it comes to security.","Let it break.","I think the most important thing they would like to know is how a messy codebase will affect their project and business, so tell them about that.","Show them thishttps://www.reddit.com/r/cableporn/s/9mBvbsponI","Tell them you'll get someone to pain their house but won't tidy up after they finish.","What is the industry category? Are they selling complex products through that website or something simple? With complex products their customers will expect best practice website, on simple things not so much and you can leave it as is.","I think it's best not to mention it at all. Just every time you touch something, try to improve the changed code and its surroundings. If you need to make estimates for new features or bug fixes ALWAYS say 3 times or more the time you actually think it will take. Write lots of tests.","Hope they at least have a good test suite setup. Otherwise this would be my first step to do. It would not only help finding existing bugs but also give you a safety net when refactoring the system. Additionally you would get a deeper insight into the current system and learn more of its intricacies.","In my experience, the \"easiest\" way is to give them numbers. Let them know exactly how much time you need for tasks of various complexities before and after such a refactoring. Then it's a simple break even calculation. If you take x amount of time refactoring and save y amount of time per task afterwards, how long until you are net positive. It becomes a simple business decision that way.","You need to work as a team with everyone involved. Having greater autonomy/silo'ing yourself disconnects you from the business, and what the business and/or your supervisor needs.Involve yourself with the business processes, and offer insight, as an expert in your domain and from your perspective as a dev, as to where a process can improve and how you would do it...and leave it at that. Yes - you were hired for your experience, but also you were hired to address their immediate concerns.It's not about pointing fingers, blaming luddites, and etc...it's about making sure the company stays successful in doing what it does best. Your piece of the pie is only but a part of the mission, and throwing a hissy fit and wanting to burn the whole codebase down to the ground because of xyz...will not help you retain that job for the long term (if that is your goal). You have to see problems from their perspective, and frame your concerns/problems within that perspective.Work with people, compromise, prioritize.","Zero OOP practices. I don't think there are even any classes that aren't third party libraries.I read this and literally thought \"oh good, at least they didn't make the old mistakes of using OOP or classes\".I'd definitely go with your idea of just making it responsive to any size screens but I wouldn't replace mobile version until that's ready.","It will cost more money if you don’t do it ?"],"points":179},{"text":["Error Handling Question","An issue came up that the entire carousel failed to load because item 2 in the carousel requires some data from vendor which failed to respond and so the api gave a 500 with an error message indicating that the data couldn’t be retrieved from the vendor.So, in short, if a single item in request for a list fails, what should be done about it?This is largely about user expectations. How critical is the data for UI function?If the missing item can simply be excluded, then do that. An example would be a news carousel where the user would not even know if the story exists if it's simply removed.If the user is expecting that item to load because they want it, but it isn't critical for UI function, then a message should display notifying the user, ideally with some kind of potential resolution such as \"try again.\" An example would be a weather widget as a slide in the carousel. In this case, the slide would exist, but with a nicely styled message.If the missing data is required for a crucial part of the app, then a message should be returned instead of a carousel, along with an appropriate status code that describes the state of the request. An example here is more difficult to describe, because you shouldn't be putting globally crucial data in a carousel.As for the 500 vs 200 return, in this case return a 200. The reason is, you still want to render what's available, and any non-200 code is telling the browser not to render the payload as expected.That said, in other cases its a common bad practice to return a 200 even when there's an error. Don't return a 200 with an error of access denied, for instance. But if you want to render the data returned, even partially, a 200 is the best option.As for the notification that the vendor is failing, this should happen on the backend. If there is info that is relevant for the user, sure display a message there that helps them. But your notifications and problem detection should happen on the backend.","As an alternative, could you do some validation/error handling on the front end to just move on to the next file if an error occurs? I'm no expert, but that seems easier that modifying the API return codes to give 200 even when the file is missing.","If you're getting a list back, the request itself was a 200, but perhaps each item in the list should also include a status. This assumes that the API knows if an image will fail to load though. For example, maybe the data the API is reading is/was correct, but something happened on the CDN's side, like someone moving the image for whatever reason.The UI should be validating the API response in any case, especially if you're dealing with a request from a third party. Even then, the browser has to make an additional request for the image itself, which would return a response agnostic of the API, so the carousel could have recovered gracefully in either case."],"points":7},{"text":["How to deal with initial data needed for a new feature in my app?","Here's my recommended approach. Create a database migration script to add the initial data to the required tables. This script should be part of your codebase and executed automatically during the deployment process. This ensures that the necessary data is added consistently across all environments. If the initial data is static and not expected to change frequently, you can include it as seed data in your Django project. Django provides mechanisms for managing initial data through fixtures or custom management commands (which i'm sure you're aware of). This data can be easily loaded into the database during deployment. Before deploying to production, test the migration script and the new feature thoroughly in your testing environment. This ensures that the data is added correctly and the feature functions as expected. As you've already done, use a feature flag to control access to the new feature until the initial data is in place. This allows you to deploy the update without impacting users until you're ready. If you decide to manually add the data in your development environment and then export/import tables, ensure that you have a reliable backup of your production database before making any changes. This minimizes the risk of data loss or corruption. Always have a rollback plan in place in case something goes wrong during deployment. This includes reverting the database schema and data changes if necessary. Overall, the key is to automate the process of adding initial data as much as possible and thoroughly test it in a controlled environment before deploying to production. This ensures a smooth rollout of the new feature without disrupting the user experience. If you found this helpful and need help with anything else, feel free to shoot me a DM. :) Hope it helps."],"points":0},{"text":["Fx JSON viewer now supports YAML"],"points":0},{"text":["How bad is this","You mean taking a photo instead of a screenshot?Very bad.","It’s a code smell to me. Not invalid, not against the rules, but an indicator that the design is flawed.","pass the whole props object and divide up the relevant pieces to sub components. Stuff like this only happens when you're forcing a bunch of stuff to operate in a single file","It's fine if it works. You can paste stupid stuff like this into an LLM and it will give you better data structures to use. Get it working before you get it perfect, and then once it's working don't bother with making it perfect.","Transitioning to TS would be painful I guess.Plot twist: this is my own shit, written 6 months ago and now I can’t believe it","Good question to ask, the answer (IMO) is that its totally fine. Avoid adding additional complexity/abstraction unless there's a good reason. Typescript can certainly help with maintainability by exposing the expected data types but it doesn't seem like you have many complex/nested objects in the prop list which is where it makes a bigger difference (and more necessary). I would keep it as-is unless you're going to make a bigger refactor in how you pass data.","I have seen similar things as a project switched to React. Often this is a sign that you need to document requirements.Looks like you could make a half-dozen components or utilities out of this.Also needing to pass multiple values and setters is a good use case for moving to a shared state e.g. redux, jotai, zustand.","In one of my first projects with my basic level of react I made a mistake like this.Now I know I can use useReducer, useContext or Redux for these occasions.","This component seems to be extremely intertwined with its parent. You even have to pass down some setState dispatchers from the parent. Are you sure that using a child component is the right approach here? The alternative approach would be to keep the UI in the parent and just use custom hooks for the logic that right now lives in the child component.","Why do you need showError and setShowError? Just set it if showError has a value, otherwise don't. Same with validate and setValidate. FieldWidth and fieldHeight could be a single object with key value pairs for width and height.","That’s quite the prop def. Could you store any of that in a global state? Or maybe a hook internal to the component to get the data it needs so you don’t have to insert every single prop at render?","Ohh, what's the extension called that shows file size of imports?","its ok, but i would make interface with types","Add typescript and set defaults. Quite cumbersome to have to make 25 decisions when probably there are sensible defaults","I'm not super well versed in React best practices so I don't really see what the issue is here other than readability.Seems you could just refactor similar props into objects i.e { ellipseColor, fieldWidth, fieldHeight} = styleProps so long as you create a new object for each prop update, as react doesn't do deep comparisons on props","That looks like… anyone editing the code will age to focus a lot.","Oh gosh, this frightens me. I bet there’s a better way to structure the components to avoid this. I’m guessing that most of the JSX in here can be moved into the page component.","would raise some eyebrows. Are they all needed? title3, title4, can they be more descriptive? marginTop only?","It's not great, should be broken up into smaller logical components, and it's likely that React Context would be very helpful in this codebase.","Use sniptools.","What extension is the import sizes?","That's a lot of props for one component. How big is the component itself? I think this might be unavoidable if this is some high level wrapper component. I'm more concerned with that for cycle. I know that's not really the part of your question, but i think you should figure out a better data structure for your fields. Maybe an array of arrays. But going through all of them, and using a variable to keep track how many fields are in one row seems very tedious, and could very easily lead to bugs imo","It's alright. Split it up into smaller units (sub-objects, sub-components) at some point, but it could be worse.","I was waiting for title5 and title6 😄","Pretty common tbh. Not the best I think, but definitely common","Once I had to import 100+ images only to realise the correct way was mentioned in docs. Felt so dumb ngl. Not that bad buddy.","One Function to rule them all, One Function to find them, One Function to bring them all, and in the darkness bind them","Don't fix if it is not broken.","If the code is easy to understand and edit there's nothing wrong. I would probably place that in a configuration file though. Younger devs may think hard-coded? Oh no!","It's alrite, if it works then good, naming of some bits could be better like title2/3, but we are all guilty of naming stuff.Room for improvement? sure everything can be improved. The real question is how easy is it to add to this without it having a fit!I always try to go with simplicity, sure I can code to less lines, but does it make sense? Will the next person be able to understand what crazy thoughts are going through my head lol","Split it into multiple components, then pass those components as props.Remove localStorage access from your component.","I feel like you could group some of these, for example the title make it an object with all 4 in it. It's now just hard to read and passing so many props something is going wrong I guess.Main tip split your code more!","What language is this and what’s the problem? (Just curious, I obviously know very little about programming)","That’s a lotta props!?","import ... from \"react\";Yep, this is bad.","Leave react alone,its dead","This is why Redux or the Context API exist. Or, you know, sending entire objects as a prop instead of individual variables.","I had to ask chatjipiti to explain the syntax here. Arrow function assigned to constant with function parameters destructured from some sort of object.Clever like nested ternary operators!","You lost me at 'useEffect'","I’d think do I really apply logic based on every single one of these? Might be prop drilling that React Context API will solve","Take a look at contexts. Maybe jotai","I mean it's fine if it works...?","Bad. Should be passing an object instead, at the very least…"],"points":1480},{"text":["Where to host image gallery for a tattoo shop?","Why not host them on the same server as the site, in some sort of user uploads directory?","Same server. With low daily traffic and only 250 images it's not really needed to have a CDN or anything exotic."],"points":7},{"text":["Tips for reading and understanding open source codes","Pro tip: The more you read the better you get at it.","Choose a small, well-documented project to start. Read the documentation to understand the project's purpose and structure. Explore the codebase gradually, following execution flow. Take notes and experiment with small changes. This helps a lot. Use version control tools like Git to navigate history. Ask for help when needed, there's no such thing as a stupid question! Everyone on here is super kind, and very willing to help other devs:)"],"points":1},{"text":["Does big company use public login page for admin panels/pages?","Generally you can only access protected pages from within a specific network, which means either from the office or via a VPNAlso, this exact thing happened to me ≈20 years ago. I came across a login page, and decided to hack into it (\"hack\" being a very lose term, just a stupidly simple sql injection), then draw smiley faces on their calendar, post fake job listings requiring someone to dance around in a chicken suit, and other random crap like that. I have a felony for it. Oops.","We use Cloudflare Zero Trust.When the employees need to login they would go to example.com/staff . From there Cloudflare would check if they have a valid token and if not it would show them a login page (assuming they also match other requirements.) We require them to login using their business email which we have hosted with Google and that itself requires 2FA. Once they get through that they then have to login with their example.com credentials and any extra security we require for their specific access.Attackers will not even be able to reach any page under /staff until they pass the cloudflare requirement.","Lots of businesses use Single Sign On, where their corporate account authentication and permissions is managed by (most commonly) Microsoft Entra ID, Okta or Amazon. This also allows for endpoint security checksSome services require you to be on a corporate network but that is getting rarer for newer services","While restricting access by IP address is fairly common, with appropriate application-level security it shouldn't make a difference whether any random Joe-public can stumble across your login page; if you've done everything right, merely having a URL to access a login page should not be sufficient to gain any attack advantage.","As with most questions of this type, the answer is \"it depends.\" We're a web development agency and our clients are small to medium sized businesses that usually lack a dedicated IT department. Most of our clients would never tolerate having access to their dashboards too buttoned down, so we usually keep it simple. The login page is usually obscured behind a weird URL, we make sure that legit robots are discouraged from indexing the path by setting noindex nofollow on the robots tag header, and we implement basic 2FA if the clients will tolerate it (usually a code sent via email or SMS - not as secure as an authenticator but unfortunately our clients are usually too dumb to use authenticators). On one project we even use a simple little IP whitelist and just block anything not on the list with an app-level firewall. If the IP is whitelisted then we show the login form. On a few other projects we use hardware level firewalls with IP whitelists that are the first line of defense for the login forms. But for the rest of our projects, our clients just won't tolerate anything more than an obscure URL and basic 2FA. They want to be able to access their stuff easily and quickly. Such is life when you're a web development agency - we have to build stuff that satisfies clients rather than our own preferences.","SAML, VPN","Certainly not ideal, but doesn't mean it's not secure.","When I was working at a bigger company, we chose a middleground.General acces and view of data was available from public internet.Editing data was only possible via vpn.This way you could still easily check something from home with your phone, but it was still secured from malicious edits.","Big companies typically use more secure methods for admin pages, like multi-factor authentication or privae VPN access. Using a public login page for admin panels is like leaving your back door unlocked in a sketchy neighborhood. Not a great idea. A for me, I just stick to the basics and hope for the best."],"points":507},{"text":["Tech stack for website with frontend only (but lots of JS code)","Because of the popularity of it, React. Because lots of companies use it. If you already understand react then nextjs. But I wouldn't do nextjs as your first UI project, it's a little more advanced per se","Just use React","If you’re not a front end dev, why would you want to work on a website with little backend code?","You probably need a build system like Webpack to allow you to work in separate files (perhaps using a CommonJS module pattern to import shared dependencies) and then compile it all into a single script for deployment, or perhaps attempt to tree-shake it per-page if you have multiple distinct use-cases.","Sounds like the exact type of scenario React is made for.","Vue app scaffolded with vite. Vue is very easy to get into and has a component based approach which makes splitting code/functionalities a breeze.","Nextjs"],"points":4},{"text":["Simple trick to merge/override Tailwind classes...","So your own talwind merge without the good thing from tailwind merge which is actually overriding colliding styles?","\"Simple\" 😂Just learn CSS, Christ.","I'd tried posting on this subreddit some time ago but didn't have enough karma.Glad I can post now.If you found the above code helpful, let me know in the comments..."],"points":6},{"text":["Need help validating my b2b SaaS/MVP","This is commonly known as \"synthetics\" testing, and it is widely available from an assortment of companies already. And the companies tend to offer a lot more than just error monitoring.Validation, here, is a common one. Why should I use this over the assortment of established solutions?","How does this compare to Datadog's synthetic monitoring?"],"points":0},{"text":["it's not the usual blah blah","You be suprised, how many people delete shit, and then ask: Can you restore it, i thought i didnt need it.","\"You're trying to delete your account. Are you aware that this means your account will be deleted?\"","I'm so close myself, what pushed you over the edge?"],"points":16},{"text":["Need some help with creating a structure for an ASP.NET Core site with dozens of different services/forms."],"points":0},{"text":["Inside Chrome Browser - Part 3"],"points":0},{"text":["local offline [mysql, mariadb] database file without server local ?","If you want just a local database without any server look into SQLite.Since you are wanting to build a desktop application, webdev is the wrong sub for help with that."],"points":0},{"text":["Seeking help for a chat application project"],"points":0},{"text":["LinkedIn Auto Login - How Does It Work?","If only google existed.... took all of 20 seconds to find this for you. Both the first results.Search \"linkedin auto login\": https://www.linkedin.com/help/linkedin/answer/a1341762Search \"google auto login\": https://developers.google.com/identity/gsi/web/guides/automatic-sign-in-sign-out"],"points":1},{"text":["Speedometer 3.0: The Best Way Yet to Measure Browser Performance"],"points":0},{"text":["Accidently put article content in index.html file","You have to leave the country. This is unfixable.","Buy a whole new website and try again. Then, if you need to make updates, rinse and repeat. It’s the only way.","The beauty of HTML is the first letter, Hypertext. You can put as many files as your host will allow. They can be images, JavaScript files, videos, CSS stylesheets, whatever you like. At the heart of it all is the HTML page. So make a copy of your index.html file (or whatever it’s named), edit the original to point to the copy, say, article.html. The main thing you have to ask yourself is whether this is likely to be a common occurrence in the future, and if it is, find the tools that best work for managing your site."],"points":54},{"text":["Improving Performance in Firefox and Across the Web with Speedometer 3"],"points":0},{"text":["What are some recommended websites or platform to apply for junior/intern level positions ?"],"points":0},{"text":["Speedometer 3: Building a benchmark that represents the web"],"points":0},{"text":["How can I teach DNS and Hosting management to my students without asking them to buy their own domains?","Wondering if getting the school to buy a domain and setting up a subdomain for each student would give them the control they need to accomplish your instruction.","You could have a local DNS server running such as PowerDNS, it also has a handy UI app - PDNS Admin","Teach them how to set up and configure a DNS server.","I'd reach out to CloudFlare, explaining what you're doing, I bet they'd be willing to help assist you by giving account credits, referrals, or something of that nature.","teach them while using InfinityFree for creating free domains, it has everything inclusive of database management, basic cpanel, hosting","When I worked at a school long past, we did it by having our own internal DNS server, could make an many fake domains as we wanted then.","What I did was spin up a vm with ispconfig locally, and built out subdomains of my dot online tld domain. Let the students build out thier projects as subdomains in ispconfig and FreeIPA LDAP. It was Isolated and super easy. All just like building out live customers at scale, but in a lab. Did that for about three training sessions on the basics.","try duckdns","Perhaps you can use the hosts file from windows to show domain > ip linking","Install bind and explain the config ✊🏻","If buying domains is an option, look up numeric XYZ domains. They're domains that can be made up of 5-9 digits ending in .XYZ that are very inexpensive at around $1 a year. Perfect for experimental stuff and testing. You can probably have them created with their student IDs for ease (if they're completely numeric IDs), so each student would have a domain that's just their ID followed by .xyz. This might be a cool touch.I'm not sure if you can buy domains with the .xyz TLD from Cloudflare but I know you can buy them from Porkbun (one of the top and cheapest registrars) and use Cloudflare DNS by pointing the nameservers to Cloudflare (fun fact, Porkbun also use Cloudflare for hosting their own nameservers).","Tryhackme maybe","This is not related to Cloudflare but might be a good thing to teach about DNS:https://messwithdns.net/More about it: https://jvns.ca/blog/2021/12/15/mess-with-dns/","You can try 000webhost ! I used that for a lot of my testing while in school :)","One other possible option is to consider the GitHub Student Developer Pack.It provides free domains for a limited time through tie ups with providers.Students can get their own domain and have full control over it.","cloudflare wont ever accept subdomain, unfortunately","GitHub, or put them all on sub domains of a domain you own.","just ignore the domain namehave them forward the ports in their routers to their machinesthey don't need cloud hostingthen the machine is reachable via its external ipall a domain is is pointing a URL to an IP addressits entirely valid to show them how its done, but focus more on having a functional webserverits about empowerment, having them unnecessarily pay entities and making them agree to legal contracts with these entities is just you casually throwing students (like most institutions do) into obligations they do not agree with simply because you told themits a common thing to do, but its still unethical because obviously if you tell them to buy a book, or a service, there is the appearance that your profiting from collusion"],"points":124},{"text":["What GPT in GPTStore do you use to help you come up with a design?","Nothing great yet. Just hire a designer off dribble with a good portfolio and degree. You’ll get much better results with less hassle and you don’t need to do any fixing."],"points":4},{"text":["Why does my website receives ~10 fake users per day?","I would recommend you to implement a simple honeypot system. It’s an human invisible input field in your form which only bots will fill. Then you can filter between real and bot users. ;)","The easiest method is to add a honey pot. If it still happens then add a captcha and/or CSRF token.","There are a lot of different bots out there, however here are some that I know make the rounds:Create a login to then make comments / reviewsCreate a login to make a profile that has links in itCreate a login to try and scrape other member's data, emails, phone numbers, etc. or any other data behind a signup wall","I've had this same issue. I believed they were doing it to flood victims inboxes with unsolicited emails so they'll miss an a key email like \"Your PayPal account was just accessed from xxxx\".Adding a captcha will solve it.","Do you send an e-mail automatically to the person who registered?I had spammers signing up for users at my site because we automatically sent e-mails out. They'd sign up with first names like \"BUY VIAGRA AT http://....\"Then we'd send off an e-mail, doing their spamming for them.","I was getting like 200 - 300 fake users per a day. I added Cloudflare Turnstile to my login page and it dropped down to nearly 0 fake now.","Could be someone testing out a bot, or trying to poke around your site for some vulnerability.My site was getting tons of form spam (contact form), almost non stop at one point. I implemented silent, hidden reCaptcaha. But at the same time I also switched up to a new version of php for the backend, 5 to 7.x. Some part of me thinks switching the php version may have stopped everything. Thankfully, either way it did stop.","Could be real users. Real users are confusing and unpredictable. Careful with this","This is a common way scammers help to defraud people, let's say hacker has access to your PayPal account and they are going to buy a ton of apple cards or something, they use websites like yours to hide the notification emails the user will receive when they perform their actions on the service they have gained access too.As an example scammers wants to purchase an apple card with your PayPal account, so they set off a bot which signs you up to 100s of websites over the course of a few minutes, in the interim they make the transaction and the confirmation email is buried in between all the spam so the user is less likely to notice and to cancel the transaction.","Its just bots, easiest solution is to make a hidden field that users cant see but bots can and then ban any users that fill in that field. This is called a honeypot.","How do you know they are fake? Sometimes I’ll sign up just to check it out, and then never use the site again.That’s natural user behaviour if your entire product/service is behind a login screen, especially if the first post-login experience is high friction or doesn’t seem to meet the expectations set by the landing page.","Here is the best solution to that:<form onsubmit=\"document.cookie='i\\_am\\_real=1';\"></form>​in your receiving script:<?php if($_COOKIE['i_am_real']){ echo \"you are real!\"; } ?>no need to piss off people with captcha. all those bots are too stupid to parse javascript. Of course you can make the cookie name random and make the script more difficult.Another way is instead of <input name=xxx type=text> you can use <div data-type=text data-name=xxx></div> then write a javascript that creates inputs based that. Bots won't even find your forms.","why would bots do that?Because it's simpler to make a bot try and signup to anything that looks like it might result in gaining a link to something, than trying to manually curate a list of sites.","Even if you add a very simple question as a CAPTCHA it almost always works well enough in my sites to cut out the junk bots, eg if your website is selling gemstones...\"Please answer the question: This website is mainly about, gazelles, golf, gems, or grass.\"","One possibility is subscription or registration spam. Someone could set up a bot and use your site to send a registration email to the target, and could also be doing so on other websites. That could lead to the target receiving thousands of messages, and could be for various reasons.Another is to see if the address is valid, or already registered with your site. If it isn’t, now they know the user doesn’t use that service currently. If the target email already exists, now they know one service the target uses and can design a phishing email, for example, similar to your company’s emails and attempt to phish the user.Also, if registered with your site, the attacker could try to access the user account on your site if the target was included in a a breach or leak and test those credentials against your site.I’d add a captcha, or some other human verification that’ll probably drop it down to ~1 rather than ~10 at a time.","Here's the million dollar question you didn't answer OP: How are you sure they are fake?","Honeypots: These are invisible fields in your form that users don't see and, therefore, don't fill out. Bots, on the other hand, often fill out every field, so you can filter these entries out.Or implement checks to see how users interact with your site. Bots usually have a very straightforward, scripted way of interacting, unlike humans.","How do you know they are fake?","I use CSRF token, Google Captcha, and also send a token to the users email which they must verify for their account to be activated. The verification token expires within 48hrs but they can request another from the login page.The sign-up form also uses a library that does basic email validation during registration.The only fake users I get sign up with disposable email.","add verification step, on signup, send a code to the email which then need to be entered before you can store the user data in your database, most common now is use token instead and send a url to the email.","Welcome to the Internet.Bots, bots everywhere and getting worse.I have my online forms and login protected with Google Reccaptcha and it works.For the most notorious bots I block out entire IP ranges especially if it is a country where they have no business browsing the site. I got block IPs at the server level since I own my own dedicated metal servers.","They just signup, receive the confirmation email and do... nothing.What are you expecting them to do?There do exist people who sign up for things they may or may not get around to looking up later. Or who don't get the email. Or who do get it, but it's filtered out of their inbox by macros or antispam systems.If anything, I'm surprised it's only ten per day.How is ten people's initial information per day causing you any kind of perceptible load on your databases or email systems (or anything else)? If it was ten million, then OK, maybe you'd need something a little beefier to handle it, but... ten?","The influx of ~10 fake users daily may be bots testing your system's vulnerabilities. It isn't solely to increase your email or database load, but could be for various nefarious purposes. I guess that implementing a CAPTCHA is a good start to mitigate this issue.","recaptcha v3 for example, is simple to use and implement. it's free and will prevent most bots. why not use it?","Captcha is not working?","Scammers seem to waste a lot of time and energy until you realize when their attacks work they hit paydirt.Like everyone said, secure your app, captcha, cloudflare, honeypot, up front cost. Keep your app clean and make it not worth their while for you.","I've seen this before as an way to relay spam content to real emails. The spammer fills in spam content as the form data Text + Url as Firstname + Lastname etc. Spammer is hoping that you are printing that data in the body of the email somehow. They get a trusted SMTP account as the sender.Magento had a big problem with this before they implemented native recaptcha in the platform (and for some reason had 0 length limits on the firstname and lastname attributes for the customer entity).Beware this can get your mail delivery IP blacklisted by spam filters if enough people get pissed off and decide to flag you.","why would bots do that? Make us spend money on emails?Idk about filling out the signup form, but my sites regularly get hit with requests to non-existent login pages, which seems like an attempt to hijack old WP sites.","Add a captcha, fixed it for me","10? Hah. That's literally nothing. We get thousands per hour. This is why captchas exist.","I had the same problem. I had to go in and manually delete their accounts. We don’t know why. We’re not a large service and we don’t know how they find us to target us. We implemented some extra bit detection and captchas and it’s been better. Maybe 1 a week gets through.","Who cares why. (Maybe they are pen testing for exploits, like a csrf or xss attack.)Cloudflare bot protection is free. Also use a re-captcha.That should at least deter them.","+1 for the honeypot/captcha if you do end up going for the captcha method you can always do invisible first before impacting users using the form with something visual.","It’d be hilarious if someone on your team was secretly paying for a service to modestly fake/pad your adoption and you’ve built a feature to automatically remove them 🤣","I recommend avoiding registrations directly, a simple honeypot is very effective and prevents your application from sending thousands of registration emails to email addresses that surely do not want to receive them.Many times the registration email even bounces because the destination mailbox is full. I don't know if that can give you points to end up on a blacklist, but I prefer not to find out.","I'm sure you are probably right. But there are plenty of real people out there that behave like bots. The invisible forms folks have suggested sound a good idea, also consider a trivial one-off captcha (only your site says \"type the sum 42+89\"), just enough to be a barrier to broadcasty bots.Personally I'd avoid strict filtering, in case there are genuine users that look the same as fakes. Maybe have a greylist kind of bag, treat them the same as real users for a couple of weeks, if there's subsequent legit interaction, whitelist. If not, block them."],"points":1304},{"text":["What is the paid advertising world like in 2024?","google ad sense revenue calculator(plan for the lower (much lower) end of whatever they say)adsense guide to blocking adsif you are collecting the type of information that lets you know exactly who your users are and which ads they get, be very careful. That could be illegal depending on what youre doing and where you are. You are obligated (in certain places, by law) to let users know exactly what data you collect, and how you use it.Ultimately, you are in control of where ads appear on your page. if ads are ending up on paid users and you dont want them to, its not google's issue. you put the code to display them there.","You could try influencer marketing like word on the block"],"points":3},{"text":["The High-Risk Refactoring","Bare Bones:The post discusses the inherent risks and strategies associated with high-risk code refactoring. It highlights the potential negative impacts on business, team trust, and feature development when refactoring is done improperly. The article offers a checklist for addressing risks, emphasizing the need for defining constraints, isolating improvements, writing extensive tests, and having visual confirmation to mitigate the risks. It advises against skipping tests, relying too much on code reviews, and mixing significant cleanups with other changes. The importance of evaluating the risk and proving the system works before and after refactoring is stressed, alongside practical examples illustrating the challenges and considerations in refactoring coupled with feature development.If you don't like the summary, just downvote and I'll try to delete the comment eventually 👍Click here for more info, I read all comments"],"points":1},{"text":["The Two-Tree Problem with Styling on the Web","Weird that the author thinks Javascript doesn't have pattern matching...","Now, for media queries like @media (max-width: x) and @container (max-width > x), I've just decided that I don't need (or want) them. Width-based media queries create rigid layouts. Rigid layouts are not flexible and can become a maintenance burden. The reality is that we live in a world of infinite screen sizes, and breakpoint-based design is so 2015. Instead, I use fluid layout algorithms such as flexbox and gird.Must be nice to live in such a bubble - in reality, most webdevs will have to work with designers and can't just tell them \"nah fuck your design, I'll do it my way with fluid layouts\"."],"points":1},{"text":["Site for a family tree?","https://www.mediawiki.org/wiki/Download might serve your purpose well.","Hi, im pretty sure you could set it up with any of those free page builders out there (seriously theres a ton just one youtube search and youll see) but im not really sure any would fit your budget, if you could provide more information and if its not that big of a task i could do it for you using code and figure out somewhere you could host it for free","Have you checked WebTrees? The software needs to be hosted somewhere. Before you put it on the internet, you should figure out what degree of privacy you want.","You can either use DIY website builders (Squarespace, Weebly, GoDaddy, Webflow, etc.) or open-source software (WordPress, Drupal).Weebly has a free plan, so it might be good for your situation: https://www.weebly.com/pricing","You can build a tree for free from ancestry.com. They will charge you if you need their research resources.If you’re serious about genealogy, many genealogy applications can build the html for a site for you to host somewhere. Stick the output in a git repository and host it using GitHub/GitLab pages."],"points":0},{"text":["Any insights on how can I make this curve with HTML and CSS?","ooh, I did something like this a while back with svg: https://codepen.io/thisanimus/pen/zYMLGYq","Easiest and most browser compatible way is with an SVG image.","Perhaps with using CSS Clip-Path: https://bennettfeely.com/clippy/","You could do it with an svg, or clip path. I think svg is the way to go, but that is because I've always done it that way.","You can adapt from this to suit your needs:https://www.youtube.com/watch?v=ArTVfdHOB-M","All things are possible through border-radius","You could probably use that ‘gooey’ effect which was doing the rounds in demos a few years back, if you were absolutely insistent on only just using HTML and CSS. You have your white background area, create a white circle with a pseudo element or something, blur the whole lot, then apply a ‘threshold’ type filter with contrast. Ridiculous approach though, this kind of control over graphics is very much svg territory.","Yeah I would go with an SVG.","This would be pretty easy to achieve with absolute positioning of a pseudo"],"points":257},{"text":["Need help with Deployment of first web app!"],"points":0},{"text":["API Testing tools that allow saving to local server","https://github.com/usebruno/brunoIt saves the API collection to file, each API has a seperate file. You then can use git to share to other people. Highly recommended.","If you're working with PHP Saloon might be an option. It can be set up to use the actual API response for testing, so the first time you run a given request during a test run, it's stored to a file. On subsequent test runs that file is used to get the data without making further requests.This gives you the advantages of being able to work with real API responses if you need to, without the overhead of making network requests on subsequent runs, having the tests fail due to network issues, or incurring costs due to making actual API requests."],"points":1},{"text":["I spent last night building a minimal news reader"],"points":0},{"text":["Wondering what else I need for payment functionality using stripe"],"points":0},{"text":["Just started with SQL. what's wrong here?","Your database does not allow you to create tables in the \"public\" schema, which is the default used if you don't specify one. Either give yourself the permissions to create a table in public, or use a different schema, like CREATE TABLE schema.student","First thing to check would be whether the username you used to login to the PostgreSQL dbms has CREATE privileges on the schema named \"public\".https://www.postgresql.org/docs/current/sql-grant.html"],"points":53},{"text":["Button with two function calls not calling bot the functions.","If you need to call more than one function, you should use event listeners. onClick only can handle one function","I checked your GitHub, does any of your JS work? You should reference the JS file from the head of your html, not the end of the file. Beyond that, do as someone suggested and put that in a jsfiddle or a codepen project and share that instead."],"points":1},{"text":["Custom Borders (Vanilla HTML, CSS, JS)","I'd probably use border-image (basically CSS 9-slices) for the repeated semicircle border effect, personally. That way, the SVG wouldn't need to have the horizontal tiling built in: you can just do a path for a single semicircle and be done with it. You can use SVG files and even inline SVG documents (i.e. data URIs) as border images, and you can scale the size of each slice.If you want to use an extra element, though, then sure, that CSS will work. Just make sure to remember the basics, e.g. the element is inside the footer and the footer is position: relative, the top is the border thickness but negative, and so on.As for editing paths? There are online editors like this one."],"points":1},{"text":["What tech stack can and should I use (for my own sites and experiments; on all-inkl.com)","PayloadCMS is only compatible with MongoDB (document database) and Postgres (SQL database like MySQL but support is in beta). I use Postgres with Payload and haven't run into any major issues.XAMPP still exists (and isn't really recommended anymore), but if you're using Payload, you'll need Node to run it and can use Node for local development as well. Look into Payload's templates for an all-in-one CMS and frontend solution.","When it comes to compatibility, whatever software platform you choose should fully support whatever your hosting provider offers. This both programming language, and database ond their versions. If you're running javascript on the server, your host needs to support nodejs.Depending on your goals, you might not need a full CMS. Adding complexity means learning more. Installing & upgrading the software, database as well as addressing any issues that come up isn't always straight forward. If your goal is to learn a specific programming language or platform, you're better off choosing a web host can support the platform you wan to learn. If you're just looking to make a portfolio and do some front end development/experimenting, try looking to simplifying your platform. Some options for this may include:Use purely static website (i.e. html, css, & js). For this you don't even need to set up any software at home. Just open / reload the html when developing and upload the files to your server when you're done.Ditch the database, and use a flat file cms. In a flat file cms, the data is stored in files rather than in the database. You only need to install the cms, and upload the static files containing the content / customizations to your webhost. There should be PHP based flat file cms' that's supported on your webhost.","I use XAMPP, but you can also use MAMP if you're on a Mac..."],"points":2},{"text":["I have to setup a new front-end workflow, but I can't run the one that I used years ago. Any tips or recommendations?","I would suggest Vite Vanilla with added Sass (npm create vite@latest myapp --template vanilla). That's a bit simpler, but caters mostly to JS-apps.But I guess you also need to compile HTML-Files and have a whole structure? What are your requirements?I tried to run your repo but yes, the deps are too old, lots of deprecation-warnings etc. I guess it's easer to create a new starter-kit with your current requirements.","I use Laravel Mix still. Works great even on node v18. Might not always but it'll get you up and running quickly."],"points":1},{"text":["Alternative to \"sharp\"-library wanted","exif.js for metadatanative canvas api for resizing","Jimp is a native node implementation. It's slower and also doesn't support webp so it's not ideal.Or if node canvas (as someone else suggested) doesn't work, you could have an offscreen canvas in a worker to modify images before upload.Besides that, maybe you could host your own micro service using sharp in an environment that supports it"],"points":1},{"text":["SQL vs MySQL vs NoSQL and what to choose as a new starter?","First, MySQL is just a specific SQL database, they’re not separate things.It honestly doesn’t matter which one you learn first.  Relational databases (sql) and nosql have different use cases and over your career you’ll often use both on a single project.If you want to go for SQL, choose MySQL or Postgres, or SQLLite even if you just want to play around without any setup.MongoDB if you want to go nosql","NoSQL (although it's very broad term) has its own place but for regular apps almost every time SQL is a better choice.","They go great together :) use python to query a db using SQL. I would start with relational databases as they teach fundamentals that nosql trades for other benefits","Learn SQL and relational database design. It’s the tool for the job 99% of times. NoSql is attractive to newbies because “hey no need to learn SQL” and for most of your hobby projects it will work just fine, however as data increases and relationships get more complex, it becomes apparent that NoSQL databases were not designed for this use case. And I can almost guarantee that all if not almost all your project ideas have relational data. NoSQL is GREAT when used for the job it was designed for, it’s just that most projects don’t need it. Then the personal benefit is that well most projects use SQL so you’ll feel more comfortable joining a new team, and thus it is a more marketable skill.","Non relational databases tend to be for more specific purposes where a relational model isn't a good fit. MySQL these days is pretty solid and you should do fine with it.","Learning SQL was allways beneficial.","The choice isn't up to you. You want to know how the data is stored that may be interesting for you and then learn the tools. My suggestion is to get in touch with an engineer and ask him about it, also ask about advice how to safely navigate the data.","RDBMS (SQL/MySQL/etc) - the other one is bullshit","I'd argue that NoSQL is easier to start with. You just dump your somewhat structured data into the DB and can start querying. No need to look into foreign key relationships and all of that. If you go with an ORM you can also achieve something similar with relational DBs though.In the end you'd need to get familiar with either one of the paradigms and it's mainly a matter of personal taste."],"points":43},{"text":["High Quality Open-Source Software for Web Developers","Dailydev looks cool, just signed up.","That post in question mentions Tanstack router. While I commend Tanner for the work he has done (especially with React Query), I would suggest those looking at routing libs also look at: https://github.com/molefrog/wouter. I recently ripped out React Router from my app and replaced it with this and it's been a very nice experience.The lib provides routing primitives of sorts and you can build additional functionality on top of it pretty easy."],"points":2},{"text":["I've been learning how to build static landing pages and cafe menus for a while now, and I think I have everything figured out, except for one thing. I've been trying to find out what the best way to deploy it is","Look into github pages, but even cloudflare pages are fine for your use case it seems.There are a thousand ways to do it, as long as it works for you!","You're doing it right! Just stick with Cloudflare my friend.","Are you doing this as a personal project or to deploy for someone else?","Netlify. Vía Drag and drop It’s free to start","Cloudflare pages has you covered"],"points":8},{"text":["What do you like and don't like about Render.com ?","never heard of it","Deployment and setup was extremely easy for me with setting up a Next app alongside an Express api, postgres db, redis cache, and a periodic cron job. Their web services fit my preferred concept of keeping everything as separate entities on the chance that I need to scale one of them. Their internal routing is nice to keep latencies low between services. I've had no downtime and any issues that were caused on their end were properly communicated and resulted in no issues for my application.I have no real issues with their pricing but I know its not as generous in the lower tiers as other platforms.","Tried them with my toy app for a while, it worked OK and was the Heroku-lite that I was looking for. I switched away though because they charged $10 a month for Postgres, which is free on railway.app","Just had a quick look at the docs. It deploys master commits by default and seems to have no staging concept. That is really rough.","I’ve deployed a few Rails apps on render and the process was very simple. I’ve enjoyed using it and it’s met all of my needs","Evaluation of this and a few others in this realm:https://www.brycewray.com/posts/2023/03/publish-or-perish-2023/"],"points":21}]