[{"text":["Sony is reportedly pausing PSVR2 production to clear excess inventory","Entire tens of people want to wear those ridiculous things."],"points":0},{"text":["Apple’s AI ambitions could include Google or OpenAI"],"points":0},{"text":["Reddit IPO Filings Reveal the Company’s Hopes—and Fears"],"points":0},{"text":["Australian taxi drivers win $178 million payout from Uber"],"points":0},{"text":["Supreme Court examines whether government can combat disinformation online","The Federali$t $ociety runs the US supreme court... the US supreme court has made themselves irrelevant","Hey Moms and Dads, when Donald J. Trump stated (and restated as recently as last year) that he could grab women by the pussy because his own fame and fortune gave him that privilege - he meant he could do that to YOUR daughter, wife, mother, sister, girlfriend, and aunt too.Do you not believe Trump has this same selfish disdain for our democratic principles, processes and institutions? Vote to protect democracy and family values - don't vote to protect the value of the rapist's family.\"Consequently, the fact that Mr. Trump sexually abused - indeed, raped - Ms. Carroll has been conclusively established and is binding in this case.\" See page 13 of the Judge's decision ... https://storage.courtlistener.com/recap/gov.uscourts.nysd.543790/gov.uscourts.nysd.543790.252.0.pdfMore questions about Donald J. Trump being a rapist? See the Judge's opinion at https://news.justia.com/wp-content/uploads/2023/07/Memorandum-Opinion-Denying-Defendants-Rule-59-Motion.pdf (warning: this court decision contains extremely graphic and blunt descriptions)","Alternate title: Supreme Coet to decide if Gorvernment can declare what's true online","Sounds like a job for AI. I wholeheartedly trust that it can decide what’s disinformation.","Not like there are some more pressing issues to decide, could do those first.","Fighting disinformation with your own disinformation doesn't really cancel anything out. I don't think it's the best idea to allow the US government to dictate what constitutes \"true\" information.","Those bozos can't control disinformation in their own court room!!","Disinformation? You mean gossip, discussions, lies, debates, etc.? Disinformation has existed alongside the human experience for as long as humans noticed disinformation about others helps to boost their own cause. This debate is ridiculous. All a matter of perspective.","lol no possible way dudes. You used child pornography as a tool against the population to try to control their library.They are now armed with fantastic tools that can make you appear in any situation they want and they will have you on your knees.It never was illegal to see or speak or hear. Only Nazis would think it is illegal to see or speak or hear."],"points":43},{"text":["FAA audit of Boeing's 737 production found mechanics using hotel card and dish soap as makeshift tools: report.","And throughout this entire corporate disaster, the CEO and other senior executives have managed to keep their jobs. Time to ditch any Boeing stock you have left","Hotel card and dish soap. The dude was just finishing off his bead of silicon nice and neat. The car would give a nice radius, normally use a tongue depressor. And soapy water stops the caulk sticking you fingers and tools.","they’re two very valid tools.. just depends on what they’re used for","Nothing wrong with any of this.Now, moving Boeing corporate headquarters to Chicago andProduction facilities to North CarolinaThat's some damning shit on the part of the executive team, trying to squeeze every last dollar out of everything","Article is paywalled but if I was guessing, hotel card is used as a known measurement tool and dish soap is used for finding leaks. 20 year aircraft mechanic and some things are easier to use and do the exact same job as the approved tools","So, a soft plastic scraper and short-term lubricant. I don't think these two things are the indictment the article/report think they are.","I knew this company was toast when we found out the two Max 8 crashes happened because they packaged life-saving software fixes as premium DLC.","When stock buy backs become more important than your actual business and profit becomes more important than your business it’s no surprise that quality of work, people and tools decline.This is what the end of capitalism looks like.","FAA auditors commit suicide. Tomorrows headline","I thought the FAA was required to disclose their findings to the public. Or does boeing have a figurative gun to their head?"],"points":553},{"text":["Biden Bans Rival Nations From Buying Sensitive US Data","After someone said if China wanted the data from Tik Tok they could buy data from any provider in the US and get better data.","Wait. You mean those that collect our data aren’t using it responsibly? If only we could have foreseen this…","How about banning across the board","This is something we didn't ban immediately?","So non rival nations can buy then? And sell to rival ones? I just can't 🤣","Now can he ban the US from buying its citizens data 😂","It’s basically the same way they handle cigarettes- knowing that they are literal poison. It’s much more lucrative to collect the highly inflated taxes.We are the product now and we’re worth a lot of money to these folks. I don’t anticipate that they’ll allow us to adopt EU privacy standards any time soon, Ooo but they gonna FAFO pulling TikTok.","If you can’t get it from me you can always get it from one of our allies for less.","Sick! So now they can just collect it off Tik Tok.","through official and direct meansOur “rivals” don’t care about our laws. What we need is an outline on how we’ll handle third party resellers since this ban will create another black market.","They’ll just get it from the RNC now","TikTok is on place I know that my search history doesn’t show up as an Ad","It’s ok Trump already is selling all the State secrets.","The problems with TikTok are: The Chinese government are AI tampering in order to destabilize our society by what TOKs are emphasized. They are having their influencers sow all kinds of misinformation, disinformation, propaganda and straight up lies into our vulnerable population.","Absolutely unenforceable, but at least now there’s a tool to charge people with"],"points":158},{"text":["Mission Zero Technologies raises £21.8M for modular direct air capture tech","Has there ever been a carbon capture company that wasn't just a huge vaporware scam? Kinda like solar roadways and such, these ideas always sound cool but end up not making sense in execution.For carbon capture that's powered by electricity, doesn't it only make sense to deploy when all our power plants are clean energy and we need to capture even more carbon beyond that? Because right now building a solar power plant reduces more carbon than carbon capture, since you're reducing the amount of fossil fuels burnt directly."],"points":1},{"text":["Filipino police free hundreds of slaves toiling in romance scam operation","John Oliver did a segment two weeks ago about the so called pig-butchering scams and what it does to its victims and how most of the people on the other end of the scam are also victims held in slavery by organized crime and forced to scam westerners.Pig Butchering Scams: Last Week Tonight with John Oliver (HBO)"],"points":3},{"text":["Apple in Talks With Google to Bring Gemini AI Features to iPhone"],"points":0},{"text":["Apple Is in Talks to Let Google’s Gemini Power iPhone Generative AI Features","Wait, are we supposed to be excited about AI or scared of it? I feel like I went to the bathroom at the wrong time during a movie.","Apples whole thing was supposedly going to be the ultra security of running ai on-device but it’s going to be tough to crack the ai-space in a meaningful way if their service is not as robust as gpt4. I can totally imagine them doing it though as it will push hardware sales."],"points":2},{"text":["xAI open-sources base model of Grok, but without any training code | TechCrunch","Grok sign looks like Deutsch Bank"],"points":1},{"text":["Apple is reportedly exploring a partnership with Google for Gemini-powered feature on iPhones | TechCrunch","Smash (X) for doubt","Would this mean the iPhone vs Android flame wars will end?"],"points":7},{"text":["‘Massively concerning’: Under Armour’s ‘AI-powered sports commercial’ sparks controversy","The brains behind your underwear, very concerning. You appear to be eating too much Taco Bell..."],"points":1},{"text":["Let’s not make the same mistakes with AI that we made with social media | Social media’s unregulated evolution over the past decade holds a lot of lessons that apply directly to AI companies","Who’s gonna regulate them now? The 70+, 80+, and 90+ year-old fossils in Congress?Puh-lease.","Do they mean don’t let a few big companies monopolize the field, sucking up everyone’s money while producing a miserable excuse for what might have been if it had been properly managed? Yep, way too late for that.","Can't regulate common sense.","Too late… damage already done, it’s out there, unregulated. The more you try and get the toothpaste back into the tube, the messier it gets . buckle up.","Why is this talking like it’s too late to stop media companies from controlling us?Oh yeah, because it’s so important social media companies are allowed to continue that they are banning the competition","LMAO the mistake has already been made, you fucking idiots.AI has already killed literally hundreds of thousands of jobs.With the reveal of \"Devin\", the LAST bastion of traditional middle-wage lifestyle, the software engineer, is also done. My tiny startup was planning to hire 12 new devs this year to scale up. Our CEO got to test Devin over the weekend. This morning we got an email that hiring is frozen, and they are now on the Devin waitlist. 12 devs will no longer have a job opening because of AI.Folks, this is not alarmist: AI needs to be banned 100%, completely, RIGHT FUCKING NOW until RIGOROUS social safety nets and regulations are in place. Period. This should be a 9-11 type moment for everyone.","everything's unregulated at the beginning until the general population decides the morality of it and then applies policy"],"points":15},{"text":["Apple Is in Talks to Let Google’s Gemini Power iPhone Generative AI Features","If this is true, I'm kind of surprised that Apple is just going to completely sit out of the AI game.","Siri would finally be usable","Probably good for Apple as Siri is more useless than Cortana. Not so sure about this being good for privacy though.","They’ll cough up another 20-30B a year to Apple like they do to be safaris default search engine","It is worth remembering that, if Apple makes the definitive leap into generative AI, Google would be one of its main rivals in the market. Perhaps it is for this reason that it is negotiating with it to integrate Gemini functions into its iPhone phones natively, without a doubt a surprise. A surprise that also makes it clear that the firm with the bitten apple is suffering delays that, presumably, will prevent it from launching iOS 18 equipped only with its own functions.Google is not the only option, but it is the most plausible. Since Apple would not have enough AI resources to confront Google, it is studying the option of signing a licensing agreement with it to solve the problem. At least, until I manage to develop it. However, it is not the only option being considered. Mark Gurman has also said that Tim Cook has maintained contact with OpenAI, the company that created ChatGPT, DALL-E and Sora whose technology is integrated into Microsoft Copilot.We will see what happens, although it is undoubtedly an interesting movement. Do we want more AI integrated inside our iPhones?","No surprise given how terrible Siri has been since day one.","Ugh! Apple’s commitment to privacy is in shambles!","Good for them. They are clearly incompetent in this area.","Nooooo wtf make your own, google has been a big miss","Doupt it is , Apple would rather eat a fat one then partner with Google"],"points":96},{"text":["Huawei's homegrown operating system, launched after the company was put on a U.S. blacklist, may soon overtake Apple's iOS in China","Not too surprising given the soft ban of apple, and growing trade war.","homegrown operating system just mean a fork of Linux or freertos","A kick in the butt is a step forward","helps that they can employ as many software engineers directly or from the thousands of companies providing technical services in China, as Apple has employees.","HarmonyOS is open source and is a good Android competitor: https://consumer.huawei.com/en/harmonyos/ (source code: https://gitee.com/openharmony)*edit what's with the downvotes? 10 in one minute without a single comment?","anything is possible when the foreign govt. continuously demonstrates a complete disregard of international trade laws & copyright agreements by encourages ips' theft, illegal cyber hacking, illegal subsidy, etc.. 🤷‍♂️did the author of the article mention any one of those topics? 🤔","I grew up with and am friends with a man from Hong Kong, their right wing completely believes the USA is meddling with other countries and do not want to support American companies. That and the Chinese products are usually better value for cutting edge tech. I can't argue with them, only point out their governments are more controlling.","It's funny that the US keeps putting pressure on China that just makes them stronger in the end.Like banning them from the ISS - so they built their own space station within a decade, and are quickly developing a space programme to rival SpaceX and NASA.Banning them from importing chips, so they develop their own RISC-V ones (and hopefully soon GPUs too).Banning them from using Android, so they develop their own mobile OS.It'd have been better to flood them with cheap American options so they never develop their own stuff - like in the EU, where the US companies have effective monopolies in most areas.","North Korea’s homegrown operating system also has the top market share in its own country.It is the best operating system allowed in North Korea.","Who gives a shit about what is popular in this dictatorship whose entire technological capacity was gotten through either IP theft or or coercive business practice from short sighted foreign companies doing business there.","No way, I was just in a huawei store in china. They don’t even tell you if the phone is 4G or 5G, cause huawei cannot source anymore 5G chips. They claim it is some sort of satellite relay system. They are using fraud to sell their phones at this point.","Harmony OS has 16% of China's market share. That's very very significant. The fact that 16% of China's mobile users are android free means this may very well be extended into other Asian countries.As everyone in Asia knows, internet is mostly following the Chinese model here and not the US model. On top of that TenCent and Alibaba are willing to invest in countries where US companies rarely do.This is very very interesting.","Good on them. Fuck Apple, and Fuck the US Government for their greedy methods of ignoring international trade laws & copyright agreements when it hurts their fat cat wallets.","I mean, it makes a lot of sense. Is there a worse goddamn OS than Apple's?","Januar 2024?????????????"],"points":621},{"text":["A third of Bumble's Texas workforce moved after state passed restrictive abortion ban","I can only imagine the blowback that republicans are gonna experience in the polls over abortion. There's a combined 13% divergence between men and women in abortion polling on both approval and disapproval.","Makes sense. Doesn’t make sense to force women to give birth.","Why was bumble in Texas to start with ?","Allowing employees to relocate out of state and work remotely is all well and good (and is the polar opposite of what every major company is currently doing), but Bumble should seriously consider relocating their head office out of the state entirely.You can't really push this façade of empowering women in the online dating space when your continued presence in Austin is actively supporting a right wing conservative state that goes entirely against your company's and brand's core values.","People always forget that conservatives only want small government for the rich and corporations. For people’s personal lives, government cannot be big enough. Texas is simply following this belief out loud now that they have full confidence that liberals will stay home and pout about it rather than show up and vote them out.And yes there are enough liberals in the state to take a few more House seats, Senate seats and Presidential. At the local level, pretty sure also plenty of opportunities if 50% of liberals didn’t sit out the vote like they always do.","Pornhub going dark probably cost them the rest","“We were looking at the lens and what we are putting forth in the brief was talking about the increased cost to us to attract and retain talent in Texas…”Leave the state. Stop giving them your tax dollars.","This will hurt the republicans no doubt just because you say oh we will give you 16 weeks it’s not going to make women vote republican. Their body their soul. The republicans screwed themselves.","O no! So anyways….","Leaving 1/6 married to conservative men.","What part of state-condoned rape do they not like? Gotta reward those rapists for a job well done, right Texas? I have it on good authority that Matt Gaetz, official child rapist of the Republican Party, is making plans to move there right now, so that when he's trawling high schools for underage pussy like he tends to do, he can knock up a few children and the prosecutors won't bother him because they're too busy making sure his victims suffer even more. That's the Republican way! Hurt children, protect rapists.","Yeah, what the fuck?!?!","Don't know why. Nobody wants to have sex with them anyhow","Texas is a man's state in any case, they don't really need any females.","Imagine dating a bumble worker","This isn't a cause and effect thing that the title leads you to believe. Bumble also laid off more than 1/3 of its work force.https://www.cnbc.com/2024/02/27/bumble-layoffs-350-employees-or-about-37percent-of-workforce.htmlDid some bumble employees leave Texas BECAUSE of abortion related laws? Maybe. Did some Bumble employees leave BECAUSE their source of income disappeared? More likely.","Bumble going out of business. Mismanagement hiding behind the mean ole GOP. Dating platforms are like tow trucks, only needed when you are broken.","Bumble is an app that literally is built to exploit desperate lonely men, it’s not to help people find a SO. So fuck bumble","garden equipment moves to keep digging","Aren’t more people moving to Texas than California since last year?","[removed]","They really need to get those abortions. It's bumble for god's sake!"],"points":1000},{"text":["March Madness predictions 2024: Using AI to pick NCAA Tournament bracket upsets, Final Four"],"points":0},{"text":["How a Silicon Valley trend is impacting an $8B Canadian farm industry","TLDR: Farm equipment doesn’t like to connect to equipment from different brands - android vs iOS on steroids. Laws are being passed in the us to fix this, Canada not so much. It sucks.","Farm equipment has become much more digitized, prompting some companies to use digital locks. They say this protects their copyrighted technology and prevents hacking.Tools as a service and vendor lock-in: Hostage situations that need to stop.","Watching the convergence of Silicon Valley innovation with traditional Canadian agriculture is not just witnessing an industry shift, but a revolution in motion. As technology seamlessly integrates into the $8 billion Canadian farm industry, it's not just about boosting efficiency; it's about redefining what's possible. From precision farming to AI-driven crop management, this trend isn't just impacting yields; it's cultivating a future where sustainability meets cutting-edge technology. Exciting times ahead for both Silicon Valley and Canadian farmers alike!"],"points":64},{"text":["Prosecutors urge 40-50 years for crypto fraudster Bankman-Fried","From Forbes’ 30 under 30 to Rikers’ 40 over 40.","Remember kids, if you're going to commit fraud, don't target wealthy people.","to this day i don’t know why that man didn’t hop the first plane to qatar. he wasn’t even in the US, wtf was he thinking","... \"A sentence of 40 to 50 years' imprisonment... is necessary to reflect the seriousness of the defendant's crimes,\" the prosecution's sentencing memorandum said..._. . and why not? .. Bankman-Fried is as criminal and bad as Bernie Madoff and Charles Kushner, both of whom went to prison .. the latter Donald Trump's son-in-law's father (daughter Ivanky's husband) . .","With the amount of years he’s supposed to get, I take it he stole from the rich too. If he only stole from the poors, he’d get 18 months playing tennis.","The lesson to be learned here, is that rich people can’t just rip off other rich people without consequences. They should stick to ripping off poor people…. Then it’s just called “business.”","Weird that people get longer sentences for theft than for murder. Not that I'm saying he shouldn't be punished, and harshly, but he stole money. And mostly from billionaires and morons.Shows you what we really value here in 'Murica.","Isn't it always funny how the ones who steal from the rich and the powerful always seem to get jail sentences.","...so are they gonna throw the bank execs in jail that crashed the world in 08 for 50 years?","… and a haircut.","Why is this the only picture I ever see of him","Imagine having all that money and not knowing a barber.","If the dude would just could cut his hair he wouldn’t be so much of a villain in the public eye. However he deserves 50 years.","All this tells us is that so long as you target the poor you're fine. That Bankman-Fried targeted other millionaires is the issue.","Seems like you get more time for stealing money than murder","He wasn't a crypto fraudster. He was a fiat currency fraudster, that also used crypto as part of his criminality.","Remember: When you scam poor people, nothing happens to you. When you scam the wealthy, then you’re screwed.","And Trump is still walking around free","Who went to prison for the housing crisis that happened years ago?Stupid this kids gonna face jail.","Dude looks like English Dennis the Menace","Mr wonderful sure knows how to pick them.","Looks AND acts like Jean Ralphio","Almost forgot about this guy. Been REAL quiet","Nice! Do Matt Damon next!","Everyone else involved needs to be getting the same and their assets seized along with any transfers to their family etc.","His parents are super connected. Are there chances he will get out much sooner? Say 5-6 years?","More like Bad-bank-Fried.","Negative ten years, if my math skills are working.","I think he will probably get 15 years, with some time served or work program etc , Good behavior and get out sooner.","For my friends justice for everyone else the law","And yet Elizabeth Holmes might be out in as little as 8 years.","And make him cut his hair too.","Got my money out in the nick of time.","He looks like a villain from despicable me","He looks like a serial killer! Just so creepy in the eyes and his demeanor 🤡🔪","Only because it was rich people. If he diddled kids but was a preacher he'd get out in a few years.Holy shit, vote in every one of your elections.","No CEOs or CFOs went to jail after the 08 crash.","Jail is good, but what I want is the content of the paper. I need to know how much and how he did what he did. Cause everything in finance is linked, and we need to follow the tail","He should get that just for his stupid haircut","He's been through worst he played league","Minimum security prison with tennis and chipotle.","He's not one of the poors. He'll get 10 days max. Must report to jail in 5 years to carry out his sentence.","Look at that expression. Evil.","You want to stop this from happening or put a dent in the chances, give him life with a chance of parole after 20 to 30.","Free my dawg!","20000 years","So he will get half with serving 90%","Lmao he gone end up at a USP . He either turn into a monster or he gone being paying .","Let him go he is a Democrat"],"points":1152},{"text":["White House urges Senate to 'move swiftly' on TikTok bill as lawmakers drag their heels","I’d rather they just pass stricter data privacy rules for US citizens across the board","What ever intel the government has that makes TikTok such a threat needs to be released Or a whole generation is gonna be unreasonably upset about this","Remember, the government can work fast when it wants toJust look how fast they moved on appointing ACB to the supreme court","Release the intel they have on TikTok and be transparent with the American People.","Amazing that Boeing just merc’ed a whistleblower in plain sight and the big bipartisan concern is TikTok 🙄","Censorship about anti Israel post on Gaza conflict","Tiktok's power to manipulate and social engineer americans is so dangerous we cannot wait even a moment to allow it to continue.No, sorry, we aren't going to stop it from manipulating and social engineering, we just need to sell it to a conservative billionaire - so the RIGHT people can be doing the propaganda. I'm glad the White House is taking this transfer of power so seriously./s","Dragging their heels? They are passing this bullshit broad brush bill at breakneck speeds. What an absolute waste of time for what will turn into a restriction of personal freedoms.","Isn't this law rather open-ended and allows the government to force the sale of any social media website?By connection doesn't this also mean any website that has a comment section?","Seems bad to ban a platform popular with youth heading into an election you’re already doing poorly with said demographic?","All I see on tictok is videos about heavy equipment, fixing trucks and chicks in their 40’s with big personalities. Should I be concerned that the Chinese have me figured out?","Didn't Facebook sell all our info to Cambridge Analytica?China can easily buy your data/see your digital footprint and I think its more or less we can't censor information coming from TikTok.This seems to be more or less related to Zionists slaughtering innocent civilians","Daddy AIPAC is calling.","If people want to hand over their data to the Chinese government, who are we to stop them? It’s not like anyone cares about all the scummy shit American social media companies do at this point.","like simular apps aren’t doing the same thing Xd","Banning Tik Tok is a joke. They just want them to sell to an American company so our government can use it influence us. Look at Facebook and Twitter. Absolute garbage. Facebooks done more harm to this country (and others Myanmar) than possible with TikTok.","More like the AIPAC bill","I'm still confused as to why this bill is specifically pointed at this one company instead of using broader language to ban certain types of platforms. Couldn't another TikTok just fill its place?","Biden is actively looking to anger voter blocks that vote Democrat ahead of the election. It's like they don't want to be in charge 😂","What is tiktok going to do? Force women to carry babies to term against their will?Your own gov is a greater danger","This is fucking ridiculous","According to exit polls, 18-29-year-old voters account for 17% of total voters in 2020 presidential election. Younger generations, if anything, are more liberal than ever. If banning tiktoks led to youth support collapsing for Biden, I'm gonna laugh so hard first and then weep for whatever will be unleashed into the world when Trump is inaugurated.","I mean, nothing was done when FB and Cambridge Analytica interfered in the 2016 US election and many other elections around the world. This effort to infringe the first amendment and block TikTok is definitely to hide the genocide of Palestinian children and kill the competition to US big tech.","Meanwhile this is being pushed by lobbyists paid for by facebook🖕🏻","So if we can pass laws and bills this fast, create weapons really fast, donate money to other countries really fast, and create vaccines really fast.We can make the world and the USA an actual better place to live, really fast. God save the people of the USA lel","Every time the government works quickly, Americans get fucked.","Kind of find it a bit funny that White House wants to force the sell/ban of TikTok and yet they made a account on there like really?","They still haven’t voted on the child credit bill","Let’s just say if tik Tok was owned by those who shall not be named they wouldn’t be having this conversation.","Biden has managed to alienate multiple demographics he needs to win. All while claiming democracy is at stake. It’s bizarre to watch.","Yes move quick to ban tiktok but not to make the lives of Americans better.","One aspect of this bill that I'm not seeing enough talk about is that it's not actually targeted just at TikTok (which I love dearly, take that for what you will). They're granting themselves blanketed power to divest any company which is deemed under the influence of a foreign adversary (China, Russia, Iran, North Korea). If more than 20 percent of the leadership of a domestic company is Chinese it qualifies for this. Very interesting that it was almost unanimous in Congress. Reminds me of another bill that passed almost unanimously.... Patriot act.","You want to ban the one app that helped you get elected?","In my opinion this is not about privacy or China. It's being pushed by AIPEC. The ADL president said Tik Tok was the greatest threat to the future of Israel, that they had to rearrange all their strategies off left/right politics and focus on generational divide.Two main reasons about Tik Tok, 1. 50% of it is Gen Z, Israel/Palestine is top trending issue for the whole conflict and it's not even close, 90% content being pro Palestine.The IDF soldiers use Tik Tok to livestream their war crimes and their callous, mocking attitude. They don't want the US to see it.This is going to get fast tracked through, I am curious what the reaction will be, gen z knows this is what's going on and they are flipping out about it, I'll be curious to see what alternatives or solutions to come out of it. But it is a sad day where for the first time Chinese style fascism and censorship is being applied to our first amendment, and we are being blocked from the number one social media site in the world for the young generations, to stop ours from seeing war crimes with weapons that we are paying for with our taxes.It also won't work, I'm not even on TikTok and Iv seen more footage of the genocide and mutilated babies in the first 40 days then I saw in 35 years combined, on twitter. So we aren't at full censorship yet, but I do think Twitter might be the only website left where you could watch these videos unrestricted, which is terrifying. At least it's the only viral one that can get millions of views.","Israel doesn’t want its crimes against humanity and its genocide getting out….shhh…..too late","Serious question: is there any reason 1 senator couldn’t filibuster this?","Fucking ridiculous. Thanks AIPAC...ass holes","The bill should not pass due to giving the government power to ban ANY app they deem “risky”. The bill makes a broad statement on what qualifies as “risky”.Should be an all outcry from the public. The government is reaching and playing the public as fools by stating Tiktok as the only app that will be affected.Dems should shut it down in the senate.","They’re clearly going after TikTok to usurp power, not protect our privacy","I never thought I would be grateful for the day Senate incompetence and general lethargy prevailed, but here we are.","They move lightening fast on this ‘National security issue’ but when it comes to bettering the lives of Americans they refuse to act.Apparently TikTok is a bigger threat than the southern border…","Yes, this is definitely the biggest problem facing us....","Yes piss off young people even more during an election year. The Biden administration not to bright are they?","Censorship is alive and well in the US","White house is more concerned with tiktok than the 4 day workweek bill? Clown world","Hmmm….what else is in this bill that they need it passed so bad🤔","This is about money and data. That’s about it.","Honestly since the Right is about to buy it, I say just let China keep it.","I mean we could just have an online privacy bill that rivals other countries.That would help. They do it to us because we’re so gosh darn monetizable.","🚩 pressure to rush🔎 what does it all mean","All these 15 year old national security warriors and their clapbacks aside, this is a prudent move. It gives bytedance the opportunity to sell and recover its investment…but the risks of allowing an actor like the CCP a platform like TikTok - for data collection, for influence - aren’t reasonable.I’m not a cybersecurity engineer, but I am a software engineer with a reasonable familiarity of our current geopolitical reality, and the bill generally is coherent to me.Yes, We should have a more broad-ranging data/privacy protection bill. yes, We should have more fully featured internet control and information control bills. But this is in the right direction. China is certainly the primary threat actor in this space and this is certainly their primary tool of reach in America.","Bullish META","Come on guys, this is obviously trade protectionist policy dressed up as national security policy. I don’t particularly care if China has my email address and fuck big tech, maybe some competition will convince them to design something that isn’t just a new way to be a middle man.","Yeah, gotta hurry up and help dirtballs steal profitable businesses!","To vote down this nonsense.","Tiktok is going to get saved in its current form because the current administration is onboard with forcing the sale and therefore Republicans are obligated to go in the opposite direction.","Ah I remember when Trump was president and he said a comment about banning TikTok and everyone thought it was ridiculous",""],"points":3801},{"text":["Boeing 737 Max engine issue will take up to a year to fix, embattled company reveals.","This will be put on the backs of suppliers (again) to cut cost to Boeing. They call it “Partnering for Success”.","If only there were a high level executive we could hold accountable...","Okay, and if you had juuuuuust done it right the first time it'd have cost less and your reputation would still be intact, Boeing... unlike your planes.","Up to a year actually translates to something like 2-5 years.Possibly having to design a completely new plane, but calling it a 737 Max Mk. 2 or some shit.The problems with the current 737 Max are not insignificant.","Man sometimes it seems like having a bunch of accountants run an aerospace engineering firm isn't a great idea?","I don't trust a single word coming from this corrupt company","If these were military aircrafts, they would fix it under a month and bill the government $1b.","The MAX is Boeing's Edsel/Pinto. At least Ford had the business sense to stop making them.","I’m not really sure what they mean by ‘engine issue’, but the MAX has the same engines as the Airbus A321, the CFM LEAP turbofan engine.","This is what happens with too big to fail. They know they cannot be allowed to go out of business due to military contracts and the like.","Can someone make a list of what’s wrong with these planes for some dude who doesn’t know much. I keep reading that basically the whole ass plane front to back is garbage with the occasional “actually” comments. Only thing I kinda understand so far is the whole MCAS issue or whatever.","If it’s not Boeing, I’m not going…to crash shortly after takeoff","Sounds like motive for the FAA to ground them","Ground. The. Planes.","Just a reminder, most travel sites now allow you to choose what type of airliner you fly on","Honestly the 737 max was just an utter shitshow from its beginning.I’ve just watched a really good documentary on Netflix about Boeing - it’s called Downfall : the case against Boeing. If you can watch it then you should.","embattled...more like 'architect of their own misfortune'.","So this means in reality 2-4years to fix and how many lost lives because of neglect. I am so sick of corporations having more rights than the citizens of this nation.","i thought the engines were the only things okay with these planes","But think of all the money Boeing saved by lying about and doing stock buy backs.","What about their doors and their landing gear!?","Guess the seeds of past actions bear the ripe fruits of consequence now. Have fun reaping your harvest.","Ah yes, it's gonna take a year for them to root out all the whistleblowers and have them die by apparent suicide in similar manners. Then, when all the congresspeople have accepted their bribes to forget this whole inquiry into their safety compliance ever happened and by then our broken minded society will be used to triple the amount of planes falling out of the sky and just let them get away with it. Down with those fat fucking pigs.","The cowlings are made of carbon fibre to lower weight but they don't tolerate the thermal range needed. Switching them to metal - the answer - shifts the center of gravity and makes the plane even more aerodynamically unstable. The only real solution is to do it right and design the airplane.","Can they just scrap it and just move on to a new concept with a new name? No one wants to sit in a Max anything anymore.","I was due to board one of these 10 mins before they were grounded.","Just admit it's a failure and go back to producing what works","Bombardier: But theres no way theyll get a government bailout or subsidies because of this, right? Right?","I appreciate all the brave souls continuing to keep us informed on Boeing right now. Especially with the fact that they apparently have a hit squad I guess. What a strange time to be alive.","Airbus for life.","When I worked on the 787 problems like this were common. I'm not surprised at what happened with the Max series. It's the reason I left.","FFS. I’m only flying Airbus and Embraer I guess.","Good thing they fixed everything during the last recall","Takes a year to fix engine issues but only takes them a few days to snuff out a whistleblower.","Yet another reason why mergers in industries like this are bad for everyone.","Its crazy how every single time businessmen take over the quality of a product tends to drop","Hmm… maybe if a whistleblower could live long enough we could get to the root causes of the issues","What is Boeing doing right exactly? Because looking at their stock price, they aren't even making their shareholders happy","I won’t fly on a max. Period. Not interested in becoming the reason the leadership has press issues.","my surprised face. look at it","I stopped flying boeing since the first crash. Since there there has been one more and a ton of new issues. Honestly this is painful to watch.Even if MAX would have good QC airbus 321neo is better in almost every way.","That's a long time for all Boeing planes to be grounded and rigorously checked. Because that's what's going to happen, right? Right?","The entire world needs to learn to slow the fuck down. What happened to measure twice cut once?","Dei and outsourcing really worked for them",""],"points":4733},{"text":["Government approves millions for hydrogen-electric rail technology of the 'future': 'Only very few rail lines in the US are electrified'.","The title, thankfully, is overselling it. This is definitely still a pilot. 10 trains ordered with a possibility of 29 in total.Of all the things to electrify, trains are pretty straight forward. Hydrogen should be an ancillary option at most, and is not \"the train of the future\".","Just electrify the lines for christ's sake. Put in the infrastructure like most 1st world, even 3rd world countries have. It's a worthwhile investment.","In the rest of the world trains have been electrified for the past 100 years. They do it over longer distances than anything we have in North America and through terrain that's more challenging as well.It's mind boggling why we can't just put in standard, off the shelf stuff that's proven to work and will do the job cheaper and better.","Hydrogen on trains is the best usage of the fuel that we could have- if our rail lines were as safe as they're supposed to be. Most of our train details have been because of our trains being out of date, not properly manned, or not designed to modern standards.We need to press on railroad barons to make their trains safer, lest we wind up with traveling bombs.","There really isn't a better option at this point. America's rails should be electrified, but we lost all that knowledge and the factories that built it were dismantled forty years ago. California is rebuilding this capacity with the state HSR program, but that is still ten years away at least. Meanwhile, the freight railroads are adopting H2 cells and it appears it will supplement diesel in the same way diesel once supplemented steam, before completely eliminating diesel. California's CARB is subsidizing this transition, both in the private industry and public transit work, the latter of which the article talks about.Anyway, what it means for the rest of the US: by 2035, H2 cells will be standardized commodities and mass produced. All major railroads will be using them to some extent. Many trucks and construction vehicles will also be H2 powered. We might even have H2 powered boats, if CARB's other industrial development programs bear fruit. Which means: 15 years from now, diesel techs will be under the same pressure steam engineers were in the 1950s. Most of those engineers simply retired or took on larger jobs at stationary power plants, which is what diesel manufacturing will be increasingly oriented towards.","US Government*","It sucks having to wait at a station while they switch between diesel and electric locomotives. Adds like 30-45m to the trip. My son and I went to Philly and outside NYC it switches to electric for pollution reasons I suspect.","They could be used on the SF-Gilroy Caltrain line between SF and SJ, which is currently being electrified. South of there, they have proposed a battery-powered train to avoid electrifying the Southern Pacific-owned line. With hydrogen, they could go down to Salinas, which is fast becoming a suburb of greater San Jose.","So whose pockets will this money line instead of going to the actual cause?","Americans will try every solution except the right one","I'm so jaded I'm like \"millions...so like two houses worth\"","What is harder than deseal, thats right, Hydrogen. They don't give a shit.","Hydrogen is nothing more than selling natural gas as \"green\"","Hydrogen uses more fuel to make it, its incredibly inefficient. either with electrolysis, or steam methane reforming,","If they're not electrified what are they? Steam locomotives?","oxyhydrogen steam trains with water tanker car and shipping container sized batteries, solar panels on the cars, off the shelf oxyhydrogen boiler burner from Asia and no pollution and cheap as borscht to run.","meanwhile in china","Just here on Long Island, it will cost 18 million a mile just to electrify the parts of the LIRR that currently use diesel. 127 million sounds pretty cheap . Compaired to electrifying track."],"points":178},{"text":["NASA missions delayed by supercomputing shortcomings","The new moon missions are planned to take larger payloads with less fuel that the Apollo missions by using an extremely complicated, erratic path to the moon. Not a surprise that finalizing the flight plans takes a fuckton of computing power.","Back in the 80s, I worked at NASA in data communications for the STS--that's the Space Shuttle to you. In those days, we still relied on 1950s-era Telex lines for tertiary backup communications. Then, as now, NASA has never had enough funding. There's a reason why the first Beowulf supercomputer was built at Goddard Space Flight Center from generic i486 boxes---it's all they could afford.","They clearly need to launch a cryptocurrency that can be mined with compute power, they’d have enough compute power to explore the universe!","I'm seriously perplexed, are they trying to milk 30 significant figures out of every molecule in the rocket system and the surrounding 30 kilometers?","Because the resources for more advanced technologies that would facilitate missions in a consistent and adequate way for any real progress into space travel are being utilized for circus acts and manipulative political propaganda.The thing that really upsets us here is the vast, unaccounted for, waste of company resources, which most of this system is.","And a series of failed rocket launches."],"points":122},{"text":["Musk promotes X over ‘legacy media’ amid Trump ‘bloodbath’ comments","Is Twitter now generating original news content?","Anyone’s seen The Newsroom?Remember how it went with citizens journalism?","Elon makes a good case why billionaires should not exist, and why he should be in prison","WTF - Everything is out of context on X - one big fucking dumpster of 💩","Trump and Elon must be about the only real people left on Twitter about now?","LOL...X is legacy. Or I should say their legacy is now shit.","I feel neutral toward Elon, I hate Trump. I do think MSM screwed up the bloodbath story by purposely cutting the tariff comments. Just watch the tape of Trump's speech.","Fuck off, Elon.","Hahaha. Twitter is a cesspool of propaganda and bots.The internet is unregulated. No one should get news there.","Yeah, no thanks. I want nothing to do with the echo chamber Twitter has become and I definitely wouldn’t rely on it for news of any kind","Oh neat. Reddit wants to get in on the out of context on purpose train... Who's surprised?","Lol Twitter imo, reading the news over 20YRs, that thing became Elon's agenda after he bought it.The antigovernment (outside USA) Trending Topics and Tweets just went crazy.He changed things \"to reduce spam\" and my guess it kinda became \"pay to attack\".Sad, but true.","Missing context: Trump was referring to the auto industry and ‘bloodbath’ is a real term for economic disaster.https://www.cnn.com/2024/03/16/politics/trump-bloodbath-auto-industry-election/index.htmlhttps://www.merriam-webster.com/dictionary/bloodbath","I was on-board with Musk’s initial plan for Twitter. But it’s so shit, everything about it sucks. I despise the blue-check thing, cause you have every other moron paying for it, and now nothing with credibility is on the top search","The legacy media once again prove they are buffoonish liars of the highest order. They continue to erase any semblance or legitimacy they had left.","so that's the new sound bite? \"legacy media\"?alrighty then.","[deleted]","[removed]","Wait until Trump comes up with a popular idea like, \"I will ban the sale of all EVs!\" since most of his base cannot afford them."],"points":181},{"text":["Nvidia in talks to buy Israeli co Run:ai"],"points":0},{"text":["AirTag anti-stalking class-action lawsuit allowed to continue","ugh please don't ban these, I need them to help me find my car keys all the time.","So what about Tiles trackers? Why has this never happened to them?","Can victims/families of gun violence sue gun and ammo makers?","This is stupid. One of the greatest anti-theft/anti-loss tools that normal people have access to to track their cars, luggage’s for air travel ect, being threatened because of some outlier potential case where it could be used to “stalk” people. I’m not even a fan of Apple, but this is one of the most useful thing they’ve produced","How do we go opt out of this silly class action if we think it’s stupid?","At most some lawyers will make some money.  Or if they force Apple to stop selling them stalkers will just got back to all the tracking devices that always existed that have zero anti stalking features built in.","Lawyers are out of control in this country.","Also according to this article from July 2023, Android does get notified of these being nearby.https://arstechnica.com/gadgets/2023/07/android-phones-can-now-tell-you-if-theres-an-airtag-following-you/","Silly lawsuit.","Apple isn’t responsible for the actions of individuals.","What a shameful cash grab this lawsuit is.","So, it pretty much invalidates the device in cases of theft.","I had five of them. They all failed batteries went flat. Bah. I don’t understand bc I’ve had batteries in comps last five years or more? Just shit, to buy that many and none of them last a year, more like six months, can be used or found bc batteries don’t work.","Wow. A little surprised by all the comments here. These devices do make it significantly easier for stalkers and domestic abusers to harass and track their victims. And their safety features are absolutely not adequate. This literally just happened to my mom with her abusive husband. It was impossible for us to find out who the owner was, even though we knew. And because she had an android, there was no way to know it was in her car. There are precautions Apple could take to make them safer. And a reminder that attacks on plaintiffs has become a more common tactic in the last 20 years that benefits the company’s being sued. The claim of “frivolous lawsuits” benefits the party being sued significantly. This suit does not seem frivolous at all to me. These are not insignificant edge cases. Stalking and DV are still very common realities for many people.","Well, you always have to expect people to use these devices nefariously. Cellphone cameras were immediately banned from courtrooms when they came to market back in the day."],"points":1102},{"text":["Technological Breakthroughs Fuel Bright Future for Tidal Power"],"points":0},{"text":["How cryptocurrency executives helped decide the California Senate primary","How gullible are people? Everyone wants a get rich quick scheme and gambling is a real addiction for so many people.Until you go broke.The mint is the only body who can create coinage in the USA according to the constitution but what is that but just toilet paper to American elites.","I'm sad turnout was so low. I told everyone I could to go out and vote for Porter or Lee.","California voters decided the senate primary, by a wide margin. She lost, it wasn’t even close. Stop minimizing the obvious will of the voters with bullshit like this.","Article TL;DR: Some pro-crypto billionaire spent 10 million for political ads against a crypto-skeptic wannabe Senator.I love how basically every anti-crypto article describes a practice that has been going on for decades with fiat currencies.Maybe if corporations start lobbying Congress with BTC we'll finally start seeing some honesty in the political world /s","Actually, us voters decided. I knew I wasn’t voting for Porter long before she even announced. Not a fan of her, and the whining post-loss is cementing that. I supported Lee up until I realized she wasn’t going to reach 1st or 2nd place, and voted for Schiff.","Porter later blamed her loss on “an onslaught of billionaires spending millions to rig this election,”I don't think saying that the elections were rigged is going to get people to listen. They'll only think you're a conspiracy theorist."],"points":65},{"text":["Speaking without vocal cords, thanks to a new AI-assisted wearable device","TTS.\"twitch to speech\"​neat.​...is able to detect movement in a person’s larynx muscles and translate those signals into audible speech with the assistance of machine-learning technology — with nearly 95% accuracy.","Does the patch send a signal to a device that translates it into audible speech?","Mission Impossible is becoming possible!"],"points":1},{"text":["A ChatGPT for Music Is Here. Inside Suno, the Start-up Changing Everything","Music making has already been democratised, especially with the internet and social media, you just needed practice and talent. There are even free DAWs and tutorials to get you started.This is just an easy and quick way to hawk or spam ‘content’. It’s not democratising anything. It’s a cheat code.","Suno appears to be cracking the code to AI music, and its founders’ ambitions are nearly limitless — they imagine a world of wildly democratized music making.Someone needs to \"democratize\" the creation of AI-based tools that can \"democratize\" other industries.","I'll stick to my favorite 60s/70s bands who wrote their own songs, played their own instruments, and sang the lyrics they wrote themselves.","Great, another spam generator in another medium to devalue music as much as possible for basically no good reason.Who does this help, exactly? People who hate artistic expression?Ladies and gents, we've reached peak dystopia.Enjoy the fallout.","“We’re trying to get a billion people much more engaged with music than they are now. We’re not trying to replace artists.” Lol… i love how people call it “ to democratize” . Not a music maker but that has zero with democracy to do. You been always free to do whatever you want you just been to r-worded and lazy. I bet its all licensed data it was trained on :)","Yeah... if AI could stop \"changing everything\" all the time, that'd be great...","I hate this so much.Give me a real musician making real music with real instruments and real voices over this crap.","That's insane.","Just when you thought music couldn't get any worse,,,","“Changing everything,” f- off 🙄Art in all forms is meaningless without intent, visual or auditory. “AI” will never have a fan base, never have a personality, never enable people to connect and bond over common interests. There will be no concerts for “AI”, no unique merchandise or memorabilia to support one’s favorite artist…The hype bubble is beyond frustrating, especially when everyone knows is going to burst. They’re going to jam as much of this crap down our throats as they can before the inevitable happens.","Music is already totally democratized to the lowest common denominator.Most people who make music nowadays can't sing or play an instrument. DAWs let you write melodies without actually playing the keyboard. It's all software crap with no actual musicianship.It's why almost all modern music is super fucking lame.","Honestly I think our downfall is when true agi gets tired of our bullshit requests.","What happens to music videos and live bands if it’s AI generated.","I've had a program that generates music randomly on my PC for... 12 years?","I think it will have its uses, like in a DnD session where you want to have custom ambient music. Or music for indi game developers. To me, it will never replace flesh musicians.","Bullsht. A model was trained on music they licensed, worse stole, from real musicians. Their code regurgitated it."],"points":143},{"text":["Ahead of IPO, Reddit blends advertising into user posts","Enable comments on ads, you cowards","Been for a while now? My \"favorites\" are the ones that start with like [MEGATHREAD] or [PSA] or similar in the title. Like for a second it does work. Then I read the title and I'm like \"which fucking sub is this?\"","The worst part about it is it’s just straight-up lying, you can’t comment on them. Don’t let them use [MEGATHREAD] in their title if it is not, in fact, a megathread!And the ads mixed into the comments are just as useless and annoying. And they don’t work, because they are so off-topic I write them off like bots.","I don’t have an issue when scrolling thru to see an ad but the top comment placement is disjointing and odd. When a user clicks on a post there is a desire to engage on that topic not see something irrelevant.","Old.reddit + ad blocker + third party app. I've never had to deal with ads.","I thought about buying some stock when I was invited last month. I decided against it because I don't see the stock price every really going up in a meaningful way. Here's why:Reddit is old. It's not a hot thing and nobody is excited about it.Reddit has never turned a profit. Some companies don't make a profit because they're reinvesting in the company for future growth. That being said.....Where is growth for Reddit going to come from? Do you feel like Reddit's user base is going to skyrocket at some point? How many new users are actual human beings vs bots? Do you see any markets overseas where Reddit is going to take off? What new product could they roll out at this point?Management of Reddit (the top level) regularly makes changes that really pisses off the product, whoops I mean \"users\". Ask Digg how that worked out for them.The whole thing is a pass for me. I've seen a lot more ads recently and now they're doing stuff like this. They're trying to pump up Reddit so they can launch the IPO and the current owners can cash out. That's the only reason for the IPO. It's not going to be pretty for the site itself.","[Megathread] how does Jesus love so many people?I hate these","Enshittification ruins everything eventually.","This has been a thing for years now...","Reddit has never been worse, barely usable, images don't work, feed is useless and whole site seems dead. Destination? Penny Stock.","I just keep reporting them for sexually explicit content 🫡","Old reddit, with an adblocker, and a third-party mobile client. No ads.","I can just see the headlines now.REDDIT'S UNRULY USER BASE BLAMED FOR SPECTACULAR FAILURE OF THEIR IPO","Veridian Dynamics - we, like people, like people.","The downvotes, they do nothing!","you can pretty clearly tell which ads also have paid for bot up votes too... no real human fucking up votes ads. fuck off with this stupid shit reddit.","By the way, have you heard about Progressive - the #1 combined personal and commercial auto insurance company?","is it just me or has the app been a lot more glitchy lately? like comments are being duplicated and also disappearing.","just even more reason to not use the app","For the shitty ones atop the comments, report them as offensive because they are.Downvote every single one that looks like a post.Please do note that the former CEO Ellen Pao on cnbc said very clearly in an interview that a path to profitability includes selling user data and getting rid of content advertisers don’t like.Edit-call out correct ceo","As soon as Reddit goes public, this place will slowly but surely go to shit. Nothing good ever happens when companies go public.","/u/spez Your shithole of a website is a cesspit of spam, hate speech, and a deluge of misleading and unethical advertisement, what will you do about it?","This is why I think that Reddit will fail on Wall Street. Reddit users aren’t as moronic (on average) as users of other social media platforms. Trickery will not go over well with Reddit users.","It’s already been a thing for years.Look at the movies and entertainment sub. They are owned by movie studio shills.Almost every post on front page of movies is same super users and any comments who mention it get banned.","This IPO will ruin Reddit. Period.","Don't they know that we're the least monetizeable user base on the net? I feel like that needs to be repeated more...","Ublock origin takes care of it","Not seeing any ads on old reddit with ad and script blockers.","It's never been the same since they fucked over 3rd party clients. I've felt it's descent already in real time!Reddit without it's perfect clients is simply not reddit.","The Jesus get us advertising post get me worked up, I don’t care about some zombie/motivational speaker, claimed divinity","Every time I read an ad on Reddit I make sure to buy that product. Ads are valuable and cannot be ignored.","Took away the well accepted concept of gold, why? Instead, attempting now sneaky shit with a non-captive and hypersensitive to bullshit user base. Ask digg how well such disconnected hubris went.","3/5 ads looks like a scamCan't comment on the adsThe ads are annoying","adblocker still blocking ads","As bad and shitty as reddit has become, it's only going to go downhill from here.","“a 28 percent increase in click-through rates”I’ve accidentally clicked these ads many times apparently by fat fingering, but then immediately close it. Is that what you’re counting as a successful interaction? I’m not joining the army or whatever else you’re hocking.","When comments are enabled on free-form ads, there's an increase in community engagement, Reddit claimed, without indicating whether that increase was positive or not.The journalist, Brandon Vigliarolo, has a gift for understated snark.",""],"points":14406},{"text":["Landline Users Remain Proudly ‘Old-Fashioned’ in the Digital Age","I still have and use my landline at home. We live in a very rural area. Our cellular service is spotty at best. I know if I am getting a call on the landlines it is important.","Can we differentiate actual landline users vs VOIP users (which a lot of \"landline\" phones actually connect to a cable modem these days)","My parents had to give up their landline. Last time they upgraded it and got a new number, the person who originally had that number apparently had a LOT of debt so they were constantly harassed by collectors.And of course landlines don’t make it easy to block calls.","I own a vintage frog shaped telephone that ribbits instead of rings. When I buy a house I'm getting a landline just so I can call people on my frog phone.","I had a landlane for about 5 days when I moved into my current house 6 years ago. It was getting 5-10 spam calls a day so I unhooked it, never hooked it back up, and then didn’t renew it when I changed ISPs.However, I don’t like not having a backup mode of communication in case my internet goes out. I remember back during Hurricane Sandy that cell and internet was down for almost a week but landlines continued to function. I don’t want to repeat that.But given that most phone service is now VoIP isn’t it still just a single point of failure at this point? Is there any other (economical) backup option (starlink is way too expensive).","It's gotta be hard to give up a phone number you've had for 30 years.","Someone has to respond to polls saying they will vote for Donald Trump","I had a landline for a while but the constant robo calls just made it an unbearable nuisance","\"Alright dear, that was always allowed.\"","We had phone service on our landline when everything crashed recently.","My mom finally got rid of her landline after 60 years. Still use it for the safe way discount tho","I have a landline for an alarm system and my internet.If I didn't have the landline, when my cell sim card died for no good reason I would have had to spend a day or so going to a physical Verizon location instead of talking with help on the phone. TLDR: Still useful.","Good to hear Robert Caro and Vivian Gornick represented in the Times.","I just ditched my VOIP landline because I was rarely using it, and paying $6-7/month in FCC fees. That's almost as much as a streaming service.","Where I live, the only line is a land line.","Not sure when my land line became VOIP, I was never properly informed. Found out the hard way when phone would not work when internet (electricity) went out. Still mad about it.","This story is paid for by big landline in an attempt to make POTS fashionable.","I had a landline and VoIP, but it went away when I moved and ditched Comcast.","I had a landline and VoIP, but it went away when I moved and ditched Comcast.","Literally the only calls my parents get on their land line is marketing spam. The answering machine fills every day with it too. They refuse to get rid of it even though they have cell phones. I love my parents but man, fucking boomers.","I still use a landline (well, via the cable modem) and still even use a answering machine. Usually the only calls we get on it are announcements from my kids school, so it's nice to hear it played through the answering machine speakers since I always screen the calls anyway.Having said that though, I feel like it's time to get rid of it.","Cell phones get better and better at everything except being a phone. I actually know someone who has a new iPhone but uses an older flip phone for calls.","Who can afford to pay for a duplicate service to cell in this day of innumerable and outrageous expenses?","The people that still give a shit about owning a \"landline\" are technologically-inept enough to not know that they've all been replaced with VOIP at this point.","Old is ALWAYSE bad we must advance FORWARD not BACKWARDS"],"points":168},{"text":["The Wall Street Journal: Meet the Tech Company That Had a Better Year Than Nvidia","Super Micro Computer. SMCI ticker. If you didn't know already.","So where do we think this one goes from here?","WSJ is breitbart for right wingers just barely smart enough to not use the N word publicly. They clutch their pearls about Trumps antics while voting for him and his shitty team.","Nvidia is a chip making factory to make chippery chips to play games on it and stuff"],"points":408},{"text":["Used EV prices fall much faster than gas cars, according to iSeeCars","Part of the reason for this is that Tesla dropped prices dramatically last year, so all used EVs had to compete with that. I saw a lot of EVs in used car dealerships that couldn’t sell because suddenly new Teslas were cheaper than used ones. The dealerships or original owners are now in a tough spot, where the dealership might have to sell it at a loss, or the original owner might have to sell it for less than they owe on their loan.This was also exacerbated by the prices being too high in 2021-2022. Owners overpaid for the cars and so when Tesla had large prices cuts in 2023 that meant the owners couldn’t sell their cars to break even on their loans. This situation affected ICE owners as well but ICE manufacturers weren’t cutting prices as far. Also because Tesla has 55% market share for EVs in the U.S., when they cut prices that far it hits the entire EV sector in the U.S.These price drops are good for buyers, good for consumers, good for EV adoption rates, and only bad for people trying to sell their overpriced cars after just a couple of years.","Early adopters pay more initially in pretty much any product as technology advances quickly. This shouldn't be a surprise.","This has always been the case since the 2nd gen Nissan Leaf. EV technology advances rapidly rendering past generations less competitive for the used cost. All rapidly maturing technology has a similar problem.","Yes. Because you can get a $7500 rebate on a car when you buy it new. Most cannot get any rebate at all on a used one.So the moment you drive it off the lot its value drops $7500 plus whatever amount other cars lose due to \"preference for new\".Then there is the improvement of new vehicles versus old. If I buy a new Accord it's really barely different than a ten year old one in capability. But if I buy an EV the new one is far better. Charges faster, goes further. etc.When the Tesla Model 3 came out it was overall, a better car than the Model S was. That means someone could get a new car for about $40K that car that was better than a Model S. So any used model S had to be sold for less than $40K. Even though it cost $80K-$90K new. Yeah, that's gonna hurt.It's really not hard to see why this happens. And it mostly isn't inherent to EVs. It just market conditions due to how EVs are being sold right now and rapid advances in the vehicles.","How much of this is because prices have been going down for new cars due to increased competition and supply?","It would be wonderful if the people flipping Teslas during 2020-2021 completely fucked themselves.","Because they were artifically inflated during COVID. I remember brand new Mini Electrics costing £21,000 before COVID that suddenly became £29,000 during. Super cheap electric econoboxes at the £18-19,000 mark were dropped completely, and a glut of promised £30,000 priced cars all entered the market at £40,000+. I consider the rapid drop to be an estimation of the true value the cars had when they were sold, which was all roughly 10k lower than what RRP was.","I think most tech enthusiasts knew that's what's gona happen,the EVs don't break down like the gas motor ones but when it's time to change that battery,you're f'cked","If anything that’s good, EVs need to develop a second hand market. Only real problem is that depreciation makes owners less likely to list, can only hope that balances out","Used car prices have been heading in the right direction after months of elevated values and inventory shortages. Even so, the values of some vehicles have declined much faster than others, with EVs doing the heavy lifting. Automotive data outfit iSeeCars' latest study looked at used car values over the past year, finding that used electric vehicles are dropping at a much faster rate than their gas-powered counterparts.While used car values have been dropping overall over the past year, used EVs have dropped like a stone in comparison. iSeeCars found that the average for used electric models fell by up to almost 32 percent since 2023, while the used gas vehicle average price sank by just 3.6 percent. Used EV pricing trends over the past year look like this:February 2024: -31.8%January 2024: -30.8%December 2023: -31.2%November 2023: -33.7%October 2023: -33.7%September 2023: -39.1%August 2023: -38.7%July 2023: -34.7%June 2023: -29.5%May 2023: -29.9%","As someone that just bought a used electric car.Bought a 2019 full electric ionic for the same price as the 2019 fuel one.People dont want them because the tech advances too quick. A brand new 2024 electric ionic has 400km range. The 2019 has barely 200.","With rebates getting higher and the general price of EVs dropping, how would you not expect this? I've seen some used EVs attempting to sell at almost the same cost as a new after rebates and breaks.","Sure, but I assume that's because unlike gasoline cars, the difference between a 2022 EV and a 2025 EV is huge. And a 2028 EV will be an order of magnitude better than the 2025. The technology is still in its rapid growth phase, unlike your 2014 Honda that is essentially the same as a 2024.","Are they comparing $100k teslas to $100k gas cars? Or is it an average of all electric vs all gas? My guess is that it’s really easy to make the numbers look whatever way they want for their article.","Nobody wants to buy a used battery","Around Christmas, I got an email from Toyota promoting their hydrogen-powered Murai, a car listed at about $55,000, 0% APR load for 72 months, and with $37,000 in 'incentives' that brought the cost down to $18,000. I thought, \"Wow, a Toyota for nearly a third of the list price. Such a deal.\" The deal was legit, and the car was very nice. However, it is hydrogen-powered, and part of the deal was $15,000 in hydrogen credits for fuel. I live in a metropolitan area of almost 10 million people, which has about a dozen hydrogen stations, and the closest was twenty miles away. That might have been manageable. Then, I happened to be talking with a friend who operates a body shop. He told me they had a year-old Murai in with a banged-up quarter panel. The damage was cosmetic, but the insurance estimate totaled the car. Repairs required the removal of the hydrogen tank and related parts, which pushed the bill into the stratosphere.This was in the ad -APR offer is available through Toyota Financial Services to well-qualified buyers with approved credit. Not all customers will qualify. 72 monthly payments of $13.89 per thousand borrowed. No down payment required if qualified. $22,000 TFS APR Cash incentive from Toyota in addition to standard APR financing when vehicle is purchased and financed through Toyota Financial Services. On finance contracts, incentive will be first applied to the down payment. One incentive per finance transaction. Incentive is available on approved credit to qualified customers through Toyota Financial Services. Not all buyers will qualify. Dealer fees may apply. Must take delivery by 1/2/24.Customers who purchase a 2023 Mirai by March 31, 2024, will receive complimentary fuel for six years or $15,000, whichever comes first. Complimentary fuel term begins as of card activation or 90 days after Mirai purchase commencement date, whichever is earlier. Fuel card is nontransferable.","It's because tesla keeps slashing prices, so everyone has to follow suite","I don't see why people are upset about this, depreciation is great, more cheap used cars please!","I'm curious how much of this is the effect of rebates? You used to get no rebate for a used EV, and now you get a reduced rebate - so not only do you instantly lose value when you drive an EV off the lot like you would for any car, but the rebate value has to be ticked off as well.","This isn't comparing used to new prices. It is comparing last year's typical price for a used EV with this year's typical price for a used EV. Weren't EVs ridiculously good at holding value previously?","I have a dream where North America will improve its public transportation, where its safe and viable for the majority of the population, instead of listening to tech bros about autonomous self driving to address our problems.","Uh maybe because EV tech is advancing at rapid pace, so your 2019 bolt depreciated a lot more when comparing it to an Ioniq 5 that charges 3x faster. This isn’t that hard to figure out. This is what happens when new tech emerges","The biggest driver here isn’t physical depreciation, it is macroeconomic trendsThere used to be massive federal and state tax rebates and incentive programs for EVs, most of them also used to be perceived as luxury due to their newness and tech-adjacent hype, and producers - mainly Tesla - rocketed productionThe rebates and incentives waned significantly, the luxury reputation mostly died as they became more accessible and the average consumer realized they were still just cars and changed their price sensitivity accordingly, and overproduction led to high supply with decreasing demand to further suppress pricesIt isn’t that EVs deteriorate faster - they generally deteriorate slower, excluding when compared in very low temperature environments - they were just very overpriced relative to price determining factors and have corrected downTL;DR: EVs don’t depreciate faster, they had a massive price correction due to a number of macroeconomic factors","You can get a model S these days for $30k! Great buying opportunity if you are in the market for a car now. They used to be like 50-60k used","If you buy any car, don’t expect to resell it for anywhere near what you bought it for.","Another way to read this is that EVs are overpriced.","That’s great news when prices fall! I see a lot more teslas on the road.","Part of the reason is tax credits.","We bought a model Y in mid-2020 for 59,500. This was the \"long range\".Maybe we can sell it for 30k now?My thoughts on it.It was arguably the best at the time.Had higher expectations of \"self driving\".We paid cash for the entire price.Car drives well with little issues.Clipped a garbage can with a scratch and cost 10k to fix (insurance covered but, still...)The closest dealership and body shops are a 2.5 hour drive away (live in constant anxiety of having to repair and lose it for months.Will not buy Tesla again. I will buy an electric car from a dealership that is closer and more common.I have a pick-up truck I will keep until my toddler can drive and give it to him.I will trade in this Tesla when it makes sense for my spouse to go back to work full time.Electric bill for my Tesla is astronomicaly lower than my gas bill for the same miles driven. 30 compared to 200.","Nobody wants a used EV. This was all predictable.","As for so many of the comments here... imagine going to every ICE car thread and asking/proclaiming the engine is going to die as soon as the warranty period is over. What?","BUT if you get a used electric, chances are the battery is still under warranty and the simpler mechanical systems means there’s likely less expensive repairs or maintenance. I have an electric from 2016… dirt cheap to keep on the road and I love it.",""],"points":2648},{"text":["Low-cost passive maglev upgrade tested on regular rail tracks.","How would this be cheaper to build and run than regular rolling stock?","Nothing says safety to me like running high speed rail on top of crumbling rail infrastructure.","There are applications of this: space railway. Union Pacific actually demostrated similar technology ~15 years ago as part of an experiment to move containers between their LA yards and the LA port. While this has limited application for terrestrial earth railways, this can probably work as a conveyance system like for elevators or warehouse palletjacks. For example, imagine a million 24x24\" of these on a narrow-gauge railway within an Amazon warehouse complex moving parcels around between trains or intermodal containers. Such a system works better with a typical 48x48\" pallet though, and I can imagine it being a central part of very large warehouses and factories.","Cool, but what would that system do at railroad crossings? It looks like it has wheels inside and out of the rails but at crossings there isn’t room for those guide wheels.","Calling 100% gadgetbahn on this one.The team hasn't revealed any further details on the latest prototype, but stresses that zero modifications were made to the tracks and that no elements were added to the infrastructure.Great, but there's no world in which an implementation of this technology doesn't require significant infrastructure installation - namely power delivery. Overhead wires aren't going to give you that because you're not touching the rails for your earth, so are you going with a double catenary system like an old trolleybus used to have? Or are you going to fit a whole bunch of power coils in the track. Because nobody is building a diesel-powered maglev.Simply being able to levitate a vehicle above the tracks is only one small step. And if the rails are already there (which is the advantage this tech claims to have), then simply running regular fast trains is going to be far, far cheaper to implement and very close in rolling efficiency, rather than getting this thing working. Steel wheels on steel rail have extremely low resistance, and are exceptionally reliable.Just build a train, people. They work.","How does a magnet create repulsion against a non magnetic steel rail?","Ah, just what America needs for its crumbling rail infrastructure… faster trains.","This might work with Hyperloop, too.","I wonder how this would deal with potential gaps/breaks on the rails, where a regular train would just plow right over it and be fine."],"points":108}]