[{"text":["What’s the best AI tool to use to make tests/flash cards for studying?","Time - ChatGPT will do what you want if you learn to use it.Money - Quizlet will do what you want if you pay them.Pick one.","https://theresanaiforthat.com/s/flashcards/"],"points":0},{"text":["Solution: Upload Document and Generate Questions?"],"points":0},{"text":["Does anyone know of a document translator with AI?"],"points":0},{"text":["Routine Maintenance, by Meghan O’Gieblyn"],"points":0},{"text":["Nvidia lets developers test drive their ML platform for 90 days for free"],"points":0},{"text":["Best course / bootcamp to learn how to be an artificial intelligence engineer"],"points":0},{"text":["This week in AI - all the Major AI developments in a nutshell","YAY Lego"],"points":2},{"text":["Companies use AI to replace workers will ultimately lose,Stanford professor says","But there are jobs that machines are better at, so they will be replaced.","Replace word Ai with Robots and think about Manufacturing especially Car factories","whew glad we had a Stanford professor point out obvious shit…for this yearLet’s check in on the big brain in about two years and see what he recommends","People with jobs have money and use it to keep businesses viable by paying for products and services.If in aggregate, AI displaces enough jobs, most companies will do worse.There’s probably a good balance to be found but I’m skeptical AI won’t continue to be used to optimize costs rather than fuel growth.","So naive, sad that its a Stanford professor/teacher. Very spoiled and clueless views.","In what way would they lose what is the math, with high initial investment into automation less labor costs more productivity, would come in the society of the tomorrow. It would pay the money back, even with UBI. To the matter with people having UBI the money machine will still milk money to the people same way it was before and people putting that money to the machine, but people doing also something else with that freed time would it be philosophy or anything building bridges to other people all the things if things went greatly that would happen, heck with the free time people could voluntarily make a plan to pay a part of debt of the world if they wanted to.If there is no replacement then prepare for all the work being so complex your brain will be fried everyday as your work will be competing the machines things that are made to be efficient would then require us suddenly evolving into being more efficient than the machine i do doubt the evolution works that fast.","Give the humans AI to support them. Problem solved, we all win.","This is bullshit and obviously retarded. One of the fundamental flaws is that Humans exist within contextual scenarios and are able to adapt to be used within environments, that same nature is ultimately not at all impossible to recreate or even sublimate through mechanisms of structured regimens or formulaic designs of action and productivity. The very nature of these statements is more or less, to reassure people we will always have a place. Even that however is and always has been in jeopardy. The nature of AI is that it can replace all workers, the powerful nature of it means ultimately it should. That being said we must confront our fate and attempt to harness and utilize our own uselessness and become more cunning and creative within the nature of our own outdated modus of utility. Else we do risk not only being useless, but even becoming a hindrance and pain to ourselves.","It's almost as if complementing workers with AI leads to fewer workers being needed, therefore replacing the now redundant extra workers.","Depends on the roles the company replaces.","What if most your employees are good only at what AI is good at?","NoCompanies that replace workers with AI will win, the same way the first companies to go online won over the dinosaurs that refused to adaptNOBODY WANTS TO FUCKING WORKWhat do these brain-dead morons not understand about that?We want to enjoy our livesYou used to be able to work and earn a living. That simply isn’t possible anymore.We work as wage slaves to avoid the punishing hand of the law and the oligarchy.These fucking guys will die confused about that","Oh they’ll complement them alright..","They will lose if they do it right now because it’s too early but bet you this is not true, they will win in the long run as they can be faster, scale and wave a shit ton of money","I really don’t believe AI is as disruptive as it’s being made out to be.","Ask Tesla how their over-reliance on robotics/machines went.  The desire to hold other humans accountable is an amazing case study in sociology.  Think of the difference you feel in speaking to a phone menu vs a real person when you call for help. Humans want to work with other humans to problem solve (and most of the American labor force is now a “Service” related industry). Some of these jobs could go to AI, but you’ll see a snap back event shortly afterwards,  to human amplified AI roles.","my concisebot gpt just said in response:\"Balance\"Best GPT I've ever made!","That prof was born with golden spoon.","Stanford professor tries to justify why he should still have job and not be replaced by ICT teachers because it's only industry that'll still need people for a while. READ ALL ABOUT IT!","Rather silly. Here is a perfect example.https://www.youtube.com/watch?v=avdpprICvNIClearly the human does not add anything. This is the most common job in the US.","Why will they lose? They potentially will have a distinct advantage over companies that don't embrace it..Sure, AI can't do everything and still requires workers.AI is already being used to boost companies workforce. This defeats point 1.They problem with this key, is we are talking about overlap.So only workers who do more mundane or repetitive tasks have to worry about their jobs. Is freelance art mundane or repetitive? Or law clerk? Both are potential AI replacements.I don't think I agree with this professor. He's talking about the utopian implementation of AI. Call center's for example would be easy to replace all tier 1 with AI. Especially if they are script driven.","Colleges and Businesses might want to think about the Idea It might not be the workers that are getting replaced.College or Ai? Evil Corporation or AI? Who makes this choice in the end it's the people. They can't get rid of us who will buy their goods. We can get rid of them them though. The Clocks ticking.","In the long term AI will replace jobs.In the short term, a bunch of executives will be convinced that AI can replace jobs it cannot. They will gut workforces and the quality of their outputs will suffer and so will their companies, until such a time as those executives are given golden parachutes to exit those industries. At which point those executives will have learned nothing and continue wreaking havoc in their next place of employment.The next 5 years will be wild.","Creating robots to perform labour is a sign of an evolved civilization. Because labour, while sometimes gratifying, comes with a lot of problems","ai and robots for now are just replacing all the retiring boomers","People really overestimate current AI tools just because LLM finally got to the point that they’re useful. AI has been around a long long time, almost as long as computers have been. AI started beating everyone at chess almost 30 years ago. LLM are great and a step in the right direction but don’t represent artificial consciousness at all. It’s like people saw ChatGPT and went, “wow this thing knows everything!” and now suddenly it can do every job. It can’t. Try doing some actual work on it. It makes errors in basic mathematics that children can do. It can’t code for shit. It doesn’t have hands to do any labour. It doesn’t know anything that it hasn’t scraped off the internet. It hasn’t created anything that isn’t derivative. When AI actually starts thinking of innovations, I’ll start to worry. For now it’s just a tool that replaced googling things for yourself and can mash pictures together. Those are the problems it can solve.","Hold up! My manager can easily be replaced with an AI. 3B model even","In the short term, people who are adept at using AI will replace those who aren't.","https://www.youtube.com/watch?v=sU8RunvBRZ8","If you have 100 employees, and you double their efficiency, you now only need 50 employees. Anything that increases efficiency will, in a sense, replace at least some workers. This isn't necessarily something we should avoid, but it is the reality."],"points":120},{"text":["Do you know about any open-source or lab implementing in software the ideas from Jeff Hawkins's book, “A Thousand Brains: A New Theory of Intelligence”?","Closest thing I could find Modeling the Thousand Brains Theory of Intelligence – Towards AIand this from Jeff Hawkins Himself Neuroscience and AI's Future | Psychology Today","Read this book, is very good, but for a longer summary take a look here: https://blog.assistos.net/book-review-jeff-hawkins-book-a-thousand-brains-a-new-theory-of-intelligence-be0e89d6fca7","Numenta.comis his lab but don't know if any/all of it is open-source."],"points":1},{"text":["Is the concept of ai multimedia generation really that bad that it can be considered as a \"weapon\" instead of a tool?","Every piece of technology will be weaponized to fulfill the user's agenda.Weapons are tools and tools can become weapons.I mean knife crime is on the rise in the UK but it would be dumb to ban knives. Same with firearms. Same with the internet. Same with fast cars Same with airplanes etc etc etc.Laws can't stop development either. Maybe just deter it.If all the 'good guys' stop developing AI. What's stopping a terminally ill person that's crazy from creating a Daemon program that initiated after their death. And that program is designed to kill?We would hopefully have tech to counter such an invasion, and that's done quickest when the people are not censored and free to experiment.This is how the USA jetted their Space program ahead of Nazi Germany's in the 40s and the Soviets in the 60s. (Also operation paperclip)","Technology isn’t good or evil in and of itself, but it can be used for good or evil purposes (and that’s not even considering how one would attempt to define good and evil). But in any case, AI exists and it will be developed. There’s no stopping that. It’s therefore essential that we all educate ourselves in learning what AI can and can’t do so that we’re able to participate in an intelligent discussion of what AI should and shouldn’t do.","This is a tough argument to try and have, but no it is not worth it to halt all the amazing discoveries we are making for these hypotheticals. It makes more sense to create new tools to mitigate the damage that can be done with them than to stop progress. Creating sites where public figures and entities can verify/disprove can help. Creating codewords with loved ones to avoid potential voice scams. Run all your loved ones through the potential negative uses of AI, and also just how to spot a scam in general. People needed to be educated on phone scams long before now anyways.","It depends entirely on how it's used.Modern infrastructure in the U.S. was built with the intent of keeping black & brown communities poor and further white supremacy. That does not make all roads and infrastructure an evil net detrement to society.There are millions of benign applications of synthetic media. This is why media literacy and critical thinking skills are and will continue to be essential life skills. Unfortunately, there are political elements that want to reduce the public's capacity for both because it suits their existing propaganda machines.","All new revolutionary tech displaces older crap. The people whining about this are simply whining that they are going to lose advantages and monetization options that THEY currently have. It's actually really annoying the amount of terrible-faith arguments I've heard, simply from whiny artists who have a personal bone to pick."],"points":12},{"text":["Potential for Sino-US cooperation on AI seen"],"points":0},{"text":["Meta's new goal is to build artificial general intelligence and will have more than 600,000 H100 equivalents of compute by the end of this year","Facebook ran out of potential new users so now they're going to make them lol","whos not on the agi train since google's transformers 2017 idk, what is this, ofc they need compute","\"Like Google’s new Gemini model, another focus is on more advanced reasoning and planning abilities.\"Sounds interesting enough.\"Perhaps, he suggests, these AIs will even be able to post their own content to the feeds of Facebook, Instagram, and Threads.\".....\"Talking to Zuckerberg, it’s clear that, going forward, it’s increasingly going to be about humans talking to AIs, too. It’s obvious that he views this future as inevitable and exciting, whether the rest of us are ready for it or not.\"....and the sad head of a computer scientist who just wants a friend emerges. This is the real threat; artificial societies, where people who are owned and generated by large companies, interrupt and ruin our ability to use the internet to talk to other people (we simply won't know whether those people and their opinions are real any more).From this we'll be subject to a world of forced false perceptions, that won't be verifiably linked to any sense of genuine reality. A company wants you to think their product is valuable, popular, or worth having? They'll just set everyone you talk to to discuss it with you, until you either think you're mad, the world is mad, or you submit, and buy whatever they're selling.This is a branch of the dystopian hell corporate AI risks becoming.","What happened to the Metaverse?This is an ambitious plan, and I applaud ambitious plans. And... it's impossible for something to fall into the wrong hands when it's in the wrong hands from its inception.I wonder if there's anything, anything at all that's not evil that they would use this for.","Does that mean no more VR headsets?","I love effing with AI. But if Zuck manages to have the best GIAI, (unlikely) I’ll forgo it and settle for whatever ends up being second best.","Meta is a dead company with no identity. They will pivot until they fully run out of money","Zuckerberg has never had any actual ability to innovate and, and has no expertise with AI... he'll just latch on to whatever he thinks will rescue Facebook/Instagram from their inevitable death a la MySpace. He's not really building anything, he's just desperately pouring ad-revenue cash into server power in the hopes someone will use it to keep him relevant... everyone else is doing AI so he doesn't want to be left out. Yawn."],"points":102},{"text":["Nick Cave on ChatGPT at Letters Live Event"],"points":0},{"text":["Anyone know of an ai that can write an entire 25 minute long sitcom pilot for me?","Sure. But he charges $5,500/ep and I hear his union is a bitch.","Why do this? Just out of curiosity,","Here you go:Scene 1 - act 1 :A GOLDFISH SWIMS IN A BOWL. A MAN IN A SUIT ENTERS THE ROOM AND TAKES A SEAT. THE MAN WATCHES THE FISH FOR 24 MINUTES AND 30 SECONDS, WHILE THE CAMERA CHANGES ANGLE TO INCREASINGLY TENSE MUSIC. THE CAMERA FOCUS ENDS IN CLOSEUP ON THE MANS FACE.MAN: “Well that was just not worth it. Stupid fish.”END","GPT can do it just fine if you have it break down the plot into a summary first, and then have it expand section by section.","I'm writing a book chapter and use GPT but you have to give it the structure first and then ask it to write the first section but then keep a log of all the outputs and feed it back all of the information up collectively so that it gets smarter as it writes and you direct it to improve the sections before moving on to the next one","Take something already written in the public domain and use something to modify it. Like professional writers do","novelai.net","AI will not be able to do creative speech until it has learned better ways to copy people. Even then it will be easy to detect.Steve","I think LLMs can be super forgetful with long context","Go to Poe, there is a bot that will write an entire book for you, I'm sure you could use it for a sitcom instead. Tell it how many scenes you want etc.","George Constanza we know this is you."],"points":17}]