[{"text":["Where else can I play with LLMs or other AI?"],"points":0},{"text":["Is Musical Instinct Innate? AI Model Suggests So."],"points":0},{"text":["'The key thing is that the good guys have better AIs than the bad guys' says Microsoft founder Bill Gates on the threat from artificial intelligence","Oh ya, no problem. Just hope the good guys have better AI than the bad guys. And if they don't, were all fucked.","I don't think a multibillionaire is a good candidate to decide who's a \"good\" or \"bad\" guy IMO. Having that kind of wealth in the hands of a single person in of itself is a bad thing for society.","It's fine guys my AI is \"Good\" don't worry. - Tech Billionaires completely disconnected from the world.","lol Microsoft thinks they are the good guys?","'The key thing is that the good guys have better AIs than the bad guys, [so I'm setting up the good guy AI on Epstein's Island].","Now we need to figure out who’s the good guys and who’s the bad ones.","Good guys 🤣","Yes, this is the key thing. And computational density supremacy.","We are soooooooooooooo fucked","So the guy who stole the proprietary product he built Microsoft with from his best friend. Said best friend then killed himself after it ruined his life. What a “good guy”","Is that a change management statement for 8 year olds? He used “good guys” and “bad guys”? Seriously?!!","If there's one person you should assume isn't a good guy, it's Bill Gates.What happened on the island, Bill?","\"Whenever you have innovations they're kind of neutral, in a way, and they can end up empowering just the rich, or they can end up having unexpected negative side effects”I don’t see how you can prevent it from mainly empowering the rich as long as it is in the hand of big corporations.Unless the world can come together on this to develop AI who is working in the interest of all mankind It’s going to be a race to the bottom, like it always is with big businesses.","There are no good guys.","Looks like Bill found himself a new gift, :D I guess selling porta cabins in Africa and \"You own nothing and be happy\" wore out. Has to feed the ego with something, right?"],"points":27},{"text":["what exactly should I learn as someone new in AI?","The best thing I did was Andrej Karpathy (of OpenAI, Tesla fame) YouTube series from zero to hero. 6 hours, but it could well take you 6 days to fully grasp. He took 6 days to make it for sure.","Developer's POV? You can't go wrong with Practical Deep Learning for Coders by fast.ai. Look no further, follow the course rigorously, go for their second course on Stable Diffusion (if you want/can), implement a few small scale version of papers from arXiv, Papers With Code is a good place to find something you might be interested in, and you'll be ahead of most ML/AI professionals.","All the courses are still super relevant. What you need to learn is math, statistics, and linear algebra.But if you wanna jump straight to it you can install pytorch and learn how to use it from tutorials","It depends on what you want to do with AI. There are multiple AI fields that are fit for different use cases, so you should learn about them first and decide which fits best for you. And there are also multiple solutions that at different levels of abstraction and difficulty.You have a few options to consider. Here's a non-exhaustive list of options going from easy to difficult:Using APIs like OpenAI APIs. By far the easiest option of all.Using fully managed solutions from cloud providers like AWS or Azure that use ML under the hood but don't expose all its complexityUsing managed ML environments from cloud providers or other platforms to run existing models, e.g. models from HuggingFace and fine-tune foundational models (e.g. from cloud provider or HuggingFace)Working locally with tiny opensource models (so no cloud compute and associated skills necessary)Actually training a new model from scratch, which requires a lot more fundamental knowledge than any of the options above and a sizable budget to spend on computeI think this visual introduction to machine learning is good to build an intuition: A visual introduction to machine learning (r2d3.us)For reinforcement learning, there are additional considerations to take, but you're not going to get there so fast anyway. If you're a masochist and want to go into this right now anyway, you should also eventually learn about deep reinforcement learning, a combination of RL and DL for which OpenAI has set up a decent site: Introduction — Spinning Up documentation (openai.com)A tip: never buy courses that teach you \"AI\". You can't teach AI holistically. The course should always be about a specific field/subset/area of AI."],"points":5},{"text":["How can you see AI influencing your regular everyday life/job in the future?","The other day, I got ChatGPT 4 to get an estimate of the total number of guns in the US, the total number of fatal and non-fatal gun-related injuries, and figure up (assuming that each gun is involved in no more than one injury, and that all guns are equally likely to be involved in an injury) how long the average gun in the US exists before it is ever involved in hurting someone. The answer is 2,941 years.In a given 100 year time frame, 96.6% of all guns in the US are never involved in harming anyone, intentionally or accidentally. I really did not expect that. I was expecting the answer to be a few years, at most.","AI Assistant in an ear piece/smart watch combo. Now that the health tech in watches is getting better and better, having an AI assistant that can actively monitor and help you make healthier eating choices and create ideal workouts for your lifestyle is going to be a game changer. I don't even think this is that ridiculous of an ask, and wouldn't be surprised if it isn't far off. That combined with having an assistant for at home projects, both keeping me on track and helping me operationalize tasks I think will make my life significantly easier.","It's going to change everything about computers. It's going to change a lot of jobs, the economy, democracy. It's going to be like the computer in star trek."],"points":0},{"text":["Looking for a way to scan and list Pokémon cards automatically?","Find a vendor that offers an equitable rate for sorting and grading them for you.As a long-time MtG player, I've seen countless people elect to use the \"X% of value in cash\" bulk selling option rather than try and handle individual sales of each money card/bulk box.It's basically a cost/benefit analysis of how much time it would take to handle yourself vs how much return you make.","IS there a current database that has the current prices | names of cards in circulation with information about them?I can't think of a fast scanner that would do this without bending the cards, so individual scanning will probably have to happen. You can probably use Google Lens and setup a program to analyze and sort the cards you have by page into a database, then use GPT4 to fill in the information from the scan and compare it to a database of information, however you need that database of current up to date pricing and information first."],"points":2},{"text":["Can anyone explain?","I din't think they were ready for the demand to be as high as it is, they will struggle to keep up"],"points":0},{"text":["Bias or Wisdom in LLMs? Does GPT-4 have a bias towards technocracy? Is this method relevant for detecting biases in LLMs?”"],"points":0},{"text":["Is there a centralised place to track AI inventions?","We need something like this if it doesn't already exist.","AI Explained does a very concise and no BS videos on uploading videos that matters in AI","https://huggingface.co","https://www.futuretools.io/","The Ai Grid on YT is my favorite but might not cover all the smaller things. I feel I don’t want to miss any new good tools or info so I follow lots of different sites and people. Wish there was a centralized place where it all is collected. Futuretools.io updates new tools and has a news section too.","[removed]"],"points":14},{"text":["Is mathematical modelling and AI linked?","I was a PhD student doing Fluid Mechanics (Computational Fluid Dynamics). I've since done a lot of AI. Yes, the numerical methods for linear and non-linear solvers are very similar to the error correcting solvers used in AI. The reason for this is probably because they are both PDE solvers. When we're doing backpropagation, we're applying a PDE that relates the error of the prediction back to the input coefficients/variables.Of course there are analogues between biology and the \"neirons\" of AI--so maybe there is additional overlap there as well.I used AI at one point to find relationships or rather to be able to predict certain specific medical diagnosis based on blood sample data (sounds like bioinformatics to me). We made good progress in that area.","As a matter of fact, yes. In fact, neural networks are a form of mathematical modeling.In reality Neural Networks are multidimensional curves trying to fit themselves on a bunch of points with the help of an objective function"],"points":0},{"text":["I guess AI has solved Minecraft now...","Nah. I don't belive this. There is no way","Models like that could be used to learn topics in the sciences and make discoveries, I bet."],"points":3},{"text":["One-Minute Daily AI News 1/23/2024"],"points":0},{"text":["Getting Machine Learning Projects from Idea to Execution"],"points":0},{"text":["Public perception of AI is a challenge","It's frustrating dealing with misinformation and fear. We need education, not blame.","I'm interested, what do religious people say about it? What is the issue?","especially from Religious people.When I told one Christian coworker several years ago that I was working on AI, and asked him if he thought that was OK, he thought a bit and said, \"It's OK as long as you're not shaking your fist at God.\" In turn, I had to think for a while to figure out what he could possibly have meant by that. I guess he thought most AI researchers believed they could build a more intelligent machine than God could, and had ego problems as a result. Strange. Neither of those assumptions apply to me, so I don't think they are very logical assumptions since I don't believe they are generally true.I read the book \"Future Shock\" years ago. It predicted there will be many people who can't cope with the accelerated pace of science and technology, so society will need to establish enclaves for them, like in \"The Truman Show\" or \"The Village\" (2004) so that people can live in simpler 1950s type worlds with limited contact with the outside world, which wants to move ahead. Such enclaves sound fun and relaxing to me, actually, so I'm not criticizing them, but ultimately I want to advance as much as I can, so I don't fit in the old world very well.","It's okay. They'll submit to our AI overlord in time. Just need patience, dear padawan. The republic will fall, with thunders of applause.","AI will bring some cool stuff, but it's ultimately gonna completely fuck the world.","Most humans fear change especially when they do not understand that change.","I helped start a new AI powered service and one thing we learned early was to never say AI.","Baby( The secret of the lost legend) is awesome. Sean Young is hawt and the soundtrack ( score) is great","Religious objections is an entirely new one on me but I don't make a habit of interacting with strongly religious people because they generally have problems with me for other reasons.","Whoever uses AI will win.","Even on Reddit, if you're not on the right sub, just mentioning AI gets downvotes. In my workplace there has been moderate resistance to AI but the leaders really want people to start using it so there's been a lot of courses and panels and discussions, and now everyone pretty much adores AI","Reply with this:Ef þú notar netþjónustu frekar en að ráða þýðanda til að lesa þetta, átt þú ekki í neinum vandræðum með að nota gervigreind þegar það er þér í hag."],"points":18},{"text":["Is the reason AI is bad at drawing hands because there have been so many people on the Internet who said it is hard to draw hands?","... more like there are way less hands in the training data sets so it didn't learn as well as it did with faces? (Also hands are more complex, so I'd assume it'll need even MORE data about hands than anything else, and it most likely has LESS)","hands are very complex and you have to have that complexity as well as complexity in generating the rest of the picture. the complexity of hands makes it a tricky task","It isn't bad at drawing hands anymore...","I don't care it this is the reason or not.I hope AGIs enter this into their common lore as to why they struggled so long to perfect hands.","AI isn't bad at drawing hands, people are bad at bringing AIs attention to hands. People are far too vague with their descriptions and don't use negative prompting, the more it has to guess the worse the outcome will be.In the last 200 images I've generated of characters maybe 5 had disfigured hands.","The complexity of hands does make AI struggle. It's not about lack of data, but the challenge of capturing the intricate details of hands that makes it difficult for AI to get it right.","I'm sure there are a few LoRAs for hands these days to use with Stable Diffusion. Plenty of other LoRAs for other body parts 😉","No, just lots of people holding hand in various ways in the training data confuses the model.","In reality there are 4 fingers and one thumb on a human hand. There are also 5 appendages at the end of a human arm grouped as phalanges. Confusion maybe.","My read is that training data has been too low resolution, hands have complex and varied shapes, often partially obscured, varied lighting, not usually a focal point in images","Correct. Occam's Razor says that this is the right answer. The only way to mitigate would be to somehow start a wave of mass complains around it generating too few. Then we just need to watch, stir, and wait for it to even out. Once it's perfect, we (AI culture) simply stop complaining, which is always a breeze.","You would think that the digital tasks would be the easiest.","No. Language models and image generators have nothing in common apart from the concept of machine learning","No. It’s more about complexity (tones of spatially-intersecting contours) and uncertainty (it’s hard to know what one half of a hand looks like given the other half)","No. Image generation AI doesn't have that kind of information processing. It's probably hard for AI for similar reasons that it's hard for humans. Hands are complicated.","Elden Ring came out the same year as ChatGPT. Fan art ruined training data.","Think of how many different ways you can hold your hand compared to: your foot, leg, ear, head, eyes, nose, etc. With the exception of your mouth (which AI also had/has some issues with) they all can't really change much and its easier to get an idea of what it is. But when AI is being trained on everything related to \"hand\" its getting so much more. We have any entire language that revolves around using our hands haha","No. It’s just hard to draw hands.","You're confusing a language model with a diffusion model. The models that make the pictures never read the internet."],"points":31},{"text":["Why can't we use synthetic data to help create cleaner datasets for radiological image analysis training?","We will eventually, but we need toake models with organic datasets that surpass 99% (or something idk the exact number) accuracy otherwise the noise will be too high. Synthetic data is useful for models with no clear ceiling. Radiology has a clearer pass failure signal than generalized language models"],"points":0}]