[{"text":["Me and my friends are planning to do a capstone project on cybersecurity domain. Can you guys suggest some ideas, it will be very helpful"],"points":0},{"text":["Any free exam voucher for cybersecurity?"],"points":0},{"text":["Feeling useless and afraid"],"points":0},{"text":["What Could Have Stopped the 23andMe Hack?"],"points":0},{"text":["Do government bodies really care about cyber security?","I would challenge your assumption that government agencies care about “productivity and performance” in any area.","You have to remember that governance fundamentally doesn’t pay as well as private. That means with your upper most leadership, you with have a higher than normal people who are either there by passion or because they struggled to cut it with the same roles in private. In both those cases, that means you have some really big personalities, and they can very heavily influence the viewpoint of your organisation.In our roles, we also have the difficulty of getting caught up in the weeds. Confirmation bias means that we start to see every High risk as The Biggest Issue In the Department, when the leadership are seeing high risks from the business perspective just as often. Because of that, we often struggle to communicate the security requirements and security concerns in a way those people really understand what the real impacts to the organisation are, and they have too much personality to admit it.That gives you a storm where yes, the leadership thinks security is important in moderation and balance, but their balance is skewed in a different direction to our own because their ego wants to see them leave a mark, and security doesn’t leave a mark. Then one person’s perspective on this influences everyone else at that leadership level because Strong Opinion Personality. They focus on compliance and reputation because a fine is the only impact they actually understand from what we’ve told them. We haven’t brought them on the journey or translated our work into value for the department itself.","The ole' \"we do the the best we can\".Your not the only one who questions this.","Yes.","They are very reactive and sometimes driven by personality"],"points":15},{"text":["iShutdown scripts can help detect iOS spyware on your iPhone"],"points":0},{"text":["Phishing Awareness Advice","stop doing weekly phishing tests, this is so pointless. surely there are better areas in your job to spend time on."],"points":0},{"text":["Certificate of Cloud Security Knowledge (CCSK) - is it a respected cert?","I did it. It’s ok. You won’t need to look at your notes if you prepare well."],"points":0},{"text":["How much does understanding of Linux matter in a cybersecurity career?","It’s a tool like everything else. Learn it and move on. It’s actually very simple!","Just learn it and move on. It's important.","You could say the same for any OS. Do you need to know Mac? Windows server? Or maybe you're gonna be excited to dust off those old windows XP skills.It depends where you work and what you do. Many servers run on Linux but many servers run on windows.I install certain software for clients that requires a Linux-based server, and I can't do my job without that knowledge.You may never touch a Linux server in your life.","Linux seems to be pretty important, many systems run different flavors of it. It feels like Windows is surface level and Linux is what actually runs things from what I've seen.Honestly you could get decent at Linux in a couple days of using it. I was trying to avoid it but I had to learn it for a job and I strongly prefer it over Windows now.Get a Ubuntu VM and follow along with YouTube hackersploits intro to Linux video playlist. It's pretty easy to get used to. Settings are stored in text files so most of it is knowing where files are located and how to update or read said files.","It depends what you want to do","I'd be more curious to know how can one do cyber without touching Linux. (or even software development for that matter 👀)","It's kinda important for cyber and development if that's what you will be moving forward, GRC is an exception but like other tools Linux is also a tool but many tools are dependent on it sometimes.","Really depends, but definitely would help you a lot","DRM and anticheatPresumably you are going to be working mostly with Windows then? Probably won’t be negatively impacted by a lack of Linux knowledge, though you will reduce your opportunities to in switching companies. That said, deep Windows internals knowledge is harder to come by than deep Linux internals knowledge, so the skill set you cultivate will be more valuable - just at fewer places.All that said, you really should learn to use the command line to be an effective developer regardless of your field. Not necessarily bash or cmd.exe specifically, but the basics of runsomecommand —with —some=42 -aRGs. Even when I was targeting only Windows, I still needed to use a number of tools that either required the command-line to tweak things, or even lacked GUIs altogether.","Best bet, download virtual box and the Ubuntu ISO and just play around with it on a VM, not installed locally. There’s plenty of resources out there to learn Linux from beginner to expert that are either free or relatively cheap.","if you tout yourself as a very technical person the yea. no excuse not to know it to some degree","Spend a couple of days and go through the free course Linuxjourney.com","I know Linux, having said that it'll help but there are many others in my department that don't know anything and they are functional without it.","I understand the frustration in that question lol...","--help, or use tldr.sh to learn about commands, every app have their own commands many are very similar","You don’t need to be able to necessarily administer it in an enterprise or anything, but you need to be pretty adept at using it as a system for yourself. In that respect, it’s a pretty hard requirement. Windows is very poorly suited to doing actual computing work, unless you count WSL, so you’ll learn Linux when you enter the professional world because you’ll be forced to. I probably wouldn’t stress it too much, it’ll come naturally as you progress in your career."],"points":84},{"text":["Securing Game Servers and User Data","Openid/ oauth 2.0 are the protocols you are looking for"],"points":1},{"text":["Inauthentic accounts or is it just me?","Oh that’s just my account I use for porno, don’t mind it. Forgot to switch back to this one. It’s where I watch my Japanese tentacle impregnation porn. Don’t want anyone thinking I’m some weirdo or anything","Can be any reason why. There are plenty of throwaway accounts for specific questions and some people are lurking for years, then suddenly they get a stroke or something and posts a question. Could be that they use it to follow people and a throwaway for questions, and then they forget what account they are on. Have often seen stuff like that on twitter and it can be hilarious.It is worse in some other subreddits with new accounts and trolling (guess from which country)."],"points":1},{"text":["How do you take notes?","Try to triage stuff - what facts do you just HAVE to know by rote, what kind of things will you be able to reason your way to when the situation calls for it, and what do you not need to devote any capacity to knowing and can just look up when the need arises?That approach usually reduces the amount of stuff I just have to memorize by like 90%, and the rest is practice. And then I make flash cards for the rote stuff.If you're doing lectures and labs, I've always had the most success not taking notes at all except for the shortest little messages to myself about what to look up later - keeping my mind and presence on the lecture/lab leads me to better recall than when I am so focused on note taking.","Notionmake the switch from G Docs :)","Sounds like you’re asking specifically about OSCP note taking. When I was studying, I used the cherry tree template that’s been floating around for years. For each machine, I would write the name and techniques used to exploit the machine in the title. I did the same thing for any HTB, vulnhub, etc machine I practiced on. Just being consistent with one style will help.Now, for the actual exam, I think it’s important to just realize that your note-taking methodology can be applied to your investigative process. Your actual notes from when you are learning will probably be less helpful since you’ll more than likely encounter something you haven’t necessarily seen before."],"points":2},{"text":["Heed the Wizard's words! If your GPU is the stuff of legends, you could be earning up to $180 per month on Salad. Powerful hardware helps you pocket huge rewards, while you help the world with massive computing jobs. Download Salad today to get started."],"points":0},{"text":["3rd party security audit recommendations (or aversions)","You want an audit or an assessment? Do you want valuable findings or an impressive name to show potential customers?"],"points":0},{"text":["What is your stack?","What are your requirements, friend-o?"],"points":2},{"text":["INCOSE CSEP?","For non-profits I find it's best to start with 990 forms.Incose Foundation: https://beta.candid.org/profile/7007377International Council on Systems Engineering: https://beta.candid.org/profile/8229452And here's something from MIT in systems engineering: https://ocw.mit.edu/courses/16-842-fundamentals-of-systems-engineering-fall-2015/7f2bc41156a04ecb94a6c04546f122af_MIT16_842F15_Ses2_Req.pdfDoesn't really seem cybersecurity related, at least not directly."],"points":0},{"text":["Which Cyber Security domain interests you the most & why?","Cryptography because I know it well enough to teach it but it’s a dark magic to the other 99% around me.","OSINT and threat intelligence. I’ve been kinda laughed at before for saying it, and I’m not totally sure why. But it is legitimately interesting to me.","Cloud securityI work in it and if someone can own ur infra then ur fked. I love the impact of it and the widespread adoption of itIt feels like a future proof job to me. Even with AI, AI relies heavily on the cloud. So until we have AI that can properly secure the very infra it's using, our jobs are safe","quantum computingNice moat too, very few people in the security field understand quantum mechanicsSame for those in the AI space. Very few people in security actually understand the math behind LLMsIf 99% of the larger workforce doesn't qualify for the jobs, it really gives you a lot of leverage","Offensive Security.Not that I do it for a living or anything like that, I sold my soul a long time ago. I just really enjoy the rooms on TryHackMe and HackTheBox. It is like solving a puzzle.","Social Engineering. We can secure computers so well if we put our mind to it, people are still half a step from the plains of Africa. When I go to an organisation to brief it on security I sometimes like to see if I can get to the meeting room by blagging my way in, tailgating and so on.","The domain where I get paid. 😀","Getting people and organizations to actually adopt a solution by making it easier for them to interact with. Sounds like a cheap shot, but security isn’t implemented or used because it’s hard… I like building solutions that help remove that barrier.","appsecI think most organizations have a very manual approach to solving appsec problems.My goal is to automate and innovate appsec by 10x in next 5 years. 💪🏼","Exploit development / Malware developmentThere's something really cool with turning a CVE into an exploit. I do pentesting currently, but I dont have the ability atm to just take the CVE and weaponized it, which kind of sucks. And idk just seems kind of mystical to me, plus it's a useful skill to have.Malware development is kind of in the same vein. It's like a special art form, that does very interesting things lol.","Leaks.Seems trivial, but they're almost constant, and if you know where to look, they're terrifyingly ubiquitous.Also ubiquitous - organisations' overall indifference to leaks. Less trivial for the people whose PII is slathered in clear text here there and everywhere, of course, but since punitive measures for corporations amount to little more than a financial slap on the wrist,assuming they suffer any ramifications at all to begin with, I fear it's become just a cost of doing business.","CyOpsThe realm of Information\"Technical\" and Information \"Cognitive\" security.Psychological operations in cyberspace.Cyber enabled Mis and Dis information","Incident response, because nothing else matters"],"points":99},{"text":["Energy Compliance","I work in utilities. Our main cybersecurity standard is NERC CIP and applies to facilities.","Depending on the foreign entity you’ll have more regulations but in the US I believe you will need to follow the Transportation Security Administration (TSA) directive.https://www.tsa.gov/news/press/releases/2023/07/26/tsa-updates-renews-cybersecurity-requirements-pipeline-ownersYou’ll also want to look into NIST for Critical Infrastructure as well as other frameworks but I don’t think there is anything on the compliance side that I can think of."],"points":1},{"text":["Where do i start with cyber security?","Respectfully, this probably should have been directed to the subreddit's pinned Mentorship Monday thread.However, in the spirit of being helpful:https://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oftbi/","I’m going to share an unpopular opinion here. Don’t start with cybersecurity.Cybersecurity is build atop of many other tech fields. If you have zero experience in those fields,you are going to run into 1) problems even getting your foot in the door, and 2) even if you got in, you’d be a deer looking at headlights.An analogy would be, say, wanting to design skyscraper without being an architect first.Start with IT to build hands on knowledge and experience. Network, server management, end point management, end user support, software development. They all have aspects that generate experiences that feed into a foundation to work in cybersecurity.Oh, and don’t skip the bachelor degree if you can afford the money and time. When everyone around you has a bachelor degree and you don’t. You’ll be the one that gets screened out and left behind. Yes, you might get lucky with one shop. But that will be a factor through out your professional life.","What do you think cyber security is? What specifically do you want to do in CS? What country? What industry would you like to do CS in? --- consider GDPR HIPAA PCI DSS ect... Get into one of those companies IT to get compliance experienceA+ Net+ Sec+ CCNA MCSA CySA+/PenTest+ GSEC/GCED Linux+(lol) GCIH ... See the old 8570 list of stuff...AA in CS BS in CSPlan on taking 10 years to get up to speed.Get multiple IT jobs and focus on security. Build computers Build networks Build computers and networks in the cloud Set up multiple domains Put in security devices to monitor said networks and computers.Be a Windows admin Be a Linux admin Do web development Learn a languageCan do this in 7 years if you are focused enough.Cybersecurity is not entry level but all the aspects of it are... Go get all the pieces before putting them together.","Networking with professionals, and I’m sure some instructors in your program will be a good starting point as well, especially for giving you references. Also, home lab experience. Maybe try some cybersecurity projects at home (there’s some YT videos of easy ones), TryHackMe, HackTheBox, etc. Every interview I went on wanted me to have some sort of hands on experience or projects I could talk about and wanted to know how I learn about cybersecurity outside of work/school.","Start getting in touch with people who will give you jobs ASAP. Figure out what it is they need and then get it.","Learn to code and manage cloud technology - all you need is an Internet connection and a functioning computer.Penetration Testing Platformhttps://www.kali.org/TAILS: The Incognito Live Systemhttps://tails.net/about/index.en.htmlFree tutorials and exercises for all kinds of coding languageswww.w3schools.comPythonwww.automatetheboringstuff.comOdin ProjectFullstack Open100 DevsOWASP - join your local chapter https://owasp.org/Learn how to manage applications on the major cloud platforms…Free training - only pay for exams and / or certificationsAWS - Amazon Web Serviceshttps://aws.amazon.com/training/digital/GCP - Google Cloud Platformhttps://cloud.google.com/learn/trainingMicrosoft Azurehttps://learn.microsoft.com/en-us/training/azure/If you get stuck going through these things…turn towww.stackoverflow.comwww.stackexchange.comwww.YouTube.com","After ur AA get a bachelor's, along with the certs you think will help your career"],"points":27},{"text":["TLS 1.2 Cipher Negotiation","You are correct. The most common setup is a reverse proxy so traffic is decrypted and inspected before sending to the request to the web server. Sometimes the request inspected by only a couple of kb of the request to prevent being dos. It is also is a reason I have to constantly tell my app team to look at xff header to find the true client up."],"points":1},{"text":["Is there real value in Certs?","Those certs aren’t bad, but a bachelors degree will be much more useful. Certs can provide a good guide to studying and learning certain sets of material, and some industries require certain certs for jobs. A bachelors degree of some sort is expected as a minimum for most jobs these days, though in cybersecurity demonstrated skills/experience often override this expectation.","I got into this VA backed program that sets you up with 7 certsWhich program is that? Is it a bootcamp ?Is it one of these - https://www.benefits.va.gov/GIBILL/FGIB/VetTecTrainingProviders.asp\"Security\" is a broad fieldThere are security roles in every single industryHave you actually looked at some job examples? Do you know what industry you want to work in? what part of the country?","Some certs are still meaningful. A lot aren’t. These days, having one doesn’t mean you know anything and not having one just means you haven’t taken the class ($$) or the test. Neither says anything about true qualificationsThink bachelor degrees, when everyone has one, it’s just a checkbox.","Those are all very entry-level certs which are good for foundational knowledge but probably won't get your a job on their own outside of lower-level IT: help desk, tech support, etc.But building on that lower-level experience and continuing to cert up puts you into a better position for more advanced IT (sysadmin, networking, etc) and cyber security roles.A tech bachelors is probably worth more if you have the means to get one.","Way too much comptia cert.It's like planing to apply on all entry job with a shotgun. If you are going by the cert path, A+ and Net+ should be enough for an entry level job, then you pursue your education in balance between what you enjoy and what is needed and aim for intermediate level certification.","If you still have your GI Bill just go full time to a feeder / target school. UC Berkeley, Stanford, Caltech, MIT, CM, UTA, GT, etcFor the private schools look up their Yellow Ribbon program. You generally don't have to come out of pocket at all (https://admission.stanford.edu/apply/veterans/aid.html)Do your undergrad in computer science and focus in security (extra / elective courses, internships, extracurricular)Get good internships your 2nd and 3rd years, target new grad security engineer positions during your 4th year. If you can't land that, go into SRE to pivot into security engineering / devsecops, or general SWE for appsec /prodsecGood internships:https://www.levels.fyi/internships/Top entry level companies:https://www.levels.fyi/2023/?level=Entry-Level%20EngineerThe best paying companies with the most growth potential don't care about your certs outside of very narrowly focused and pigeon-holed GRC or audit roles, and even that's not always a deal breaker","Certs have to fit your narrative.If you start with some entry level certs, get a degree, work a little, work a little more, get more certs, work...then work a little and finally get some of the big dogs (CISSP, .etc. and IMHO) then they are a nice differentiator.I won't hire because you have them.However, I like to see one or two that you chose because they reflect your skills."],"points":6},{"text":["Crowdsourced DDoS Attacks Amid Geopolitical Events: Tools, Telegram, Gamification, and Cryptocurrency"],"points":0},{"text":["Cyber terrorism on business","Important thing is to not panic now and try something odd. You might have been given a time limit by the ransomware group, but this is enough time.Contact an IR team and be as transparent as possible. Tell them everything you know, show them everything you have.Not paying eventually and recovering might be cheaper, if you are afraid of bankruptcy.Be transparent to your customers as well and inform them, if needed. Hiding things won’t help the image and just makes things worst.Good luck to you 🤞🏻 and keep us posted please","Pay for cysec?","You mean ransomware?","Commenters here are right. Deal with today first. Get an trusted IR team to deal with the breach. Once you are back on your feet, put the right solutions in place to cover complete end-to-end security. Example: On my personal computer at home, I run a proactive cybersecurity solution that's very affordable. There are many providers out there who have individual, small business (express), and large enterprise cybersecurity solutions stacks that involve prevent & protect AND detect & respond tools.","Contract an IR team. Unless you have a watertight BUDR plan that includes off-site backups you're probably going have to pay the threat group to get your data back.Comply with your countries regulations on data breaches.","Account is fishy, comments fishy. Nice try. Blocked.","Die and then contract with my MSSP.","Call the FBI","Regardless, be prepared for angry customers! Get ahead of that too","Depending on your industry, CISA might be able/willing to support. The regional contacts are here:https://www.cisa.gov/about/regions","Also, check whether you have cyber security insurance (in the UK, some small business insurance policies include it by default - that may be the case elsewhere). If you do, call them, and they should be able to put you in touch with approved specialists.","You should consider bringing in an incident response firm. It’s not gonna be cheap, expect to pay between $200-450/hr just for the investigation/response and it’ll take a couple weeks. Also you can negotiate with the threat actors. Their first number is usually just a sticker shock. They often settle for 30-40% of the original amount.","Did you call the fbi?","Sorry for what you are now going through. If you did not have proper IT governance and controls you will likely not have many options other than to pay up. Additionally, just paying the ransom is only the beginning, you need to clean and secure your network or it will happen again. Unfortunately, upfront investment as a preventative is much better than trying to respond after the worst has happened.First things first, do you have backups, and if so, have you made a copy that is in another location they don't have access to?","Ask them for a list of your files. Ask them to prove that they can unlock arbitrary files.Remember that you have to pay a lot anyways to restore your infrastructure. Only pay ransom if you have a use case.From the attacker's view: The longer you wait, the less likely you are going to pay, that's why they pressure you.Don't be afraid of double extorsion. Nobody else wants your data (at least you can tell that to the attackers).Your customers suffer more from your data loss than you. Try to communicate transparently and timely to avoid loss of trust in your brand.","I can help, PM, we can set up a call. but it's going to cost ya","Do you have an incident response plan? I can connect you with a good IR team to jump into breach.","Contact an incident response firm.","As with any crime encounter, contact your local police and FBI.If your shop haven’t done enough tech work to have a cybersecurity practice, do you at least have disaster recovery plan? Backup/restore plan? What was the plan if someone’s computer crashed and lost everything?If it is important enough, consider bringing in (as in contracting) cybersecurity expert to help.","Give them the money"],"points":99},{"text":["Australian companies are taking TikTok to task and are removing its controversial tracking pixel from their websites.","Good. Hopefully OnlyFans next. Down with all tracking pixels."],"points":1},{"text":["We do not give UrlScan.io enough credit.","urlscan.ioCyberChef (literally a Swiss army knife)JoesSandboxVirusTotalAbuseIPDBCisco TalosLLM for Snort/Suricata rule building (VERIFY)Shodan.io (seeing outside in, sometimes they do lifetime sales)gpt.censys.io (same as Shodan but prompt based)I have more tools that I use on a less frequent basis, but these are such good tools. Thanks for posting this OP!I love urlscan.io's ability to take a snapshot of the screen, blew my managers mind when I showed them that. I was also able to demonstrate malicious actors base64 encoding the recipients name[@]domain[.]com to make a convincing phishing page. Caution using it on phishing emails for analysis though; it can cause the user to start getting more spam as \"they visited\" the URI.","Also, CyberChef","Yep. The api is great, even on the free tier. Which is very rare.","This and I’ve recently been using Browserling.","Agreed. The goat","Today years old…I’ve been using virustotal.com - thanks for the alternative. 🤘🏽","Been using it consistently since I started this career. Simple, go-to tool with some great filters if you want to start doing some open-source recon.Shoutout URLScan.io!","I just used this today. It's fantastic.","The ability to view the DOM is underrated too","Our org had a sales pitch meeting with Mimecast to showcase off their Email Security Cloud Gateway. One of the highlights was being able to look at snapshot of when you click on a URL without engaging with it directly on host. Hmmm... lol","I 100% go for urlscan.oi when doing any search on an url.We bought licence for our team members to work and shared our hunting.The API is nice even on the free tier.","Trustifi URL Defang deserves recognition for all the seconds it has saved.https://trustifi.com/url-defang-tool/","I pretty much permanently have a tab somewhere with URLScan open.","If they add an AAAA record I might.","I never knew that existed. I built a very similar tool many years ago and just shut it down a few months ago when I moved all of our servers. The HTML on mine was searchable though, doesn't seem to be on here at least in the free tier. Shit, wish I would have monetized it now","I love URLscan! One of the few that lets you do private scans for free. Its only weakness is Cloudflare Turnstile.","RemindMe! 1 week \"Security Tools\"","Hybrid Analysis is great as well"],"points":224},{"text":["KnowBe4 - User clicks vs. spam filter clicks","We just went through this (although with O365 and not Mimecast). When the spam filter checks the links it does so from a fixed set of IP addresses in a data center somewhere. You can set KnowBe4 to ignore clicks from those IP range(s). It's under Phishing --> Ignored IPs.","You need to whitelist the KnowBe4 ips in mimecast. There is a KB article on the KB4 website. You can also do the same for defender for outlook or whatever its called now. One issue we are having separate to that is if a user opens the fake phish email in the apple mail app on iphone, it does its own separate link inspection which counts as a click. For that one you kinda just have to use context clues to decide whether to count it as a legit click or not.","There's a mimecast documentation page on the knowbe4 website of all the different locations you need to poke exceptions through it.https://support.knowbe4.com/hc/en-us/articles/219932568-Whitelisting-in-MimecastI had more trouble with o365 because Microsoft changes where things are and how they work every few months so it will work for 6 months then suddenly a campaign will have 100% clickers and I'll need to go through 365 delivery settings again."],"points":11},{"text":["Is OWASP membership worth it?","Do you have a local chapter? an active chapter is what makes a difference and what type of events they do monthly"],"points":0},{"text":["Many failed before. Will YOU complete the trial?","A black hole is a region of spacetime where gravity is so strong that nothing, including light and other electromagnetic waves, has enough energy to escape it.[2] The theory of general relativity predicts that a sufficiently compact mass can deform spacetime to form a black hole.[3][4] The boundary of no escape is called the event horizon. Although it has a great effect on the fate and circumstances of an object crossing it, it has no locally detectable features according to general relativity.[5] In many ways, a black hole acts like an ideal black body, as it reflects no light.[6][7] Moreover, quantum field theory in curved spacetime predicts that event horizons emit Hawking radiation, with the same spectrum as a black body of a temperature inversely proportional to its mass. This temperature is of the order of billionths of a kelvin for stellar black holes, making it essentially impossible to observe directly.","All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....","Wait, you actually opened the comments? Are you stupid?","The world would be such a better place without you people in it.","this you?","nice","son ellos","with many on the title this is a juicy clickbait .","who is upvoting this why","Wasn't expecting comments on this","Techbible is your go-to tech community. Ask questions and get expert answers on all things SaaS. Stay updated on the latest tech news, discover trending tools, and share your tech stack with the world. Don't Forget to try it out.https://techbible.ai/","wow"],"points":7},{"text":["Who will you work for?","I like smaller vertical market businesses where I can make a significant impact. 100% remote only, been doing that since 2012 and not going back.","I like working for non-tech companies. Less competition and head butting, more opportunities to learn (both the technical and the business).","Id try big 10 or other major universities, large community colleges, city/government jobs, and the feds.","Depends if I'm already employed or not","Government IT.I work in civil service, not as a subcontractor. I didn't have to sit through 50 different interviews. I was evaluated based on my experience and education, not my education alone. I get to work with fun toys that a lot of people never see. I have ample opportunity for promotion or sidesteps. The pay is significantly below private sector standards but I have decent benefits, a decent retirement package, and solid job satisfaction.And most importantly, my job is a part of my life, not my entire life. My day is over at 5. I spent my evenings and weekends with friends, family, volunteering, stuff that's important to me. If something happens after 5, it's the other guy's job to deal with. If they need me to handle something, it's overtime or additional paid leave. I realize this is deemed \"lazy\" by today's hustle culture, but keep this in mind:The only people who will remember all those 80-hour workweeks you put in are your family. And no matter what fluffy marketing material HR cranks out, your employer does not think of you as family.","I really like the company I work for right now. Mid size commodities trading firm. Great coworkers, interesting field, interesting but outdated software that they have to use to trade. It’s all just a fun mashup of different areas of tech. Won’t be leaving for a while as I’ve been exposed to so many aspects of security here. Pay is not amazing or Amazon level but the experience is worth it.","I work for a Security software vendor and honestly it's pretty chill. If you're on the sales side it's pretty brutal but as an engineer you get to work on interesting problems and feel like the underlying subject matter is interesting. You also get exposure to lots of different tech stacks which is good for career-building​However, a lot of these companies have been getting hammered by layoffs in the past ~2 years, which is a rather major drawback","Maybe a weird answer, but i really want to work for GE.Most of my issues with working in IT i think are related to working for a company that can get away with having a 20 year old domain controller that was ransomware'd and a 40 year old business suite that hasn't been patched in 30 years. But by the time you're the size of GE I think those become basically impossible to maintain.They're also involved in all of the electrification projects I'm interested in because I'm a big green nerd.","NSA ;)","Fucking everyone. I have no morales.","Hunter Biden","Tech only. Big plus if their VCs are tier 1.https://cohere.com/https://www.sandboxaq.com/https://www.anthropic.com/https://openai.com/https://www.databricks.com/https://www.snowflake.com/Edit: Security jobshttps://jobs.lever.co/cohere/dd5a9f23-5f1b-49a8-b9ed-c1762acf977bhttps://jobs.lever.co/Anthropic/2051031c-8eb5-48da-83ed-d91ad368745chttps://openai.com/careers/security-engineer-partnershipshttps://www.databricks.com/company/careers/security/staff-security-engineer-assurance-field-security-6784852002https://careers.snowflake.com/us/en/job/6737287002/Principal-Senior-Security-Engineer-Anti-Abuse-Response-Product-Security","Curious about your list. Are you able to share what you’ve discovered? If it’s a burden, disregard this message."],"points":66},{"text":["Wasting talent in GRC?","Your prior expertise is likely benefiting you in ways that are escaping your attention in this role.But wasted or not, the question is \"do you LIKE it?\"If yes, then great.If no, then look for something else.","I just cant shake the feeling that I am wasting my potential and throwing away my technical background because I am in GRC now and I am not going to do that type of stuff - engineering \"per se\", I kinda got fooled and thought I'd be more of an architect, instead I got stuck doing third party contracts and their risk assessments.Hum...If your personal aspirations and skillset are more in line with being a techy, then yes, I guess you are \"wasting it\".It's just two completely different but complimentary fields and mindsets, both working under the \"cybersecurity\" umbrella. It's ok to find out you prefer one and not the other.But I'm sure there are also techies who are also wasting their talent by staying there instead of doing GRC. It really depends on what you want to do and what you are good at.","yup. was me. get the fuck out before ur technical skills become obsoletebeing an info sec analyst as GRC is just fancy wording for security auditor lol; dont get me wrong its easy as fuck money, but so boring.","I spent 5ish years doing IR work before moving to a more consulting role. Current job cycles between months of doing nothing \"technical\" then months of having to remember all of my coding/threat hunting/whatever expertise.Can't speak to feeling like I \"wasted my potential\", but I do know that keeping up to date, even doing simple beginner refresher courses, helps me feel more engaged.","If your goal is to be a Ciso or head of, grc is great. If you want to reach to top technically then maybe look for a move","Any tips on getting into GRC?","Absolutely not. GRC experience will only make you better in any other cybersecurity focus you transition to in your, hopefully, long, and successful career.Are you able to use your technical skills to build workflows and automate some of your workload?When I started, I was green but was fortunate enough to work for a company where I was exposed to every aspect of cybersecurity, including GRC. Of course, I didn't feel fortunate at the time wearing so many hats. I felt more used and overworked than lucky. However, looking back, the GRC experience was probably the single greatest contributing factor to my success as an analyst, engineer, and manager."],"points":10},{"text":["Inside the Massive 1 Billion+ Naz.API Credential Stuffing List","So if I'm reading what is going around correctly this is malware that has been around for a while that scanned and kept logs of emails passwords and what sites it was used in and then that data that's been kept for years has now leaked online. Bleepingcomputer seemed to break it down well https://www.bleepingcomputer.com/news/security/have-i-been-pwned-adds-71-million-emails-from-nazapi-stolen-account-list/"],"points":4},{"text":["Entertaining and building connections with Sales Reps worth it?","Maybe I'm a little jaded because I've been in the industry a long time, but I absolutely do not engage with sales reps who contact me out of the blue. I found that doing so only encourages them to keep pestering you. Some even aggressively so.If they're with a company that we currently do business with, then sure, I will return a call or email because having a good relationship with vendors can often help when you're in a tough spot.","If it's a product or service you're actually interested in, then go ahead.There is little point to subjecting yourself to a sales pitch for a product you don't care about, can't buy, and is out of your scope.","Personally, I don't answer calls from external numbers on my work phone. Only from internal callers. I get spammed with e-mails all the time, whatever makes it through to my mailbox goes to a specific folder, if I see names I don't know I just delete it.LinkedIn, I personally don't really check or mess with unless I'm about to be job hunting.If I'm engaging with sales reps, it is because I've reached out them them about a product I am interested in to meet a specific business need.","Good relationship is a good thing to have. But not at your expense of time and money. You are an analyst,not a decision maker, they gain nothing from you and you can’t make promises. Any sales rep worth their salt will look for who owns the budget, who approves the spending, who makes the decision, and it is not the analyst. So don’t waste your time.","Some certifications allow vendor presentations for CPE creditPersonally I try to cultivate relationships with vendors that I think have interesting products. And I never deal with cold callers"],"points":19},{"text":["New TTPs observed in Mint Sandstorm campaign targeting high-profile individuals at universities and research orgs","This blog details that since November 2023, Microsoft has observed a distinct subset of Mint Sandstorm (PHOSPHORUS) targeting high-profile individuals working on Middle Eastern affairs at universities and research organizations in Belgium, France, Gaza, Israel, the United Kingdom, and the United States. In this campaign, the threat actor used bespoke phishing lures in an attempt to socially engineer targets into downloading malicious files."],"points":0},{"text":["Chrome updates Incognito warning to admit Google tracks users in “private” mode","shocked pikachu face","The change is being made as Google prepares to settle a class-action lawsuit that accuses the firm of privacy violations related to Chrome's Incognito mode. The expanded warning was recently added to Chrome Canary, a nightly build for developers. The warning appears to directly address one of the lawsuit's complaints, that the Incognito mode's warning doesn't make it clear that Google collects data from users of the private mode.","That came as a surprise to people?","Their wording is awful. It does indeed (almost certainly on purpose) make it sound like only Google Websites are getting tracked. Not all websites/history by Google.This won't change how data is collected by websites you visit and the services they use, including Google.","Incognito was never meant to be a private session though....","Google: “You know what? Why do we just go ahead and be evil? The cost is much lower and gives us a ton more power.”"],"points":79},{"text":["Integrating emails for MDE and Google Workspace"],"points":0},{"text":["AMD, Apple, Qualcomm GPUs leak AI data in LeftoverLocals attacks","This requires physical access to the machineand 2 differebt GPU's as it captures the communication between the 2."],"points":5},{"text":["NIST SP 800-55 Vol. 1 and 2 drafts"],"points":0},{"text":["What do you REALLY think about vulnerability management?","I'm not sure what you mean by \"big fancy tools.\"You can do vulnerability management with OpenVas, which is free and meets the needs of most smaller organizations.The thing is that \"Scan the network and patch\" is just the first part of vulnerability management.Because that lets you take care of the things you can take care of.But every network out there is going to return results on the scan that you just can't patch. Because if you upgrade Apache to get rid of that vulnerability, then the web app that is running there won't work because the devs for the app haven't made it work properly with the new version (or whatever).So now you have a vulnerability that's just sitting there. You scanned it, you know about it, but you can't patch it.So now you have to manage it as part of your plan. You document that it's there. You run a risk analysis. You determine if your existing mitigations are sufficient. You add mitigations as needed.And THEN, someone in executive management needs to sign off to accept the residual risk in light of the potential likelihood and impact of exploitation.","vulnerability and patch management is a joint responsibility.The only real way to stay on top of CVE is to use a vulnerability scanner like Tenable.io or Qualys. There are not enough people to constantly chase after CVEs. Even with a large team, it's easy to miss a CVEs if not using a tool. A vulnerability scanner is the only way to go. However, a scanner will only search for potential misconfiguration and missing patches. There are vulnerabilities that are neither misconfiguration nor missing patches. Those are done by humans. In addition, we all subscribe to different forums, so we use those to see what the new vulnerabilities are out there.Regularly. I require that my team (InfoSec) and the system owner review it on at least a bi-weekly basis.A joint effort between InfoSec and the system owner. As a CISO, the responsibility for the system's security falls upon the team that owns it. InfoSec is there to be more of the \"auditor\" and ensure they follow policy and procedures. However, I have always stated that when \"shit hits the fan\" - I don't care about the blame game.For Scanner, I have used both Tenable.io and Qualys. I like Tenable.io better. For managing the vulnerabilities, I use Tenable or Qualys. However, for risks, I have a risk registry.Varies depending on the size of the organization. Also - the more frequently you do the assessment, the less time it takes each time you do it.","I like to think vulnerability management is a check on patch management. Smaller clients should focus on automating patch management and when they are ready, bring in a vulnerability management program to verify that patch management is doing its job.","!remindme 3 days","Have a clear and communicated strategy as far when patching will occur and processes for normal vs. emergency. Make sure you have executive buy-in as you will always have somebody tell you that you can't touch their stuff.Patching needs to happen on a regular schedule, be it monthly, bi-weekly, quarterly, etc. It all depends on the risk appetite of your organization. I think monthly is a fair compromise.Who is responsible, what tools are used and the amount of time it takes really depends on the organization, there is no \"one size fits all\" answer here.","I approach this in a 4 step process. 1, identify assets. 2, credential scans when possible, 3, risk assessment. 4, remediation procedures. You cant get them all, you have to compromise on some, but this is where I would start.","Most vulnerabilities regardless of their nvd score have no impact on the system it was detected on. Which means most scan results have mostly noise."],"points":16},{"text":["Playing with Fire – How We Executed a Critical Supply Chain Attack on PyTorch"],"points":0},{"text":["Secure SMB Protocol Against Malware | Visuality Systems"],"points":0},{"text":["Sysmon 15.12 available now","Maybe this will get updatedhttps://github.com/nshalabi/SysmonToolsI've been looking for an easy to use SysMon config viewer/puller and there aren't too many great utilities out there."],"points":0},{"text":["Why are wages much lower outside of the US?","In Germany, if you lose a job you get 70% of your salary for a year and you're fully insured.Someone has to pay for it.","A lot of the big tech companies are HQ in the US, so for tax purposes it's easier to hire here.Also, a lot of cyber companies have government contracts in and if it requires a clearance, then that's available to US citizens only.","Many reasons. Local economies. Salaries are set by local rates, not just US demand. It has very little to do with taxes or clearance. It has a lot more to do with trust and accountability though.But the salary scales are down to availability, experience, language and the local market. For example, there's a big difference between the US and Ireland, and Ireland and South Africa. Certainly, Cybersecurity salaries are MUCH higher than average pay, including CEO pay for example.Salaries are higher in Ireland than Poland for example, in some cases by 10X but portable skills like IT and Finance see difference of 20-50%Another reason is cost of living. For an equivalent living standard of $300k in NY, I need only $140k in Ireland - cost of food, entertianment and healthcare.Rent of a 2-bed apartment and montlhly healthcare in NY is about $80k - in Ireland thats $25k. Thats a huge difference.Gad and cars are cheaper, food quality is lower in NY in my opinion but ymmv.But the US is a very high cost economy and needs a base salary of $50-70k - which is actually the higher rate of pay in most Western EU countries and the UK. Healthcare and Rent/Housing being the main pain points in that equation.","all tech is like this. i worked at a company that started hiring software engineers in scotland for < $50k salary. another company outsourced to contractors in lithuania, where the average software engineer salary is < $20k. it seems that the big tech money is all in the US.","Because to be quite frank, the US economic engine is just insane. There isn’t another country on earth who does what we do.","Because we need to pay for things like $1,000 epi pens you can buy in Europe for like $5 without any prescription","Step 1) get remote job for multinational while still living in the US.Step 2) moveStep 3) profit!","What foreign companies are you interested in working for? What do their finances look like when compared to US companies? I think you’ll find that US companies tend to generate revenue and create competition that drive salaries in ways other countries do not. Europe isn’t overflowing with innovative tech startups, for example.","Healthcare is 99% absorbed by the government.Go to the dentist for wisdom tooth extraction. Pay MYR10 or 3USD.","I think you just discovered the impacts of socialism.","Because in other countries you have some semblance of social protection. Health care, education that doesn't shoot it's fucking kids, systems that protect the weak. I'd dare to say other countries are more Christian than any organization in 'Merca.And then there's Canada, taking it's guidance from the US...","[deleted]","No one taxes like the USA.","Ironically US salaries are all over the place. I see cyber security manager jobs which basically look like a CISO for medium sized businesses offering 100k. I make more than that as a sr level person at a non tech company that most people would have heard of. Tech companies pay better than my company. Sometimes double!","here in chile you can have a high class life with 20k usd net income per year, the cost of life is lower... As are the salaries","Because other countries have socialized healthcare, that may not always include dental, along with quite a few other services that make it so you won't go broke if you get fired, sick, or something happens to You. Along with ridiculous generous paternal leave, etc.You may get less salary overall, but you get (allegedly) a much higher quality of life.People do the math on these in their own ways usually determine that it comes out to the same financially, but I guess it also depends on what you value.","Because of higher taxes because we like UNIVERSAL HEALTHCARE and stuff like that, also retirement funds are deducted into a government savings account so you don't have to even think about doing that yourself.If you look at the wages before tax (gross pay) and other employee related costs, then the wages will seem MUCH higher.","Because the US exploits pricing on basic necessities like housing, medical care, and food, so the cost of living (I hate that term) is higher. It costs more to get to baseline of [still alive enough on the outside to continue to work].","Because the United States has such a stranglehold on the global economy/distribution of resources that we made ourselves valuable, others affordable, and profit margins to the moon. 😂.I'm not a dirty socialist, but there's really no reason why people can't live well globally and the people who want to work harder or smarter would still be able to earn more than the average person.But instead we have a global economy that thrives on feast and famine, luxury, consumerism, and waste.Say that to the average Fudd American and they will tell you to \"work harder\" meanwhile we have men who own 5 millions years worth of the average salary in wealth.Rant over.","We earn half your wage but are still twice as rich.","Well let me say that COLA can be very high. For example, as in 200k salary will not be enough to living in SF and also supporting 3 kids and wife.","Expats are just privileged immigrants change my mind. People use the term to make themselves feel better than those poors who immigrate","Europe and the UK pay very well - I have often thought about opening an office there.","Cost of living may also be lower too. If you're thinking of hoarding riches and buying properties back in the US think twice. If you want a cheaper cost of living and travel the world and don't mind investing elsewhere double down.","Usually, salary depends on the local cost of living, rent, real estate prices, insurance model etc.","I don’t know where you’re getting that information but I just talked to members in the UK and Australia and they all agree that Americans get paid pennies!","You can’t just look at salaries but the cost of living as well.","The US pays higher in basically all jobs than virtually every other country on earth","Luxembourg pays well","My primary is same day for sick/injury visits, and 2 weeks for wellness visits.I went to a cardiologist with a referral from my primary and got in 2 days laterI needed an ortho consult with referral from an urgent care and got in next day. While talking to another patient in the waiting room, they had to wait 2 weeks for their appt. But it was clear to both of us, my need was greater, so they got me in sooner.Those times you went to the ER, if there was an immediate issue they would have called in who they needed. But since there wasn’t one, or they took care of it, they tell you who to go to and send you on your way.","Its beyond me that some people think that unemployment makes salaries lower. Firstly, not all EU states are Germany or Switzerland. Actually, Switzerland is outide of the EU.NY and California actually have similar taxes to Ireland and Germany, Ireland's taxes kick in higher. Ireland also has a maximum unemplomeny rate just like NJ and NY. NJ is $750 a week and NY, the state with a 1% higher tax actually has a lower weekly max of $550But this aside - the tax and social burden IS NOT PAID by the employer.How Salary scales are set.Salaries the world over are set by demand. Higher salaries in the US actually cause higher salaries elsewhere because the US moves so many tech workesMyth/Logical Fallacy 1If your salary is $100k and your tax is 20% - you get $80k. the employer doesnt pay $120k outMyth/Logical Fallacy 2Some people are saying that salaries in europe are lower because taxes are lower in the US? How does that work?Salaries are set by scales in each country according to jobs and available works or supply and demand.TL;DR - ARGUE THIS POINT:Most people working in Euroep work for European companeis - why would US taxes make those jobs pay less?If the average wage in spain is Eur30k, the taxes at 20% are 20% of that salary - that is NOT dictated by salaries or lower taxes in the US.The High Tax Band IS NOT YOUR TOTAL TAXIreland has a 22% and a 40% tax band - most employees DO NOT EARN THE HIGHER TAX BANDEuropean High Tax bands are NOT EQUALIreland has a lower high tax entry point than the UK or GermanyTAXES =/= Social BenefitsThis is a separate charge and is similar to the US - around 10%","Because we don’t have free healthcare. /s but also Kinda serious.Both doctors and burger flippers in Europe get to live comfortable lives. Not the case in the US, the opportunity cost of being able to get insane pay checks is having less social welfare programs/work benefits, like universal free healthcare, long maternity/paternity leave, and generous leave if fired funded by the country.Highly skilled jobs end up getting compensated higher in the US because the wealth isn’t as evenly distributed. Don’t know enough about EU taxes but gotta imagine the taxes are higher for high earners (or companies paying the highly skilled individuals) relative to the US. someone’s gotta pay for all that.I realize I’m Speaking VERY relatively and making a broad generalizations, obviously this does not apply to every country outside of the US.","Because we essentially started the career field here and at the time there were not a lot of experts around so they could demand decent pay. That aside we also pay for a lot more versions of tax here. Plus we get less guaranteed days off plus almost exclusively fund our own retirement","Including everything mentioned, most EU job postings show after tax (net) income whereas US postings list gross.","Also, Uncle Sam will still expect his 40% even if you’re not living in the states.","Money goes further in other countries that is the simple answer.","❓ 3. Are US taxes higher than in Europe?As for who pays more in taxes, it depends on a particular country. The US has higher rates compared to Eastern European countries (Poland, Bulgaria, Romania, Hungary), but lower rates in contrast with Western European states (France, Germany, Denmark, and the UK).https://alcor-bpo.com/are-taxes-higher-in-the-usa-or-europe/","9 out of the 10 largest companies in the world are American (the outlier is Saudi Aramco), and 7 out of those 9 are West Coast tech companieshttps://www.investopedia.com/biggest-companies-in-the-world-by-market-cap-5212784The United States is only 4.5% of global population. The combined populations of Washington and California are only 0.59% of global population","The cost of living outside the US is in general way way lower. That's a big reason. You're comparing apples to oranges. You can't just do currency conversions it doesn't work that way.As a Canadian I am always flabbergasted at how out of control the cost of living has become in the US. You used to be able to go to the US and save money on shopping... nowadays, outside of a few exceptions, you're usually paying significantly more than we do, for everything from groceries to electronics to utilities, to a big mac. And don't get me started on healthcare costs.Now, I am not including real estate here as that is a whole other ball of wax. I am talking more about day to day expenses.","Because us citizens carries more risk. No risk no brisket, whatever that saying goes. We have no real safety net, and labor protections is suspect at the best. Not until a few years ago, tech workers can’t even switch companies due to non compete agreements that was illegally set up. This place is still a Wild West culture."],"points":556},{"text":["Easiest cert to re-up Sec+?","If you really need to just recertify and run out of time, just pay for CertMaster CE, its ~$130.","cysa","Pentest+ is heavy on nmap. Cysa is your best bet if you want a new cert. cert master for sec+ is the pay to win option if you procrastinate.","Pentest or cysa","From what I’ve read, CySa, and then keep CASP in your pocket to renew em all again in three more years.Personally, I’m going for the Pentest+ right now to renew my Net+ and Sec+ that are set to expire this September.","Cysa. Let me know if you’re looking for a voucher. I’m selling one for 100 less than comptia. I just got the cert 3 weeks ago and my company ended up paying for my voucher after I had already bought mine.","cysa+ is mostly a sec+ plus a little bit extra. certify breakfast cysa+ is probably all the refresher you need (if you even need one).","Fedvte. It’s a joke. You can literally click through the videos if need be and they all count for CEU. fedvte","Why would you even bother to re-up CompTIA bro, joke cert."],"points":91},{"text":["Arctic Wolf Replacement","You could move to Sentinel since you have E5 licenses then utilize an MSSP like BlueVoyant to monitor and tune.","Don't have personal experience but I've heard a lot of Deepwatch clients move to NuHarbor for similar or other reasons.","I also recommend Rapid7 MDR. Their SIEM has unlimited ingestion, you only pay by client. Their SOC has been really responsive, catching pent tests when we forgot to tell them we were conducting one.","We have been happy with Rapid7","My MSP uses rapid7, for what you’d like it should work quite well.","I love this post, AW has been wining and dining me trying to switch over from Sophos.","Blackpoint","I have had a good experience with CYDERES. It's pricey but covers with Chronicle, and that has been one of the best SIEMs I've ever used.","Darktrace is a great product, it's mega expensive though and the sales people are a little overzealous.","Why not LogScale with CrowdStrike for the logs? FLTR is ingestion for the CS agent data","CriticalStart does a pretty good job","If you’re already a crowdstrike shop, why not expand to overwatch?","Why do you feel AW is too passive? What were your initial expectations of them? Are you looking for just another general MSSP?","What are you trying to gain additional telemetry or alerts on? This will guide the answer, as logged in from out of country can easily be done without an additional MSSP.","Expel, Red Canary, Binary Defense"],"points":32},{"text":["Made It To Final Interview - SOC Analyst, What to Expect?","I made a post back when I was making the rounds over 3 years ago for my first SOC positionHere’s questions I was asked and then a mod in this subreddit also posted his question bank as a comment. Hope it helps!https://www.reddit.com/r/cybersecurity/s/FggC5L6Xmr","The technical piece is more important. I wouldn’t worry about being funny, just be friendly.","Is this fully remote? Cause damn that is great pay.","Ideally being able to answer their technical questions and also seem personable will be best. The team is going to vote for who they will get along with best, over someone who knows the most but has an abrasive personality. Being funny at the right moment could help, but don't answer every question as a joke either."],"points":5},{"text":["Too quiet?","We are the same way. I mean if your security program is mature and you've validated and tested to ensure everything is being captured there's not much else you can do.Focus on TPRM and security awareness. If they are going to break in this is how they will do it (3rd party or human error).","Already mentioned but legit pen testing should be one of your indictors of effective correlation/detection/alerting.By legit I mean quality testing over realistic time-frames without a bunch of silly ROE artificially limiting the quality of the testing.","Probability and statistics tells us, random events actually come in clusters. Totally uniform distribution is almost as unlikely as all events occurring simultaneously.Quiet periods happen. But also, maybe it’s holidays in Russia.","Thanks all. Been doing cyber for a long time and have battled some interesting scenarios over the years. I would say our program is \"mature\" from the extent NIST says it is or from the extent the assessor says it is. Pen test, red teaming, purple teaming - check. Training and awareness, third party risk - check though TPRA could be tighter. But you know how it is - we only need to be wrong once."],"points":18},{"text":["Who won't you work for?","Big 4.","Amazon. Never again.","Reading through this thread - if you're new to cyber, don't take these too seriously. I've seen damn near every industry listed.","Healthcare cyber is completely on fire.Avoid, avoid, avoid.","Any MSP on earth. Fuck that whole section of the IT industry.","Friends.Relatives.","ITT: Don't work for anyone in tech, healthcare, government, education, anything that requires security clearance, or really any company that you've ever heard of.","CACI. They lowball hard on salaries. I assume it’s because they cover your benefits. Made a rule in my email account to automatically throw their recruiter emails in the trash if any come my way.","Any big 4 company.","[removed]","Cloudflare.","Law enforcement, specifically for digital forensics.I don't want to get exposed to material (CSAM, gore, etc.) that can potentially send me to therapy.I admire those who work in cases involving such material since they're doing good and necessary work, but I personally don't think I could do it.","Most start ups. Zero organization or desire for any.","I have very few industries I won’t work for. I’ve been able to work well in a wide variety of work cultures and industries.I do, however, have a short list of leaders I will never work for. Some really toxic executives out there.","Whoever pays the highest. Zero f's.","I’d need a really high compensation package to consider doing work for Private Equity again. The merger/acquisition side has ridiculous timelines for tons of work, and really by time the acquisition gets settled with the technology cutover, Private Equity is trying to sell the company off so you get to help undo and guide the next buyer’s strategy.Plus, Private equity VPs are some of the most demanding pricks I’ve ever worked for, and I spent multiple years working with lawyers","Starts with a z ends with a scaler","Tiktok, you blackball yourself from jobs and alienate yourself from some of the industry.Edit: not as widespread as I originally stated, just from what I've seen happen and heard through leaders I've interacted with in public and private","Almost all Chinese corporations, but more specifically recently got contacted by a recruiter about working at Shein (fast fashion); the money was excellent but I told him I couldn't in good conscience work for a company like that.","I want to stay away from being in contact with criminals or criminal activity. Mainly due to relatives working in corrections and how it can take a toll on you mentally. Anyone have any experience?","TikTok. To know I enabled a Chinese psyop would force me into an early retirement out of shame.","Anything that requires a clearance.","IBM","Retail, pay is trash and they overwork","I started in an oil company and I think so far is the best decision I have made. Before I was with a service provider.Definitely I would avoid government. Is funny that when I was younger I wanted to work for the federal government.","Government and government contractors","Turned down $250k to work at a company in the gambling industry.Just felt too sticky and disgusting to profit from what is many times exploiting addiction.","Any place with less than 10 people on the security team.","Managed Security Services (MSS) can be frustrating as it often involves more affordable contract work for a bunch of clients, essentially allowing those who hire you to avoid constant desk duty responding to alerts. What's more challenging is the need to log into different environments for each client, dealing with various EDRs and SIEMs. While it does offer exposure to a variety of setups, it often leads to alert fatigue due to the high volume of notifications.","Defense actually isn’t that bad. Good job security and the pay is alright. You don’t make a killing but you’ll do well. You get to deal with security problems that others won’t and constantly are on guard for some of the most sophisticated threat actors in the world. It was a rush and I’ll end up going back at some point.","Discover bank.","It might be easier for me to list organizatoins that I would work for.Finance industry is out - spent a few years there and the demands are unreasonable and the executives are, largely, extremely horrible people. Doing corporate forensics for and on them made me realize how spot-on the media caricature of evil banking CEOs really is.Telecom is out for similiar reasons.I'm getting older and no longer have the energy to work for MSSPs, vendors, or large tech giants who are well known for working their employees into the grave.So... medium-large sized companies with good executive leadership is my preference. I'm partial to non-profits and healthcare, but it's tough to find one that wants to do sensible things with their technology.","Morally: oil, big consulting firms. I've spent some time in both and came away thoroughly disgusted with the industries, and have come to consider them overall negatives for the world.Quality of life: healthcare, education. We know why.​Reverse: I'd love to try work in infrastructure at some point. I know it's got some of the stink of government, and some of the stink of underfunded private sector, but Russia's attacks on the Ukrainian power grid in 2014 are part of what got me interested in security. It'd be nice to help prevent that at home.","Debt collectors and organizations directly supporting that industry.It's not an activity I want to be affiliated with in any capacity. The pay scale or job responsibilities are irrelevant.","Accenture, no way.A few year ago I was working on a contract for them as a Linux systems integrator/engineer. My boss had 4/5 Linux, very skilled and extreme work ethic. This person regularly clocked 60 hour weeks while managing a whole team and pulling on-call duty. Most companies would've wanted to clone my boss a dozen times. Accenture fired them for being too expensive, they were making $85K. If you can't keep someone who's very skilled and working their guts out employed then your entire business model is flawed.","Defense. Used to work in that sector and made great money, but the job security is terrible. Many defense companies will lay off personnel and then rehire those positions within a year.","Russia.","Amazon - heard plenty. I enjoy having a decent work/life balance.Federal Contracts - every single one I’ve ever been on has been a cluster.Dedicated pentesting firms - generally fun because you work with a lot of great people, but it’s definitely the kind of job that can burn you out. And in my experience, you’re surrounded by people who eat, live and breathe the stuff and research it on their off time. And that’s by no means a bad thing if it’s how you like to spend your free time. But If you’re more the “I’d rather go fishing after work” type, it’s a little bit harder to truly fit the culture.","Won't work in anywhere gambling/racing related, oil/gas related, or media/propoganda orgs like newscorp/subsidiaries.Prefer working for things that benefit people, like healthcare, public services. Doesn't pay the best obviously, but its definitely interesting, coming up with solutions on limited budgets, usually having much more power to change things than in a large or high profit org.","Meta. The 2016 election and the impact social media has had on people's mental health is a bridge too far for me. Also Zuck as a person is a weirdo his whole VR push just made me feel gross.","Judging from what I have heard from colleagues. Bank's. Everything is super serious, no fun to be had, no joking around, nothing. That doesn't fit my personality.","Private sector, never again. I am staying in Public Sector / Government work. I work a 9-5. That’s enough for me.","India.","Marathon Petroleum, Randstad, Trane Technologies, CapGemini.","Tobacco companies. Disney.","I'd never consider healthcare. Too many regulations and too much risk if things fail. I work in a factory. If the computers go down, it is a little more of a struggle to make widgets and we may make a few less widgets that day. If the hospital computers go down, people could die.","The banks","Monsanto","I’ve done oil, my ability to sleep improved when I left.","I've worked for defense and I miss the pay rate and the every other short week. Everything else was mehI'd never work for MS, Google, Oracle, or any of the formerly stellar companies that they bought out and destroyed","I won't do government contracting, oil, mining, fraking, credit bureaus, or companies that spy on normal citizens.","Elon Musk. Edit: love what his companies accomplish but would never work for him.","Big 4, DoD, and Palantir.","Any triple letter agency 😅","US DoD - they should hard offload info/cybersecurity to contractorsHospitals - mild ptsd causingHealth Insurance providers specifically but insurers in general - you havent seen tech debt til youve seen these folksSmall US Universities - higher ed is crumbling and these will go first. They seem to always want to label themselves as \"special\"","Oil or any of its feeder businesses. Been there, done that. The money is better but the ethical issues I have with the industry outweigh that.","Shit all these people saying anything with a clearance has me wanting to go back into cleared work. 😂 I should be asking for a lot more money, clearly.","Indian managers","The general consensus in this thread: there is no company worth working for, just be homeless","Government. Just don't want to be a part of that system.","Why would you rule out two entire industries where there are a ton of security roles?","Defense 100%. Loads of military contractors in my area but I want nothing to do with a company that produces weapon systems.","Boeing, good starting point but honestly not a good place overall.Based on what I saw, I would go ahead and say probably the whole avionics space, except Rolls Royce, the little work I did do with them, they seemed higher quality and workers didn't seem stressed. Would be interested at working directly for the FAA, but I question the pay they could offer, but that is mainly cause government shouldn't be overworked.","CGI","Financial sector (Australia). Too many regulations and weekly audits.","Apple and Tesla","PwC - It's a cult","Dark Army, White Rose or Ecorp","Maybe it's preference but I prefer smaller companies. Any company large enough to have a corporate culture and ideology other than 'get the work done' is not for me.","Crypto - hell no, too much risk. Of all the industries that seems like the biggest house of cards ready to fall, at least for an IC role at a single company.","Accenture","AWS","Banking. I'd rather not say why but I'm a data engineer/software developer.","Fortra. I’ve heard horror stories about their treatment of workers and the illusion their software should provide. Also, 2 sysadmin friends quit after being tasked with administrating one of their products.","Anything defense, and most social media, also fuck Ebay in particular.Not that I could get roles at most of the large orgs in those spaces, but just hypothetically speaking I wouldn't feel good knowing that I was working to help them and accepting their ill-gotten gains.Adding in a who + what: I think for the most part I'd avoid Analyst roles at most MSSPs. Nothing inherently wrong with those companies or roles, and they're probably great as a first role in the industry to build experience. I've just never experienced more burnout in my life than when I was scrambling to work alerts from across a shitload of environments for 10 hours straight every day for 6 days a week.","70% of places will be good. But the following industries might be closer to 50/50:Healthcare (they don’t pay nor take cyber seriously)MSP/MSSP (meatgrinders)FAANG (but you’ll get paid big for your pain)Big 4 (you’ll get paid a little for your pain)That said, you still have a 50% chance of liking the bad industries.","video game companies tend to attract the most horrible human beings in IT Security, and sometimes they also turn the nicest people into horrible human beings.",""],"points":2069},{"text":["Project Ideas for MSc Computer Forensics and Cyber Security","See related:https://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oyt7a/"],"points":0},{"text":["Edge - process creation log"],"points":0},{"text":["Seeking Insights on Qlik Sense Vulnerability (CVE-2023-41265) - Discrepancy in Pentesting Results","are you using any burp extensions to smuggle http?"],"points":0},{"text":["How detailed do you get with your playbooks?","The ones I write are more detailed (similar to the second example) but that’s mostly because the analysts on my team have a wide spectrum of experience and I don’t have much autonomy on who gets hired. That, and it removes a lot of plausible deniability if I catch a mistake during the QA checks.","High level and only detail where I think it needs it. You should already have qualified staff that understand how to execute the steps. And you would have tested the playbooks as well ahead of time.","High level, however I either add an actions template to the runbook or a ticket template for each runbook which would link out to a guide on how to. They serve as reminders to a) do each step required for experience folk that know what they’re doing but may overlook a step accidentally and b) for in experienced folk that may need additional documentationFor example “Block IP address in X” would either have templates on how to request these with the relevant teams (email, tickets etc) OR how-to guides on access portal(s) and where to add the indicator to block. To note: these would be linking out from the runbook or ticket template. No one needs a 30 page doc to triage phishing!","Playbooks cover the high level process. An example in a malware detection playbook would be “Scan Malware for IOCs”.Runbooks cover step by step detail. An example in a malware analysis runbook would be to “Right click the file, hover over 7zip, go to CRC SHA, and find the SHA-256 hash. Upload the hash to virus total and see if this is a publicly known sample. If it has been uploaded, go to the Relations tab and view results”.You may need a few different runbooks to carry out the actions in a single playbook. Playbook tells you what to do, runbooks tell you how to do it.","Mine are specific to the tooling the organization has. I have been doing this for multiple companies over the years, they are def some what different depending on industry trends and user preferences.","Playbooks are shelfware, only there so you can show them to someone who requires you have them for an audit or something. There is no need for them to be fully detailed.","I do mine at a high level, and provide links to \"work instructions\" if there's any chance of ambiguity causing an issue for a specific step.An example would be me creating a work instruction on how to pull an email using DarkTrace, with the phishing response playbook stating that any malicious emails need to be pulled and linking to that work instruction, rather than writing that in the playbook. When it comes to what I would say needs analysed in a potential phish email then I give a list of bullet points as a baseline minimum, and state that clearly.","What are IoCs?","I write them as step by step, with screen shots. I think of it as a way to reduce pain points, both for the employee and their escalation.","Ideally you should have a How-To guide on hand to walk through how to execute certain procedures in your environment. Sure, someone might just tell you to \"block this IP\" or \"exclude this process\", but how you do those things at Aperture Laboratories are going to look very different than how it's done at Black Mesa."],"points":13}]