[{"text":["Cybersecurity Supply And Demand Heat Map"],"points":0},{"text":["dark web data breach monitoring","Ask cia"],"points":0},{"text":["VMware confirms critical vCenter flaw now exploited in attacks","Sees headlne, \"oh no, what happened?!\"VMware has confirmed that a critical vCenter Server remote code execution vulnerability patched in October is now under active exploitation.Oh, well yea thats on you if you havnt patched in 4 months....","Due to its critical nature, VMware has also issued security patches for multiple end-of-life products without active support.VMware wants to know who is running EOL product so they can harass you"],"points":23},{"text":["ISC2 ISSAP, ISSEP, CSSLP","nope","I wouldn't bother with these ones.","Unless your job specifically needs them, not really worth pursuing","IMO CISSP is a nice one to have if you're doing anything in GRC. CCSP IF you're also doing cloud. ISSAP I know one or two architects who got it and were moderately pleased with it"],"points":1},{"text":["(Somewhat) Affordable SIEM Options","Wazuh, but I've never seen anybody properly implementing it. There's a live stream or short video about it from TCM (The cyber mentor)","What business problem are you trying to solve?Elastic is a free SIEM but if you want more than just a SIEM, that's when the paid licenses may be required. You also have to think of the cost associated to hosting it yourself as well as the time required to maintain it.","Small org + managing your own SIEM = headachesThis is one area where (in most cases) outsourcing is better. Consider evaluating the market for a better managed SIEM instead. There are plenty of MSSPs that have well priced offerings. You don't need to go to an OEM. In fact, I'd lean towards an MSSP.","You can go for the Elastic stack but it requires a lot more work to be implemented as you don't have the vast amount of apps and connectors that Splunk has."],"points":4},{"text":["FAANG vs GovTech | Which should I head towards?","If you want money, FAANG. If you want cushion and low pay, govtech.Low is relative to the beholder, though.","Depends on your age and circumstances. If you're younger, a job at a FAANG company may offer quick financial gains and an impressive addition to your resume, though there's a risk of being laid off. For older individuals with families and mortgages, a government job can be more appealing for its job security, as these positions require U.S. citizenship and clearances and are less likely to be outsourced abroad.","Which part of the Government are we talking? are you looking at NSA or HUD? Those look VERY different on resumes, and impart very different skils.","You can always go from faangto to govtech. You can start with the golden handcuffs make money then get stability layer","Not much to add on my end but I would plug working at FAANG at least once to understand how lots of programmers work together at scale. I got great fundamental skills working within a team of people that were smarter than me.","FAANG has been laying off a LOT of people these past 12 months. CEO of Google just said they are expecting another round of layoffs.","I think you're misusing the term GovTech then (this hyperfixation on trying to make everything \"tech\")True gov/defense tech pays just as much as FAANG if not more, and you will have more stress and less security. Anduril, Shield AI, Scale AI, Palantir, and a whole bunch of startupsIf you're talking legacy defense contractors like Raytheon, LM, BAH, GDIT, there's nothing tech about themIf you want to coast in life and just want an average life, go with the defense contractorIf you want to actually do stuff that matters and change [whatever matters to you], go the tech routeNo route is better than the other, it's all what you want in lifeDefense-tech companies modeled after Bay Area tech companies like Anduril have already started to and will continue to change how defense acquisitions works. There's a reason that tier 1 JSOC and intelligence community are allowed to acquire outside of normal DoD / government acquisition channels (and why these Defense-tech startups exist)"],"points":12},{"text":["Recruiting pipeline targeted through fake offer letters that ask for bank account details","If a domain is proven malicious (mimicking your company’s site, unauthorized used of logo, etc.), there are services out there that can help you with site take down requests.","Never give or accept money from a potential employer and don’t give them your bank info until you’re hired, meet your coworkers, and begin onboarding. Legitimate companies never ask for your paycheck info until after your hired and you begin onboarding. Even then, they don’t “ask” for it, you log in to the HR portal and enter it yourself.A legitimate company will always interview you face to face (or over zoom/webex).A legitimate company will have you complete a background check with a 3rd party background check company like BIG.They will never require you to purchase your own equipment/supplies, they’ll send it to you or you’ll pick it up in person.It’s also very unlikely a legitimate company would conduct the whole interview process over email and any emails should come from a real company address. Verify the official address by looking at employees on linked in.Also, check out the company on linked in and look for recruiters. Odds are they have posted contacts and info on avoiding scams.When in doubt, call the company (get the number from their official website) and tell them you want to make sure you’re not being scammed by an impersonator. You’ll never hurt your prospects by doing this and if it feels fishy, it probably is."],"points":0},{"text":["How to Rank Vulnerabilities in a Large Environment","‘How easy it is to exploit’ is a factor to rank vulnerability.","Information about the CVE is great, but I'd say no matter how you rank a vulnerability using all of that data, the only thing that can help you prioritize which ones to fix is a lot of context and correlation with other factors.- Is the asset publicly exposed- Does the asset contain or have access to sensitive data- Does the asset contain a useful secret (credentials, certificates, ssh keys, etc)- If it's a cloud asset, does it have an identity that could lead to lateral movement or account takeover- Assuming the asset gets compromised, what is the blast radius? What other assets are reachable by this asset?- What is the source of the vulnerability, and is that source in use in other places? Can I fix 100 instances of this vulnerability by fixing and redeploying one image?- Did the developer put a mitigation in place for this CVE already?- Does a fix for this CVE exist?That's just a short list. By the way, this is exactly what a CNAPP (cloud native application protection platform) like Wiz and Orca does for you.","EPSS + something to assess how critical the asset is, eg CVSS4.","Just use this https://www.cisa.gov/known-exploited-vulnerabilities-catalog","Should be risk-based. Start with the risks to business critical assets. If they go down, that = “no money” = “no job”.","The true risk of being exploited is the most important. We have a lot of high severity vulnerabilities but in reality the risk is low because they are not on machines exposed to the internet, so it’s more important to patch a lower severity vulnerability on an internet exposed machine in most cases.It also matters what data is stored on the machine and what lateral movement opportunities are associated with that machine. If we’re talking about a test server on an isolated network then honestly who cares?!","Use CISA KEV as your source of truth, no further prioritization needed, check out services that focus on it like www.oncyber.ca/paas.html or use a RBVM tool like Vulcan.io","Is it in the environment, is it forward facing or accessible? what is the attack path and complexity of attack? What is the mission impact of the affected software/system?Severity and patch difficulty should come last. While the vulnerability may not be severe it could be leveraged in some way as part of an attack.","Those are great factors. I might also include if there are any other mitigating controls such as a WAF in place providing protection.In any case you've got the right idea that you really do need to add your own context to figure out the priority.","It's important to think about the risk and exploit being available and exploit being actively utilised are really important as is the location of the device, if it's internal then you will have a number of mitigations and controls in place so focus on those internet facing services first.EPSS is up and coming and is another way of prioritising as it gives you the probability that a vulnerability will be exploited whilst not perfect, it should help as another method if your faced with thousands to fix.You can make this very complex or keep it simple but effective and you can waste time focusing on critical cves on internal systems while you have high rated ones on internet facing.","Would add: - exposure of the asset - is the affected asset part of your control plane e.g. VPN, EDR etc","Another angle is how easily the vulns can be mitigated. Say its a low score but trivial to patch and no extra burden on the IT team to do it, we knock those out priority. If its a completely manual patching process, or even \"unpatchable\", then we pretty much only glance at those for any criticals that are exposed/exploitable, then move on. We need action, so we find the most progress when we focus on actionable items. This all heavily depends on your org and the maturity of the program overall.","Google Cyber security risk assemmet matrix. You categorize everything you know and you determine the overall risk. You start with the highest risk stuff and work your way down to the lowest risk. Sometimes there's super low hanging fruit that can take your stuff high to medium/low risk by just enabling settings in software you already have. For example enabling 2fa is a simple fix that can knock down the probability a point and in turn lower your overall risk.You have to remember when doing these type of risk assessments is if everything is high risk then nothing is high risk so you have to be realistic."],"points":19},{"text":["Technical Deepdive of the Okta HAR Breach"],"points":0},{"text":["How do I gain NIST experience without having NIST experience?","Study NIST enough so that in an interview you can say something like:k\"I haven't needed to use any NIST frameworks, however I would implement similar to how I've implemented <x> in the past. For example in <specific NIST doc> the section on <something> I would implement similar to <similar bit from framework you DO know>\"","Is there a specific NIST SP that you are being asked about? 800-53, 800-171, RMF in general? I would imagine that you could do a crosswalk between the frameworks you are familiar with and identify the similarities. Maybe explain that while you aren’t experienced directly with NIST you have put in the legwork to find how your experience can map to what they are requesting. Obviously just an interview tactic to say while I don’t know the specifics of X, my experience in Y is attributable.","Reference SCF (free) and look for overlap between the different NIST standards the frameworks you have worked with. It’s not like the assessment process differs, it is just different standards. But when you look at PCI or whatever standards, there is a lot of overlap.","The frameworks map to each other almost completely…https://www.auditscripts.com/wp-content/uploads/dlm_uploads/2016/04/AuditScripts-Critical-Security-Control-Master-Mappings-v7.0d.xlsx","In interviews I like to ask people to describe their home network, and do a mini adhoc assessment and talk about some of the 800-53 or 800-171 controls they either applied or would recommend applying and why.You can take this a step further and build an actual home lab and practice auditing it and remediating findings. You don't even need to buy anything, start with what you already have and maybe some lightweight VMs.If you can even automate the remediation using a configuration management tool like chef, puppet, or ansible companies would love to see that. These days some cloud configuration automation is great too such as terraform. But these are all bonus items on top of what you asked.","Read and study. If you can speak it your in a better position. Heck, if you read it then you’re better off than most the people that supposedly practice it. I’ve never seen any company put in the investment to follow RMF as written.","Ask your business connections for an audit plan.These include the focused items for review and audit finding/conclusions support. Review it against the actual framework. Begin to review remediation steps for a wide variety of each control you're reviewing and see if it fits the context of the scope of the audit elements.If you want to really understand the framework, it's about understanding of how the org uses the control against the results produced. Policy and process alignment is another element to ask those who would supply the information.There are lots of frameworks which are aligned to NIST so remediations are plentiful. Use these to help give options best suited for tracking and follow up with notes to support the next auditor.","Absolutely. I work for a Cybersecurity Training Platform and I can tell you that anything you need to know about the NIST Framework is available with a simple Google search. Study it a good bit. As with MITRE or any other framework, it can get granular. You do not need that level of understanding, just be able to relate some of your knowledge to the framework allowing the interviewer to know that you are familiar. You can also find relationships to frameworks you do know, ie. MITRE ATTACK and speak to it as I have had much more familiarity with _________ framework, but I understand some correlations such as ___________.","What exactly are you expecting?Its a framework - read the latest document - https://csrc.nist.gov/pubs/cswp/29/the-nist-cybersecurity-framework-20/ipdIf you haven't worked at any organizations that have used it, well there really is no way to make up for thatUnless you want to use the current framework and apply it to a fictional company how you would implement it","Fundamental to NIST is that everything in it is cherry picked from \"informative references,\" i.e. other frameworks - ISO 27001, SP 800-53, COBIT, etc.","Not fear, you must! To whomever what you describe is actually a letdown and (the only) reason for not hiring you is not an expert IMO. Yes all the frameworks and standards do have their “specialties”, but with a good foundation with other standards, you will just need to actually read and pay attention to any particularities. Come to think of it, saying NIST is like saying ISO. Is it the NIST CSF, RMF, or other more detailed stabdards like 800-53? Also, this order may be a good compass for you to start… good luck!","Find a mapping to NIST 800-53 or 800-171 from whatever standard or standards you’re accustomed to. Then use that to explain the relationships between controls and requirements. There’s nothing earth shattering in NIST.","Study and pass the CGRC","Pick a framework you’re very comfortable with, and map the controls to the corresponding NIST controls."],"points":87},{"text":["How in the flip do I get a security clearance?","A lot of times of times you just need to be able to successfully get a clearance once hired as a condition of the job. You can’t just get a clearance on your own.","You need to apply for a job that is willing to “sponsor” you for a clearance.Not everyone does this. It’s a long process which means they have to pay you for a year even though you can’t do everything they hired you for because you don’t have a clearance, so obviously they prefer to hire someone that already has the clearance.Look for job offers that say “you must have a clearance or be willing/able to get a clearance” as that usually means they are open to hiring you and sponsoring you for a clearance.And no, I don’t believe you can just apply for a clearance.","Apply to fed jobs at https://www.usajobs.gov because they are likely to be the most patient in waiting for a clearance.Also most DoD jobs are not super cool spy like the movies. And a lot of the \"hands on\" activity is done by contractors. Government provides oversight and direction.","Welcome to the barrier to entry for better jobs in the defense industry. You must have a job willing to sponsor you for a clearance to get a clearance. Then, you can use that as a stepping stone to a better job and a higher clearance. Some people are wiser than God, and they will make an exception for that, but that's not me, and it's probably not you.","Raytheon paid for mine... the trick was to get in with a contractor to a contractor like a Peraton or SAIC (there are so many) - they sell your skills and then the cost is paid as part of the agreement. Later when I went back to Raytheon directly - they were happy to \"renew\" mine. As ex-mil you should have an easier time getting hired than I did but you DO need to have skills, experience, and education or certifications that they need. I was in my 30's and had worked Security and IT for years already and I had a specialization that they desperately needed to solve a specific problem.","It's not impossible. It's just clearances are expensive, take a long time to process, hiring managers love a safe/sure bet, and it's easier to hire internal even if legally they have to post out. Just keep applying.","Join the military.","I just wanted to say doing cyber for the DoD is not always cool. In fact it can be boring as fuck. It is often just writing documents to answer 2000+ security controls so a system can get approved. Working for the DoD can make you feel more like a technical writer than a cyber person. The stuff you work on is \"cool\", but the actual work can be mind numbing.","I'm in the process of receiving a clearance through the DoD. I pretty much just had to qualify based on work experience and education. Took a test, interviewed through a couple rounds, and received a conditional offer contingent on receiving my clearance.Depending on your education and work experience, I recommend looking into DoD positions that are open and that you meet the requirements for.","You apply to a federal agency, and they put you through the process. You can also work on the non-cleared side of a contractor and have them sponsor your clearance and transfer over if they allow it.","The keyword to look for is either \"clearance is required\" or \"ability to become cleared\". Usually the second one means the employer will sponsor you to go through the clearance process.Obviously a lot of employers dont want to go through the hassle and will want someone with clearance already since it costs paperwork and money to do. But as others have said, you dont just become cleared as a normal citizen for shits and giggles.","Join the national guard and take an intel slot ot cyber slot instant TS/SCI","Cool DOD job? Oh you sweet Summer child","It’s a catch 22.You need a clearance for a job, you need a “need” for the clearance to actually get one.Most contracts stipulate dollar amounts to get you one if it’s required. Normally companies get a little weird about some of them because there’s multi year risk and they may be difficult to obtain. I’ve heard that’s a concern with MSFT for example, they won’t sponsor some clearances.So just keep trying. Or work public side.","From my experience as someone not from the military, once you're hired by a company, they sponsor you and handle the footwork to obtain your security clearance. During that time, you can work on non-Gov contract work. In some cases where it's entirely Gov contract work, they put you in an isolated area where you can't do much of anything until it clears.","Find a job to sponsor it for you.","You have to either: 1) get one from the military (serve in military/enlist) 2) Sponsored by employer.  They don’t just give them out.For those in the military; you have to have a job that requires one","Join the military, ideally the reserves if you still want to work in the private sector.","Join the military for a cleared position. Specifically, you could join the reserves/NG.Otherwise, yeah, you'll have to get lucky and get sponsored.","Apply directly to an agency.","Super Long route: join the military (active duty)Kinda long route: join a reserve/guard unit in the militaryNot so long (but still long) route: join any shitty job you can find that is willing to sponsor your clearance. Then hop to a not so shitty job where you can make more money with your new shiny clearance","Join the national guard and go cyber or intelligence.","Join Military","Unless you have skills that are in short supply, you may have to take a somewhat undesirable job to get cleared and get your foot in the door. Oftentimes something along the lines of working overseas on a military base as a contractor.","FBI and DCISE both have programs for industry partners to take threat data to their SOCs for confidential analysis. They can sponsor a clearence for you. Your org needs to establish an Information sharing and NDA.","If you are in the DC area, apply to visitor control or some kind of field rep that basically racks and stacks.","Start working for a smaller dod contractor that works on contracts on the Nipernet, then apply your clearance there. Once get it jump to a big one. The work all suck and pay is on the lower side though.","You can join the Air Force national guard or reserves. And if you’re lucky you can do cybersecurity in the Air Force and as your full time job. It’s a good life.","If you get a fed job a lot of the time that organization will sponsor you for a clearance.","OP, are you looking for a specific job in cybersecurity and a clearance? Consider going into a less-technically-inclined or specialized position (but incredibly necessary) to be sponsored for a clearance. Once you receive your clearance, you can jump over to a career field you are more interested and/or invested in.This is how I got mine, by doing armed security for a year (similar to my military MOS), sponsored for a clearance as a consequence of my position there, and later applying for a position I was more interested once I was awarded my clearance.","You have to get the role first, to qualify for the “need to know” prerequisite.Source: me, had a secret clearance in a previous role.","You need to apply for a job that says “must be able to obtain secret clearance.” This means that they will sponsor a security clearance. A lot of jobs say “must have DOD secret clearance.” This means you must already have the clearance and work for a contractor. Apply for the jobs that say “must be able to obtain security clearance.” Once you have the clearance you can transfer it over from job to job. If you get a job that doesn’t require the clearance, you will lose the clearance.Now the process to my knowledge on getting a security clearance is you apply for the job that says “must be able to obtain security clearance.”, they offer you an interview, you pass the interview and you get the job, they then ask you to fill out the SF-86. That’s the form you cannot lie on and it’s 86 questions all about yourself. Once that’s done, you after to put down a lot of references of people that are close to you. My buddy had to put down 20. You submit the form and references. Then the back ground check begins.The company will call all the references you listed as they are seeing if they can trust you. Once this process is completed, they will offer you the job and give you your clearance. Assuming nothing goes wrong.","Get into a government contractor if necessary in a role that doesn’t require a clearance get some clout there with your peers and management make your interest in cleared work apparent and get them to sponsor you.","They'll pay for you to get one so they can fill the billet. Interims usually come through pretty quickly. Until then, you should be able to do unclass stuff.","Easiest way? Join the military.","From applying for Boeing and working there, it’s almost as if they are targeting people in the military, hence with security clearance. I still have mine until 2028. Good luck","What everyone has said, you have to find a company that will sponsor you for the clearance and will get you one. My company just did that with 3 people.","Join the military in an intelligence position. You'll get TS-SCI.Alternatively, apply directly with the Federal Government for various roles-- you'll get a TS-SCI as part of the hiring process.","Apply directly to the feds and not on USA jobs website. These contractors play games. Plus, if you apply straight to the feds you’re not likely to be out of a job if it doesn’t go through for whatever reason.","Apply to one of the dod agencies directly. Work there for a year or two then switch to contractor.","Sponsoring agency and $"],"points":231},{"text":["Is it ever worth entertaining a counter-offer?","I would bail. Your fantasy of having more people and a competent manager is just that.","Business is business man","I accepted a counter offer once, and in hindsight it wasn't the right choice to stay.Now I don't even entertain counter offers. If I was worth paying more then they should've already been paying me that.Though your situation is a little different. If I were in your shoes I'd go with the new offer.","No. Actions speak much louder than words and unless that role is approved and being advertised currently, them stating they will super duper 100% sort it out this time is as valuable as when they've said previously.","I was advised by a senior person, that never ever stay back once you give the notice. Times are gone, when this used to work. You will be under radar and they will replace you as soon as they can.","Never. You've indicated you want to leave, they'll make sure that happens one way or another. Take the new offer, if it doesn't work out then find another one.","If you were worth enough to the company that they are gonna give you a counter offer, they KNEW they were not giving you fair compensation and were keeping it from you. That kind of funding doesn't just come out of thin air. You never accept a counter offer, because even if you accept, they will look for every reason to replace you. You now pose a risk AND higher cost to the company, so every bean counter in the company will be laser focused on you.It's not worth it. You can go to a new place that will pay you more money for less work. Expectations are gonna be lower for the new guy, so you can make yourself look really good while putting in a quarter of the effort and just selling the hell out of yourself.","Unfortunately I don't think it's going to be seen as raising your pay to meet your ballooning responsibilities or your current worth; it's going to be seen as \"we've given you another 20% like you asked for, now it's on you to do even more work to justify that.\" Realize that they're paying you precisely what they've valued you at.​To put it bluntly, If I leave, they're fucked.Well, they're fucked because they've understaffed their company. Any number of things could have happened to you - such as extended medical leave, FMLA, etc. - you just feel the blame's on yourself because you're gaining from it. Blame's squarely on them.My advice; take the new offer, don't entertain a counteroffer, don't look back, don't offer any favors, don't answer any calls/emails.","I interviewed at another FAANG, got an offer then turned around and took it to my employer for the counter offer. Worked out. granted, This is anecdotal and the job market was different during COVID.","I was always told to be careful with counter offers. You showed your hand essentially with the final notice, and while they may try to \"keep\" you. They will be actively looking to replace you.Trust me....no matter what...we all can be replaced .","Yes - In 2021 I got an offer from a large financial institution to work on their Red team. It was roughly 40k more than I was making at my current employer, and I told my boss that she didn't have to match it, just give me X amount (about a 25k raise), and I would stay.She took it and ran with it, and ended up getting my current employer to match what the other job was offering, including higher bonuses.I made it very clear to her that I really wanted to stay, the only reason I was even considering it was because of the money. I love my job and my team, and even now I can probably go make more elsewhere, but I don't want to. They make sure I get a decent raise and bonus every year, and I haven't considered leaving since.","most people would say they aren't great at management if they had resource allocation issues, and there's no guarantee they will hire the right person and learn their lesson.if it was only money and you like it I would say accept. if it's because of poor management I would leave, that rarely gets better quickly.","You have to be extremely careful with counter offers, rarely should be taken. Because usually at that point you want out anyway. If you want out, then leave. Don't stay for the business sake.I have accepted a counter offer and very glad I did. Worked out great and still with the company. But I really wanted to stay, they just weren't paying enough. And upper management (not my manager) didn't want to give me a big raise. Part was because they were a bunch of older guys that that didn't understand IT salaries and thought we were all entry level pay. But with a signed offer in hand they changed their mind (clearly they knew they couldn't lose me). And I've gone up from there in salary and position. It really helped that I had my manager as my strong advocate, he had already asked them for more money before this occurred. So I think my situation is very unique and won't be very common for everyone else.You frame it like \" I really like working here and everything is going well, but I've got another offer I can't ignore. Here it is...\" And hopefully they take it and say they will see what they can do.","Business was running before you and will run after you too. You think they are fucked without you then you are mistaken. They will put a backfill position the moment you put your 5 day notice period. As far as staffing is concerned it’s a business decision and they will not make it if you are already pulling everyone’s workload. Take the 20% and move on. People make more money and have a good time jumping jobs","No harm in hearing them out. See what the counter offer is and then make your decision. If the new job is offering you a 20% bump and you’re critical in your current position then they will most likely at least want to match that offer and will probably go higher.It cost a company a LOT more to hire a new employee than keep an existing one, and if you really are important to them then I’d expect them to make a fair counter offer.","Personally even if I love a company and my team I am working with if resources are short and they’re unwilling to bump up pay while other things are getting upgraded I take that as a sign I should leave for at minimum a year. If you stay you will be watched like a hawk and possible be replaced but if you leave you can reset the power dynamic","I’ve done it twice in 2 companies and within 3 months I’ve either left or started looking","Only worry about yourself, the company never will worry about you. Take the better pay man","It’s the companies due diligence to properly staff all positions, this happens to allot of us in security, dump it all to a one man army. Many better and more lucrative roles out there. Security is at a negative unemployment rating, nothing but options even after massive FANG layoffs etc. I’ve taken offers for my last 3 roles and each time life has upgraded for me. Now work in a no.1 org ;)","If you enjoy where you are, it's possible they could continue expanding the team. I've told employers I got a job offer for X amount and have been told different things. Some have said, \"anything we can do to keep you outside of money?\" And some say \"we can give you that plus more for you to stay.\". Recently had an offer for less than what I have now by a bit but was about 5 min from my house compared to my current hour commute. With that they moved me to mostly remote and I get to keep more money. Doesn't hurt to negotiate if you enjoy where you are at.","Never, Never, Never accept a counter-off. You'll be the first to get fired because they will consider you as disloyal.","Don't take the counter. You're poisoning the well by 'threatening' to leave, and the people involved in retaining you (HR/senior leadership) will hold a grudge. You will be among the first to go if things go badly.That said, I took a counter back in 2007 for about a 30k raise and ended up staying there for 12 more years. I did finally leave after an acquisition and wish I would have left when I had the chance. The next employer changed my entire relationship with work for the better.","I did, and guess what, nothing changed apart from my salary.","Generally people leave a company because they're on they're fed up With the working environment or their compensation is severely undervalued.Sounds like your situation involved being burnt out and a shity manager. If your burnout goes away without the shity manager than use this as an opportunity to get a raise assuming you still want to stay. The way to approach the situation is to go and say I have a counter offer with another company it's going to pay $ I need to know if you are willing to beat the offer and I need to know by x date otherwise take this as my formal notice.","Leave. A counter offer will negate you ever getting more help. They don't take you seriously, so it won't get better, but worse.","Do you really want to stay at an organization that is only willing to pay you close to a fair wage if they are forced to do so? I understand what you mean about the staffing issues fixing your problems, but the organization itself does not care about the stress for staff, and they have made that clear to you.","Counter-offers are not dependable, since labor budgeting tends to be cyclical. If you are paid more than a new hire/promotion in your role would be, then you become a strong candidate for layofs.You should have a 3ish year plan for a paid promotion. When the time comes that you can't get that, you should accept a competing offer for more responsibility and a sizable raise. Better to make a clean break on good terms. If they want you back, they can make you an offer as an external candidate. You shouldn't gather moss anywhere until it becomes really difficult for other employers to outbid your current one.","They aren't going to pay you more AND hire another person. Nothing will change except you'll get paid more.","This is where only YOU can decide your priorities. I will tell you from personal experience that accepting a counter-offer will just keep you rowing in the same boat. If they have not pro-actively stepped up to promote you or provide bonuses and/or raises at the appropriate times to convey their belief in your worth, then they never will after a counter-offer. Also, you cannot predict what kind of manager you will eventually have. Best to stay true to you and what makes you feel worthwhile and productive. It might energize you to give the new company a chance.The more brief a resignation letter is, the better. Be polite and quick: \"Please accept this letter as notice of my formal resignation from my position with [company name]. My final day of employment here will be [date]. I appreciate the experiences I have encountered here that have contributed to my professional development. I wish [company name] continued success.\"","Almost never unless you are just grossly underpaid and that's how you get a raise.The issue is never money, and that's not what you described. Work to live, not live to work. This coming from an old-school COO type that worked 70 hours a week on average.Value yourself and put your health and free time first.","My wife is a career coach and she says ‘never take a counter offer’","1st: Nobody is irreplaceable. Nobody.2nd: You don't owe them anything.Do what's best for you, but if you want an opinion, I'd leave and NOT entertain a counter. Just put in your notice without any explanation other than \"I've found a new opportunity\".A new manager likely won't have much influence quickly. Besides, those financial decisions are probably made above that level anyway. They haven't shown much willingness to make changes so don't hold your breath.","but I’m burning out.No. Leave. You owe them services in exchange for money. If you’re burning out it’s not worth it.Also, I’m really sorry, but put your finger in a glass of water. Now pull it out. See how fast the hole filled in? That’s how long you’ll be missed. Everyone is replaceable. Move on man.","If you are going to entertain a counter offer, there are some things I recommend you do in preparation for that.The new position you have been offered fell into your lap, you didn’t look for it, but clearly the offer is making you consider the hardships you’re experiencing and although you like who you work for and what you do, you can’t simply dismiss it outright.Have a prepared list of your grievances. Feel free to cast the blame on the prior manager (i.e., “I had brought this to X in the past, but feel they didn’t have the company or the success of our section/department in mind when they were here.”) If you think that won’t go over well, then ignore me on this, but you need to set expectations on what success in the next 3 months, 6 months, and year is going to look like.Reiterate the positives: why do you like your role. You’re a great fit and enjoy the company culture, the executive team, et. al.Put a time limit on their response. You know this is something they will have to give consideration and obtain approvals for, but the offer you received has a timeline (shorter than the real timeline), so you will need a written agreement on the counter before then.I had the same situation several years ago and bumped up my income ~60% and have no regrets. My department grew from 3 to 8 since then and I am spending a lot more time doing the things I enjoy and excel at.There’s always the chance they shove the salary at you and can you down the road, but from the sound of it that may be more trouble than it’s worth for them. I also had the benefit of getting along extremely well with my top-level supervisor, so YMMV.All the same, best of luck OP. Let us know how it goes!"],"points":191},{"text":["BehavEye: Advanced dynamic malware analysis tool"],"points":0},{"text":["USN CTI analyst looking for civilian role","Set up profiles on dice.com and clearancejobs.gov.Re-upload your resume every few days on Dice to appear on recruiter searches.Recruiting cycle is tied to budgets which is tied to fiscal calendar. Q1 started January 1. Recruiting gets weaker through the year. Of course there are private contractors working on government contracts - contract awards tend to cycle Q1 and Q3.","A lot of cleared jobs in San Antonio, Texas and Huntsville, Alabama.","Are you looking for a referral?"],"points":3},{"text":["Top cybersecurity stories for the week of 01-15-24 to 01-19-24"],"points":0},{"text":["Those of you who’ve had your data breached or ID stolen, tell me about your experience with the situation","Boy do I have a story for you.I’ve told this at a local conference before, but it’s probably worth writing down. This is the ballad of Jimbo, the man who probably purchased my debit card off of the internet.Back in undergrad (some 6-8 years ago), I was traveling quite a bit (once a semester) and noticed an unauthorized charge to a Kroger for a very even amount of money. Thinking not much of it, I called my bank, they yeeted the charge from my account, all was good.Or so I thought.A couple days passed and I got a call from my mom (a few states away). She asked if there was anything I’d like to talk about and not to be ashamed of anything. Not knowing what she was talking about, and reacting as such, she described 2 packages that had arrived that day that were subscriptions to male bedroom supplements.Wild.I asked her to read the phone numbers off of the packages and id call and get to the bottom of this. Some context here, I’d just come off of 9 months of internships doing incident response for a F500 where I gathered open and closed data for attribution and remediation, and another where I did open source research and social engineering on companies to validate their security structure.So I called the first number and was told in very clear terms to “fuck off” and “we’re not fucking refunding you”. They weren’t nice, but they killed the charges at least.The second company was much kinder. I explained the situation, was also told no refund but to cancel the order I had to validate the email. I gave them mine and was told the magical words “that’s not the email we have on file”.Me: Oh really? What email do you have on file?Them: “jimmy<lastname><birthyear>@<domain>”Phenomenal. We had a lead. I thanked them for their time (after having them spell the email) and immediately threw the email into a search engine. And was greeted with his voting record, confirming his birthday, email, and address.We’re getting somewhere.I poked around a little bit before I had my required philosophy 202 class and went to class, not before telling my roommate (who had just come off of a very well known pen testing internship at a very very large company) what had happened. Clearly we both had the same idea that we had to find more about jimmy, and both went to class, where our other security friends were also. I briefed them, they found it hilarious, and we went to work.We had a hard time googling, but I made a breakthrough on one of the Facebook scam sites that usually claim to have someone’s info but never do. This one, while it wanted money, brought up a picture that was a real Facebook asset. If you’re not familiar with meta assets, they organize all of them by user accounts as folders, and assets as items in the folders (so every asset will directly link back to the account). So using the asset, we now had a Facebook account, that we verified with the voting record. Which he named himself “Jimbo”Jackpot.Over the next hour or so of our philosophy class, we found everything from his twitter, YouTube, Pokémon go, license plate (registered to the address we found), and all the same for his wife as well. Fully doxxed this poor guy.So like any responsible citizen, I called my local non-emergency line to inform them someone was trying to complete fraudulent purchases in my name and swipe the packages from my porch to avoid any alarms (unfortunately thwarted by my retired parents) and gave them all the info we collected. They were stunned that I did this over 5 dollars, and told me there’s not a lot they could do.So kind of an anti climatic ending of the jimbo ballad, but it does sum up how we doxxed a person because they ordered male bedroom supplements to my parents house. There is no moral, but we all had fun and got a cool story out of it (and a practical warning not to put things on the internet).Hopefully this helps (or at least makes you or your professor laugh).","Hasn’t happened to me yet, but the overall jist would be to either utilize your own CTI team (Cyber Threat Intelligence) to comb the dark web to find the extent of the damage or confirm that data is online. Once that is complete you would need to reset passwords on all affected accounts (if it’s all accounts, roll it out by department or similar) while also revoking all access tokens the user has. This will effectively block any actors that already have attained access, and the password reset will sever the attackers persistence. Then, you must find how the identities were disclosed, whether it was a third party or your own infra that was compromised, or if a large phishing campaign fooled many users. Then you must fix this so others don’t have the same ability. Once you get hit once and have large data leaks, others will try thinking you’re an easy target.I’m sure others with a little more experience in this realm can add additional context, but this would be a basic incident response plan.","OPM. Somebody knows everything about me. I got a few years of credit monitoring BS. Nothing has come of it. Yet."],"points":2},{"text":["Vulnerable web application running locally for testing purposes","https://github.com/opsxcq/docker-vulnerable-dvwa","I would highly recommend OWASP’s juice shop. It is gamified and easy to setup.https://owasp.org/www-project-juice-shop/","Damn Vulnerable Web AppbWAPPBad Store","Fire up a vm with the oldest Windows server you can find. Enable IISDon't patch","Grab an old version of Wordpress.","DockerhubVulnHubDVWAMetasploitable [2]NotSoCereal-Lab-more-","OWASP Juice Shop","https://owasp.org/www-project-mutillidae-ii/","SamuraiWTF + KatanaYou can deploy various \"targets\" through Katana."],"points":12},{"text":["CTO at NCSC Summary: week ending January 21st"],"points":0},{"text":["Automating Phishing Email Detection, Reporting and Remediation in Gmail?","We use Abnormal for this. What ever doesn't automatically get caught by our Microsoft setup, goes to Abnormal. If it finds anything malicious in the email, it removes it from the user's mailbox.Only thing I would probably recommend is not sending a \"confirmation\" email back to the user. It will create more noise.So far, between O365 and Abnormal, it's cut our manual labor by about 70%.","Update to postI forgot, we use ProofPoint to create and run phishing campaigns against our employees. I've noticed that they have something called PhishAlarm included which from my understanding covers what I've said. Does anyone have experience using this?","Look at knowB4 phishER"],"points":0},{"text":["Developer perspective: Why Golang is Amazing for Zero Trust","Golang and Typescript gang"],"points":0},{"text":["Where do you cut-off your patch management?","TLS 1.0 out dated","When using running vulnerability scans on the internal network, at what severity do you stop chasing patches/mitigations?Don't use CVSS thresholds to make these decisions. That isn't what severity is to be used for. More importantly, it will inevitably be the wrong decision, and something that didn't make the cutoff will bite you in the ass.There is also the compliance angle. No framework let's you just not fix stuff. Some may allow you to deviate in specific circumstances (e.g. FedRAMP if a third-party vendor isn't fixing the issue) but otherwise they all just give you more or less time.Instead, use Stakeholder Specific Vulnerability Cateogorization (SSVC). It is something Carnegie Mellon's SEI put together (original whitepaper) and its what CISA uses to prioritize response (CISA's implementation, tailored for their mission).Having used it for some time in a real-world setting, it's fantastic. Allows us to prioritize what's an emergency and what is not. You can even just adopt CISA's implementation and see a better response process, though everyone should really start with the whitepaper and tailor their decision tree to their business.Anyways, fix all the things. Use the maximal SLAs (120 days for low, 60 for medium, 30 for high, aim for 14 for critical) multiple compliance frameworks allow, the things that can't be done in those timeframes build a deviation process to manage and track, and then figure out what CVEs need to ignore all thst and go to immediate mitigation, and to what degree (are you temporarily impacting Ops to avoid a security incident or are you just making sure things are fixed ASAP)","We have equipment that still use TLS 1.1 and there's no way to turn it off or update firmware to use a higher level. It doesn't hold sensitive data and can't be used to gain any meaningful information so we accepted the low risk and documented it.From a business standpoint it isn't worth it to spend the money right now to replace it. We reevaluate on an annual basis.You can't bust yourself trying to remediate everything. Look at it from a criticality and impact perspective.","We created our own rating system and baseline. You should be looking at more than just cvss.","We treat critical and high, we don't have resources to address every vulnerability."],"points":7},{"text":["Are 2fa secrets even less secure than passwords, specifically in the event of a data breach?","The 2FA secrets, also known as \"shared secrets,\" are typically stored on the server side in an encrypted form. Unlike passwords, which are usually stored as hashes, 2FA secrets need to be retrievable in their original form to generate One-Time Passwords (OTPs). Therefore, they are encrypted and stored securely on the server. The encryption key used to protect these secrets is typically stored separately.In the event of a data breach, the exposure of 2FA secrets is indeed a concern. If an attacker gains access to both the encrypted 2FA secrets and the encryption keys, they could potentially decrypt the secrets and generate valid OTPs. However, this scenario is less likely because gaining access to both the encrypted secrets and the keys simultaneously would require a very sophisticated attack, and most systems are designed to protect against such scenarios.","TOTP is not the only 2FA mechanism. U2F/FIDO2 is pretty rigid.TOTP shared secrets are not protected against user data breach, however it's not a concern: TOTP designed to tackle different threats and augment password-based auth.I can't say TOTP is less secure than password in general because password most often gets transmitted as is and validated against hash (unless PAKE schemes like SRP are employed). Breach of infrastructure may allow to intercept such password during authentication attempt, and the password itself is secret sufficient to clear password-based authentication. In that sense TOTP is a bit better because intercepting one-time code does not allow to clear TOTP-authentication all the time.","Good question. Have you read RFC 6238?","Reading the related rfcs will help you here. Several assumptions are made in the use of OTP. Yes there is a shared secret. That is 128-160 bits. Significantly longer than a password. The shared secret is randomly generated and assigned to the authentication device and never changed. But by RFC the authenticator device must be resistant to tampering. In most cases this means that attempts to tamper will zero the secret. The server you are logging into is not the authenticator and doesn’t not hold the secret. The authenticator must be hardened and protected from compromise. But since it only communicates with the servers using a specific protocol it can be much more difficult to compromise. In a proper implementation the secret is stored in an HSM and values are generated by the HSM on behalf of the authenticator. The valid number for authentication is algorithmically generated based on the secret and a synchronized value between the authenticator and the device.By capturing many authentication sessions in plaintext it may be possible to derive the algorithm and create a brute force attack, but this should by standard be more difficult than performing a brute force attack on a password. And by standard, the authenticator should block repeated failed requests.The shared secret is supposed to be stored encrypted, decrypted for use, protected in memory, then wiped from memory after use. It is never sent in the transaction.OTP has its limitations, but it protects against replay attacks.There have been cases where the initial seed for the authenticator were discovered which have allowed for the compromise of the tokens. The Chinese did it to RSA. I did it in pentests by compromising the authentication server, but I owned a good portion of the network before that was possible and it was a poorly configured authentication server not the algorithm that was vulnerable.","I think you’re spot on. People here are talking about “encryption” generally, but the remote party needs to have the ability to decrypt the secret to use it. I don’t know how or why storage of something like 2fa secrets would be more secure than storage of passwords or password hashes.The only truly secure 2fa is something like passkeys, where there is no shared secret. But even then there are typically recovery mechanisms that are less secure like recovery codes (which the remote server needs to be able to verify somehow.The only way to get truly secure is for you to encrypt things and control the encryption keys yourself, preferably on a secure hardware token. But, that comes with the significant risk of data loss if you lose the key.","Personally, I hope more online platforms will opt for physical security keys as apposed to other unsecured methods.I am aware of online platforms to this day that still don’t implement a 2FA method, which is dangerous.I do believe physical security keys are the way forward at the minute and will likely be superseded by Biometrics.","I think that depends a lot of which 2fa method you choose, last week there was a huge attack on a banking app, hackers requested and got access to tons of 2fa codes, with them they logged to a lot of accounts and they ended up stealing money, there is no much info about how they did it.","The method matters. If it’s a phishable factor it’s insecure doesn’t really matter if it’s password, TOTP, push, or magic link. 2FA with phisable factors will slow an adversary down but not stop them.FIDO2-based and PKI-based factors are phishing resistant (check out CISA’s report on phishing resistant factors or NYDFS’s letter!) and are the golden standard for authentication security.","If something is encrypted then a plaintext version does not need to exist. You're fundamental assumption is wrong. The server would decrypt it point in time, not keep a record of it in plaintext.Also remember that authentication servers are going to match salted hashes, not the actual value itself. So you don't need to store actual code, encrypted or not, for the password or secret question. You store the hashes. When someone logs in, the you salt and hash the values they give you and compare them against the hash. You cannot reverse a hash back into a password. So the passwords and secret questions can never be stolen from the server because the server never even had them.The server has the hash algorithm. Now it just needs to store the salted hash and the salt. The salt should be kept in a completely separate database to the password and secret question hashes. But people don't. They should, they don't. You're next step to understand this is to research how Rainbow Tables actually work ;)"],"points":48},{"text":["Cyber 60"],"points":0},{"text":["What character traits lend themselves to success in this field?","The ability to communicate with stakeholder in an effective and easy to understand way.","Patience","Curiosity, determination, motivation and excellent communication would be my must haves.","Excellent points by everyone. I would add the ability to make sense of very complex situations. When everyone in a room is only looking at their own little garden and not trying to understand the whole picture, you as the security guy has to come in, get everyone’s perspective and ask questions to further the comprehension of the issue.","Being optimistic, so many people get too pessimistic from the unsurmountable amount of risk they get burnt out from it. How I've dealt with it is by coming to the conclusion that the efforts to fix stuff is on upper management to determine. You just implement what they say to, and always stand ground on how much a thing will take. I've seen people over promise and burn out as well.Last point I will make, don't be a dick. Seriously, don't. Being tech literate is good, but you won't get a job being great if you are nightmare to work with. Seriously. I've worked with too many people like this. Always assume everyone knows little about tech and you are there to educate, like a parent or teacher. Not to talk down to someone."],"points":14},{"text":["Cyber Essentials Montpellier Scope Confusion","What's the server used for?"],"points":0},{"text":["Internal subdomain being discovered","That sounds like a question for your personal scope document, mate?","Let's start withsubdomains gets discovered only because they are using Google DNSWalk me through how you think that works.","Finding the y.x.com domain is one thing. Is it actually publicly accessible? Can you get on the Starbucks Wi-Fi and reach your internal only website? If yes, then the risks are immense, depending on what that site actually is. If the site is not actually accessible but shows up on tools that find sub domains then the risks are much less significant. Ultimately, if the site should be internal only then it should be on internal DNS only and shouldn't be accessible to anyone on the Internet."],"points":11},{"text":["Researchers have created a wearable patch which can receive commands wirelessly from a smartphone or computer to schedule and trigger the release of drugs from individual microneedles","So… can a Flipper Zero release all the drugs? At once?Don’t threaten me with a good time.","\"Give us 0.5 bitcoin or we will give you an overdose.\"","Goes haywire and blows your arm off…or gets hacked and gives an enormous dose of drugs…or addicts find a way to start using it for other types of illegal drugs in public or at work without anyone knowing. So many possibilities!","So we've gone and made Juicers from Rifts an actual thing, cool!","Edit/Select All/Enter","Edit/Select All/Enter","And I have a new nightmare. Wearable “micro needles”"],"points":55},{"text":["Can we talk about pay?","⁠~$65k⁠Cybersecurity Analyst I⁠1 week⁠Graduating this upcoming December w/Bachelors in Cybersecurity — No certifications⁠Medium COL","60kSecurity Analyst INo previous IT experience (2 months on the job so far)Cyber bootcamp, SEC+Low-ish COLJust turned 40 btw","$375kSr Consultant10CISSP, MS, MBA, TS/SCI, Splunk, etc. MCOLTo be fair, I tripled pay with one jump a couple of years ago. Expenses have remained mostly the same.","1) 74k2) Security Operations Engineer3) 2-34) BS comp Sci and azure certs. Taken Sans courses but can't dish out for the certs5) Very high COL area","87kCybersecurity Associate (Big 4 GRC)1.5 yearsBachelors in Cyber, certifications : AZ-104, AWS CCP. Going for my CISA and CRISC.HCOL","230kSr. Security Engineer (GRC focused)9 yrsCISSP, B.S. in Political ScienceBay Area, so extremely high","140kCybersecurity Analyst (really more architecting and engineering)7 years experienceMS in Cyber, 5x GIAC, CISSPHigh COL","~$120-130k TCDFIR analyst2.5 (graduated mid 2021)Bachelor's in both IT and Cybersecurity, Masters in Cybersecurity. No certs.Low-mid CoL city","100k + base 15% bonus (+ 1-10% depending on outside factors) + pension + 6% 401k match. Annual raise of 3-5% (based off of individual performance). Given position tops out at 140~.Senior Red Team Operator (not a consultant, internal only. Incredibly low stress).4 years (only have worked at this F500, no desire to leave, hense moderately low salary for the job role)OS/CP/EP/WE/WP, GNFA, GREM, GPEN, GSP, GX-PT, GX-CS and 2yr in CyberSecMCOL / South Eastern U.S.I could walk any day and find a new job and make 30-50k more. Though, I love my team, wouldn't trade them for the world. It's rare to find coworkers that care about the job as much as you, so fuck it. Until something happens either in my life, or the waters start looking rough, I'll ride it out.AMA","120k + Bonus ( 100% REMOTE non negotiable I don't go to offices or customer sites I work from home 100%)SOAR wizard35+ years of experience.. yes.. i punched cards and programmed with Cobol and RPG II 35 years ago..No formal education nada.. none.. / 12 + certs (RHCE, RHCA, Unix ACE, NonStop Clusters, Load Balancers, Appliances, CEH, Multiple SIEM solutions & SOAR Solutions)what is a COL area ? i live in Latin America","Compensation: ~750k total comp (255k base + 450k equity a year + 51k bonus). My breakdown is 255k base, 1.8m/4 in equity, and a 20% bonus. This is just my first year. This should increase by about 60k per year with refresher equity grants.Current Title: Staff Security Engineer - Tech Lead. Was previously a Director of Security Engineering at a smaller company but moved to FAANG this past year.Experience: 15 YoEEducation: Expired SANS certs and a two year degree.Location: 100% remote.","30k eurCybersecurity consultant & Project supervisor (basically GRC @ Capgemini)2 yearsI am finishing uni (computer science) certs: CCNA and currently working on devsecops foundationNote: I am based in Europe (Spain) and I am TRIPPING about salaries in US. The cost of living is not THAT low to accept that difference in salary","I’ll start:1) 150k2) Security Engineer (vague I know)3) 8 years experience4) no education5) MCOL area","190k plus 10% annual bonusDirector level. SME in many areas and don’t have any people I have to manage.24yrsBS CS, CISSP, PMPFully remote. Been with same company entire time. Very easy work.","125k (been has high as 175k). Money is important but the total package is more important IMO. Give me generous vacation time, easy work, 401k match 7+%, plenty of free time to build my skills, and cool coworkers and I am happy.Cybersecurity engineer (this job has vague titles, I do vulnerability management, IR, manage cyber projects, etc)15+CISSP, GCIH, ITILv3, CICP, no degreeLow to medium COL area","19.5k EUR or 21k USDCybersecurity Technical Specialist in audit department of government agency2 yearsBachelors in IT automation, masters in computer science and management, Sec+, ISO 27k, currently studying for GIAC GCIHI live in the EU, Czech Republic preciselyMy pay is even for Czech Republic low, but that is due to working for the government, where pay is generally terrible. A perk is that the work is interesing, I have access to courses, conferences and international meetings and discussions, which I currently find more valuable in my career. Nevertheless, I don't plan on staying for more than a year.","100kCybersecurity Analyst2 years in Cybersecurity, 12 years experience total in ITB.S in Cybersecurity, all azure security certs, had some brocade network engineering certs but...MCOL area","200k plus all inSr GRC analyst12+Liberal arts degree. A+ Sec+ CCSK100% remote but HCOL","72K + small bonusSOC analyst1.5 yrs, 2 years of internship at much lower pay before thatA+, Network+, Security+, SSCP, GSOCMCOL","$265k total comp. (100% remote)Principal16Bachelors in CyberSecurity (CISSP, CCSP, etc…)Low","90k (plus a bonus which is probably going to be pretty small this year, and some other decent benefits like 4.5% 401k match, etc)SOC Analyst - technically a bit more than a SOC, but I would say 60-70% of my job is IR for external threats only, other 30% is various types of project work, detection building/tuning, etc2 years experience, no prior internshipBS in Security and Risk Analysis (basically cybersecurity light, honestly more of a CTI degree) + GCFAMCOL (decent sized Midwest city, not Chicago)","$330k no stocks or bonuses.Consultant 100% remote, mostly focused on Cloud Security.25 YOE in tech, last 10 strictly in cyber.Irrelevant degree, certification wise I've had lots over the years but allowed them to expire.Currently have CISSP, various Azure and AWS certs.Live in a MCOL","80k + Commission = 110k OTESales EngineerNew-GradBS Computer EngineeringMCOL","~$140,000. I know I'm underpaid by about 30%. Work for a bank.Senior Information Security Analyst10 yearsBachelors in Communications, Information Technology Minor. Got 90% of the way with a Masters in Criminal Justice with a 4.0 GPA :(ISC2: CISSPCompTIA: A+, Network+, Security+, Linux+, Server+, PenTest+ CASPLinux LPII was previously making $175k at a start-up. I'm positive I can make $175-$200k+ at a company that values me a bit more, but I think the world and the economics of everything are on fire and all fucked up.High COL, tri-state area.","120kCyber analyst experienced3 yearsBachelors in cyber and digital forensics, SANS GCFEWork fully remote, live in medium COL","1) 150k 2) IAM/PAM consultant 3) 15 years in IT, 5 in current niche. 4) sec+, a few CyberArk certs 5)medium cost of living area, but it's gone up a lot in the past 3 years.","$175k + bonus which usually totals around $250kSenior Director level in IT with a focus on cybersecAround 8 years experienceBachelors/Master's in Cybersecurity with CISSP, CISM, CISA, CASP+, Pentest+, CySA, and some othersHigh COL area","367k base 440k TC 2. Application security lead 3. 6 YOE 4. Bachelors comp sci & CISSP 5. HCOL - NYC","1 - $106k2 - ISSO3 - Almost 6 years4 - Some college, no degree(getting there), Sec+, CySA+5 - MCOLI'm underpaid. Taught a dude some aspects of the job at a company in 2020, I moved companies in 2021, he followed in 2022 and makes 30k more than me. He's considerably less knowledgeable or accomplished in the career field even though he's an awesome person. Don't undersell yourself. Ever.","1) 53k2) IT Support Analyst3) 1-24) CompTIA Trifecta, AZ-900, MTA Networking, Linux Essentials5) Medium COLNote: Started off as a Jr security analyst this year in the same organization. (Promotion)My pay increase is in the works hopefully should be higher than my current salary. I'll know in the next few weeks.","120kCyber Analyst9 months in Cyber 2.5 YOE Network Admin/HelpdeskMasters in Information Security, CySA+, Sec+, MCSA/MCSE, CCNALCOL","$155kApplication Security Engineer 8, or 10, if you count Geek Squadesque retail experience BS in cybersecurity, CISSP, CCSP, CYSA+, SEC+, plus a few other minor certsHCOL","$175k total compensationSenior Security Engineer16 years experienceA.S. in General Studies, a few small certs, a few of the major ones, and 3 of 4 active SANS certs.Medium, I suppose. Housing is fairly cheap, but if you own then insurance kills you. Utilities are mid. Food costs are mid to high. Car insurance is high. Health insurance would be high if I didn't get it from work.As an additional note, my.position is 100% remote.","144kSr. GRCGraduated in 2017BSBA CISHCOL","140k (w/ bonus)GRC Lead9 YOEBachelors comp sci & business technology mgmt; CISA CRISCMedium COL","1) ~64k2) senior security analyst at an MSP3) ~6.5 years exp.4) BA in economics, CompTIA cysa, sec+, A+, network +5) living in Europe.. LCOLAnyone know any US firms hiring night shift and that don’t mind if their employee is in Europe ? I do have US citizenship .. could use a pay bump.","165k and starting to feel pretty lowTPM in DOD contact work -90% remote10 years in Cyber. Another 10 in IT and 4 in Communications/ElectronicsCurrent CISSP a bunch of expired ones (CCNP, Sec+, Forescout, some Microsoft, RHEL and many more)BSEEHCOLMy first position was as a Unix admin (HPUX 10.2) and grew into the network guy for that ThinNet bus it was running on.","160kCloud Security Engineer10 year’s cyber experienceBachelor’s and CISSPHCOL","190k (haven’t found out annual raise yet. Should put me around 200k+)Consultant5BS, in progress MS, A+, Sec+, 3 Cloud Certs, 5 GIAC certsMCOL","175KSenior Incident Response Analyst5 YOENo degree, GREM, GDAT, GCFE, GCIH, GSEC, CASP, CySA, and Sec+MCOL","$130k TC Manager   15 years   B.Eng., MBA, CISM, CISSP  HCOL  I have prioritized work-life balance over comp. I work 35h/week, zero overtime, minimal stress, and I still have lots of energy for life stuff by Friday.","Senior Cyber Security Advisor.  I do incident response. 170k.   3. 5 in cyber security, 3 in IT, +2 years of cyber defense club in Uni which was very hands on.  B.S. information systems and an MBA.  Some misc GIAC certs work paid for, but unrelated to pay.  Low now, made basically the same in very high COL at a lower title.","110kRed Team Manager/Vulnerability Management10 years cyber, 13 years professionallyAS in Information Security, CISSP, CEH, CPT, Sec+, Net+, A+Low CoL","55kSecurity Analyst2AS w/ A/Security/Project+HCOL","~$130K base, ~150k with bonus. Amazing work-life balance and very generous PTO.Cloud Security Engineer (remote)~5 years security experience, 5 years of Linux and network administration before that.B.S. in Information Systems with a minor in Economics. Certs: AWS SCS-C02 and Azure AZ-500 (I got both of these in the past year). Also have RHCSA which is expired now but never bothered renewing since I don’t do much Linux admin stuff anymore.High COL (SoCal)","130kSr security engineer.25 years in Tech, 15 with cybersecurity products.Cissp, osip, no degree.Med col","$140,000 USDCyber Security Engineer, Sr3 years professional, 8 years blackhatCompTIA Sec+High COL, 100% remote","100k baseCybersecurity Auditor2 years auditing, 8 years ITno degree, CISA, CISM, studying for CMMC RPlive in RI, I think MCOL area","You guys inspire me. I’m not in a cyber job yet but I’m trying to start my journey.$68kLaw EnforcementBachelors in Cyber Security (in progress)Sec+HCOLOne day I’ll move and find a good cyber job!","120,000Security Engineer4 months (lol)Bachelors in Cybersecurity, SANS GFACTHCOL","152k w/ 120k RSUs, 12% bonus.CSIRT Analyst2 years IT, 4 years Cyber (Mainly DFIR)Associates, CompTIA TriFecta, CySA+, Casp+, Ejpt, Edfp, aws solutions architect associate.Medium COL (Colorado)I’m 24","Feels like half the posts in cybersecurity is not about cybersecurity they are just about pay or how to get a job.","1) $122k 2) Penetration Tester 3) 2.5 years in cyber total, 1 year as a pen tester 4) B.S. Cyber Security, GIAC GPEN, Sec +, taking GIAC GPYC in April 5) High COL","145k base + 5-10k yearly bonusSenior Engineer (Microsoft focused stack like Defender/Sec&Compliance/Entra Identity etc.)Just hit 4 years expHighschoolMCOL full remote","1) 45 k€ 2) OT Cybersecurity specialist 3) 2.5 yoe 4) ISA 62443 Cybersecurity fundamentals and Cybersecurity design certs 5) Medium COL","Stock-heavy comp, but at current stock price TC is 430kSenior Security Engineer17 in tech, 10 of those in security.CS undergrad, dropped out of philosophy grad school twice, no certs.Split time between an HCOL area and an LCOL area.","65kSOC analyst L21,5 YOECurrently completing a bachelor's degree in CS Got NSE 4, EC-Council CSA ( shitty cert), going for MS-200 and CYSA+High COLI aim to become specialized and work for a big tech company, government or the financial sector","Base 190k, bonus puts me around 225k.Cyber ArchitectureApproaching 20CISSP and a BS, pursuing a MS, but they have little to do with my position or compensation.MCOL, but remote and my comp isn’t affected by the COL of my residence. We have two tiers… low and high, I fall in the low lol","Disclaimer - I work for a FAANG company.1 - ~150k base, ~70k stock2 - Security Engineer3 - 3 YOE in security, 7 YOE systems admin/infrastructure4 - Bachelor's degree in econ/stats, no certs5 - Very HCOL city (Los Angeles county)Levels.fyi will also give you security role data if you search the SWE data for it.For my next role I'm targeting 180k+ base + equity for a Senior Security Engineer position.","117k annual + 10% bonus 10k shares of stock options vested after 5 yearsSenior Security Analyst9 years Sys Admin + 3 years Security OJT","$220k USD Senior Cybersecurity Analyst 10 MS in Cyber / CISSP HCOL","Information Security Engineer 12 years security, 3 years other ITBachelors of CyberSecurity, Bachelors of IT - Networking, CISSP, AZ-900Medium COLGraduated last spring after interning in my current role for 1 year - during college did 4 other intern type experiences.","150k AUDPrincipe Information Security Analyst (GRC)~4 years' experience in Information Security (not including degree)2 master's DegreesBrisbane so High COL","145K + one 10K bonus AFTER 1 year“Cybersecurity Analyst” (Journeyman)7 YOESEC+HCOL - Honolulu","80 kCyber Security Analyst4 months at current position/ 1 year in the Air National Guard as Cyber Systems Operator (still in part time)Halfway to my bachelor's at WGU. Have A+, Network+, Security+, and ITILv4Med-high COL I'd say","1: 126k2 : Sys Admin / CIRT3: 12 +4: Working on Masters , Sec + . CYSA , TS5: Very HCOL","144kSecurity Analyst III7Sec+/AssociatesMCOL","120k base, Security engineer, 5 years plus 10 general IT, Bachelor in IT, CISSP, Medium CoL","89k salary, 114k total compExploit AnalystRoughly 1 years exp in this realm, about 6-7 in tech supportBachelors, no certsOn the higher end for COL","55kLead Analyst2 years in Cyber - 1 year previous field tech experienceA+, Sec +, cyber sec boot campMed COL","$125k + Profit Sharing + Other Benefits + Remote (there is no office).Senior Security Engineer (the senior part is BS IMO but im a jack-of-all trades kinda person and do all sorts of stuff)15 years in IT followed by coming up on 4 in cybersecurityNo degree or certs. (college dropout)MCOL","$150 (GOV) Enterprise Security Architect 13 CISSP, CCSP DC MetroMy primary focus is cloud adoption/migration, DevOps adoption and implementation, and zero trust.Due to a general lack of knowledge in these areas within government I am more just an Enterprise Architect and drop a lot of the security stuff to pick up more CIO office type work…","190k-200k TC depending, full remoteExploit dev / security researcher/ REAbout 4 yearsComputer engineering degree, no certsLow/medium COL area","[deleted]","$80k AUDIT Risk & Assurance Analyst3 yearB.Commerce (IT/IS), CRISC, ISC2 CCHigh","30k €Cybersecurity Analyst/Junior Cybersecurity Engineer18 monthsBachelor's in Computer ScienceMedium COL","$93kSecurity Advisor / ConsultantTwo years of experienceBachelor in Cyber Security | OSCP - various eLearnsecurity certs, Altered Security and Microsoft.Medium-high COL - High taxes","80kSecurity Analyst II1year SOC analyst, 3 years sysadmin, 4 years help deskBS and MS in Cybersecurity, CISSP, GIAC GCFA, many lower level certsMedium COL","132kSr GRC Analyst10Associates in computer science, CRISCLow to medium COL","$155,000 annual salaryStaff cybersecurity engineer7 years in cybersecurity, 10 years as a developer before thatBachelor's degree, plus:CompTIA A+, Network+, Security+, Server+, Pentest+, CASP+,ISC2 SSCP, CSSLP, CISSPCSA CCSK (Certificate of Cloud Security Knowledge)Splunk certifications, can't remember which onesImperva certificationNetskope certification3 AWS certificationsAzure FundamentalsGCP Associate Cloud EngineerUhhh...Metro Atlanta area. I guess that's MCOL. It sure isn't LCOL, based on house prices around here.","Canadian weighing in.1. $100k CAD + bonusSecurity Architect9 total (4.5 in Security)CEH, CISSP plannedMedium CoL","158,800 baseSecurity Engineer1.5 yoe as engineer ~5 years exp GRC priorMasters in Info Systems & CISSPMedium","You all should make a huge shareable spreadsheet.","[deleted]","80kFSOCurrently 6mo on the jobGetting my bachelors in Management of Cybersecurity OperationsMedium COL","67kJr. InfoSec engineer (lots of vuln management, resolving soc alerts, phishing, awareness, project management, project implementation, dlp, etc. Pretty much I can do a little bit of everything, of course, with the permission of my boss.)6 months in this role, 8 years in total doing support, light sys admin work.BS Information Science and Technology, no certsLow to medium col","70Kbase + Quarterly BonusSecurity Engineer2 YOESome time at a university & finished off in a Tech school.Low/medium COL area​Life is good most of the time :)","80kSecurity Analyst lJust over 1 year exp. Help Desk at MSSP > promoted to analyst within > moved to new job.Bachelors in unrelated field. No certs. Mostly YT, homelab, and tryhackme.MCOL area","$300kSecurity Consultant (100% remote outside of work travel every other month for a day or two)About 8 years of experienceIT (security concentration) undergrad with an MBA. CISSP, CEH, GSLC, AWS, etc etcMedium to High COL.",""],"points":1527},{"text":["PSA -The 27 Cyber Security Boot-camps from EDX are NOT from the Universities advertised","I love you!","I've always found all these EdX/university partnerships to be suspect. As far as I can tell you're really paying for an EdX credential that has a university logo on it... hardly official.EDIT: Had a thought - if the university isn't creating a university transcript for you, unless there's something in the fine print, these things may be grounds for a lawsuit. Imagine you're Ford and you sell Junkco cars at a Ford dealership but you threw a Ford emblem on the car. Buyer goes home, runs the VIN, comes up Junkco. Buyer sues because they were led to believe they were buying a Ford."],"points":1},{"text":["Does google hear everything we say?","Well if google isn’t, then Facebook, instagram, Amazon, Apple and twitter are.","Not just Google. Anything with a microphone permission. Those permissions can get reset as well, so periodically review what can access your call logs, microphone, messages, etc.","I can't tell if this is serious or not, but I'll proceed with the assumption it is.Short version: No. They aren't spying on you.Long version: The amount of data collected on you through services, sites, and devices you have consented to is staggering. The algorithms used to analyze this data are powerful and more data can be obtained via brokers. It isn't entirely coincidental that you see ads for things you're thinking of or recently talking about, but it could also just be frequency illusion (read up on it). The algorithms know you better than you do and are quite good predictive behavior models.","We tested that theory once in a group. I think there were 8 of us, can't remember the topic but we talked and then used our phones. Oddly the products we talked about started showing up in ads. Op may have a point as paranoid as it may sound. Super coincidence or key words are being listened for since that is what Siri and Google by design function anyway.","Yes absolutely","Amazon sure does. You can access your Alexa recordings and it’s amazing how much is recorded. Thankfully, you can turn most of it off and/or have your recordings deleted on a regular schedule."],"points":7},{"text":["OTG Micro USB to RJ45 Adapter","I tend to go with the known brands. I’ve never heard of SMAYS so I would steer clear of them."],"points":0},{"text":["How much cybersecurity vendor fraud & shady behavior is happening?","While the specifics vary depending on the laws of each country, it is generally quite straightforward to establish a company and present oneself as a \"security company\" specializing in assessing security risks. This ease of setup enables such companies to readily market and sell their purported products or services. This is an often-overlooked aspect, as it lays the groundwork for the creation of fraudulent data and services. In essence, these companies can generate and sell deceptive information while simultaneously earning revenue.Another aspect often overlooked by consumers and customers is that sellers of these products or services may fabricate a problem for you, compelling you to purchase their solution for a non-existent issue. This tactic involves creating a perceived need where none actually exists, driving demand for their offerings by exploiting consumer fears or uncertainties.","In the U.S. it's called marketing, and over the decades they have carved enough exceptions to allow a ton of leeway before getting to the point of fraud.When \"Nobody could possibly believe that our claims were true\" is a valid defense in court you can get away with nearly anything.","Before going into cyber, I worked on a few class action lawsuits.Any bad behavior I've seen in security pales to what I've seen some big name brands do.","I'm sure it happens but I've also seen fraudulent actors in security as well.They'll scream and wail about a service account and ignore the open front door.But more to the point, so much of security is theatre. Make it look or sound good enough, and people get taken in.","This is a bit of a jaded take and there are issues with each point you make. So I'll say this.You'll get answers to each of your points by doing a PoC. Each vendor has a different goal and there are many in each discipline. You need to find the solution for your company."],"points":3},{"text":["After AI takes our jobs or they are outsourced to India","Outsourcing to India has a lot of challenges. Some companies and countries have extremely strict regulations when it comes to their data and security. That’s only one aspect of that issue, you also need to think about the quality of work, insurance, communication with that overseas team and other shit.AI? Some of you completely overblow it. It’s became a trendy word used by vendors at this point. AI is far more likely to augment our roles and be used as a tool instead of getting rid of jobs within the next 5 years.I wouldn’t be surprised if we also saw some regulations surrounding the use of AI in security due to the fact that it is far from perfect. AI currently lacks human judgement and communication skills. Its current use case is an assistant.Then again, idk. None of us do. Maybe it does happen in the next 5 years, maybe it takes 20, or it never happens. If it does I’ll probably just work at Costco haha.","I can’t even get ChatGPT to write a script that modifies a CSV correctly 💀I wouldn’t let that shit “run” security with no human oversight.","What makes you so sure this will happen?","You said CCSP twice","Everyone in the tech sector should save like they are retiring at 50. I know plenty of folks that stayed technical or moved to management, but I also know a few that got pushed out, with no seeming rhyme or reason. That we might become irrelevant (with the exception of the select elite) is always a possibility too.","India has been there for years. Nothing is happening that will suddenly shift all jobs there.LLMs will make some jobs obsolete (once they get a whole lot better), but certainly not all. If your skillset can be replaced with an LLM (or a shell script) then simply start learning new skills.Or better yet, start learning how to use LLMs to replace what you can do and lead the way in helping orgs make that transition.You can be passive and be a victim of change, or you can embrace it and leverage it. That's up to you.","I've seen more and more IT security jobs outsourced overseas especially entry level roles. The US cybersecurity team is usually a skeleton crew at best one person in each timezone usually. And you're normally forced to work filling multiple roles just to keep your job.It doesn't even matter if the overseas IT Security personnel is terrible at their jobs. Management legit doesn't care because they're so much cheaper to employ."],"points":29},{"text":["Nebula Pro- AI powers Offensive and Defensive Cybersecurity Tool"],"points":0},{"text":["Looking for a Security Consultant for locking down a dedicated windows server?","Most of the measures you mention are \"generic\" and wont protect you if you have a vulnerabilty on your cms or hosted apps. For example a remote file inclusion, directory bypass and remote code execution gets you there and the WAF and EDR locally will likely not pick it up.If you have good logs you might go the foresinc route, might be your best choice but I suspect this might either not be available or the criminal could have tampered them.I would more look into getting a consultant or a red teamer look into an Appsec vuln on your hosted app. Ig you have 350 sites it might be a huge attack surface, would need more details to know better.","DM me u/rockybrunchSenior pentester."],"points":1},{"text":["Portswigger Academy before HTB CPTS","I am also curious","Having touched both but not finished one... HTB is easier for me to digest and I find myself spending more time there.I also have TCM and THM accounts and occasionally glance at my hackerone ...A full time job keeps me fed so not much time for a lot else.I plan on HTB CPTS 1st then whatever I feel solid on next... Portswigger Academy is like 3rd or 4th right now.","Portswigger Academy is a good starting point for beginners and is constantly adding more and more content. In addition, doing the labs and all learning material is for free - whereas HTB is quite pricey.This fully depends on your skill level, however I would recommend everyone doing Portswigger Academy first, then play HTB as you might feel more comfortable & confident doing certain attacks and not get stressed out.If you think the Academy is to easy, you can still make a switch at any point and will not loose a dime. So have a look into it.Happy hacking & have fun!"],"points":0},{"text":["Experts call for US Cyber Safety Review Board rethink"],"points":0},{"text":["What high risk things does your business do?","Privileged Access Management - named & service accounts","A lot of financial companies choose to not offer 2FA because it angers and confuses part of their customer base. Same goes for password requirements to an extent","Alot of bad things that audit identifies over and over, and we just put it on the todo list.","For us it would be ignoring 3rd party risk. We just put in a TPRM program after me fighting with management for 3 years to do it. So we will see if that helps facilitate change.","You need to do a proper risk assessment.Pick a set of threat actions:hit by ransomwareunauthorized access to critical dataemail compromiseVendor compromiseEtc.Then you figure out what vulnerabilities exist that make those things more likely or more serious, and what mitigating factors are in place, and the likelihood/impact of those events.","Subsidiary which sells to an exclusively elderly demographic. Over 80s, bless them, share devices and share passwords and have difficulty with MFA and half of them still use cheques and most of them would much rather deal with us over the phone, which isn't great when the rest of the business (including a lot of tech and processes reused by the subsidiary) rushed into a digital-first strategy.The subsidiary's DQ is dire by modern standards, and honestly I have no idea whether any given customer is who they claim to be, but nobody cares because the product is low risk and the income keeps rolling in and the customers seem to enjoy the product long-term (except when scammers impersonate our business/product and take the customer's money). A large % of subscription cancellations are ostensibly performed by the account-holder but happen after the customer dies, nobody really cares that the niece used her uncle's tablet to tie up a few loose ends, hopefully the banks care more about post-mortem bank-account closures &c.","This is interesting. I recommend a more methodical approach though, like choosing an RMF to measure your current risk posture inside and out (think NIST). Its easy to get jumpy at the technical risks and forget the other types, like end user and role-based risks.What risks could the company realize that would cause major revenue loss? What is the likelihood that risk could occur?This also makes me think Cyber KillChain and MITRE ATT@CK would be good to apply here based on user roles in critical applications. Also, if you develop software either for internal use only or for sale to customers supply chain attacks (think CI/CD pipeline and SDLC type stuff) could be a major factor as well.IMO, we need a little more context of what the company does or we are really just shooting in the dark here. What sector/type of business is the company?","Post on Reddit about the high risk things they do.","Not going to post my own dirt but would suggest looking at the cyber risks tied to top criticality business processes. E.g. Payroll. Some of these questions are based on stuff I've seen. How many systems does that process traverse? Are controls consistently applied across all systems serving the process? How is user and admin access managed? Security logging meeting requirements? Are sensitive reports kept securely and labeled? How do integrations flow and authenticate? Are sufficent validation checks in place for email based requests to change direct deposit accounts? Do we have sufficient procedural checks in place to prevent payroll fraud and are they followed? Have they been tested recently? Are service accounts reused across various servers within the process? Clear text creds in scripts? Any unauthenticated service control web panels allowing unauthorized manipulation of services that could disrupt the process? Does leadership know and accept the risk of single points of failure within the process be it a person, a technical system, or a vendor?","I'd start with exploring that \"unregulated\" claim. Are you really \"unregulated\"? Do you have customers in Europe? You need to be GDPR compliant. Lots of states have privacy regulations and/or breach notification laws now. Are you compliant with those for the states you operate in? Are you public? There are some SOX concerns that relate to cybersecurity. Accept credit cards? PCI-DSS has some pretty stringent requirements. Pretty much every company is covered by some regulation to keep emails for some period of time, even if its just the blanket IRS requirement...Some other security concerns worth looking into that i've seen / heard of business causing:is 2fa in use or has it been pushed aside for convenience?Are there unsupported/unpatched servers (or other software) out there running ostensibly because the business requires it?Do you let anyone connect to the corporate network b/c sales or whoever else want to use their ipad/personal phone/whatever other gadget they claim to need?Do you have proprietary or sensitive info out there on personal devices?Whats the state of service and other privileged accounts in the environment?Do users have admin rights or otherwise have excessive privileges because IT isn't able to say no?What about data retention? Are you keeping data for long enough? Too long?​There are tons more but these might be good starting points."],"points":47},{"text":["Best way to present Threats found on A/V Solution?","What kind of AV are you using?? Are you only looking at executable names because that’s not really useful, malware masquerades using legitimate names all the time. If you’re using hash, is it legitimately bad or does it have behaviors that make it suspicious?Your AV should be detecting things and automatically remediating them based on severity. It should also provide a signature that you can search to see why it hit.If you mean files are getting detected and you’re verifying they’re not false positives, hashes, names, and signatures are a good place to start.Running a sample through a sandbox also wouldn’t be bad a bad idea to better understand the behavior if you have a private account.As far as, do you know anywhere that does that? Not really. You’ll see some websites will have a run down on the malware, but I like to look at hybrid analysis reports and provide details on what’s actually happening when the malware is executed. The websites I mentioned aren’t always accurate and will have false positives all the time, “svchost.exe isn’t necessary for most systems. Here’s how you delete it from your system”But yeah, i normally do hashes —> behavior —> names. Names don’t always mean much but lazy threat actors won’t bother renaming a lot of the time."],"points":2}]