[{"text":["Is Musical Instinct Innate? AI Model Suggests So."],"points":0},{"text":["Gen Zers are taking on more debt, roommates, and jobs as their economy gets worse and worse","The following submission statement was provided by /u/Alternative_Wild392:They literally took the same article from 10 years ago and changed \"Millenials\" to \"Gen Zers\".Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19ep3mp/gen_zers_are_taking_on_more_debt_roommates_and/kje3qqw/","They literally took the same article from 10 years ago and changed \"Millenials\" to \"Gen Zers\".","As a millenial I say welcome to the ring. If you take 1995 as latest millenial, the oldest Gen Z should be 27 now, which is basically where engineers realize they wont be rich after university and blue collar workers are at their first mental breakdown.","This article was originally published a year ago and may contain out of date information.The original publication date was December 4th, 2022. Per rule 13 older content is allowed as long as [month, year] is included in the title.   This bot finds outdated articles. It's impossible to be 100% accurate on every site, send me a message if you notice an error or would like this bot added to your subreddit. You can also download my Chrome Extension if you'd like to see publish dates added to all article links on reddit.Send Feedback | Github - Bot | Github - Chrome Extension","Houses of multiple occupancy have to be one of the worst side effects of growing wealth inequality and inflation.","Except almost all indicators of the economy are solid. Wage growth has outpaced inflation. Yes, housing might be expensive. Beyond that, things are good. The sky is not falling","$50k in debt isn't something to do with Gen Z... that's just horrific financial management. Like... a lot of very poor decisions occurred for you to get to that point or just very exceptional circumstances.Got a neighbor that sorta dug her own hole like that, got hurt at work, was living off work-comp (she injured a shoulder, but she wasn't incapable of work) and just slowly drained her accounts out while trying to sue that business for more.She then went after he ex-husband for more money, he went to the courts, they reduced the child support he had to give her so she ended up getting even more in-debt because of that.Didn't want to downsize her life and eventually it put her all the way into 68k into debt even with everyone around her telling her to sell the Audi, sell or refinance the house, etc.At the end of the day her wife left her, they sold the house and she managed to catch up with her debts, but then went right back out and bought another expensive car while her wife was smart... found a friend to rent from, put her cash from the house sale into investments, and is just relaxing until the housing market returns to something with sanity.Neighbor lady will likely be tapped out and homeless within the next two years is my guess.","Stop whining and get out there and get the best job you can get and improve your life. I literally have no sympathy for this kind of stuff.","The economy is actually strong. Corporate profits are through the roof. Cost of housing, education and healthcare are extremely high and a lot of that can be directly linked to those strong profits.It's almost like this strong economy is designed to work for the powerful few instead of the majority.","Such shitty conclusions these lazy articles make. Guess what, there are tons of higher paying jobs with skills that young people do better than old people, namely TECH FUCKIN NOLOGY and just delegating shitty lives because of a \"generation\" is so reductionist and victimizing. Live within your means, recognize what's lucrative in today's economy, work hard to develop marketable skills, adjust your expectations to what's realistic."],"points":0},{"text":["The winner of a prestigious Japanese literary award has confirmed AI helped write her book","The following submission statement was provided by /u/SharpCartographer831:Submission statement:CNN — After Japanese author Rie Kudan won one of the country’s most prestigious literary awards, she admitted she’d had help from an unusual source — ChatGPT.“I plan to continue to profit from the use of AI in the writing of my novels, while letting my creativity express itself to the fullest,” said the 33-year-old, who was awarded the Akutagawa Prize for the best work of fiction by a promising new writer on Wednesday.The author then confirmed at a press conference that around 5% of her book “The Tokyo Tower of Sympathy” — which was lauded by committee members as “practically flawless” — was word-for-word generated by AI.An architect asked AI to design skyscrapers of the future. This is what it proposed The novel centers around the dilemmas of an architect tasked with building a comfortable high-rise prison in Tokyo where law breakers are rehabilitated, and features AI as a theme.Kudan said that, in her own life, she would consult ChatGPT about problems she felt she couldn’t tell anyone. “When the AI did not say what I expected,” she said, “I sometimes reflected my feelings in the lines of the main character.”The author is not the first artist to generate controversy by using artificial intelligence, at a time where many creatives feel their livelihoods are threatened by the technology.Last year, Berlin-based photographer Boris Eldagsen withdrew from the Sony World Photography Awards after revealing his winning entry in the creative photo category was created using the technology.Meanwhile, authors like George R. R. Martin, Jodi Picoult and John Grisham joined a class action lawsuit against OpenAI, the company behind ChatGPT, last year, saying it used copyrighted work while training its systems to create more human-like responses.And more than 10,000 authors, including James Patterson, Roxane Gay and Margaret Atwood, signed an open letter calling on AI industry leaders to obtain consent from authors when using their work to train large language models — and to compensate them fairly when they do.The best books of 2023, according to global tastemakers Writer and prize committee member Keiichiro Hirano took to X, the social media company formerly known as Twitter, to say the selection committee did not see Kudan’s use of AI as a problem.“It seems that the story that Rie Kudan’s award-winning work was written using generative AI is misunderstood… If you read it, you will see that the generative AI was mentioned in the work,” he wrote. “There will be problems with that kind of usage in the future, but that is not the case with ‘Tokyo Sympathy Tower.’”But while some on social media expressed interest in Kudan’s creative use of AI and said they were now more interested in her work, others called it “disrespectful” to other authors who wrote without the help of the technology.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19ep0cd/the_winner_of_a_prestigious_japanese_literary/kje2ak6/","With the amount of academic dishonesty I’ve just accepted that individuals in society are going to become as crippling dependent on this tech as the rest of it","Submission statement:CNN — After Japanese author Rie Kudan won one of the country’s most prestigious literary awards, she admitted she’d had help from an unusual source — ChatGPT.“I plan to continue to profit from the use of AI in the writing of my novels, while letting my creativity express itself to the fullest,” said the 33-year-old, who was awarded the Akutagawa Prize for the best work of fiction by a promising new writer on Wednesday.The author then confirmed at a press conference that around 5% of her book “The Tokyo Tower of Sympathy” — which was lauded by committee members as “practically flawless” — was word-for-word generated by AI.An architect asked AI to design skyscrapers of the future. This is what it proposed The novel centers around the dilemmas of an architect tasked with building a comfortable high-rise prison in Tokyo where law breakers are rehabilitated, and features AI as a theme.Kudan said that, in her own life, she would consult ChatGPT about problems she felt she couldn’t tell anyone. “When the AI did not say what I expected,” she said, “I sometimes reflected my feelings in the lines of the main character.”The author is not the first artist to generate controversy by using artificial intelligence, at a time where many creatives feel their livelihoods are threatened by the technology.Last year, Berlin-based photographer Boris Eldagsen withdrew from the Sony World Photography Awards after revealing his winning entry in the creative photo category was created using the technology.Meanwhile, authors like George R. R. Martin, Jodi Picoult and John Grisham joined a class action lawsuit against OpenAI, the company behind ChatGPT, last year, saying it used copyrighted work while training its systems to create more human-like responses.And more than 10,000 authors, including James Patterson, Roxane Gay and Margaret Atwood, signed an open letter calling on AI industry leaders to obtain consent from authors when using their work to train large language models — and to compensate them fairly when they do.The best books of 2023, according to global tastemakers Writer and prize committee member Keiichiro Hirano took to X, the social media company formerly known as Twitter, to say the selection committee did not see Kudan’s use of AI as a problem.“It seems that the story that Rie Kudan’s award-winning work was written using generative AI is misunderstood… If you read it, you will see that the generative AI was mentioned in the work,” he wrote. “There will be problems with that kind of usage in the future, but that is not the case with ‘Tokyo Sympathy Tower.’”But while some on social media expressed interest in Kudan’s creative use of AI and said they were now more interested in her work, others called it “disrespectful” to other authors who wrote without the help of the technology.","I would be surprised if the same isn't true for the other contestant. ChatGPT is a tool, not a ghostwriter.","These types of offenses should always result in: Major fines, return of awards received, label of plagiarism and disbarment from any future competition.","At least she admitted it. All generated content (even partially) should be labeled as such by law. It's the least they can do and as a consumer I want to know what I'm supporting."],"points":0},{"text":["To create a great future, we must study and learn from our history. What are your favorite stories and learnings from the past?","FDR knew ahead of time that the Japanese were going to bomb Pearl Harbor. He allowed it to happen and did not warn Hawaii. Americans at the time did not want to get involved in another war in Europe so he allowed Americans to die for the outrage and so the US would participate.Lesson:  politicians and the government lie to you. Question everything.Source: FOIA.","In 2014, a pair of researchers were following a song line across Australia. The Aboriginal people would sing song stories as they walked, and the characters in the song correspond to feature in the landscape. That way they could navigate across aird land and reach water. They had 1000s of these stories taught by ear.     The researchers were walking along, singing their little hearts out, when they were suddenly standing on the edge of the sea. Did they take a wrong turn? They talked to a geologist who asked \"What's out in the sea?\" \"Water\" they replied. \"No, what's under the water?\"     When they looked at oceanic charts, there was the rest of the story. \"How long ago would the sea level have been that low?\" they asked. \"The Pleistocene ice-age, 10,500 years ago.\"     The researchers realized the story they were signing was at least 500 generations old. Sung down the generations longer than the pyramids of ancient Egypt have stood. A geographically accurate song that had never been written down--just humans helping humans."],"points":0},{"text":["AI-Generated Music Copyright Debate: Who Owns the Rights?","The following submission statement was provided by /u/redlaire:It’s interesting how labels and right holders are going to deal with ai music now. I also don’t understand why there are so many (well several) cases of artists trying to fight or sue ai that uses their drawings etc but musicians don’t do that. I mean people clone their voices, create deep fakes, release songs with their voices and get massive exposure using their voices but musicians don’t seem to do anything. Voice isn’t copyright protected, I reckon but that’s still strangePlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19eo3hl/aigenerated_music_copyright_debate_who_owns_the/kjdwjif/","AI-generated \"music\" is not protected under US copyright law.(There are no \"rights\" to own and anyone can freely copy, distribute, and publicly perform such material.)","AI generated music needs to be treated how all other AI generated content is treated...Find the people they stole the source from and have them sue the AI \"musician\" into the ground for copyright infringement."],"points":0},{"text":["Big tech needs to stop trying to make their metaverse happen. From Microsoft to Meta, the race is on to sell an amorphous concept that no one really wants them to build.","The following submission statement was provided by /u/Obligation-Stark714:Wait until they realize that big MMO games like WOW and FF1V are basically already metaversesPlease reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19en4v4/big_tech_needs_to_stop_trying_to_make_their/kjdpzpy/","This article was originally published 2 years ago and may contain out of date information.The original publication date was January 31st, 2022. Per rule 13 older content is allowed as long as [month, year] is included in the title.   This bot finds outdated articles. It's impossible to be 100% accurate on every site, send me a message if you notice an error or would like this bot added to your subreddit. You can also download my Chrome Extension if you'd like to see publish dates added to all article links on reddit.Send Feedback | Github - Bot | Github - Chrome Extension","In order to really work, it requires us to be bored at home for the foreseeable future. Barring extreme cases, it is only when clubs are closed, and concerts are cancelled, and in-person meetings are off-limits that one would go for their Metaverse equivalents.Apparently the author is unaware of the 350 million monthly active Roblox users. That's larger than the US population. The metaverse doesn't exist today, but services that might be considered metaverse-adjacent are a lot more popular than some people realize. People, especially newer generations love to do things in virtual worlds.if a remote/digitally nomadic/global workforce future is really coming, few people want to spend it staring at avatars of their colleagues awkwardly bobbing up their heads because Meta’s Oculus cannot capture or render coffee mugs.Talking about current technology as if that's the end goal seems like a weird critique. What happens when Meta's headsets can capture and render coffee mugs? What happens when the avatars are photorealistic and not awkward? What happens when everything is small, compact, and comfortable?This article is confused on what the metaverse is in the first place. Yeah, maybe the metaverse fails to materialize, but the concepts of computing in VR/AR and socialization in VR/AR are good, beneficial ideas that are just waiting for the hardware to catch up.","Wait until they realize that big MMO games like WOW and FF1V are basically already metaverses","I do want a metaverse, though I dont want it controlled by a single corporaions that aims to controll it all themselves. Rather I would love an open Web X.0 or some kind of public domain framework developed collaboratively for at least a modicum of interoperability between the controlling parties/developers and then our avatars could bounce around their individula metaverses. Or somehow allow for us to produce public metaverse content ourselves. obviously this is nearly impossible as the stuff has to be hosted somewhere but maybe one day when electricity and computing power is strong enough we can all host our own worlds cheaply and redemocratize the eventual metaverse.","It doesn't sell because the tech isn't good enough yet. But it will be. And when that happens, then metaverse or however you wish to call it will be the next tech growth engine same as internet and smartphones were. None of the tech giants plan to be caught with their pants around their ankles for that one.Telling tech giants not to bother with this is like telling IBM in 1980 not to bother with this personal computer nonsense.","The only thing that is going to be meta is AR. VR is only for specific niche use cases. Training for instance or mental healthcare.","They can only do so much with the current hardware limitations, thats the biggest blocker in progression.But for any big advancement to happen ALOT in the world would change with it where VR would be a last priority for these tech companies.","I want it. I’d love to a VR world set in EverQuest(modern graphics). I think the concept is unbelievable and I’ve been wanting proper VR/ vr world since the 80’s.I just think it has to be developed out of passion by passionate dev’s who truly want to build an immersive world, not a company looking to make all the money.","The tech is evolving quickly and I’m here for it. Just hoping we steer away from the anonymous user side of the internet for VR. The lack of accountability for users is probably the worst aspect of the internet and its applications.","I want metaverse to happen. It's a fantastic vision of an alternate reality where people can congregate virtually. It is a logical step in the right direction. Just because people are short-sighted and don't see the benefit now doesn't mean it's a bad idea. It might be too early with the tech we have available, but it is the future of humanity. Strap to a VR headset hanging out with friends digitally, playing games, working collaboratively, socializing with strangers, traveling to new (digital) places, etc...I don't see why people are shitting on Meta using their money on R&D to try and make a new concept a reality. This is exactly what big tech companies should be doing with their massive fortunes. Make NEW things, existing things are great, but we still need innovation.","There’s huge demand for this… if done right. Just look at ready player one.","Good story. Summarises why the metaverse is utter nonsense for people that have lives (or want to) away from a bloody screen (let alone a dorky headset).","Not at all, zucks going all in. He is going to need a metaverse once the world ends and he is safe in his 300 million dollar bunker😂","Never really understood this sentiment. Just let them build it. If it flops, it flops.","People don't want a vr mmo. They want a HUD overlay on what they can already see. This generational set isn't ready to emigrate into Cyberia. Folks already already know, if unable to admit, that the barrier between the internet and real life is porous, if not downright solvent. Folks would find prefer to have their checking balance at the corner of their vision before logging on, popping on some headache-box, and logging on to yet another social (multi)media to check the fidelity of their credentials.","I thought Zuckerberg already moved on from this ? Pretty sure there was an article posted last week","It's the same as live-service games. They spend so much time trying to make the game economically viable, they forget to actually make it fuckin good. You're putting the cart before the horse.Make addictive dopamine-loop first. THEN exploit it.","I wouldn't say no one would like something like this, but people are just skeptical of not only the necessary technology but also of those controlling it","Now Meta is also reportedly planning to introduce NFT features on its Facebook and Instagram platformsHAHAHAHAHAHA!","They have struggled enough that I wonder at some of their creators.I think they have the division backwards.Wish I knew more about this so I could apply my gaming and economics degree to making them work.","Ermmm yeah they areThey just don't want the corporate version of it","I have no issue with virtual worlds. They can be fun and could potentially be useful.The problems arise when 1. Companies expect people to do everything or commercial activities within them and 2. Companies want customers to work in them while simultaneously being anti-remote-work to their own employees and 3. Expect people to go all in when the experiences aren’t great yet.","I completely agree with the author of this article, while reading for a minute I was transported to the virtual world.","I'd like a metaverse actually. Why don't you want it?","I want a metaverse. I want it more than anything. Just not the kind Meta wants to build.I want the metaverse of Ready Player One, or of numerous other science fiction works. I want a stable, consistent virtual universe where I can meet people, do business, play and have fun, and interact without having to travel long distances.It isn't the metaverse concept that people don't want or don't understand. It is that Elon doesn't understand.","It's never going to be a thing until they achieve genuinely cheap, practical and intuitive business applications. AR has a better shot at this than VR, which I don't think will ever be a \"thing\".","I have a business page on Facebook, I think I’m pretty tech savvy but I find meta very confusing and you really have to dig deep into it to find what you want.They know it’s confusing too because they have courses for their own website.","The real issue for me is that it's private companies building it, and so you know that it's just going to be all about harvesting users' data. The only way I would be interested in jumping into this stuff is if there were a lot of community built, open source options available.","A 3D version of web pages, accessible via VR headset? With the ability to jointly browse this with friends? Yes people want this.The BS that companies keep trying to make and call a metaverse? No.What exactly are companies trying to build that is a mistake? And why?They want the equivalent of the app store for phones, but for the Internet.Imagine if Chrome Internet browser \"owned\" the Internet. Charged rent for URLs to be accessible via a chrome browser. Furthermore, Chrome charged websites 30% on any purchase made using a chrome web browser.That's the $$$ that companies are seeing and why they keep trying to make the \"meta verse\" a thing.It's also exactly not what an actually good metaverse needs.","The super wealthy want them to build it because it can creates a space that they can have total control over. They are going to keep investing and keep pushing it on us until we fight back. We might have to even go so far as to assert that our rights exist there as much as they do here, such as free speech, private property, etc.","I disagree, the standardized metaverse / omniverse (MetaVerse Standards Forum) is a good concept. It needs more time in the oven but I see it coming to fruition eventually. If people are going to be spending real money in virtual worlds it makes sense to have a way to link up all the separate worlds and exchange virtual goods and currency between them, and to enable interactivity between worlds.","The whole X brand is also an endeavour in that exact direction, and I'm tired of pretending it's not.","AR VR tech is only going to get better and better at the same time as cloud infrastructure, 5G infrastructure, digital twins and AI eventually all get used in tandem for all manor of things.I don’t see AR glasses being even remotely decent until maybe 2028 maybe 2027. Even from there they will improve more and more. There are some binocular ones that have gotten surprisingly small such as digilens but after trying them it felt like we still have until the late 2020s before we can indulge in the sort of early iPhone equivalent of consumer AR glasses even remotely worth using.Now I don’t see like things like affordable global persistan spatial anchors, affordable real time silhouette detection, flawless hand tracking happening super soon but I will say I recently got my hands on hand tracking software that is physics based that is good enough for multi finger typing and sign language but solid hand tracking will be needed too going forward"],"points":133},{"text":["How do you react to AI-generated erotic content? A scientific study on the potential future of porn","Thanks for the link! I ignored your warning about mobile and did it on my phone, and yeah in hindsight I'm worried I muddied the results because I was viewing images at such a small resolution I almost certainly wouldn't be able to to see telltale AI signs or discrepancies. Was an interesting study! I had some complaints about methodology but they were all addressed by the breakdown at the end. I do worry about their ability to gain useful data when their images don't really factor personal sexuality into the equation (I'm pansexual so it's whatever, but I imagine a straight man might flag all the nude male images as low-sexy for reasons having nothing to do with AI vs Photograph).I also found it weird their two demographics questions were \"what is your biological sex\" and \"what is your sexuality\", as together those don't actually allow you to infer anyone's attraction level to male and female bodies (as there's no way to know whether a correspondent is trans and therefore attracted to the opposite images the survey would expect).","Hello I am 69 year old pervert from europe. I have very positive feeling toward AI generated erotic content. I can't wait to help out with this piece of highly anticipated science studies that will further mankinds quest for knowledge!!!","I don't know. I was raised in the wild west internet of the early aughties. I've been spanking my monkey to suntan-colored pixels for a while and I've thought about this and the only common denominator I've ever found across all the length and breadth of this wonderful pornucopia of the Cyberian jungles is... we're all just jerkin it to shiny and particularly colored lights, aren't we? The differences between hentai, pornhub, and Stable Diffusion are pretty much distinctions of taste, no?"],"points":5},{"text":["What is going to be next big thing after Renewable Energy ? What you think","Satellite based energy transmission from space to solar collection centers on Earth.Think satellite-focused beams of light being aimed at places with naturally low-levels of light in northern climes during certain times of the year.","There will be a lot of excess electric power on sunny days, and people will discover ways to use it.","Biotechnology, the advancements across the board in the industry have been astonishing, from Crispr to mRNA therapies has changed medicine forever and it’s just getting started","Solid State Batteries are around the corner and will speed up the adoption of EV’s. I also think the overal capacity of batteries will become better, which will boost the development of electrical airplanes","Bidirectional charging of EVs. Literally millions of virtual power plants available if the price is right","The answer I think is still storing base load power for heavy industrial use.  Cities need an unbelievable amount of base load power to run everything.  Batteries aren’t going to run heavy industrial plants.  So clever ways like those salt batteries storage systems.","Unique battery storage: salt, sand, water.Smart grids.","Nuclear fusion. Not renewable by definition but limitless free energy.","Toyota's hydrogen combustion engine could make waves. Literally fill the car with demineralized water and off you go. It was invented many years ago, and it was 'disappeared'.....maybe a company the size of Toyota can hold back the oil Mafia.","Either going back to fossil fuels or fission, almost assuredly. There are very hard problems that renewables need to overcome, both technically and financially. I'm skeptical that it will be able to overcome these issues. Nuclear isn't a walk in the park by any means, but it's been proven viable and that its problems can be overcome.","*After* renewable energy? As in, renewable energy achieved/flopped, what's next?My guess would be commercial space infrastructure - space hotels, corporate labs and superclean production facilities, lunar mining and in situ solar panel production, etc.","A Dyson sphere is a huge step in evolution, my sentence is too short. Have you ever eaten a burger, my favorite topping is mustard, never been a ketchup guy","I want cultured meat to succeed. But our bioreactor capacity is still too low for the scale we need to feed humanity.","You can (sometimes) predict future discoveries by looking at problems that people will very soon be putting a lot of effort into solving:Bacteriophages and new antibiotics drug discovery, as our current antibiotics stop working.More movement on battery storage, which is key to a renewables-based grid. Battery recycling as well."],"points":12},{"text":["Majority of America’s underground water stores are drying up, study finds","The following submission statement was provided by /u/Ecstatic_Choice_5482:With a majority of aquifers across the U.S. — and particularly across the West — in some state of decline, these questions seem urgent:How will settlement and agriculture patterns change?Can US agriculture survive the collapse of the aquifers under the San Joaquin Valley, which currently provides a quarter of American food?Will we see widespread use of fees for pumping groundwater — which helped save the aquifer under Bangkok, Thailand, but are almost unheard of the United States?Will we see more open conflict over groundwater?Will America's culture of water — which we currently treat as essentially free — change?Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19em0mh/majority_of_americas_underground_water_stores_are/kjdhesc/","We need to ban corporations from pumping water (nestle for example), go bigger on renewables, and when there’s too much energy during the sunny and windy days - desalinate water for farming and drinking.","Needs federal regulation, imho. No, it's not efficient, but at least it's something.","With a majority of aquifers across the U.S. — and particularly across the West — in some state of decline, these questions seem urgent:How will settlement and agriculture patterns change?Can US agriculture survive the collapse of the aquifers under the San Joaquin Valley, which currently provides a quarter of American food?Will we see widespread use of fees for pumping groundwater — which helped save the aquifer under Bangkok, Thailand, but are almost unheard of the United States?Will we see more open conflict over groundwater?Will America's culture of water — which we currently treat as essentially free — change?","Agriculture in the wrong places is sucking up non-renewable water. People in western states are having to dig their wells deeper every generation.At some point we will hit a wall, and it will become impossible to sustain large population centers where they've been built. Ag workers complaining about environmentalists attacking their lifestyle will literally see the well run dry. Identity politics don't make it rain, they're destroying their own childrens future.","Yet another metric by which consumerism is about eating the future of your children."],"points":143},{"text":["Army's Jointless Hull 3D metal printer recognized for technical achievement","The following submission statement was provided by /u/Gari_305:From the articleThe so-called Jointless Hull machine is the world’s largest additive and subtractive manufacturing apparatus. It’s located within the 3 million square feet of RIA-JMTC’s footprint at Rock Island Arsenal and earned the 2024 Technical Achievement Award for 3D Printing Innovation at the 8th Annual Military Additive Manufacturing Summit & Technology Showcase.Also form the article“To be able to 3D print something that is forging level quality didn’t exist until now,” said Flinn. “In the past, except for some unique situations, it’s always been a weldment or assembly using conventional techniques. The joints were always the weakest section of the part. This new system makes it possible for people to not worry about the joints or seams because you can make it in one piece.”Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19ehh09/armys_jointless_hull_3d_metal_printer_recognized/kjckbfp/","From the articleThe so-called Jointless Hull machine is the world’s largest additive and subtractive manufacturing apparatus. It’s located within the 3 million square feet of RIA-JMTC’s footprint at Rock Island Arsenal and earned the 2024 Technical Achievement Award for 3D Printing Innovation at the 8th Annual Military Additive Manufacturing Summit & Technology Showcase.Also form the article“To be able to 3D print something that is forging level quality didn’t exist until now,” said Flinn. “In the past, except for some unique situations, it’s always been a weldment or assembly using conventional techniques. The joints were always the weakest section of the part. This new system makes it possible for people to not worry about the joints or seams because you can make it in one piece.”","I'm sure army.mil is a very unbiased source and doesn't at all inflate the achievements of the US Army"],"points":4},{"text":["What would a near pre post scarcity society look like?","IMO It would need to start with free energy.Like a fusion reactor that makes more than it needs. Once \"something\" is free, society can leverage that to provide for needs without counting costs.","The most obvious answer is lots of government housing and a food subsidy program.So basically people who still do well in the market system can buy or rent where they want and anyone else can get free government housing. Similarly you would have a nationwide “food card” program which entities basically anyone to a generous food stipend.","Humanoid robots.Most scarcity is a function of labour costs. Everything we need requires labour: extracting raw materials, farming, transporting, manufacturing, retailing, everything. We've mechanised and automated a lot of this but humans are still needed to fill the gaps everywhere in the chain.When robots are able to reliably navigate our world, with common sense such as knowing how to open any door or handle any object, and can be \"hired\" as drop-in replacements to humans and given general directives, then we will start to replace these gaps.In the future there will be entire supply chains where the only humans present are those who own the various businesses involved. Robots will use our tools and machines to farm, transport and retail goods. Robots will maintain other robots. Robots will build our power plants and infrastructure.","Some would argue we're already somewhat post-scarcity although it's very unevenly distributed / badly organised for a huge multitude of reasons.Also some things are more scarce than others depending where you are in the world.","Similar to a near pre post ultra contra semi pseudo inner maxi demi con super tri mini scarcity society.","It starts with UBI. That will allow people to move to places with low cost of living and high quality of life, and bring jobs to them. Right now land owners and tax collector routinely conspire to maximize gentrification and conspicuous consumption, and get away with it cause that is where the jobs are.We have a practically endless supply of land that borders very big national forests (where water often comes from) and agricultural land. It is almost all owned by cattle ranchers (3% of the US is urban 80+% of the population lives there, 41% is used for growing cows). We could be building mixed use apartment buildings with local food production, abundant access to nature and public transportation; while avoiding all the gentrified land values, if income wasn't tied to the whims of established wealth.","One sign might be novel forms of language that allow three time related prefixes, 2 of which are incompatible opposites, in a single phrase.","Resources would be quietly throttled into a state of artificial scarcity to manage economic inflation and provide the tension needed to maintain social stability (power structures).Problems would slowly shift to more trivial versions of themselves (starvation is replaced with poor diet/nutrition from eating TOO MUCH the wrong things). Instead of fatal diseases that afflict us, illness is caused by simply wearing out over time (plague and infections are replaced by cancer, heart disease). Major injuries are the result of genetic predisposition or recreation, not dangerous labor or predators (getting crushed in a machine vs. falling from a rock face while mountain climbing).Then, a major population explosion. Then, Soylent Green! Then, Logan's Run! Then, Silent Running!","land would be the final fight. there is not unlimited land.","ELI5 of the the near-pre-post scarcity society:A near pre-post scarcity society is a stage where a society is almost at the point where almost everything people need, like food, clothes, and houses, can be made very easily and cheaply, almost like magic. Imagine if you could have all the toys you want without having to wait for your birthday or Christmas. In such a society, because it's easy to get what you need, people might work less for basic needs and more for fun or to make new and interesting things. It's like having a big, endless sandbox where you can build anything without worrying about running out of sand.","You may want to check out \"Pacific Edge\", a novel by SF writer Kim Stanley Robinson.","There's no such thing a \"post scarcity\". Unless there is limitless potential, there will always be scarcity. Our economic models depend on scarcity to react accordingly.Humans are greedy by nature. Let it be gluttony, lust, energy, materiality, etc. Scarcity is what keeps us tethered to a world of purpose.","Massively superior AI that takes over banking and replaces capitalism with real communism."],"points":29},{"text":["Salad grown in space: Experts reveal what meal astronauts should eat on long space missions","The following submission statement was provided by /u/Gari_305:From the articleThe ideal meal for an astronaut, according to experts, looks surprisingly similar to something you would find on a trendy food influencer's Instagram.After extensive comparative research, a team of researchers in Australia estimated that the \"optimal\" fresh meal for space travellers is a vegetarian salad.With long deep space missions planned in the future, the issue of feeding crews is getting more pressing. It’s not about pacing sufficient reserves anymore: it’s now about focusing on foodstuffs that can be cultivated in space.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19egmks/salad_grown_in_space_experts_reveal_what_meal/kjced1d/","From the articleThe ideal meal for an astronaut, according to experts, looks surprisingly similar to something you would find on a trendy food influencer's Instagram.After extensive comparative research, a team of researchers in Australia estimated that the \"optimal\" fresh meal for space travellers is a vegetarian salad.With long deep space missions planned in the future, the issue of feeding crews is getting more pressing. It’s not about pacing sufficient reserves anymore: it’s now about focusing on foodstuffs that can be cultivated in space.","The idea this is all that will be available to eat in deep space missions is total nonsense. Lab grown meat has become a reality, and that should be the main part of deep space, especially colonization of Mars diets. In addition to all the veggies.Of course nobody needs to be forced to eat even lab grown meat if they are vegaterain or vegan, but the efficiency of growing meat, different types of meat in a lab-vat, bio reactors is phenomenal. Plus the resources needed for such production can be compacted and easily transported over long distances and travel times."],"points":0},{"text":["Why China Could Surprise the World by Being the First Country to Adopt Universal Basic Income","The following submission statement was provided by /u/2noame:Submission statement:China is in a bad place post-Covid with record low consumer confidence, full of people saving their money when what they need most is people with the confidence and security to spend it.Universal basic income could transform China's population into the next consumer powerhouse if they were to implement it, and unlike most other countries, only one man is needed to decide China should do UBI, and they already have an urban minimum income guarantee.All of this combined with AI, could make China the dark horse winner of the race for UBI.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19eglin/why_china_could_surprise_the_world_by_being_the/kjcf1le/","Guy makes statements about China, can't even tell if a photo with huge advertisment billboards is in China or not.","This self-proclaimed \"unconditional/Universal Basic Income (UBI) advocate\" can't see the forest for the trees.China has a massive demographics problem, debt exceeding 300% of GDP and after years of inflating some of the biggest financial bubbles ever seen, is still a middle income country where the GDP per capita is in the same ballpark as Russia's.China cannot afford to implement UBI at a level that would turn it into the \"next consumer powerhouse\".","Tell me you have no clue how China works without saying it.","If they can print endless money for the wealthy then they can do it for the poor. At least until our actual resources run out.","Uhm what? They already tried doing a UBI back in the early 1950s.","If we look at the economic example of unemployment in France, I think that this is not a very good idea.","Tell me you know nothing about Asia without telling my you know nothing about Asia. Queue up generic \"Asian Neon\" photo from Japan when talking about China.","I mean, they are a communist regime for God’s sake, bout time they start acting like it.","It would be kind of funny if the entire developed world moves to UBI and lesser work hours for full time employment before America can even decide to have Universal Healthcare.","I just realized I do not understand China’s economy at all. I thought they were communist…do they not have some sort of UBI?","Fine by me. Productivity will become worse than Europes.","Maybe they can start first with eliminating spit oil and garbage/sewer oil use.","It’ll be a shame if said income disappears because you happen to post or say something that the CCP doesn’t like. Of course they wouldn’t use some kind of citizen scoring system that further restricts their basic rights anyway. So the “universal” part has one big asterisk beside it.","China is not the first country.Look at Qatari, a small, oil rich nation that uses the money to support its citizens.","It's almost certainly another method of citizen control. UBI will be contingent on their social credit score. Any infraction and it will be taken away. Once the population is dependent on UBI, this will be a massive deterrent for bad behavior.","yeah their UBI is likely to be the most controlled in the world though so if they are first, the conspiracy nuts will think we'll have exactly same","The Soviet Union had UBI. So did every other communist state in the 20th century.What's this \"first country\" stuff?","China has got very strict borders inside the country and is forbidding rural people to enter the cities unless special permits are granted. The reason is that China cannot afford to have the hordes of starving people without opportunities overrun the cities.","It doesn’t even have universal healthcare and it’s supposedly communist FFS!","They are supposedly a communist nation. The nation should be providing basic income, food, and shelter for the people, specifically the working class. If they are what they claim to be.I'll go with Biden calling Poo Bear a dictator, instead.i'm not even sure what their real political system is, at this point.","Isn't that like... a tenant of communism? No surprise","ellos pueden imponer lo que quieran son comunistas si no estas de acuerdo te vas a la cárcel o peores cosas te pueden pasar","Yeah, they'll give everyone 10 cents and call it UBI","Why? Because China is a communistAnd quoting Orwell, “All animals are equal, but some are more equal than others”","Instead of governments focusing on UBI which will cost lots of money and doesn’t reward people for who contribute to society I think a better approach would be to have government pensions that will replace closer to 100% of income in retirements. Funding will be for a lot less years and you would have to work and contribute taxes to the system in order to benefit from it.","Good luck implementing that with a shrinking population","They’re a communist country. Don’t they already have some kind of UBI?","Submission statement:China is in a bad place post-Covid with record low consumer confidence, full of people saving their money when what they need most is people with the confidence and security to spend it.Universal basic income could transform China's population into the next consumer powerhouse if they were to implement it, and unlike most other countries, only one man is needed to decide China should do UBI, and they already have an urban minimum income guarantee.All of this combined with AI, could make China the dark horse winner of the race for UBI.","The communist nation would surprise the world by implementing a communist solution to pressing domestic economic issues? Really?Yeah no, the only people being surprised by this are the morons so married to capitalism that they cannot envision a world that doesn't work on predatory economic principles.","The battle of capitalism vs communism is over and both sides lost. All the major world economies recognize you need a mix of incentives, regulations, and safety nets. The issue for the 21st century is what is the best mix to achieve technological advancement while also maintaining a quality of life rooted in social and financial stability.","That would HARDLY be a surprise. It's the Capitalust countries that are going to take their time realizing all the wealth and abundance created by AI must be shared with everyone or our system will collapse.","Lmao US be like that would help too many average and poor people so won’t be doing that ever. Here’s your 5 million dollar hospital bill for a bandaid though.","I'll bet money I know why they're doing this. If you control someone's income completely then you control them. They already instigated that weird citizen point system imagine what they can do when everyone's bank account is dependent on them.","Honestly, this would be a huge blow to the possibility of implementing this in the U.S.. The idiotic mainstream view in America is: If China does it, it must be bad policy.","China out here solving problems that western capitalism can only exasperate 😅","Food forests and milti-generational long lasting structures for housing. If the pre-Olmec can do it in the past we can do it today. Lets gooooo","It’s a smart idea so that’s how you know Xi would never go for it","lol and America “removed” is about to become America Jr, Canada is about to become America SrAs everything they do we seem to follow.I can’t wait to see this happen, and it better be optional, because I’ll deny taking it and just workI know this is going to come with some form of stipulation that I’m not willing to accept.","Ya seems unlikely. Not because of communism but or policy but because regular chinese people have a very social darwinism world view. Always hear something like you must work for x to get y, nothing is free, or handouts make ppl lazy. In every interaction its always companies and rich ppl who win, even in the courts when its obvious asf that there is violation of labor laws. Highly doubt ubi will pass","China is the least likely country to implement ubi - china is very anti welfareThis is also covered in length by their totalitarian dictatorship leader in his cult of personality book called xi xingping thought which Chinese people are forced to learn",""],"points":548},{"text":["Chickpeas Could Be the Key to Humans Living on the Moon - Chickpeas could provide a ready source of protein for future astronauts living on the moon, a new study suggests","The following submission statement was provided by /u/Gari_305:From the articleIf humans are to live and work on the moon and elsewhere in space, we're going to need a lot of food. Preferably flexible, protein-rich, easy-to-grow, easy to digest and above all, tasty, food. Something everyone likes. Something like hummus.In a new preliminary paper, a team of scientists have found a way to coax chickpeas to grow in a simulated lunar soil mixture, demonstrating for the first time that this super crop could help sustain future astronauts on the moon.The key to settling on the moon and eventually Mars will be to become as self-sustaining as possible. Future astronauts won't be able to rely on regular food deliveries from Earth; they will need to grow their own. That's part of the reason why astronauts on the International Space Station have spent years cultivating lettuce and tomatoes in microgravity to help supplement their diets.But growing stuff on the moon is even harder. Lunar soil isn't very fertile or nutritious — experiments using soil collected during the Apollo missions resulted in wilted and discolored veg. So the scientists behind the new study modified it using a mix of fungus and something well known to backyard gardeners: the poop of red wiggler earthworms, a highly effective fertilizer known as vermicompost.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19eg4fe/chickpeas_could_be_the_key_to_humans_living_on/kjcb446/","Gamble everything on a single crop and food source. What could possibly go wrong?","I always imagined moon soil to just be like the dust that comes from burnt paper","They would need to mitigate the fart factor....yeeeesh","They would need tahini and olive oils as well, garlic if they wanted it to not suck. Not as simple as “grow chicken peas, eat hummus”.","From the articleIf humans are to live and work on the moon and elsewhere in space, we're going to need a lot of food. Preferably flexible, protein-rich, easy-to-grow, easy to digest and above all, tasty, food. Something everyone likes. Something like hummus.In a new preliminary paper, a team of scientists have found a way to coax chickpeas to grow in a simulated lunar soil mixture, demonstrating for the first time that this super crop could help sustain future astronauts on the moon.The key to settling on the moon and eventually Mars will be to become as self-sustaining as possible. Future astronauts won't be able to rely on regular food deliveries from Earth; they will need to grow their own. That's part of the reason why astronauts on the International Space Station have spent years cultivating lettuce and tomatoes in microgravity to help supplement their diets.But growing stuff on the moon is even harder. Lunar soil isn't very fertile or nutritious — experiments using soil collected during the Apollo missions resulted in wilted and discolored veg. So the scientists behind the new study modified it using a mix of fungus and something well known to backyard gardeners: the poop of red wiggler earthworms, a highly effective fertilizer known as vermicompost.","I’ve seen a chick pee on your anus but never a chick pea on the moon.","Where’s the guy who ate chickpeas and honey for lunch everyday?","This study is brought to you by the chickpea growers assoc","If you get too much of your protein from chickpeas it causes a neurological disease called lathyrism. It causes permanent paralysis of the legs. Throughout history, this disease has been forgotten about and rediscovered.","What about the methane produced? As a potent greenhouse gas it could be used to warm up the atmosphere and turn it to a literate greenhouse? Lets go then! Let's boldly fart where noone has farted before","Humus for moon humans it is then …. Now I’m just filling my post up with words so it doesn’t get deleted for being too short 🙄","Dude.This country has a massive hard on for protein. No other things you absolutely must have to live. Just protein.","I always struggle with plants on the moon because where is the nitrogen and phosphorus coming from? You have to take that up with you, I know they will use ammonia for heat exchangers, but how much of that can you divert for growing plants. Even for nitrogen fixing plants like pulse crops, the N2 has to come from somewhere since the moons atmosphere doesn’t have it.","Mmmm chickpeas.Chickpea caprese salad with all the fixings. Lucky people. Whelp... I know what I want for lunch!","Forget lab grown meat, how long until we have the ability to construct the large organic chemicals we need without a plant or animal in between? Like can't we hack algae or something or even make robust designer cells to produce food from whatever is around? Seems we have the tools but not the understanding yet. Maybe AI will do the trick. having to grow food in space seems like a real vulnerability.","Im on that Lunar Chickpea Falafel.My Hummus came from the Dark Side of the Moon.Sipping Sapporo Space Barley with a bowl of Channa Masala.","Never thought chickpeas would be on the first line as space food, I was thinking something along the lines potatoes or anything that can grow vertically without need of a lot of soil.While food is one of the challenges for space life, we still have to figure out how to build life support modules, oxygen,protection from radiation, a gravity generator would be nice but alas, we still have much to figure out still.."],"points":48},{"text":["Humanoid robots will join BMW's production line - \"I think the next 24 months you'll start seeing humanoid robots in the real world,\" Brett Adcock, Figure's CEO and driving force, tells Axios.","The following submission statement was provided by /u/Gari_305:From the articleAdcock, a serial entrepreneur whose previous startups include Archer Aviation and Vettery (now Hired.com), tells Axios that his robots \"can do basically everything a human can.\"\"There's just a lot of work in these facilities that's really hard to automate,\" he added.\"Being mobile on the floors, being dexterous — there's a lot of work we can do.\"\"We need humanoid [robots] in the real world, doing real work — that's a big milestone for the whole space,\" Adcock said.Car production is evolving rapidly, and robots have \"the potential to make productivity more efficient\" and \"enable our team to focus on the transformation ahead of us,\" Robert Engelhorn, president and CEO of BMW Manufacturing, said in a statement.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19eg0v4/humanoid_robots_will_join_bmws_production_line_i/kjcaj8f/","All you need to know:When asked how Ford plans to cover the cost of its new labor contract, CFO John Lawler \"pointed to 'opportunities in automation,'\" per the Journal.Anyone paying attention knows the robot wars are coming.","In Germany as there are less children, and the big wave of Germans is nearing retirement. So Germany's great mega corporations will need AI robots and industrial automation generally, to keep production going.","From the articleAdcock, a serial entrepreneur whose previous startups include Archer Aviation and Vettery (now Hired.com), tells Axios that his robots \"can do basically everything a human can.\"\"There's just a lot of work in these facilities that's really hard to automate,\" he added.\"Being mobile on the floors, being dexterous — there's a lot of work we can do.\"\"We need humanoid [robots] in the real world, doing real work — that's a big milestone for the whole space,\" Adcock said.Car production is evolving rapidly, and robots have \"the potential to make productivity more efficient\" and \"enable our team to focus on the transformation ahead of us,\" Robert Engelhorn, president and CEO of BMW Manufacturing, said in a statement.","Robots are only going to take the pointless jobs at BMW like installing turn signals.","Why humanoid robots instead of just robotic arms on wheels or more automated assembly lines?","The coming decades will see the unskilled labor force (and much of the skilled labor force) made obsolete by robots, Androids, and AI.Buckle up, kids, it's going to be a bumpy ride.","In 24 months I expect multimodal AI models to be connected to robotic systems and trained on how to perform the repetitive tasks of assembly. 2 years.","On a very surface level, it's neat to see one of Asimov's theories playing out in realtime. Asimov argued that the best robots would be humanoid in design because it would make them compatible with the tools we already use, instead of needing to be purpose-built."],"points":45},{"text":["With the birth rate declining, employers will not be able to coerce employees into questionable actions","The sudden depopulation after the Black Death plague made a huge difference to the employer/employee relationshiphttps://history.wustl.edu/news/how-black-death-made-life-better","Don't worry, there will be plenty of fresh immigrants to fill the vacancies. The corporations and their political lackies will make sure of that. How do you think Canadian wages have been stagnant the last four decades? :D","Eh, imagine if everyone comes to the sudden realization that there is no afterlife that this is all there is, that their poverty has no redeeming qualities in the face of any god and that you only get one life, and you get to grind that away while someone else was born into wealth. How many people would sit down and take it day after day?","Do not underestimate the ability of humans to make this change work to a complete disadvantage for the average man or woman.","That's what motivates regressive policies around birth control. They don't care about children, they care about consumers and laborers. If not enough people are being born the liberal approach is to relax immigration requirements while the conservative one is to outlaw abortion and tax contraceptives and other forms of birth control.The problem with the liberal response is, you bring in immigrants to work non union, minimum wage jobs but where are they going to live if even a bachelor suite costs more than they make each month? The result is you'll have 2-4 people living in a studio apartment(assuming a landlord will even rent to a family or squad of men/women looking to rent a unit designed for a single person). And the foreign workers with degrees are starting to leave too because their buying power isn't what they were lead to believe it was. https://www.reuters.com/world/americas/canadas-surging-cost-living-fuels-reverse-immigration-2023-12-09/People are seeing the value of their labor diminish in real time and they're responding by unionizing, striking, trying for another job or just straight up leaving. The assumption that foreign born workers will put up with abuse is being challenged by the fact that they have access to social media and can learn directly from people in similar situations. It's not hard for an Asian or Latin worker to create a reddit account or type in \"workers rights[country]\" into a search engine.  This also doesn't account for the level of bigotry in the local population that can hurt the reputation of the country as a place to move to or the clash of values if the new arrivals don't agree with the social rules of the country.The conservative response is of course to curtail freedoms and people won't like that either and just resort to things like refusing to even get into relationships or have sex. Something that is already happening anyway. https://ifstudies.org/blog/theres-no-huge-gender-gap-in-being-single-among-young-adultsThe rates of single and unmarried people continues to grow. So if you're out here as a single man or woman, working a job that is unsafe or low paying, there's nothing forcing you to stay. I personally can identify with the feeling of knowing that I can get up and leave because I'm not tied to an asset(mortgage) and don't have dependent children or a partner who may want to stay in their job or who is dependent on my income. And if I'm also a worker who is good at what he does, it creates even more of a challenge for the employer. They'll lose money by having to retrain another applicant who may not even stick around as long after getting the job and seeing what it's like.Again the role social media plays is that it debunks corporate talking points and half truths. People right now are making videos and posting comments about what it's actually like to work at _______ industry or with _______ employer. They don't really have any response to that since the legacy news outlets they own are being contradicted by independent news sources or actual employees on the ground telling their own story on social media.","I think declining birthdate is the best thing that can happen to humanity.More resources and space for the rest, better working conditions, less oversaturated informationflood, less criminality, less pollution, less waste, etc.I only see positive sites on that.","In Canada we just keep bringing in more people to make up the difference. This is bringing down wages or holding them steady. I worked in a factory doing twelve hour rotating shifts and two or the people I worked with had masters and multiple people had bachelor's degrees. Ten years ago the requirements for that job was grade 12. We will not have any more negotiation power in the future, there will be large supply of people with advanced degrees waiting to get out of McDonald's job an do yours. We haven't even touched on automation and AI yet, either.","You make an excellent point. I think the demographic changes among the generations post-Boomer is already being felt in the economy. Declining birthrates are definitely a part of the psychology driving how people run and organize their lives. I've heard the term \"YOLO Economy\" used and think it applies here:https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&cad=rja&uact=8&ved=2ahUKEwiCge2Ej_aDAxWVFTQIHQeTBP8QFnoECBUQAQ&url=https%3A%2F%2Fwww.bbc.com%2Fworklife%2Farticle%2F20231130-why-americans-yolo-spending-attitude-baffles-economists&usg=AOvVaw12P5Idn_c5zzuVSurJAcJN&opi=89978449Not raising children puts people in a different place mentally and emotionally than those burdened by the long-term responsibility of caring for others. People may be becoming less worried about stability, the future, owning a home, and other things that are becoming out of reach anyway in America. With so few replacement workers in the queue and a YOLO attitude, perhaps people will fight their bosses harder. If they do, and the OG poster's premise is true, corporate America brought this on itself with its greedy, selfish overreach and promotion of the almighty dollar.Whatever the causes and effects really are, declining birthrates are here to stay. America values only money. Things that cannot be monetized have no value. How do you monetize a child? Their value is clearly infinite in that the rest of us cannot care for ourselves in old age without them, and the species goes extinct without them, but you will find almost no help from America to raise a child here. It is an enormous financial burden for the individuals that do. I know. I raised two wonderful children who are now productive adults, but it was not easy. We scrimped, saved, and sacrificed the whole way and are now in a much worse financial position than we would have been without kids. I could have easily retired years ago if I had not made a choice to have a family. This is my punishment in America for doing something for the common good instead of for myself. Selfishness pays big time in America.","1.5 billion starving Indians are ready to be abused. Billionaires already bringing them in hordes. https://www.statista.com/statistics/273000/estimated-migration-balance-by-continent/","I think you need to look at the whole picture, birthrates decline sure but immagration makes up for that 10 fold. Since WW2 the west has used immagration to address the loss of life of the war and then later a decline in birthrates.Employers only care if they have people to do the job and if they can't get native employees they will get them from abroad or actively lobby the government to bring in more. So we are pretty much on a skyward climb in population that we won't see go down in our lifetimes.","Yes... except for AI making the number of human's needed by a company far each year.You're right that the demographic shrinkage will put companies (and the economy and the entitlements that depend on it) in a bind but AI is hitting at exactly the right moment to cut the binds.We're at a really strange moment in history. It's unique in several ways at once. Demographic collapse is happening to drive us all into poverty. The US is pulling out of it's international roles which is causing a power reshuffling among countries. AI is here to cause economic growth like never before at the same times it pulls all money out of the hands of the labor class.I can't think of many leaders who could successfully pull us through one of these infection points, let alone 3. Someone is going to make a miscalculation.","Eh, if the world population cut in half it'd be a world back to 1974 population levels. It's not some unknown unforseen world of population levels never experienced before in history or anything.","Also less people applying for jobs means companies may need to start looking seriously at reducing turnover.","There's no real basis for this. If anything the historical evidence argues completely against you.Case in point, roll the clock back ~50 years. Women joining the workforce to the extent that they participate in modern times should have cause the same situation you currently suggest. Yet instead it's now gotten to the point where having one parent stay at home is considered the exception rather than the norm.Reality is that whatever the new normal becomes in terms of income and children, wages, prices, and expectations will rise to maintain the status quo.The most likely outcome from your scenario is that raising kids gets more expensive for parents as a ton of people say \"I'm not having kids, why should my taxes go towards someone else's kids\"My town just went through a vote to approve full day kindergarten. I think the average tax bill per quarter went up something like 3%(e.g. up to $12,400 vs $12,000) for most residents, and you wouldn't believe the outrage from those who don't have kids. With declining birthrates, that viewpoint is likely to grow.No-kid individuals aren't going to \"win\" it's parents who are going to \"lose\" in order to keep the balance. The same way dual income families didn't \"win\" by having women join the workforce, things just adjusted so that single income families \"lost\"Note: I'm not saying women joining the workforce is a bad thing or getting into the complexities of male/female power balance by having one gender work. I'm only using that point as a recent example where the average family suddenly had a sudden significant shift in financial status.","Yes. Also with population decline, there will be less workforce in the market, so employees will be treated better as they will become valuable resource. Companies will have to complete for skilled workers offering higher wages and additional benefits. Population decline very good for us.","They will preempt labor loss due to population decline with AI/robotics and fill the cracks with immigrant labor.Unfortunately, this is cope.","Germany success employment issues with migrants. If trends are maintained, It would take decades before an issue rises. If ever.","Yeah, people are missing two things:Not everyone wants to abandon their home country to live somewhere else (Also, the entire population of India, Africa, or other countries can't immigrate to the US).And the birth rate problem is getting worse for a lot of countries in Europe, Asia, and (obviously) North America, there's not enough immigrants to help all of them (even if we were to exclude Asia since they don't like immigration too much).","This is why robots and AI are being pushed so very very hard right now. We're going to have a labor shortage in the west for the foreseeable future. The effects of this shortfall are already being seen in increased labor action. The inverted demographics pyramid many countries are seeing isn't something our current way of doing things is prepared to deal with. How will we pay for all these retirees?This goes beyond just labor concerns; it will touch everything in society. Housing, transportation, geopolitical posture, all will have to adapt in ways they've never had to before. This plus side is fewer people will be a boon for the environment."],"points":231},{"text":["[in-depth] Metabolically armored CAR-T cells demonstrate lasting efficacy against solid tumors","The following submission statement was provided by /u/ConfirmedCynic:Submission statement:CAR T cell therapies have shown remarkable success against blood cancers but not so much against solid tumors. The T cells quickly become exhausted and ineffective in the tumor microenvironment, failing to eradicate the tumor.Here, the engineered cells have been reinforced to secrete IL-10 into their environment. They can then reabsorb it and thereby remain invigorated.Not only did this work to destroy cancers in mice, but they also achieved a 100% success rate in their eleven human patients.Additionally, a smaller dose of cells (about %5) is used compared to conventional CAR T cell therapy, reducing the cost.If this proves out in larger trials, it will be transformative. Not only will much human suffering be eliminated but years of medical treatments and therefore costs will be eliminated as well.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19ed7ca/indepth_metabolically_armored_cart_cells/kjbtq0k/","Submission statement:CAR T cell therapies have shown remarkable success against blood cancers but not so much against solid tumors. The T cells quickly become exhausted and ineffective in the tumor microenvironment, failing to eradicate the tumor.Here, the engineered cells have been reinforced to secrete IL-10 into their environment. They can then reabsorb it and thereby remain invigorated.Not only did this work to destroy cancers in mice, but they also achieved a 100% success rate in their eleven human patients.Additionally, a smaller dose of cells (about %5) is used compared to conventional CAR T cell therapy, reducing the cost.If this proves out in larger trials, it will be transformative. Not only will much human suffering be eliminated but years of medical treatments and therefore costs will be eliminated as well.","The submitter, /u/ConfirmedCynic has indicated that they would like an in-depth discussion.All comments must be greater than 100 characters. Additionally, they must contribute positively to the discussion. Jokes, memes, puns, etc. will be removed along with anything that is too off topic.A reminder to respect others. You may disagree, but state your objections respectfully.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":7},{"text":["Swap out not chargepoints","Nio already do this.There are advantages and disadvantages. Unfortunately, as voltage increases and battery tech evolves, the advantages reduce faster than the disadvantages, so ultimately it will not succeed.It makes sense for small scooters. But when a 800V vehicle can charge 50% in 10 minutes there's not much point.","These exist, here you go:The problem is that battery packs have to be HUGE if you want good range (they're usually the entire floor of the car, and structural) so the pack from a Tesla would never fit in smaller car, the pack from a Hummer EV weighs as much as some smaller cars entirely, the pack from a Leaf or Bolt would give a larger vehicle terrible range and leave a large gap behind... Porsche might use far higher performance batteries for weight & space reasons while a pickup or minivan might use bigger heavier cheaper batteries.Swapping out a huge heavy high-voltage high-power thing across hundreds of different shapes & sizes of car is not easy to automate and risks problems like damaged connectors or attachment hardware. Battery packs don't just have a big + and - terminal like an AA battery, they have entire battery monitoring systems to connect into the vehicle's system as well as complicated liquid cooling which would need expensive dry-break connectors and be a source of leaks or other problems after lots of swaps.Plus the swap station needs a stock of battery packs - given that the battery pack can be 30-50% of the cost of a car you're asking every swap station to have potentially hundreds of thousands of dollars of battery packs just sitting around on charge.","On the face of it this sounds sensible, but it doesn’t work because of battery wear. One battery is not equivalent to another except at initial rollout from production line.Batteries gradually lose function as they are charged and discharged. A new unused battery is much better than a battery with a few hundred charge cycles, better still than one with a few thousand cycles etc.For this to work you’d need a couple things: 1. A rapid and cheap test to comprehensively assess the state of the battery (this is actually quite hard, you can do the test but not quickly) 2. A generally agreed adjustment pricing mechanism - a variable fee or rebate paid or received by the driver based on the difference between the two batteries. This fee could easily run into the thousands if someone turns up with an old and very used battery, and the swapping station doesn’t have anything of a similar age there.","attendant pulls out the drainedAre you under the impression that EVs run on AA batteries?The battery packs in cars weigh hundreds of kilograms and take up basically the entire underside of the car. They're huge and heavy.You need complex and extensive infrastructure to just remove and replace one, not to mention storing them.Yes, there are swappable pack cars and stations prototyped already, and they're exactly the pain in the ass people think.","If we can figure out a battery chemistry with enough energy-density to not weigh 1,800 pounds this would be great.","Different cars, different brands, different batteries and different ranges. I would be majorly pissed if I got my Tesla battery taken out and it got replaced by a Audi or Volvo one fcking up my range.What you are proposing is turning car batterij into \"commons\" where people would properly interact with it without any personal gain beyond being able to drive. Where it is actually a marketable item run by large corporations. They are not going to adhere to these rules, take for example how long it took to have Apple adapt their chargers.A different version of \"commons\" are park benches. There are also universally to be used by everyone. Yet even these get destroyed, or turned into a spiek bed so homeless people cannot sleep on it. Commons are a very though concept within society and those freeloaders within society will take advantage of it.Example: I buy a cheap EV with a shitty battery, run to the charge point, get it swapped to a high end Tesla battery. Sell the car with it's upgrade.","So, imagine changing your tires every 100 - 399 miles. Thats the minimum time and nuisance that I would think this would entail. And also, everyone else has to do this too.It is not practical in the least. A car is not a weed-wacker with a battery pack.","Pretty sure I remember seeing a Tesla patent (or some other EV company) for battery switching EV cars like 10 years ago. The issue, if I’m remembering correctly, was the massive cost of building the battery switching stations. There’s also the issue of getting a worn out battery that won’t hold a charge well. There were other logistical issues, but the primary reason it was scrapped was the cost.","Getting electric vehicle to be economically viable has been a massive engineering challenge, and that's without any restrictions on design and implementation, outside of standard vehicle safety regulations. Enforcing some kind of standard battery technology would be an enormous burden on an already difficult industry, not just because it would slow innovation but it would also increase the complexity of every car by having removable parts. It would likely cause more issues than it solves.","Ask yourself why gas changed to self serve. When you figure that out, apply the same logic to a battery swap. That should clear it up for you.","At least one of the chinese ev manufacturers tried this. I think they gave up. An automated battery swap system is quite an engineering feat. Having a person do it manually safely requires quite a bit of training. They found it was actually quite costly and slow to run a battery swap system.I just charge mine at home and the system times it for when power is the cheapest. It's like charging my phone. Very convenient at home. I wouldn't want to have to drive somewhere and swap a battery. I look after my battery really well and wouldn't want a random one.","I’ve heard this proposed before, and it sounds like a good idea to me, assuming the batteries and infrastructure can be made workable enough to be feasible. Also eliminates the problem of battery performance degrading over time.","In Australia we have a similar system for barbecue gas bottles","newgen EVs have batteries embedded in their unibody. the answer is to build them out of supercaps (near unlimited lifespan, much larger dissipation capacity, charge in a few minutes)... of course algae biofuel is the now-solution that also offers a means for global CO2 +/- regulation (you can't suppress this forever, big oil).","A battery in an EV is not a small, generic component. It's the center of the whole vehicle. Imagine if you tried to swap the engine, transmission and exhaust in an ICE. Even if it was useful, it would just not make sense, there's no way you could make every car powertrain-compatible, make the swap quick and efficient and making people accepting that they will be getting a powertrain that might not be in as good shape as their current one.A battery swap that's vehicle-agnostic would be just as hard given how tightly integrated they are into the vehicle (in some, like the Tesla Model Y and the Cybertruck, it's actually the main structural component, equivalent to the vehicle's chassis, and things like the seats and floor pans are mounted directly on it). And given the very small benefit for the vast majority of drivers who charge at home (saving maybe fifteen minutes once a month), it would only make sense to a tiny minority of drivers.","Tom Scott recently did a vid on a company running swap stations: https://www.youtube.com/watch?v=hNZy603as5wA problem beyond just the simple one of figuring out a standard that every manufacturer would be willing to agree to is that the change stations have to be automated (batteries too big for attendants to manhandle, plus nobody's going to want to invest in having to hire back loads of attendants years after self-service came in), and therefore big and bulky (basically the same size as an auto car wash). So even if you match the overall speed of a gas refill for an individual car, your throughput on the same amount of land will be reduced versus an equivalent gas station. And you have to develop a whole new logistics system to deal with the batteries - it probably makes sense to charge them on-site rather than ship them back and forth from centralized charging hubs, but if you're going to be installing high-power charging anyway... then you've basically made yourself an EV charging station already without the extra cost of having to build a complex and large auto-swap station as well. (Plus there's the fact that if a charge takes ~15/20 minutes each time you increase your retail revenues from people taking the break to buy food/drink/other goods - lots of retailers and service station companies are perfectly happy with customers being forced to hang around for a few minutes longer each time they visit).It's a nice idea in practice but it just seems like something that would only have a niche application as the existing EV charging station setup is less expensive and complex (like in the video, where the company is pitched to a higher-wealth market willing to pay for the extra convenience).Where it will probably come in is in commercial and industrial sector applications though - think trucks picking up from mines, ambulances, buses, military vehicles, etc. Sectors with large fleets of vehicles of limited variety, and where there's a priority on being able to limit downtime between stops.There's also maybe some potential in the car rental sector, where companies like Hertz are unhappy that their shiny new EV fleets are generating less revenue due to taking too long to reach full charge between bookings. But their customers have to be able to also charge out on the road, which again presents the same problems as before.","Cool thanks. Your point is well made. I hadn't realised charging could be so swift.","Here's a look at an \"At Home\" battery pack swapper. Search Youtube for: SWAPPER COMMERCIAL1. This is an animation showing a swap in about a minute.Link: https://www.youtube.com/watch?v=EdFlZvGPkbk"],"points":54},{"text":["Electric cars will never dominate market, says Toyota","The following submission statement was provided by /u/paulwesterberg:I find it interesting that one of the world's largest automakers thinks that the world market share of electric vehicles will never exceed 30%.Even now as exponential growth of EV sales has been demonstrated worldwide and many markets(EU, China, California) are nearing that level already. Batteries, vehicle development, and assembly costs are all declining as well for companies focused on producing EVs in volume.It appears clear that Chinese automakers and Tesla will soon supplant Toyota even in their home market of Japan but the company appears to have rededicated itself to combustion, hybrids and hydrogen drive-trains.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19e7v3q/electric_cars_will_never_dominate_market_says/kjawqxh/","Why would they do this. They led the hybrid market then just more or less giving up on EV","Toyota: we put decades of our money on another competing gas alternative, of course don’t consume what we’re not producing.","\"The horse is here to stay but the automobile is only a novelty—a fad.\" - The president of the Michigan Savings Bank advising Henry Ford's lawyer not to invest in the Ford Motor Co., 1903","They keep saying this, but they keep building EV concepts: https://www.theverge.com/2023/12/5/23988111/toyota-ev-concept-urban-suv-sport-crossover and plan to release 6 new EVs to Europe in 2 years? Something doesn't jive.Also, love getting 58mpg in the new Prius, never buying a b1234xyz.","Real film is the only way to photograph, digital will never match the quality of...Steaming will never replace physical media, people like to own...People like to be able to see in person what they are buying before paying...","It's so ironic to me that Toyota is this way. They're probably the only legacy automaker that I'd trust to make a really reliable EV.","\"640K ought to be enough for anybody.\"-Bill Gates, 1981, speaking about computer memory","They would if Toyota produced more than 500 Rav4Prime per year. (Or whatever the number is. I've been 2 years on a waiting list and couldn't get one)","Theyre pulling blockbuster, wonder how it will end up 🤔","Electric cars will never account for more than a third of the market and consumers should not be forced to buy them, the boss of Toyota has said.https://cleantechnica.com/2023/12/01/26-bev-share-in-china-china-ev-sales-report/#:~:text=Full%20electrics%20(BEVs)%20alone%20accounted,by%20the%20end%20of%202023%20alone%20accounted,by%20the%20end%20of%202023).BEV sales already make up 26% of the market share in China in 2023. I am optimistic it will make up one third of the market share this year. If China can do it, its going to take off in other countries as well.Toyota is so behind in mindset, its shocking.","Wow all of a sudden, a wave of anti-EV propaganda lately. What happened?","Well you know Kodak said digital will never replace film cameras in photography. Sometime people are just wrong.","\"never\" is a long time. thats a silly statement to make.","That’s a bold statement. Not surprising considering they poured all their money into hydrogen tech.","His reasoning is sound, at least for now. A billion (as quoted from the article) live without electricity. That’s a big hurdle for EVs.Then again, not sure how many of those people are in the market for a new car but 🤷‍♂️","Toyota will never dominate the car market, says Toyota.","Hmm, but Tesla has the most popular sedan and CUV in California, and China hit 25% for sales being EVs with projections to cross 40% by 2027 and 50% before 2030.","This uk newspaper is firmly biased against renewables and EVs.They reprinted as fact that EVs would cause multi-storey car parks to collapse, copied from a troll who rewrote an article which had stated that some very old car parks possibly hadn't accounted for modern cars becoming so big and heavy with EVs being a bit heavier still.I could go on with other examples.Just read the comments on their articles, which only paid subscribers can leave AFAIK, to see that this is how they pander to their readership.","Alt title; Automobiles are a passing fad says buggy whip manufacturer..","I wonder if they also think Wi-Fi and smartphones are a fad too. Long live dial-up and rotary, I suppose.","I recently had the option between a tesla model 3 and a toyota BZ4X (BEV SUV) and the comparison makes Toyota look like an absolute dogshit company. The car look hideous with awful range and bog standard toyota interior. (eg it looks like a base model corolla) All of that and it's somehow MORE expensive than the model 3 long range. (by a few hundred bucks but still... it should be 10k cheaper)Toyota has put precisely zero effort into EVs and it shows. They let themselves fall way behind the competition and now, rather than buckling down and catching up, they trying to destroy the entire market.","Well that's not so strange coming from the company that invested heavily in hybrid solutions early on and see their hydrogen fueled car as the way forward.","EVs have grown their market-share by (on the average) approximately +50% per year since 2010. In that time they've multiplied their market-share by a factor of something like 200. (that's what exponential growth does!)It's a VERY bold prediction that though market-share has multiplied by a factor of 200 -- it will stop growing RIGHT NOW -- and \"never\" do even a single doubling more.It's like looking at this sequence of numbers:0.1 -- 0.15 -- 0.23 -- 0.34 -- 0.51 -- 0.76 -- 1.14 -- 1.7 -- 2.6 -- 3.8 -- 5.7 -- 8.6 -- 12.9 -- 19.4And THEN to predict: This series will NEVER cross 30.If growth continued on the same trend, that'll happen in 2 years. In reality I do think it's likely that the transition slows down a bit as the numbers go up, so it might well take 3-4 years rather than just 2. But never is a ludicruous prediction.","Akio Toyoda's comments are focused on the next decade, suggesting that while electric vehicles will increase their market share, they will not become the overwhelming majority. the title is somewhat misleading by omitting the timeframe and the broader context of Toyoda's \"multi-pathway approach\" to future car technologies.He emphasizes that customers should choose what kind of cars they want to drive, not regulators or policies.","Then what will? It can't be gas, there's a finite amount left.","They are trying so hard to discredit the EV market because they took a hydrogen fuel cell gamble and lost.EV vehicles are definitely the future, especially when battery technology improves.","Why not? I already know people whose main car is electric and they are pretty pricy for the local market and don't have wonderful range + winters get cold here.If they are already chosen as the main driver while being still quite disadvantaged I don't see why they can't over take it in the future once they get better and cheaper + second hand market becomes bigger.","We need infrastructure for EVs before they're going to become mainstream. The game changer will be when you can find a charging station nearly as easily as a gas station or if you can get ridiculous range on a charge. You also need to be able to charge up in under 15 minutes.","Might be true in Japan but seems very unlikely in the US. Hydrogen would require an entirely new infrastructure while the electric infrastructure already exists everywhere in the US all people need to do is install chargers which is relatively easy. Also if you talk to anyone who has an electric car not having to go to the gas station is amazing. EVs are so much more convenient than fuel powered cars other than on road trips but that’s getting better day by day. Really the only issue with EVs right now is if you don’t have a place at home for a dedicated charger which I believe may be one of the main problems with electric cars in Japan. In the US where pretty much everyone has some sort of dedicated parking where installing a charger is a non issue.","The second there’s a problem with petro supply EVs will dominate. Just like we are three missed meals from chaos, so too are we three missed fill ups away from chaos.Our hypocrisy knows no limits.","\"640K ought to be enough for anybody.\"-Bill Gates","Ever hear the Blockbuster video story? Told Netflix to kick rocks and that on demand video service wasn't the way of the future.... Oh boy we're they wrong.","Never exceed 30%, kind of like we will never need more then 4 megabytes of RAM.","I said this coming out of pandemic. if we want to save humanity, we need to retain work from home if all possible. Electric cars will always be a \"some of us\" thing and Americans will never go all in on public transportation. We had our chance to shift the curve on automotive carbon emissions and we blew it. Corporate America's drive to get people \"back to work\" may have been the final straw in out ecologic coffin.","Show me on the doll where the electric car hurt you.","\"Digital cameras will never dominate the market\" - Kodak","I couldn't wait to buy a Corolla GR when they advertised them for $30,000. They are not $30,000. Maybe I'll go electric, then.","As soon as someone releases an electric car around the sub 20k mark it’ll change. Why do you think they do so well in china?","I find it interesting that one of the world's largest automakers thinks that the world market share of electric vehicles will never exceed 30%.Even now as exponential growth of EV sales has been demonstrated worldwide and many markets(EU, China, California) are nearing that level already. Batteries, vehicle development, and assembly costs are all declining as well for companies focused on producing EVs in volume.It appears clear that Chinese automakers and Tesla will soon supplant Toyota even in their home market of Japan but the company appears to have rededicated itself to combustion, hybrids and hydrogen drive-trains.","Electrification is the future - cars, heat pumps, water heaters, etc. The burning of fossil fuels by individual consumers is going to end. The current market for EVs has been exaggerated, but it is not shrinking. While EVs have issues in terms of reliability and annoyances, hybrids are the style of car most likely to catch fire compared to ICE and EVs. The hybrid was always a transitional tech for cars in spite of its success in things like trains.","In 1943 Thomas Watson, chairman of IBM, said, \"I think there's a world market for maybe five computers.\"Who cares what a commercially exposed company executive says.","Meanwhile; the best selling car of 2023 in the world was Tesla Model Y. Toyota, go home, you are drunk.",""],"points":6019},{"text":["Nuclear goes backwards, again, as wind and solar enjoy another year of record growth","The following submission statement was provided by /u/HairyPossibility:The nuclear renaissance of the late-2000s was a bust due to the Fukushima disaster and catastrophic cost overruns with reactor projects. The latest renaissance is heading the same way, i.e. nowhere. Nuclear power went backwards last year.There were five reactor start-ups and five permanent closures in 2023 with a net loss of 1.7 gigawatts (GW) of capacity. There were just six reactor construction starts in 2023, five of them in China.Due to the ageing of the reactor fleet, the International Atomic Energy Agency (IAEA) anticipates the closure of 10 reactors (10 GW) per year from 2018 to 2050.Thus the industry needs an annual average of 10 reactor construction starts, and 10 reactor startups (grid connections), just to maintain its current output. Over the past decade (2014-23), construction starts have averaged 6.1 and reactor startups have averaged 6.7.The number of operable power reactors is 407 to 413 depending on the definition of operability, well down from the 2002 peak of 438.Nuclear power’s share of global electricity generation has fallen to 9.2 percent, its lowest share in four decades and little more than half of its peak of 17.5 percent in 1996.According to a report by the IAEA itself, the Agency’s ‘high’ forecasts have consistently proven to be ridiculous and even its ‘low’ forecasts are too high — by 13 percent on average.Nuclear power won’t increase by 80 percent by 2050 and it certainly won’t triple; indeed it will struggle to maintain current output given the ageing of the reactor fleet and recent experience with construction projects.China’s nuclear program added only 1.2 GW capacity in 2023 while wind and solar combined added 278 GW. Michael Barnard noted in CleanTechnica that allowing for capacity factors, the nuclear additions amount to about 7 terrawatt-hours (TWh) of new low carbon generation per year, while wind and solar between them will contribute about 427 TWh annually, over 60 times more than nuclear.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19e46dt/nuclear_goes_backwards_again_as_wind_and_solar/kja4k4h/","And I can't really see how nuclear is going to recover. Where I live we are still waiting for plants announced in 2008 - 2010 to be finished, and in the meantime advancing renewables have crashed the price of electric far below the then market rates, and these plants have been guaranteed unit prices well above even that. When they do come online these plants will look like white elephants and further discourage any new construction.Any new project announced today probably won't come online until about 2040. By that time its difficult to see how they can possibly compete with the by then current generation and storage grid.Where does the political will to build more fission come from after that? Who is taking big political risks to build something that no longer looks very useful?","Nuclear isn't likely to get over this as long as we have huge swathes of unused, non-arable land and near-shore wind capacity relatively close to high demand markets.Once the cost of moving energy from high land use renewables starts getting prohibitive, we'll be looking at nuclear again.","At the same time, most western nuclear plants in construction are delayed by years and billions over budget.Like Hinkley Point C, which now faces a delay of another four years and will cost another £2.3 billion: www.theguardian.com/business/2024/jan/23/hinkley-point-c-could-be-delayed-to-2031-and-cost-up-to-35bn-says-edfAnd even if these plants are actually finished, they will be significantly more expensive for the consumer than renewables. And this is already with todays prices, in 10 years renewables prices will have fallen by a lot more.","The nuclear renaissance of the late-2000s was a bust due to the Fukushima disaster and catastrophic cost overruns with reactor projects. The latest renaissance is heading the same way, i.e. nowhere. Nuclear power went backwards last year.There were five reactor start-ups and five permanent closures in 2023 with a net loss of 1.7 gigawatts (GW) of capacity. There were just six reactor construction starts in 2023, five of them in China.Due to the ageing of the reactor fleet, the International Atomic Energy Agency (IAEA) anticipates the closure of 10 reactors (10 GW) per year from 2018 to 2050.Thus the industry needs an annual average of 10 reactor construction starts, and 10 reactor startups (grid connections), just to maintain its current output. Over the past decade (2014-23), construction starts have averaged 6.1 and reactor startups have averaged 6.7.The number of operable power reactors is 407 to 413 depending on the definition of operability, well down from the 2002 peak of 438.Nuclear power’s share of global electricity generation has fallen to 9.2 percent, its lowest share in four decades and little more than half of its peak of 17.5 percent in 1996.According to a report by the IAEA itself, the Agency’s ‘high’ forecasts have consistently proven to be ridiculous and even its ‘low’ forecasts are too high — by 13 percent on average.Nuclear power won’t increase by 80 percent by 2050 and it certainly won’t triple; indeed it will struggle to maintain current output given the ageing of the reactor fleet and recent experience with construction projects.China’s nuclear program added only 1.2 GW capacity in 2023 while wind and solar combined added 278 GW. Michael Barnard noted in CleanTechnica that allowing for capacity factors, the nuclear additions amount to about 7 terrawatt-hours (TWh) of new low carbon generation per year, while wind and solar between them will contribute about 427 TWh annually, over 60 times more than nuclear.","Record growth! Again!   How does this have 1/10th the upvotes as doom and gloom articles?","Good.I know it’s an unpopular idea around here, but humans have proven they can’t be trusted with the responsibility.Does anyone here not see how Russia has used Ukraine’s nuclear plants as leverage in war?Let solar and wind do the job. Not something we have to spend money to babysit forevermore.Fingers crossed we one day invent the tech to deal with the nuclear waste we’ve already created.","Nuclear is the cleanest per watt power generation we currently have. If it wasn’t for the anti nuclear lobby priced per reactor would be much lower.","Nuclear construction and research is being activelly supressed by overregulation to inflate solar and wind, due to subsidy business.","Yeah, I'd say don't consider this too short term.Renewables are on a good run, because they're reduced the cost down to near the price of the raw materials plus installation costs, but that doesn't leave room for much improvement. Meanwhile though, as volume scales up, those raw materials are not going to meet demand (there would have needed to be a decade long lead-up of investment in mining which didn't happen), and that's going to drive prices up a lot. Even if price fixing is applied, the material volume isn't going to be there.On top of this, these renewables, aren't actually renewable themselves. The cheap manufacturing processes don't allow for overheads like making them suitable for recycling. As the renewables market increases, and some of the older installations reach end of life, we're going to see tremendous piles of un-recyclable junk.","Enjoy the growth and utilize lessons learned for newer fission-fusion concepts to ramp up power density. I think there is a strong chance to utilize full-spectrum solar panels as part of the direct conversion process that nuclear power has needed for quite some time. Thankfully Helion is working on a direct prototype but I’m wondering if NASA’s LCF concept needs to be explored further. Solar will beat out with land prices, nuclear will win out with mobile applications once we stop relying on neutrons to heat water."],"points":53},{"text":["India announces scheme to install rooftop solar on 10 million homes","The following submission statement was provided by /u/nadim-roy:Indian Prime Minister Narendra Modi has launched the Pradhanmantri Suryodaya Yojana scheme for residential PV. Indian households could technically deploy more than 640 GW of rooftop solar.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19e39hh/india_announces_scheme_to_install_rooftop_solar/kj9xvt5/","GOOD! Great for reducing emissions and also for providing resiliency against grid disruption, two things India is working on.","Indian Prime Minister Narendra Modi has launched the Pradhanmantri Suryodaya Yojana scheme for residential PV. Indian households could technically deploy more than 640 GW of rooftop solar.","This should be worldwide financed by the world bank. In the US and other high income countries, rooftop solar should be mandatory on every roof. If this was financed by the govt, the US would become #1 in solar production and installation rapidly.","Anyone else reading this thinking shouldn’t this have been rolled out a long time ago? What am I missing?","How about they stop polluting the River Ganges, which would benefit more people than putting solar panels on shacks that will be destroyed or stolen","Scheme? Are they installing them at night in secret?"],"points":54},{"text":["Which are your predictions for dating in the future and especially online dating?","They haven't failed. They are working perfectly. They work well enough to keep stringing you along. They are there to part you from your money.","Tinder (match.com) dominated for the past ~10 years and I think the next wave of online app will be AI chatbots and companions. I tried a few of them and I must say I'm enjoying occasional chats on Alphazria.","Star-trek style holodecks. Lock me in and I'll never come out again.","If they wanted you to find your match you would be able to filter profiles by key words used to describe themselves in profiles.If a girl described herself as goofy , up beat, silly, enjoys puns, fun, ect I could match very quickly.Currently dating someone I found on hinge. We're getting along very well.Surely a good app will figure this feature out and take off for everyone's benefit.","AI will begin being used for matching with online dating and will become increasingly effective at selecting partners. It will be able to find hook ups, short term and long term partners with astounding accuracy. Whichever app becomes best at it will eventually earn Verb status the way that Google did for search. People will say, \"I'm ready for a long term. I'm going to XYZ one.\"","Online dating will continue to increase. How I met my wife, 15 years ago.","I think it will become useless because we are rapidly approaching the point where unless you meet someone in person, no one will be able to tell if who they are talking to is real. Scam, AI powered bots will just flood all the platforms and lots of social media sites will just become practically unusable.","My father had a theory recent that I loved. He came up with the idea of AI icebreakers where AI versions of yourselves meet (thousands of times per minute) and break the ice with potential matches based on the way you speak. I can see it happening.","“A Stanford study said among those who are in relationships, online dating is the most likely way in which they met each other. Around 40% of U.S. couples meet via dating apps and fewer couples are meeting via mutual friends.Apr 27, 2023”Doesn’t seem like online dating has ‘failed miserably…’","I will be able to finally get the perfect girlfriend :) Each one of us could. Customized to each individually.","For many men, AI girlfriends and dolls/ sex toys.For many women, throwing themselves at the top 1% of men and wondering why they won't commit.For a diminishing pool of people, actual relationship formation and pair bonding.","I'll probably kms before something else better appears","\"Robots never say No\" will be an excelent selling point.","References, like for employment, a list of people they can contact to find out if you're worth it.","My prediction is that things will remain much the same. Online dating is the 'easy' option, most of my social circles have met their partners through it, or continue to use it for random hookups.I imagine this method will continue until something more efficient comes around. But I can't predict how that efficiency will be made. If people still want that connection, it needs to be facilitated and online dating has already cut through an awful lot of 'admin' around dating. Time and place don't matter quite so much, etc.","We may get AI companion androids so people stop using dating sites.Why struggle and try to find anyone If you can rent and buy one exactly to your preferences.","I hope you don’t want kid and love fucking robots because that is the future of dating.","As someone who met their wife online dating… doesn’t feel like it failed miserably.","I don't see online dating as necessary. Its easier and better to just ask girls out in person.","I'm divorced and haven't done the online dating thing in so long that OKCupid was free. Well, the service was. The divorces were not.But my first ex was listed as like a 95% match, whereas my second was 37%. Obviously both failed, but I didn't have Mrs. 95% text me a couple hours ago to see how I was doing.I don't think I even know how to date anymore. I certainly have a type, but this was utterly lost on all sites and apps I've used. That 37% was literally what I'd been looking for physically since the '90s. Unfortunately, my type is batshit.","Less men reproducing than ever before and faster destruction of the Y chromosome.A rise in polyamory with more women having to share high-value men.Women encouraged to sell their bodies.Young men encouraged to value all women even those who sell their bodiesA rise in adult video games. Completely untapped in the mainstream but waiting to be unleashed on the masses.","I think it's a pretty inaccurate claim to make that:Right now many online dating applications have failed miserablyGiven that 1-in-10 adults in a committed relationship met their partners through a dating app.If you go to adults under 30, the key demographic for virtually every app-based-system, the number goes up to 3-in-10.Dating apps don't work for everyone, but then again nothing works for everyone.There seems to be a very strong (and, honestly, kind of bitter) refrain online that \"dating apps are impossible\", when in reality it seems that many people use them quite successfully to find a partner.","Your in the life is greener when attitude. Online dating is great. It's much more effective then in person It's much easier.....etc etc... but some people will always look somewhere else and say , hey look it's greener on this side of the fence. It never is.","Online dating has facilitated billions of loving touches that would not have otherwise occurred.So I don’t think they’ve failed, but sure there are some pitfalls and occasionally alienating elements to the whole thing.There is already a full spectrum of apps out there for getting to know someone as little or as much as you want before deciding to match or meet.Companies will probably come up with new, interactive ways to get to know people through apps, but the issue of lonely men and how we address it in the future probably has more to do with our culture and often weakened sense of community, than with how we meet potential romantic partners online.","Online dating is unfortunately deliberately skewed and has created a generation of incel freaks. It's no surprise that it's run by young tech guys with a profit incentive.The thing about dating is that it's shifted so dramatically from generation to generation in the last 200 years.We will reach a point where civil rights wins out and LBTQ+, women and minorities reaches some kind of stable point in first world urban societies beyond the major urban cities (New Jersey, Wales)I feel like down the line there will be other groups like older women in the matchmaker tradition who decide to take on online dating, and they will kick out the tech bros.Here's the thing. Right now online dating is dominated by tech. But dating (relationships) will be around as long as humans. Eventually the tech will reach an endpoint or a stability point like say...aircraft or cars, and kinda not change too much for 50 years. At that point people who are relationship experts will dominate the field, not tech experts.","Your AI matches you with the AI others grew up with.","People will realize apps don’t work and start prioritizing real world interactions again, hopefully","This commented online dating apps have failed miserably is ridiculous on his face. And what regard have they failed? People are in relationships at rates not uncomparable to prior generations, certainly is a little bit more fightiness and hookup culture is dominating, but I don't think that's just a consequence of tinder.Meanwhile, but a certainly change the dating dynamic, people are still dating, many people who would have trouble dating by traditional means are doing quite well off it, including yours truly, and the apps themselves are making money hand over fist.Which is all they are intended to do, so in this regard they are spectacularly successful.If I owned 1% of tinder I'd be rich. Pretty successful app.","I met my wife on tinder and we are expecting a boy this summer! So it’s been amazing for me.Other then that my story with online dating was a complete success, it gave me the confidence to hook up with girls way out of my league and some other wildly fun experiences. I also met a lot of duds and got my heartbroken multiple times and it all just helped me better understand what I truly wanted in a partner and that relationships will never be perfect. We also have these unreal expectations when it comes to finding the “perfect one”. That doesn’t exist for everyone so you have to be willing to let go of your ego.","Maybe get all these lonely sad angry whining men some therapy!","I just came up with this on the spot. I think there is an opportunity for AI to make dating apps a better experience.For example, it analyzes what you swipe right on and pinpoints your \"type\". If you prefer more a nice nose, but don't mind big ears, it'll show you more of your type that would hinder interest from your \"competition\".Furthermore, there is opportunity for AI to integrate \"gamification\" into their apps. It'll help teach men to stop being so nice, flirt a little bit, and play hard to get.For the women, it'll stress the importance of being rational, stressing the more important things, like \"will he be a good father?\", \"Does he communicate well?\", \"what are his potential career prospects?\".Through AI coaching of gender dynamics, it'll help men be better and be what women want, while also helping women to lower their standards to get both genders to compromise to a happy medium.Get on it, dating apps.","There are too many technology unknowns about the future of online dating... I think culturally there will be a shift away from dating apps, that we've hit a plateau or soon will. That will drive greater competition which could make apps better ... but there's already a lot of skepticism about the illusion, and 'choice' and tediousness of apps. The key will be for it to return to being social and enjoyable rather than just addictive and only suitable for a niche personality.","DNA matching may eventually appear as scientific way to get people together.","depends on the timeframeshorter term (2-5 years?):More AI-powered matching for your exact dating goals.longer term (5-20 years?):AR/VR Apple Vision 4,5,6? with photorealistic highly customizable high-quality GPT-7-powered girlfriends probably take up 20% - 80% of effective dating time spent. Reason: anyone will be able to get exactly what they want, whenever they want it, and change it whenever their interests change, for way less risk, cost and time investment than the traditional path.","If you've ever seen the movie \"cherry 2000\" where there are actual contract lawyers negotiating exact parameters for future sexual relationships...Yeah I see that being a thing.","I think the big \"if\" is whether or not governments get involved due to the whole \"demographic collapse\" thing.If online dating continues to be run by for-profit companies, then we'll see more of what we have now: comdification of every combination of dating success and wealth--from $500/mo Tinder memberships down to free w/ads AI girlfriends.The other option could be something like online dating becoming a regulated public utility that is at least somewhat beholden to the \"collective good\" (by getting people together so they can have kids).And no, I'm not making a value judgement on any of these ideas","As augmented reality glasses get normalized (or some better AR tech comes around) and photo real avatars get more performant we may see some for of augmented reality dating where you get to experience talking in person without the awkward lack of words through text or the lack of eye contact a phone call would have but the downside of that is obvious. People start relying on it more than actual irl person to person interaction. Also fake calls using AI and 3D generation to make a convincing avatar could also become an issue.Still though as an extrovert who gets on fine in person on dates but is a bit too verbose with texting and doesn’t really like phones calls too much longer than 10-15 minutes, I think it might a be a better way than texting on tinder to break the ice as long as it is secure and people avoid giving away too much Pii too soon.","Right now many online dating applications have failed miserablythey haven'tpost invalid, next question","I see what you’re talking about. I also have completely stopped using dating apps by this point. Every new dating app ad I see says they’re a “different kind of app the revolutionizes dating” but why do I feel like it’s not the apps, it’s the People who are feeling a type of burnout from online dating. For me, most of the ppl I’ve actually met with were not my type if not completely weird irl. Something about having a preconception of what they’d be like adds to the inevitable disappointment. People were way more hopeful in the beginning which may be why it worked in the early days. Idk what the future of dating looks like. Maybe more speed dating type IRL events should be hosted. I see people at their best when they’re interacting IRL and have the same motivations.","Online dating is a generational disaster. Millions of young people can't connect or bond because of dating apps. It interacts with human mating behaviors in such a way as to prevent pair bonding. It's to the points that the sexes have begun to truly hate each other and to see no value in the company of the opposite sex.Maybe AI can fix that but it would mean less money for the dating apps. Those apps are designed to prevent the loss of customers, which facilitating marriages would do. They are designed to keep you focused on the next, better match. The paradox of choice is built into the apps (to many choices make people feel dissatisfaction by any choice they make) and humans become disposable objects to be shopped for.What's more likely is that people will start forming intimate relationships with their AIs. We can all have the perfect AI soulmate and use ever advancing forms of immersive technologies for sexual experiences. Humans will begin interacting less and less as time goes on. Onlyfans will become AI driven and it will create a perfect, unique AI companion just for you.","Hi!The problem with dating apps is not generally the technology. It is generally the community of humans.From the corporate side,The app must make money somehow. They probably get some from you and some from advertising, and some from selling your information.There might be ways to program the app to make more money (from you, advertising, or selling your information) which probably make your experience worse.They probably make more money when you engage more deeply with the app. Send you links to profiles that generate lots of interest, but stay single and are likely players of some kind. Solid matches that long term date and leave the app stop making them money.Most problems are on the human side,People using the app to find suckers to bleed for money.People using the app to find people hoping for relationships that they can use for sex.People trying to steal personal information by scraping the website version.People who have mental illness who look pretty in a photo, but are horrible candidates for dating.The future might includezoom style communication where an AI helps you pick the \"most natural\" photos of you and the person you are talking to.VR style visits to vacation spots (with photos) with your match.Filtering out possible matches (claiming use of AI) that are lower likelihood for success.","95% of women in dating apps will be AI bots so indistinguishable from reality that men won't notice they've been had until muggers rob them blind at the date's spot.95% of women will be unable to compete with the perfection of AI \"women\" on said apps, so will abandon them in favor of more traditional dating venues.","My theory is that human to human dating will significantly take a hit. What proof do I have? Not much, just the prevalence of ai \"gf\" chatbots. Just check out the open ai appstore or an appstore on your phone. Search up ai girlfriend and see the results. What if you could date a perfect virtual gf that won't have any problems whatsoever. It's definitely intriguing.","I just want to know who spells out applications in stead of apps when it comes to software?","I predict the the growing social disconnect from electronic media will result in a cultural backlash with a resurgence of regular face-to-face social events.The return of the Grange Halls.","Ai waifu for the gents, and wine and cats for the ladies.","I predict more teenage boys are going to double down on being socially awkward shut ins as they transition to their early 20s and spawn a whole new chapter in mental health books called, \"Dating AI.\"","Social media feeds and streams have become the default design of most dating apps. People just scroll along from one person to the next—confronted with so many options, that making even a short-term commitment to just one person has become overly complex and unlikely to endure in the long-term—as there are more options to try out. In fact, dating apps no longer have much of an advantage over scrolling for dates, hookups, or future partners on current social media platforms, such as Facebook and Instagram. Overall, the technology of feeds and streams has transformed human relations into a culture of online hookups and short-term romances/friendships—often as quickly ghosted as they are initiated. Of course, there are exceptions, and long-term relationships are still happening and possible in the offline world , but the overall trend is eroding the traditional.Difficult to predict what the future may hold for online dating. My thought is that at some point, the dating apps will begin closing down, one after another. And sites for virtual dating, flirting and more will fill in the gaps, such as OnlyFans. Basically, many people will get their dating and intimacy needs met online, rather than taking them into the offline world, where they are cut off from other options and dating moves too slowly for them. Furthermore, AI chat bots will become another option for dating and intimacy. Virtual masks, to hide the real person behind an AI enhanced human, may become popular as well. I know this all sounds bizarre, but the technology and our collective behavior seems to be trending in these directions."],"points":423},{"text":["Heinrich, Portman Announce Bipartisan Artificial Intelligence Bills to Boost AI-Ready National Security Personnel, Increase Governmental Transparency","The following submission statement was provided by /u/A3485:From the article: The co-founders of the Senate Artificial Intelligence Caucus are building off of the momentum from the groundbreaking provisions secured in the FY21 NDAAWASHINGTON - U.S. Senators Martin Heinrich (D-N.M.) and Rob Portman (R-Ohio), the co-founders of the Senate Artificial Intelligence Caucus, are announcing two bipartisan pieces of legislation to strengthen the U.S. government's artificial intelligence (AI) readiness, support long-term investments in AI ethics and safety research, as well as increase governmental AI transparency.Senators Heinrich and Portman will be introducing the bipartisan Artificial Intelligence Capabilities and Transparency (AICT) Act. The AICT Act would implement recommendations of the National Security Commission on Artificial Intelligence's (NSCAI) final report. Congress established the NSCAI through the fiscal year 2019 National Defense Authorization Act (NDAA) in order to consider the methods and means necessary to advance the development and improve the government's use of AI and related technology.\"Artificial Intelligence presents both opportunities and challenges for our nation's security and we need to be prepared for both,\" said Heinrich \"Senator Portman and I have worked together to pass several bipartisan solutions that put into place the right policy and people in these emerging technologies. Now it's time to build off of that momentum and strengthen the federal government's AI capabilities while also increasing the public's trust in this technology. By transparently boosting our federal digital workforce and talent recruitment, we send a clear signal to the world - and our adversaries - that we are prepared to take AI head on.\"Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19e09wh/heinrich_portman_announce_bipartisan_artificial/kj9cqgz/","This is great but can we bipartisan climate anything...","From the article: The co-founders of the Senate Artificial Intelligence Caucus are building off of the momentum from the groundbreaking provisions secured in the FY21 NDAAWASHINGTON - U.S. Senators Martin Heinrich (D-N.M.) and Rob Portman (R-Ohio), the co-founders of the Senate Artificial Intelligence Caucus, are announcing two bipartisan pieces of legislation to strengthen the U.S. government's artificial intelligence (AI) readiness, support long-term investments in AI ethics and safety research, as well as increase governmental AI transparency.Senators Heinrich and Portman will be introducing the bipartisan Artificial Intelligence Capabilities and Transparency (AICT) Act. The AICT Act would implement recommendations of the National Security Commission on Artificial Intelligence's (NSCAI) final report. Congress established the NSCAI through the fiscal year 2019 National Defense Authorization Act (NDAA) in order to consider the methods and means necessary to advance the development and improve the government's use of AI and related technology.\"Artificial Intelligence presents both opportunities and challenges for our nation's security and we need to be prepared for both,\" said Heinrich \"Senator Portman and I have worked together to pass several bipartisan solutions that put into place the right policy and people in these emerging technologies. Now it's time to build off of that momentum and strengthen the federal government's AI capabilities while also increasing the public's trust in this technology. By transparently boosting our federal digital workforce and talent recruitment, we send a clear signal to the world - and our adversaries - that we are prepared to take AI head on.\"","This article was originally published 3 years ago and may contain out of date information.The original publication date was May 12th, 2021. Per rule 13 older content is allowed as long as [month, year] is included in the title.   This bot finds outdated articles. It's impossible to be 100% accurate on every site, send me a message if you notice an error or would like this bot added to your subreddit. You can also download my Chrome Extension if you'd like to see publish dates added to all article links on reddit.Send Feedback | Github - Bot | Github - Chrome Extension"],"points":2},{"text":["Food from urban agriculture has carbon footprint six times larger than conventional produce, study shows","The following submission statement was provided by /u/Czarben:\"A new University of Michigan-led international study finds that fruits and vegetables grown in urban farms and gardens have a carbon footprint that is, on average, six times greater than conventionally grown produce.\"Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19dzhcm/food_from_urban_agriculture_has_carbon_footprint/kj96r3r/","What's the carbon footprint of a parking lot in the same area?","I have a yard around my singl- family house in a mid-sized city. Some of it has been turned into a garden. It's fertilized with compost from my pile, watered with rain as it falls from the sky or captured in a rain barrel. The trellis structures were made from repurposed scrap materials that people left out to be scavenged and if not, picked up as trash and taken to a landfill. I grow enough food to supplement my diet and have a noticeable impact on my grocery bill.This sort of urban agriculture, repurposing grass lawn to grow some food using minimal inputs, is exactly the sort of urban agriculture that the article mentions as often have a lower carbon footprint in the abstract, \"However, some UA crops (for example, tomatoes) and sites (for example, 25% of individually managed gardens) outperform conventional agriculture.\"So keep growing food in your home garden and try and minimize your inputs even if it reduces your yield a bit. It's ok to only get 10lb of tomatoes instead of 15lb, even if your neighbor with his computer-controlled drip irrigation system gets more.But maybe we don't need to start building large urban farms in climate controlled buildings with grow lights in order to supply food to local grocers.","Most of the climate impacts at urban farms are driven by the materials used to construct them—the infrastructure,\" Goldstein said. \"These farms typically only operate for a few years or a decade, so the greenhouse gases used to produce those materials are not used effectively. Conventional agriculture, on the other hand, is very efficient and hard to compete with.\"Constructong them from recycled building materials would offset thatFor example, conventional farms often grow a single crop with the help of pesticides and fertilizers, resulting in larger harvests and a reduced carbon footprint when compared to urban farms, he said.Ah yes, because there's no downside to killing pollinators with pesticides and fish with runoff.","This article reads very much the old 'solar vs coal' articles that dismissed solar because it wasn't good enough at the time to replace coal.","a nuanced and informative article that is poorly served by its headline.","Looking at variable carbon footprint per year should offset building costs of new builds compared to ones from decades ago.Energy costs are going down, while access to potable water becomes more scarce.Also look at how hydroponics use 90%ish less potable water.","Does that include travel, like those tomatoes from Peru if you live in Canada, for instance?","It's sad how many people never actually read the studies they comment on.A lot of you should keep this part in mind:...some UA crops (for example, tomatoes) and sites (for example, 25% of individually managed gardens) outperform conventional agriculture. These exceptions suggest that UA practitioners can reduce their climate impacts by cultivating crops that are typically greenhouse-grown or air-freighted, maintaining UA sites for many years, and leveraging circularity (waste as inputs).","Study brought to you by the conventional farming producers.","this study says that the urban farm infrastructure is what causes the urban farms to have a high carbon footprint...but if you slap some structural lumber together to make some raised beds, and make your own compost and rain water you basically have a zero carbon footprint urban garden plot...while getting some fun outdoor time and food to eat. this headline and study feels slightly hyperbolic.","the math don't math like at all , there's no way the carbon footprint of a urban garden exceed even the footprint from the transportation alone a truck haling a shit ton of stuff for hours and hoursthere's no way I refuse to believe this shit","if you can't find a local restaurant to sell produce to you're growing the wrong shit. What is this international shit? People are shipping their raised bed plot bib lettuce to China? Wtf?","Did they include all the extra inputs and expenses needed to undertake industrial monoculture farming?Sometimes these uni studies are very unrealistic with money. Last night I was watching a DW show about tiny forests, where they crowdfunded 24,000 euros to start an tiny urban forest. To my mind, this is a bit of a joke.","Both still have tiny footprints compared to other carbon emitters such as coal electric and ICE transport. This is a waste of time as a study.","ah yes, research from a university in a massive agri-state. I'm sure that's perfectly unbiassed","\"A new University of Michigan-led international study finds that fruits and vegetables grown in urban farms and gardens have a carbon footprint that is, on average, six times greater than conventionally grown produce.\"","No, we cannot have people growing most of their own food and trading amongst themselves, if people can meet most of their food needs without industrialised mega farms what will happen to all that land that used to be wilderness and more importantly what will happen to share prices in big farmer. Won’t somebody think of the shareholders?","What a Farce!Growing it off site using heavy machinery to till, plant, harvest. Importing soil amendments and fertilizers to grow the produce and heavy machinery to spread them. Then transporting the harvest to a packing facility. Then transporting it to distribution. Then sending it to grocers warehouses. Then sending it to the grocers. Then the customer driving there and back to pick it up is somehow less carbon?Using hand tools to plant in the garden. Walking from house to garden to harvest. At most people use a rototiller and a refrigerator.","I also feel obligated to mention that this study uses \"citizen science\" (self-reported data?) from 73 arbitrary (selection criteria?) sites... I'm not going to dig more into the methodology because of the pay wall, but I'm skeptical.","\"Let's bolster climate awareness by shaming everyone interested in checks notes local food production\"","There is no possible way that this is true when ALL information is considered and taken into account.","I know I could dig through the study to find their methodology, but how on earth is it more damaging for me to grow a green bean than for a whole farm full of tractors, pesticides, fertilizer, combine, then truck it to the store, power the store, then I drive to store and buy it?","Absolute twaddle. Just shows how you can contort any data or collect certain data to support any claim you want to make.Those urban farms will be directly feeding people within very close proximity using very minimal vehicle usage.","It’s like those tobacco studies that discovered cigarettes were actually harmless, brought to us by Marlboro.","This is the dumbest thing I've ever read! Who funded this study?! If there were an \"urban garden\" on every street in America it wouldn't equal a millionth of the carbon footprint of the nearest factory, jet, or lawnmower! God help anyone grow their own food! FFS","This is exausting. So what, I shame my mother for her tomatoe and jalapeño garden?If I ever hear someone reference this study in real life I might just kms.","Would urban or even industrial greenhouses have the potential to fix the underutilization of land with urban and pesticide use + transportation of traditional methods?","Posting \"studies\" like this should be a bannable offense.100% biased and 100% incorrect.","No no no guys! Urban farming is TERRIBLE! Continue to rely on us, the trillion dollar food industry, which will pump out more carbon into the atmosphere in a microsecond then your bloodline will for the next 500 years!!!!!","Ow, that’s not so good for us urban farmers. I spent an extra $300 on water alone for practically no produce, LOL","Wouldn't the produce from Urban areas be also subject to smog and brake shavings if it's in a high traffic area?","Cynics want to know who paid for this 'study'?I'm dubious of the 6X carbon footprint claim. Urban gardening is low tech using manual labor instead of machines. You use the same tools that you need to keep your yard and flower beds in good shape.Most serious urban gardeners don't have much in the way of inputs except watering when mother nature doesn't play ball. The rest is mostly on-site composting with the odd bale of well rotted manure tossed in.","From the abstract: \"However, some UA crops (for example, tomatoes) and sites (for example, 25% of individually managed gardens) outperform conventional agriculture.\"","At this point they're just messing with us, right??!! What the actual fuck","Would the carbon footprint of growing grass instead of food in someone's yard be even higher? It definitely produces zero food.Do the authors suggest we subdivide our backyards to build more housing instead of growing food (or anything)? Wondering what the alternative is...","It also says that when social benefits are included they outperform conventional farms.One of the top three costs for urban AG was water and I know for a fact about a conventional farms in California get free water from their historic legacy water rates and so that probably factors a big thing.Generate high levels of social benefits. In a survey conducted for the study, UA farmers and gardeners overwhelmingly reported improved mental health, diet and social networks. While increasing these \"nonfood outputs\" of UA does not reduce its carbon footprint, \"growing spaces which maximize social benefits can outcompete conventional agriculture when UA benefits are considered holistically,\" according to the study authors."],"points":773}]