[{"text":["Automation because of Artificial intelligence","This question has kept me up nights lately, but after reading a lot about it it feels kind of unlikely.The AI we have now is comparatively pretty stupid. It can handle basic queries fine, but struggles with anything complex. Frontier Airlines recently learned this to their detriment.It will get better, but it seems like there's a scalability problem. For a large company fielding thousands of interactions a day via text/calls/emails with a variety of customers and other businesses, a lot of computational power is needed, and that's expensive. Sam Altman is already telling the WEF that further advances in AI are going to take a lot more energy, maybe in the order of another breakthrough like nuclear fission.While we're starting to see humanoid robots rolled out in some situations, it remains to be seen how effective they will be. Again, they'll get better, but it's going to be awhile before they're effective and affordable enough to be an everyday solution.And then there's the practical consideration of who will buy products/services if no one can afford them. Capitalism requires someone to do business with.Will there be disruptions? Almost certainly, but it'll probably be neither as dark or rosy as most predictions.","If the people in charge really gave a shit a large portion of the world could already be on UBI. This won't happen in the foreseeable future.","5 years?IMF Report: AGI destroys all jobs within 5 to 20 years! Frontier of Automation expands beyond humans","30-50% of economically valuable tasks in the US is probably 3-5 years away. How many actual jobs translate to is unclear. But like 50 years till ubi is required is preposterous I think."],"points":0},{"text":["I want to hear your oceanic futurism takes!","I want to see offshore oil wells converted into giant 3D printers that generates floating and submerged dwelling spaces out of oil converted into large diameter clear plastic tubing. It will continually grow in concentric circles both outwardly and underwater until it reaches a certain size, say, living, working and recreation space for 10,000 people, then detach to be relocated anywhere on the planet.","One technology being applied to ships is aerofoils...https://thetius.com/brief-guide-to-sail-assisted-cargo-ships/Sea floor mining has been speculated about for decades. Norway just took an initiative to push it closer to reality.https://www.wired.com/story/norway-deep-sea-mining-arctic-svalbard-batteries-environment/Netpens are already in use for salmon farming.https://salmonfacts.org/the-salmon-ocean-farming-industry/​The Arctic Ocean is an emerging battlespace of interest for military strategists.https://www.cbsnews.com/news/russia-arctic-military-presence-ukraine-war-nears-two-year-mark/","More ocean cooled offshore server farms is an interesting idea, but I do wonder what effect it would have on the local ecosystem and perhaps even larger currents if done on a large enough scale.More ground effect vehicles would be cool. I loved seeing one in the latest Avatar movie.I'm also optimistic about there being more offshore wind farms, as they can generate a tremendous amount of power with a high degree of reliability/consistency for essentially free.I think a shorter range but higher precision sonar for real time terrain mapping and object detection is probably something thatd be cool to see. Imagine being able to see clearly in any underwater conditions with AR, and the benefits that would give to rescue divers and the like.Combine that tech with underwater server farms and I can't think of a cooler job. Imagine being a scuba certified sys admin. Lol. I know itd never work out that way, but it still sounds like a fun job concept to me."],"points":0},{"text":["Buried water ice at Mars's equator? - Its findings suggest layers of water ice stretching several kilometres below ground – the most water ever found in this part of the planet.","The following submission statement was provided by /u/Gari_305:From the articleOver 15 years ago, Mars Express studied the Medusae Fossae Formation (MFF), revealing massive deposits up to 2.5 km deep. From these early observations, it was unclear what the deposits were made of – but new research now has an answer.“We’ve explored the MFF again using newer data from Mars Express’s MARSIS radar, and found the deposits to be even thicker than we thought: up to 3.7 km thick,” says Thomas Watters of the Smithsonian Institution, USA, lead author of both the new research and the initial 2007 study. “Excitingly, the radar signals match what we’d expect to see from layered ice, and are similar to the signals we see from Mars’s polar caps, which we know to be very ice rich.”If melted, the ice locked up in the MFF would cover the entire planet in a layer of water 1.5 to 2.7 m deep: the most water ever found in this part of Mars, and enough to fill Earth’s Red Sea.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19at85y/buried_water_ice_at_marss_equator_its_findings/kin52k5/","From the articleOver 15 years ago, Mars Express studied the Medusae Fossae Formation (MFF), revealing massive deposits up to 2.5 km deep. From these early observations, it was unclear what the deposits were made of – but new research now has an answer.“We’ve explored the MFF again using newer data from Mars Express’s MARSIS radar, and found the deposits to be even thicker than we thought: up to 3.7 km thick,” says Thomas Watters of the Smithsonian Institution, USA, lead author of both the new research and the initial 2007 study. “Excitingly, the radar signals match what we’d expect to see from layered ice, and are similar to the signals we see from Mars’s polar caps, which we know to be very ice rich.”If melted, the ice locked up in the MFF would cover the entire planet in a layer of water 1.5 to 2.7 m deep: the most water ever found in this part of Mars, and enough to fill Earth’s Red Sea."],"points":0},{"text":["Why don't we have any of our trasport vehicles controlled by simulator setups yet ?","If it can be controlled remotely, it must be able to gracefully handle a loss of connection. And the work required to get that isn't far off from the work required to just remove the human from the loop the whole way. Also, a non trivial part of the job of the driver is to deal with unusual situations like unruly passengers, system failures, etc.","You’re still requiring a driver and increase expense, liability, & complexity. What’s the upside besides turning driver into a WFH job? The automation here would likely come with automating the driver position with the ability for a human to take control in a complex situation.","Meh - Uber already has driveless cars that sound WAY safer than remote controlled cars as they monitor a much wider field of view with instant reaction times.I’m sure fleets of driverless transport vehicles is just around the corner, although home delivery will obviously take longer.","In some part of the words mostly Europe and east Asia and Chile, they have train and subway like this, the rest of the world buy cheap or bad mostly expensive and bad","Never seen but I've heard of the amazon puller bots automatically navigating a warehouse and collecting bins. Some farm equipment can be programed to plow a field by itself, lawnmower roombas. But bigger than that I think it's a matter of driving on public roads or the speed and power of a train.","I'm of the opinion that the driver should have some skin in the game (literally in this case). If the driver knows that the worst that can happen if he messes up is that he gets fired and perhaps charged with manslaughter, then he will drive differently compared to knowing that the worst that can happen if he messes up is he dies a painful, violent death."],"points":27},{"text":["New British laser weapon in successful high power firing - During a trial at the MOD’s Hebrides Range, the DragonFire laser directed energy weapon (LDEW) system achieved the UK’s first high-power firing of a laser weapon against aerial targets.","The following submission statement was provided by /u/Gari_305:From the articleDragonFire is led by the Defence Science and Technology Laboratory (Dstl), on behalf of the UK MOD, working with its industry partners MBDA, Leonardo and QinetiQ.This milestone demonstrated the ability to engage aerial targets at relevant ranges and is a major step in bringing this technology into service. Both the Army and Royal Navy are considering using this technology as part of their future Air Defence capabilities.Defence Secretary, Grant Shapp said:“This type of cutting-edge weaponry has the potential to revolutionise the battlespace by reducing the reliance on expensive ammunition, while also lowering the risk of collateral damage. Investments with industry partners in advanced technologies like DragonFire are crucial in a highly contested world, helping us maintain the battle-winning edge and keep the nation safe.”The Ministry of Defence say that the latest milestone builds on a series of highly successful trials, including the first static high-power laser firing of a sovereign UK capability and demonstration of the DragonFire system’s ability to track moving air and sea targets with very high accuracy at range.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19ard20/new_british_laser_weapon_in_successful_high_power/kimraxs/","I hate that we're getting laser weapons before flying cars.","I will assert once more that directed energy weapons will some day soon make ballistic missiles INCLUDING NUKES, as well as all kinetically fired armaments (except maybe bullets), OBSOLETE. This will render the capabilities of nations like Russia, China and North Korea to launch nuclear strikes from their home soil with the intent of striking the US, neutralized. Shit is moving quickly in this space. And this is only the stuff they are showing us.","From the articleDragonFire is led by the Defence Science and Technology Laboratory (Dstl), on behalf of the UK MOD, working with its industry partners MBDA, Leonardo and QinetiQ.This milestone demonstrated the ability to engage aerial targets at relevant ranges and is a major step in bringing this technology into service. Both the Army and Royal Navy are considering using this technology as part of their future Air Defence capabilities.Defence Secretary, Grant Shapp said:“This type of cutting-edge weaponry has the potential to revolutionise the battlespace by reducing the reliance on expensive ammunition, while also lowering the risk of collateral damage. Investments with industry partners in advanced technologies like DragonFire are crucial in a highly contested world, helping us maintain the battle-winning edge and keep the nation safe.”The Ministry of Defence say that the latest milestone builds on a series of highly successful trials, including the first static high-power laser firing of a sovereign UK capability and demonstration of the DragonFire system’s ability to track moving air and sea targets with very high accuracy at range.","In other news something unknown pierced the side of an air freight liner forcing it to land …"],"points":2},{"text":["🌐 Journey to 2050 (Video): Explore Future Cities and Mars Colonies!","I loved this video so much!! I hope these cities become real!","AI narrated. Insta closed the window sorry, unwatchable."],"points":0},{"text":["End of the road for diesel-powered lorries and buses in Europe. Near-complete phase-out by 2040.","The following submission statement was provided by /u/IntrepidGentian:\"The EU has taken another significant step in its efforts to clean up road transport, with a political agreement on CO2 standards for trucks and buses that amounts to a near-complete phase-out of diesel-powered models by 2040. The average carbon dioxide output from new trucks and coaches sold in the EU must be 90% below current levels by 2040, European lawmakers have agreed, while city buses must be entirely emissions-free five years ahead of that date.\"Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19ao1sd/end_of_the_road_for_dieselpowered_lorries_and/kim2tbs/","\"The EU has taken another significant step in its efforts to clean up road transport, with a political agreement on CO2 standards for trucks and buses that amounts to a near-complete phase-out of diesel-powered models by 2040. The average carbon dioxide output from new trucks and coaches sold in the EU must be 90% below current levels by 2040, European lawmakers have agreed, while city buses must be entirely emissions-free five years ahead of that date.\"","Great, no more clouds of black soot from the back of the 'better for the environment' buses","Full of good intent, but sadly it's a short sighted idea. Here in Norway we already shifted to a fully electric bus service/system. It's been going badly, partially or fully cancelled services repeatedly because the vehicles don't work well enough in -20⁰c weather.","This is meaningless.What will get rid of diesel large vehicles is technology - better EV tech specifically (arguably also with a low but non zero chance of some other tech, like a breakthrough in hydrogen production and use).If the tech isn’t ready, the deadline will be extended. If it is, the ban probably isn’t needed.People really do need to stop celebrating politicians as if they are the solution of our problems.","How will they deal with the fact that the lithium ion batteries just stop in cold weather","Oh, man cool but I don't think Europian union will be here by 2040GfccvvGgfccc👈"],"points":44},{"text":["Meet The World's First Cloned Rhesus Monkey To Reach Adulthood","The following submission statement was provided by /u/Brave-Ad-6868:Submission statement: Chinese Academy of Sciences: Scientists have achieved a significant milestone in the field of animal cloning. For the first time, a cloned rhesus monkey (Macaca mulatta) has survived into adulthood. At over two years old, the cloned monkey named ReTro represents a breakthrough in primate cloning that could unlock new possibilities for medical research using cloned non-human primates.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19ankka/meet_the_worlds_first_cloned_rhesus_monkey_to/kilzgbj/","Submission statement: Chinese Academy of Sciences: Scientists have achieved a significant milestone in the field of animal cloning. For the first time, a cloned rhesus monkey (Macaca mulatta) has survived into adulthood. At over two years old, the cloned monkey named ReTro represents a breakthrough in primate cloning that could unlock new possibilities for medical research using cloned non-human primates.","The fact that its first words were \"killl meee\" is kinda worrisome.","How is this news? We cloned so many animals already to full adulthood. It happens on a daily basis. They just did it with a different species and call it a \"breakthrough\"..Remember Dolly the sheep? People think she died of short telomeres concluding that dolly her genetic age was the same as the original sheep so she lived a short life. That is not at all what happened. Dolly died of pneumonia,... she had a normal epigenitc age and normal telomeres.So this isn't really \"futuru\" stuff.. We just stopped cloning stuff that were on the ethical issue level. Also finding out character traits do not transfer made it a big no-no for anymore wanting to clone themselves. It is just another naked monkey that happens to look like you. That is all."],"points":6},{"text":["Japan becomes fifth country to land on the moon with JAXA’s SLIM spacecraft","The following submission statement was provided by /u/Gari_305:From the articleJapan staked a claim as a national space power on Friday, declaring its SLIM spacecraft successful in landing on the moon.The country’s SLIM lander launched in September and touched down on the lunar surface around 10:20 a.m. ET, according to the Japan Aerospace Exploration Agency, or JAXA. Engineers were checking the status of the spacecraft shortly after its landing.The feat makes Japan the fifth country to land on the moon, following Russia (then the Soviet Union), the U.S., China and India. Last year, India joined the list of moon landings with its Chandrayaan-3 mission.Japan’s SLIM, which stands for “Smart Lander for Investigating Moon,” is a cargo research mission. It carries a variety of scientific payloads, including an analysis camera and a pair of lunar rovers.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19alnrs/japan_becomes_fifth_country_to_land_on_the_moon/kilkug2/","From the articleJapan staked a claim as a national space power on Friday, declaring its SLIM spacecraft successful in landing on the moon.The country’s SLIM lander launched in September and touched down on the lunar surface around 10:20 a.m. ET, according to the Japan Aerospace Exploration Agency, or JAXA. Engineers were checking the status of the spacecraft shortly after its landing.The feat makes Japan the fifth country to land on the moon, following Russia (then the Soviet Union), the U.S., China and India. Last year, India joined the list of moon landings with its Chandrayaan-3 mission.Japan’s SLIM, which stands for “Smart Lander for Investigating Moon,” is a cargo research mission. It carries a variety of scientific payloads, including an analysis camera and a pair of lunar rovers.","I'm always impressed with Japan's space program.  They do really cool stuff with a much smaller budget than NASA.","This mission used a different type of trajectory to the Moon, and did so specifically to prove the ability to target very specific locations on the Moon with great precision.It used the Weak Stability Boundary or WSB trajectory, a part of a Ballistic capture trajectory approach to transfers between bodies in space.Not only does it spend less fuel but actually provides greater precision of landing.Perfect news.","We need to develop new systems to facilitate colonization like this www.ntari.io/tos"],"points":10},{"text":["Japan is about to land its first lunar probe. As more nations race to the Moon, how will we keep the peace?","The following submission statement was provided by /u/Gari_305:From the articleTo date, the leading spacefaring nations have gone to great lengths to publicly assure us that their intentions in space are peaceful. Yet, last year Yury Borisov of Russia’s space agency Roscosmos bluntly stated:This is not just about the prestige of the country and the achievement of some geopolitical goals. This is about ensuring defensive capabilities and achieving technological sovereignty.Borisov’s comments should not be read in isolation, however. US officials have made similar assertions. In July last year, the US assistant secretary of defense for space policy, John F. Plumb, was equally blunt:Space is in our DNA for the military. It’s absolutely essential to our way of war.Such official commentary is clearly anathema to the purported peaceful intentions expressed by officials elsewhere in their respective national hierarchies. Similarly, to safeguard its national interests and encouraged by President Xi Jinping himself, China has been fine-tuning its own military space strategy.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19akv59/japan_is_about_to_land_its_first_lunar_probe_as/kilf3z4/","We won’t, because we have absolutely no idea how to keep the peace.","[removed]","Does anyone know whether the probe landed or crashed?","By sheer panic and a herculean effort to not lose. This is the American way.","Keep the peace you say? Well, that's the fun part!(We won't)","It’ll be like the early internet. Everything was beautiful and wonderful until someone figured out how to make serious money and give access to everyone then It went to total shit.","It's in the hands of the brightest minds around the world.. Every scientist out there working on space projects dreamt of space as something beautiful & as a way for progress to human life.. it's up to them to not let these war mongering monkeys to space.. For research yes, but I beg them if there are any tactical ass security thing they're putting up in space, please sabotage the fuck out of it for the sake of humanity..","Yea because space is so small we will need to be fighting over the limited resources.good god humans are effing stupid.","From the articleTo date, the leading spacefaring nations have gone to great lengths to publicly assure us that their intentions in space are peaceful. Yet, last year Yury Borisov of Russia’s space agency Roscosmos bluntly stated:This is not just about the prestige of the country and the achievement of some geopolitical goals. This is about ensuring defensive capabilities and achieving technological sovereignty.Borisov’s comments should not be read in isolation, however. US officials have made similar assertions. In July last year, the US assistant secretary of defense for space policy, John F. Plumb, was equally blunt:Space is in our DNA for the military. It’s absolutely essential to our way of war.Such official commentary is clearly anathema to the purported peaceful intentions expressed by officials elsewhere in their respective national hierarchies. Similarly, to safeguard its national interests and encouraged by President Xi Jinping himself, China has been fine-tuning its own military space strategy.","Moon war!!!! I got stock in Honeywell I claim Shackleton for Plankton!","Are we expecting fisticuffs or a common brawl on the moon?","this is like something out of Star Trek or The Expanse \"It all started with the MOON WAR\"","You meet, shake hands, pop a bottle of your favorite drink, and talk about all the great things you can accomplish working together. How does such an easy solution get lost on you?","Unless there's oil on the moon I'm sure it will be fine.","We don't keep the peace on Earth, why would the Moon be different? Whoever has the tech to carve out territory and the military power to keep it will be the victors.","A race? I think that doesn’t make any sense after the Cold War. I admit I really help boosting budgets and research but now, what is the race for ?","we can’t even keep the peace down here so we likely wont up there","When I'm sitting with my so, gazing at the moon, it'll be so romantic knowing Gingrich Moonbase's nuclear cannons pointing straight at Earth are keeping us safe.","We won't it will never happen, just look at what's going on here on earth, to think otherwise is wishful thinking","we should work together in large groups-many countries and take it out of military spending , what are idiot players with mass shootings trying to get kids use to what kids go through in 3rd world countries and warmonger countries to play against the think do feelings and happening of idiot players otherside = is just messing up the world more n more not fixing the real problems by reducing the worst crap going on","Didn’t realise this sub was an American one. Please stop using we. Not all of us are brainwashed yanks.","I can’t wait to see NASA’s new moon landing video; should be cool with todays graphics…"],"points":43},{"text":["Figure's humanoid robots are about to enter the workforce at BMW - Figure has signed its first commercial deal, and is sending its general-purpose humanoid robots off to start real-world work at BMW's manufacturing plant in South Carolina.","The following submission statement was provided by /u/Gari_305:From the articleEmerging from stealth mode just 10 months ago, Figure has developed its robots at a frightening pace. The company had prototypes up and walking within a year of development, thanks to a highly experienced team – and at an impressive speed, too, compared with everything this side of the acrobatic Atlas bot from Boston Dynamics.Also from the articleAnd now, it's delivering on its promise to get the bots out there doing real, useful work ASAP. Under a freshly signed commercial agreement with BMW Manufacturing Co. LLC, Figure has started identifying initial use cases at BMW's Spartanburg plant, and has begun training the bots up for a staged deployment on site.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19ajwf4/figures_humanoid_robots_are_about_to_enter_the/kil7wlt/","What's interesting is I work st Plant Spartanburg in assembly and I had to learn about this from reddit. I'm sure we're a long way off from these robots doing what we do in assembly though.","Why humanoid? Human shape has limitations, they could play god a little and go a little further","From the articleEmerging from stealth mode just 10 months ago, Figure has developed its robots at a frightening pace. The company had prototypes up and walking within a year of development, thanks to a highly experienced team – and at an impressive speed, too, compared with everything this side of the acrobatic Atlas bot from Boston Dynamics.Also from the articleAnd now, it's delivering on its promise to get the bots out there doing real, useful work ASAP. Under a freshly signed commercial agreement with BMW Manufacturing Co. LLC, Figure has started identifying initial use cases at BMW's Spartanburg plant, and has begun training the bots up for a staged deployment on site.","One of the funniest interviews I saw in the ‘early 80’s in Toronto was a reporter asking auto workers outside a plant if they were scared of losing their job to a robot. (They’d just installed welding bots). A bunch of people answered yes, maybe, kinda, it’s gonna happen, etc. but one guy said NO emphatically. She asked him, “why?”. He answered “I’m the guy that fixes the robots” and kept walking. The reporter had nothing. Just stood there dumbfounded. I think about that guy every now and then. It’s 2024 and I bet he’s not so sure anymore…..","Factory automation guy here. What I see is a wasteful, high maintenance design. It's beautiful marketing wank however. See the coffee video? Notice the engineer placed the coffee cup in the machine for the robot? Hmmm. Ya, this thing ain't as advanced as they are leading you to believe. Not yet anyways.Factory robots are all about doing the task simply and reliably at a station. You need an arm. Maybe two. And a few manipulators. If the robot needs to move, you probably designed a task wrong. But you can easily hang that robot arm on a track and have it move around a car or whatever.But every part you add to your robot project leads to more reliability failures. This is why you always strive to keep the process simple. Will this robot humanoid have the dexterity to slap interior trim into place? I dunno. Humans are actually really fast at this, and they double as quality control.Tesla was famous for trying to use too many robots, then ripping them back out and replacing them with meatbots. The humans were just better at a lot of tasks that require feel and wiggling things into their final position. Like assembling interiors.","This may not be the best place to ask, but I've always wondered: Why is making a humanoid robot so difficult? We have tons of data about the motion of walking, all kinds of sensors we can pack in to measure momentum and balance, tons of data about motors and pneumatics and their limitations, and computer chips that can process that data at unimaginable speed. Yet a 2-year-old toddler, with his proportionally oversized head, can more gracefully walk and run and navigate terrain and obstacles than the most advanced robots. Why?","Maybe they can build a cooling system that makes it to 100K now.","It's impressive to see recent progress in this space. With recent progress in AI we're finally starting to see robots adapting to changing situations. Two minute papers has a good video on this trend.","I can't wait to see them slowly move parts from one bin to another and then stand there awkwardly as a human takes the parts from that bin and actually installs them xD","Can we PLEASE just get some friggin' robot maids to clean the damn house?","Mass starvation to follow. Don't worry, cleanup will be handled by robots. It's just about time to start putting the kabosh on privately owned wealth at the detriment of others.","2. 1. Rednecks sabotage them godless demons!","My opinion on this is not well informed, but the company's age, and it's tech-bro CEO who talks like Elon Musk, make me wonder if this isn't so much vaporware.Nothing in the article indicates how much these robots cost, how long they can work before they need to recharge, or that they've developed any competency at the tasks the company wants them to do.Again, not well informed, but if the plant is already facing a labor shortage, maybe BMW just told these guys \"sure, let's bring your robots in for a trial run and see what happens\", and Figure is now trying to parlay that info further investment?","I just saw an article about how in the US, BMW is the 3rd highest brand for production defects. Hopefully robots will help make them better, safer cars.","BMW NA LLC and their contracted work.I worked as a Parts Analysist for the Warranty Parts Return Center (WPRC) in Nazareth PA. THE ONLY PLACE ANY BMW WARRANTY PART IS SENT (after repair) form the North American market, and when THEY refused to hire us as BMW employees (Nearing the end of a 5 year contracted worker agreement, entire place was \"contracted\"), but rather opted to continue \"Contracted Workers\" I saw the writing on the wall. By the time the \"New 5 year contract\" was settled. I had already found a job and left, but the ones left behind were either completely cut, or had to take a hefty pay cut.This move from BMW / BMW NA LLC does not surprise me. If you work for BMW NA LLC in any capacity, I would say that it would be prudent to make sure you resume is at least current and up to date. Stay well, and best of luck in providing for your families and yourselves out there.","Wow BMW's are made in South Carolina? That really kind of defeats the whole German engineering appeal."],"points":133},{"text":["Human ‘behavioural crisis’ at root of climate breakdown, say scientists","The following submission statement was provided by /u/BothManufacturer1307:How do WE collectively join together to fix something (climate change) that WE collectively created?\"People are the victims -- we have been exploited to the point we are in crisis. These tools are being used to drive us to extinction,\" - Phoebe Barnard (evolutionary behavioral ecologist and study co-author)Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19ajjve/human_behavioural_crisis_at_root_of_climate/kil6bt7/","Maybe we don't have hundreds of rich people fly on private Jets to a summit? Maybe we start actually targeting the sources instead of things with negligible effects like plastic straws?","hold big business and the governments accountable.There are 100 companies responsible for 71% of global emissions. The companies should be heavily regulated and restricted with government subsidies so the population doesn’t feel the difference.","Why do they completely ignore manufacturing?I mean what are people overconsuming and wasting in the first place? Manufactured things. Trying to solve environmental issues from the waste end is fucking mental. Yes, we need to account for our waste and consumption but we do that by regulating the manufacturing in the first fucking place.","Idk, I feel like the emissions are simply a function of the amount of people trying to live on the planet and the standard of living they aspire too. You can tinker around the margins but more people, more emissions. My feeling is that the post industrial revolution, western standard of living relies on exploiting fossil fuels, if everyone on the plant has inalienable rights and aspires to the same standard of living, it has to cause problems.So its an inherently unfair pyramid where our standard of living is built on exploiting the rest of the world, so if everyone tries to reshape the pyramid it overloads the planet but why shouldn't people have that right to aspire to a better standard of living.Absent some magic bullet free energy technological innovation, I don't see a fair way to resolve the contradiction.I think liberalism will have a problem squaring this circle.","It really won't end until we massively scale back our myriad industrial sectors, and no red-blooded capitalist would deign to accept a greener footprint at the cost of a loss in profit. This headline, calling it a behavioral issue, is just blame-shifting when the ones most in need of \"behavioral reconditioning\" are the very same heavily armed and heavily monied people that have given themselves the right to decide what is and isn't acceptable behavior. It's why a certain date on a certain month back in 2021 didn't accomplish anything; how can you rebel by acting in accordance to your oppressors' rules?","If as citizens we were given a clear path to cooperating in order to achieve the goal of a clean earth I think most people would buy in. This, is not happening.Like others have said, me not drinking bottled water, not driving and not drinking plastic straws isn't saving the Earth.","It. Is. Capitalism. It is the system of production driving overconsumption. It is supply side driven. We all need to buy and drive cars because profits of car companies needed to be increased at the expense of investment into public transport. We all behave with overconsumption, but we are a part of the system that demands it if you are to keep your place in it.","Given much of the world is undeveloped, and all those people want the trappings of modern consumerism - I'd say the world is fucked.","Compulsive resource-hoarding behavior is at the root actually.","This absurd garbage ignores the fact that the vast majority of pollution and climate change is caused not by individual action but the actions of a small handful of private industries acting in the interest of profit, as incentivised by the systems they built.","Of the total emissions attributed to fossil fuel producers, companies are responsible for around 12% of the direct emissions; the other 88% comes from the emissions released from consumption of products.Source: https://www.politifact.com/factchecks/2022/jul/22/instagram-posts/no-100-corporations-do-not-produce-70-total-greenh/","When will people learn that this strategy is simply not going to work. People are not going to change. No matter how often they point out that they should for the environment. We have been at this for decades and frankly I am getting really sick and tired of people pretending to fight climate change by doing stuff like this.","Set maximum wealth to $50,000,000. Own the rest collectively. Cut out all the middlemen. We can build a lot for a lot less if you don’t have a bunch of parasites at the top.","Human behavior is at the root of every crisis and event in human history, this is no different. Any events of today is no different.","Hmm I wonder if this has any overlap with the social science that is economics. It would be interesting to find if any economist had a theory about the tendency for \"behavioural crisis\" to disrupt our society and productive systems. Perhaps someone post-Adam Smith, but maybe pre-keynes?","Oh really? I had no idea. I thought Climate change was caused by Evil Witches who live in caves.","These researchers are correct.Their solutions would be the end of the capitalism though, which the rich will never ever ever ever ever ever allow because then the rich won’t get perpetually richer. So continue on with the doom.","The fun thing is that was diagnosed 50 years ago if nothing happens to fight climate change. Nothing happened since then..","Nothing can be done until there is a single authoritarian state that governs the earth (which i am not advocating for). Without that, it is unfair. If the US puts all these laws/regulations into place we become weak compared to china or India. Our GDP slows. Our costs to produce goods skyrocket. Regulations are bad for economies. Our companies will begin to underperform foreign companies. The only way to combat this crisis is to all do it at the same time together. That won’t happen. china wont do it unless the US does it and who’s to say India will go along with it. Plus all parties have to be truthful and we know governments aren’t the most truthful.Fucking i think germany has a crazy high score on their recycling metrics because they burn plastic for fuel!!!!!! They dont actually recycle a large amount of their plastic and the fact they produce energy from burning it, means their recycling score is bonkers. It makes them look like saints. Really they are trading air quality for plastic recycling. Idk i read an article on it once a few years ago. Maybe things have changedAsia straight up dumps truckfulls of trash into their rivers because its cheap. Who’s gonna tell them they cant do that??!?!?!? Everything we make is made from plastic. Who’s gonna tell any country that they can no longer make things out of plastic? Are we gonna outlaw plastic? Then there will be an illegal black market for plastic manufacturing.Prisoner dilemma and a few other thought experiments show that humans are just naturally greedy. Maybe if women ran the world? Idk we haven’t tried that yet (i am a man)","and population growthOh dear goodness gracious time for another villain monologue. Can't wait.","i would say capitalism is pretty much a \"human behavioral crisis.\" Our economic system is based on eternal growth in a limited system, and that is just impossible.Combine that with the political capture by the elites and you don't have so much a human behavior problem, as you do a power imbalance.Human beings have come up with all sorts of ways to live on this planet, some good, some bad, some mixed. We all just think the way we live now is some sort of default, when really its an aberration in the long history of our species.We can and we will have to, figure out a better way to live. Our \"human behavior\" is pretty adaptable.","I disagree. On a macrolevel, humanity should expand, preferably exponentially. It should expand in everything - economy, general well-being, population, etc. There will always be high and low tides, but for 15,000+ years we’ve been on an uptrend, and should continue on it.What this guy says is partially correct - yes, meaningless consumerism is bad, but it’s a huge stretch to equate it to some “behavioral crisis”, humans have always been producing and consuming.Instead of trying to extinguish humanity’s flame, we need to adapt in the moment and create solutions which continue our progress. Green energy could be an example of that - but there is no harm in burning fossil fuels for the next 10 years until all cars are electric (just one example) if it means we don’t lose out on the speed of progress. Let’s not shoot our selves in the legs.Last point…“The Merz Institute runs an overshoot behaviour lab where they work on interventions to address overshoot. One of these identifies “behavioural influencers” such as screenwriters, web developers and algorithm engineers, all of whom are promoting certain social norms and could be working to rewire society relatively quickly and harmlessly by promoting a new set of behaviours.The paper discusses the enormous success of the work of the Population Media Center, an initiative that creates mainstream entertainment to drive behaviour change on population growth and even gender violence. Fertility rates have declined in the countries in which the centre’s telenovelas and radionovelas have aired.”This is absolutely scary, and is basically a large scale psychological terrorism operation. Absolutely unethical and I am surprised this is not spoken larger about.","How do WE collectively join together to fix something (climate change) that WE collectively created?\"People are the victims -- we have been exploited to the point we are in crisis. These tools are being used to drive us to extinction,\" - Phoebe Barnard (evolutionary behavioral ecologist and study co-author)","BuT i caNt stOP eaTiNg Meat beCAUse tHe MarKet. yOu Cant eXpECt peOplE tO CAre ABOut tHe ENVIronMent wHeN mEat aND MaRKEt DemANd.","[deleted]","We try to vote with our dollars as best as we can. I get a new phone only when the old one breaks down. Most of my entertainment is streaming and gaming, most of the time digital. We buy books digitally and use the library. We don't travel, though someday I'd like to take my wife somewhere exotic. We did buy a minivan but with a family you kinda have to.","It's concerning enough to me that I'm making some changes to my lifestyle, I will say that.For instance, I am a major collector (hoarder) of books. I love books; I wish I had a house big enough to contain them all. But I've realised that by hoarding them, all I'm doing is exacerbating the problem: I don't re-read, so those are books taken out of circulation - when they could be offsetting the trees used to make them by continuously changing hands. More books traded/bought secondhand = less people buying those books new.So I've made an incredibly difficult decision for my autistic, compulsive ass to start parting with them after I've read them. It's uncomfortable. I don't like it. But I want to do something to help the climate.I'm also going to start composting, recycling better, go litter-picking, reusing where I can, growing my own food in the garden, reducing plastic use, and walking when I can. I can't avoid meat entirely for dietary reasons but I can cut out beef, so sure, I'll do that. Bit disappointing but I'd rather the planet be healthier. And that's the crux of it: how much discomfort are we willing to tolerate collectively to save the planet? I mean, I'm not going to turn my gas fire off in a freezing January.Plus, what use is even two million of us doing that if industry offsets it by billions of tonnes of emissions?","TLDR: Capitalism is killing the planet. Got it. Those that control the system don't care","About the only way to shift things is for politicians to do something about it. We can vote in as many good actors as we want, but if there's not widespread support amongst the Boomers in the seats in the upper tiers of government nothing will change.We need a refresh, clear the chairs and elect people who actually embody the will of the people they're meant to represent. No more of this split down party line bullshit, we need to come together as countries and peoples to figure it out before we can no longer breathe outside.","Basically... we're gonna need drastic action and divergence from the current norm to change the increasingly obvious and locked in outcome.What we'd have to do is nothing less drastic than voluntarily matrixing ourselves... or at least move most of our physical human activity into the virtual space - where we go to work, where we go for entertainment, where we go to socialize and educate ourselves (even though so many of us are already doing this and doing so comfortably)... and then leave the function and maintenance of the physical world to highly optimized AI and robotic systems.But... too many would reject such a world - I suspect if people comment on this, it'll likely be in the negative - such is the radical nature of the proposal.And it's also a prime example of why we're locked into our doomed fate - far too few of us want to enact the drastic change that is required to stave off the problem at hand.The longer we wait to do so, the more radical the change needs to be, and the fewer our options become... until those that refuse to change have died out, and those that are left, have no options left but to die.","\"Humans are the stupidest species in the ecosystem.\"“In the case of economic agents, just like in the case of bandits, stupid people do not optimize the system they exploit. But whereas the bandits can survive a crash in their revenues when their victims rebuild their wealth, stupid people ruthlessly destroy them, ruining themselves as well. There are several examples in the history of economics: one is the case of the mining industry which is exploiting resources that will need at least hundreds of thousands of years to reform by geological process, if they ever will. It is also the case of industries that exploit slowly reproducing biological resources. A modern example is that of whaling, as we demonstrated in previous papers. The same resource destruction also occurs for other cases of human fisheries. Humans do not seem to need modern tools to destroy the resources they exploit, as shown by the extinction of Earth’s megafauna, at least in part the result of human actions performed using tools not more sophisticated than stone-tipped spears. Overall, the destruction of the resources that make people live seems to be much more common than in the natural ecosystem. This observation justifies the proposed '’6th law of stupidity,'’ additional to the five proposed by Carlo Cipolla that has that ’Humans are the stupidest species in the ecosphere.’”\"...Humans are a relatively recent element of the ecosystem: modern humans are believed to have appeared only some 300,000 years ago, although other hominins practicing the same lifestyle may be as old as a few million years. Yet, this is a young age in comparison to that of most species currently existing in the ecosphere. So, humankind’s stupidity may be not much more than an effect of the relative immaturity of our species, which still has to learn how to live in harmony with the ecosystem. That explains what we called here “the 6th law of stupidity,” stating that humans are the stupidest species on Earth. It is a condition that may lead the human species to extinction in a non-remote future. But it is also possible that, if humans survive, one day they will learn how to interact with the ecosystem of their planet without destroying it.\"― Ilaria Perissi and Ugo Bardi | The Sixth Law of Stupidity: A Biophysical Interpretation of Carlo Cipolla's Stupidity Laws","Behavior is built on several layers beginning with a theological ontology at the foundation, then a philisophical response to stimulus (life). Too many people have no ontological or epistemological purpose outside of the economy. So they give up. DON'T GIVE UPWWW.NTARI.IO","Yes we have alien technology for zero point energy and we’re not using it because the powers the be are keeping it hidden. I’d say that’s a behavior crisis.","Until we hold something in higher esteem than wealth and personal satisfaction (including personal safety), we are fucked.To band together we need a common belief, whether God, or nation, or just global brotherly love, we need to have a symbol of global unity. Only then will we get out of this.",""],"points":910},{"text":["Dreaming about future tech"],"points":0},{"text":["Manned outpost beyond Mars?","We put the man on the moon.. because it was fuelled by cold wars, basically who is advanced than who race.. but nowadays it's all economy, if there is no return of bling bling to goto space, we won't.. say if there is something on Mars worth lots of bling bling, we'd be there digging for it by this time..","I wouldn't bet on a human outpost. Distances are too vast, more complex vehicles to have to break and maneuver within a gas giant system, which is like a mini solar system, and also the radiation belt around a giant like Jupiter. Maybe a robotic outpost is possible. Our chances even for a Mars outpost by the end of the century is slim. A crewed landing for a brief period on Mars is very possible, I would bet by 2060's.","Titan and Europa may be easier to colonize than Mars or Earth's moon, beyond travel time.","I think a scientific outpost around Jupiter and/or Saturn is not impossible by the end of the century. So much to explore there, it would make sense to have something right there instead of sending a new probe every 20 years. Probably not large space stations with a singificant population though.","The thing for space exploration is always “Why?” So in order to even send a probe to another planet, they evaluate the pros and cons and what they can benefit from sending a billion dollar probe into space. That’s the million dollar question.A good example for this is the nearest object to our planet. The Moon. It is relatively near to us but there is absolutely no interest to visit it any time soon. But Mars on other hand is pretty far away but is a very strong candidate.","I think we will seeing the beginnings of scientific bases on Venus and larger bodies in the asteroid belt towards the turn of the century.","Is it likelyHumans can't survive off world. Our bodies require Earth gravity to function. Humans is distant isolation in Antartica, with free air and water, lots of entertainment options and full confidence they can be rescued relatively easily, still go mad. Imagine how difficult it will be when you know any accidents are potentially fatal. The isolation will be crushing.So this will never happen. There's no technological or eonomic path for permanent occupation right now anyways. There's been no major \"game changers\" that point the way.","Extremely unlikely.It’s been over 50 years since we visited the moon, we havent been back in decades because there is no real economic incentive.Then there is the tech barrier, even a visit to Mars is a challenge now, let alone permanent habitation. Beyond that is magnitudes more difficult.And then there are the challenges on Earth with a deteriorating climate having ever greater impacts on our economy. It will be more difficult to justify what are basically expensive vanity trips that could just as well be done by relatively cheaper robots in a time where we will likely see huge upheaval from extreme weather evens and the impacts on our crops and coastal cities.That said, the future is never certain, who knows AI solves a bunch of our problems and it becomes super easy to go out beyond the moon.","No. Anything less than 1g is lethal to humans in the long term.","[deleted]","In the end the factor that decides where and how spacecraft are sent is money. If there is money to be made by sending humans to gas giants, then it will happen. Given the huge costs involved and the pace at which AI and autonomous systems are developing, it seems that sending autonomous systems will be much cheaper.You can of course send humans for propaganda purposes, but I don't think there is much propaganda value in sending humans to gas giant moons. Most average people would simply be \"they send astronauts where?\". Add to the equation the possibility of loosing the astronauts and the case for a propaganda trip isn't very good.The only way I see humans being sent to gas giant moons is if there is a development in rocket engine tech that brings down costs by several orders of magnitude.","Not at this pace. My estimate in rough order would be: Moon, Mars, and Titan. Titan would act as a fuel hub owing to its atmosphere and hydrocarbon lakes, making it the most logical choice among the gas giant moons. So, Moon and Mars have to come first, both of which remain slowed down by bureaucratic delay. The distance factor will be remedied eventually by technological advancement; the worst things affecting space colonization are within our own governments.","Outposts on gas giants? No, they'd be crushed. Space stations and/or outposts on their moons? Almost certainly. There are some valuable resources on the moons of gas giants and there's plenty to be learned from them.","We need to develop a lot more tech to coordinate these kinds of activities. Check this out www.ntari.io/tos","we will leave the moon for the starswe will travel way beyond the marswe will stop all of the warsyeaaah we gonna ride the planet horsehttps://youtu.be/QOgKho9ngko?si=BSVZJ8_qAXbu5x20","Yeah there’s missions already on tap for exploring Europa and Ganymede for life in their oceans. The “cloud city on Venus” is not on the agenda yet but it could happen as humans began to mine objects in the asteroid. Siphoning off the usable gasses from gas giants requires people too","Not unless we have a warp drive or FTL or whatever. So yes, the distance is too far. Keep the crew alive you know","DARPA have awarded feasibility projects to a number of companies, in regards to putting commerical lunar infrastructure on the moon. Roads and what not by 2030s.https://spacenews.com/darpa-picks-14-companies-for-lunar-architecture-study/Lockheed Martin, have with their spin off company Cresent Moon, plans deliver full coverage of the moon via satellites.NASA have tested laser based communications recently.You'd have to say depending on how that all goes and how the space race between China and USA develops (China want to be the major space power by 2045), we might have a Mars landing by 2040s - 2050s.Beyond that it really depends on propulsion technologies and the usual suspects of enough water and oxygen.In the longer term, say next 100-200 years, I could see outposts on moons that have reserves of water below their surface.","There are a few obstacles standing in our way. First of all in order to large structures in space we will need to learn how to harvest raw materials and process them in space. We're not even close to this yet.Secondly human societal structures tend to be relatively simple and self-regulating. This would not be very well suited for creating sophisticated space colonies with international cooperation. I would suspect that the human need for dominating other humans terrorism, war,corruption etc would preclude us from long range planning tasks like this.The third big problem is that the human body is just not suited for space travel. We have specific needs for example we require gravity heat food protection from radiation etc which would slow down any progress about building space stations and space colonies especially in distant locations like the outer solar system.My guess is that humans will continue squabbling and fighting over the dwindling resources on Earth and will eventually become extinct within the next thousand years.","Doubt it. The moon and maybe mars is the most realistic goal of this century. We still don't even know what effects low gravity will have on the human body, and how to protect against solar radiation effectively. We also need to study if it's even possible for an outpost can become self-sufficient.  The iss has been up there for 23 years and only recently did we learn pretty much everything we can with microgravity and being in low earth orbit","I think it will depend more on cultural motivations than technical. With mostly autonomous mining and manufacturing on the lunar surface being a goal within the next 20 years, we will have the ability to build much larger spacecraft/fuel tanks than what we could readily launch from the Earth's surface, that or in orbit manufacturing/assembly might be preferable. The challenges are not small, but within the bounds of human ingenuity.Getting out to the gas giants and ice giants in a state where humans actually want to go is another matter. Depending on how quickly we can get a human from Earth to a research station, our needs for radiation shielding might be manageable, but assuming you don't want to send old people on a one way trip, you are going to need a very fast very reliable. vehicle, or a slower but much more shielded vessel. Both options are resource intensive, so if people think its worth it we might. Realistically, we are more likely to send more and more capable robots than biological people, but those robots could be considered human beings with rights and with that respect they are crewed facilities.","Man hasn’t left low earth orbit since 1972. Fifty years after the last moon landing we have gone nowhere. Without some sort of new space transport technology, it’s unlikely we will be sending people beyond the asteroid belt before the 22nd or 23rd centuries. However there will be lots of very cool robotic missions we’ll likely get to witness.","No the biggest issue keeping us from going farther than Mars isn't necessarily travel speed but propellant boil off. If we can find a dense and lightweight propellant that doesn't boil off and gives good amounts of Delta V it is possible.","It is barely conceivable that we could use a colony in the asteroid belt to simplify mining the asteroids. If we find life on one of the methane saturated moons, it's almost conceivable that we'd set up a nearby, but not on that moon, colony of scientists, if only long enough to figure out how to collect and ship the critters so everybody can get a look.A colony on Mars is not all that scientific a goal. It'd be nice to have people in the loop when we're looking for life, but it's mostly to boldly go because that's the kind of species we are.","I think energy is the biggest threshold. If we can have a break through on energy production I can see a humans having bases on all planets in the next two centuries","No way. I'd be surprised if even Mars. There's no financial incentive so why would we do that. The curiosity is killed by the cost here, even for Mars. We haven't even explored Antarctica","There will. As of right now, there is a new existential awareness emerging similar to what was seen at the end of World War that lead to the space race. Space race ending up with Russia launching Sputnik and the US landing on the moon. The new existential awareness is the new void that has been created by the normalist elites who rule the world. They have since the 1970s, have had an international system entire predicated on motivation being based on income and nothing more. What was produced was what was produced and harbored no incentive for innovation. Hence, part of why technological innovation has slowed down outside of the potentially profitable AI. Not even motivation in utilizing said money and its values for said innovation as said motivation is only to make more money and/or buy more assets. Innovation itself utilizes motivation that is independent of motivation to produce profits. Though now with this void of motivation, the rise of AI taking jobs, and the misery of only producing wealth for the sake of wealth, there is an upcoming existential crisis that is going to affect every single class of people on Earth except maybe for un-contacted tribes people. People will have no reason to work for someone who won’t pay them or offer them any real reason to work for them intrinsically outside of potential threats to livelihoods. CEOs with AI taking up all the workers will have no reason to employ anyone to work for anything less than free as their only motivation is profits. After said conflicts subdue and the international societies work these issues out, there will along with AI and the internet be a surge of innovated technology that will be something like seen in the Space Race."],"points":84},{"text":["Surgeons externally attached a pig liver to a brain-dead human body and watched it successfully filter blood, a step toward eventually trying the technique in patients with liver failure.","The following submission statement was provided by /u/mvea:The University of Pennsylvania announced the novel experiment on Thursday, a different spin on animal-to-human organ transplants. In this case, the pig liver was used outside the donated body, not inside – a way to create a “bridge” to support failing livers by doing the organ’s blood-cleansing work externally, much like dialysis for failing kidneys.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19agnum/surgeons_externally_attached_a_pig_liver_to_a/kikmyw8/","God I hope there's a day when scientists can rebuild a heavily damaged brain. Not just for me but for so many other people that have relatives that are suffering with debilitating brain injuries.","The University of Pennsylvania announced the novel experiment on Thursday, a different spin on animal-to-human organ transplants. In this case, the pig liver was used outside the donated body, not inside – a way to create a “bridge” to support failing livers by doing the organ’s blood-cleansing work externally, much like dialysis for failing kidneys.","It makes me a bit uneasy using brain dead people in experiments, it shouldn't, my father had brain death and we donated his organs to save lives.It is a step in the right direction, but anyone that had family dependent on dialysis will tell you this is not a long term solution. Hopefully better xeno transplants can be the next intermediary solution while we search for a long term.","Is it possible that brain-dead humans can be used for experiment research long term?","A step you say? Perhaps a pigstep? I’ll see myself out…","And they dont even honor the donor by giving the name","Ok, so like zombies? Like that's the future, reconstruction of dead brain cells or reviving them, but its zombies!","Bonus, after you get your new liver you can eat the rest of the pig"],"points":118},{"text":["The next generation of nuclear reactors is getting more advanced. Here’s how.","The following submission statement was provided by /u/BlitzOrion:Molten salt is one leading contender for alternative coolants, used in designs from Kairos Power, Terrestrial Energy, and Moltex Energy. These designs can use less fuel and produce waste that’s easier to manage.Other companies are looking to liquid metals, including sodium and lead. There are a few sodium-cooled reactors operating today, mainly in Russia, and the country is also at the forefront in developing lead-cooled reactors. Metal-cooled reactors share many of the potential safety benefits of molten-salt designs. Helium and other gases can also be used to reach higher temperatures than water-cooled systems. X-energy is designing a high-temperature gas-cooled reactor using helium.TRISO, or tri-structural isotropic particle fuel, is one of the most popular options. TRISO particles contain uranium, enclosed in ceramic and carbon-based layers. This keeps the fuel contained, keeping all the products of fission reactions inside and allowing the fuel to resist corrosion and melting. Kairos and X-energy both plan to use TRISO fuel in their reactors.Today, most reactors coming on the grid are massive, in the range of 1,000 or more megawatts—enough to power hundreds of thousands of homes. Building those huge projects takes a long time, and each one requires a bespoke process. Small modular reactors (SMRs) could be easier to build, since the procedure is the same for each one, allowing them to be manufactured in something resembling a huge assembly line.Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/19aaz77/the_next_generation_of_nuclear_reactors_is/kijpkxj/","Molten salt is one leading contender for alternative coolants, used in designs from Kairos Power, Terrestrial Energy, and Moltex Energy. These designs can use less fuel and produce waste that’s easier to manage.Other companies are looking to liquid metals, including sodium and lead. There are a few sodium-cooled reactors operating today, mainly in Russia, and the country is also at the forefront in developing lead-cooled reactors. Metal-cooled reactors share many of the potential safety benefits of molten-salt designs. Helium and other gases can also be used to reach higher temperatures than water-cooled systems. X-energy is designing a high-temperature gas-cooled reactor using helium.TRISO, or tri-structural isotropic particle fuel, is one of the most popular options. TRISO particles contain uranium, enclosed in ceramic and carbon-based layers. This keeps the fuel contained, keeping all the products of fission reactions inside and allowing the fuel to resist corrosion and melting. Kairos and X-energy both plan to use TRISO fuel in their reactors.Today, most reactors coming on the grid are massive, in the range of 1,000 or more megawatts—enough to power hundreds of thousands of homes. Building those huge projects takes a long time, and each one requires a bespoke process. Small modular reactors (SMRs) could be easier to build, since the procedure is the same for each one, allowing them to be manufactured in something resembling a huge assembly line.","If they haven't already these companies are going to find that the reality is their designs too are subject to exactly the same torturous planning, approvals and appeals that makes any nuclear project take a decade to complete. And what is worse the designs are novel, which makes the public easier to whip up against them for faux green activists and gives politicians more excuses to do the wrong thing.Rolls Royce has been trying to get SMR's off the ground for 2 or 3 decades and has yet to gain approval (that sticks) anywhere even for a pilot plant. Thats been the case too even for advanced traditional plants that could completely lose all power, lose control and still self contain."],"points":6}]