[{"text":["Snapdragon X Elite vs Intel Core Ultra 7 155H: We ran the benchmarks","I like to hear it. The more competitive these guy get, the better for everyone.","Nice of them to include the fanless MacBook Air 😂"],"points":8},{"text":["Jailbroken Wiis gain access to a revived digital storefront | Service could eventually offer every digital Wii game for free","lol... not if this makes the news on all these tech sites it wont","Even if it's not available through the Wii, the system having life is a great thing. If only it output HDMI natively.","I jailbroke my Wii back in the day with a wiikey or whatever it was. Had to grind down an IC on the PCB to get access to pins to solder it to, because Nintendo had cut the pins on the outside of the package in an effort to prevent jailbreaking. Good times.","Nintendo’s veritable army of lawyers will never let this happen","The hackers in the Wii scene have always been cool - back in the day I followed team Twiizers and that scene, hacked my Wii to play stuff from a hard drive.A few months ago I decided to fix it up - to my surprise the scene is still alive and had one script I could run to update everything, and they even have online multiplayer and the Wii channels hacked to actually work today. Only hiccup was having to setup a separate WiFi network for it.Really no need for a service like this, you can do it over your local network already or just use a hard drive like I do.","my local pawn shops used to give you a wii for free with purchase. they had so many they were basically worthless to them","Recently been having a lot of fun with my homebrew Wii. It’s so nostalgic and can do so much fun stuff. You can get the component out cables (5 color) to do 480p natively from the Wii. Honestly, that looks really good. I have mine hooked up to a Trinitron CRT that only does 480i so it’s “max resolution!” lol. But seriously, mod you Wii. It’s fun.","I just wish I could play those extra Mario Kart levels that were only available online.","Im told that Nintendo got lazy with its Wii/WiiU store encryption, which made it easy for someone to create an app that literally downloads the games to your Windows PC for free, copy the files to a SDHC card, install using homebrew software. Done and Done.WiiU may not have been popular, but its freaking awesome for hacking. It will play almost everything and GameCube/Wii games dont even need emulation as they use the same OS as the WiiU. Connect a 1TB external SSD and have enough room for almost every GC/Wii/WiiU game, everything else can be stored on the SDHC. You can even buy adapters that let you connect N64 or Sega controllers to your Wii Remote. The Gamepad controller even upscales old NES-N64 roms, making them more playable.","IMO If someone buys a digital item and it becomes unavailable from the original source that shouldn't mean that the purchaser loses his rights to the item.Consumers should have their rights protected.","So let’s say I had a Wii still…. And I want to AVOID doing this so I don’t go to prison on accident. What website do I need to stay away from?","The wii is still a charming system. Muramasa demon blade is underrated","The wii has been the one console I always have running.","Anybody have a guide to get something like this on a Wii? I found a working one at a thrift shop for 25$ but a lot of the games I want to play are expensive and hard to find.","Wii Shop Wednesday are back boys!","Why do you need a digital storefront though for a jailbroken Wii? When all you need is an SD card? The whole internet is a digital storefront. I'm not about to be posting links, but if you really can't find what you need then you aren't looking very hard.","Does this work for the Wii U in Wii mode?","I had that thing that gave me every wii game for my nieces 10 years ago.","In my opinion, the Wii + WiiU are the best consoles ever made by Nintendo. Both still have a place in our home.","That's a shame; I'm only interested in the analog wii gamss.","I mean, happens with pretty much every Nintendo system..lol, even the Switch has had various shops pop up. They’re already aware, they do what they can to stop them but every time they strike one down another pops up.","What? I only mine to play Melee. Is this the same thing as the Homebrew?","Could the 15 of us who bought a Wii U take advantage of this with the Wii software on the console?","I don't care about the games. I just want to sit & listen to the music for an hour.","One of these already exists for hacked Vitas, it's glorious. So many games...","Literally no reason for Nintendo to take this down, they shut down the services, basically they will make no more profit from the Wii, it's not worth it monetarily","“Many critical functions, including downloading games and apps, don't work yet”This isn’t going anywhere","Nintendos Attorneys.","Why play on the Wii at shit 480p when you can emulate on PC in 4k?","Now I wouldn’t have cared years ago, since I have my favorite games backed up” already but with my 3 year old this could be awesome lol.","Nintendo lawyers be like:","This is such old news.","Buy the games m/movies and support your developers and actors… or we deal with strikes that can bring these industries to a halt. People and the workers themselves complain about pay, yet still choose to a pirate. Companies will always always 1up the consumer. Up to us to be the bigger side of it and start doing what’s legally right on our end.","Until Nintendo crushes them","Homebrewing your Wii and adding HDMI is easy. The real challenge is getting the controllers/sensor bar to work with the large size TVs today that weren’t in the original design spec. (Open to suggestions on this!)","mario kart!","Expect that to be patched real quick"],"points":1812},{"text":["Asus says Intel’s NUC Extreme isn’t coming back","FUC!","The moment Intel was like \"nuc is gone but the others can still do it, we encourage it!\" this was kind of destined to happen. No company gave enough of a shit even though the barebones pc thing is a neat idea.","I mean might as well build an itx system with actual upgradability","I really liked the idea, but it was never a fit for anything I wanted to do. I guess I wasn't alone in that.","The Extreme was probably a fan service. I don't think majority of the sales of it were made there as I saw more regular cube NUC in conference rooms and never seen an Extreme.","The only thing I’ve ever liked about the NUC is that it has a skull on it for some reason."],"points":129},{"text":["Samsung’s Galaxy S24 phone might someday have fees for AI usage | Samsung says AI features are \"free until the end of 2025.\"","I'm so fucking tired of everyone making every aspect of life basically fucking DLC.","What features will these AI phones have that people will be willing to pay ?I am unable to understand the whole AI in this AI in that.An AI based voice assistant. I don't see the charm. It's useless.","This will go like the “heated seats of BMW”, they put the feature under a subscription, no one bought it, they switched back.BMW drops plan to charge a monthly fee for heated seats - The Verge","Don't really care for AI.I still have a new Samsung Policy to agree to on my phone which has been sitting there for almost 3 years.As you get older, these things really don't matter anymore.","Neat.I’m inclined to decline that offer","I'd settle for the ability to uninstall all of that Samsung bloatware.","As long as I can disable it or choose not to use it. I don't care if they want to charge for it. If I ever find that I do want to use AI for some reason, there are plenty of free options.","The rest of the world trying to figure out how to turn off all of the samsung bullshit on our galaxy phones.God damnit, Biggsby","Well. That just cancelled my order then. Shame. I need a new phone. ASUS ROG phone it is then.","Just like buying a Subaru and getting a free 3yrs of starling service but having to pay a subscription for the same service every year for the rest of the vehicles life.","well yeah, its not like they dont cost samsung anything, this is free trails, so business as usual.","Between Microsoft awkwardly trying to shove yet another assistant at us and Samsung demanding yet another subscription fee, and given both companies' propensity for obnoxious notification spam and nagware, this is about the best advertising Apple could hope for.And I'm saying that as someone who loathes my work-issued iPhone.","Look, I've been an Android user since 2010 with the Motorola Droid. I've stuck with them through the proliferation of notification spam, the rampant increase in data mining, and the relentless march of features that I just could not possibly care less about (I will never need to add cat ears to a photo).I've tried iOS a few times over the years. I know people love their iPhones so this isn't a slam on them but I personally find it awkward and annoying to work with. I have a work-issued iPhone and some of the core features (\"swipe down from the top ... no not from that top, the other top ... no on the other side of the top ... no not that side the other other side\") drive me nuts. People should use whatever phone they like but for me personally, iOS is just a huge hassle.But adding a subscription fee gets us a lot closer to a tipping point where I have to choose between being annoyed at iOS, or being increasingly annoyed at AND paying additional fees to use Android. And I can probably just re-learn my usage habits to match iOS.","Not for me thanks","Yeah because I already use bixbee so much /s","Subscribe or get rekt b...ch is the new tactics to milk your money.","It is so nice of samsung to go out of their way to boost the sales of their rivals.","I hate the future.","If people want AI features on their phones badly enough to pay a shit subscription for it they should just get a Pixel instead since Google loves to advertise how it's all about AI on their phones. Samsung is kicking themselves here.","Why would anyone want a free trial preloaded on their phone? It isn't a feature if you don't know when it will suddenly disappear and be locked behind a subscription.","Phone dlcs now.....","I can't tell where the s24 is better than the S20. Slightly faster processer on the S24, but otherwise it's a worse phone. Same ram, no SD card, micro transactions, nobody cares about slight camera changes, and the cost is stupid. Skipping this one.","Like Klaus Schwab said, \"You will own nothing and be happy\". But y'all will still vote for candidates that are enacting this agenda.","I was thinking about switching to the Pixel Phone, this makes my choice much easier.","yeah because a 1300$ + smart phone isnt enough","K. I'm upgrading to an xperia then","You read about Apple overtaking Samsung in phone sales and other statistics of Apple gobbling up the market space more and more each passing year, and you'd think Android smartphone manufacturers would make genuine attempts to make strong comebacks. Alas, they're audacious in all the wrong places - ditching the headphone jack because Apple did, selling phones without the charging brick cuz Apple did, setting the phone prices sky-high because - yup you guessed it - Apple did it with their $1000 trend iPhone X onwards.Worse, they're failing to provide reliable software and security updates, consistently less stellar software and hardware experience, and the list goes on. Now, Samsung doesn't have strong MVPs with their S24 series lineup against Apple's 15 series. So when I read about the new AI tricks, I thought this would help them as they worked with Google to bring some pretty neat, useful and exclusive features to their new phones. But there it is, you gotta pay for that in addition to a friggin $1300 for the Ultra. I'm sure that'll work out well for them.In so many of the aforementioned aspects, many Android devices could offer something beyond what Apple does that's also less pricey and flaunt that advantage in their marketing. They have some great perks with Android in how practical, customisable, operational it is, and yet they seem to fail to see it and keep making things worse.Know your place and turn that into the desired destination.","Welcome to the future! What tier of AI can you afford to subscribe to?","Wait the only new feature that might sound interesting on this phone they're going to put behind a micro transaction wall?Hahaha haha hahaha... Fuck that shit.","Quietly marks the s24 off my potential new phone list","Open Source will kill chatgpt and Microsoft shitty bing Ai","As far as I can tell, most of the AI services that are offered, are done so through access to servers running the AI. So in order for the AI to be utilized, you would need to access their servers. This costs money to run, and that I can understand. There are chipsets with AI built in, limited as it may be, that do exactly that. It's only Intel right now, but that's just a matter of time until everyone else jumps on the bandwagon. I don't think it's worth it at the moment to hop on as an everyday consumer. As a creator or an artist, there are plenty of reasons to want or need it.","Maybe it will also someday have the better CPU everywhere in the world instead of just US and yet the price being the same lmao.","Make an AI assistant that's actually useful and I may even be glad to pay.","I think they're overestimating the amount of people that will actually use any of these AI features outside of the camera.","I was just about to trade in and pre-order it. Thanks for sharing this info. Definitely not upgrading to this","Okay next phone will be pixel with the graphine os lol","See this is why Samsung phones are awful. They have ads everywhere, and now they want to charge you for phone features.","Samsung needs to give stuff away after their source code got stolen and Lee Jae Yong got convicted for bribery","Sounds great, since this will lead to custom roms and more rooting communities, to counter corporate greed and allow users the freedom to do whatever they want with their 1500€ devices","well thats why i am still happy with my s21 ultra as though those AI are a great features, im still happy with my s21 ultra as its performing very well.. and don't need those AI features that much","The \"AI\" features of the new s24 lineup seem so useless.","Good thing I'm not gonna use it so I can save some money","Well, time to invest all our money into AMD, Intel and Nvidia.","u/spelunka13 would love this","/r/localllama","Hearing this makes me SO MUCH less interested in the S24","If the end users in mass provide the data why charge them to generate it.","I'm actually glad I won't have to pay for a \"free\" feature, either by paying for it in the cost of the device, or by being shown ads, or by having my data collected and sold.I don't need AI? Cool. I won't pay for it.","So smartphone DLC now? We have become a DLC culture!!!","First hit is always free ...","I was going to swap my Google pixel 7 pro for one of these but nvm, not that I'd ever use the features, it just feels gross buying a phone and some of the features become paywalled, what else will they paywall?","I won't pay for it, FU Samsung :)","How much to get a better battery? How much they gonna charge for email support? Gotta start charging to up the screen brightness past 25% and charge per percent.","No thanks"],"points":1479},{"text":["Acer Swift X 14 Review by PCMag"],"points":0}]