[{"text":["Ring is reportedly walking back its police-friendly stance on data sharing"],"points":0},{"text":["Samsung chairman calls Galaxy S24 series \"more disappointing than iPhone\" at high-level meeting","This article is a bit misleading. Apart from all the needless speculation all over the article about the S25 series and even the S26 series, the actual quote is incomplete and has no context.\"Galaxy smartphones are more disappointing than iPhone in this regard\". We dont actually know what the topic of discussion was where it was being compared to the iPhone. Could be camera/battery/screen/cpu/RCS/ecosystem/prices/sales or literally anything else.","Glad he did, hope this leads to some changes in the right direction.","I'm glad the executive board is now aware of a problem that any Samsung phone owner could've told them years ago.It's great they've identified this as a serious issue - hopefully we'll see some devices in the future that aren't just the same incremental component upgrades. But also, why did it take this long to realize things need to improve?Apple's last few iPhones haven't been particularly innovative either, so using that as a benchmark and still considering yourself demonstrably behind is a bad place to be.But on the other hand, what kind of innovation is going to make a serious improvement? There's no competing with Chinese OEMs on price. iOS users are extremely unlikely to switch to Android. If they continue the path of incremental CPU / camera improvements and tout benchmarks and mostly unimportant efficiency gains each year, no one will care.Do we want to see novel ways to leverage Samsung's ecosystem of devices? What at the granular, product level can Samsung do to actually \"wow\" consumers? I feel like consumers are right, that Samsung's devices are lacking in innovation, but with the exception of fold/flip phones, which still don't have particularly strong market penetration, consumers don't like changes to these kinds of devices. Phones that try something different never really seem to sell well compared to the big-screen, flagship processor, fancy camera blocks from any OEM that top the sales charts.","iPhones aren’t exactly making breakthroughs either. iPhone 15 is advertising titanium casing as its core new feature which is absolutely laughable. I don’t see myself upgrading my iPhone 12 for another 3 years minimum.","Yeah Galaxy AI being the selling point when Samsung is notoriously shit with their software gimmicks is the reddest flag they’ve flown in years.","I won't buy another Samsung from the sheer bloat of apps and crap on it.I just want a simple Android OS, what's the OS size up these days?They don't advertise that a good % of the phone storage is straight up wasted on useless crap...","IMO, we've reached a point in phones where they haven't been remarkable for like 5 years or more. It just feels like nothing has really changed since the iPhone X/ S10 came out, other than prices going up.Until phones get a dedicated GPU, or real AI assistant integration, I don't really see any new phone as remarkable. Maybe the folding phones are cool or something, but they are far too expensive for me to even consider","I critique both Apple and Samsung because even though they’re the best in the business they have many missed opportunities due to complacency.The S24 Ultra is actually the first phone in recent years that introduced something that we didn’t know we needed and is immediately noticeable: an extremely good looking anti reflective coating that not only minimizes reflections but saves battery by making the screen readable at lower brightness AND also makes colors pop more with a darker black level for improved contrast.It’s such a simple thing that the OLED TV industry has been doing for years with great results, it’s weird how it hasn’t been applied to smartphones extensively.I’m only pending durability results to see if users complain about uneven colors/coating after months of use but if not it’s something great that I’ll look forward to on my next phone.Otherwise yeah it’s an overall uninspiring update, but this has become the norm lately.","Good, because he's right.","I hated Android because I'd mostly only seen Samsung phones that other people had. Then I tried a Pixel and realised it wasn't Android, it was Samsung and their software modifications. Wasn't quite enough to pull me away from iOS, but if I wasn't already invested in the Apple ecosystem I probably would have chosen the Pixel.","This is kinda a shit take considering what Samsung are doing with flip phones and foldable screens.What are people expecting? The candy bar form factor won, so the camera, screen and battery are only going to see incremental improvement.If you want something radical, you're going to introduce it in a new product line, like they did with the Z line-up.","I thought so. I was kind of pissed at first because I got an s23 Ultra about a week before the s24 Ultra came out, but after looking at the changes, it's pretty much the same phone. Not only that, but I heard the AI stuff was going to be behind a pay wall.IMO, I think it's gotten to the point where phones need to be like gaming consoles. Instead of releasing every year, just release a new model when there is a big enough change to consider the new model as an upgrade.","Have we reached that point where’s there is nothing really new to add to smart phones?","Maybe aping Apple at every corner a few years late while also mocking Apple is not the best business practice.","This is what happens when your business model is to produce a new model every year regardless of if its actually worth it.","Samsung and Apple are just good at improving their margins on the price. For a $1k+ phone, I would expect an IR blaster as standard. Samsung did away with them several years back and yet I think they provide such a utility to have your phine double as a remote.Just as well the Chinese brands still pack all their phones with features.","The companies want innovation so they have a reason to sell new phones to people who already have a phone, but do consumers want innovation? No, I don't think they do. They don't want a phone with a weird pop-up camera instead of a front-facing camera, they don't want a phone that's twice as thick to hold a bigger battery, they don't want a phone with a second display on the back, or a phone with active cooling and ventilation for hardcore gaming, or a phone with completely open-source modular parts and software. These phones all exist and they barely make a splash because although there's someone out there who wants each of them, none of them are what the public as a whole is actually looking for. The public as a whole just want whatever is like what everyone else has. There's so much desire in the large cell phone market to fit in rather than have some weird niche phone that has downsides that people might make fun of you for. Hell, one of the main reasons that the iPhone has finally reached the top of the global market share is because kids literally shame people who have \"green bubbles\".If anything, the Galaxy S24 being \"disappointing\" to this Samsung chairman should be taken as a good thing for you, the consumer. It means they're running out of ways to extract more profit from you. Your current phone is so good that they can't figure out how to upsell you. So keep it, and be happy!","haven't seen an S23 or newer in person, but from what I can tell, Samsung is starting to do the same thing as Apple: release the same phone every year with very minor changes","Smartphones are powerful enough for the next decade, only thing that still hasn't had major innovation is the battery tech. Quick sharge is one thing, but storage capacity has plateued for years now.","Phone innovation has been stale, apart from more than one rear camera starting with the galaxy s9 or something else way back then, and foldable/flexible tech.Take a look at laptops instead- 3D (glasses-less) displays, impressive performance with the power of a phone, ARM based devices actually looking to compete against x86 systems in performance, modularity and easily replaceable components+diy solutions... There's even a laptop coming out, where the screen is literally just an android tablet! Phones can learn a thing or two from these larger devices (and in turn laptops can learn for example how to get better webcams installed)","We finally did it guys! After copying the iPhone for years we finally beat them at their own game!","I mean, at this point, what's really exciting about mobile phones? Honest question. I haven't seen anything that peaked my interest over the last 10 years or so, besides a slightly better camera.","I use an S10+ currently and need to upgrade after 5 years soon. I don't know what I should upgrade to though... 🥲","samsung galaxy s25 it is then","Standard c-level speech lol.","as someone who picked up a s23 ultra a few months ago and was contemplating waiting for a s24 i agree with that comment, there's really nothing new of interest in this model for me. just ai gimmicks and a slight camera change","They already have the flip and fold, it’s like the new note line before that caught fire (figuratively and literally)If they want risk convincing people to move from a rectangle, lower the price. If still wanting a rectangle they’re probably looking for something to last a couple of year","Bring back removable battery and minijack port.","\"Upgrading\" from my S20 at this point would net me an inferior screen and an inability to use a microSD card, and cost me $800 for the privilege. Why would I even consider it?","There’s 0 hype behind the S24, it’s time to change the design Sammy…","Thanks, Exynos!Seriously, Samsung should've just stuck with Qualcomm's Snapdragon chip sets.","I want a phone I can put in my butt - chairman","I'm not buying a phone without a headphone jack. Don't know why they thought getting rid of that was a good idea.","Their phones have become progressively worse each generation. They peaked with S10 series and its been downhill since then.","There only thing worse than an iphone is Samsung bloatware.","One thing I would like to see Samsung do I make it easier to cancel Samsung Care. It’s either call them or mailing them a request. It should be online with list of all devices and the care and an option to stop it. I am still getting charged for devices that I don’t have anymore.","Someone deliberately made 24 weak as a filler so 25 would look better in comparison.","I'm satisfied with my S23 though.","As if iPhone 15 had any shift in innovation . It’s the same as it preceding ones. Only reason why ppl brought them was bc they had old iPhones","Samsung chairman calls Galaxy S24 series \"more disappointing than iPhone\" at high-level meeting￼Samsung's chairman wasn't impressed with the Galaxy S24 series (image via Samsung)Critics have long pilloried Samsung for its conservative approach to its high-end Galaxy S smartphones. Apart from an upgraded SoC (and a 1440p screen in one instance), the Galaxy S24 and Galaxy S24+ offer virtually no upgrades over their predecessors. Similarly, the Galaxy S24 Ultra ($1,299 on Amazon) has also been mocked as a Galaxy S23 Ultra with AI features sprinkled on top. Samsung's top brass seems to agree with the sentiment.Naver news reports that Samsung convened an all-hands meeting of its many departments. Department heads of Samsung Electromechanics, Samsung Display, Samsung Device Solutions (DS) and 40 other CEOs were in attendance. Lee Jae-Yong spearheaded the meeting and showed everyone a video highlighting the difference between Samsung and its competitors.Here, Lee said, \"Galaxy smartphones are more disappointing than iPhone in this regard\", hinting at a lack of innovation and years of incremental upgrades. This could result in a massive shift in Samsung's strategy moving forward. Chinese OEMs have run laps around Samsung flagships for some time by offering high-wattage fast charging, copious amounts of RAM and top-spec cameras, many times for a fraction of the price of a similarly-specced Samsung counterpart.Only time will tell if this leads to any meaningful change in Samsung's strategy. A previous leak hinted Samsung could switch things up with the Galaxy S25 and Galaxy S25+ by using a Sony camera sensor. The Galaxy S25 Ultra will come with variable zoom, and the Galaxy S26 Ultra could be the first of its kind to use a 1-inch sensor. The Galaxy Z Fold6 and Galaxy Z Flip6 are also rumoured to shed some weight and come with larger displays.Source(s)Naver (in Korean)",""],"points":2161},{"text":["'Our long-term objective is to make printing a subscription' says HP CEO gunning for 2024's Worst Person of the Year award | Not satisfied with merely bricking printers, HP now wants to own them all forever!","🤔My long-term goal is to never buy another HP printer.","Why people still pick HP over Brother is beyond me","I have been into personal computing since 1989. In all that time, the only constant has been that printers were, are, and will forever be the spawn of Satan himself, dooming us all to misery and pain. HP is just being the loyal servant of the dark lord, as he demands.","I wish a very quick and brutal chapter 11 on HP as a company.","Sick of these greedy asshole companies and their SAS bullshit. Make a product, sell it and get the fuck out of my pockets.","I’d rather hand write a document before I pay HP a dime for printing.","We FINALLY got a new printer last year after a few disappointing HP years - and I can honestly say that it's the first time i shopped and chose a product based ENTIRELY on what I've seen discussed on Reddit. Went with Brother and I could not be happier.","I have an old Epson printer and have been using cheap ink from Amazon for a while. I get a warning but that's it.I fear the day when it dies and I have to research this crap to avoid scummy companies and products.","HP is complete trash. I don’t understand how anyone still buys their products.","hp is fine as an enterprise solutionas a consumer, they can eat a bottomless pit of flaming dicks","“Under communism you won’t own anything” - capitalist","He serves on the board of directors for PayPal and is a member of the World Economic Forum’s International Business CouncilSourceWhy am I not surprised. And for those who don't know, this is the future you're looking at, when the WEF said \"You will own nothing and you will be happy\" what they mean is \"You will be too cheap to actually buy anything so everything you will have is going to be rented/leased/loaned\".","I actually need to buy a printer today. Guess I know which company I won’t be supporting.","This genius CEO convinced me to never buy HP product","\"in the future you will own nothing and you will love it\" idk about that second part.","If HP ever buys Brother it will be a sad day in the world.","Well it has to be a subscription, and they must be allowed to install really aggressive DRM too, but that is due to the hacking news also floating around, and is totally unrelated.","Yeah they suck. I will never buy HP again. Back in the 70s they made good calculators.","If you work in IT for a company or government agency, please recommend Dell for your fleet because of HP's egregious corporate behaviour.And tell your sales rep why.That's how they will listen.","Overpaid clown!","You will own nothing and be happy","Reddit loves Brother. I might go with that next. But I print very little, have used a multifunction color laser Lexmark for many years and they still update the firmware from time to time. Talk about product life.","HP doesn’t make printers, they make ink","Anyone who buys anything from hp, at this point, is just a sucker.","Brother or bust. Brother is the Toyota of printers.","HP sucks, but all printer companies pretty much suck. Brother b&w laser printers are fine (I own one) but where is the cheap color option? There isn’t one.","For the life of me I cannot remember the last time I printed something","Does it make sense to have a subscription if you actually use the ink and it’s automatically ordered when you’re running low?Gf is a teacher and prints from home a lot for work. At first i was absolutely against it, but its actually worthwhile for us at least.Still bullshit they don’t allow 3rd party ink tho.","I would never consider getting anything other than a brother laser printer, and that is what I have suggested to everyone for many years. If you want a color print, go to Kroger and pay for one","They can fuck right off","Up next, 3D printings will belong to the maker of the those printers.","Isn't printing already a subscription for 99% of its users, i.e. businesses?Nobody owns those giant copier/printer machines, they are all leased and I assume supplies are on a subscription.People actually buying a printer and ink to use at home must account for such a tiny fragment of printing done in the world.","I switched from an HP inkjet to a brother laser printer recently. I’m fairly certain I’ve almost paid for the printer in savings on ink compared to the HP.","I don't think the printer business is true competition. Printer company sells hardware at loss due to real competiton. Losses are made back on ink. Ink filler companies that don't manufacture anything, don't have any intellectual property, just recycle cartridges, sue in court that being locked out is monopoly even though they never hired an engineer to make something. Ink fillers don't make anything but money. From a consumer perspective, this might seem good but doesn't seem fair on a competition level and really hurts printer innovation due to low profits.","Can’t see why people keep giving them money with a business model like this","No.","So is it this guy or the you need to get used to not owning your games guy?","As long as there is competition this is the fastest way to bankruptcy.","Printing as a subscription huh? Will they deliver and set up my printer, will they come refill my ink when it’s out, repair it at my place when it breaks down, replace it when the printer dies? If not, then what are the benefits to their “subscription”? If I have to “buy” the printer and its components, set it up myself, troubleshoot it myself when it messes up, replace it at my own cost when it breaks, it’s no benefit. Their subscription is just to be able to use the stuff I have and paid for? It’s going to be great when they get a new CEO and try to get their customers back.","I'll happily support local libraries and use their printers. They'll make money off me for their subscription and HP has gained one subscriber, and lost out of hundreds of thousands of printer sales, and our local community library stands to gain a little business. Fuck em","Isn't it already with the fucking bullshit they do with cartridges.","If he wants us to pay a subscription for the printer, then there is no way I would buy one just to pay a fee to use it.I bought an Epson eco-tank printer 3+ years ago, have yet to add ink to it, and the ink is cheap. It also dose not take cartridges, you buy bottles of ink. And it has worked great for me so far since I bought it","Ugh. So is there a brand that is NOT going in that direction?","I literally forced my work place into dumping all HP for cannon, spent 5k on printers and close to 8k on laser cartridges. Good job HP! This is why we hate you.","\"Our goal is to reduce our stock price and have everyone hate us.\"","I signed up once for the HP printer cartridge service where they send you cartridges when you're low.I had it for about 2 years. I ran out of ink a couple of times and bought printer ink cartridges at the store.It turns out they don't send you any cartridges if you EVER put a store bought cartridge in.I checked after paying like $19.00 or something a month for two years and they had sent me only 1 cartridge the entire time i had the service. Just 1.What an incredible rip-off, I will never, ever buy another HP printer (or any other HP product.)","I will never ever buy anything HP sells","So never buying crappy HP then.","He's got no chance of landing that award, but he sure is making a valiant effort.","Gutenberg: \"And the best part is the blocks can only be moved three times, then you have to replace them! It's a self sustaining industry!!\"","Can the people who make the fairphone PLEASE make a damn printer ...I swear, electronics are getting so bad. If I was Elon wealthy, screw buying Twitter, I'm starting a company that makes bomb proof appliances where you can fix them. Parts are always available, they just work. Then I'm making super efficient and cheap housing. Anyone want to loan me about $2 billion to get going?","Way to make sure I never buy another HP product (not just printers) again.","JFC. We have enough subscription fatigue. Is it really that hard to understand we just want to own a goddamned printer?","My immediate goal is to never print anything again. PDFs all the way.","I pay 60 bucks a year with my HP Officejet printer. I can print 100 pages a month. Most of the time they are full 8.5x11 photo pages.Hands down the cheapest way to print. They send me full hp carts in the mail.People are dumb when they think they can save money doing it their own way. When there is a clear choice right in front of you.Xerox has been doing this for decades and businesses do it today on a managed printer.HP is just been doing this for residential companies for about 10 years now.","Why the fuck should we pay for things we own. This should be illegal and they need to pass laws on this","Thank you capitalism for a market where consumers get to chose what succeeds and what fails via their wallet.Thank you capitalism for the mechanism to hold shitty business accountable or put them out of business for not serving their customers… where we don’t have to wait for corrupt, slow, incompetent politicians to attempt to legislate morality. (Where the legislation really just protects the shitty businesses who can afford the red tape.)Thank you capitalism for enabling the flow of resources to companies that serve their customers and earn the reward of profits, which I turn create better services or products.Thank you capitalism for enabling new companies or ventures to start up when there is a demand not getting met in the current market.","I bought an HP printer a year ago, spent a frustrating hour trying to set it up, and returned it for a Canon that has given me no problems. Fuck HP.","Prime example of late stage capitalism here.HP should be boycotted to send a message to all the other rich jerkoffs in the ruling class.","I have no sympathy for anyone stupid enough to buy an inkjet printer in 2024. HP has been finding new ways to make printing more expensive for decades. Only an idiot is buying from HP now.","Why print when I can just take a Polaroid of my screen?","HP Enterprises or HP Inc?","I knew it, I've told my siblings and my co-workers that we are heading to a world where everything is a subscription, need to brush your teeth, don't forget to pay your subscription!Nobody believes me.","Stop printing","Works for Microsoft","Who in the hell is printing anything in 2024?","Who fucking prints anything in 2024? Get with the times, stop printing and let HP die.","Do peple still print? What is everyone printing anyway?","I’ll just continue paying like $0.11 per page to print at FedEx Kinkos when I need to.","That's why people will start black listing you as a company. I want to quickly print something. I dont want to reinvent the wheel!!! And I want to cost me cheap. otherwise, i would have gone to a printing center, i would have not invested my money on a new ugly machine","well if i was an entrepeneur with money, I'd look into making my own printer company right now.","Thats brave considering you don't need hard copies very much these days. I hardly ever need my printer and if I ever have to buy a new one- it won't be an HP.","I don't want a printer anyway but at least the decision for which one to get just got easier","Oh Brother!","Printers are commodities now. If they think consumers won’t just switch companies they are nuts. Then again many consumers are stupid.","Screw you HP","We really need an open hardware no bullshit printer with a trivial web frontend to print images and pdfs. This would be enough for a lot of people and forcing company like HP to stop their bullshit.","Had an HP Deskjet 7000 series that was nothing but problems. Wouldn’t connect even with a cable, wouldn’t print, would print but came out blurry, would print but a single page of text took two minutes, etc.Traded it for a Brother DCP-L2510D b&w no frills printer whose toner cartridge is good for 2-3000 pages. It spits pages out like they’re on fire, sharp and clean, prints when I ask it too, zero problems.Best decision I’ve made as a writer-director and general human about town. One bit of advice if you want one, the toner goes into a (borderline hidden) compartment in the front. Took me ages to figure it out because the damn thing is so cleanly designed.",""],"points":2783},{"text":["Framework Laptop 16 review: the Franken-notebook","Worst product ever"],"points":71},{"text":["Minimalist smartphone with physical keyboard promises four days of battery life | Imagine a BlackBerry with an E-Ink display","Aside from a couple of device renders, a Black Mirror-style trailer, and a landing page with the option to join a waiting list, there's nothing else to go on.I’d be surprised if this ever sees the light of day.","Starting a tech company in 2024: Make a single mockup of a product. Purchase a bunch of stock footage of people using phones and make an amateur announcement video. Profit? That's literally all this is.","Yeah this definitely isn't real. The entire trailer video is stock footage of other phones, all the images on their website are of a single mock-up (no extra menus screens camera angles of the device). If that was actually how the device looked, then the keyboard looks like it would be a capacitive touch slab, entirely defeating the purpose. I would be surprised if this went any further than them selling the personal info on the \"waitlist\" and moving on","Weirdly enough this would not be very hard to build. Most of the tech is off the shelf. By eliminating a big glowy screen and the horsepower to run it, the battery should last for ages. The key is it is not trying to be better, faster, or anything more than an iPhone which is pretty much impossible for any small startup. If the phone is meant to be minimalistic, then cheap and easy will generally rule the design process.The iphone CPU uses about 7w of power going full tilt, and 2-3w when doing anything interesting; far less when it is in your pocket.The 4G or whatever wireless and bluetooth can be kept fairly low power most of the time. The eInk is nearly power free most of the time.If you picked a fairly powerful microprocessor like the STM32H5 series it would use roughly 100th of the power. It would be able to run basic mapping, etc, texting, music, phone, etc. No web browser. If you wanted one with a web browser, the power requirements would jump to around 1/10th of an iphone. It would even be possible to do some cool designs where most features are run by a small processor, and a bigger one kicked in for the harder things like crappy web browsing.The cost of the various parts should easily stay under $100. At volume, this might cost less than $50 to build.I would argue the hardest part in building it would be getting a design which is both usable and distinctive enough that other people ask, \"Cool, what's that?\"The time for the first working prototype which can send a text and make a call should be less than a week. The time to make a portable one which is mostly useful should be under a month. And then nailing a design which can be manufactured should be another 2 months.The beauty is once the first prototype is done, software dev can begin full steam.After that, iterate iterate iterate.Then, marketing would be the fun part.I suspect this company just skipped to the marketing part.","I just want phones with actual keyboards back, and not the Blackberry-style ones but larger slide-out keyboards.I know I'm in the minority on this, but the MyTouch 4G Slide was the perfect phone for me.I always have issues typing on on-screen keyboards, which I never had a problem with using QWERTY phones.The QWERTY phones are also really nice to use for emulators with a real keyboard.","Just give me back my blackberry please.","Make this fold in half, let’s go full circle backward 🫡","That's below mid, on a hypothetical product. How is that even news?","I had an old candy bar style Motorola with an E-Ink display back in highschool. The F3, I believe. That thing was so cool 😎","They already have e-ink smartphones. HiSense makes great ones. What's so special about this phone?","The article isn't worth reading, there's not much info so the author just shits on the concept because they personally don't like it.I would absolutely love a ~4-5\" screen (one handable) android phone with an E-Ink display. Make it a reliable tool for my life.","„Between the trailer and the landing page, I counted no fewer than five different spelling variants of the brand name including Minimal, Mnml, Miniimal, Minml, and Miniml. Perhaps it boils down to a language barrier or low effort marketing, but something is telling me to proceed with caution.“","If you have a phone with an OLED display on dark mode and change the UI to use mostly perfect black, and only use it for SMS and calls, a smartphone will too last for four days.","\"The truth of the matter is that you don't need to go out and buy a featureless device to reduce mobile screen time. Modern smartphones have all the controls you need to lessen or even fully disable alerts and notifications from apps and services. If at any time you are feeling overwhelmed, just enable Do Not Disturb or simply put down your phone and go do something else.\"(Comment sponsored by Apple and Samsung)","E-ink is all fine and well for an e-book, but the screen refresh rate for an e-ink smartphone would you drive you nuts within the first minute of typing on it.PS - this thing looks exactly like a BlackBerry Passport. Like, identical.","If this actually comes out I may have to pickup a new tech stack and port a bunch of apps to it. I’ve been dying for an OK phone with good battery and a keyboard.","I loved my Blackberry. I'd kill for a smartphone with a physical keyboard.","Jesus fuck stop with the e-ink idea. Put a larger battery if there’s reduced features already.","Only 4 days, my iPhone does more than that","I'm still waiting on someone to release a maximalist phone","Is there a large enough market to support this?","Psh, next you're gonna tell it flips open and shut","Dnd","Legitimately shocked it only gets 4 days.","looks uncomfortable, if you're going to fit a niche make sure you're using actual buttons and not half assing it with a weird screen size, we like flat stuff to fit in our pockets but not when we have to press buttons on it, nor is it minimalist to make it almost square, you need only half the size of that screen, what would work better is to have the keyboard on the long side, text wraps however you want it after all and then you can hold it like you hold a gameboy advance, comfortable in landscape mode.","ok but that looks to be a shitty keyboard. blackberries had great keyboards.","This one actually got it right by including Uber. That was always my drawback with any of the other minimal phones, I can’t realistically go out at night with one if I can’t call an Uber to get back home. And if I’m not using a minimal phone when I’m out, what purpose do I have with one? At home I have access to every distraction imaginable so it’s pointless to use it there.","The ad looks like it was made with midjourney.","iPhones were huge upgrade from Blackberry- couldn’t clean keypad and chunky funky design.","Yeah, I haven't seen another vaporvare render inspired from actual products that was eventually displaced by the industry's love for gigantic animated buttons on touch-screens, marginally reduced build-cost, and half a day battery-life thanks to \"performance tweaking\" no one needs -- for at least, let me check my watch, 12 hours.So it was about time.","I get two with a normal screen. Nah thanks.","I mean I had 4-6 days battery life on my old Xiamoi phone, so E-Ink only lasting 4 days is kind of poor."],"points":1102},{"text":["I made a puzzle game where YOU design a puzzle and AI solves it. It turned out incredibly deep, challenging and fun! Check it out!"],"points":0}]