[{"text":["Post-apocalyptic dream ride made real in the striking Akira electric moto"],"points":0},{"text":["HP cites threat of viruses from non-HP printer cartridges to justify blocking their use, experts sceptical","The REAL question here is \"why are your ink cartridges sucepitble to viruses whereas every other printer out there isn't\". Seems pretty damn easy to fix, it's not like the cartridges should be doing too much heavy lifting within the firmware. They hold the ink, and receive power to dispense it, they don't NEED to be carrying tons of memory for your DRM nonsense purposes, nor do they need to allow reading that..","You don't need to be an expert for this one.","​<image>","I will probably throw some sort of mini celebration when HP finally die.","Other printer manufacturers must absolutely love HP going above and beyond to be as scummy as possible so their own shenanigans look almost quaint and benign by comparison.","Reset the printer and load original software and disconnect internet updates and the printer can use third party cartridges without a hiccup.","He cited a threat that he himself raised years ago.","“I just need you to tell me that viruses COULD come from non-HP cartridges.”“Sir, that’s not a likely—““Just say the word ‘virus’.“Virus.”“Great, we’ll take it from here.”","HP is flailing as they're failing.","Gunna need an N95 mask due to the overwhelming stench of bullshit","","If theres an interface between the printer and cartridge to allow for a virus payload to be injected, thats concerning to begin with, cuz what data could possibly be communicated between them other than \"ink low\" warnings ?Furthermore, What exactly would a virus do inside a printer ? Log the data you print and send it to chinese servers ? Print malicious stuff to waste your ink ?","People still use printers?","You need to be brain-dead to believe this one.","That's just begging for a black flag op by HP"],"points":81},{"text":["Intel's Arrow Lake-S desktop CPUs could ditch Hyper-Threading after more than two decades","It's the Apple strategy: If you have no new features remove them and reintroduce them later again as a feature."],"points":1},{"text":["HP CEO says customers who don't use the company's supplies are \"bad investments\"","Just like the printers they make...","I actively avoid selling HP whenever I can aside from laptops. Shitty company showing off how “eco friendly” they are but why tf do they send every set of ink in plastic bags just for me to take the ink out and throw out the bag. Fuck subscription ink. Brother is no hassle and just works and Epson did well with their ecotanks and thats why their printers are almost always out of stock at my store","Maybe it would be a good investment if... THE BLOODY SCANNER WORKS WITHOUT INK!","Look at that, a shit company has a shit take on how customers work.","HP CEO is a textbook case of how delusional one becomes if they spend every minute of every day huffing their own farts.","Yeah well HP products are terrible investments","Luckily I threw my last HP printer away around 1997, since then I have used Epson and Canon printers, all of them dying sooner than later. Since 5 years only using Brother laser printers and no issues whatsoever.","\"our long-term objective is to make printing a subscription.\" - HP's CEONope. Not playing that game.","When I was working for commissions at a computer store 20 years ago, if folks came in for ink I’d sell them a new printer. It was roughly the same price as a new set of cartridges (this was before they started doing starter cartridges).A strong bit of evidence to my teenaged brain that capitalism was a bad plan.","well, that would be true when the business model is to sell you a printer at a price where they need you to buy overpriced ink to offset that again","HP, more like Hateful Printer","Buying an HP printer is a bad investment","I remember when an HP CEO went on to become the vice presidential pick of Ted Cruz in 2016. What a pedigree!","Did that guy just try and revive “NO U”?","Wait, I thought I invested in the printer, I had it backwards?"],"points":207},{"text":["Vibrating belt that treats low bone density gets FDA approval","A vibrating belt targeted at woman of a certain age? The jokes practically write themselves.","From the studyThis double-blinded, randomized controlled trial enrolled postmenopausal women with low bone mass who were not taking bone-active medications. Women had a bone density DXA and assessment of thyroid function to screen for eligibility Those who qualified were randomized to receive Osteoboost treatment 5x/week for 12 months with the belt in either the active or sham setting. The sham device created a sound but did not deliver vibration.How is this really a double blind study? Wouldn't people be able to tell that the device wasn't vibrating rather than just creating a sound? Doesn't mention how they controlled for things like how much activity the participants were getting. Seems like something worth mentioning since things like exercise can have a huge effect on bone loss.","Never been so excited for grandma to get a vibrator.","this is the same mechanism was to why cats pur and have higher bone density?","My dad had one that he wore around his neck for neck surgery recovery.Worked better than the old timer “drink milk” foolishness.","I remember seeing one of these types of belts advertised to “jiggle fat away”","I was given one of these to use for several months after my second spine fusion. I do think it helped speed up signs of bone growth-fusion. I didn’t have one of these after my first fusion and even after 1 year there wasn’t much fusing going on but this time X-rays showed results much more quickly.","If it makes old ladies less grumpy then I am all for it.","I think it should be strapped at the front ಠᴗಠ","Can’t wait for the South Park episode for this!","have we gone full circle from the 60 belts? you know Those things?","They’re wearing it wrong","it’s set to wombo","I'd rather have a cat.","So it's basically a \"cat purr generator\"? I thought of that, but it was not as clunky.","Just like a cat. This would likely help improve other health as well.","Bone twerking","gat DAMN these electric sex pants","There’s a whole episode of mad men about this","That women was born to model this product","After watching that documentary not sure I trust any sort of gadget getting approved.","Why not just put a bunch of very content cats on the patient? Go fancy and offer bathtubs full of cats to float in? Nature already provides everything we need.","That’s weird. Low bone density is due to a lack of activity. Young and old. The best way to increase bone density is doing some resistance training. Lifting some weights or using your body weight.","Oh yeah, it definitely treats “low-bone” density","Not again","That’s not the only thing it treats…","Why did I read this as “vibrating butt plug” and not question it? And why did I immediately think that maybe my vibrating butt plug might negate my family’s history of bone density. And that I might have a better health outcome in that regard relative to my arthritic grandmother who has likely never used or owned a vibrating butt plug?ETA: I’m relieved this isn’t a vibrating butt plug. It will be much more usable and will able able to reach a wider market","<image>","Vibration is not the mechanism by which bones cells are signaled to lay down minerals which would increase bone density. This is bullshit which will pray on lazy people not willing or, admittedly, physically able to do the actual restive training that is known to improve bone density.The FDA is a joke. This is 100% a money grab.","$800? C’mon.","[deleted]","Lady has no backbone","Can I get a vibrator for my big bone?","Weren't these things sold as a weightloss solution?","Is this real, or a Fox News 3am product.","Relax-a-Cizor","This is a Dead Like Me episode","like the Niagara vibrators","Shake weight vibes","Just take some Deca","My only regret is that I have boneitis","Did the study account for cat owners vs non cat owners?","This is cool, I use a vibration platform for general well being and lymph node drainage, I guess it’s good to hear it might be impacting my bone density in a positive way. I believe these were organically inverted for to keep astronauts from losing bone density in space. So it makes sense.","The shake and bake","I already have a vibrating bed. So I wonder if it works the same way?"],"points":855}]