[{"text":["The latest AI gadget frenzy wants to do away with phones","Wow this is possibly the worst news website I've seen, immediately asked me to pay to view, a few popups, and darkens the screen to ask about cookies. Wonderful.","I don't think modern phones are getting replaced with this ever. There is demand for this sort of simplicity but I doubt a majority want this. It's way too simplified and walking around using a GPT walkie-talkie gets old very very quickly. Most people want a computer in their pocket but just as the article says on this, modern phone does literally exactly what this device is capable of. It's only selling point is it strips 90% of your functionality in return for a simplistic experience that's voice-centered, which even a modern smartwatch can do much better if you want that simplicity","Why is this rabbit AI constantly posted about an everyone says the same thing, that it's worse than a smartphone in every way.This is clearly an army of bots or something posting this app. I see it every day in my feed in a different sub.Anything about this should be banned.","I watched this be presented at CES. It's cool for what it is.But everything it does can be replaced by an app on your phone.,🤷I do not see it succeding","Oh cool, 5% of the functionality of a smart phone in a similar form factor to a PlayDate. This shit will be DoA. Typical tech bro investment scam bullshit."],"points":19},{"text":["Don't let your GPU gather dust. Start Chopping on Salad and earn up to $180 in rewards each month."],"points":0},{"text":["Apple will avoid ban by selling latest Apple Watches without blood oxygen feature","So will that dramatically inflate the prices of the ones sold prior to the ban with an active blood oxygen feature?","this is a weird one. why would anyone buy it now (unless they slash some $$$ of the price)? I was considering upgrading but now I'll just wait (or buy it in another country)","america only perhaps? apple australia still advertising watches with blood oxygen feature","That is the feature that made me get the AWU.I got tired of charging my Oura every 2-3 days. I get 4-6 with an AWU.","Do they have to buy back any products retailers have bought and (I assume) also can’t sell?","I mean, what are the chances of another respiratory virus going around","Better headline, apple steals and finds a way to circumvent the law, again","Will they actually remove the sensor that measures blood oxygen or just remove the feature from the software?","I ditched the Apple Watch a few years back. The battery life was one of the main drivers. Charging every day or so was kind of annoying. Now I love my Gamrin.","Hopefully other patents are challenged, and this thing gets banned outright.","I’d rather they shit percentage points and chew aluminum. But this is a temporary solution for suckers who won’t buy the device for biofeedback.","I don't get why Is it so hard for people to gave a BP, BS, and an oxymeter at home.I can understand if you have a condition, but otherwise? C'mon.","Nobody uses this feature anyway nobody cares","I swear I've seen this story posted on every subreddit in Reddit at least twice.","For discounted price, right? Right? /s"],"points":253},{"text":["Apple Watches with blood oxygen tech are banned again.","You don’t become a 3 trillion dollar company without breaking the law, getting away with it, and then monopolizing on that. In this exceptionally rare instance, the now Goliath has temporarily lost. Sent from my iPhone","I can’t remember is this the case of patent trolls or a legitimate breach of IP?","So if my wife has an Apple Watch (series 7) with this feature already on it, will it get disabled next update they push out ? Or will it just apply to all NEW Apple Watches getting released moving forward? And if it’s the former and you decide to not update the watch, will you be able to keep the feature ?","Another perspective: I worked for a leading maker of pulse oximeters. Everything we did was subject to FDA scrutiny; that was the easy part. Avoiding frivolous lawsuits from Masimo was more difficult. Masimo used litigation and threats of litigation to intimidate its competitors long before it made a claim against Apple.","What watch face is that? I kinda like it","Glad I got my 9 a couple weeks ago. The finger gesture they added is so handy.","I feel like there needs to be serious consequences for this. Not \"you owe this company 250 million dollars, don't do it again\" consequences, but more like \"you owe this company 250 million dollars, also pay 500 billion in fines, hopefully you learn your lesson.\"How many cases of corporate misconduct do we read about where the punishment is so small it's basically ignorable? Apple is a giant company, they tried to use that to bully a smaller company. The same way they tried to pick on someone a fraction of their size, they need to be picked on.Actions like this can absolutely sink a company. Apple needs to lose so much money it puts them at risk of going out of business, because that's what they were willing to do to someone else.","Wish I had a dollar for every time I read this","I mean sure they hired away Masimo engineers to make their own, but they also hired away Intel designers to make their M chip so it’s just par for the course?","Who the hell do these guys think they are, John Bloodoxtech (inventor of blood oxygen technology)?","","Can't we just ban crapple?","Someone tell me whose life is getting better because Apple had to make a worse watch?","It’s really ridiculous, you can get a meter starting at $10","What’s the point of the extra side sticking out where the dial is at?? The old watches look must sleeker","Well, to be honest, it was like the jankiest feature that barely worked","Apple Watch Users Try Not to Take an L CHALLENGE (Impossible)","Because it doesn’t work properly. Fix it, Apple.","But it’s innovative af? Why let people suffer","Publicity stunt? At this point it has to be... More exposure than any legitimate advertising they could've done.","Masimo is playing with fire here. There’s always a huge risk when engaging in high-stakes patent litigation with someone who has the kind of legal horsepower that Apple does - the nuclear option of a defense motion to find the patent invalid is always looming. Only after trying that approach will they even consider licensing or acquiring the patent.","Can someone explain why? I haven’t looked into it and at this point idk where to look","Title should read 'Apple disables feature on watch rather than pay patent holder'.It's not banned at all, it's just not their tech."],"points":758},{"text":["Exynos 2400: Samsung confirms deca-core CPU and FSR support for Xclipse 940","We want a LARGE battery, a large lens for high clarity, physical buttons with touch fingerprint sensor and a jackphone port and make this waterproof.It is so easy Samsung. So easy. But you always fuck up the last mile."],"points":1},{"text":["The next iOS update will make it harder to break into your iPhone.","Great update, people in the comments don't realize this is meant to prevent social engineering attacks, it's not supposed to be some massive anti zero day inicative.This is more like, if your S/O has your password and takes your phones, they can't access your credit cards without your permission.","Terrible title. Great feature.Basically they delay you from changing settings e.g. disable FaceID if you're not at home/work.Which should help prevent a lot of phone thefts.","For anyone wondering why this is being addressed, this WSJ podcast does a great story on the vulnerability and how it was exploited.","This is good.","Correct title: The next iOS update will make it harder to break into your Apple ID account.","Yeah yeah.. same headline different update.","Apple shouldn't use a passcode to unlock everything of an iphone at first. Such low secured encryption key should only be used to unlock the screen.","Apple needs to make a feature that would require a passcode to turn off the phone. Most of the time thieves would steal a phone and turn it off to prevent tracking and send it off to China to be stripped.","Yet another thing to be aware of when you inherit a deceased person's phone.","I don’t want to break into my phone. If it’s preventing others then fuck yeah.","Great but why is it every day I'm getting a message from halfway around the world someone's trying to login into my apple ID?","Seems like a separate password for iCloud would have been a lot more flexible of an option, but where's the vendor lock-in for hardware repair in that?","Will my 6s be included?","Zero day for that shit incoming.","My problem with this is that FaceID isn't 100% accurate. It sometimes fails to unlock.","The formidable Press 1 to Continue","I'm optimistic, but it is Apple.","Even better chance for the device to endup at a landfil.","Harder for who ?","And then the next update and another and ok cloud svc","Again","Would have thought every OS update for our everyday devices should be continously making it harder. No need for headline or post.","I just want split screen for my iPhone. Maybe landscape too so I don’t have to keep flipping my phones orientation when docked","But does that mean the thieves will hijack you and bring about your home to break into your phone?","Shouldn’t all the updates make it harder to break into your phone","How about they fix the “allow paste” option when copy and pasting an address into google maps","Well yeah, that’s like half the reason why updates exist.","Shocker.","Will eventually be featured on /r/agedlikemilk","Cool, cool, let's just take away PIN forever. In fact, let's just make the phone unlock when you're within two meters of it. Nothing will ever go wrong with that.","That's not the point of updates? Make it secure?","Will it fix my broken predictive text?","It will probably just kill the battery","And easier for app developers to hack your data.","This will only add $250 to the price of next year's phone","For a week","Doesn't it actually become harder to break into iOS every update? I think it's kinda normal?Except all of these are an issue when repairability is at stake - it gets harder and harder to replace components, because they're battling both the unauthorized service centers - and stealing the phones \"for parts\".","I don’t give a shit, Just fix wireless charging on the 15pro please","your iPhoneI have Galaxy S22 ultra","This is a great update.","isn't this after that guy made people casually give him their passwords and he would \"break\" into the iPhone and change the passwords?Jesus what a title. I thought this was about jailbreaking."],"points":1058},{"text":["iPhone 16 Could Switch To QLC (Quad Level Cell) NAND Flash For Higher Storage Models, But At The Cost Of Lower Write Endurance, Other Drawbacks","Anyone who manages to use up his QLC NANDs Write Endurance on an iPhone for this to actually become an issue I both tip my hat and point my finger at laughingly.","Internal Apple meeting: “this technology comes with two significant benefits: it increases capacity of storage and makes the phones die faster.”","Hmm yes... I know some of these words...","I'll preface this by saying QLC gets a bad rap, it's improved a ton and capable enough for a phone, but with how much they charge for flash (like $1 a gig) switching to QLC to save $0.01 on that gig is an insult.Where it's going to be rough is when your phone is near full and your phone is consuming tons of time and cycles defragging the storage with the slower QLC writes.","Nothing about the cost will be lower when it comes to iPhone storage.","Why? Apple asks a higher premium for higher storage variants and they are still greedy?","I would be extremely mad if they use cheaper part without lowering the price.","Using cheaper storage while increasing prices seems to be pointless.","Damn it will be hilarious if they still maintain their overpricing of storage even after switching from TLC to QLC 🤡","QLC is such thrash haha apple stupid.Meanwhile My intel 600P from 2015 in my 24/7 torrent pc is still up and running.Please tell me more about your 9 years old phones that you still use everyday","Where is this QLC not lasting long coming from? Article writer needs to go back to tech school.","Keep in mind that, as well as a reduction in endurance, QLC can be significantly slower as well.True Apple innovation.","Disposable, just like they want their products to be.","The average consumer doesn’t care about this. These small ‘enhancements’ are tiresome. No one at Apple has the balls or vision to overhaul the landscape of the iPhone, which is what it needs. What initially made iPhone so revolutionary was because Steve Jobs wasn’t afraid to make big scale changes. He wasn’t afraid to wipe the slate clean and start over, no matter how much work was involved up to that point. He was innovative.No one at Apple is a big enough visionary, brave enough, or has the clout to make sweeping changes to Steve Jobs’ last vision. There is a huge fear to take it to the next level because nobody wants to be responsible for tanking the iPhone brand.","iphone fuckin sucks. even at basic shit now like battery life.","Article by Microsoft comments by Apple","Love the outrage by folks who are falling for a rumor from a phone that's 8 months away from even being announced. Highly doubtful rumor and yet, it'll do what it intended to do, drive website clicks and ad revenue.","I realize that QLC is inferior to TLC but this is a use case where I can't see it becoming an issue. People don't fill and empty their phones very frequently and the slow long term writing speed shouldn't affect any operation of a phone really. The really disgusting bit is that this is only a move to improve their margins though, so fuck Apple for that.","Why do people need so much storage when there’s iCloud?Edit: wow! This really struck a nerve. 😂","What does this mean?","These sorta problems are really for people who can afford to just get a new device whenever they need it.This really won't cause any consumer harm so long as the controller for the storage medium is even marginally effective.","How about adding SD card slot like normal phones do?"],"points":694},{"text":["Many failed before. Will YOU complete the trial?","A black hole is a region of spacetime where gravity is so strong that nothing, including light and other electromagnetic waves, has enough energy to escape it.[2] The theory of general relativity predicts that a sufficiently compact mass can deform spacetime to form a black hole.[3][4] The boundary of no escape is called the event horizon. Although it has a great effect on the fate and circumstances of an object crossing it, it has no locally detectable features according to general relativity.[5] In many ways, a black hole acts like an ideal black body, as it reflects no light.[6][7] Moreover, quantum field theory in curved spacetime predicts that event horizons emit Hawking radiation, with the same spectrum as a black body of a temperature inversely proportional to its mass. This temperature is of the order of billionths of a kelvin for stellar black holes, making it essentially impossible to observe directly.","All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....","Wait, you actually opened the comments? Are you stupid?","The world would be such a better place without you people in it.","this you?","nice","son ellos","with many on the title this is a juicy clickbait .","who is upvoting this why","Wasn't expecting comments on this","Techbible is your go-to tech community. Ask questions and get expert answers on all things SaaS. Stay updated on the latest tech news, discover trending tools, and share your tech stack with the world. Don't Forget to try it out.https://techbible.ai/","wow"],"points":5}]