[{"text":["How to kill a process running on a local port in Windows"],"points":0},{"text":["Fixing Horizon bugs would have been too costly, Post Office inquiry told"],"points":0},{"text":["Identifying Rust’s collect::<Vec>() memory leak footgun","This is not a memory leak.Dynamic structures should not be using 200x memory though. It would be at most 4x memory worst case assuming you shrink at 25%.","Am I dumb or is this not a memory leak? Wouldn't it be more closely related to space leaks?","That’s not a leak. That’s the standard behavior of dynamic arrays in almost any language.","Down voted for click bait title. There’s no leak here, even if there is some underlying sub-optimal situation with the complete program.","I’m able to see no memory leak there.","Nice investigation but a debugger and a memory profiler are better tools for this kind of work.","This seems more like \"not writing loops\" footgun.Just write the loop and the allocation is very transparent.It would have been very clear where the issue was and it would have been much more obvious how to alleviate the problem.But if you hide things behind map(), collect() you are at the mercy of however that is implemented which won't always be optimal.The cost was 18gb for 300k nodes which is insanity.Return to loops. Loop hatred has gone on for too long.Rust seems annoying though because its severely limiting your options here."],"points":7},{"text":["Smart Home – Controlling Shelly® Devices (Part 4) - Property-Manipulation with the PropertyDescriptor"],"points":0},{"text":["Learn C++ Optimization With A Genetic Algorithms Example"],"points":0},{"text":["HashSet Harmony Unleashing Java's Distinctive Elegance in Collections"],"points":0},{"text":["Hot Take: TypeScript is the Best App Language","The \"hot take\" is using only Javascript as the comparison language.IOW, the headline would be more accurate as \"Typescript is the Best App Language if your only other option is Javascript\".Hard to disagree with that.","Sure, if you insist on running on a JavaScript runtime, but there is obviously a world of options out there if you don't have that limitation.TypeScript is nice, but saying the \"best app language\" sounds like the author hasn't really used much else.","Nah. But it’s great on frontend. Although, the latest JavaScript is very close to TypeScript and doesn’t require compilation. For backend, C# with generated client-side code for js/ts gives the best of both worlds."],"points":23},{"text":["Ok, so you can code. But maintaining your git history is also part of the job. Can you?","I mean, yeah. Getting a good enough working understanding of git to maintain a clean commit should take maybe a day or two at best. There are thousands of excellent existing tutorials. Why is this something we need YADBP* about?*Yet another derivative blog post","I would love to maintain my git history, but the design of git prohibits it.For example, I saw someone's commit message from a few months ago that references the wrong issue number. Very misleading. Totally impossible to fix."],"points":1},{"text":["Type-safe native SQL directly in yer code"],"points":0},{"text":["Java Reflection Use Case - Finding Instance Methods and Class Methods","Or you could read documentation?"],"points":0},{"text":["Made a video explaining the design and compilation of my programming language"],"points":0},{"text":["SSH Tunneling for Secure Postgres Replication"],"points":0},{"text":["Presenting 'forkrun': the fastest pure-bash loop parallelizer ever written","how lucky, i was just thinking about how slow all of the currently available pure-bash loop parallelizers are.","source <(curl https://raw.githubusercontent.com/jkool702/forkrun/main/forkrun.bash)Sigh. I'm getting really fed up with people recommending this sort of thing. It's just a massive security problem waiting to happen. Download something at random from the Internet and automatically run it? No thanks."],"points":44},{"text":["Unit testing tips","This is fantastic.I don't use PHP, but since it covers topics related to testing, it was worth reading"],"points":1},{"text":["WebAuthn - A Short Introduction"],"points":0},{"text":["Distributed Data Done Right: A Golang Journey with Consistent Hashing"],"points":0},{"text":["An HTML page which is also a valid PDF file and JPEG image","These are known as \"polyglot\" files in some circles, and are a real thorn in the side for some security mechanisms that need to validate and sanitize files and their contents.","More like a \"Look how browsers and tools ignore errors in formats\" file than other thing","<img src=.>","Source: https://github.com/donno2048/HTML-PDF-JPEG","This is fantastic, opens so many possibilities!","Next level - make it render as the identical image in all formats!","AKA: A binary blob which some web browsers can be convinced to render as HTML (although it is invalid as such), a JPEG (with a valid header and ignored meta, might actually be technically valid) or a not valid PDF file, which many readers such as Skim won't render due to the junk preamble before the %PDF signature (and so online validators such as pdfen reject it).","I got inspired by this and made a polyglot which browsers consider to be valid HTML, CSS, JavaScript, and JPEG https://p.cat.ax/polyglot/index.html","According to file on Mac it is a jpeg (regardless of extension). If you try to open it without extension it opens it as a (garbled) text file. It refuses to open it as a pdf in Preview. Safari will open the pdf but show a blank page.","Nice, another exemple of this is K. Lange's resume which is both a PDF and a CDROM ISO for his hobby OS. However I doubt that they work in the same way.","looks legithttps://i.imgur.com/TDR4p2R.png","Ange Albertini, is that you?","Okay? That's easily done by just creating multiple versions of the file in the appropriate server directory.","Acrobat won't open it.",":|","I can hear the screams of anti malware software.","Reminds me of this: https://github.com/johnjohnsp1/gb-nes-pdf-html-zip"],"points":316},{"text":["Rich Hickey's glossary and decision matrix"],"points":0},{"text":["Friends Don't Let Friends Make Bad Graphs","As if I have any choice. If the designer and management want a pie chart, they're going to get a pie chart no matter what I say.","Thanks, this was helpful! I was going to use pie charts for something I've typically seen represented with pie charts, but you've convinced me that stacked bar charts instead.I assume there is nothing wrong with flipping the axis, so that the % is on the x axis? Something vertical doesn't fit the where I want to put it","Trying to be helpful with a summary:This GitHub project is a comprehensive guide that discusses various common mistakes in data visualization and provides insights into better practices. It emphasizes avoiding the use of bar plots for means separation, violin plots for small sample sizes, bidirectional color scales for unidirectional data, and the pitfalls of not reordering rows and columns in heatmaps. The project also warns against using certain types of visualizations like pie charts, concentric donuts, and misusing color scales such as red/green and rainbow scales. Additionally, it stresses the importance of considering different layouts for network graphs and the necessity of reordering stacked bar plots for clarity. The guide aims to improve data visualization by highlighting these often-overlooked aspects and providing solutions.If you don't like the summary, just downvote and I'll try to delete the comment eventually 👍","All violin plots are bad.","Check out Tufte’s books. The Visual Display of Quantitative Information is excellent and covers many ways data is manipulated improperly.","In pie charts, area does not represent data; area is incidental. Only the arc length, which is proportional to angle, matters. This is one of the numerous pitfalls of pie charts."],"points":27},{"text":["Parallels of programming and writing"],"points":0},{"text":["Five tips for the beginner programmer","Can't we just block that nonsensical medium blog spam in this subreddit?","Focus on learning the logic part of programming first. Like how loops work, why we find the modulus of something.Main difference between most programming languages is the syntax, not the logic( for basics obviously)Keep checking out the other solutions after finding the solution you've found, in order to optimize your methods.Don't be afraid to use AI to explain code snippets, meanings.Keep your learning self paced. Do not lose valuable concepts for finishing your journey early as possible.Lastly, bugs and issues will always be annoying . Don't be discouraged to learn and overcome those hurdles in your journey.Goodluck ^_^","What a shit article.If you get stuck, you need to learn more.Gee, thanks for the tip, dipshit."],"points":7},{"text":["Dart parsing RSS"],"points":0},{"text":["MySQL Stored Procedures: How and why with examples","The number one reason for SPs (and views!) is to explicitly declare and define the operations your database supports, in a way that allows you to refactor your table layout should you be required to for whatever reason - maintenance, scalability, perf, etc.)","Blog author here. This is a tutorial on how to write stored procedures in MySQL, with examples of all the major parts of the language and a discussion of use cases, such as:System maintenanceGDPR complianceData integrity checks","BEGIN...END blocks do not start transactionsBEGIN...COMMIT/ROLLBACK do work for transactions. This is an extremely important point.From MySQL docs:\"BEGIN and BEGIN WORK are supported as aliases of START TRANSACTION for initiating a transaction. START TRANSACTION is standard SQL syntax, is the recommended way to start an ad-hoc transaction, and permits modifiers that BEGIN does not.The BEGIN statement differs from the use of the BEGIN keyword that starts a BEGIN ... END compound statement. The latter does not begin a transaction. See Section 13.6.1, “BEGIN ... END Compound Statement”.\"You should always explicitly BEGIN and either, COMMIT or ROLLBACK transactions.Just look at the current scandal with Fujitsu and the UK Post Office. It looks like poor transaction handling was likely the cause.Edit: missed the important bit!","Now that you know what store procedures in mysql are here is when you should use them: never.Shout out to cursors at the end as well, something else you should never use.Just my opinion though. You guys do what you want."],"points":19},{"text":["Who actually uses is-even and is-odd?","I did a deep dive a while back and it seems like the guy who created them also created hundreds of similar packages around the same time.Typically the actual code is just a few lines that do something simple (e.g. pascalcase, is-number, falsey) and then there's tons of scaffolding like CI/CD, ESLint configs, testing, benchmarks, a detailed readme, etc. that might give the impression that it's a more substantial library at first glance.These tiny packages will often pull each other in as dependencies. He also has a few more substantial projects that pull in some of these small ones.It doesn't look like he creates packages like that anymore, although he actively maintains all the old ones. I got the impression (or maybe he actually said this somewhere, I forget) that he was trying to get into the industry in the early-mid 2010s and created this constellation of interconnected packages to get tons of NPM downloads to list on his resume.","I use Ruby a lot, and `even?` and `odd?` are methods of the Integer class (number are objects!). I have used it a lot.​I get the point from the article, but you don't really need a super safe is-even method (at least not most of the time)","I remember what a mess leftpad created. Whoever uses packages for such trivial things are introducing entropy in their code for no reason.","Writing it yourself is faster than opening the terminal, running npm install and importing the package.","Funny thing is that the additional checks “check n is positive” perform unexpected behavior imo because negative numbers also can be even or odd","If you really want a laugh https://github.com/jezen/is-thirteen","So... If it first checks that the argument is positive, that means that it gives the wrong result for negative and zero values?","Disappointed. Was waiting to see a major framework or popular package use it ...Next research/excursion should be to find out how many dependencies this major/popular things have edit and if they are \"externally\" controlled ...Edit had to get this on. From socket.dev the dependencies:Js: - React - 3 dependencies - Vue - 20 - Angular Core - 3 - Express - 60 - Async - 0 - Mocha - 54Py: - Django - 2 - requests - 0 - numpy - 0Java: - JUnit - 1 which has 0 maintainers - SLF4J logging api - 0 - Kotlin Stdlib - 0 - Scala-library - 0Go: - Logrus - 3 - aws-sdk-go - 4 all which are AWS maintained - testify - 4","https://www.npmjs.com/package/is-even has a link to the repository https://github.com/jonschlinkert/is-evenBut that user changed their name and now the repo links to https://github.com/i-voted-for-trump/is-evenSame applies to https://www.npmjs.com/package/is-odd","You don't need a package for is-even or is-odd, the most senior developer thing to do is spin up an LLM (local or cloud) and ask it if the number is even or odd.","I don't use those, I only use the quickest is-prime algorithm out there","Wannabe pros use % 2Real pros use & 1","I didn't look at the code, but I hope at least one of these is a dependency of the other.I might consider using them if we didn't already have our own is-even microservice that has 5 9s of availability!","Why use packages when determining odd or even is trivially easy using the modulo operator. There are plenty of reasons for using packages or modules in your code. This is not one of them.","I use it on projects where I feel like I need to pad-out the node_modules directory, or at least there isn't enough risk of (insert developer name here) injecting some malicious code in my dependency tree.","bool istrue(bool value) {  if (value==true) {    return true;  } else if (value==false) {    return false;  }}","I’ve written on-orbit patch scripts, orbital sequence procedures and overrides for satellites. I’ve had to hand these scripts off to test engineers, systems engineers, satellite operators, even university folk and program managers that have provisioned one of our satellites our/or ground control software.In the majority of these situations they did not have a high level understanding of coding nor the API framework used when writing these types of procedures. I’ve used these types of methods and other similar methods in both Ruby, Python and Rust (when I was writing these scripts) to communicate more clearly of what the script does.That said, I get the point that is being made in the article. Understandable and I can relate to their frustration.","Too many dependencies is a code smell, change my mind","I love the idea of introducing all that cruft to basically do (x % 1) or !(x % 1) 🤣","No games programmer should be, at the very least.It's drilled into many to use i % 2 == 1 (or an even more succinct version depending on the language) long before something like is-odd is conceived.",""],"points":1395},{"text":["PyCharm Community versus Visual Studio Code for Python development tutorial"],"points":0},{"text":["A 2024 Discussion Whether To Convert The Linux Kernel From C To Modern C++"],"points":0},{"text":["Almost all of fish shell has been rewritten in rust","Will they rename to crab-shell now?","Here's the whyhttps://github.com/fish-shell/fish-shell/blob/master/doc_internal/fish-riir-plan.md","will arrays in fish start from 0 now?","Wake me up when Make, CMake and company are gone and it's just Rust build-scripts. Honestly, that is one of the main reasons why I like Rust more, it comes with a package manager and a build system so it can all \"just work\".","Will they rewrite everything again in Zig in few years?","Sweet now I can be cool without changing my shell","This fits all my preconcepted stereotypes of both fish and rust enjoyers","[deleted]","And it’s 10,000 lines larger and still mot thread safe 😂","Who's naming these things? What are we going to be programming in in twenty years"],"points":366},{"text":["Lisp Query Notation","I'd really suggest dropping the keywords as strings idea, it's really confusing. For keys it's fine but even there I'd prefer unevaluated/uninterned symbols for the sake of clarity."],"points":1},{"text":["Bare minimum atw-style K interpreter for learning purposes"],"points":0},{"text":["How to Design an ISA","A good example showing the tension of being experienced vs. being old.Or, as a friend said: \"RiscV is the perfect ISA for the kind of CPUs we stopped building 30 years ago.\""],"points":1},{"text":["Speedbump – a TCP proxy to simulate variable network latency"],"points":0},{"text":["Htmx Is Composable?","Good read, but you really need to give the solution explanation and exploration the same detail and examples you gave the original problems. From reading the ending I still don't know what this composition with HTMX is that you mentioned. Can you give code examples of what HTMX as configuration is?","I need someone to help me out understanding htmx because it doesn't make too much sense to me.As far as I understand, hateoas was mostly a way to navigate and modify state on the server.Basically, the app was the whole website i.e. A server owned aplication.Now with htmx, if I understand, the same hypertext is used to modify state on the client in a more granular way to eschew the usage of javascript?So we prefer communicating with the server for every little change on the client even if it's not at the granularity of a page change?My hunch is that it will be tremendously wasteful for a big app but I might be wrong.Now, that being said, does it mean that I need to bui'd a specific endpoint on the server for every change that might occur on the page? For instance, if clicking a button replaces the content of a div with some server fetched html, I need a specific endpoint for that? Repeat on every page?Or is htmx somewhat clever enough? (honestly asking because I'm genuinely interested but my brain just shut down when it seemed that I'd have to remember a handful of new attributes and how they compose).Make me a believer 😄"],"points":5},{"text":["Post-mortem for last week's incident at Kagi"],"points":0},{"text":["Demystifying the use of Parquet for time series"],"points":0},{"text":["BBC BASIC raytracer in 432 characters"],"points":0},{"text":["Willow Protocol is a protocol for peer-to-peer data stores"],"points":0},{"text":["GitHub - merwin-asm/april: A programming language for making APIs"],"points":0},{"text":["Many failed before. Will YOU complete the trial?","A black hole is a region of spacetime where gravity is so strong that nothing, including light and other electromagnetic waves, has enough energy to escape it.[2] The theory of general relativity predicts that a sufficiently compact mass can deform spacetime to form a black hole.[3][4] The boundary of no escape is called the event horizon. Although it has a great effect on the fate and circumstances of an object crossing it, it has no locally detectable features according to general relativity.[5] In many ways, a black hole acts like an ideal black body, as it reflects no light.[6][7] Moreover, quantum field theory in curved spacetime predicts that event horizons emit Hawking radiation, with the same spectrum as a black body of a temperature inversely proportional to its mass. This temperature is of the order of billionths of a kelvin for stellar black holes, making it essentially impossible to observe directly.","All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....","Wait, you actually opened the comments? Are you stupid?","The world would be such a better place without you people in it.","this you?","nice","son ellos","with many on the title this is a juicy clickbait .","who is upvoting this why","Wasn't expecting comments on this","Techbible is your go-to tech community. Ask questions and get expert answers on all things SaaS. Stay updated on the latest tech news, discover trending tools, and share your tech stack with the world. Don't Forget to try it out.https://techbible.ai/","wow"],"points":5},{"text":["Do we really need a message broker?","Yes","Systems with message brokers remind me of TCP. Systems without message brokers remind me of UDP. I find the latter to be more interesting.","This is just Kafka/Kinesis but worse."],"points":9},{"text":["Z - effortlessly jump directories","What are 'frecency' and 'frecent'?","Z is a great tool.I don't actually use it often, just cd for normal navigation. But sometimes I want to come back to something after not having used it a long time, and I can't remember where it is then I think \"oh yeah, I can use z\"."],"points":2},{"text":["Is Bay Area Still the Best Place for Developers?","This data is ten years old. Why even spend the time typing up pre Covid salary/rent studies?","My company with a Bay Area HQ has frozen all hiring in Bay Area because of high salary costs. Moving all North American hiring to other locations and expanding international hiring.","This is a weird mindset of accepting major cost and risk of every part of your life for a vague possibility of reward later. I’d need to be well over 2x my current paycheck (probably more like 3x) to sustain my standard of living in the Bay Area. The adjustment between my salary where I live and the bay is more like 15-30% at most companies.This is a type of pitch I’ve seen from lots of startups. “We’ll pay you less than you’re worth, but if you get lucky, you can have some juicy breadcrumbs after the investors get theirs”.I think a lot of people in their 30s just see behind the curtain, do the math, and leave. A few are paid well enough that it works out to stay, many (like myself) are not.I also think most startups are very remote friendly, so as programmers, living in the bay isn’t going to open up all these major opportunities, really. So it makes even less sense now.","Anywhere with internet and your computer is the best place for developers.The bay area is best if you want to spend 70% of your earnings trying to find a home to keep yourself, internet and computer.","Never has been. It's not what you earn, but what you keep.","Also stop posting this, this was literally posted yesterday","I did the Bay area thing for 5 years after college (this was about 12 years ago). I'm not even sure it was the best place back then depending on what you are looking for.Unless there is a specific company you are looking to work for and they only have opportunities there, the answer is probably no. But you have to figure out what is important to you (cost of living, lifestyle, population density, etc) to really answer your question. But you can absolutely find great development jobs everywhere, particularly if you work remotely.","The bay area has NEVER been the best place for developers. If the developer is a member of the lemming family then they might follow the flock, however software developers are needed and employed all over the country. The best place for a developer depends more upon the developer as an individual as they might prefer the mountains of PA , the wonderful life that TN provides or maybe the open spaces of Montana."],"points":97},{"text":["DevTools Podcast: Rethinking Open Source Security Beyond Buzzwords"],"points":0},{"text":["Why don’t schools teach debugging, or, more fundamentally, fundamentals?","It depends on the education I suppose. Every school I went to had some amount of debugging in various classes in the curriculum, and my current university (Oregon State) heavily emphasizes this in each course.","Speaking for Germany, those who are good programming teachers teach adults for several times the money they could earn teaching high school students.","Mine certainly did. Very first programming course used eclipse and showed us how to set breakpoints, step in/over/out, and so on. Is that not standard? I went to a state school, not anything special or unusual","I feel like most people went over debugging, they just don't remember or didn't pay attention enough in their CS 1 or 2 courses.","most comp sci classes are just math classes wearing a disguise.","At this point I stopped reading:In most K – 12 public schools, after one to three years most teachers can’t effectively be fired, due to union rules, so the incentive to be good, let alone great, is weak.It’s a myth that you can fire your way to having a bunch of great teachers. Fact is great teachers quit every year. They are also not easy to come by. Just look at the ratios. Great teaching has nothing to do with incentives. Great anything has nothing to do with incentives. Great anything is a matter of principle. It is the desire to pursue mastery.Debugging as a skill requires more that “we learned eclipse” or “I can set a break point“ or “I can set conditional break points“ or whatever else people in this thread mentioned.To say debugging is about using the features of a particular debugger, is like saying my skills with MS Word make me an author.No. Those skills with MS Word also don’t make me an editor. What makes me an editor is my ability to recognize what is helpful feedback and what is not. That’s teaching.Most people are not able to do that. Most people will latch onto grammar and spelling when they try to edit. If you ever tried to teach writing, you know that doesn’t matter or that such feedback doesn’t educate. Great writing isn’t achieved by being grammatically correct or demonstrating your spelling skills.Teaching is hard. Understand that much, and maybe you have a chance of understanding the whole of the situation.Probably, students could be taught how to debug software, but there is more to the skill than being able to set conditional breakpoints and run some debugger compatible code to experiment with possible solutions to the problem.Knowing the details of a debugger just gets you started with what’s possible. Debugging is another skill. It’s like knowing how to drill, saw, and glue wood. Doesn’t make you a carpenter.","Debugging at its core is just problem solving - or investigating.I don't know what the school could teach you in specific that would grant you any merit, except for general problem solving and investigating; which I mean, they do.The danger they run in teaching you such a specialized perspective such as debugging tools, is that those tools may very well have become obsolete by the time you enter the workforce. If they teach you problem solving, then the lesson you would've taken away would have been more successful and widely applicable than a specific subset of tooling!Hope this helped.EDIT: If you're saying not in grade school, but undergraduate - I'd be shocked that they wouldn't have taught you to debug your code in addition to writing it in a programming course. Since, you would've needed to debug as a part of writing a working solution.","Are we talking \"click here to set a breakpoint\", or are we talking \"meticulously analyzing your mental model of a system and finding where it diverges from reality\"?Because the first one takes half a lecture in CS200, and the second one is an intuitive process built from years of experience. I'm not sure how you'd build a full class out of either of those.","I was taught debugging in my intro. to object oriented programming course; however, I will point out that most colleges offer \"computer science\" degrees, not programming degrees. They are very different. Coming up with new algorithms and computer architectures is very different than making software.The article is not about debugging, though, it is about not teaching fundamentals before moving on to material that requires it. E.g. not teaching editing, but teaching writing, or not teaching algebra when teaching engineering. I am not sure I agree with the premise of the article as I did learn those things in school, just not in university. A better statement would be that universities should review fundamentals, such as rules for using a comma or algebra, before moving on to more difficult subjects. Which I sort of agree with, however, I recognize that given the limited time that universities have to cover a curriculum and the fact that college students can and should be expected to review things on their own, I don't think it makes sense to have it as part of a core curriculum. Perhaps, they can have a list of review text books or chapters to go over before a section is started.","Because compsci is not programming","Because they fundamentally don't understand it.They don't need to.The product they are churning out are students, not functional code.","I remember being shown a debugger, but getting good at it requires experience and practice. Even now I don't find it as useful as other techniques.","Because university isn't job training.","Yeah I get why an engineering prof would be frustrated by a student's request that why spend class time reviewing algebra.","University is supposed to be about you teaching yourself how to learn things with the lectures and labs just being a guide. If you practice and research on your own you will discover how to do these things.","They do.. maybe go to college and not boot camp","schools dont teach a lot of things. they just expect to have all the skills beforehand.when i had written my code, the teacher didnt care to look at it . Told me to go through her method and \"learn\" it when my method just missed like 1 line of code which I found out like 10min later :P","It's disheartening that fundamental teaching is lacking in some institutions. I remember feeling lost and unsupported when I first started learning to code. Maybe if we shared our own strategies and resources, we could help future learners.","Most of my classes were done on the terminal. Some professors actually made us print the code on paper for grading. Garbage curriculum with a couple of banger courses.","Decades ago, universities separated computer science from programming. It’s insane to think about now, but they told us that we were algorithm creators who would solve hard logic problems and then hand it off to some code monkey to get it working.In essence there is some truth to this, but the creator is also the code monkey. Most complex apps I’ve worked on have the fundamental secret sauce that does the useful work that is the core of the program, but that is useless until people can actually leverage it.Of course, there are hard computer science / math problems that are theoretical and people spend their lives working on these problems, but the overwhelming majority of programmers are basically doing CRUD apps with some business specific processing and enforced rules.","WTF does that image have to do with this post?","I’ve seen a lot of interns come and go. Computer science doesn’t seem to teach anything practical. If those students don’t get internships before they graduate I don’t think they have a chance of having any real world skills like debugging and we don’t hire graduates who didn’t have internships. It’s the internship which means they’ll have some idea what they are doing. I’d rather hire a technical school winter graduate than computer science graduates.","Perhaps best illustrated by analogy with another profession. In the UK, acting is taught as a university course, and most working actors learnt that way, with the main exception being those who started as child actors.In the US, it is more of a trade, which you get at most a 2-3 month vocational course, and then just learn on the job. Hence:https://youtu.be/S2\\_oXZKr\\_J8However, this actually happens at dedicated institutions, not general purpose universities. For example:https://www.rwcmd.ac.uk/department/drama/actingThese actually want to teach people how to act, and are proud when they succeed. They don't wish they were instead investigating the psychology of mimicry.Neither country has anything like that for programming. One day, perhaps even before programming becomes obsolete, some country will create such institutions, and all the tech companies will move there.","A lot of schools/learning institutions follow a purely outcome based curriculum.So things like debugging that typically happens as part of the process often get forgotten or in some cases even ignored.","I went to UC Berkeley for CS. None of the courses taught debugging but all of our projects required creating unit tests and were so difficult that you needed to “learn” debugging on your own.I really wish they taught us how to debug.","Debugging is mostly “Can you determine which half of the code has the problem in? Repeat until found.”","via hacker news, food for thought around skill acquisition","Becasue there is no profit in that.","Because it's boring af and no one would take the classes if they did...","Most Computer Science professors are sharing the same classwork assignments that have been done for decades. my state college (Eastern Florida State College) is heavily focusing on Java, but not in C++. This should be a red flag because most local companies in that area are using C++. I am glad that I got some C++ experience when I had an AS Degree in Computer Programming.","Because we cannot run country only with nodeJS troglodytes, someone actually needs to know how to do stuff and how stuff works.","I really wish schools would at least teach Git","I learned how to use a breakpoint at my first job after college. It was revolutionary to say the least. It had all be console logs up until then.","Are you in a theory school or applied science school? Debugging was a major part of my education. I am not a Computer Science grad, though. For my degree I actually took programming classes.","I was a GSA and I made it a point to teach debugging because I taught debugging.","they do... but people don't use them for some reason","You need a course in debugging? I mean, it's an art, but still, fundmentals means something else, please.","Most schools are for \"computer science\", not trade secrets or practices.And Debugging is mostly cover during C++ or Java course, back in days(not sure how curriculums are now).","Did they teach you how to see the stack?I don't think know anyone who didn't pick it up from a coworker or a friend","My research is primarily focused on CS Education in K12. So, for those interested, here are a few articles that dive deeper into the struggles of debugging - both in learning it and in teaching it.Desirable difficulties (not debugging, but a nice overview of the idea referenced in OP's post) https://burrell.edu/wp-content/uploads/2020/09/EBjorkRBjork_FABBSchapter2014-2nd-ed._WithCoverPage.pdfDebugging a review of the literature (an older Lit Review but still applicable and a quality paper) https://www.tandfonline.com/doi/pdf/10.1080/08993400802114581?casa_token=sP_eaTyi3HMAAAAA:mmU1zeFhDl3VzJkhQVKQ_rHQWJ5uS7WanRd3D_O5m7ldi9r-fSKpaKo5pjGWY7jbOGpcRyWnJX4IBgThe Cambridge Handbook of Computing Education Research (a mass compilation of CS ED research, including various aspects of debugging) https://books.google.com/books?hl=en&lr=&id=vmAwEAAAQBAJ&oi=fnd&pg=PP1&dq=info:4etl3RJXzT8J:scholar.google.com/&ots=1mqCJX8WbI&sig=GT-aKOJVOd2JBkY_KWXlxZqC7Xw#v=onepage&q&f=false","My school definitely did, we learned what breakpoints were and how to do them. It has been a while since I've been in school but I recall doing it in multiple classes.My issue has never been with them not teaching fundamentals, I've always felt like I had a good fundamental base. My issue, after getting into the real world, is how little of the real world they teach you. They don't tell you that you're going to have insane deadlines or requirements change at the last minute. They don't tell you the vendor is going to have broken pieces you have to figure out. They don't show you someone else's sloppy code and expect you to work with it. They don't teach you that you're going to spend time in meetings solutioning things with business people that don't understand the technicalities of the code. There's just so many things that a skilled software engineer needs to be capable of that is completely void in the education system.","Article is a lot of blabber. It itself needs debugging.What I’ve observed from the interns we hire, most have some experience using a debugger. None have experience using a profiler.From interviewing though - use of a debugger tends to arrive late in curriculum. Students suffered with a lot of console printing before being introduced to a proper debugger. Not that I think this is a bad strategy - there’s many languages that lack debuggers (or a system you’re working on has none installed) so knowing how to debug code without a debugger is still a valuable skill.","My school certainly did. Took an entire class on assembly language also... that gets into the nitty gritty of CPU instruction sets, IP and stack, and exactly what is going on when you run and debug a program.But yea... there was a lot of \"real world\" programming that didn't get taught. We call that \"Independent Study\" here. :)","Because debugging requires setting environments, environments usually are hard to set for everyone, and teachers are lazy-ass-non-operations skill","Software Engineering was supposed to be pragmatic and Computer Science was supposed to be theory... but schools don't have enough industry experience in their lessons designs and so the programs are often used interchangeably which sucks.","I never had a class with debugging","Because most are Computer Science not Software Engineer curriculums. CS preps you to do scientific research / become a CS professor. SE preps you to build software systems.","În Romania we had close to zero exposure to debugging, this being at one of the best universities in the country :(","My understanding was that Computer Science degrees aren't Software Engineering degreesAny S.E. curriculum would have these elements (and more) that aren't taught well (or at all) in C.S. curriculums","\"schools\"? Most commenters here have taken this to mean \"university\" or \"college\", but IMO these days fundamentals should be taught in high school.","The amount of people I work with who don't debug, don't know how to debug, and/or don't write code that can easily be debugged. They don't have a high output, but I don't understand how they get anything done.","I think the author is simply wrong in their premise.If a person doesn’t know fundamentals of a given field, and particularly if a larger group doesn’t, teach those fundamentals. I’ve taught commas and semicolons to students almost every semester I’ve taught in college, and it’s neither time consuming nor hard.I remember suffering through this in junior high. Some people convinced the teacher that they had never heard of \"nouns\" before, like it was a completely new word to them, and the entire class was stuck doing remedial grammar. It was a WASTE OF TIME.If this guy never heard any complaints by teaching commas in university, then they either weren't listening, or students simply didn't complain because they were happy to take an easy grade or just skip class to do something else.I know I didn't bother taking extra time to complain about my few poor professors individually.They write for a few minutes then I walk around and look at their answers and offer a bit of individual feedback. Ideally, I have some chocolate and give the winner or sometimes winners a treat.LOL this guy is a professor? Sounds like a primary school teacher. Every single one of my university professors packed their lectures with content. Even in my softer electives (sociology, psychology, English), none of them ever used lecture time for students to do work. The closest we'd get is class debates, which is not equivalent.Now, I agree with some of his other points that the profs shouldn't be dismissive of students that need to improve their understanding of some fundamentals. But the solution for them is to get support outside of class, not to drag everyone else down to the lowest common denominator. The prof sounds like he is from the generation that came up with participation trophies and No Child Left Behind and \"can't give a kid a zero even if they didn't hand in the assignment\" mindset.And as for teaching fundamentals, my university didn't teach basic things like \"programming languages\". You were expected to pick that up on your own. Then again, this was a computer engineering program, not a software development program, so the focus was elsewhere. I could agree with the idea that some more formal instruction on debugging could be useful, but that's really what the labs and assignments are for, not the lectures. I don't think you can learn a lot about such things from a lecture. You learn by getting experience and doing it and needing to do it.I don't really get why this article was posted to programming. The article seems to barely mention debugging or anything really specific to programming, and debugging is only mentioned once in the article.","It's not the school, the board is full of old, really old people.","I know when most people ask me for help I just show them how to debug properly, and then they don't ask for help as often. I feel people just don't see the value in it. I debug pretty much always even if it's just to understand a piece that I don't know helps me see the flow better and how things are being executed.I don't know as much about other IDE's but in Android and the Android Studio IDE, we can write conditional bugging. So say you have a bunch of elements and you just want to catch a specific one that is failing you can do like if myObj.title = \"corn\" inside of this debug line and it would only ever stop when it meets that condition. it is super powerful.","At my school, it seemed like most of my perfessors had never worked in the industry or were 30 years removed. One professor was getting his doctorate while teaching. He was clearly a modern industry pro, and he was the best professor I had. He was the only one to teach any debugging.","They definitely teach it. I question if it is very effective. I am also willing to challenge how effective and representative they can actually make it? Education and the IT world have some alignment. However it is far from perfect. My major shock was the difference in scale, different teams and way’s to access resources. It is hard to replicate this while also using individual grading. From group projects I remember there always being “passing with distinction”, “passing decently”, “Just passing” and “I don’t care” mentalities. You don’t want the motivated people dragging the other’s along to pass. You also don’t want the deadweights to drag the others down or even fail.","My uni had a course on testing, and testing II as an elective. Most people didnt take the II course because there were other courses that were just more interesting. But the testing course covered debugging as well. It was sort of theoretical but we did have some basic exercises with python.","They do, or at least they should. The issue is debugging doesn't have a recipe. You just draw lines in the code trying to separate what works from what does not until you reach a piece small enough that you can see the issue.That can take many forms, and depending on what you debug can be done in different ways, it really comes down to practice, experience and finding what works for you and your style of programming.I do a lot of architecting so i am obviously biased, but my mantra has always been good architecture and good separation of concerns will make debugging much easier.The biggest issue is when code is monolithic and bloated such that making one change breaks 3 other things down the line.Imagine you have to write some code that needs to draw a square, you can try to do it all at once, or you can split it up:1 base class that can draw straight lines1 that can attach them perpendicularly ensuring right angles1 that can determine if 2 lines are the same lengthIf you need to debug and notice your lines are squiggly, it's obvious where the issue is and it should not affect anything else when you fix it. It's alo much easier to write tests for each and you can reuse the code down the road for other shapes.That's probably more important to teach than actual debugging and i feel like this is what my school focused on a lot.","Debugging by David Agans is the best book I’ve read on the subject. All new grad hires are provided a copy to read and it’s probably more practically important than anything they learn in university.","One year out of college I couldn't believe I wasn't taught to use a debugger. Or how to write and use unit tests. College would have been so much easier.","Ime college was more for the big concepts. I learned very little hands on programming, you’re expected to work and learn the basics on your own, and I don’t have a problem with that.","Debugging is kind of IDE dependent.It’s a skill for sure, but it’s not going to be consistent across platforms.","American universities aren't geared towards industry but rather research. They don't need to debug their stuff so how can they teach this art?","This is just the \"why don't they teach taxes\" question for computer science.","Any tldr","Too busy teaching syntax and basic understanding of project structure and stdlib","Best thing you can do when a dev comes on is just have them work on bugs.","Most schools do not even formally teach you English grammar or even how to write an essay properly. I suppose it is assumed to be self-explanatory.","Because \"Computer Science\" is not \"Software Engineering.\" Those are different things. And CS pretty much stops caring about Software Engineering once you exit the early 200-level courses. Once you grok Data Structures and OOP it's off to the Dijkstra's Algorithm and String Buffer Overflow attacks and networking and cybersecurity and ML and AI and Database \"Design\" and a never-ending list of stuff that aren't strictly \"Software Engineering.\"","If students were graded on critical thinking, few would graduate.","Too much switching between languages for each and every class.","That would require professors to understand the fundamentals.","Because no one wants to learn fundamentals. Everyone wants to start top-to-bottom, learning exactly and only what is required to get a job.","At least in my college the ones who decided to teach were the ones who didn't want to do work in the software industry. Mostly because they didn't cut the jobs."],"points":658},{"text":["Bootstrap 5 Remove Unused CSS with Vite and PurgeCSS"],"points":0},{"text":["Microservices: are they good or bad? The truth is, it depends","Screwdrivers. Are they good or bad?","Are you making a simple problem complicated, or a complicated problem simple with [insert tech]?","The problem is microservices are not in fact 'decoupled' and any bugs that manifest in service #1 but the cause lies in service #2 are now hard to trace. This means any supposed maintainability benefits from using microservices are a myth. The only benefit is microservices are modules with clearly defined interfaces but its usually possible to get this benefit by using existing language encapsulation facilities and possibly a tiny bit of scripting (eg Java packages combined with package-private access modifiers and python modules). Modularisation is important because it's much more clear which parts are coupled to which other parts but microservices do this, then give a lot of unnecessary downsides for no reason.I would not recommend creating new services unless you have a performance or buildtime problem that is most effectively solved by splitting off a service.","Did perd hapley write that title","The best of both worlds, a single code base and deployment for multiple services."],"points":19},{"text":["Visual vs text based programming, which is better?","None, since the question itself doesn't give any context.","I'm split brain on this -- I have Jetbrains IDEs, but I still go back to good old Vi.If you're on your own machine, IDEs are nice. But if you are working across clouds, or distributed programming, you can't beat the old text model. It's bandwidth efficient and works anywhere you've got SSH. Want to program on an IPad (I don't but some people do), it's best to use text-based tools.","Quote from article basically sums it up \"It makes 95% of things easy and 5% of things impossible\" and those 95% depends on a app. If we talk about some more complicated apps ten you can switch those numbers around."],"points":9},{"text":["Long Term Refactors","This very sprint, I'm actually working on the last component in a 6 year project converting our codebase from PHP to React. We were able to meet business deadlines and provide new functionality during the refactor with some good architectural frameworks and development rules:Build the refactored React application as a stand-alone app, but allow it to be integrated into the existing app seamlessly. As we converted each page into React, we replaced the original page with an iframe containing the React app. The React app was smart enough to know if it was embedded and do things like hide the nav menu (the legacy app had its own), get the login token from the PHP app, and make sure cross-app links worked as expected.New functionality was built in React, but legacy pages remained in PHP until we either had time to convert them, or the business requested significant changes to a page.Business requests came first, and we only converted pages as we had time.","Key points:The article discusses the challenges of large-scale code refactoring in busy companies, emphasizing the need for a well-planned and inclusive approach. Traditional refactoring often results in rushed processes, feature freezes, and potential burnout due to lengthy and unexpected delays. The article advocates for a more intentional, long-term strategy involving the entire team from the outset, leading to numerous benefits such as reduced stress, improved ownership of the refactor, efficient pull requests, uninterrupted feature development, and gradual implementation reducing QA issues. The process, based on Chernyak's experience with multiple big refactors across different companies and teams, includes essential prerequisites like having an experienced software engineer with a clear vision and a diverse team. The method involves identifying refactoring patterns, preparing the codebase, creating clear and specific instructions, keeping refactors visible to the team, and integrating them into regular workflows. This approach, contrary to working in isolation, fosters team collaboration, reduces confusion, and allows refactoring tasks to be self-assigned, ensuring everyone is aligned with the decisions and direction of the refactor. However, it requires patience, as refactors can span years, and parts of the code may never be refactored, which is often justified. The article highlights the importance of collective decision-making and communication in successful long-term refactoring endeavors.If you don't like the summary, just downvote and I'll try to delete the comment eventually 👍","Nice work on writing that up.I can confirm this approach has yielded success for me as well, on multiple occasions.One interesting thing that has happened twice while doing these large refactors is that sometimes you have to increase complexity before you can refactor and eliminate complexity. This can be awkward and test your resolve and assertions that the refactor is truly justified."],"points":14},{"text":["Secpass - A simple password manager written in Python 3"],"points":0},{"text":["Supercharge Your C# Code: Integrating Python using Python.NET"],"points":0},{"text":["Level up your PC's potential with Salad and earn up to $180 per month. We connect your hardware to the world's most valuable computational projects. Your PC provides the power. You get the profit. Start Chopping today."],"points":0},{"text":["How To Find The Longest Substring Without Repeating Characters","It is faster to just use a std::bitset<128> to record seen characters, and move the starting position using a loop. You can do constant-time lookups and updates of the bitset instead of using a hash table lookup, and you don't need to use the heap at all. Sure, you get a nested loop, but it will be bounded by the character set size, and very fast with better branch prediction than a hash table lookup."],"points":1},{"text":["8 Uses of sed in Linux"],"points":0},{"text":["Reinforcement Learning in 5 Minutes"],"points":0},{"text":["Why Is Java Still Popular Even In 2024?","Why do people still write dumbass articles even in 2024?","Don't people hate it to have to churn out BS articles that have no meaning for actual industry practitioners?","These titles are so annoying. They should be banned from this sub.","Despite the hate it gets, Java is a decent language and is useful for a lot of things.","Python is older than Java. They are both good languages (mostly) that are still being worked with and worked on.","Because people still use it, duh.","Java's still hot in 2024 because it's like a Swiss Army knife of programming – does everything from websites to robots, has tons of ready-made parts, and rarely breaks. Millions know it, so finding help is easy. Plus, it keeps getting better and pays well, making it a safe bet for both companies and coders. So, Java's not going anywhere any time soon!","The article isn't badly written, but it's very generic and more of an overview of Java Language features. It doesn't really answer the question on why it's popular.In general titles like \"Why is Java popular/dead/hated/bad/slow\" etc, often don't analyze anything. Regularly that are just generic, bashing without arguments or AI generated. That's why people get so annoyed.Back to the question. Often there is too much emphasis on technical factors why a programming language becomes popular/successful. There are many others. I asked myself this question not specific to Java, but in general, and wrote a short blog series about it. There I came with a list of around 19 factors that can contribute to its popularity, most are not technical.Last thing to say: Please stop citing Tiobe","As apposed to what? If your domain needs a statically-typed language, your options are limited. There are obscure choices that are arguably better, but you'll have a harder time finding devs who know it.On the embedded and high-performance side you have C , C++, and Go; and on the CRUD/biz side Java and C#. If you can't stand MS, you don't want C#, leaving Java for CRUD.I personally can't do without optional named parameters, like what C# allows but not Java. The alternatives to emulate them in other languages are not the same. ONP's make shop API/libraries much easier to extend and tune. Microsoft is annoying, but you'll have to pry ONP's from my cold productive fingers.","Java's popularity probably stems from its wide usage and long history in industry, despite some valid criticisms about its verbosity and complexity.","I use Clojure and really appreciate the rock solid JVM and huge ecosystem of libraries. I can’t see Java going anywhere.","ava has been a cornerstone of the programming world for over two decades. Its “Write Once, Run Anywhere” philosophy made it a go-to choice for developers across various platforms. From mobile apps to enterprise-level systems, Java has been a reliable workhorse.","Same reason COBOL is still around, legacy stuff and cheap companies that will keep kicking the can forward way into 2050'","It's a lowest-common-denominator language. It's not going to budge for quite some time.","I’ll tell you why it gets used in some places…. Because Java developers are perceived as cheaper than many other languages because the supply is higher. For decades everyone learned Java in college and the more recent trend towards Python as the first language hasn’t been there long enough to overtake it.I have product architects who will tell me I should switch to Java because I can hire people for less while ignoring many many other reasons to use Go.","Java is the COBOL of the 21st century. A lot, and I mean a lot, of legacy applications from the golden shower age of Java. Back in the early 2000's Java was the ultimate square peg that everyone was trying to drive into every hole.I was an employee of the big red back then and suffered through years working with the Red Pile Stack.","Bla bla bla and I'm still getting paid for it at the end of the month","Platform Independence:Java's \"Write Once, Run Anywhere\" (WORA) philosophy allows developers to create applications that can run on any device with a Java Virtual Machine (JVM). This platform independence is a significant advantage.Robust and Mature Ecosystem:Java has a vast and mature ecosystem with a wealth of libraries, frameworks, and tools. This robust support system simplifies development, reduces time-to-market, and ensures stability.Strong Community Support:Java has a large and active community of developers. This community contributes to ongoing language enhancements, provides support, and shares knowledge, fostering a collaborative environment.Enterprise Adoption:Java has been a go-to choice for enterprise-level applications for many years. Many large-scale systems and mission-critical applications are built on Java, contributing to its continued relevance.Versatility:Java is versatile and can be used for various types of applications, including web development, mobile applications (Android), enterprise software, cloud computing, and more. This adaptability makes it a practical choice for diverse projects.Backward Compatibility:Java has a commitment to backward compatibility, ensuring that older Java applications continue to run seamlessly on newer versions. This stability is crucial for businesses that rely on long-term software solutions.Security Features:Java incorporates strong security features, including a secure execution environment (sandbox) and automatic memory management, which helps in preventing common programming errors that could lead to security vulnerabilities.Performance Optimization:Over the years, Java has seen performance improvements through updates and optimizations. The introduction of features like the Garbage Collector and Just-In-Time (JIT) compilation contributes to efficient and high-performance applications.Adoption in Emerging Technologies:Java is adapting to new trends and technologies. For example, it has played a significant role in the development of Big Data technologies (Hadoop, Spark) and is actively used in cloud computing environments.Continuous Evolution:The Java language is continuously evolving with regular updates and new features. The language designers are responsive to industry needs, ensuring Java remains relevant and modern"],"points":321},{"text":["Slack Migrates to Cell-Based Architecture on AWS to Mitigate Gray Failures","Here's the TL;DR version (although the article actually is worth a read):And so we finally arrive at our cellular architecture. All services are present in all AZs, but each service only communicates with services within its AZ. Failure of a system within one AZ is contained within that AZ, and we may dynamically route traffic away to avoid those failures simply by redirecting at the frontend.Edit: Sorry, the actual Slack blog post is worth a read, not the garbage infoq article this post links to."],"points":5},{"text":["Big News in Databases — Review 2023"],"points":0},{"text":["The Rise of Gaming Tech and the Career Skills Needed","Never thought I'd see gaming become \"enterprise\".God have mercy on all our souls."],"points":0},{"text":["Dependencies Belong in Version Control","At the extreme end this is only feasible if you are targeting a single well-defined platform, and even then its iffy. Thing to consider is what things are you committing as binaries and what will you bootstrap from source? Ultimately you need to have some binaries somewhere to bootstrap anything.Worth noting that this is basically how major Linux distros operate; they are fully self-contained and their repos contain everything needed to compile themselves. So if you actually fully embrace a distros packaging tools, you are essentially getting this same effect. NixOS is fancier realization of that idea.","TL;DR: I can't get opensource projects to compile, therefor my local practice for just myself and one platform would suit open source projects.The article makes zero sense.","So in beginning he wants  A user should be able to perform a clean OS install, download a zip of master, disconnect from the internet, and build  but then in his dream vcs he suggestsThis is near instantaneous as files are not prefetched. The user then invokes the build script. As files are accessed they're downloaded  So which one is it?","Here's the gist:The post advocates for including all project dependencies, such as source code, binary assets, third-party libraries, and compiler toolchains, in version control. This approach simplifies the build process, making it as straightforward as cloning a repository and running a build command without needing additional tools or downloads. The author argues that this method enhances usability, reliability, reproducibility, and sustainability of projects, demonstrated through a C++ demo. However, current version control systems like Git have limitations in handling large files and repositories, necessitating alternative methods like containers or improvements in version control software. The feasibility of this approach may depend on the project and language, and issues like licensing and updating dependencies are discussed as potential challenges.If you don't like the summary, just downvote and I'll try to delete the comment eventually 👍","For the use cases that I'm familiar with, containers do solve the build issues.You can make your own container image with all (and only) your project dependencies inside, at the right version, and by inside I mean you don't have to pull a base image and install stuff wasting time and resources, but baking everything in the image. Once you have the container image, which is distributed over a container registry and uniquely identified by a hash, you can write your \"recipe\" of how the build should happen, with that specific image, and that \"recipe\" is the thing that you commit.In the git repo, you now have all the sources, and your recipe. The container that spawns, will mount the folder containing the sources (those shouldn't be baked inside). With this you can have pretty reliable builds I think.My snarky opinion is that Docker and friends primarily exist because modern build systems are so god damned fragile that the only way to reliably build and deploy is to create a full OS image.I think the idea is the reliable deployment, but the container technology has a huge amount of applications, and suits our build use case as well. And of course images should be as small as possible; Docker/Podman images are small on purpose, then of course everybody can build the image that suits them better. For full OS images that resemble more little VMs than containers, there are projects like LXD.","Obviously a windows guy, who missed three decades of package management, distros and devops. And producing code that quite no distro maintainer ever really wants to cope with.","The solution to this is CI/CD( And making dependencies specific (before a release), and caching all dependencies in your own package repository so they can't ever disappear )With the solution in the article you STILL need CI/CD to check whether you actually got everything in version control. And if you got CI/CD.... your OG problem is already pretty much gone.","We also do store all our dependencies together with the project. This way we can easily revert to a reproducible state, even when it is 10 years old, with a few mouse clicks. Helps a lot when trying to locate an elusive issue.But we do not store toolchains, as they can get really big. Everyone usually just installs all of them. Which ones to use is defined inside the build scripts.","If you can’t afford a jfrog or other style of proxy caché then sureI’ve seen one instance where MSFT unpublished an exchange online jar, broke all around. The ci system had a cache that got wiped with a rebuild and the only version was found on a developer’s laptop.Fun days"],"points":34},{"text":["Many failed before. Will YOU complete the trial?","A black hole is a region of spacetime where gravity is so strong that nothing, including light and other electromagnetic waves, has enough energy to escape it.[2] The theory of general relativity predicts that a sufficiently compact mass can deform spacetime to form a black hole.[3][4] The boundary of no escape is called the event horizon. Although it has a great effect on the fate and circumstances of an object crossing it, it has no locally detectable features according to general relativity.[5] In many ways, a black hole acts like an ideal black body, as it reflects no light.[6][7] Moreover, quantum field theory in curved spacetime predicts that event horizons emit Hawking radiation, with the same spectrum as a black body of a temperature inversely proportional to its mass. This temperature is of the order of billionths of a kelvin for stellar black holes, making it essentially impossible to observe directly.","All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....","Wait, you actually opened the comments? Are you stupid?","The world would be such a better place without you people in it.","this you?","nice","son ellos","with many on the title this is a juicy clickbait .","who is upvoting this why","Wasn't expecting comments on this","Techbible is your go-to tech community. Ask questions and get expert answers on all things SaaS. Stay updated on the latest tech news, discover trending tools, and share your tech stack with the world. Don't Forget to try it out.https://techbible.ai/","wow"],"points":6},{"text":["Level up your PC's potential with Salad and earn up to $180 per month. We connect your hardware to the world's most valuable computational projects. Your PC provides the power. You get the profit. Start Chopping today."],"points":0}]