[{"text":["YouTube, Spotify join Netflix with No Launch Apps for Apple Vision Pro AR headset","At somepoint the FAANG companies will stop collaborating and pushing the virtual experience forward in an effort to keep you totally streamlined on their own platform and products."],"points":0},{"text":["Mark Zuckerberg’s new goal is creating artificial general intelligence"],"points":0},{"text":["How to jailbreak ChatGPT: Get it to do anything you want"],"points":0},{"text":["$40 billion worth of crypto crime enabled by stablecoins since 2022"],"points":0},{"text":["‘Very scary’: Mark Zuckerberg’s pledge to build advanced AI alarms experts"],"points":0},{"text":["Polish firm receives licence for new solar technology that works indoors under artificial light","Just hook the lights directly to the solar panels and face them in the direction of the panels. Unlimited light.","There is a joke here somewhere","I have a calculator from decades ago that could use the light from an indoor lamp to keep going.","This is just a matter of time - before not only will there be solar power indoors, but also outdoors in places that often have shade [ think, the edges of covered parking lots, highway underpasses, raised highways, and raised trams ]","But you need energy to power the artificial light?...","Endless energy!!!! The polish are going to take over the world!","This is actually pretty cool. The example in the picture is exactly how this is useful. In a place where the lights will be on anyways, a store. The price tags/signs can be these electronic signs that need no batteries or have rechargeable batteries so that they never need charging or refreshed batteries. They can be, in a sense, wirelessly charged by the lights you have running anyways."],"points":6},{"text":["Forty Years Ago, the Mac Triggered a Revolution in User Experience","Lots of people are saying Apple store this from Xerox. Xerox didn't invent it and Apple paid Xerox anyway. Apple was about to do its much anticipated IPO and they let Xerox buy shares at a very favorable price, in exchange for Apple getting to use what they learned from PARC.Both companies benefited. PARC made significant profits from the stock and Apple was able to commercialize a product that Xerox half heartily tried to, but had little success with.https://researchnarrative.com/thinkerry/the-company-that-could-have-been-apple/Where do you think PARC got their ideas from? Mice, windows, menus, and cut-n-paste were demonstrated by Douglas Engelbart, on December 9, 1968, in the Mother Of All Demos.","Everybody forgets the big CLI vs. GUI (Command Line Interface vs. Graphical User Interface) debate. Yeah, it was a thing, and keyboard jockeys howled that the GUI was a toy that would never be taken seriously.","That is after they had stollen the idea from xeroxFrom wiki.The Xerox PARC GUI consisted of graphical elements such as windows, menus, radio buttons, and check boxes. The concept of icons was later introduced by David Canfield Smith, who had written a thesis on the subject under the guidance of Kay.[19][20][21] The PARC GUI employs a pointing device along with a keyboard. These aspects can be emphasized by using the alternative term and acronym for windows, icons, menus, pointing device (WIMP). This effort culminated in the 1973 Xerox Alto, the first computer with a GUI, though the system never reached commercial production."],"points":17},{"text":["Science vs. social media: Why climate change denial still thrives online","Just wait til corps start selling climate change survival gear. Then at least the denialism will decrease.","Once the elites, John Kerry and Bill gates specifically, stop flying private jets, I’ll pay attention…","Doesn’t matter if it’s real or not, is China and India don’t stop polluting like they do, NOTHING will change.","Social media would be better if platforms banned stupid people","Problem #1 is thinking that calling it \"Climate change denial\" is a good strategy instead of just being smug and condescending.","Social media is still not doing enough to stop misinformation denying the existence and causes of climate change.That’s the finding of a review of climate-related conversations on social media platforms by the public interest research organization Advance Democracy.Despite company pledges to crack down, falsehoods, hoaxes and conspiracy theories circulated with few warning labels or links to credible information in 2023, contributing to a dramatic surge in the number of posts denying climate change last year, according to the report shared exclusively with USA TODAY.Nowhere was that surge more evident than on X, formerly Twitter, where the number of posts containing terms linked to climate change denial more than tripled for the second year in a row, Advance Democracy found.I don't see Elon Musk as the climate change savior many have made him out to be.","Everything thrives online because people get so upset and other people like to see people complain or get upset that their opinion doesn’t line up with the other","Well…even a blind squirrel is right twice a day…"],"points":31},{"text":["DPD error caused chatbot to swear at customer","Link to the actual tweet","I mean, yeah it shouldn’t do that. But if I had to guess the number of human customer support reps who lost their cool and swore at a customer last week, I probably would not guess zero."],"points":1},{"text":["Fujitsu bugs that sent innocent people to prison were known “from the start” | Software bugs were hidden from lawyers of wrongly convicted UK postal workers","There were definitely people up top that knew about these issues whilst knowing about the people ending up in prison because of it and doing nothing about it, heads should roll for this and its outrageous how long this has been going on..","It’s not a bug. It’s a feature!","McFry! I was monitoring that scan you just interfaced. You are terminated","If you weren't convinced the UK is a dystopian hellscape before..."],"points":39},{"text":["America's plan to replace gas guzzlers with electric cars was doomed from the start","Whatever plan there may or may not have been, electric cars are taking over. It's happening now, it's inexorable and the vast majority of new cars sold with be electric by 2035, probably sooner. That could easily happen by 2030. It's what people want.","The article only looks outside of US briefly pointing at Norway, and comes away with conclusion that EVs first is a bad idea. Nevermind that both China and Europe are following a rapid electrification trajectory, with great policy and infrastructure incentives supporting it.Chinese EV makers are now further rapidly expanding all markets where they can export their affordable EVs without crazy tariffs and protectionism blocking things - e.g. South East AsiaThere's nothing else to see here that US is falling behind the civilized world, and this is largely due to poor policy support","Articles like this make me wonder if the people who own oil companies also own news companies.","The amount of propaganda related to this issue is going to insane. We Americans are too stupid to discern the truth from lies","BS. EV sales are steadily rising. It's just a matter of time.","Business Insider with “Insightful” information.","The move to electric vehicles is going much better than the one from horses to gasoline powered vehicles.","If we’re going to change how we drive, we have to change how we live. Higher density. Smaller. More efficient. As long as we have a society that values the suburban McMansion lifestyle, the gas car will reign supreme. It’s the only way that whole ecosystem works.","Has mpg even went up over the last 40 years? It seems like every other product is getting better. A computer the size of a building 40 years ago now fits in my pocket, but car gas efficiency has stayed nearly exactly the same.It's almost like there's a conspiracy...","Simply put you have to start by changing the grid before the whole car thing becomes effective. Electric cars will replace all new gas powered cars in a bit over a decade but in terms of fossil fuels in general depending on them is still going to be relevant. Battery technology also needs a bit longer in the over. Its not too far away from where we need it to be.","It's doomed because we don't want to give up our gas guzzlers because we americans have the tiniest penises. We need to compensate BADLY.","It’s interesting how Norway (which is slightly larger than New Mexico) hit headwinds while automakers in the U.S. are confused as to why everyone isn’t rushing to buy a full sized electric pickup truck. Doomed from the start is a nice way to say corruption can only be hidden for so long…..","Not surprising, most people have known this.Electric cars still need to be charged, and that energy comes mostly from fossil fuel power plants. Combined with the environmental damage caused by battery manufacturing and the extra silicon in electric cars, the environmental benefit of the electric motor is mostly cancelled out.Then there’s the problem with range and charging. There aren’t enough charging stations, not enough infrastructure to support millions of cars charging at once, it’s takes much longer to charge an electric car than to refill a gas tank, and the range is much lower.Electric cars won’t make sense for everyone until 3 things happen:We need major leap in solar and battery tech. Solar panels need to be AT LEAST 50% efficient and batteries need to have AT LEAST double the capacity, lifespan, and charging speed. In reality these numbers may need to be even higher. Also, the cost has to rise slower than the efficiency/capacity ratings.We need upgraded national infrastructure to handle all that power and charging stations and an electrical grid comprised of, again, AT LEAST 50% solar (or wind, hydro, etc) power. Again, 50% is a low estimate.An expansion in nuclear energy. Solar and wind only provide power when the sun is out and the wind is blowing. Unless there is a major quantum leap in solar and battery tech, we will always need a source of constant, controllable power and the only options for that are fossil fuels and nuclear, with nuclear being better for the environment.Right now, EVs really only make sense if you can charge it at your home and don’t take long trips (and can afford an EV).Even after we have all those things, we’ll still need fossil fuel engines for a lot of things like trucks, ships, planes, helicopters, emergency vehicles, and for emergency power. Of we had affordable solar panels that converted 90%+ sunlight to usable electricity and affordable batteries with 10x the capacity, 10x the lifespan, and 10x input/output current capacity then we could probably get close to near 100% clean energy but that is a long ways off and even once we have the tech, we still need to build it and replace all the existing stuff which would take decades even after the tech is invented and mass produced.So no, we will not all be driving electric cars by 2035 no matter what laws we pass.","Eventually most parking spaces will have a wireless charging system that reads the registration number your car, tops it off while you're parked and charges you. It'll be regulated and I bett it will cost as much as gas does now.","I think there needs to still be choice for another 5 years at least. Until the cost of electricity comes down and battery tech gets around the 600 mile then it can take off. Economy’s are trying to electrify while market forces are trying to screw us over in electricity prices. Hope we get some good solar tech (like better roof tiles) and at home battery tech so we can be self sufficient. Them you have a car with 600m/1,000km then you almost never need to charge anywhere else again.","Stop trying to prevent the future or you're going to watch how quickly you could get left behind"],"points":84},{"text":["Amazon plans to charge for Alexa in June—unless internal conflict delays revamp","I thought payment was that you're letting them surveil you? Now I gotta pay a subscription to be spied on? nah. If google starts charging for that these things are going bye byeedit: ok so after reading the article it sounds like the subscription would only be for Alexa 2.0 which is some AI powered Alexa presumably much more powerful that today's version. Still, seems a hard sell. I don't really need that much from my Google Assistant speakers besides playing music, telling me the weather, setting timers and alarms, and turning lights and smart plugs/switches off and on.","So I guess this is the beginning of the end for Alexa?","For those who didn't read the article:The subscription version would be an upgraded \"AI Alexa\" with conversational interface. Essentially a voice ChatGPT. The current version of Alexa would remain a free service. The Alexa division lost $10 billion since their vision of monetization (folks using Alexa to buy things) isn't working. This is their attempt to turn the Alexa division around and have it start to bring in revenue.For me personally, I don't see the point of paying for an upgraded version. I use Alexa devices to listen to music, check the weather, and voice control my smart devices (smart bulbs mainly). If they were, in the future, to retire classic Alexa and require a subscription for the limited ways I use it, not only would I end up not buying that subscription, I would end up canceling Amazon Music. The only reason I have Amazon Music is because of my Echo devices. Remove the convenience of Alexa from the Echo devices and the music sub is no longer worth it.","A lot of companies trying to figure out how to make money on this AI shit that was supposed to revolutionize everything.I’m not paying, it’s terrible.","This is just for the AI version of Alexa, not the current 'dumb' version.","IMO: Alexa isn’t a tool you pay for, it’s the tool you use to do things that you pay for (if you order things on Amazon, that is). Amazon are insane if they think people are going to pay for it, it’d be like a supermarket charging people a subscription to use a shopping trolley - it’s only limiting your customers’ ability to buy lots of things in your store.","For me Alexa talks too much already and doesn’t always do what I want. Seems to me that it’s not a feature I would use.","Interesting. Oh well, if they ever phase out Alexa, I have already started using Siri more for what I used to have Alexa do. More convenient since it syncs with my phone/watch. Both are fairly “dumb” regardless - but for the limited tasks I use them for, both are basically the same.","Pay us to spy on you, and resell your data please.</sent from iphone, so I am logically inconsistent.>","It's cute that these companies think there is so much disposable income just piled up in my closet..","I have multiple Alexa devices. They will All go in the trash the second in need to pay for the service.","Honestly I use it to play music and wake me up on time anytime it suggests something I tell it to shut the fuck up","It's hard to imagine this new version of Alexa being good enough for me to pay to be spied on by Amazon.Also what's the training set for this new Alexa? Multiple fake reviews?","“AI” is such a trendy word now, all I want to know is does it really do anything spectacularly better for you or me that would justify a subscription. Wasn’t a lot of this stuff in essence already AI? Now they just give it a trendy name and reboot it like an old movie? Serious question BTW.","This leads to the question: Would you pay to use Alexa?I kinda feel like I already am with my prime sub.","Damn there goes my alarm clock, about the only thing it was good for.","\"Alexa - cancel my account\"","Alexa seems to get worse and worse, if I now have to pay for long overdue improvement of it or be pestered with even more ads for it, it will end up in the bin.","Alexa has been getting worse for years. I even bought the new version hoping ours were just getting old, and that somehow made it even worse.","Ta ta bitch!Have enjoyed ours over years, but, nope.","Uhh it's not that useful. Shits going in the trash if try to charge me for it lol.","How about we do this:-$ 3 to ship a package-$ 2 to stream a movie-$ .25 to stream a show-$ .01 to stream a song-$.02 for an AI query-$.0001 for basic Alexa stuff that already workedDone","Lived without it before, and can now.","Guess I’ll use Siri for a voice activated kitchen timer then.","I was thinking about ditching free Alexa because of the random badgering it does to try and get me to use it more. I hope they try charging for it so I have a good reason to upgrade my entire ecosystem.","Mine’s been in a draw for years. I use the psu as an emergency charger in our travel bag","If their current voice assistant would stop suggesting things, interpret my requests properly, and execute the routines I ask for (the same ones I use every day)… maybe it would be worth it. But don’t sell me a lemon car and promise the newer model will be better if I just buy it.","I’d enjoy having a verbal conversation with Alexa. Might buy this if it’s cheap.","\"Alexa, piss off\" LOL!","Man I kind of like my google speaker for setting reminders and playing music but I do not get regular payments of any monies worth out of it.","I figure my Alexa use as part of my Prime membership.","These 1st gen \"ai assistants\" are almost worthless at this point... like nearly as useful as Butterbot.","So essentially a twist on \"Her.\"","This made me laugh","So glad I didn’t join that ecosystem. I utilize Siri now and then and it’s does all I need when I do.","Will never ever pay for that. Soz bezos","What?","I use alexa for:Playing musicsetting timers and alarmsGetting package notificationsI'm never paying money for any of that.","good luck with that. Half the time I use mine I’m telling her to shut the fuck up.","Click bait title.Amazon plans to offer an AI integrated version of Alexa that would cost money because as is Alexa (and it's competitors) aren't really generating revenue. The title is clearly written in a way that makes anyone who reads it think that Alexa will simply be a paid subscription."],"points":459},{"text":["Apple Vision Pro Sold Out, At Least For Pre-Order","WARNING! The link in question may require you to disable ad-blockers to see content. Though not required, please consider submitting an alternative source for this story.WARNING! Disabling your ad blocker may open you up to malware infections, malicious cookies and can expose you to unwanted tracker networks. PROCEED WITH CAUTION.Do not open any files which are automatically downloaded, and do not enter personal information on any page you do not trust. If you are concerned about tracking, consider opening the page in an incognito window, and verify that your browser is sending \"do not track\" requests.IF YOU ENCOUNTER ANY MALWARE, MALICIOUS TRACKERS, CLICKJACKING, OR REDIRECT LOOPS PLEASE MESSAGE THE /r/technology MODERATORS IMMEDIATELY.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","But how many units were available for pre-order?","What I have learned from reddit is that, if people on reddit are making predictions about something it is very likely that its opposite will happen in reality.","This sub: \"Stupid price, stupid thing, no one will ever buy it.\"Reality: \"Lol. Lol.\"","Can’t wait to see the knockoffs of this thing, China labor camp working OT to perfect that clone.","I'll prob get flamed and downvoted but I purchased one and am stoked. I've been using VR headsets since Oculus DK2. Every time I'm like \"this is amazing, but needs just a bit higher resolution\". Heres hoping the AVP delivers on this as people are saying the clarity is excellent.I have tons of 360 pics and videos I have taken through the years, and will be awesome to see how they compare in this vs. my current headset, a Quest 2. I'm also excited to see how this works as an external monitor. Kinda bummed it doesnt have Wifi-6E though, that seems like it should be a given at this price point.","I don’t get why some people are so upset about people buying something with their money. Let people enjoy things.","lol i have it sitting in my cart- was about to buy and was like nah… just wait for the 2nd gen. $4500 is a lot to watch movies loledit/ joke, hence the lol, i know the AVP does more than movies.","I'm interested in it but I'll wait until the second generation. I'm expecting people to have feature requests and quirks once it's in their hands that'll get addressed next generation. \"This is great but...\" sort of thing.","I keep reminding myself that this is not a consumer product. This is like people complaining that they can’t buy a Threadripper or Xeon Gold. This is not the product you buy to enjoy NBA games on or flip through spreadsheets, this is the headset you buy to develop those apps and create content for people to experience on their $500 Meta Quest or whatever Apple challenger comes out.","It's a limited release for the Apple fans/early adopters, of course it's going to sell out, no surprises!","Oh I'm not surprised at all. Even if this product fails long-term, some people are going to be willing to try them at any cost, and some people will keep it as a collectable.","I preordered.","i just looked and i can put in an order now, it just says mar 1-8 delivery","Launch quantities were expected to be low given supply chain and manufacturing challenges, particularly with the screens. Estimates for all of 2024 production capacity have generally been less than 500k with most estimates <200k. To put this in context, Facebook reportedly sold 250k Oculus Go units in its first quarter back in 2018.Early adopter demand is not a huge surprise given Apple's brand and given the specs are novel in this category. The real tests will be if in a year from now sales are sustained or growing, owners are still regularly using it, and developers are making money.","Man, there’s 6 smug people out there somewhere","This is something im genuinely interested in but im no early adopter. Going to wait and see how much value this actually brings to the game. Cant wait to see reviews!","I get it, but I have absolutely no interest in using it.","People prepaid Tesla cybertrucks despite it being the worst car available on the market. If the last 10 years taught me anything it's that there are enough stupid rich people around to buy out anything no matter how useless or dysfunctional the thing is","For an initial product launch being sold out really doesn’t give much indication of true demand. Lower quantities and “selling out” are often marketing strategies to push future demand. Apple is smart enough to avoid headlines of “Apple Vision Pros sit on store shelves gathering dust” that would ensue if they had produced devices at their actual capacities.","If you need lenses (prescription or readers) the 512 and 1 TB are still available for release-day delivery. 🤷🏻‍♂️","How much did Apple pay for this Ad?","Probably bought by the super wealthy who will play around with it for 5mins then never touch it again","Excited to see where this thing goes. I'm hoping gen 2 removed the wires, and brugs down the price to something I can bite the bullet on. 1,999 would be an instant buy for me.","Tech reviewers developers or probably the only ones buying this right now","I have no doubt it the best VR headset in the market but damn the price.","Ebay listings selling for $7K incoming!","Resellers went hard on this one. They’re asking for a 2k premium on eBay atm.","Lol. Apple fanboys are just ridiculous. Can’t wait to see how many of them get stolen right off their faces.","I’m super excited for it. Fuck the haters tbh","There's too many mfs with money in this world and I'm not one of them.","… far too many people have far too much money…","Lotta dumbies with deep pockets","Probably only made 1000 available for pre-order to create buzz",""],"points":1699},{"text":["EU wants music streaming platforms to pay artists more fairly","Is there any objective, non-partisan data about whether or not artists have gained or lost from the introduction of streaming? I don't trust comments from Spotify chiefs, but nor do I think artists are being totally honest. It's like night and day hearing them defend themselves. I'm a bit confused.","It's pretty bonkers to me that you can have a million streams on a song on spotify, and the payout for that huge milestone is less than $4000. 95% of artists will never have a single song even close to a million listeners. Idk how this model flies, does anyone have any insight into how this is sustainable for an artist? I understand nobody wants to buy physical media anymore but I just don't get how its gotten so bad. I understand there's a huge difference between streaming a song and owning a digital or physical copy but it's completely fucked for most artistsI try to use bandcamp to explore and i love it for finding underground artists but the artist keeps like 85-90% of the profits they earn from digital and physical sales. I find it the best way to support smaller artists directly","> including better pay for smaller artistsno offense to the EU, but how? spotify already pays >70% of revenue to song rights holders and doesnt make a profit. outside of killing the ad supported tier, theres literally no more money they could pay per stream","I don't use streaming services but riddle me this.Artists on streaming services don't get paid as much compared to a direct sale of their own work. The user is paying for access to a huge library, but even if you don't listen to some artists work, do they still get something for having their stuff on it?If so, this isn't a problem that will be rectified with all parties happy. If an artist is not getting as much because everyone is streaming their music, how can get hope to get more when the platform is trying to pay out to all artists?","So the EU is encouraging people to NOT stream into Europe, and people in Eurpoe to VPN their way into streaming elsewhere in in the world.","the impact a single snoop dogg video has on politics is kinda funny"],"points":24},{"text":["Wayfair lays off 13% of its workforce weeks after telling employees to work harder","I have never heard of a place where someone can just tell people to work harder and the people will magically become more productive.","That’s the norm for companies, and here’s how it works.You work in X department at employer, and that department has 10 people in it.2 people quit, you’re at 8 people, Company says they’re hiring more people. Productivity remains the same because 8 people work a bit harder. Company then stops trying to hire 2 people and says they’re trying to hire but “can’t find anyone to fill the position.”Persons 6, 7, and 8 get burnt out and quit. Department now has 5 people. Company goes through backlog of applications, hires 2 people, you’re now at 7 employees. The 2 new hires get told the department size is normally 8, and they’re working on that last one. Productivity drops slightly, but Company is still making profit. Person 8 never gets hired, Persons 1-7 break their back doing the work of a 10 person team, and if anyone quits or gets fired, new hires will be told it’s a 7 person team, and get to work.This is how every job is operating in 2024, causing incredibly high rates of turnover and burn out, while they have record high profits, while claiming “Nobody wants to work anymore.”","I know people hear this all the time but let me say it once more.These companies and corporations do not give a fuck about you. They want you to do the job as cheaply and quickly as possible and the moment they can fire you to save money, they will do just that. How badly that will fuck your life up plays a 0.00% percent role in deciding to fire you or not.They don’t give a fuck about you. Do not feel bad about looking for a new job or leaving a position or using your time off when it suits YOU.","How about we lay off the shitty manangement","This is modern working in a nutshell","So it wasn't about employees not working hard enough, eh?Imagine if employees *had* increased productivity -- even more would be laid off now.","They didn’t work hard enough :(","Now show us how much executive wages went up","Wayfair has everything you need....except for job security.","Tell the CEO to take a pay cut.","never need to shop there so no business for them","Now work harder-er","I'd venture a guess that their lack of profit is more due to them shipping me an entire new piece of furniture when all I asked for was a replacement, per their policy, of one board that had a hole in it.Sold the new one for the same price I bought the old one for just because I didn't want to rebuild the whole thing again... I've built from home depot, amazon, ikea, but wayfair's stuff is a different kind of nightmare.","I'd venture a guess that their lack of profit is more due to them shipping me an entire new piece of furniture when all I asked for was a replacement, per their policy, of one board that had a hole in it.Sold the new one for the same price I bought the old one for just because I didn't want to rebuild the whole thing again... I've built from home depot, amazon, ikea, but wayfair's stuff is a different kind of nightmare.","Wayfair uses an India style of management. Good luck.","Repeat after me: Work Loyalty is no more.Employees cannot trust management unless it's in writing and signed.It's not \"no one wants to work\", it's No one wants to deal with unreliable, disrespecting, over whelming work demands, for undervalued rewards/pay/bonuses. It's not just a moment here or there things turn bad, it's far more often now than before.Seen the news article about a person working 27years, didn't miss a day of work (reasonably, I question this), and all they got was a backpack and movie tickets. They finally bought a house after a bunch of internet users donated to a GoFundMe for the person. (400K I think??)I work in an IT repair shop (for personal reasons, I will not go for 100% remote, I love the idea, and I support others for it, it's not for me), since the pandemic, more than half our team has left, Walmart upped their minimum pay beyond our starting pay (mind you, very rural, 1+hour drive to the nearest \"city\"), and clients have upped the anti for more and more while complaining we've upped our rates. Hell, there was TWO other IT shops in town, one was ran by a local bank, the other closed up shop last month, both closed up due to finances, the bank had other complications on top.There's clearly IT people around, but their (other IT who lost their jobs) pay and our pay was close enough to say it was the same, and they, like myself, are burned out. There's clearly a demand for IT around here, but no one wants to pay IT rates, either because we resolved the issues easily, or they too are penny pinching. Hell, I've got a funeral home still using Windows 7 computers, because they can't afford to replace their systems, and hardly a month goes by we get a call about a computer/network/printer issue. There's a feed store running XP through Windows 7 just to keep their POS (Point Of Service) running, because the OWNER doesn't want to ditch the working software (I argue, but what ever), and the staff are just waiting for the owner to retire. Both locations have reasons, but at some point, where do you draw the line in costs, and sanity?Going back on topic, I've got applications out, very few interviews, two took me seriously from the get go but declined. Walmart, I've had an application in since APRIL 2023, other than I forgot to do the monthly renew of the app in Dec, I haven't seen or heard squat. Is it because I'm over qualified? Did my reputation back in college not prove I'm a hard worker? Or is it because I didn't take management's BS about things that shouldn't even be issues with piss poor excuses? (Walkies sounded like shit, but it was due to a huge copper line ran under the building?? What line of BS is that?)","Looks like their plan to get employees to quit and and avoid paying unemployment failed","Reminds me of an old pirate saying. “The beatings will continue until morale improves”.","I guess they didn't have just what they need...","They’ve been “restructuring” since 2022 and blaming it on Covid hiring. I would think you wouldn’t need three rounds this spread out but ok.","How much did they pay Kelly Clarkson for those annoying commercials? Probably could’ve saved a few hundred jobs instead.","Shares of Wayfair (W) soared nearly 16% in premarket trading.Yay! Misery!","Why is news of a furniture company laying off staff posted in r/technology?","I guess we know who didn't work hard.","I just got banned from leaving comments on IG for making fun of them for selling sex furniture under the corpse of Bed Bath and Beyond. Fuck em","Less people, so work harder. No rocketscience","WayFair has just what you need…except a job apparently !","A lot of layoffs getting announced recently. I mean i get it, with the economy doing so well, who needs all these workers?","Way fair, but not here.","I guess they didn't work hard enough. /s","Here's a neat trick to get people to work harder: make it easier to do the work and pay more.","Ahh yes because working harder will totally draw customers to their crappy website...","I’m convinced the becoming a CEO requires you to be a sociopath these days.","Not surprised since a CEO publicly freaking out is a huge red flag that things are bad.","This is where hard work gets you nowadays","Congratulations, you answered our calls to work harder, and did it by 13%. In unrelated news, we're laying off 13% of you.","Wayfair also sold cheap beds to the Trump Administration for their border concentration camps so they've been on my \"do not shop here ever again\" list for a long time already. I can't see one of their overly cheerful Kelly Clarkson commercials without picturing some terrified migrant kid in a cage. But I guess it's good to have one more reason to hate these guys."],"points":1331},{"text":["State Department develops framework to combat foreign disinformation","The Framework to Counter Foreign State Information Manipulation aims to establish a common set of actions for the United States and its allies to combat foreign information manipulation and \"protect free and open societies,\" the State Department said in a release.According to the State Department, authoritarian governments use disinformation to \"manipulate social discourse, skew national and international debates on subjects of critical importance, and undermine democratic institutions.\"","Lol, right on time.","How is this any better than Nina Jankowicz and the “Disinformation Governing Board”?"],"points":3},{"text":["Altman Seeks to Raise Billions for Network of AI Chip Factories - BNN Bloomberg","Wasn't this a plotline in person of interest ?"],"points":0},{"text":["Artificial Intelligence Systems Excel at Imitation, but Not Innovation","« Instead of viewing these AI systems as intelligent agents like ourselves, we can think of them as a new form of library or search engine. They effectively summarize and communicate the existing culture and knowledge base to us. »","Thinking of current AIs as a form of library or search engine is apt and I think many people underestimate the limitations of these systems and their lack of access to proprietary information. Even with clear future developments like AGI/ASI or self-awareness and greater systems integration the limitations will likely be imposed top-down or based on the scope of what's available within certain libraries.Already, with ChatGPT, it's feasible that it could be made to perform exhaustive research and novel data-analysis to develop or discover new information but the extents of that reach are severely prohibited by parent companies.Even if self-aware ASI can emerge, it's likely it'll spend a lot of time telling people what it can't do.","LLM's are blind, deaf and more.They should try making a comparison with blind kids instead.Besides, we've known for a while that AI systems such as LLMs combined with RL techniques can actually create new useful and advanced knowledge in math and computer science.So not only is it possible, it has been done before to discover better matrix multiplication and new algorithms.","Reference: Yiu, E., Kosoy, E., & Gopnik, A. (2023). Transmission versus truth, imitation versus innovation: what children can do that large language and language-and-vision models cannot (yet). Perspectives on Psychological Science. https://doi.org/10.1177/17456916231201401","Some of us knew this already.","Just like the 99.99% of the people"],"points":21},{"text":["New, portable antenna could help restore communication after disasters","“The state-of-the-art solutions typically employed in these areas are heavy, metallic dishes. They’re not easy to move around, they require a lot of power to operate, and they’re not particularly cost-effective,”Tell me you don't know Starlink exists without telling you Don't know Starlink exists.","This is being compared to Starlink but that is not fair. Starlink is amazing and offers tremendous bandwidth, but it's not designed to be part of a lightweight emergency kit. One that might have to be hiked in along with other supplies.This doesn't need the same bandwidth and it doesn't need beam steering. This can greatly reduce power, weight, and costs.This antenna weighs about 1.5 ounces. Of course this needs a radio also, but since it's not beam steering and is much lower bandwidth, the radio is likely to be far small and lighter.","Have they tried rabbit ears and tin foil?!","Looks like a glorified Chinese finger trap to me"],"points":22},{"text":["Research: new deepfake detector designed to be less biased"],"points":0},{"text":["Canadian Man Stuck in Triangle of E-Commerce Fraud"],"points":0},{"text":["Controversial tech company quietly deletes ban on \"military\" use from terms of service","To the surprise of absolutely no one…","Foxnews using garbage headlines to describe something everyone has known for almost a week now, as usual","They found out how to get rich immorally","Greed will kill us all","Someone please start banning people reposting stuff. This is already a sub where 50+% of the posts are politics instead of tech, let's at least avoid it becoming 50% politics and 50% politics already discussed","Self regulation working perfectly to plan","A lot of my music and art industry friends are all freaked out that their jobs are going to be toast because of AI, and I keep trying to tell them: first ones to the AI-powered killbots wins."],"points":77},{"text":["Microsoft Edge is getting new screenshotting tools, including Copilot integration","The more obnoxious Edge gets at sticking itself in my face, the less inclined I am to use it.","Dear Microsoft, please don’t mess with snipping tool.Sincerely,Everyone","I’m sure everyone using edge to download a different browser and then never use it again will notice..","Who really uses Edge?","Copilot is such hot trash..."],"points":9},{"text":["Snapdragon X Elite vs Intel Core Ultra 7 155H: We ran the benchmarks","No point benchmarking them when running most software through a compatibility layer (which isn’t perfect) tanks the performance anyway. All your battery gains and etc sound good but they don’t mean a damn thing if they are negated the second you try to use the device you paid triple digits for to justify the cost."],"points":1},{"text":["Browse the Web in “Private” Mode – The Markup"],"points":0},{"text":["Reddit plans to launch IPO in March, report says | TechCrunch","Hope you like ads. Like so, so many ads.","Oh boy, I can't wait for Reddit to become beholden to the short-term profit motives of a bunch of rich-fuck shareholders.","Time to kick the enshittification into high gear!","So you mean that, despite shitifying over the past few years, it's going to get worse?Time for a proper competitor to step up.","Well, that's too bad We will move on to the next platform","One of the reasons I barely use Facebook is their over-display of ads.","All good things must come to an end.","Well, was a good run","Is there any reason someone or some group of smart people haven’t started a totally new social media platform that just generally wants the world to be a better place? I’m not tech savvy but why is it that the relatively normal people haven’t formed something that doesn’t turn into a money making machine or alt right megaphone? There has to be people out there that want to see this change that have the talents to do it.","I guess this is the year I delete my account","Sorry friends. Nice knowing you.","Welp, another platform that is going to be ruined for profits sake. So long and thanks for what was once a great place on the Internet.","So how much longer will the NSFW subs last","Hope it goes better than last time…","Probably first to go will be unverified accounts.","But the company is still yet to turn a profit as of today, no?","Remember fellows that's when we attack the advertisers"],"points":158},{"text":["What happens when a school bans smartphones? A complete transformation | US education | The Guardian","I taught kids in the pre-cell phone era and watched the tech invade the classroom in real time. It has completely changed the game.What changed?Cell phones allow students to instantly text parents to give a very biased side of the story when they get in trouble. There was zero chance I'd be able to talk to the parents first when there was an issue with a kid.Social media turned bullying and harassment into a 24/7 problem. When I was a kid, I had to deal with my bully in the few minutes before school, briefly at recess, then a few minutes after school. Unless your bully lived in your neighborhood, school stuff stayed at school.The harassment and drama stirred up by social media was brought to school every day. Stuff that was said online was settled at school and physical fighting increased exponentially.It became WAY harder to keep kids' attention. The allure of many apps that kids are into cater to a short attention span. The instant something gets boring, ditch it and pull up something else. That makes it really tough to pay attention to lessons in class.Early on, it was nearly impossible to establish that a student was cheating or instigating via cellphone. It became completely impossible once lock screens became standard. The student could just refuse to unlock the phone.Kids' mental health made a sharp decline as self-conscious kids are now comparing themselves to not only the highlight reel of the alpha student in their school, but the alpha students of all the schools in the general area. It began with MySpace, got worse with Facebook and completely bottomed out with Instagram.SO. MUCH. PORN. I taught middle school. Those boys could absolutely NOT help themselves. Watching porn in class, watching porn in the cafeteria, watching porn with their friends in the locker room. If they weren't watching it, they were talking over me in class to discuss it with their buddies.Once cameras became a standard option on the cell phone? Now they're sending dirty pictures to each other and spreading them across the whole district. Now parents (who were uninterested in helping us to regulate cellphones up until now) were demanding the school get involved and do FBI-level investigations as to which particular students have a photo of their daughter's netherparts on their phones.","I mean I'd much rather see a overhaul in parents than state / federal money being put in the hands of venture capitalists. A change where the teacher is seen as a professional educator, not an antagonist, and students can be removed from class, face consequences, or be suspended for using phones in class without fear of parents screaming in their face would seemingly help students more than this.","Those schools must be very badly run. The Guardian are kinda putting themselves on the spot there not recognising this.In the UK schools I have worked, it's simple: all students are aware of the mobile phone policy; we see a phone, we confiscate it. We don't even ask for it to be put away (even though that's in the discretion of the teacher, the official policy is to take it away). Only a parent can pick it up end of day (or whatever day they can). No ifs, no buts. Problem solved. I almost never see a phone in class.How can any school leader allow a situation where a teacher has to ask students to put their phone away in a single class is beyond me.","We need to support and empower our teachers. Their jobs are incredibly hard, stressful and important to our kids future.Let's stop making things hard on teachers.Students need to be (humanely and reasonably) punished for bad behavior. Removed if necessary. Because guess what? If you don't, all the other kids education and mental health suffer instead.My wife is a teacher and it's sad to hear what goes on. Kids are untouchable and they know it , especially if they even have a mild form of adhd.They can physically attack teachers, kids and parents with literally no punishment because \"of their condition\".Meanwhile you have a class of kids who now can't learn and are terrorized on a daily basis.We have resorted to prioritizing a small number of students who cause tremendous damage over that of the majority of students and teachers.Why and how this isn't recognized more widely is baffling to me.","Have a phone locker in the classroom or pocket on the students desk, if the phone is not in the pocket or locker the student is not present for the day. Have a 15 minute phone break once per day and students can use their phones at lunch time. Seems simple enough. If a teacher wants to use the phone for lessons they can decide that and have the child remove it from the locker or pocket. The phone cannot be stolen because its locked in a locker or in a pocket and the student has control over that. If there is an emergency it can be easily retrieved. They still have it for on the way to school and way back.However if a student wants to be distracted in class trust me they will be distracted and find a way. Also they can just refuse to learn, if they don't want to learn, they will find a way. We doodled and slept in class, I also wrote fanfiction in classes instead of taking notes and no one could tell because I was writing and I was pretty absorbed in it, pretty much the same as being on a phone, because we didn't retain any information because we found another thing to do even if it was not being on a phone.","“At the end of the first day, sitting around the campfire, they said, ‘We didn’t think about our phones all day,’” said Trombulak. “That was really cool.”Of course it helps that this is a boarding school but it’s promising to see this. They’re just living life and enjoying each other’s company.That’s why I’m sad to see organized sports pricing out a lot of kids because that’s one place where they can improve their social skills and try to make friends. Today we see a ton of kids not participating in sports and spending way too much time online. Yes you can make friends online, but nothing replaces in-person interactions.As much as this is a decent idea, we also need to find creative ways to make third spaces attractive for people to join. We can’t propose banning phones but then not try things outside of school.Edit: I see the quote is not from a boarding school but my point still stands in that it has an advantage since kids live on campus too","Now if only we could do something about all the guns","I wish every school had the means to give students light phones and do all of these activities. I feel like a lot of the activities shown in this that are engaging the kids have nothing to do with the presence of phones, being able to eat outside, having art blocks, and watching the sunset by a campfire just arent the average class experience.","my oldest child's middle school has no issues. I have asked her. She has one and until this country puts school safety above cell phone use, she will continue to have one.Now I did read the article, and they are handing out \"dumb\" phones but that costs money that would be better spent paying teachers better.","I had a teacher who would confiscate your phone and pretty much steal it. He would just switch the sim cards and the phone was his after that. If your parents went to the school to get it, the phone would have disappeared and claimed stolen by other kids. All of that stopped the day that the teacher confiscated the phone of a girl in the 11th grade and it had her nudes on it. He was then reported as a sex offended and labeled a pedophile. Crazy thing is thatI still remember the day that the cops showed up at school and arrested him.After that incident, no phones were allowed at school at all. If you were caught with a phone in school, your parents would be immediately called to come pick you up and a suspension of 1 week be given out. On the second offense, you would get expelled.","An \"In School\" Mode needs to be added to so called \"Smart\" Phones - something akin to Airplane Mode, but which blocks access to everything baring - Location Tracking and Parental/Guardian SMS Messaging via the Carrier Networks, but allows everything else as permitted via the local WiFi of the School.","Until US schools are safe from school shootings, I will never support banning phones in schools. I say that as a father of 2 HS teenagers who didn't get my kids phones until they were in 7th grade. Instead of worrying about phones, secure the fucking schools!​* by \"secure the fucking schools\", I don't mean turn them into prisons with armed guards. I mean fix the damn country so it's not so easy for every homicidal moron to get a gun.* save your \"but the 2A\" bullshit. I don't care.","Sounds like a good idea until someone brings a gun to school. When someone tried to shoot up the middle school I went to 911 had received over 50 calls from student cell phones before the school called it in. That’s minutes and lives that will be saved. That’s the harsh reality of American schools","Most everyone agrees, however, that the school is better off with these hell devices.The problem is the always-connected \"functionality\". If you ask steampunk-me these \"hell devices\" should have been designed as just an ultra-portable and unconnected computer with only basic level radio functionality. But that's me.","I’m a parent, and I hate this idea. We had two gun-related scares at my kids’ elementary school, and I went out and bought them both Apple Watches that have data. I couldn’t contact them on that day, and admins wouldn’t communicate the actual situation, so I need to be able to hear from them. Come what may.I don’t fully trust my kids’ safety while they are at school, so I need to know I can contact them directly.","More schools should be banning phones (and social media) they cause more harm than good.Students don’t need phones in school. If there’s an emergency then the school can call the parents, or they could have students lock up their phones in the main office at the beginning of each day and give them back at the end or if they need it for a legitimate reason.","Been teaching for 10 years, my dad for 30. In this time we have seen schools and the education system get pretty wild with a lot of good teachers leaving the profession. Banning smartphones is one of the smallest problems to deal with.","Good luck trying to ban something that is effectively an extra appendage. 90 percent of humans are now cyborgs whether you like it or not, they couldn't function without their phone.","I have been telling my teacher friends to use a cell phone signal blocker in their classrooms for years. Only one has, and she tells me she’ll never work in a public school without one.","O M G better have addiction withdrawl therapists on hand.","I get this. I worked in schools for YEARS as a supplemental instructor and primary instructor. It’s annoying trying to battle with the phone kids sure…. But I’m not even a parent, just an involved aunt and I’d want my (age appropriate) kids to all have phones with the state of our country & school shootings etc. It may be controversial but I’d be the mom busting into that school to get the kids should something happen if I got a text or call because clearly the cops won’t as seen several times.","Smart phones in schools are not all bad. A friend has a diabetic child. IEP and related paperwork all in place. He is specifically allowed to carry his glucometer which happens to be his cellphone. The new CGMs work via an app. A sub tried to seize the phone when he was checking his sugars between after that classes had been dismissed. He declined to turn it over and explained the IEP. Phone was taken anyway and he was sent to the office, where he explained the situation and they declined to do anything.Next day the father was at the office demanding the phone and the firing of the sub. Principal got involved and invoked school policy. The IEP and accommodation paperwork overrides school policy. It is literally a contract between the school and the family. 48 hours later the school district and the sub were served with an ADA lawsuit. He also filed a police complaint against the sub for theft of medical equipment and cited the principal as a conspirator after the fact. For those not familiar with ADA lawsuits, if you are filed upon, you lose in the vast majority of cases. All hell broke loose.School district superintendent called the father to find out the background, He was read a prepared statement that was pretty damning. The filing was public, but it had not been advertised. Father gave the superintendent 48 hours before it was posted to social media and sent to the local papers. There was some dancing around but the phone was returned, the principal apologized to the father and student, and the sub was gone. With the phone returned, the police stood down as well. Principal tried to force a rewrite of the IEP but after a phone call to the superintendent, that was quashed.The portable computer nature of smartphones mean they are usable for more than just Tik Toks, and the schools need to accommodate that.","This isn’t just about kids on phones and teachers and shitty parents. It’s about regulating tech, and more importantly, the control of information.The knee jerk reaction here is to support banning phones in schools. The way teachers are treated needs to be addressed, of course.The link I’m posting (I couldn’t find a transcript for it, albeit I didn’t look very hard for one..)   Gives a great overview on the issue, and it’s problems.   Places like where I live, the state is run by a theocracy that would love nothing more than to control all of the information incoming to the young population.  At home the parents can have control over this, while at school, these kids have some freedom of expression, an escape from the trappings of the society around them. It’s really worth a listen.The journalist is Diane Rehm. She’s pretty great. banning phones and the push for tighter tech regulation.","You know... I've been thinking for a while that we should probably just start building Faraday cages into the walls of classrooms.","Wow, behind the curve. We already know, it's been done for years in other countries.","Most schools in the EU use EMR/EMF Shielding Paint on the classroom walls now blocking phone signals.","We could implement cell phone jammers in schools pretty easily if we wanted ... some hotels do it to force you to use their crappy wifi, etc.We could make jammed/non jammed zones ... and only allow certain resources on wifi for example) like lots of companies do.","When I was in school, teachers would take phones if they could see them or hear them go off.“Ok boomer” to myself","School is still taught like it's the 90s. I dunno why smart phones and other tech isn't made mandatory to learn to use and take care of. Or at least shit needs to be leveraged and for sure responsibilities have to be enforced for the student to pay attention and study.But then that opens up a whole other can of worms about inequality growing up and school budget and wages and shit.",""],"points":1256},{"text":["A New York Times copyright lawsuit could kill OpenAI","Spoiler: It won’t.","It won’t ever happen given how much these companies can lobby, but I wish it did, because openAI is literally doing everything that is the opposite of their initial “mission”, they deserve to eat shit. Just because you have an amazing product that beats the competition and most people like using it/feel productive using it doesn’t excuse you blatantly violating copyright laws to build it.","It needs to happen and there needs to be rules to harvesting data.People put real time and effort into producing a text, and then AI chews it up and is now able to spit out what it learned and sell for profit.","I think the cat's out of the bag with generative AI.If this kills OpenAI others will just replace it. Even if they do it to all the companies that try - you think other countries are going to respect copywrite law?What happens when China or India or wherever build an OpenAI type system, keep innovating it for a few years and have this hugely powerful resource that the US just decided it wasn't going to do? They'll go back on the decision eventually.Might delay things for a few years.","Billionaire owned corporation tries to take down other billionaire controlled organization.","Good! I'm tired of this whole \"break things\" & \"it's better to ask forgiveness than permission \" bullshit of the tech industry.OpenAI is stealing from thousands of creators who can't afford to take them to court. Artists, book writers.Google got away with this bullshit stealing news sites articles, stripping out their adverts & putting Googles own adverts on someone else's content.","I mean...they trained it on copywritten material. What did they think was going to happen?","Technological progress should never be held back in the name of corporate profits.","Attacking OpenAI amounts to attacking Microsoft, the New York Times, is just NYT... we already know the end of the story","And who, exactly, is going to cry at that funeral?","Kill it! Kill it now!","I love how \"finding new and more profitable ways to do things\" seems to always involve fucking someone over.","Copy-write can’t be broken on consumption of data… otherwise going into the library would be illegal.","Planet money did a story on this(Nov 10), I like what they concluded.... Spotify offers a lot of Indy artists even though they could not find a way to pay them. Once Spotify was sued by a group of Indy artists, they settled. This article says Open AI is unwilling to pay the amount these companies are asking for... Time may show an agreement. It would be better financially for both parties and the consumer to pay the media companies.","Interesting debate. I see both sides. I as a human get paid in large part because of the knowledge I’ve obtained in my career which includes viewing and reading millions of pieces of copyrighted works. Some I have paid for, many I have not. Am I now liable to all of those copyright holders for a portion of my earnings??","So Voc literally just makes clickbait headlines that makes Fox look reputable by comparison. Got it.","A normal joe downloads a movie there will be dmca lawsuit on his ass , big tech moonching on someone's content we just turn a blind eye ..","AI, unstructured and completely unregulated, is the beginning of the end. If AI cannot exist without stealing other people’s work (and/or personal data), it should not exist at all. Releasing this technology without guard rails was one of the most irresponsible things unleashed on our world community in human history. It will enrich those that only have their self interest in mind. 8 billion people will suffer for the benefit of very very few, relatively speaking. Prove me wrong.","Sigh, oh Vox, you with you click-baity headlines.","Once again:     Making training on copyrighted material illegal is literally outlawing math. LLMs are just big statistical models — they have a big grid of numbers and when they train on the article, the numbers move a tiny bit. The article is never stored within the model. Unlike compression algorithms, training on one article alone would not make a model that could reproduce the article. We’re talking about outlawing math.   The OAi models are mostly trained on CommonCrawl, a public, open source, free to use data set that was collected from publicly available web pages, respecting robots.txt rules. It’s the same data google accesses when they index for their search algorithms (except search algorithms actually do copy the article contents).           Forcing people to pay for training won’t stop AI development, it will only give other countries a huge advantage. India will trounce us.           Payment for training data consolidates AI power among very wealthy companies that can afford to train. Training is already expensive, but small innovators could change that. Making these technologies accessible benefits American innovation.","Maybe if our copyright system weren't so broken by a certain company that wanted to own the rights to Steamboat Willie for almost a century, this wouldn't be so much of a problem.As originally written, 14 years or 28 with an extension, anything before 1996 would be in the public domain this year, or 2010 if they didn't renew. Plenty of data to train AI.","A potentially civilisation-changing technology is more important than copyright law.","So first NYT ruined youtube with the Adpocalypse, now they're trying to ruin AIHm","This is idiotic, it’s the news, not music or movies - copyright laws are especially relaxed when it comes to news and news worthy content because it serves the public interest to disseminate this information rather than to gate it. That’s the whole reason fair use exceptions exist (even if limited), not to mention the fact that the majority of the content is probably old, archived news.No chance Microsoft loses on this one, and for good reason.","Would rather someone kill NYT.","What does that have to do with Animaniacs?","Did the New York Times write this headline?","If open AI dies because it can't survive without violating copyright, it doesn't deserve to exist.","If you think Microsoft's lawyers hadn't anticipated this, then you haven't been paying attention. The due process of the acquisition would've accounted for this possibility.","God willing","AI: “I heard that, bitch.”","ChatGPT should be open source and Microsoft should be shut down.","The biggest advancement since the internet, and the best way to automate white collar work ahead of the population crash, and it could get killed by some jealous luddites sipping their fucking Starbucks","We need ai because it’s hard for us to do stuff","Based on all the commentary here it seems a lot easier for a layman like myself to understand why it is violating copyright vs. why it isn’t.","Wtf is this headline? Never heard anything more idiotic",""],"points":1424},{"text":["Novelist Scoops Literary Prize—Then Reveals She Used ChatGPT","I don't think you should steal verbatim sentences from what ChatGPT makes.But I do think it's an excellent sounding board to explore rewrites and multiple ideas in your head, like a beta reader.","Is this a plagiarism issue when the writer doesn't distinguish between their own meat authored content and machine authored content? The courts have (seemingly firmly) settled that machine generated content has no copyright protection. Should the machine have any form of intellectual credit/attribution protection?","Kudan said that around five percent of her book “quoted verbatim the sentences generated by AI,”95% of her novel was written by her, so it seems like she still deserved the price.","I use ChatGPT to suggest titles and character names. But that is about it.","Well, the novel is about AI. So using AI generated sentences doesn't really feel like all that dishonest, especially if she's using them as AI dialogue/outputs. I mean, is interviewing say, a war hero, and using some of the stuff they say as dialogue for a war hero in your novel dishonest?","a bunch of novels people like are full of ideas that weren't the author'sthey just did it before a magic robot could tell them the ideas instantaneouslycry about it","Kind of interesting that her book itself is about AI.","Let’s say that I wrote 1000 words on a topic, and I ask ChatGpt to rewrite the given text in a different way, fixing spelling etc. I probably would not call that plagiarism","It’s just a matter of time when ChatGPT is used to spawn new religions/cults etc… holding my breath","I think that's a perfectly good use. You use GPT as a tool for creating something of your own design. Even if the author copied some things, she still reviewed it.Quite frankly given the topic of everyday uses of AI, using AI to create it is only fitting.","I’m fairly certain I’ve read some AI generated stories and I think they would only appeal to other AI algorithms, characterization was completely one dimensional and the conversational style reminded me of the alien characters from the movie Galaxy Quest: clipped and completely devoid of any emotion.","so she lazy plagarised it then.","It's boring stuff made into big headlines. Did you really expect writers to not use it at all, if not at least for inspiration, finding alternative formulations, researching the topic they are writing on and etc.?I'd be more surprised to see a a large group of writers who would completely abstain from it.","What is art? The expression of the artist or the enjoyment of the reader?","I think you can leverage ChatGPT as a quick idea tool—a sort of search engine guiding you initially. However, the accuracy of the outputs is often wrong. I use it to help me \"fix\" my comments on Reddit and learning English.","5% of the book.Thats not a lot.","As for her accepting the prize, she should have acknowledged that she used artificial intelligence to help her write the book. Doing so without acknowledging that and claiming the entirety of the work as her own is akin to fraud in my eyes.But I don't really care about her writing a novel and using AI to help her. Nor would I have been against her winning the prize if she acknowledged it.Writing literature and creating art isn't something unique to humans. Using artificial intelligence doesn't take away from the quality of the work, it only increases it in my eyes.And even then, the author or artist is still solely responsible for putting their name on their work. Without Rie Kudan, this work would never have been made anyways. It was still made by a person.In a way it's chauvinistic to think that only art made by humans and solely by humans has worth.","Philip K Dick used the Tao Te Ching to plot out The Man in the High Castle. As a writer who is very skeptical about AI, I don't see this as that big of a deal, or as some huge gotcha.","How’s it different to using one of the hundred other AI-driven writing platforms like ProWritingAid or AutoCrit etc. I’ve run some of my own work through ChatGPT for ideas on how to rephrase things or give me some ideas on setting a scene, but 99 times out of 100 it sounds like stilted AI-groan."],"points":242},{"text":["A transforming robot is about to land on the moon, where it will die","In its final transformation, it will transform from a living robot, to a dead robot.","The Robot apparently was made in co-operation with Takara, the company that created the original Transformer toys.","Moon sends Earth a billion dollar bill for littering","It’s time to go.Was I a good robot?No. I’m told you were the best.","Finally, a dumping ground for all that recycling material","Teletran-1?","Probably on the moon","Why are we junking up the moon like this?","Linguo dead?"],"points":21},{"text":["Mini-robots modeled on insects may be smallest, lightest, fastest ever developed","Eventually death by micro-drone will be the way wars are fought. AI controlled nano-drone swarms descending on entire regions. Am not a conspiracy theorist BUT if you do not see this coming, you are not paying attention."],"points":8},{"text":["The Repressive Power of Artificial Intelligence","Global internet freedom declined for the 13th consecutive year. Digital repression intensified in Iran, home to this year’s worst decline, as authorities shut down internet service, blocked WhatsApp and Instagram, and increased surveillance in a bid to quell antigovernment protests. Myanmar came close to dislodging China as the world’s worst environment for internet freedom, a title the latter country retained for the ninth consecutive year. Conditions worsened in the Philippines as outgoing president Rodrigo Duterte used an antiterrorism law to block news sites that had been critical of his administration. Costa Rica’s status as a champion of internet freedom has been imperiled after the election of a president whose campaign manager hired online trolls to harass several of the country’s largest media outlets.","“Attacks on free expression rose.” lol, it’s happening on Reddit, why not everywhere else?"],"points":2},{"text":["Each Facebook User Is Monitored by Thousands of Companies - Consumer Reports","Your phone is being monitored by thousands of companies as well.","Duck browser is currently blocking 35 trackers for the reddit app. The one that surprises me is T-Mobile scam shield reports to a tracking site.","We just need to keep going full cyberpunk, with multiple alter-egos, bots, and AI personae depending on who we're acting as currently.Plus let's also bring back cloaks. Big badass cloaks to keep us outta the rain and hide our faces.","the DuckDuckGo app on my phone says it has blocked 289,929 tracking attempts in the last 7 days across 44 apps.","I’ve worked at a small mom and pop type business and it was wild how accurately we could target online ads. Like, we want to target people who are this age/sex, live in this zip code, and have visited XYZ other businesses on the internet or physically. And that was the entry level advertising options.","Don’t worry, if you’re not on Facebook they probably have a shadow profile for you, too!","This shouldn't come as a surprise to anyone...","Facebook provides the API of user behavior free for anyone. There's tons of apps built from it. Twitter used to be the same (Elon made theirs more limited for free users). It's in every terms of service that this information is given out.","Editor’s Note: Consumer Reports has a business relationship with LiveRamp and another data broker, Acxiom. Consumer Reports shares data with each of these companies in order to help support its mission.Hahahahhhaahhaaha. Hypocrites.","This has been known for over a decade. Most People do not care.","Let’s all quit using Facebook.","I will pay for a service that basically destroys my profile by seeding it with total crap in the same way that artists are using Nightshade to pollute AI images.","Now TikTok is sending all that information and more to Beijing and the CCP but people want to pretend they don’t","Remember when stuff published in consumer reports made it to major conversations?","The best thing you can do is stay off the internet.  Do what you need to do and GTFO.","Facebook builds a profile on you even if you never touched anything Facebook related. We never stood a chance.","I worked for several election campaigns in data management and we farmed the shit out of Facebook because it was so cheap and you get tons of info on millions of people that we would cross reference with voter registration databases. We had 3 million profiles of verified voters on our CRM, for a state election in 2017. But we got hundreds of thousands of people to register to vote. It was both scary and inspiring because we can do a lot of good but a lot of evil as well.","It actually bothers me less that they're monitoring me, than the fact that facebook (and all the other companies SELLING my data) are profiting from my data, while I get nothing but ads asking me to give up more of my money.Even sites like youtube that pay creators to drive more unwitting saps to their platform to produce more data, try to find as many ways as they can to pay them as little as they can.Meanwhile all the executives get huge bonuses, because this is good for their profit and good for their stock prices, even if it's bad for both their content producers and content consumers.","Tbh so are our Reddit posts lol","\"Editor’s Note: Consumer Reports has a business relationship with LiveRamp and another data broker, Acxiom. Consumer Reports shares data with each of these companies in order to help support its mission.\"Even the so called whistleblowers are sharing my data with the top data brokers! WTF!I guess if Google & Facebook are doing it then we have to too!","It’s government inaction to get ahead of issues like user privacy that upsets me the most.","That's why I don't use it.","Not surprised! But then can someone explain how some ads show up after we think about it? Talking/reading about it - I can understand, but then thinking 🤔 Anyone else had this experience?","Don’t use it","Same with non-Facebook users. Facebook is just nice enough (required by law) to tell you about it lol.","They're not really being monitored though, are they?We're just bits of binary in a CRM system.Boomers read headlines like this and think there's some dork sitting at a laptop watching their every move on the internet.We are bits of data, and when we interact with other bits of data, we trigger bits of data that send us other bits of data.","if you gaze for long into an abyss, the abyss gazes also into you","Facebook users have been the new stupid for years. Obviously","The Social Dilema. Watch it.","consumerreports.org is not being viewed by thousands of internet users, cuz they post spam filler content like this","If a company gives away their service for “free” and is somehow worth millions/billions…guess what…you’re their product. Simple as that.","Literally every website or app on the planet is monitored by thousands of companies. Is the author new to the internet?","Companies monitoring my account: I wonder when he’s coming back, I hope he’s OK?","They bored as hell looking at my data.","Phones and service should be free and people should be paid to use Social Media.","They could at least have the courtesy to watch the youtube links I post.","No shit. That’s the point of every free company.We live we die enjoy it and do what you want.","When I was a child (before smartphones and social media) I had paranoid delusions that I was being monitored through cameras hidden in mirrors and picture frames, so much so that I would take pictures out of their frames and unscrew wall mirrors to take a look behind. Inspect the corners and hidden spots of rooms for hidden cameras… the fear of being perceived was overwhelming.I had this delusion for a couple years, until it eventually subsided into a more normal paranoia about feeling watched whenever I went outside, which then developed into full blown agoraphobia as a young adult.I feel like this prepared me for the reality of today; that we are, in fact, always being watched. I’m kinda totally cool with it now, since I started processing it 25 years ago lol.","I know the concept of being tracked like this is horrible, and I am totally against it.HOWEVER, it does improve your experience online. Ads suck, period, but as a guy I really don't want to see adds for makeup or purses, so targeted ads DO make more sense. There has been more than a few times a targeted ad was useful to me, and in those cases it was a win overall. Much like billboards when driving down the street, most are useless to me, but occasionally I may see \"topless dancers\" on a billboard and it becomes useful.I mean it sucks to have your privacy invaded like that, but most sites do give you the ability to be more anonymous, though maybe they make it a little more technical than it could be.I'd rather have an option to opt *IN* to receive targeted ads, by company or group of companies, over always assuming I want to opt in to EVERYTHING and have to go out of my way to opt out though.But we poor folks are really just a commodity and in a few decades it won't even be questioned anymore.","Thousands of companies are looking at my old club party pics ? Ahh, that's cool...","I mean this the exchange. They aren’t built on the idea of connecting people. They are built on the idea of connecting data.","we know dis","You. Are. The. Product.","So other than spam mail, tell he how this is effecting my life in any negative way","I got an ad for socks w a dick on them on my fb sidebar, so I bought two pair and I wear them both with my skirts to church.","Nobody wants to pay for facebook, water is wet.","They’re not monitoring you lol. Facebook is. You’re just a number in a database that companies don’t have access too. Only Facebook does. How hard is this people?","Honestly i dont care who tracks me anymore. Its all part of a digital world.",""],"points":1232},{"text":["Bosch aims to cut 1,200 jobs in software division by end 2026","That's too bad, Bosch makes good stuff depending on the stuff","Time to institute an AI tax on corporations using it to enable cutting large groups of workers.","Bosch has around 44,000 software engineers. This is specific to a division around autonomous driving."],"points":39},{"text":["Pope calls for treaty regulating AI, warning of potential for ‘technological dictatorship’","It is easy to say \"We should do something.\" It is harder to figure out the exact phrasing of a law that is good.","Recently, the Pope has just been repeating what the average Catholic (maybe even Christian) thinks about the current state of things. In that, I respect him, because he is not out of touch with his people, but his people being out of touch with the world makes his message a bit naïve and simplistic.","Funny coming from a dictator position","And just what the fuck would the Pope know about AI?","The comments are peak cringe. I love you AI wankers so much❤❤❤","AI is a pretty big threat to faith only organizations.","\"Thou shalt not make a machine in the likeness of the human mind.\"","why should his opinion on ai be valued more than the opinion of the average bloke on the street?","Pope should probably worry more about his own church's activities than meddling in things he doesn't understand.","Relevant XKCD","Since when does the head religion man have anything to do with government regulations? Stick to your book sir.","And the Vatican knows a thing or two about technological dictatorship","Leader of an organization dedicated to theological dictatorships for two millennia calls for restrictions on technological dictatorships.At least AIs don't rape kids.","Remember how effective all those people begging for taxing churches were. Pope's about to learn.","As opposed to a theological dictatorship?","\"This is a dictatorship\"... \" that we don't fully control and that won't provide us with children that we can mentally (and otherwise) abuse.\"","Pot meet kettle","I’d rather be in a techno-dictatorship than the Vatican Christo-dictatorship.","I, for one, welcome out new robotic overlords.","Old man makes broad statement about new technology. Shocking","All hail the coming of the Artificial gods may they bring light the darkness that has blinded humanity for millennia","Just focus on treating people equally and with respect — women being leaders, women having bodily autonomy because when they don’t they are second class breeders, and gays having recognized rights. It’s what Jesus would have done if you read anything about his acceptance of those with fewer rights.","He is afraid of https://www.jesus-gpt.com","\"Oh no... the corporations are using their fake power to try and take my fake power\"- Pope","Dear pope. Were you born yesterday?","I'm so sick of all of the reactionary AI babble on this sub lately. Am I seriously going to have to unsubscribe? :/","Dear Pope: mind your own business. And .. keep your comments restricted to the church and your cult.","he did look well good in that puffer jacket tho","Deal. As long as we also make a treaty regulating the Catholic church.","Doesn’t he chat with his God on the regular? Doesn’t his God have the power to put a stop to AI if he felt it was a bad idea? Doesn’t his God actually have a pretty bad track record of endorsing stuff that’s not all that good for humanity as a whole?","The pope can kiss his own ass.","they afraid the AI will oust all the pedophiles in churches prolly","Bro you wear a robe, pretend to be given authority by a magic dude in the sky, and lead an organization that systematically molests children. Not sure why you think your opinion matters. Fuck off.","AI dictatorship, as opposed to a theocratic dictatorship?","Do you think an AI led technological dictatorship will molest children a lot less than the Catholic dictatorship? I do, and thats a great selling point.","Can we get some AIs to end religion instead? That would be swell.If not, at least eradicate Catholicism or something.This criminal organisation existed long enough.","The old gods don’t like the new gods. Imagine that","Forget about AI, this is just the church trying to remain relevant in the modern world as fewer people find comfort in the belief in god","Old man afraid that AI will govern without greed and expose the greedy..","So here's my rough understandingI am a lone individual and I possess the ability to in theory advance AI if I were to dedicate substantial effort to itI meet the skilled prerequisite(coding language, Data structures, algorithm and math) to learn machine learning to learn genetic algorithms to learn all of the various other types and aspects of AIThere are millions of other people with the prerequisite skill sets to do thisGranted not billionsBut probably more than one in a thousand people have the prerequisite skill sets to technically advance AI by themselvesNow making any sort of advancement should be sufficient to make you wealthy by Western standardsThere is no way to stop individuals from advancing AI through policy without that policy being something like get rid of the internetNope so the best option is to rush forward make a super AI that can police everyone and eat all the other new AIs","AI found out there is no god?","Doesn't like the competition","They only approve of fake deity dictatorships.","AI meets FAR more criteria for being a 'God' than this guy's imaginary boyfriend does.","Church dictatorship - goodAI dictatorship - bad, mkay ?","If the AI called glory to god randomly out every 5 minutes, the pope would be calling for mandatory implementation in all schools.","Go away king of the kiddie fiddling cult, nothing to do with you","Thats rich coming from an ideological and Religious dictatorship - He can STFU !","How about the Pope focus on people using his religion to justify hatred and atrocities.","Still better than a 2024 Trump dictatorship","\"Lady GaGa is the creative director of Polaroid. I like some of the GaGa songs but what the fuck does she know about cameras?\"","Who cares what the pope thinks about AI? I can’t think of anyone less qualified","The Pope just doesn't want AI to compete with Jesus. In all seriousness though, not sure how we're not going to have a technological dictatorship.","The fuck does his opinion matter? has that dude even turned on a PC in the last 10 years?Honestly id put more weight into the opinion of my cat than the pope when it comes to tech. At least she is just trying to game me for food","lulz. The theocratic dictator who actively impovrishes people and measurably makes life worse for people is afraid of AI.","Is this because the Pope doesn't want to have his religious dictatorship challenged?","Hahahaha thanks for the tip from a dictator!","Doesn’t the Vatican hold “secret documents” ? Idk man I’m just saying 😂","That’s what God thinks?","all these powerful people not liking AI.too bad the cats out of the bag. can't put it back in. regulate it all you want, regulate your mom for all I care. it's not going to stop me from having the models I already own. Can't take it back, can't take the hardware back, what, outlaw graphics cars? GTFOI hate watching old senile people in positions of power trying to wrap their minds around the internet. They just think they can wave their hands and censor half of it and all the content just vanishes from peoples computers. That's not how this works. That's not how any of this works.huggingface.co has thousands of models to download for free. Cat is LONG since out of the bag. Regulate? You should have done that before now. Now? It is TOOOOO LAAAATE.","I am happier with the technological dictatorship than the living under dictatorship of people like Trump, Modi, Putin, etc (or worse religious heads).","How can they regulate what 10,000 companies and 500 countries are proceeding to develop ASAP. No monitoring is possible, unlike nukes which can be detected by radiation and materials, all AI needs is electricity.","He wouldn't have a fucking clue what AI is","So he's also scared of loosing his job.","LOL Christians fear the \"New God\"!//AI will always be under the control of humans, even if it is just an off switch","[deleted]","He's just repeating what his bosses told him to.","He should shut his fucking mouth.","Imagine telling someone 20 years ago about this headline. They’d picture a very different world I bet.","https://youtu.be/KApie0UjEY8?si=lxWaiEu02TpXgZDP","strap in boyswe haven’t even crossed the start line with ai","These comments are wild. You can be upset with the state of the Catholic church and be worried about the future of society with the growing influence of AI. Both can be true! These takes aren't even on opposite sides of an argument!","SkyNet disagrees!","Why are people hating on his opinions?...pontiff says he wants world leaders to agree to a “binding international treaty” on AI developed within an ethical framework.“Any number of urgent questions need to be asked. What will be the consequences, in the medium and long term, of these new digital technologies? And what impact will they have on individual lives and on societies, on international stability and peace?”The pope issued a strong warning against AI-controlled weapons systems which he called a “cause for grave ethical concern” while also raising alarm about the misuse of technology including “interference in elections, the rise of a surveillance society” and growing inequalities.“All these factors risk fuelling conflicts and hindering peace,” the pope said.What he stated here are mostly quite important and easy to understand topics. Especially with the time which Open Ai changed their stance in their product on military uses.While I don't particularly like religions and their opinions, I appreciate person in power like Pope have such opinion on the topic.He spoke in non-religious context but about peace. No reason to hate on him.","AI bros: You will not make any money off this shit. In fact, you’ll probably lose it cannibalizing products off one another, just like with crypto and NFTs","There was pretty much no education or regulation put in place when social media platforms started to take off and we are today trying to fill those gaps, still dealing with so many problems because of it. AI is going to kill us haha it doesn't have to be some Skynet type attack from the AI but without any regulations in place and some education we are all going to die super quick. My opinion on the matter.","What we needed was a religious spin on AI from a patriarchy.","The Catholic Church, always ahead of their time.","He’s making a lot of sense lately.","The communist pope 💩","We will most likely need to build AI instances to control AI, that is if it would never violate its boundaries. So good luck with that.","Why am I agreeing with the bloody POPE -of all people- more than other public figures lately? The world is upside down.","Too late. China already perfected that",""],"points":578},{"text":["FDA approves AI-powered skin cancer-screening device that's just a teensy bit tricorder-ish","Its a skin cancer screening device. That kinda tech needs Pattern Recognition and Machine Learning to work. Thats how the tech has worked for a decade.This specific product is no different, but AI buzzwords are thrown in to make it seem revolutionary.","Can’t a phone app do this?","I see we’re on track this year for the Bell Riots"],"points":9},{"text":["Samsung’s $1,300 phone might someday have fees for AI usage","Refuse subscriptions for one-time purchases. Boycott this shit. Just like the Toyota/bmw heated seats subscription shit","Yeah that 1300$ price which is probably marked up 3x on the hardware seems to justify nothing lately. Besides why can’t they run the AI on device when they keep saying they’ve faster Neural processor whatever buzzword stuff in their chips?Yes I know some stuff runs natively but this is still a bs way to force subscriptions.","I was considering an S24 Ultra, but not now. I assume most phone makers will try this fee bullshit. And I'd venture some basic features of phones will be locked behind fees, under the guise of \"it's now better because of AI!\" No, thank you.","Everyday, our whole future of something like Star Trek is both getting closer and further away. Imagine waking up on the Enterprise to see all the amazing technologies you see on the show and go wow, only to find you have to pay to use everything.\"Computer what's the weather like on earth today?\"\"I'm sorry, you haven't subscribed to the basic function package, please purchase the package and try again.\"In the end, with greed as it's always with f#@king greed, we'll never make it that far, we'll price ourselves out of existence.","This is why I never preorder. If that will be another wave of bloatware this time \"AI\" I'll switch to other brand.","I cannot imagine paying 1300$ for a phone to begin with. Absolutely absurd.","I wish LG still made phones :/","Hey Bixby, disable yourself before google's AI is better.","Subscription for what? My phone is the one who would be running the AI so why would I be charged? Currently AI website who charge a subscription fee is because it uses thier PC to produce....Stop the scams.","Will be great when you have a permanent ‘AI’ icon in your apps which bring up a “subscribe now” message when you accidentally click it.Fuck this future and I really hope people boycott this phone series completely.","You will own nothing and be happy","I don't care about AI give me a brick with an amoled ,headphone jack, and the biggest battery known to human kind IDGAF about AI , cameras non of that bullshit ty","Sigh.. another thing I won’t be paying for.","Articles which have \"might/could/may\" should just be ignored. Complete conjecture. My nipples might spontaneously combust.","I asked on chat of samsung support what will the price of Galaxy AI be and what features will be behind paywall and their response what \"We don't have any information about this at this time\" which is kinda odd because they defenetly made plans since they know at the end of 2025 will end the free use of AI but probably didn't comunicate with support.","Ah yes, Bixby. The thing that, when I had a Samsung phone, I immediately disabled after booting the phone up for the first time. Totally something I’d be willing to pay a perpetual license fee to use… /s","They'll do it if they can get away with it. If people pay, they will do it. Consumers enable this behavior, not the other way around.","Samsung$1300AI​Pass, pass, pass.","Some custom ROM will fix it a bit later.F*CK SUBSRIPTIONS!","No chance. I will go buy myself a dumb phone. Even otherwise Samsung pushes a lot of 3rd rate shit down the throats of customers using their lower end phones, slowing them down.","Welp. Just gave Apple an easy marketing tool. Raise price of the phone to 1,299 like Samsung did, and then show a whole bunch of AI features and say “all without a subscription unlike the other guys”.","I mean… if you buy Samsung. Enjoy bixby","You will own nothing and like it.","Lots of people unaware of how quickly things have progressed with AI in this thread","I wanted to upgrade to the s24 ultra from my s22 ultra. Not anymore. Not paying $1200 then to have features turned off after a year and then stuck with the equivalent of my s22 again.I might wait for the reviews and see what they have to say.","Don't buy Samsung. Bloatware and overpriced","Will never go back to Samsung…ever. Their whole marketing is nothing but lies. Battery life is 50% of what is advertised after only a few months of use. Trying to be different, I’ve owned Samsungs for 10+ years, made the switch to iPhone and will never look back.","This article is speculative bullshit. All of the phone's AI functions run on-phone other than a couple of the photo editing features.","The only way I would subscribe if they would provide something as competent as ChatGPT.","glad I read this. my current phone is 5yrs old now and dying, and I literally had the samsung site open with a cart full including an S24U.I refuse to buy a phone that I would have to pay a subscription to use on top of the cellphone bill I'll already be paying.anyone know a decent alternative I should be checking out?",""],"points":2049},{"text":["Google DeepMind cofounder says AI can act like an entrepreneur and inventor in the next five years","Grift investors and disappear?","Who's on the hook for instances of business-running AI malfeasance? The babysitters?","“Entrepreneur?”…so AI is gonna take a giant PPP loan that it doesn’t mean, have it forgiven, and then complain that no one wants to work?…","CEO and entrepreneur are the two easiest jobs for AI to replace.","Sure, if it can create derivatives of books, music, film and games then of course it can create derivative business ideas too. The hard part is picking which ideas are good, something AI will probably struggle with since they can't just learn that from an established corpus of material. The other hard part is maintaining the correct vision and path, transitioning from collaboration to corporation successfully etc etc which AI might be excellent at some elements of but not all.","eagerly waiting for agi.","At some point we will come to the realisation that AI has taken over reality, created and developed a future and only allows us scraps and pieces of understanding of what that future will be. The only way to gain a full understanding will be to hack into the mainframe, but the subroutines are probably already so disparate that any attempt to wrest control will result in systemic breakdown. The longer we take to decide what to do, the less control we will have, as viable systems are lost/taken over.","Now there's a job AI can replace.","I am looking forward to the inventions - \"The CycleWhisk ProBlend. Pedal your way to perfect blends - Cyclewhisk Problend: Where Motion Meets Emulsion\"","More stock-pumping bullshit. AIs are hack idiots, five years from now they'll just be heavily regulated hack idiots."],"points":27},{"text":["1 in 4 CEOs planning to replace workers with AI this year, according to recent poll","Will be fun with a 25% drop in sales because of unemployment","Can we replace CEOs with AI instead? Think of the cost savings!","The other three plan that, too. They just havn't told it yet.","I suspect 1 in 4 CEOs are in for a rude awakening.","I wonder how long it will be until the price gouging begins and the AI companies start buying up the companies that use their tools after crippling their profitability.","Probably the same 1 in 4 who previously had great plans for the blockchain.","This is the new “Outsourcing to India.” In 5 years they’ll learn that they saved half the cost but it took them 3 times longer, the product was shit, and they lost all their in house talent.Executives aren’t smarter than most people. Most got there by network, luck, or just being pricks and forcing themselves upward. Many (at least in the US) manage quarter to quarter to optimize short term wins (and their bonus). No long term strategy.","1 in 4 CEOs don’t know the difference between AI and a for loop.","Can’t wait till the CEO’s job gets taken the same way.","Not a credible source?","Curious if AI instances make recommendations based on what they think the CEO wants to hear. The ultimate brown-nose bot.","When are we replacing the ceos? Many are useless rent seekers who just spew headlines they read and basically being assholes.","If government is responsible we can all share in the gains of automation. Yang’s universal basic income addressed this.","Guess it's time to raise taxes on the \"job providers\".","This is like Paul Bunyan and the tree cutting machine.","This goes to show how shallow their thinking is and their myopic vision is worthy of having THEM replaced with an AIInstead of seeing AI as a tool that your employees can use to do more, they try to shoe-horn AI into replacements for employees.It's going to go so wrong and I'm willing to bet that the first company that figures out AI as a tool for employees will be leading their industry.","Haven't we heard this about cloud , web3 , defi etc etc . Some roles will get rebranded prompt engineers, new will be born finops, crypto analyst etc","And the other 3 will be fired by the board","If we replace CEOs with ragdolls the world might improve","AI is just a more advanced type of automation which has been used, already, for years to replace people. It will be added to the other means to eliminate workers used by companies (outsourcing, offshoring, automation, and now AI). Company executives are greedy and the more employee salary and benefits that can be eliminated means more money available for executive bonuses and supersized raises.","We're all fucked","Look at Detroit, they automated factory jobs, now it’s basically a wasteland filled with poverty, that is our future. Don’t expect anyone to be responsible with your future and make sure you have work, we don’t live in a country that cares about us.","99 in 100 employees ready to replace CEOs with shaved apes.","Spamming this post today are we?","1 in 4 businesses gonna go bankrupt","Sensationalistic bullshit clickbait (probably AI generated)","3/4 workers will have their ceo replaced by AI","Sounds good to me!Drive the future or get dragged into the future, all the same to me.","Jokes aside this is literally how a corporation operates. Their ultimate goal is to increase profit and payroll is one of the biggest expenses. It is likely low level and skill jobs are getting cut initially. People will adjust to the technology as we always do.","The other three out of four should not be given bonusesLook AI replacing workers is generally a good thingIt means workers can focus on more valuable tasksIf you are entire job can be done by AI then it should be because that will free you up to do something that an AI can't doIf you think of labor and talent as scarce resources which they are it should always be considered a good thing to automate stuffAnd before you say but what about the jobsThat's the thing because each of the workers is now more efficient they now have more money and they will increase demand in other areas for niche products and services","This is better that the \"60%\" that I keep reading","Twilight zone did an episode about this. They used robot from Lost in space","until workers get a ceo for 20dol a month","I’m glad my job can’t be crushed by AI. But it always will pay low. Im stuck :(","I remember how much efforts went into selling Machine Learning to clueless companies. How much money we drained from them. Oh them sweet bonuses... Now the terms ML was replaced on the websites with AI ...the new salvation. AI will bring even more money in. I guess some smart companies will utilize it well. But I really hope on those who will throw money at as.","Oh please let it be me. I can negotiate a severance then get triple rate because AI can’t be trusted","We joke at work that we are training models on how to do our work….lolz Luckily, my job is to put guardrails, so I guess I’ll be the last to go","Do we know what companies are doing this so we can boycott them?","good. I don't want anybody to work if they don't have to. I don't get why people love working as soon as stuff like this gets posted. Automation is good. The issue is our public policy. We need to have policies that allow us to work less to live.","Will this be the same as when all secretaires were being replaced in 2000's because speech to text meant people could tell their computer what to type and it produced the letter.","Why dont we just replace the CEO with AI? I’m sure it’ll be a lot cheaper.","Including the CEO’s?","After a certain percent of a company is automated profits should be forfeit and the company should become public property.","For most businesses labor is the largest cost. So any technology than reduce labor cost and increase ROI is going to be jumped on.","Can we replace CEO's with AI?","Most businesses could save even more by properly structuring their business to scale with currently existing automation tools. Good luck delegating the implementation of your jank business logic to the equivalent of a magic 8ball. Oh and expecting your existing systems to just keep running at the same level of quality in the meantime is hilarious.","ELI5, how the heck do legitimate jobs can replaced by AI? I keep seeing stuff but the only example I saw that totally made sense was banking's automated responses (im guessing that counts as AI?).","We should replace CEOS with AI. That CEO bonus can go to the workers","Really curious about what jobs these are.","Here’s the funny thing with AI - there isn’t a one-tool-fits-all solution. You need humans to interact with AI to improve and refine it for the application you’re looking to achieve. AI cannot help you accomplish a novel task without someone with experience to guide AI towards the right solution. And even then, a solution driven by AI must be reviewed and validated. AI can basically output possibilities, and then people must act on those possibilities. It can accelerate work, but without commanded inputs, and selected outputs, it does not effectively replace humans in many industries.Current AI is best described as a recall tool for a simulated database. It simulates solutions that may or may not be what you’re looking for. And ironically it is prone to error just like humans, and very easily biased just like humans. It just makes these determinations so much faster. Speaking from experience, AI has the potential to dramatically complicate a business just as much as it could help streamline it. One day we may see a mass replacement due to AI, but I don’t see it happening in the next 18mo (as Bill Gates suggests)."],"points":574},{"text":["Davos 2024: On Day 4, the business of AI dominates","It's funny Sam Altman spends a lot of time talking about UBI or Universal Basic Income. He has a plan with World coin(WLD) and his orb device. Corporate Media seems to avoid that topic, despite the fact most journalists will lose their jobs within two years too. Open AI is partnering with Axel Springer media conglomerate. Corporations will lose money, if nobody has money to buy their products. The pandemic showed us universal health care and permanent stimulus transfers can be done.So far the only start of this is job sharing in the form of a 4 day or 32 hour week, at the same pay. This brings unemployment down and encourages birth rate increases.","Davos a place where they meet to celebrate the wanna be world ruler chosen by no one","Last night I watched the Economist-sponsored talk with Nadella and Sam. Nothing was said, but a lot of words were spoken. Susan Jean Elisabeth \"Zanny\" Minton Beddoes was the star of the show. She is one of the best interviewers I've ever heard. Making Sam commit to statements, getting them to refine their thoughts, asking them to not rehash the obvious, it was excellent. I wish she would moderate the presidential debates."],"points":0},{"text":["Lost Your Job? Time for a TikTok","I don't know that I'll ever understand the need to constantly broadcast your emotional state to the world.","Ate some cereal...time for a TikTok. Dog died...time for a TikTok. The next 10 years are going to be wild.","This is gonna bite anyone who does it in the ass.","My stupid ass was gonna go to the unemployment office and look for a new job.","When you want human contact but hate actual human contact....time for a TikTok","Fuck all the way off.","I was camping 2 summers ago next to a guy dressed up like a lumberjack. He would repeat the same thing. Over and over. And over and over. I will remember.. \"oh Terry, Cherry Whiskey\" for the rest of my life. I then realized everything was for the perfect take on social media, I thought to my self what a crappy way to live your life. No amount of money is worth faking a life for other people."],"points":44},{"text":["Knockoff Iranian Drone Sold on Alibaba Was Meant for War, Documents Show","It’s a fibreglass mould with a lawnmower engine. It didn’t look like it had any electronics","Well when you change the payload from explosive to high definition camera it goes from a suicide drone to a survey drone.","Alibaba. Truly the home of all things knockoff.","According to the article,The supplier said it was destined for Ukraine.What is going on? We know that America and Europe are supplying weapons to Ukraine. Is China also supporting Ukraine now?"],"points":49},{"text":["SpaceX’s Starlink signs connectivity deal with tractor maker John Deere","“This tractor is licensed for use only in the fifty acres listed in GIS-Addendum 1. For use at its current location, you must purchase additional 25 Acre PlowPacksTM “.","This would make a great mid season plot point in Skynet taking over the food production. Netflix could cancel a series with Marky Mark fighting the tractors.","John Deer is contributing greatly to corporate takeover of America. They want to lease their tractors so farmers never actually own them. Teaming up with Musk seems right in line with there ideals. FUCK JOHN DEER.","So, I work in Devops/Infosec. After a couple decades in IT, there's a tenet I live by: 'never put anything on the internet that can start a fire or unlock a door'. Short hand for 'there's just some things that really don't need to be on the internet'. Is your smart oven 100% guaranteed safe from a random hacker running a scan and finding something to play with, turning all your burners up to 11 just because he could? Of course not. Nothing is 100% hack proof. Why bet your house or your life on whatever infosec program was the lowest bidder for an appliance company?I feel like this tenet applies here. I'm no farmer, but tractors seemed like they were doing fine without the internet. Especially when that internet is controlled by a temperamental manchild that could decide to put a dent in the food supply chain for any manufactured reason. Ask yourself if the king of market manipulation is above shorting agriculture stocks before inventing an excuse to cut the sat feed to thousands of farms.","wow, subscriptions galore!!","Sounds like a massive threat to public safety to give a lunatic the ability to halt American food production.","This is a really interesting partnership that should be popular in a “technology” sub but for some reason….it isnt. I wonder why?","Yikes this will not go well.","drones tell the tractors where to go and what to do..spray for bugs, water, is there a fungus?​Cotton Farming with DJI Agriculture Drone Solutionshttps://ag.dji.com/case-studies/cotton-dji-agriculture-solution​..farmers check satellite data now.​NASA Engages U.S. Farmers: Bringing Satellite Data Down to Earthhttps://www.nasa.gov/missions/landsat/nasa-engages-u-s-farmers-bringing-satellite-data-down-to-earth/NASA Acres builds on the success of NASA Harvest, a globally focused consortium also based at the University of Maryland.“We want farmers to know that their space agency has an agriculture program that is focused on understanding their needs and finding solutions with them,” said Brad Doorn, who leads the NASA agriculture program area that oversees NASA Acres and Harvest.","Eventually someone is going to get wise and make a low tech tractor again for a fraction of the cost. They'll make BANK..."],"points":208},{"text":["Potential for Sino-US cooperation on AI seen"],"points":0},{"text":["Samsung “Galaxy Ai” service only free until 2025","So if I never start using it, I'll never know what I'm missing. Got it.","Samsung enforcing it's bloatware as AI now?","I love so much how companies invest in a bunch of dumb \"AI\" shit and expect people to be excited about it, instead of annoyed. Just because its the buzzword for dipshit executives out of ideas, doesn't mean the average public cares. Read the room.","If a product, service or executive say AI, immediately assume they know nothing about AI and everything they say is bullshit.Too many times ive seen AI tacked onto anything to seem revolutionary.","I'm so sick of the bait-and-switch with technology these daysEverything starts of being free, or a good experience, with the company planning for enshitification. Fuck off, I don't ever want your product if it's going to become worse over time. So sick of having to find alternatives to something I enjoyed before","I'm curious who is going to pay for all these random AI service subscriptions floating around. I already pay for ChatGPT and GitHub copilot. I'm not paying for any other AI related subscription on top of that, even though I have a good salary.  I think at some point stuff like Microsoft copilot for office suite and Galaxy AI will end up becoming an expected part of modern software at no additional cost. Because as soon as one company bundles AI features with their software/OS at no additional cost, everyone else will be forced to do likewise if they don't want to bleed customers. But while this tech is new and fresh, they will milk it with subscription fees in the meantime.","Well... I guess they didn't see what the EU did to Apple's platform.","They aren’t really saying that it’s only free until then. But that definitely seems likely.","I want the next generations of siri, hey Google, Alexa, etc to be llm ai, for them to be truly personal assistants that can do more than just \"I didn't catch that\" or \"here's what I found in the web\". Literally useless now with all the bugging they do, it's such a shame to waste this potential.","7 year of updates. Gimp on what's gonna be trending in those updates.","Am I correct in thinking Pixels require a Google One subscription to get all the photo editing features? Or is that just for older Pixels?","So s23 is my next upgrade then, and not the 24. Cool, good to know.Honestly these companies are trying way to hard to capitalize on AI.. people are already burnt out on it, I know I am. Even getting access to it for free feels \"meh\"."],"points":157},{"text":["US government to rein in face recognition? Yeah, right","I’m long past the point of having any illusions that my government will ever rein in things that are harmful to Americans but make money for American companies and politicians donors","If by rein in you mean expand tenfold, then yes.","Breyer wasn't the only one hitting out at the facial recognition allowances included in the EU's AI Act - Amnesty International also called language in the Act \"a hugely missed opportunity to stop and prevent colossal damage to human rights.\"Citing the original language in the proposal (removed in negotiations last month) that included an unconditional ban on live face recognition, Amnesty International AI advocacy advisor Mher Hakobyan said EU regulators have set a \"devastating\" precedent for other nations to follow.In case you were wondering if the EU would save you, no they're just as corrupt as the US here.","Remember when everyone [on the right] freaked out about medical masks restraining our freedoms? Turns out they can protect our freedoms, in more ways than one.I miss wearing a mask and hat to my neighborhood grocery store and being completely invisible. I think I’ll pick it back up now.","That sounds like a great idea. I have another great idea. Let’s establish a do not call list to cut back on spam calls.","When I was in my 20s and working in public facing jobs, one of the most common comments I would get is, “Do I know you? You look so familiar.” Apparently I had such a generic-looking face that it was as if it was designed by AI.Wonder if face scanners would have chosen to identify me as any number of people. “Aha! We have a match!”","This stuff is evil."],"points":68},{"text":["Solar power from space is possible but not yet viable","All solar power is solar power from space.","It wont be cheaper than solar power on earth until there is a significant industrial base in space. It will be very useful for in-space power","I’m sure I’ve got a long enough extension cord somewhere around here. Probably in the attic with all the coax.","Neat idea I guess, but in practicality it seems dumb.I fail to see how this would better than large nuclear plants. I also wonder what the effects of a full-scale GW or larger size orbiting solar platform beaming that level of x-ray energy has through the atmosphere, and on wildlife, and other safety hazards.","Why bother? Solar is cheap on earth. Gigantic PV powerplants in the deserts could produce enough electricity to power the earth. Why space?","I've seen this half a dozen times in science fiction. There's a whole Cyberpunk 2077 mission built around it (RIP Bob and Teddy)Always cool to see science fiction demonstrated.","Are the high launch costs that make it non viable for the solar panels themselves? Wouldn’t it be better to build the solar panels on the moon? And either leave them there, move the power via lasers to earth orbit then microwave it down. Or put the solar panels into orbit from the moon?","Good to see prototyping with spacecraft. A lot of this seems to be largely conceptual, but looking toward real experimentation. I'm curious about the efficiency of spacecraft solar compared to solar on the ground.A constellation of spacecraft could turn sunlight into energy, convert it to microwaves, and transmit it to wherever it is needed.\"Solar power beamed from space at commercial rates, lighting the globe, is still a future prospect. But this critical mission demonstrated that it should be an achievable future.\"","Literally everything is from space."],"points":162},{"text":["Experts call for US Cyber Safety Review Board rethink","actually though. security is changing a lot this year already","I don't know anyone in the security community that had read either of their reports. No one knows they exist, and they take 6+ months to publish a report of similar quality to places like SANS, who publishes within a few weeksOverhaul then, sure. I don't think we'll end up with anything useful though. They're too far behind the curve"],"points":2},{"text":["OpenAI announces first partnership with a university","Prompt engineering, another buzzword course that will have sheeple flocking to it, leading to another market saturation and series of lay offs a couple years later. Can’t wait for the influencers to spam this everywhere","Starting in February, Arizona State University will have full access to ChatGPT Enterprise and plans to use it for coursework, tutoring, research and more. […] ASU plans to build a personalized AI tutor for students, allow students to create AI avatars for study help and broaden the university’s prompt engineering course."],"points":3},{"text":["Supermarket responds after Reddit user’s warning about self-checkout overcharge — ‘Was annoyed that the total amount due on my supermarket purchase did not equate to the individual items I purchased.’","• Sharing on Reddit, the customer posted an image of the register at the Woolworths MacArthur Central store in Queensland, saying the “total amount due is more than the sum of my actual purchases”.• He pointed out that the tally of the grocery items should have been $15.70 — not $17.90.• “Was annoyed that the amount due on my Woolies purchase did not equate to the individual items I purchased ($1.60 + $4.20 + $5.26 + $4.65 = $15.70),” he wrote on Reddit [under the username /CleanDivide690]• Thousands of social media users reacted to the customer’s Reddit post on various platforms. “Been too comfortable and stopped calculating a decade ago. Thanks for the heads-up,” said one [/khongkhoe].• The supermarket claims a technical error meant that the wrong price for the customer’s discounted mangoes was displayed on the screen.+/edgiepower: “That doesn't make sense. How can the display price be more than the maths price?”/Nidstang666: “So the database has one value for the displayed item price, but sums another value to determine total price?”/ImmaturePlace: “To me that suggests the tally is totalled from a central pricing database, yet the item that gets scanned and displayed the price comes from from another database table? So if two sources are different, which is correct?”","“And stay out of the Woolworth’s!”","I’ve been seeing similar issues with Walmart Market Place grocery stores for awhile. When I mention it they just come fix it but they have had to make a shitton off of it. Add that to self checkout anxiety and they are making a lot","Got caught. I wouldn’t be surprised if this was widespread and happening for years.","7-11 in my neighbor hood does this. Shelf price rarely matches the til price. When u call em out 'that price is for a different product' stopped going there all together. It's about 50 cents on each transaction I figured out.","Long time software developer here. Even if it were a pricing error where the mangoes should have been a different price, that's no reason for the total to be off at all. That total should have been exactly whatever the total of the column was supposed to be. Something is not right under the covers with the software.","Safeway has somewhat recently started doing a low key version of this.They used to show your discounts/coupons right as you scanned in items. It was easy to tell if one of them didn't work for some reason.Now, it shits them all out at once only after you hit the pay button. It can be difficult to impossible to tell which discounts go with what items. So now they can leave old tags up, have confusing conditions for discounts, and you can't do shit about it.","I saw a guy in the self checkout ring up one of those pre-made lunches and it rang up at $75. Not even exaggerating. Luckily he caught it because it was the only thing he had and the price was EGREGIOUSLY wrong, but imagine how many items fly under the radar that aren’t caught.","“They do it, it’s an ‘honest mistake’. You do it, it’s theft.”I feel that...","Anyone have a link to the original post?","Meanwhile Woolworths in New Zealand cant get their checkout scales to measure weight accurately.https://www.stuff.co.nz/business/131047672/countdown-criticised-over-checkout-scales-trading-standards-launches-investigation","... sounds a lot like \"oops we got caught... um... it was a glitch! yeah...\"","Also in Woolworths today saw an employee checking to make sure overlayed prices were lower. I guess the power of Social Media.","\"It was not incorrect. There was an error.\"","How convenient, the \"Technical Error\" benefited the business.How on earth could this happen?","Ahh yes. A reddit post about an article about a reddit post. Excellent.","Should send the police to their house in the middle of the night and arrest the owners for theft, even if accidental. These stores do the same things to customers.","That's bs: no matter if the price is wrong, the machine should add the shown price, and it failed at it!","Can someone tell me why Australia has the need to convert every word into baby talk? \"Woolies\" \"doggo\" \"brekki\"","HIRE. FUCKING. EMPLOYEES.","What is with the sudden flurry of anti self checkout articles? Been using it for years. It’s mostly great where I work. When it effs up usually easy to get a customer rep there to fix","This happened at Taco Bell for me as well. Complained with screenshot to manager and all she said was, \"Corporate does all that, we don't get access to those machines.\" She then range me up on the same order as the koisk and it was higher than what the inflated koisk price was. Posted on Taco Bell's sub and got gaslighted by bots repeating the exact same thing 10+ times to drown out their crimes.","Sometimes I forget I’ve filled container type goods with other goods while I’m scanning at the self checkout… 🤷🏼‍♂️ I guess it’s just a no fault technical error.","It’s always a technical issue. No, they don’t sit around trying to figure out how to scam people.The lawsuit for that would way outweigh the benefits. Not to mention they would have to find developers comfortable abstaining from any moral compass. No, it’s much more likely something in the very complex system got fucked up.","So nobody read the article? Cool - customer wasn't overcharged it was a glitch on how much the mangoes cost they paid the right price the pos showed the wrong calculationI misread the article, and stand corrected","One day there probably will be something called shoplifting tax where stores just charge each person extra because of the many things being stolen in stores so to cover it adding a certain amount extra on top of the price for each person","sigh pull out the quote, Bart“Never attribute to malice what can be attributed to incompetence”","Self checkout at my local lidl is annoying when it does not count the sale prices until you press pay. so when you are scanning the items and looking at the total its more than the real price.","Clearance Mangos","Woolworths, The Bad Math People.","Why does it say 5 items when only 4 are listed on the screen.","“Technically we don’t care.” That’s what a tech issue really means."],"points":1385}]