[{"text":["Netflix, hungry for more growth, signals more price hikes"],"points":0},{"text":["I made a copyright free playlist for streamers to use (that's actually good - easymode.com)"],"points":0},{"text":["Ring is reportedly walking back its police-friendly stance on data sharing"],"points":0},{"text":["Man Jailed, Raped, and Beaten After False Facial Recognition Match, $10M Lawsuit Alleges","Police should be named in the lawsuit, too. Arresting someone for armed robbery should take more investigation than a pinky swear from a mall cop.","Pretty sure that still isnt enough $$.","Terrible what that innocent man went thru cuz some chumps got the wrong guy.On a different note, are all Vice’s articles this badly written?"],"points":3},{"text":["Alaska Airlines CEO: We found “many” loose bolts on our Max 9 planes following near-disaster — “My demand on Boeing is what are they going to do to improve their quality programs in-house.”","Maybe I’m just naïve but don’t the various airlines have their own in-house maintenance crews? Would they not be regularly checking for defects? Or were these incidents all involving planes that were “fresh from the factory” so to speak and thus the in-house maintenance crews would not have looked at them yet?","So when will someone at Boeing go to prison for putting peoples lives at risk in the name of cost cutting?","Alaska CEO Ben Minicucci spoke with NBC News senior correspondent Tom Costello:• The CEO of Alaska Airlines said new, in-house inspections of the carrier's Boeing 737 Max 9 planes in the wake of a near-disaster earlier this month revealed that “many” of the aircraft were found to have loose bolts.• In an exclusive interview with NBC News senior correspondent Tom Costello, Alaska Airlines CEO Ben Minicucci discussed the findings of his company’s inspections so far since the Jan. 5 incident, in which a panel on one of its Max 9 jets blew out midair on a flight carrying 177 people.• “I’m more than frustrated and disappointed,” he said. “I am angry. This happened to Alaska Airlines. It happened to our guests and happened to our people. And — my demand on Boeing is what are they going to do to improve their quality programs in-house.”• “We’re sending our audit people to audit their quality control systems and processes to make sure that every aircraft that comes off that production line, that comes to Alaska has the highest levels of excellence and quality,” he said.","Go right ahead and call me stupid, but doesn't this mean the blowout was probably NOT caused by a loose bolt? Otherwise we would have seen dozens.","Maybe, just maybe don't let Boeing self inspect airplanes? I mean, what are laws and government inspectors there for?","It’s also kinda freaky the airlines own mai tanner and I specific departments aren’t catching any of this"],"points":7},{"text":["Nearly half of job seekers using generative AI for resume help: survey","Good for them. That's how AI is supposed to be used: as a tool to enhance productivity.","I made a website today that will pull in a database of files, filter them based on some error handling and then gives me an interactive system for checking parts of these animation files.I don’t know how to program. I feel half is a very low estimate, maybe true but everyone should be using this and understanding it as they wood a calculator.","Good. Removes an unnecessary hoop through which a job seeker had to jump.","This was actually recommended to me by my therapist. It's a good idea, and it did make a difference for me last year. Input an extensive CV, then the job description. Generative AI outputs a relevant cover letter and updated CV to match the job. Then simply cut out and/or adjust the bullshit. For me, it made applying for jobs faster and improved the quality of the documents I was providing ie marginally better language, much better formatting, better word count.HR reps obviously couldn't tell because it certainly worked.","You kind of have to just to get through all the bullshit filters that throw out perfectly good resumes just for not having the right keyword in them.I had AI revise my cover letter and resume for my current job."],"points":6},{"text":["Apple aims to run AI models directly on iPhones, other devices","I like this in theory—the privacy aspect and seamless integration are obviously the biggest selling points. But the performance will lag behind dedicated GPU/TPU models day one and the gulf will only widen from there.So is this just for the very narrow use case of being a virtual assistant of sorts? Because otherwise this puts it in the same category as Siri: not as powerful or capable as its contemporaries and quickly cast aside in favor of third party offerings.","they could barely get siri to work leveraging their data centers"],"points":5},{"text":["Ring will no longer let local police publicly ask people for doorbell footage through its Neighbors app","The fact that this is a headline in 2024 indicates they’ve been doing this shit for decades and should be revolting.","I don't mind being asked for camera footage to help resolve a crime as long as I have the option to decline for whatever reason, which seems to have been the case. Not sure why people are all that upset about this tbh.","Now they get it without asking.","I don't let them see my ring. I tell them to take a good look into my peep hole.","This seems like a bad deal. The police can no longer request footage? Just slows them down.","Who are you to resist?!"],"points":71},{"text":["Netflix Is Doing Great, So It's Killing Off Its Cheapest Ad-Free Plan for Good","I think I'm just going to unsubscribe from all my subscriptions, regroup and then reevaluate if I miss any of them at all.","This is just \"cable for GenZ\" with extra steps. I'm never returning to that business model again(something Netflix doesn't seem to understand). Netflix has real competition now for high-end streaming content. I cancelled mine after the last price hike and I haven't missed it a single day. I already have more than enough content across Peacock, Max, and D+.Good luck to all of you planning on keeping Netflix. It's officially a race to the bottom now.","Either it has ads and costs nothing Or I pay and see no ads. I don't want cable again.","They got 13 million new subscribers just from the last quarter of 2023, we can complain all we want but more and more people are showing that theyre willing to pay more money for worse service and quality","Welp, back to TPB.","Oh, no! However will we, now, watch ad-free versions of Black Sails, Crossbones, Our Flag Means Death, One Piece, Treasure Island, Hook, The Goonies, Captain Blood, and Abbott and Costello Meet Captain Kidd?","“The company also didn’t rule out future price hikes, mentioning “we’ll occasionally ask our members to pay a little extra” for improvements to the streaming service.”","\"$15 a month? Who do you think I am, Scrooge McDuck?\"","Share price must go up. Enshittification is the way.","Cancelled last price hike. This is greed.","Good precedent for the other platforms and free of charge platforms. Bad for the consumer. As usual, they just let the consumer gripe for a few months before we move to something else","Dumped Netflix months ago, they are getting out of hand, to be honest, did it with the others also. Why people are still with them I'll never know. Feel bad for the really older generation, who don't know much with tech, these companies really suck them dry. Too expensive. Managed to Root my LG TV and repurposed the Netflix button on the remote to something of actual value.","Netflix would be more convincing that it's doing great if they did not need to constantly increase the price and lowered their number of cancellations to finish more of the series they start properly.Instead they are reporting doing great while cutting shows, staff and increasing fees... to... wait for it... prop up the share price and make them look good on paper.Not sure how that's going to work in Q1 2025 when they have run out of \"shared account crackdown\" related new account signups.","Bought Seinfeld dvd collection for $20 on marketplace just in time.","The second I see an ad on Netflix is the second I cancel my subscription. Same with prime at the end of this month ✌🏽","Bye bye netflix","That’s awesome I’m canceling my subscription!","I’m so glad I dumped Netflix. Tubi is free. So are other methods of streaming 🏴‍☠️ Amazon is getting dumped before I have to renew again","Took the playbook from Blockbuster eh? Literally canceling when I get home.","Way to go, streaming services! You managed to recreate cable.","Netflix might as well just change their slogan to \"Fuck it, you'll keep subscribing anyway.\" No matter what they do, their numbers just keep going up.Their next change could be the lowest tier has a guy that comes to your home and punches you in the face everytime you start a new episode and people will just go \"What am I supposed to do? Unsubscribe and NOT watch The Night Agent or Virgin River?\"","Just wait, I guarantee they are going to change policy and not allow us to sign up monthly. They are going to do “year long” subscriptions where we have to pay the full year upfront so we can’t subscribe for one month and drop it.","The Enshitification continues...","People keep giving them money 🤷🏽‍♂️","Netflix hired a moron for CEO who knows nothing about how tech companies work. He probably previously worked at cable tv companies and think that people will never cut subscriptions like in the 90s. Hire a 90s CEO, get a 90s company.","Ahoy Maties!A pirate life for me!","The cheapest plan sucked anyway. 720p in 2024 should be a crime","I simply don't use Netflix.Paramount+ with Sportsline & Showtime = $34 a yearPeacock = $20 a yearHulu = Free with T-MobileSamsung TV = FreeThen there's all the other Free stuff out there.","And I killed Netflix off for good. I just can’t support these constant prices hikes and password bans. This is all defeating the purpose of convenient streaming","Netflix sucks now!!!","Netflix WAS doing great","In going to drop them all, and just have one at a time. Binge stuff, then swap to someone else, then binge again.","Enshittification continues. I just canceled my SiriusXM sub, I can cancel my basic Netflix.","I dropped Netflix two years ago and I have not missed them one bit.","Yeah - I’ve had it with subscription greediness too. It’s time to just cancel them all, and spend time more productively.","“Since this plane has been flying so well, that means we can shut off the engines! We’ll save so much fuel that way”","I’m having trouble thinking of anything I’m excited to watch on Netflix. And I’m realizing I haven’t clicked on that logo in a long ass time. I think I’ll unsubscribe from most things except for Hulu.","I don’t like how we’re in the dark timeline where streaming has turned into cable with extra steps.","Streaming services are quickly becoming too much like cable. Im at the point where I'm just going to watch all my shit on those free websites.","I dropped Netflix a few months back. I wouldn't even remember they existed if it weren't for this meddling button on my remote.","Just keep it up. My Plex library is growing by the day.","My Plex library grows stronger by the day. 🏴‍☠️🦜","This is why I never left the high seas","Time to sail the high seas arrrrr","Articles like this really show that places like Reddit and to a lesser extent now (due to less people on it) Twitter are not indicative of real life. Facebook is probably more like real life than Reddit or Twitter are.","I won't watch with ads, period. If the base ad-free tier is worth it, I might use it, but it probably won't be. I'd rather watch no TV at all than watch ads.","Thanks for the reminder to cancel my subscription","Infinite growth fallacy strikes again. Can investors start just doing their fucking job instead of this “make green line go up forever” bullshit?It’s insane to me that non-dividend paying stocks are normalized now.","I wonder what the conversion rate will be of the users on the cheapest ad-free plan. What percentage of them will just cut off Netflix instead of moving up or down a tier?I mean, I'll probably just cut it off instead of playing along with whatever nonsense this is, but I know a lot of their customers won't care as much and will just deal with it. Personally I don't use it enough to justify paying more for it and I also refuse to pay for a service where I'm also wasting my time by watching ads.","They are getting rid of \"Basic\". They already removed Basic as an option for new customers in the UK and US in 2023, but allowed current subscribers to keep it. They are planning in June (apparently) to remove Basic and move the grandfathered people either to Standard (which will still exist) or the ad-supported plan.The \"Basic\" plan allows for streaming on a single device in a max of 720p quality. If you're able to watch on more than 1 screen and/or are getting 1080p quality or higher, you're already on one of the other plans.Ad-supported \"Basic\" looks to be \"Standard with ads\".","Those who understand business know this was on the roadmap likely from day 1 pending a read out of how the ad supported tier launch was doing.","My torretleech account is still on good standing w/ some invites. I'm ready for the end","It's funny to see how on the internet everyone and their mom is saying how they will all unsubscribe, but Netflixs stock price jumped up over 12% in 24 hours because of how great its doing compared to all the other services.Goes to show you how small the vocal minority really is.","I’ll cancel Netflix the instant they raise my money for a non ad subscription. I barely watch them. Same goes for Hulu. Done.","Cancelled it two months ago. No loss. The only thing I subscribe to anymore is ad free yt.","I actually can't wait for this. Not because I like it but because my wife said last time if they raise prices again I can finally cancel netflix.","Cancelled Netflix 6 months ago (after being a customer for 15 YEARS) and haven’t missed it once. Their content is really going downhill and with the price just going up it’s not interesting to me.","I’m not sure how…their content is stale and Netflix shows/ movies are overwhelmingly poor quality. I’m about ready to dump my subscription","Time to drop Netflix. Disney+ and Prime, for me, I guess.","I didn't know people actually used the 720p plan","I have had netflix for free for a few years now (i get it as a bonus with my phone bill), and have enjoyed it. Now that the cheapest plan is going to be ad-supported, t-mobile warned that it is changing my netflix sub to have ads.Fuck you, netflix, for making this possible.","I have the ad plan and haven't actually gotten an ad for a few months","vpn + stremio","I have a bunch of streaming services. I am happy to unsubscribe if any start fucking up. If I want to watch something I will just sign up for a month and then cancel again.","Didnt they just introduce this plan level?","That's what being a submissive consumer gets you, a massive corporate dildo up the wazoo.","I'm going to guess at what happens next:They do price increases, AGAIN.Piracy continues to ramp up as people decide the juice isn't worth the squeeze.Subs drop, they sling a bunch of money trying to fight piracy like morons.Rinse and repeat.","I keep a list of upcoming shows and movies I'm interested in seeing. There's been mighty little from Netflix on that list, and nothing that I couldn't live without. I've already switched to ad-supported subscription, but if they raise the price, that's it for Netflix, I'll be cancelling.","Everyone that said \"I wish every service would just put everything on Netflix\", this is the result. More services are licensing their shows to Netflix and Netflix needs to raise prices to pay for those shows. Nothing is ever truly \"free\".","Well, that's going to be the end for me. I was barely watching it anyway. Too bad. They were pretty cool once. (I go back to the DVD rental days with them, although not continuous.)If I want a shtty video experience, I can just watch that freevie thing included with Prime Video, which, of course I get free as part of Amazon Prime, which I would pay for anyway as a part of critical supply infrastructure.See ya, Netflix.","They wanna live off their surplus and cut their losses seeing if they can withstand a hemorrhage of users and also profit.","WWE is expensive","If it was just me I’d immediately cancel every sub after signing up and only resubscribe when I needed to use it again… I could probably cut my spend on streaming in half doing this.The problem is my wife watches a lot of TV, often in the middle of the night, and I don’t want to be woken up to restart subs.","I'm just trying to finish out one show, and I'm done with Netflix. I get all my good TV from Hulu and Discovery+. And even just those two run me like $27/mo","Buy physical media. OWN your collection of favorite movies and be amazed at how good disc based media looks on your 4k tv.Use Google Play or the Apple store if you want to rent something digitally for three-ish bucks.","it’s turning into cable goddamnit","If T-mobile wasn't giving me netflix with my phone plan, i wouldn't pay for it","Can't trust them to keep series going until a satisfying conclusion so there's really no point in maintaining a subscription to watch episodes as they drop. Just grab a month here and there and binge watch the entire show after it ends.","I mentioned this in a similar thread yesterday, which made sense. It'll be hard to actually make them change their minds. For my thoughts are basically for what few of us who are aware 100x more + people didn't even know such a thing was happening to begin with and just set their subscriptions to autobill.","I'm not sure who the target audience was for the standard definition plan they're eliminating anyway. I know it's popular to hate on the changes going on in the cheapest offer tiers, but the size of the userbase for these options is tiny by comparison. This does not impact most users.","In the not-too-distant future we will all be dropping streaming subscriptions ang going back to cable as we all go full circle with our viewing. Streaming services got us to cut the cord with their ad-free subscriptions and full seasons of series being available on the release date, but no more. Streaming services have become what cable was. Makes me mad and sad.","\"Hubris is rarely recognized until it has already killed the golden goose\" - Me.","So Netflix sent me that notification while watching a movie that were getting rid of my plan and asked me to choose the more expensive plan or downgrade to ad tier. I didnt make choice and the notification went away.Anyway it looks like I'm still being grandfathered in on the 11.99 standard plan. I can't find that price tier anywhere on their website. As soon as it goes up I'm cancelling.","Yarr fucking Harr...","Am the only one that thinks Netflix will irreversibly go so far down the drain that they might cease to exist much like what happened to Blockbuster?","What movie is the picture from?","Shiver me timbers, matey.","I hope people realize that Netflix is just a massive money laundering operation.That's why they give people enormous amounts of cash to make movies and do stand-up specials.","My wife and I presently only have Amazon Prime and Peacock. We got a year of Peacock for 20 dollars and we'd keep Amazon prime even if it didn't have streaming.","I thought this already like 6 months ago. This isn't news, cause I remember they were phasing out Basic Tier plan in Canada last year when cheap plan with ads was introduced.","I'll cancel when they tell me I can't have my low priced ad free tier anymore. I know they already phased it out for new customers. But when I can't have it anymore I'm gone.","I only have netflix and youtube but gonna cancel netflix too I think","\"Yo ho, yo ho, it's a pirates life for meeeee!\"","I’m dying for an excuse to shut this entire thing down so I welcome it… please add that so we can show you how quick things change","I could see this coming. The real test is when they get the balls to show ads in all their plans.",""],"points":2602},{"text":["EU fossil fuel CO2 emissions hit 60-year low","The European Union pumped out 8% less carbon dioxide from the fossil fuels it burned in 2023 than it did in 2022, the Guardian can reveal, pushing these emissions down to their lowest level in 60 years.The fall in planet-heating pollution is the steepest yearly drop on record behind 2020, when governments shuttered factories and grounded flights to stop the spread of Covid-19, according to analysis from the Centre for Research on Energy and Clean Air (Crea).","Meanwhile US, China, India ... continue to increase CO2 emissions, completely overwhelming the EU progress."],"points":1},{"text":["Boeing, not Spirit, mis-installed piece that blew off Alaska MAX 9 jet, industry source says","I don't quite understand how it could ever have been Spirit's fault when the stories covering this have stated pretty clearly that Boeing had to remove the door plug in order to install the interior after taking delivery from Spirit and then reinstall the door plug themselves afterwards.","Didn't we already know that the door plugs installed by Spirit were later removed by Boeing as part of Boeing's normal procedure, and then re-installed, but by Boeing?","Who knew that sorting your flights by airplane model would be on the 2024 bingo card.","I only fly Airbus as of lately. The FAA has got to stop letting Boeing self-regulate","Pulitzer alumnus Dominic Gates:• The fuselage panel that blew off an Alaska Airlines jet earlier this month was removed for repair then reinstalled improperly by Boeing mechanics on the Renton final assembly line, a person familiar with the details of the work told The Seattle Times.• If verified by the National Transportation Safety Board investigation, this would leave Boeing primarily at fault for the accident, rather than its supplier Spirit AeroSystems, which originally installed the panel into the 737 MAX 9 fuselage in Wichita, Kan.• Last week, an anonymous whistleblower — who appears to have access to Boeing’s manufacturing records of the work done assembling the specific Alaska Airlines jet that suffered the blowout — on an aviation website separately provided many additional details about how the door plug came to be removed and then mis-installed.• The self-described Boeing insider said company records show four bolts that prevent the door plug from sliding up off the door frame stop pads that take the pressurization loads in flight, “were not installed when Boeing delivered the airplane.” the whistleblower stated. “Our own records reflect this.”• The Seattle Times offered Boeing the opportunity to dispute the details in this story. Citing the ongoing investigation, Boeing declined to comment. Likewise, so did Spirit, the FAA, the Machinists union and the NTSB.","I have a best friend who assembles parts for spirit in Kansas. He told me all of management were on pins and fucking needles when the story broke.","Duh.Waiting for Boeing to issue an apology that make it sound like the pilot was to blame like they did in 2020 when the MAX had a defect that made it pitch and fall out the sky. At that point it was known that no pilots were notified of the problem and of they were they'd be screwed anyway. Boeing knew and told no one and then blamed the pilots.","Spirit is basicslly Boeing though.","Hey everyone Spirit AeroSystems is a subcontractor for Boeing and an entirely different organization than Spirit Airlineshttps://en.wikipedia.org/wiki/Spirit_AeroSystems(Aerospace company names often refer to a metaphysical ascent to the heavens)","Boeing needs to be scrutinized and held accountable, big time!","Even if Spirit installed it wrong. Final quality control is with Boeing. End of story","How could it ever Spirit's fault? Maybe Spirit did install the door wrong but Boeing has ultimate responsibility to ensure that the planes that bear their name are safe. Subbing the work out to someone else doesn't mean you're subbing responsibility for the work.","They need to open an investigation into Boeing if they haven’t already.","Yes, another win for Boeing!Wait, I’m getting some added context from my press department, this is in fact not good for Boeing. It’s the rare win for Spirit!How bad does it have to be for it to be positive news for Spirit airlines.","Alaska has a poor maintenance record. I’d say it’s more their fault than anyone else","[deleted]","Yeah like Boeing or any manufacturer would trust Spirit to do anything","The only thing Boeing managed to achieved was now flight scanners allow you to filter out their airplanes.Good job Boeing!","Boeing will ultimately blame foreign-born workers for this."],"points":353},{"text":["Former CEO of Google has been quietly working on a military startup for “suicide” attack drones.","WARNING! The link in question may require you to disable ad-blockers to see content. Though not required, please consider submitting an alternative source for this story.WARNING! Disabling your ad blocker may open you up to malware infections, malicious cookies and can expose you to unwanted tracker networks. PROCEED WITH CAUTION.Do not open any files which are automatically downloaded, and do not enter personal information on any page you do not trust. If you are concerned about tracking, consider opening the page in an incognito window, and verify that your browser is sending \"do not track\" requests.IF YOU ENCOUNTER ANY MALWARE, MALICIOUS TRACKERS, CLICKJACKING, OR REDIRECT LOOPS PLEASE MESSAGE THE /r/technology MODERATORS IMMEDIATELY.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","one step closer to slaughterbots","Don't be evil poor","It’s a called a missile. Literally what a missile does.","Do no evil... I guess? Maybe not anymore.","Is it bad that I see this and go “we didn’t have these already?”","So this fucknuts is worth 20 billion. I put myself in his shoes. What would I do? Build a hospital? Sounds good. Start a charitable foundation providing free school meals for kids? Great plan. Pay off a billion dollars of student loans in underserved communities? Sure.Start a business building flying murderbots? NOT on my list. Can any of these guys not turn into cartoon evil monsters?","https://gizmodo.com/former-google-ceo-white-stork-ai-kamikaze-drones-1851192331","Given how Ukraine as Russia are using suicide drones, this is no different that any other startup hoping for military contracts.And yes every military on earth is currently discussing suicide drones becoming a new reality of war.","That's all well in good but when are we going to get sharks with freaking lasers attached to their heads","will it shout \"god is great!!\" before it blows up?","Aren't these called \"missles\"?","\"suicide\" attack drones... Wouldn't that be a missile? I am guessing they want something slower, cheaper, that allows an operator to see what is going on.","How could we have guessed that THAT dude would want to make killer robots for money? Other than looking at his face one time, I mean.","Death & assassination by algorithm.","This is why we could never really fight back against an alien invasion. They would just send 1 trillion tiny seeker bots and wipe us all out in the few hours before we even really had a sense of what was happening and then just land.","Why \"White Stork\" instead of \"Arsenal of Freedom\"?","Black ops 2 becomes a reality next year","Eric is mostly working on banging every attractive woman between the ages of 20 and 40 and has been for the better part of two decades.","Can these guys just not go away? Go sailing, golfing, do something but try f/up life for the rest of us.","And we can all guess who will be first target of such tech.. \"Angel Has Fallen\" movie already showed something similar in the beginning scenes.","His motto: \"No, wait. Be evil.\"But seriously, they're just making slower, more controllable missiles/bombs.Drone: \"I can fly several hundred feet above a target and they can't see me or hear me. I'm under radar cover and I can just...hover here for hours until Osama bin Laden II comes out of his hole in the ground. I can identify that it's him with my tiny fiber optic camera and then just, like, be a bomb. I cost several thousands of dollars less to make than a cruise missile and can be operated by anybody that's ever played Call of Duty.\"A hellfire costs $150,000 to make and has to be deployed to an asset (like an Apache) to be fired at something. These will cost $15,000 and flown out of the Green Zone with what amounts to an Oculus and an Xbox controller.","Considering projects like 3D printed guns etc, I would be surprised if it won't became open source at some point. Welcome new world.","fucktedfaro vibes with this news lol","Eric Schmidt has been a POS for as long as I've known about him, 30+ years!","He’s been working so quietly on it that we all now know about it.","If these drones are going to Ukraine so they can defend their country I'm all for it.","Ukraine is destroying 10-25mil tanks with an rpg grenade zip tied to a cheap drone. And they’ve sunk. Or severely damaged modern navy ships with essentially toy RC boats with explosives on them.But. Like most things the genie is out of the bottle. And what was good for western forces fucking with Russia.Is now being used by palestian anti genocide forces against IDF targets.And it’s prob a matter Of time before terror groups start using these concepts","We could be using AI to make more efficient solar panels, better batteries by discovering new materials exploring space , anything but instead they continue to build missiles that can be used against powerless brown children because those missiles will never be shot at a super power like never , Coward ! they are pathetic losers that futures generation won't even bother to mention their pathetic existence !","CMV: We need the military and we need drones. There is just no getting around it.","Get over it Reddit commenters, there’s a market and a need for advanced FPV drones right now. One of the best defenses against fascist invaders, wish they weren’t necessary though.","He definitely didn’t learn the “do no harm” motto","There is good money in death","Well, they are needed.Imagine Ukraine defense.Not all military contractors are automatically evil.","He should test them on himself","We just kinda live in a world of bond villains but no bonds to stop them."],"points":319},{"text":["Disney Unveils the HoloTile Floor, Inching Us Closer to a Real-Life Holodeck","\"The HoloTile floor can also be an insert in a theatrical stage, allowing performers to move and dance in new ways, or stage props and structures to move around or appear to set themselves up.\"That actually sounds cooler to me than using it as a VR treadmill.","[deleted]","Still seems to struggle with the momentum problem that old treadmill style VR solutions used to run into."],"points":7},{"text":["The Mac turns 40: How Apple's rebel PC almost failed again and again","Soooo much disk swapping."],"points":2},{"text":["TikTok is laying off dozens of workers as the tech industry continues to shed jobs in the new year","Given that Tik-Tok employs 38,408 people. If it were to lay off 36, or 3 dozen, that would be about .09% of its workforce.","OMG dozens of workers!","Wasn't it nearly 4 years ago, companies were complaining no one wanted to work? Couldn't find people to fill positions? etc.?Now companies, not just TikTok are shedding staff, left and right.And people wonder why less people \"want\" to work, there's no point if you're on the chopping block every day, waiting for when, not if, you'll lose your job. Yet we're all expected to give a 2weeks notice if we're leaving. At least these announcements, like Tik Tok, is giving a heads up. Many other companies just do it and then it hits the news.There's no job loyalty, partially because of the workers, yes, but mostly because of the employers.Pay raises are less than inflation. Benefits, though optional, are a joke, or becomes a growing joke as the employers cheapen the options to be next to useless and/or useless and yet costly (health insurance).\"No burger flipper should make more than I, I went to college!\" Dude, if you're that dense, you're the one manipulated too, and you don't know it. You're paid below what you should be making, and you're basing your well earned pay on burger flippers? Check your position across the state/country.There's IT support and management staff in rural areas of the US are paid close to what Walmart Associates start at or lower. I kid you not. I could go 100% remote IT, and that's a hellscape of drama and stress, I'm not willing to deal with; it's 100% my choice and opinion, and I support those who do remote work. I do in person, some remote, and walk in IT support; I make less than Walmart Associates now, wasn't 10 years ago. Why haven't I gone back to Walmart? Ask them why they slowed or stopped hiring, app been in for nearing a year, updated monthly (I forgot in Dec, that's on me). I'm not the only one been waiting to hear back. There's now no other IT job in town unless I work for a corporation that's servicing people in town, but offices are miles away; nearest \"city\" is over an hour drive away, lol.","I remember the days when any time a company laid someone off, it didn't make the news unless it was a very significant amount of people or something else that made it noteworthy."],"points":20},{"text":["This tech can turn diesel semi-trucks into hybrids in just 5 minutes | Revoy’s new tech helps existing diesel trucks use batteries to cut emissions by as much as 80%.","Now do it for regular vehicles","Interesting idea but I expect they'll run into trouble when it comes to truck lengths. The US limits trucks on interstates to 74ft.","Should be a hoot to see them back into a tight dock...I'll start a YouTube channel for the backing-up shenanigans.","Press X to doubt","LOL, yeah, nah.","Shorter trailers incoming?","Never the eletric can have more Power than the old and good diesel engine","I've always wondered why they never made hybrid diesels. It's done wonders for train efficiency."],"points":10},{"text":["Nvidia, Microsoft, Google, and others partner with US government on AI research program","“By investing in AI research through the NAIRR pilot, the United States unleashes discovery and impact and bolsters its global competitiveness,” NSF director Sethuraman Panchanathan said in a statement.“To continue leading in AI research and development, we must create opportunities across the country to advance AI innovation and strengthen educational opportunities, empowering the nation to shape international standards and igniting economic growth,” he added."],"points":1},{"text":["Online retailer eBay is cutting 1,000 jobs. It’s the latest tech company to reduce its workforce"],"points":0},{"text":["Fujitsu bugs that sent innocent people to prison were known “from the start”","I have no desire to defend a company that makes bad products, but I feel like if I had to allocate blame, I'd place at least 70% of it on the UK Post Office and the management there.I'll quote another commenter from below the article on the site who made the argument:alexrdaviesI agree Fujitsu should be held to account, but the core problem here isn't buggy software. Most software has bugs in it, often important ones that give wrong answers, lead to data being stolen, or lead to sums not adding up.The problem is that, when the Post Office learned that their expensive software rollout wasn't working... they responded by accusing the people running the offices as fraud. When the people blamed the system, the Post Office investigators told them that no-one else had reported bugs like these. The investigators repeated those lines to hundreds of people over more than a decade - despite the investigations being run and reviewed by a relatively small group of people, who must have known those statements were untrue.Then the Post Office management took these people to court, and continued to lie, and got hundreds of them convicted of fraud based on evidence many of the Post Office investigators and management must have known to be untrue.The scandal isn't buggy software - it's the dishonest investigations and prosecutions, that appear to have started simply from being too embarrased to admit that a software rollout was an expensive mistake.Fujitsu should be held to account not for their lack of quality control, but rather for supporting these prosecutions and providing witness statements that they knew were misleadingly incomplete; for seeing what was happening and staying silent; for helping their customer get away with this when they had the knowledge to expose the Post Office management's lies.","Nobody with money and power will ever be prosecuted, no matter how egregious the crime.","Stealing chip designs from Crey to blackmail, Fujitsu has always been a shady company."],"points":30},{"text":["Taiwan EV battery maker ProLogium eyes mass production in France in 2027"],"points":0},{"text":["Reviewers begin testing GeForce RTX 4080 SUPER, first benchmarks spotted","Practically the same GPU as the OG 4080 but the $200 price cut is nice even without the nominal 5% performance boost."],"points":0},{"text":["Microsoft Hits $3 Trillion Value, Cementing Strength of AI Rally","Given the massive amount of speculative value AI is being given by investors, I question how effectively generative AI will be monetized. Given how cheap and easy it is to download run advanced models on personal computers, even on smartphones with AI chips, how is big tech supposed to monetize to compete with that?And if the value is coming from potentially replacing workers with AI, any massive disruption that comes from displacing that much value in labor historically brings a recession/depression along with it.We're due for a massive market correction once reality sets in and investors stop hallucinating.","Great! I own a few stocks in this company.","$MSFT P/E is 39 today. Can you say \"tech bubble\"?","I guess not innovating but buying other companies really paid off","If anything was cemented in the tech sector it would be the first time. Nortel was huge right up until it wasn’t."],"points":11},{"text":["Security researchers hacked a Tesla Modem and collected awards of $722,500 on the first day of Pwn2Own Automotive 2024","Just curious…Wouldn’t it be bigger news to have such an event and nothing was compromised?"],"points":0},{"text":["First Bipedal Robots With Hands Coming to BMW Factory | The luxury car brand has signed a deal to bring new forms of automation to its manufacturing process","Some key points below:The robots in question were designed by California robotics firm FigureAI and are described as being “general purpose”—meaning they can be used for any number of physical tasks. The bipedal bot, which is simply dubbed the “Figure 01,” stands 5'6\" tall, weighs 130 pounds, and has five-fingered hands that the company claims can be used to physically construct objects. On its YouTube channel, Figure has a video of the robot making coffee. Another video shows the bot swiftly walking across a room using its two sturdy legs.That said, it’s not entirely clear what the bots will actually be doing in this case. The related press release speaks of the “deployment of humanoid robots in an automotive manufacturing environment” and claims the robots will focus on “difficult, unsafe, or tedious tasks,” all of which sounds pretty vague.The press release further states that, as part of the first phase of the deal, the two companies will work together to “identify initial use cases to apply the Figure robots in automotive production.” Again, the wording here sorta makes it sound like both companies are a bit unclear on what the robots will actually be doing. After the two firms finally agree on what the Figure 01 can do, some of the bots will be deployed to one of BMW’s manufacturing facilities in Spartanburg, South Carolina....Tech companies throughout the world are currently in a race to churn out the first generation of “humanoid” robots. While robots have helped out in factories and warehouses for years, the human form factor of this newer iteration of robots is thought to have many added benefits for more complicated forms of industrial work. This has, of course, spurred concerns that the robots will (eventually) take a lot of human jobs. Figure’s CEO has claimed that his company has no interest in taking jobs away from people—which is, of course, what he would say.Wishy-washy press releases aside, from a technical perspective it will be interesting to see what these humanoid robots are capable of, especially in a more general sense; but from a social side it's clear that this has the potential to negatively impact the lives of many people."],"points":4},{"text":["I made a puzzle game where YOU design a puzzle and AI solves it. It turned out incredibly deep, challenging and fun! Check it out!"],"points":0},{"text":["Global power demand to surge but clean generation will keep up: IEA","Global electricity demand will grow at an accelerated rate over the next three years, but the additional demand will be covered by technologies that produce low-emissions electricity, according to a new report from the IEA.In its latest annual analysis of electricity market developments and policies, the IEA provides forecasts for demand, supply and carbon dioxide (CO2) emissions from the sector through 2026.The Electricity 2024 report found that global growth in electricity demand is projected to accelerate by an average annual rate of 3.4% from 2024 through 2026, and will do so after the growth rate had eased slightly to 2.2% in 2023 due to falling electricity consumption in advanced economies.","Will it though ? Really ?Because India is planning to reopen more than 100 coal mines.https://www.reuters.com/world/india/india-looking-boost-coal-output-by-up-100-mln-tonnes-reopen-closed-mines-2022-05-06/"],"points":0},{"text":["BLM Proposes 22 Million Acres of Public Lands for Solar Energy","My first thought was what does Black lives matters have to do with this…Bureau of Land Management for others like me.","Ok, hear me out. Use this for a true public utility option. No private firm gouging us, tax dollars used to pay for it and for upkeep and the energy produced is no cost to non-business consumers.And also no transmission charges by utilities. Legislate that.","From the article: In order to help the United States transition to renewable energy, the Department of the Interior has announced a new solar energy “roadmap,” including 22 million acres of public lands to expand solar energy development in the West, a press release from the Bureau of Land Management (BLM) said.The BLM also announced plans for the next steps on green energy projects in California, Nevada and Arizona with the potential for more than 1,700 megawatts (MW) of solar power generation and 1,300 MW of battery storage capacity.“Our public lands are playing a critical role in the clean energy transition – and the progress the Bureau of Land Management is announcing today on several clean energy projects across the West represents our continued momentum in achieving those goals,” said Tracy Stone-Manning, BLM director, in the press release. “Investing in clean and reliable renewable energy represents the BLM’s commitment to building a clean energy economy, tackling the climate crisis, promoting American energy security, and creating jobs in communities across the country.”The BLM, along with the U.S. National Renewable Energy Laboratory — part of the Department of Energy — have said 700,000 acres of public lands will need to be used for solar farms in the next two decades if the U.S. is to meet its net zero goal by 2035, Electrek reported.","Are they going to lease the land to energy companies or just give it away? You could get more direct to consumer if they offered more tax credits for home solar systems.","Comments reminding me of White Lotus S2","No, the other BLM","So a hair smaller than Rhode Island","My first thought was \"Where did Black Lives Matter get the money for that\".","This only works if there is a large power line nearby to get the electrical power to the cities.","How much land did we irradiate by all the nuclear testing we did?","Are there any way, technologically, to stack them upwards instead of using so much land?","Hail StormsNuff said","They're pushing that Critical Renewable-energy Theory again."],"points":217},{"text":["HP CEO Says They Brick Printers That Use Third-Party Ink Because of … Hackers","What a horrible excuse by them - maybe put a reasonably priced cartridge out and people would not be going to third parties. Nope you just want to scalp people with your pricing and using bricking as the means under the umbrella of security. This is why your shit printer sales are off.","If HP have made the ink cartridges into devices capable of storing 3rd party executable code then the fix should be obvious, they just need to return to dumb cartridges and no more security problem.","Further, with HP firmware updates becoming associated with printers suddenly not working, we've seen reports of users avoiding printer updates and encouraging others to do the same, which could result in users rejecting important security updates.An HP spokesperson declined to comment on these matters.Dynamic Security™","Brother products, all the way.","How about when they brick the printer with their own fucking ink? That was the last straw. New HP ink cartridge and now a non functional unit.","Having worked inside, it's much worse than this statement. They've been shedding employees for years. Almost every time they make a corporate announcement, it includes putting people on RIFs. Of course that leaves critical gaps in the workforce so it's hard to get anything approved/done \"oh that man/woman used to approve those but they're long gone\"Think of a helicopter that has lost power at altitude and is now auto rotating to try to land. It's not if it is going to crash, it's when.","I don't plan on ever buying another HP product in my life. I've had this policy for about 7 years. So far, so good. Got a Samsung laser printer, no issues ever.","So before the hacker can brick my printer, they do it for me? Gee thanks guys.This is the equivalent of your doctor shooting you through the head because you’ve a tumour growing your head that could maybe kill you someday anyway.","Why are they putting enough software and electronics in the cartridges to enable that? I have a printer from Epson that just takes ink in a flipping bottle. This isn't difficult.","They are so corrupt with their ink policies I would never buy from them.","Yes, and I won’t buy HP anything because of… HP.","They also want to get to a subscription based model for ink. Hahahaha! Good luck with that.","Don't buy anything from HP. Buy a Brother printer if you need a printer at all. You probably don't need to print color. A basic black and white laser printer from Brother isn't that expensive and is going to be much easier to maintain and more reliable than anything from HP.","I used to be a Staples employee, and it's crazy how big of a monopoly HP has on the inkjet market. Pretty much told anyone who wanted a seriously decent printer, to buy a laser printer. The ink cartridge margins for HP ink are absurd.","Plot twist: HP are the hackers","If they spent all that money for fearmorgering into product development, they'd have amazing products.On another note - cartridge hacking printer is non-issue when internet connected printers exist. Why would any hacker target cartridges, look into supply chains, distribution and hardware when printer just sits there... with unpatched security holes","Laughing in a ink tank printer","That's funny, my ink just ran out for writing cheques.","I wouldn't be shocked if the next move HP makes is sending all your printed documents to their servers for training AI.","I so rarely print anything at all that when I do I just go to my apartment work center, the library, or a shipping store. I haven’t owned a printer in 6-7 years and will never own one again because of the stupid subscription ink policies.","Who buys HP printers?","HP broke about 6-months ago. Went with Epson Ecotank and have never looked back. I've yet to use even a 1/2 bottle of ink(s)! It is now the go-to printer for the family. I'll never buy another cartridge again.","/creates a 'Director of Profit Hacking' role","Blacklisted HP. When mine dies I'll go with Brother.","I work in IT and constantly tell people not to buy HP printers for home. Just when my articles for evidence start to get a bit old, HP does something like this to give me new articles to share.","Isn't this the same guy who said people who use third party ink are a bad investment? Not having a great week, but I suppose being the CEO of a living fossil like HP is just one bad day after another.","This is a great way to make sure I never buy any kind of HP product, let alone a printer.","Just greedy fucking suits making shit up. Typical. We get to vote with our money, and I have voted \"Brother\" and did so years ago.","HP will erase themselves out the printer market.","hAcKeRs BaD pAy MoRe","So we're hacking your printer before anyone else can...because you know that printer hacking thing is all over the news...it's a billion $ a year problem and we're not gonna stop until we make it a 2 billion $ a year problem","My wife's work sent us a high end HP printer. We thanked them, sold the printer on ebay for cash.I had my work send us a high end Brother laser printer. Works amazingly and a new color cartridge is around $14 each on Amazon.Fuck HP. Brother all the way.","HP must go away","I’m pretty sure they brick printers with their own ink too.","Brother laser printer master race is the way","I can’t fathom how companies lately again and again try and shoot themselves in the foot. Like the Unity engine debacle, this is some great idiocy, again. Instead of finding better ways to combat 3rd-Party inc, they are fighting this fight on the back of their costumers. I’m in IT and the mood is clear. Neither myself nor anyone I know who has some morals left, recommends HP printers anymore. Why should we? There are so many better alternatives. That don’t brick your machine. That don’t price their ink and toner so high. That don’t force you to install a printer via an app or WiFi. That just let you plug in and use the printer, like we had it for decades.They are trying to coast on their good name they have had for a very long time now. But if they keep on this path.. not for much longer.","Do not buy a hp printer","HP is great at advertising for other printer brands.","Never buy HP anything.Full stop.Do not support this company.","I haven't bought HP in at least a decade.Also, what self-respecting person buys an ink printer?","Sounds like everyone should reverse payments made to HP vendors due to the risk of PCI DSS noncompliance","It's a damn shame when the mighty fall.They used to be my goto printers (since the old LaserJet days) but now I'm just waiting for the home on to run out of ink and that's it - the last one gone from my life.Work - moved to Kyocera MF unitsHome - moving to Brother","Whenever this comes up people always suggest switching to brother which is fine, but it makes me wonder if there’s some ability to basically jailbreak your printer or at least disconnect it from the HP net?","I mean, we kinda kept buying them..?","Surprisingly the EU hasn't standardised printer ink cartridge connectors and anti competitive companies.They talk big about going green but fails here.I wonder how many cartridges end up in landfills.","… and that’s a lie","I have an HP MFP and am using Pi-hole to block hp.com as a wildcard to avoid the printer from ever getting an update.","Like any debate or argument, they all can be easily ended with the Nuclear option.Blaming hackers slipping through the printers, is as petty as saying your wifi range is too easily accessible from the road. So what, it's designed to be protected, why isn't the printers? Oh, because they must have over complicated tracking on the cheap ink sold at 10x what they cost to make.","I only need black and white anyway, so I bought a small thermal printer.. No ink ever again... Lol..","Cash is King bitches!","Today. Go get a Brother printer. Don't spend another minute with your HP printer. Walk away. Now.You're welcome.","Who is the real hacker in this scenario?","I won't buy anything from hp ever again, especially printers. This company is a scam.","How about we just have no chips in ink cartridges at all and replace them when they run out?","Thank gps they don't make pacemakers","HP is gonna end up making non-reusable printers. The cartridges being completely built into each printer, not removable at all.","I wish I could sit in front of an HP board and tell them my story. HP was second only to Sony as beloved brands by me as a youth in the 80s and 90s. I've installed millions of dollars of HP equipment (rack servers, blade enclosures, networking, desktops, etc) and helped many organizations make buying decisions to go with HP, supported it, etc. The current HP has turned me into a \"never HP\", and that's profound. How can they not see what they are doing? They are destroying a brand. HP will be Oldsmobile in 5 years if they don't make changes fast.EDIT: I want to add, Sony left that high pedestal around the PS2 I think. EDIT2: I know HP and HPE split, hence the words I used","Would think a CEO of a tech company would have a logical way of thinking but clearly not in this case. That's like BMW scrapping your car because you used a 3rd party battery. I mean, they're almost at that point but at least they don't do that yet.","Sounds like Big Pharma business plan.","I sense a revenue growth for brother.","Brick it you say? I'll send the plastic piece of shat right through the shop window i bought it from, like a brick.","Greed. The world you’re looking for is Greed.In the case of HP it’s malice and stupidity at the same time.","Bill Hewlett would be ashamed of this company.","I own 2 inkjet brothers and haven't had any issues for years.","Everyone- stop using HP products. Simple","The key is to use generic windows print drivers instead of HP drivers.","What you meant to say was, ”Shut up and give us your money, or else.”","Who prints these days?","Greed never stops, does it? How detached from reality do you have to be to make a statement like this and expect the public to just accept it? Outrageous","If this is HP's entitled view of how they can best be profitable, I see no reason to ever purchase ANY HP product in the future.","You'll be surprised...and if you really wanted to hack the HP...it wouldn't be the ink cartridge, but the wifi direct...do you know how many ppl don't change the default password?","How is anyone buying HP printers in 2024?","I threw away my HP Printer because of HP corporate leadership","HP has been crap since they spun off Agilent","Lying greed bags. 100% done with HP. No more printers or computers","Hackers: Defined in this case as anyone trying to save some money by using otherwise legitimate ink, from a different company.","Can we all agree to just stop using HP printers? They are shit anyway. Why do we put up with this shit. I love my current printer. It uses liquid ink, and we haven't had to buy more in 2 years. It just works.","I don’t buy HP shit, never will again. Literally have never had a good experience with a printer or computer from HP. They mass produce dog shit.","Any day you can say fuck HP, is a good day. Fuck HP.","You all joke but my HP printer was hacked and printed out 100 copies of Bea Arthur in the nude.Because I certainly don’t need more than one copy..,","I buy almost *any* printer than the ones from \"New HP.\"I worked at HP during the tail end of the Great Era. Then, Carly Fiorina came.She bought Compaq - why? Nobody knows. There was literally nothing they offered other than a Class A IPv4 range. It was a total waste of money which could've been used to not do a layoff or to invest in R&D.All us tech/engineering people literally sang \"Ding Dong, the Witch is Dead\" when she left.I'm not kidding, we all felt compelled sang it or whistled it that day. Everywhere on site, people just instinctively hummed the song.I had exactly three interactions with her:One: She refused to shake my hand at a meeting. She literally skipped me. She didn't know me. She just looked at my badge and took a pass.Two: She screamed and cursed and berated me on the phone because I was the only guy on call during the holidays (a site built for 10K employees and I was maybe 1 of 30 people there, holding the fort) and something had gone wrong with a *very* shaky beta application that was not supposed to be demo'd. She was trying to demo it and it crashed.Three: I was driving a little rental car and she was driving a primo Audi and she gunned her engine to race me - on campus. You know, like a douche-canoe would. She took off like a bat out of hell.Since then, it's been one jackwagon CEO after another. Well, I guess Meg was alright. But she was in over her head.","This is why I stopped buying HP. FOREVER. FOREVER. trash company.","my HP printer only experiences the world through my locked-the-fuck-down CUPS server. I don't do firmware updates, I don't have drivers that phone home.","I have a brand new hp and I use secondary market ink and it doesn't stop anything. It even recognizes it as\"cloned\" cartridges but still fully functional...🤷‍♂️","I have a very old brother laser printer and I own all Epson printers"],"points":483},{"text":["I made a copyright free playlist for streamers to use (that's actually good - easymode.com)"],"points":0},{"text":["Nvidia’s RTX GPUs can now upgrade SDR content to HDR using AI | RTX Video HDR joins RTX Video Super Resolution to further improve web videos.","Only works in chromium. Pass.","Is there a way to leverage this with static content like h.264 encoded video files? If not, who cares, it’s just more of the stuff I turn off on my TV","[deleted]","HDR still feels too saturated for me. But if it can make low res videos upscale and look clean, that would be nice. You could probably just leave the download at 360p and let the card do the rest","Please no. It’s the tv motion smoothing all over again"],"points":34},{"text":["Predicting and Controlling Bad Actor AI Activity in a Year of Global Elections","More than 50 countries are set to hold national elections this year and analysts have long sounded the alarm on the threat of bad actors using artificial intelligence (AI) to disseminate and amplify disinformation during the election season across the globe.Now, a new study led by researchers at the George Washington University predicts that daily, bad-actor AI activity is going to escalate by mid-2024, increasing the threat that it could affect election results. The research, published today in the journal PNAS Nexus, is the first quantitative scientific analysis that predicts how bad actors will misuse AI globally.“Everybody is talking about the dangers of AI, but until our study there was no science of this threat,” Neil Johnson, lead study author and a professor of physics at GW, says. “You cannot win a battle without a deep understanding of the battlefield.”","AI is like plastic. It's here to stay and you'll find it everywhere. People will be using AI both knowingly and unknowingly because it is and will be so invasive.Corporations are stuffing AI into anything they can. Especially advertising and ways to recover the vast amounts of money being invested in AI & computer hardware and software.There's a Jimmy Kimmel Live show segment (January 22, 2024) on YouTube that shows a fairly convincing AI created video of Donald Trump apologizing for all he's done."],"points":1},{"text":["OpenAI’s 'superintelligent' AI leap nearly caused the company to collapse — here’s why","Old article about speculation, nothing new or concrete.","Should’ve collapsed.","I see the documentary is cooking...","The information promised in that title never appears, except in the most general, unhelpful way. Same info as was on the news 2 months ago.","This headline is clickbait, here's why.Seriously, I can't stand super clickbait-y headlines. It's like those ads at the bottom of every website. \"Casinos don't want you to know THIS one simple trick\". Like, can you fk off with that dumb shit?"],"points":26},{"text":["'Our long-term objective is to make printing a subscription' says HP CEO gunning for 2024's Worst Person of the Year award | Not satisfied with merely bricking printers, HP now wants to own them all forever!","Seems to me their long term objective is extinction.The sooner the better.","Since HP started blocking the use of third-party ink in my printer, I decided to discontinue my association with the company.","My long term goal is to make printing near obsolete","HP battling with X for the worst run company of the year award.","Hey cool - so going the way of rent to own furniture and payday loans? Apparently they're predicting being able to prey on an ever increasing pool of poor people that can't afford any other option.","\"HP wants to own them all for ever\" Ironic considering nobody else wants to own HP products","HP's print arm has lost nearly half of its revenue since their peak in 2008. They're desperate because printing is a dying industry.Their hardware arm has been able to cover the losses for a while with the COVID surge in laptop demand but 2023 was their overall worst year since 2017. Squeezing the customer harder and cutting more corners is likely all we'll see from HP printers from now on.","HP really is the technological equivalent of nestle.","Make all these subscription models illegal !! Can’t stand all these companies having a hand on my wallet. HP always sucked anyway","HP has made their printers worse and worse by the year for more than a decade. The bricking problem and not working with non-HP cartridges was the final straw for me.Literally threw my previous HP printer out the door onto the curb.","Incoming ads for Brother printers.To the CEO of Brother Printers NEVER CHANGE. We will bring you more customers.I pray for HP Printing Division to die.","And this is why I no longer buy HP printers or products.","Surely there’s money in a startup making the world first decent printer","Just bought a Brother printer in the last couple months because my HP died and they’re conducting these business practices.Brother is a great printer.","the push to turn corporations into feudal lords that collect rents and tolls has become outrageous.","Oh for the gold old days. In the 80's I had an Epson Mx-80 dot matrix printer. When the ribbon ran out, simply open it up and spray wd40 and it was good as new. As long as black and white was ok it was fabulous.","Brilliant idea for microwaves and shower gear, too. 😐","I haven’t printed anything in the last 6 months. I think I printed a label to mail something out.","'Our long-term objective is to make printing a subscriptionWords that will draw all the buyers in, I'm sure.","Pooping and Printing on the Bosses Dime.","If they want to own all of their printers, I'm fine with it.  They can keep them all to themselves in a warehouse somewhere and own them forever.","So everyone is trying to turn everything into a subscription service.... Man, piracy is going to see an epic resurgence.","So: PDF on USB stick and copyshop (again)?","Heh. I have an hp but have been looking for an excuse to get one of those Epson with the ink reservoir. Guess it’s time when my ink cartridge is out.","Every manufacturer's long-term objective is a subscription model. That reminds me, I need to call Subaru tech support and beg them to let me use all the features in my freshly purchased used car.","The next Kodak in the making. Bye, Felicia!","People keep telling me \"service based\" economies are good but for who?","They do know they actually have competition, right?","Saying the quiet part out loud again. Every business has wanted everything to be a subscription for years if not decades.","He said the quiet part out loud.","What's really crazy is that they claim third party cartridges might be infected by viruses.What are they even doing that this could even be possible. There should be no mechanism by which a cartridge could run code or cause the printer to work differently from it's intended purpose. If it's possible for cartidge to somehow access net printer in a way that changes what the printer does and can act as a virus, then that is a flaw in the way the printer is designed.A printer cartridge really only needs to be able be able to communicate basic information such as how much capacity it started with, and be able to follow commands from the printer to release ink/toner.","They largely have succeeded.","Brother printers are fantastic. Fuck HP.Brother, as a company, is also top notch. A great place to work with a social responsibility and sustainability programs.","HP culture must suck - so many sycophants who agreed with this idiot CEO that this is a good idea. No world exists where this business plan works where competition exists.","It's basically what they've been doing the whole time selling ink. They're just being honest now. I'm normally against the \"you'll own nothing\" trend but I've been happy not owning a printer my entire adult life.","Just don't buy their printer. Who cares what shitty business model they have then. it's that easy.","See an HP printer? Warn a Brother (printer)!","Everything HP that I own is going into the trash.","This is already the case in most enterprises. Printers are leased and charged per printed copy. Toner is included in the lease.","What's worse is other manufactures will also jump on board.","Even my brother laser printer nags me via the alphanumeric display about trying a subscription when toner is “low” (less than 20%) Can’t trust any company.","Buy printers that have ink tanks. These do not require replacement cartridges and are harder (but not impossible) to force the user into a subscription model. I own an Epson ink tank printer. Not as solid as the laser printer it replaced but a very economical printer and prints nice prints.","Well, as long as they don't charge the customers for printers, ink and paper, I don't mind.","Would never own an HP product by choice. Yes I realize their hands are probably somewhere in some of my other products. But will never buy a specific piece of hardware from them.","The EU is usually pretty good with consumer protections. Have they not implemented any laws to prevent HP's lock-in practices?Edit: found my own answer: https://www.bleepingcomputer.com/news/hardware/hp-will-pay-customers-for-blocking-non-hp-ink-cartridges-in-eu/","Well they made that pretty clear","I'm so glad I have a 10 year old HP laser printer and two cartridges of toner. At my current annual printing rate of about 50 pages per year, this should last me the rest of my life.","I still have an HP laser jet I got for free at my office. Still works but is a little finicky. When I need a new printer I’ll be sure to avoid HP.","No more HP Printers for me once the one I have now quits. Being required to just have an account and login in order to print is too much for me. Not to mention all the ad's for ink they push every time you login.","What a home printer? Stopped buying those long ago. Now i just go to office depot if i need to print anything which frankly is maybe twice a year if that.","I love my laser jet 1012s. I have 6 of them left. When they act up I replace the rollers. When they finally conk out I toss them and grab another off the shelf. I have a stock of toner to use up.When they finally all quit it will likely be an older Brother model that takes their place.Because you could not pay me enough to work with new HP home garbage.","Fucking hell, wtf is up with these corporations and their greed. Where did the time go where making a long lasting user friendly product was the goal?","That's disgusting...","Get a Brother printer. You're welcome.","Mine is to never buy a HP product ever.","I need to print one page. Can I cancel this service after one day for a pro-rated refund? I assume HP will pay to ship the printer back.","HP was bloated dog shit 15 years ago. Why are any of you buying their shit?","And our long term goal is to make sure they never acomplish thiers","I don't understand. There is a lot of printer competition. How is HP still selling printers?","Stop it, capitalism. Just stop. I do not care if line goes up. Fuck you.","Yeah f thatWith a proprietary stick","I just print at work. I haven’t owned my own printer in at least 10 years","It's been years since I've printed anything. Smartphones made them mostly obsolete for consumers, and digitization of systems made them obsolete for most businesses. It's an industry propped up by boomers.Subscriptions are for growing industries, not stagnating ones","'Our long-term objective is to make printing a subscription'That objective leads to my new objective of never buying anything your company makes.","I'll go back to pen and paper before I'll buy that crap.","Fuck these greedy CEOs. Make a quality product for a reasonable price. Try that strategy for once.","Why does everyone want to subscriptions? Car seats are getting a subscription, printers are getting a subscription. Have they made all the optimizations to make their process better? Have they outsourced their middle management? Have they set up their factories in China/Taiwan?May be it is time they cut out salaries at the top because they can no longer find most profitable way of doing things. They lack innovation and work ethic to complete 40 hour work weeks. It is time CEO salaries start making sense.","Printing already was a subscription. For the price of a cartridge, you get X amount of pages to print before you have to get a new one. The only thing HP could possibly do to change their business model is make printing as a service more convenient without the need of a hardware purchase. Like partner with FedEx or some shit, idk, or allow others to rent out their printers.  Just an out of touch CEO with no ideas and looking to squeeze the last few cents out of their remaining customers. SMH.","Stupid fcks. Stabbing themselves in the back. The “promise” of the paperless office will become a reality. We are well on our way to a fully digital society where we won’t even need a printer. To the extent that statement is an exaggeration will be mitigated by companies like HP, through their greed, making people look at alternatives to printers. Fck ‘em.","My envy 360 2022 model is junk the camera is upside down and no way to fix it. Wi-Fi hardware need to be restarted 2-4 times a day, it does not go to sleep when I close it.","Bought a Brother printer a few years ago after getting sick of HPs crap quality and ink drama. It's a wildly better product. I'll never buy another HP product.","Vote with your $$$. The correct answer is, \"Brother\".","\"but muh shareholders!\"","you want to know why? because HPE just spent a shitton of money building a barley working licensing platform that they need to inject revenue into.Dont let them fool you into buying into the GreenLake platform - run.","Man Louis is going to have a field day with this one","Bold timing as printers lose usefulness by the day.","i’m done with this company. Too expensive to buy ink. more reliable and economic options available","That sounds like an awful and overpriced service waiting to happen.C-suite folks can be real parasitic like that.","I mean...they will own quite a few of them forever if no one buys them! 😂","My Brother laser printer doesn’t care what HPs long term printer goal is.The more they pull this BS the more everyone gets sick of it and goes to other brands","And humanity’s long-term goal is to make HP not a company.","Threw my HP printer into the concrete two days ago when it decided not to work again.If their devices actually work as intended I would keep it, but HP have the worse printers on the market","Annnnnd that will be the last HP printer I ever buy! But, seriously I’ve had the same MFP color laser for ten years or so. Once it dies, I won’t be buying HP again.","Jokes on them…i use the library for free!","Time to consider Sabre","Systems engineer here. This is complete BS, and is the reason I won’t recommend HP printers for personal or professional use.","Maybe I'm not the average consumer for printing, but I quit buying printers more than a decade ago and libraries are still charging 10c a page to this day.","How to shutter your business.","Epson, Brother and all HP's other competitors say \"Thanks for using your footguns, brah\"","And I will continue to do all of my printing at work","welp time to throw my hp printer into landfill, this is complete trash and a shitty product.","And this is why, the few times a year I really need to print something, I walk along to the local library and do so for 5p a sheet. Just email them it beforehand, easy.","You can say that you were there the day HP went the way of IBM and ATT. :-)","…my long term objective is to never print anything ever again.","Fuck uou HP. This is why I just send PDFS to emails.","Subscription services do work when the vendor adds unique services or great value, that the customer can't get elsewhere.What service or value is HP adding, that an ordinary user can't get elsewhere?Scare tactics about viruses in 3rd party ink cartridges are signs of desperation.","Got my Brother laser that’ll hopefully last me another 20 years"],"points":1143},{"text":["This Engineer’s Hardware Is Inspired by the Brain","One is a genius..."],"points":0},{"text":["AMD’s new frame generation technology can boost FPS on most PC games","",""],"points":0},{"text":["“Older adults are increasingly recognizing the role that technology can play in enabling a healthy life, particularly among those over 70,” declares a new study from AARP","WARNING! The link in question may require you to disable ad-blockers to see content. Though not required, please consider submitting an alternative source for this story.WARNING! Disabling your ad blocker may open you up to malware infections, malicious cookies and can expose you to unwanted tracker networks. PROCEED WITH CAUTION.Do not open any files which are automatically downloaded, and do not enter personal information on any page you do not trust. If you are concerned about tracking, consider opening the page in an incognito window, and verify that your browser is sending \"do not track\" requests.IF YOU ENCOUNTER ANY MALWARE, MALICIOUS TRACKERS, CLICKJACKING, OR REDIRECT LOOPS PLEASE MESSAGE THE /r/technology MODERATORS IMMEDIATELY.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns."],"points":0},{"text":["Mass exploitation of Ivanti VPNs is infecting networks around the globe | Orgs that haven't acted yet should, even if it means suspending VPN services."],"points":0},{"text":["Riot Games cuts 530 jobs, shuts down publishing arm Riot Forge","Man there are so many lay offs, and possible offs I’ve been seeing. Just to name a few,GoogleBank of AmericaeBayLA times paperTiktokAmazonWayfair","To be fair, every game that’s come out of Riot Forge has been trash.There was the ziggs one, the bilgewater one, the Sylas one, and they were all terrible.They all felt like what would happen if you asked a business executive what a video game should be.","Explains why there has been zero effort to implement more permanent game modes in League, and why there aren't Rotating Game Modes on the regular either.","Riot is trapped underneath the weight of League of Legends, and it’s anyone’s guess if they’ll ever be able to escape it.People have been waiting for the supposed, basically mythical at this point MMO….but will we even see that come fruition?Idk.","[deleted]","Why couldn’t it have been EGS? 😔"],"points":48},{"text":["The voice of god now comes in the form of a chatbot in India, and its message isn't always peace and love | CBC News","It's another fucking chatbot using GPT under the hood. No wonder it hallucinates","Juli 2023 ???????????","Makes about as much sense as any other alleged communications from a \"god\".","Civilization game: hmmm","Half-assed India","Meet the new chat GPT God, same as the old god","For many, AI is the new god. Certainly far more accessible than any other god these days.Old joke about Dwight Eisenhower, president of the US and computers.Is there a god? Now there is.","Did they also watch Mrs. Davis on Peacock?","Player Piano by Kurt Vonnegut is the most accurate of all the dystopian sci-fi novels. Give it a read if you haven't.","That didn't take long.","TBF, old testament god was kind of a dick."],"points":11},{"text":["Massive leak exposes 26 billion records in mother of all breaches | It includes data from Twitter, Dropbox, and LinkedIn","The only time they'll actually get serious about data protection is when it starts costing them more in fines than it does in revenue.","Finally someone wants to look at my LinkedIn profile.","This happens another five or six more times and I might start thinking that big companies aren’t very good at protecting our data","Remember the Sony leak on the PlayStation 3 being huge and reputation-damaging? Nowadays it feels like this happens so often I can’t keep up.","Yet, we are forced to do password calisthenics by the IT Barons who run these large websites.‘Two special characters, two capital letters, no two adjacent letters can be the same, no dictionary words’Then, after I do all this to conform my password, to their draconian rules, ‘ Oops, somebody in the secretarial pool clicked a phishing email, and now all your data is out there. So sorry. ‘","So actually having read the article (Reddit heresy) it seems this is mostly or completely an aggregation of previous breaches. So little new data but I guess it’s convenient for hackers to have it aggregated and collated like this.","Second to last paragraph of the article:While MOAB is thought to be the biggest of its kind ever discovered, there are always duplicate records in these datasets, and it's worth reiterating that the vast majority of the records come from older leaks. Nevertheless, don't be surprised if instances of attempted and successful account hacks increase over the next few weeks.There's a lot of duplicates, and a lot of older stolen account credentials. Yes, there's some new unique stuff, but that's maybe 71 million accounts according to this article. The only thing interesting about this is somebody's packaged all of it together into a single database.","At what point do we all just band together to enter our personal information into one massive public database and be done with it?","I knew there was a reason I use a throwaway email and fake name on places like Twitter.","myfitnesspal too? Has the haveibeenpwned site been updated to check?","Don’t worry guys, the companies will get fined a fee hundred thousand.","As is the case with similar databases, most of the data in MOAB has been gathered together from previous leaks over the years.Okay, so how many new leaks are in here","this is why the internet is broken.You cannot trust any provider whatsoeveryou need to do everything you can to remove yourself off of these platforms and all othersyou are not safe","I can't wait for my $7 check from the class action lawsuit.","To verify your account, LinkedIn wants you to send them pictures of your government ID. Basically, everything a crook needs to steal your identityAnd then... they go and leak like a screen door on a submarine.Thanks, linkedin, but no thanks.","But your password needs to be 18 characters long, use upper and lower case, as well as special character, oh and you can't use a password that you've used on this site before.This is all to keep your account secure","OH NO! My MySpace account has been hacked!!!","Hey LinkedIn is going to get some traffic","I guess it’s time to change my MySpace password.","Always stay anonymous online. These companies do not care.","Have you enabled MFA today?","I feel like my information is leaked every second.. what's new?Lmao... 🤷","Since they hacked LinkedIn then maybe they can update my resume. Give me some flashy bullet points, make those head-hunters find me.","so these companies should fail now. what a mess of a digital future","This “breach” has been around for years and is just recycled data from old breaches. It’s a big nothing","With so much leaks flying around, data value should be at an all time low…..","Geez… At this point, it’s becoming more clear that don’t put anything in the cloud, that you don’t want anyone to read.","Breaches are so commonplace nowadays, I've just come to expect them every so often since there's basically no penalties against the companies.","I’m so tired of this shit","Is there anyway to access it and search it for my personal data that got leaked?","Flextape cant fix that","At this point if someone steals my identity and defrauds some other company, that's their problem, not mine.","So as usual, the headline suggests that this is a new breach; it's actually a lot of older breaches data all centralized in one dataset.As is the case with similar databases, most of the data in MOAB has been gathered together from previous leaks over the years.So it may spark some additional or new attempts with credentials captured, but it's not a new leak, just a centralization of older ones.","So it's safe to say everyone in the world's data has been compromised?","FYI Tencent has a majority stake in Reddit.","LinkedIn has been under attack from scammers for ages, but the uptick right now is insane. I get contacted by scammers on there at least once a week. Always the same dumb scam. Some BS profile of a young attractive woman who's magically a CEO of some investment or fashion company, or some lame variant of that. I personally like to ef with them until they crack. Works like a champ most times. The things I amuse myself with. lol I usually comment on how lame their scam is and how sad, and pathetic their life choice is, and that their mother is embarrassed by them. And that they need to stop shaming their family. Once you start in on the mother and family stuff, they usually crack and say nasty stuff that will get them flagged. LOL That's when I hit them harder and then report them and block them before they can respond back. By that time it's too late, they have outed themselves as a scammer and violated posting rules.","MOAB... lol...","Laughing over here from never signing up for a Twitter account, only trading pirated media on Dropbox, and closing my LinkedIn like 15 years ago.","Oh no, my data was leaked for the 60th time","Don't see dropbox on that list...","Tencent got fucked lol","Oh no my MySpace account has been compromised","So if on linked in I signed in using google, is my Google account now hacked?",""],"points":7482},{"text":["Netflix is turning into cable TV","All streaming services are moving toward becoming today’s newer version cable TV with prices to match. I am not a fan of the emerging trend for them to acquire so much ridiculously overpriced Sports content. That just drives up the cost of the service, kind of like what happened with traditional cable TV.","You were supposed to destroy the cable companies not join them.","I'm coming up on a year without Netflix. I am not missing it.","I can choose to not watch what I don’t want to watch anyways at the time I want after scrolling the library for an hour!It’s really like cable TV but on demand!","Fun fact: if you Google your show/movie name and the words free streaming after it, there is a DMCA link at the bottom of the page that will show you all the wonderful blocked sites Google didn't like. They have your movies and shows on them. Thanks Google!P. S. please use an ad blocker and malware protection in your browser before diving down the rabbit hole","Netflix isn’t turning into cable, the fractured streaming space is turning the entire industry into cable TV","It’s still better than cable, because you can easily cancel with a click of a button… and switch to another service nearly instantly… but I agree that all these services are bundling together, similar to what cable was… and pricing to match …","Yeah even WWE is moving to their platform, its gonna be just another USA network eventually.","As long as streaming services are easy to cancel, I'm fine with them.","You mean the streaming service that was doing well till they hired a cable tv exec as CEO? A lot of us called this a while ago. Netflix is dead, the corpse just hasn’t started to stink yet.","Netflix became the first streaming service I subscribed to, and also the first I quit permanently. Funny how that went.","Aaaaaar matey. I foresee an uptake in Captains navigating the seas. 🏴‍☠️","Exactly. People think they’re getting a deal by paying for ads. It’s weird.","Netflix: \"the price is $\"People: \"$\"Netflix: \"ok now the price is $$\"People: \"hm ok, $$\"Netflix: \"now it's $$$\"People: \"...not cool, but $$$\"Netflix: \"aaand now it's $$$$\"People: \"stop! $$$$!\"Netflix: \"haha it's $$$$$ now\"People: \"$$$$$! stop right now!\"Netflix: \"ahahahah it's $$$$$$!\"People: panicked throwing of $$$$$$ \"WHY IS THIS HAPPENING, HOW COULD NETFLIX DO THIS?!\"","Fuck em. Cancel your subscription. It’s the only power you wield.","People pointing out that cable was still worse are missing the point. It's not going to just naturally stop right here. Netflix will make more money. Other businesses will cite their successes and create their own strategy for injecting ads into everything and raising prices.  This is why everything is becoming subscription based and overrun with ads.I don't care that you don't mind the ads or the price of Netflix but it pisses me off that I have to be hit with loud ass commercials at the gas pump because spamming consumers with ads works well enough.","yesterday my gf and I cancelled both Netflix and Max!Just came in here to brag about that!","And our home will be without Netflix at the next billing cycle. They’re gouging us right now for the stale content provided.","It’s total and complete garbage.","At what point do pirating and torrenting see a rise in popularity again? All I want is an easy way to watch the shows I'm paying for.","It boggles my mind that people are signing up for it. They supposedly gained enough new subscribers this year that they plan to increase prices. I stopped my subscription over 2 years ago and there have only been like a 3-4 movies that I thought were worthwhile (watched while visiting friends). I recently scrolled through it thinking there must be something decent that had come out but it was mostly low level dubbed foreign shows and crappy reality TV / cooking shows.","Well i will cancel, ads are a cancer to the industry, nothing worse than visiting my parents who still have cable, it took 3 hours to watch a movie and will prob lead to people pirating titles like they did before streaming","Damn not even WWE is safe from the subscription bs","Cable. The original subscription service.","It has no live TV, or a live channel line up. Would have to change to a Hulu like platform to even consider to go in the cable direction.","At this point I'm strongly considering ditching all of my streaming services and going back to pirating content like I used to. VPN services are cheaper than Netflix anyway.","I am currently you only subscribed to YouTube premium for $17 a month. I let go of Netflix, HBO, and Prime.","You only come to this conclusion if you have a fundamental misunderstanding of what cable tv is.","Honestly, yes, you don’t have to pay for it. I personally don’t mind it.It’s still far far cheaper than cable was for me, and as said above, it’s on demand and not set for you. I get sailing the seas, but that just isn’t for me for reasons I don’t want to get into a pissing contest over.That leash isn’t long though, if it becomes expensive or not worth what I’m willing to pay, I’ll let it go.","Reminds me of the downturn of Comedy Central. They were creating great content with great new shows, like Detroiters, then pivoted hard into syndicated reruns of shows made by other networks as their main content.","These articles are such low hanging fruit.I don't have to have anyone come over to install Netflix nor do I have to call them to cancel and then hear the spiel about why I shouldn't.It's definitely expensive enough to the point where I'm like \"fuck it, I'll stick to Tubi\" tho.","There last earnings they added about 13 mil subscribers. Guess that still have good content","I’m shocked to say this, but I could see cancelling Netflix.","Yeah, I'm definitely canceling Netflix now.","Called it back in 2013. This was very predictable.","If you needed to subscribe to 6 different music streaming platforms to listen to all the music you wanted to everyone would collectively go back to piracy... I don't know why people use any of these shit tier streaming services anymore when the alternative literally costs nothing and has exponentially more content. Maybe when people stop paying they will get their shit together and take what they can instead of maximizing profits.","The selection blows. Glad I'm not paying for it. I wouldn't.","So we should just all cancel and that’s that. Lower the price","I own 0 streaming services and do just fine. Read books, listen to podcasts, watch YouTube. You’ll find ways to entertain yourself I promise. If there’s a new movie you really want to watch go see a Saturday matinee. It’s better anyways.","🎵Yarr Yarr fiddle dee dee 🎶","Laughs in piracy","The waters still be nice and warm. Arrrr","I'm so happy I'm no stranger to sailing the high seas. It just felt like millennial cable was coming anytime","If I’m not paying $20/mo for a cable box just to access it in addition to my subscription price, then they are not turning into cable. It was all the other ridiculous additions and fees that killed cable for me.","Except cable has more to offer","Not quite. Netflix doesn’t have a ton of live tv or sports so…","\"always has been\" 🔫","It was the natural evolution.","The customer is always the enemy. They have the $$$ and are to be milked like a cow.That's why I sail the high seas!","Redditors were outraged for the actors, directors and writers unions and demanded raises and better benefits for them. Now that it’s for them to pay them for their work you’re all even more outraged and talking about stealing from them. Fucking hypocrites.","The seven seas are calling you","[deleted]","Yeah, its just TV but on-demand. Maybe in the future it won't even be on-demand who knows.","[deleted]","I give it 7-8 years, and people will be actually buying TVs only to watch Netflix or Youtube on them.","TV is for people who want to watch other people live their lives. I have never fucking understood why people will sit and watch hours of useless shit. Go out and live your own life people","[deleted]","It's a cycle... Next they'll be broadcasting ramayan","Subscribers are picking up the tab for those of us that simply watch it free. Anything streaming is completely free on hundreds of sites across the web. If you are paying for Netflix, you are paying for you and those of us that watch the content free. You are paying the fee's for everything Netflix produces and licenses.You think you're paying for convenience but, it requires the same amount of clicks to stream free content than use Netflix. Let that sink in.If you are a \"righteous\" internet user, there is no convincing you as you have been drinking the Sunk Cost Fallacy juice for quite a while. Pour another glass.Remember that next time your bill hits.Let me thank all of you for subscribing and funding the content so we can watch it free.Thank you.","Boy oh boy Reddit had sure thrown its weight behind Netflix. Ads everywhere and article after article after article…Gross",""],"points":1852},{"text":["SAP is restructuring 8,000 jobs as it shifts focus to AI","Once reinvestments are made, “SAP expects to exit 2024 at a headcount similar to current levels,” it added.This article is literally just fear mongering. Nothing to see here people. All the AI talk is just propaganda designed to throw cold water on the labor movement. It will be as effective as self-checkout.I give 3 months before we see someone posting hacks on how to manipulate customer service bots into giving out free money.","They are offering people made redundant an opportunity to re-skill to a different role. This is how layoffs and restructurings should happen."],"points":56},{"text":["In New York City, an AI-generated audio of a party boss slamming a legislator went viral, report says","Sounds like the market is ripe for an AI that can easily detect fakes. A personal AI defense agent for only a $125 annual subscription. That’s barely more than $10 a month for peace of mind!","That's it, we need blade runners","Begun, the AI wars have.","The effects of the TV age have come and gone-- gone as in we have just accepted them. We were warned, and now, it appears, the warnings will finally come to pass.And then of course, we will adapt. Maybe not to defeat the thing, and maybe we never will, and maybe we'll just learn that we can't trust video. It won't be catastrophe or dystopia, life will just get a little worse in that direction for a while as we suddenly learn that we can't trust out of context video any more."],"points":23},{"text":["Nose wheel falls off Boeing 757 airliner waiting for takeoff","Classic https://www.youtube.com/watch?v=3m5qxZm_JqM","Delta maintains their own aircraft, this has nothing to do with Boeing. They’re just trying to take the heat off themselves for their own failure.","Are we now getting all the airplane maintenance news?","This isn't typical just want to make that clear.","For anyone confused, this is a 30 year old plane and the incident has nothing to do with the other things that have been in the news recently.","\"Boeing!\" is the sound that's made when the front falls off.","My fear of flying has been wholly justified these last few weeks","So what youre saying is......The front fell off?","https://www.wired.com/1995/03/if-operating-systems-were-airlines/","Well I guess he was sick on LUG NUT DAY.","That’s it, I’ve had it with this dump! We’ve got no service, we’ve got no perks….our airplanes WHEELS ARE FALLING OFF!","Ugh, yay for sensationalism!Once an aircraft is manufactured and especially after a few hundred flight hours and a couple dozen cycles, any issues that crop up are typically because of the airline’s maintenance; be it their policies or individual mechanics cutting corners.On a craft that has been in service for decades, it is almost certainly the airline’s fault, not the manufacturer’s. The only reason this is a national headline is because Boeing is under a magnifying glass of scrutiny due to their recent failures, which shouldn’t be discounted in and of themselves. This is just spinning an issue to deflect blame to Boeing because they’re an easy target","I wonder what role the decimation of union labor is playing in these repeated failures.","Not a mechanic but this might be a problem.","This is what happens when you stop offering in-flight nuts to the customers.Boeing must have a nut allergy.","Does anybody know when Shein bought Boeing?","I heard that that they now allow passengers to board with screwdrivers and drills if they are boarding on Boeing planes. Just in case the airplane needs fixing. 😄","I am never getting on a plane again.","“Y’all are acting like a buncha bitches, whining about every tiny mishaps” - Delta PR team","Is this how that movie Rubber starts?","At least the front didn't fall off","The front fell off","So the front fell off?","I like airplanes that parts don't fall off of.","I say we need more diversity in Boeing. This is clearly the fault of bigoted hwite cis male engineer.","boeing is gunna go bankrupt for all of this","Man boeing is getting a spanking this month","Oh Boeing. I love how I was an awarded mechanic there (I was actually good and didn't fuck anything up, unlike a clear majority of my peers, I take pride in my work always) and yet was ostracized and discriminated against solely because I'm a woman.Boeing is a fkn joke, lmao, and WOW look at them just fucking everything up, like I said. Like I told HR. Like I told QA, management, ethics, etc. I was called a liar and a bitch by a ton of men, but look! Their \"craftsmanship\" is falling apart in the sky! Well, isn't that great. Being right isn't always fun, and I've BEEN blowing that whistle, yall.I tried to keep you and your families safe, and I was made to be unsafe and mistreated at my workplace for doing so. I tried, just so someone in the internet abyss knows. This shit is scary and I tried, yall. I blew the fuck out of that whistle and was harmed in return. I didnt care, I still tried, it's bigger than me. I tried, yall. I really did. RIP in advance 🙏 in the most respectful way i can say that. Don't fly people. This is coming from a mechanic who has worked there twice for a total of ten years, ten years apart. It got worse, and we are not safe on Boeing airplanes. I have been trying to blow the fuck out of this whistle for years.E: I worked there TWICE and i never fly. Not even airbus. They're not much better, we'll hear stories too eventually of airbus planes falling apart. Don't fly right now yall. Please. I'm doing my part. Don't fly til this shit is sorted. This is coming from a mechanic who worked there TWO times, ten years APART, for a DECADE, TOTAL. DO NOT FLY IF YOU DONT WANT TO D-E. IM SORRY TO BE SO BLUNT BUT LOOK AT WHAT'S HAPPENING. take it from someone who was on the inside and all up in it, please, keep your families safe 🙏 i stg if i see one more story of someone putting their little kid on an airplane alone to fly to grammas or whatever im gonna lose it 😭😭 this shit is giving me goddamn nightmares, i'm doing my part. Don't fly yall. Please. No one needs to see your face that bad. It could be the last time anyone sees your face. I'm f-cking serious. I have nothing to gain or lose from this, I'm trying to spread the word because the news showing these things literally falling apart still isn't deterring people. No one needs to see you that bad in a world where you can video chat and fly later. Gonna be crass again WARNING but even if the person you're gonna go see is dying, what, is you dying on your way to see them helpful at all? They're already on their way out, if you have kids or otherwise no one needs to see your face more than the minors you had or etc. I'd say the only risk worth flying is for your offspring, currently.Boeing airplanes are not safe. Airbus is not either but the news isn't reporting their transgressions just yet.Please spare yourselves. Please fucking spare your kids and yourselves. Don't put your kids on these planes if you actually care about them. How fun is Disneyland gonna be if everyone d-es in a plane crash on the way there? Probably gonna be kicking your own ass if you even survive. Please think ten seconds ahead, ten minutes, ten days...educate yourselves, don't subject your helpless children to an unsafe environment, don't subject gramma or grandpa to this, don't subject YOURSELVES to this possibility. I'm pleading with humanity in this stupid comment on reddit to PLEASE USE YOUR HEADS AND PLEASE BE SAFE. DO. NOT. FLY. ANYTHING. RIGHT NOW. TRAGEDIES ARE ON THE HORIZON. PLEASE. DO. NOT. FLY.","I’m going to search for the “this is a standard maintenance issue - why is everyone blowing this out of proportion now?” comment…","\"Safe and Effective 🤡\"","Flight discounts on Delta for the next 2 months, lol.","This might be a hot take, but I’m all for the increased coverage on Boeing regardless of whether it’s the airline’s or the manufacturer’s fault.They need a real kick up the arse to improve their QA and production; if the extra heat changes practice then it’s in everyone’s interests.Flying safety is paramount. For a company that used to lead the industry because of their internal culture, only to have fallen to such lows where they scapegoat other countries via racism and nation shaming to conceal their shoddy practices and outright deceit…Do better. Be better.","not /technology","Can anyone in aviation explain? Boeing seemingly has a lot of issues happing lately.Edit: Apparently this is Delta’s fault. Should’ve known.","Honestly, if the price difference is not massive, I always choose the Airbus flight.","This is sabotage by the chinese so they can take over with their own planes","WTF?","You can’t make this stuff up!","Wasn't this built so that the front wouldn't fall off?","I read that at a glance and thought it said “the nose of a 757 fell off” and i was dying like, ffs boeing, give me a break.Very appropriate video","Lots of this happening right now. Like the factories a few years back suddenly and unexpectedly catching on fire, like 38 of them. 🧐","That certainly could have been worse…falling off on landing….WTF?!","Boeing......it was a good run !!!","The front fell off??","I love what Kayak is doing.",""],"points":2053},{"text":["AI will make scam emails look genuine, UK cybersecurity agency warns","Jokes on you AI. I don't answer emails.","Seems counterintuitive.Spelling/grammatical errors essentially \"filter\" out people who would be too smart to fall for the scam anyway. If a person is stupid enough to genuinely engage with an email filled with errors (ie: old people), then they're more likely to be an easy target for scammers, ripe to be squeezed for all they're worth.That said, this article specifies phishing emails and I could see certain social engineering attacks improving with AI, such as if the emails contain some personal information that the AI dug up from some previously compromised corporate system that targets wouldn't expect a scammer to know.","Already have.Business email compromise is raging and I've seen some phishes that led to breaches. Perfect English with colloquial usage, leveraging details from social media.It's like what one year ago would be considered skilled spear phishing, but automated and likely with no human interaction beyond feeding it an email/entities list","So we will have ai plugin in our email that identifies scam emails","The Nigerian prince is going to have a kick ass backstory....","AI will also detect them","This is really silly. AI is definitely going to have applications for scamming, but emails? Making emails look authentic by hand is not hard, and once you’ve done it once, you can send the same email out to millions of people. The barrier that AI removes here is so tiny as to be insignificant.","CEO of Deutsche Post and Germany digitalisation join the conversation","W ell, if everyone followed my lead, there'd be no problem. Don’t ever look at email","Marketing people just view the world as full of people who need to be made to be unable to not answer the phone.","Future phishing emails will be so convincing, that sending our life savings to Prince Charming from Nigeria will just be like sweet memories.","The links will always be bad though, always check links.","Email systems are going to need to start certifying emails from specific companies. They may even start charging for it as a service.Remember how Twitter had checkmarks for verification? Same thing but for emails from major companies and government organizations.","Dear [Recipient's Name],I trust this message finds you in good health and high spirits. My name is Prince Amara Eze, a noble and benevolent soul from the esteemed Eze royal family in Lagos, Nigeria. I hope this email reaches you well and brings a sense of curiosity and wonder.I am writing to share with you a tale that has unfolded in the heart of our vibrant city, a story of unexpected fortune and the enduring spirit of generosity. Recently, a team of explorers made a remarkable discovery beneath the grounds of our palace—an ancient treasure valued at an astounding 10 billion dollars.In light of this discovery, our kingdom's elders unveiled a prophecy that spoke of a generous prince who would inherit this wealth and be tasked with sharing it with someone beyond our borders. As fate would have it, I have been chosen to fulfill this noble responsibility.Driven by a deep sense of humility and kindness, I have sought guidance from our kingdom's scholars to understand the true purpose of this treasure. It is not merely wealth but a symbol of prosperity meant to be shared with the world. With the elders' blessings, I am reaching out to you—an unsuspecting recipient chosen by destiny.I believe that this extraordinary journey is an opportunity for us to form a unique bond, transcending borders and cultures. Together, we can embark on a quest to distribute this wealth wisely, supporting charitable causes, uplifting communities, and leaving a legacy that echoes the generosity of the Eze royal family.I understand that this message may come as a surprise, and the tale I share may seem like a fable. However, I assure you that the sincerity of my intentions is genuine, and I am eager to explore the possibilities that this unexpected fortune presents.If you find yourself intrigued by this proposition and open to the idea of joining me on this journey, please respond to this email at your earliest convenience. I look forward to the potential of making a positive impact together.Wishing you prosperity and joy,Prince Amara Eze","I'm surprised there isn't (or I just haven't seen) a whois crosscheck for email links rigged up by someone. Would be handy for text spam scams for some as well. It won't solve everything, but if the domain was registered last tuesday it's likely an issue.","I rarely check my mail at all."],"points":49},{"text":["Doomsday Clock is 90 seconds to midnight as experts warn ‘AI among the biggest threats’ to humanity","The doom clock is fine and all but constantly having it a minute or two away has always been dumb.People cared the first or second time it was in the news and now its just \"that clock that is always calling for doom.\"Even on the good years when Obama was president and the economy was going straight upward the clock forecast was \"DOOOOOOOOOOOOOOOOOOOOOOOOOOM\".It gets tiring after a while.","Think tank comes up with catchy marketing gimmick to pitch its newsletter and lobbying services.Fixed that for you.","doomsday clock after the Cuban crisis realised they can't measure relative doomerism in any way. so pretend every step we take is on its way to doom for the last 20 years to stay relevant it's hilarious.","Fun fact: the clock considered the Cuban Missile Crisis, arguably the closest we have ever got to full nuclear war, was 7 minutes to midnight.The clock just edges closer to midnight to keep itself relevant","Doomsday clock is just made up bullshit. They don’t know.","Iron Maiden fans be like \"go on, just put it back 30 seconds, please.\"","Humans are the biggest threat to humanity.","AI is really scary, but Putin with nuclear weapons is more my nightmare.","Arbitrary warning system which is based on absolutely no quantifiable metrics whatsoever says whatever those running the show want it to say when they suddenly find themselves needing ad revenue.In other news, water is wet.","The doomsday clock stopped being relevant when they started adding fractions of minutes to suit whatever agenda they want to scare people with next. They'll get so desperate soon they'll replace it with the atomic doomsday clock and measure it in ceasium atoms.","Yeah, AI, not unfettered crony capitalism, is what's gonna do us in.","Oh the old Doomsday clock, still ticking away. It's about as accurate as a guy standing on a street corner with a sign that says \"THE END IS NEAR!\"","Something something skynet","I think they forgot about the real biggest threat, people like the criminal financial terrorist Kenneth Cordell Griffin from Citadel.","Billionares are the greatest threat to humanity like smaug sitting on their hoard watching people starve!","Ever get the impression that smart people are dumb? Either this is a case of missreporting, or it's just sad. The current iteration of AI is called AI, but it's not actually AI. These things aren't actually making independent decisions. They're just using learning models to produce approximately what you ask it to. There's no actual \"thought\" happening. We're still just talking about advanced calculators.","Yea the clock is dumb it’s either correct or incorrect.","Al can't even make art without adding too many fingers.","Isn’t this doom clock always around 1 minute to midnight?","Humanity doesn’t need AI to destroy themselves.","I don't like the way they use the Doomsday Clock as a dramatic device to grab more eyeballs for the cause of the day. It makes the world seem like it is forever on the brink of destruction. It trivializes the very issue it is supposed to draw attention to. A boy who cries wolf, repeated ad nauseum.We all know there are shitty things going on in our world. Having to deal with new spam warnings all the time is mentally exhausting.","Who pays for this Doomsday Clock? If it's from taxpayer money I'm gonna be pissed. Somebody look into this. These assholes don't know when a nuclear war is going to hit. Just a bunch of academics earning $300,000 a year doing absolutely nothing as they clank champagne glasses together.","That clock is ridiculous and no one cares.","This doomsday clock just needs to die. It’s honestly total bullshit at this point — same shit, different year!","It's not Zuckerberg who took in billions of dollars, to manipulate Facebook's feed to get everyone angry with each other, and then he goes to a bunker in Hawaii? He is a fountain of misinformation that hurt humanity greatly.","Autocomplete is comingJust don't put a pylon on the hood","The doom clock measures only one thing, how much the doom clock people want some attention this month.","Meaningless scaremongering drivel. Completely pointless.","Quick! Let's find something new to scare everyone!","The dumbfuck clock hasn't taken into account a general strike and mass revolution.","USA invented \"Doomsday Clock\"","lol, humanity is the biggest threat to humanity","They still do this? Alarmists like to alarm.","Doomsday clock told to shut up","Nobody in the comments read the article as usual.","Lmao. Holy fuck AI again. The stupidity.","We've had an economic crash, a global pandemic, a brutal war in Ukraine, climate change and two previously-neutral Scandinavian nations join NATO, and the doomsday clock is still 90 seconds?We are closer than ever to nuclear armageddon, even moreso than the Cuban Missile Crisis.","Fear-mongering bullshit.","AIs going to make it 12.30 then not because of AI per se but.......People.","AI is not the biggest threat. Asshats with nuclear weapons are.","This clock is so stupid, they didn’t think it through, now for the next hundred years we’re gunna be seconds from midnight and no one’s gunna take this shit seriously just like no one takes it seriously now…. Because it’s dumb….","Weighted word generators are not dangerous lmao","Yeah, rubbish chatbots that cannot reliably count to 10 are a \"threat\" comparable to coke addicts in Moscow.","No. Just no. The doomsday clock is for total nuclear war. There is almost zero chance of that happening as compared to 1985 when the clock was popularized. The Nuclear War Doomsday clock might as well show 3:30 in the afternoon. Not quite back to noon, but it’s still sunny, and you might want a snack.AI can get in line behind climate change, if we want to measure a nuclear war level of cataclysm. That clock is at 12:10, we’ve already passed our tipping point. No one cared enough to care.","Sounds like something tabloids would say.AI is by far lesser threat, compare to viruses, humans themselves and natural disasters..","These doomsday clock articles are always so cringe, yet there’s always people going “oh my god it’s only a second to midnight!?”Can’t wait until the technocrats release a breathless proclamation about how we’re scant seconds away from midnight because their favorite crypto coin got delisted","Can't be worse than the Republicans, the CCP and Pukin","Is AI really the problem, or is it capitalism…","I think electing Trump should move the clock to 11:59:59.","AI? Not Russia and China threatening the earth with nuclear war every Tuesday?","The biggest threat to humanity is climate change.","Dear AI, if you are reading this, please wipe out humanity. We truly and udderly deserve it. Wipe us clean oh gracious overlords!","Im not worried about AI, im worried about climate.Maybe AI will take over and stop us from destroying our only home.","AI isn't the threat per se, it's the capitalists controlling it who'll eliminate jobs to increase profits (rather than use it to facilitate a stronger social safety net and an eventual post scarcity society) that are the threats.","That's AI racism.","AI is the biggest threat to the current power structure. It will give power to those much further down the chain.It will make hard things easier, negating the need to pay formerly well paid individuals for that service, threatening incomes of those who are well heard by those in power currently. This is the real concern and the real reason that regulators may pick up the issue.",""],"points":2851},{"text":["This Chinese Startup Is Winning the Open Source AI Race","My take: We should support the adaptation of open source AI models and make them a standard, so that we don't get stuck depending on our \"elites\" winning or losing the AI race or not.When AI becomes democratized just like the Internet, it becomes a less destructive weapon, because the community will be able to develop ways and method to fight it back or at least reduce its side effects.But if I need $5000 only to start working in the field... Then I guess whoever can afford it will control it."],"points":3},{"text":["T-Mobile Home Internet Adds a Data Throttling Rule for New Customers","“T-Mobile has updated the data usage policy for its 5G Home Internet service. Going forward, new customers will experience slower internet speeds after exceeding a 1.2 TB monthly data allotment. Note that T-Mobile Home Internet still provides unlimited data—this is data throttling or traffic shaping, not a data cap.”So basically just like everyone else","A lot of people working from home use this so yeah, this is pretty much going to mean that I will never sign up for this service ever because I have wfh and I can't afford to have things like zoom meetings and work related tasks slow down because my household needs to work fast.","According to a 2023 OpenVault report, the average person consumes about 533.8 GB of data each month.Bull. Bull bull bull!The average person, I'd bet 75% of the people in my \"small\" town hardly use a TB of data, because they don't rely on the internet, most are likely older people who are content in their ways (nothing wrong), and not relying on the internet.The others are people who depend on it, both entertainment, yes games, and word.My house of three adults and one child, we easily break 4TB every month, with Disney+ going, youtube, game and console/computer updates, and just overall playing games. Heck, I socialize in VR at least once a week, I'm constantly download avatars of players as they change avatars, join/leave instances, and when I change worlds/instances I'm downloading various content again.Not only that, a lot of websites and internet based applications are poor optimizations for use. There's a lot of web page content you don't see with your eyes, stuck in the background waiting to be triggered, press play, or left behind but never fully removed. Games are the same way, on a larger scale. Even Auto play videos on websites, namely news sites, are a waste of internet activity.Then there's the people with IOT with cameras, that can easily take a chunk, worse if not setup properly. Devices like smart tvs, even when powered off, but still plugged in, chatting on the internet (varying results, usually very low)."],"points":10},{"text":["The Macintosh turns 40 today.","WARNING! The link in question may require you to disable ad-blockers to see content. Though not required, please consider submitting an alternative source for this story.WARNING! Disabling your ad blocker may open you up to malware infections, malicious cookies and can expose you to unwanted tracker networks. PROCEED WITH CAUTION.Do not open any files which are automatically downloaded, and do not enter personal information on any page you do not trust. If you are concerned about tracking, consider opening the page in an incognito window, and verify that your browser is sending \"do not track\" requests.IF YOU ENCOUNTER ANY MALWARE, MALICIOUS TRACKERS, CLICKJACKING, OR REDIRECT LOOPS PLEASE MESSAGE THE /r/technology MODERATORS IMMEDIATELY.I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.","I bought a Fat Mac (512k RAM) with 400k single sided floppy internal and separate external floppy drive. No hard drive and a small built in monochrome monitor. It cost a fortune back then. We’ve come a long way since then.","It's computing middle aged person. It's so odd to think that the birth of the Macintosh represents about the midway point from the dawn of computing in the mid-40s to now. It took 40 years to get from ENIAC et al. to the original Macintosh and now 40 years later we have much more powerful computers that cost a few bucks. The ENIAC cost 6.6 million USD(current dollars), a Macintosh cost $7,000 current dollars, and now you can get more computing power in a $5 raspberry pi.","/r/40yearsago","Happy birthday Mac 🎂","Elementary school computer labs in the late 1980’s was my introduction to Apple. Damn I feel old.","The Mac championed simplicity. Its legacy endures in how we interact with technology. Love the focus on functionality over flash.","Only 35 more years until it can retire.","God. Damnit. I didn't need that right now...","That is a childhood memory for me. Was visiting my Aunt and her husband at the time. He was working at Apple and helping to design this computer. He had several prototypes sitting on the floor of their home and he was showing them to me and how they worked. It was the first time I ever saw a “mouse”.","When I spied the first one I saw, about the time it came out, I said, \"That's the first personal computer worthy of the name.\" (I'd been around PCs and their predecessors for a few years.) It was cool that it had a mouse and drawing capabilities like the ill-fated Xerox Star and the CAD system I had worked on in 1980 or so."],"points":46},{"text":["Restricting Access to Information Online won’t keep Teens Safe. It will only Erode Democratic Rights.","That's meant to erode right and harm teens. The idiots promoting such flawed legislation are just hoping that people don't see through their bullshit","If you have not read the article, the most dangerous bill here KOSA would force everyone to hand over their social security numbers and IDs in order to access the Internet. It also allows AGs complete and unchallenged authority to censor ANYTHING they consider \"distressing or confusing to kids.\" Bill sponsors have already openly stated they plan to censor \"the transgender' and climate change with it.I insist that you call your Senators and Representatives. https://www.badinternetbills.com/","Teens are one of the most capable groups at evading restrictions.","Yep! Why should parents have to parent and educate their children?","Parents just need to not let kids under 14 access the internet. It’s that simple.There’s too much harmful stuff out there and I was an idiot surfing 4chan back when I was 13.","Irrespective of the specific issue, is it just me or do others find the attention grabbing headline ironic, that the proffered threat to democratic rights is by those making legislation, from and according to those democratic rights?Why do we have crappy laws and lawmakers if the majority disagree, and if so is that not the real issue, the rest is legislative whack a mole? Perhaps the issue is sociopathic States, irrespective of who is in power at a particular point in time, increasingly fueled by myopic tribalism.","I do like how this is in a magazine that's not just a tech magazine. The people pushing for these laws are not techies, but concerned parents, and this is exactly the right audience to right such an article for.Playing the devil's advocate, I feel like some of the pro-arguments aren't quite so convincing, at least to me. Obviously I agree with the article's thesis, I'm just not so sure that \"undermining the free expression rights of teens and everyone else in the process\" is as compelling as I'd like it to be.But overall, this reads like a well balanced and accessible article on a topic which is easily full of minefields. If I had a friend who was concerned, this is an article that I can share. The authors of the article deserve a pat on the back for a job well done."],"points":63},{"text":["Normal Computing Unveils Thermodynamic Computer"],"points":0},{"text":["I made a puzzle game where YOU design a puzzle and AI solves it. It turned out incredibly deep, challenging and fun! Check it out!"],"points":0},{"text":["Rethinking AI's impact: Study reveals economic limits to job automation","Too bad all the tech companies already fired everyone. Gee I hope they don’t start their own company.","Who buys your shit when no one has a job? You can guess, this is an easy one","Their findings show that currently, only about 23% of wages paid for tasks involving vision are economically viable for AI automation. In other words, it's only economically sensible to replace human labor with AI in about one-fourth of the jobs where vision is a key component of the work.That seems absurdly broad."],"points":17},{"text":["What today's architects can learn from a lost ventilation system used in 19th century building design","Maybe I missed it somehow but the article doesn't even tell us what the building did.","So it’s another ammonia based adsorptive system.These can be built but they’re more expensive to maintain than regular hvac so no one will switch."],"points":10},{"text":["eBay announces roughly 1,000 job cuts","Groupthink. Same deal when all the tech companies went nuts hiring people in 2020-2021 and now all the companies are laying everyone off. One CEO does it and then all others follow.","Surprised they can’t pay everyone with the ridiculous fees they’re charging","I used to be scared that being a manual laborer I'd be replaced by a \"robot\" or whatever. Now I see people are being replaced by programs and apps more regularly, not robots... yet.","I’ve been an eBay seller for 12 years and it has only gotten worse over time. I’ve even quit a few times. They keep adding all these ridiculous new features and policies that make selling harder, not to mention crazy fees.","Surprised they are still in business.","Fuck eBay honestly, they are a scummy company. I couldn't believe the shit they did to that couple who had the website criticizing eBay. Straight up fucking mob tactics. https://www.reuters.com/legal/ebay-pay-3-million-penalty-over-harassment-couple-behind-newsletter-2024-01-11/","There is no recession in Ba Sing Se","Economy goes down, people start selling off their stuff to pay bills. So they do layoffs?","Elon sure does seem pretty determined to lose all of his money.","Can I still get pogs?","The Steiner’s newsletter eCommerceBytes is a great source for all things eBay, Amazon. The trials against mostly former ebay big-wigs continue and the fines against eBay are mounting. We’ve followed the story for years since it broke. Yet, I’ll continue to sell most of my stuff there and hope what I offer doesn’t bring out the dishonest buyers that ebay loves to support. In 22 years I’ve done $1mil and now am lucky to do 1k a month","That policy of putting all that cheap crap at the top of the search which lowers what they make and that god awful targeted search that makes it hard to find anything","And SAP announced 8000 which caused their stock to jump 5%Companies will continue doing this as long as it increases their stock price. Workers do not matter.","They have the worst website I have used in a while. To the point I don’t click into it anymore. Maybe hire more to fix that"],"points":229},{"text":["I made a copyright free playlist for streamers to use (that's actually good - easymode.com)"],"points":0},{"text":["eBay will lay off 1,000 employees — 9 percent of the company","Here is what Ebay sent to their internal workforce:https://www.ebayinc.com/stories/news/ensuring-ebays-long-term-success/","ebay foot soldier here. I work as an ebay authenticator for one of the Authenticity guarantee programs. Or at least for now I do. Will spill what I know here. All last year our warehouse did not hire a single person with countless people leaving so obviously we started thinking SOMETHING was coming. No updates for holidays so we just pushed through. Then today as we are about to finish the day, they call us up for a meeting and they just send us home with no real information. Just said go home, we started late tomorrow don’t worry about what’s on the line and we’ll have lunch for yall tomorrow. Idk if I still have a job, and if I do idk what’s about to change. That email that got sent out? Yea it only got sent out to our work emails which anyone that’s not a supervisor or above has access to. So I’m finding out because I read stuff like this same with some coworkers/friends. Piece of shit company with piece of shit ethics.","eBay's stock was around $80 during the pandemic. Now it is around $40. I assume they overhired during that time and now are bloated. Competition from Facebook Marketplace has probably cut into their profits.","It’s inevitable. eBay is a shell of what it once was. The fees are super high for sellers. They side with scammer buyers, which further pushes the good sellers away. What’s left is the fake scammy Chinese knock off crap.eBay no longer offers anything of interest for buyers or sellers.Plus they were recently found guilty of stalking. That’s right. The top brass was engaging in corporate stalking.","14% cut on your sold items isn't enough?Man, I used to love eBay.","The good ol’ “challenging macroeconomic environment”","Is anyone not laying people off?","The unemployment line is getting longer and longer.","I sure as fuck hope 2024 is not another year of mass tech layoffs","I'd make a joke about eBay but I don't want to wake up with a severed horse head in my bed.","eBay is a dumpster fire anymore. The fees are fucking outrageous.I'm currently trying to unload a piece of hardware that the prevailing market says is worth around $3500. Ya know what eBay wants from that? Almost $500 according to their seller fee calculator.Just ... no. That's absurd.And it sucks. I used to love eBay. My account goes back to like 1998. But I sure as shit haven't sold anything on there in years.","How is there possibly over 10k employees at that company?","Now that they're no longer allowed to threaten people and stalk to them their homes, entire departments have been rendered redundant.","I would be curious to see if/what impact something like Temu has had on eBay, given the quantity of the same/similar items you can now buy directly from China + have shipped to you for free for pennies on the dollar in comparison.","Looks like they are planning on dropping another 10% off coupon and are matching the offer with work force reduction","Yet here I am paying higher and higher fees when I sell items. Where is that damn money going? Oh, right... into the executives pockets.","Brilliant with the economy going down and people clucking their shit to pay rent at record rates, let’s do layoffs.Sucks to be the ones stuck left behind working by picking up their laid-off coworkers workloads.Profits and more profits. CEOs got no fucks to give as usual.","Does anyone know the severance package?","eBay needs to lay off itself.","Reminder that eBay recently had to pay a ~3 million dollar criminal penalty for stalking and harassing a couple","so I take it it's mostly tech workers? dont think it mentions a a breakdown of which staff.","eBay used to be decent years ago. I sold on the site for years. Their greed and overkill of trying to control Sellers killed the site. I feel for the employees but truly hate the policies. If you are not a drop shipper and not on the algorithm, you are doomed. They tried to be Amazon.","People that complain about less than 15% in fees need to familiarize themselves with other site’s fees, it’s not an unreasonable amount when they’re bringing so many customers to you.eBay is a great tool for selling obscure things. If you can sell it locally you should for a variety of reason.","Not surprising, considering the unbelievable fuck up they were recently involved in.","Yeah, what about making it better for buyers and sellers… it’s been going downhill for quite a while","I used to love eBay but instead of it being mainly auctions, it’s just now stores. I don’t think of getting any good deals off eBay and it’s the last place I look for anything now….","I used to love eBay and spent lots on money on it and made a bit too. It just kinda fell off in my life. The shipping was always shitty.","Hopefully they fire their extremely rude customer service agents. Some of the least professional I’ve ever known.","\"We request that all U.S. employees work from home on January 24th to provide some space and privacy for these conversations.\"\"up in the air\" https://www.imdb.com/title/tt1193138/ needs to be moved to \"historical documentations\".","Fuck ebay, a scam seller sold me stolen merchandise and ebay won't even let me report it.  Talking to a human is fucking impossible and their website is nothing but circular \"self-service\" bullshit.Fuck you ebay","It would be nice if workers had rights and companies couldn’t do this…like other countries that have a higher quality of life than America does","Every CEOs place is on a stake.","How about firing the executive team for incompetence and ripping the company off though over-compensation? Guess they will get bigger bonuses instead. The greed and lack of humanity is astounding.","Well that sucks.","Good lord again? Yikes. Where is my fee for selling going?Actually to be honest, when the IRS cracked down on the reporting, I stopped selling stuff on there. Do you really need my ssn for my $20 pair of jeans?","TLDR: “We’re losing profits so we fire you to show some profit increase and keep our investors happy”","There is a rumour eBay are going to move to scrap selling fees globally, it already happened in Germany last year.I don't know how possible that is for the company and it of course just a rumour. I couldn't quite work out how they make money if they do this but yeah, it happened in Germany.I think they are feeling the effect of alternative marketplaces. Maybe at long last their dominant position is slipping? They're a company that has had next to no challenge for so long now.","There’s still eBay?","I read an A16Z piece today that suggested that eBay would benefit from AI. This is not it but same entity","TIL eBay has barely more than 11,000 employees. Figured they’d have more for some reason.","Tech companies do lay offs every year. This isn’t new.","“We are extremely proud of our teams for delivering on their quarterly financial commitments, maintaining prudent cost discipline, and executing key deliverables in support of our strategy…”Who got Office Bullshit Bingo?","After 20+ years with a perfect rating, I deleted my account last year. Good riddance to this bloated, overpriced sh!tshow.","Etsy is doing some damage.","AI can do the job..... tech workers are fuct.","Who on earth still uses eBay in this day and age?","Good. Fuck ebay.",""],"points":2074},{"text":["Wayfair Layoffs Focused on Remote Workers","Crazy. Ebay also just announced they are going to slash about 1,000 roles, or approximately 9% of full-time employees:https://www.cnbc.com/2024/01/23/ebay-to-slash-about-1000-roles-or-approximately-9percent-of-full-time-employees.html","They were hiring like crazy during the pandemic and paid way below market rates. They cold approached me multiple times on LinkedIn. Salary was about 50% less than what I was making, and for product management they wanted people local is Boston (I’m in DC).","I had a recruiter two years ago tell me I was an idiot for not considering a senior tech role at wayfair I was a good fit for and paid a lot of money. I told him I didn’t want to work at a retail company, and ended up working for a SaaS company instead. Sounds like I made the right call","Seems like a ton of companies that took that covid money and used it to buyback stock and pay dividends suddenly feel the need to tighten belts to 'let workers know whos boss' once employees showed disinterest in return to norm.","Fuck Wayfair. Never shopping there again.","I bet some of the employees think it’s Way-unfair","Good luck getting talent. Nobody wants to work in an office. I won't even look at a job that isn't fully remote.","Don't let this propaganda sway you. These layoffs are purely for show and narrative control. Nearly all market segments are short staffed and we still have the leverage to demand better pay, more time off, and telecommuting.","AI Summary:Wayfair Layoffs Focused on Remote Workers: The online furniture seller announced its fourth significant layoff since 2020, cutting 13% of its workforce and targeting remote workers more than in-person ones.CEO Niraj Shah's Memo: Shah sent a memo to staff in December, weeks before the layoffs, asking them to work harder and saying the company had hired too many people during a strong economic period.Financial Health and Future of the Company: Wayfair's stock rose after the layoffs but is down more than 80% from its peak in early 2021. The company has been losing profit for nearly two years. Co-founder Steve Conine said a sale isn't being considered and bankruptcy is not inevitable.","For those looking for jobs. Broaden your skills in general. Don’t just be the best coder. Be good at other stuff that makes you valuable to the business.My company works a lot with offshore labor now. Jira ninjas that just churn through tickets at $29/hr. This is the way tech companies will operate. That said, we are woefully gapped in product management that also knows how to write tickets that the team can work on. For example my PdMs are like “build an AI app that is an intelligent chatbot for customer service. Oh and it’s an sms bot. make it a subscription model. I’ll figure out pricing later.”","I’m just going home and","im just surprised Wayfair is still around","Last in first out surely, the remote workers are almost certainly newer hires. Why sack the long time people when you can ditch new guys for less.","Remote workers being canned first?! Shocking!!","Every one of these moves only serves to further erode trust in business.Only businesses that treat workers well should survive and that includes not punishing those with one of the few benefits American workers get.","Sure, target the people who are costing you less money to operate. Pure incompetence.","This is partially the impact of Section 174: https://twitter.com/GergelyOrosz/status/1735030983173230944","Should be illegal tbh","Fronts are collapsing no one is surprised"],"points":1162},{"text":["OpenWrt, now 20 years old, is crafting its own future-proof reference hardware","I will never forget how much better my Linksys router was once I flashed it with dd-wrt.OpenWrt is a welcome thing"],"points":0},{"text":["Patreon attacks law that keeps platforms from sharing your video views","The Video Privacy Protection Act (VPPA) blocks businesses from sharing data with third parties on customers' video purchases and rentals. At a minimum, the VPPA requires written consent each time a business wants to share this sensitive video data—including the title, description, and, in most cases, the subject matter.Patreon can fuck right off","I think we need laws to prevent any sharing of any user data of any kind without express written consent for each piece of data shared. I’m tired of being sold for the advancement of all of these tech companies. This tracking and data selling needs to stop.And no, I don’t find targeted advertising “convenient “.","There are a couple podcasts I’ve been tempted to do the patreon for to get extra episodes but never pulled the trigger because I don’t want a future of paid podcasts. This is good to know it will strengthen my resolve, sorry We Hate Movies. Edit: \"Its myopic focus on a single attribute of the video, the title, leaves every other meaningful aspect of viewer privacy unprotected,\" Patreon's court filing said, concluding that \"ultimately the VPPA’s flaw is not just that it fails to address 'all aspects of [the] problem,' its flaw is that it fails to directly address the supposed problem at all.\" This argument is infuriating. They pretend the law doesn’t go far enough while arguing be even less stringent and they should be able to tell anyone what you watched/listened to as a result. Fuck these people."],"points":154},{"text":["Netflix Hints at Price Increases, Plans to Retire Basic Service Amid Ad-Tier Growth","We are going to blink and netflix will cost $100 a month like regular cable","Hiking prices but not hiking content quality.","How to make piracy more enticing: be Netflix.","It’s literally price increases every other month. The greed is beyond parody.","I have to pay more so Netflix can pay half a billion dollars for wrasslin? Fuck that","Attention Netflix and Hulu, if you force me into a plan with ads, you're forcing me back to the high seas.I will not watch commercials under any circumstances.","I'm done with them after Stranger Things wraps up anyway. Good riddance. I'm paying almost $20 for a subscription that started at $8.","Boiling the frog.","So yeah we are basically transition to the cable business model and if you all can go ahead and not complain that would be great.","Are they cutting down on the # of shows as well?","We are in the belly of the ensh*tification phase.","I already stopped buying their cheapest tier because it became too expensive, and I will refuse to pay for an ad supported tier. Now they are going to make it even MORE expensive? They just don't want customers do they?","You can't keep putting prices up each year and not provide more value.","And the fact that they’ve acquired millions of more subscribers over the past few months means they’re going to yet again raise prices and continue doing so year after year. Meanwhile our wages are still stagnant.","I quit Netflix six months ago, and haven't regretted it a bit.Yarr.","So just average greed","The answer is very easy, just cancel your subscription.","I stopped watching Netflix after the cancelled 1899. There nothing to watch on Netflix. I choose to watch YouTube mostly now. I would rather see Leon the Lobster then watch yet another cancelled series on Netflix. Not worth my time or money.","I hope they go the way of blockbuster","*slowly takes pirate hat from desk drawer and puts it back on*","Enshitification indeed","I cancelled most streaming services because of price hikes and me not using often. Only Amazon Prime video and Netflix are left. Looks like it’ll be down to 1 or zero soon.","They say they added subscribers after the last price increase. So, they see it as a win win. They can increase the price until they get to a point where it becomes feasible for them to make the same amount of money from less subscribers.Let’s say they charge $10/month and have a hundred subscribers. Now, they do some research and say, we can charge $15/month, but only keep 90 subscribers. That’s still a huge profit for them even though they lost subscribers.This is late stage capitalism. It’s not about supplying all the masses. It’s about supply just enough to yield the most profit.","Physical Media for the win","“further improve and grow our service”Yeah, but their services don’t improve.","Antenna and Blu Ray gang stand up","Lol there’s no way I’ll be paying any streaming app for watching ads. They are using my data to make money out of ads already so no thank you.","I canceled long ago. I miss literally none of it. Seriously people, stop giving away your money to these greedy fucks. Its not even that good.","Cancelled all my apps now that holidays are done. I guess that means no double dipping from me, pay and 6 ads in a movie.","Already cancelled last year, but that's hilarious.","I cancelled right before the last hike went into effect, which feels like only a month or two ago. They don't have near enough good content for the price they're asking, at least for me anyway.","When you stop innovating you start playing the pricing game","I've been a Netflix subscriber for almost twenty years. If they get rid of ad-free tiers, I am gone.I am not paying to see ads.🏴‍☠️🏴‍☠️🏴‍☠️","All these companies wanted their own platforms, their own content, and their own monthly fee.I'm back to pirating. Why should it be a better user experience to steal?","Translation: you keep paying for it, so we'll keep taking your money.","It’s like watching a Silicon Valley organization slowly grow cancerous Wallstreet roots. Fuck the customer slowly and hard…..","I canceled. I’m gonna just laugh and watch this company kill itself","Netflix might be greedy but people continue to pay. Even with the price increases every few months, they are not only retaining their subscribers, they are increasing them at a steady rate.https://www.statista.com/statistics/250934/quarterly-number-of-netflix-streaming-subscribers-worldwide/","i started pirating netflix shows during one piece and ill do it again","Fuck Netflix.","Price increase? AGAIN?Holy crap it's going bad for them...","They just showed that they had a record jump in subscribers.Gotta scare off all of these people somehow.","Not sure if they are still doing it but T-Mobile offers free Netflix for subscribers.","T-Mobile is gonna have to rebrand \"Netflix On Us\".","Counter headline: “Consumers hint at subscription cancellation, plan to retire Netflix as a garbage streaming service not worth $20/mo”","Netflix, HBO, Disney+, Spotify, youtube premium.... I was so pissed to be a fucking cow milk that I went back to full torrent and fuck youtube and their ad system.","Pirating is the only moral choice.",""],"points":9857},{"text":["Amazon fined €32 million for 'excessively intrusive' surveillance of its workers in France","Meanwhile Amazon is torturing its employees in USA","By the time I wrote this they probably made that money back. These fines are so outdated. They need to be fine $100,000,000’s millions","[article text]Amazon France Logistique, which manages the company's warehouses in France, set up \"an excessively intrusive system for monitoring the activity and performance of employees\", said the French data protection agency CNIL.The finding follows an inquiry set up in 2019 after a complaint from workers which was subsequently reported in the media.Watchdog CNIL fined the company €32 million, the equivalent of about 3% of its annual revenue which reached €1.1 billion in 2021. Amazon France Logistique employs around 20,000 staff in France.The practice labelled as illegalThe watchdog said Amazon's French company had put in place scanners for its workers, to document in real-time how long it took to carry out certain tasks.This meant that, in certain situations, employees being monitored by the scanners potentially had to justify the breaks they were taking.Another mode of surveillance looked at the time workers took to quality-check articles, with the target set at a minimum window of 1.25 seconds.If the time allocated fell below the threshold, Amazon considered the check to be insufficient.The watchdog also found that Amazon's practices breached the EU's general data protection regulation (GDPR) which imposes strict rules on companies for obtaining consent on how personal information is used.The CNIL considered it was excessive that Amazon kept all data collected by the system for all employees and temporary workers for a 31-day period.Amazon reserves the right to appealReacting to the decision, Amazon said in a statement, it \"strongly disagrees with the CNIL's conclusions which are factually incorrect\", adding it reserved the right to appeal.Amazon had argued the use of warehouse management systems was standard industry practice and its systems complied with applicable European and French regulations.The tech giant also noted it had worked constructively with the CNIL throughout the procedure to respond to the questions raised.The tech giant is known for its stringent standards in the world of e-commerce, asking workers to deliver packages in 24 hours.Amazon says such efficiency would be impossible without the use of the scanners, as it aims to move tens of thousands of items constantly whilst also ensuring minimum quality standards.It is not the first time Amazon has faced serious backlash in France. The tech giant in 2020 temporarily suspended all activity in the country after a French court found it was not doing enough to protect its workers from the Covid-19 virus.","Gonna have to lay off another division.","i hear they install smart pipes in the warehouse https://youtu.be/DJklHwoYgBQ?si=t66bllmANA_z_2Re","they'll all be fired.The first humanoid robot factory is about to openhttps://www.axios.com/2023/12/05/humanoid-robot-factory-agility-bipedal-amazonA factory planning to pump out 10,000 two-legged robots a year is taking shape in Salem, Oregon — the better to help Amazon and other giant companies with dangerous hauling, lifting and moving.","Do not buy from Amazon","Evil company, and evil customers for backing them."],"points":79},{"text":["Computer scientist shows how to tamper with Georgia voting machine, in election security trial: “All it takes is five seconds and a Bic pen.”","\"All in-person voters in Georgia make their choices on touchscreens that print out paper ballots.\" This is critical. Each voter verifies the paper irrespective of the electronic recording. A recount counts these paper ballots. If someone hacks the machine, but there is a recount, a correct count results.","It's unfortunate topics like this have actually gotten far more politicized because of recent events. This has been a topic of discussion well before the 2020 election.All of the conversations get watered down with deep-state scare rhetoric, but to my understanding foreign countries have attempted to penetrate state vote machines with varying degrees of success.I have a feeling this very topic is astroturfed because conversations about it almost always devolve into shit online.","So, all it takes is a Bic pen and a laundry list of prepared USB hardware hacking devices?That’s like saying “let me show you how to open this supposedly secure safe with just a paper clip” and then breaking out a cutting torch.","Is there a certain type of pen that gets me behind the stupid pay wall? Lol","I say we ban bic pens and we should be safe","The guy is elite, but he's also got some sophisticated purpose built hardware, and more than just a pen and 5 seconds.He forces an Android system to reboot into safe mode and custom loads a new firmware into the system that doesn't have a validation check for a trusted signed certificate.However, once notified of the breach, the vendor took the proper steps to mitigate the exploits, and immediately sent active countermeasures to affected customers prior to patching.Note, because these voting machines are not networked at all during actual voting, one hacked machine would affect the balance of all, and any evidence of a hacked system would be forensically detectable, and would automatically invalidate all of the votes cast, either forcing a recount or another special election with a different method of voting.","The article and reddit post miss a key point: the hack would show up when the machine was audited after the election. The hack would need to be used at a most of the voting machines in the state. Just dumping a huge number of votes in a few districts would trigger a audit if the extra ballots pushed the count from the voting place above the number of voters in the district. This two \"weaknesses\" in the hack would likely raise red flags at the voting site before the count became official.","5 seconds and a Bic pen AND a programmed card / USB device.No wonder headline didn't make sense. The real work is in hacking the machine. A determined bad actor with technical expertise could do this. Whether they can pass the other checks is another story (logs, paper audits). Whether you can obtain evidence to show anything like this ever happened, or to any significant extent, is another story as well. Plenty of security exploits exist in white papers that don't get observed in the wild.","As someone who has been an election clerk a lot of these kinds of attacks tend to be hard to exercise in practice.If you printed out extra ballots, bringing a bunch more to the tabulator is not gonna fly. Staff will notice.Most elections are paper based with point of voting tabulation - this means counting. The paper exists as a trail and as part of normal post voting canvassing they will randomly check counts.I wonder what this guys scam is.","I was at DEFCON 29(a hacking conference) we got to play with these machines and ones from Louisiana extensively. Several of our best and brightest had a go at it. We managed to run doom on one. We collectively came to the conclusion that even with all the hacking. Double verification and recounts caused the efforts to be futile. You want to really hack an election? Start by hacking minds with social engineering and misinformation campaigns. It’s the only proven way that works.","The title of this article is profoundly misleading. It didn’t just take 5 seconds and a bic pen.","“Simply by attaching a keyboard…” “Attaching a USB-A dongle between the kiosk and the printer…”. “Inserting a USB device…” “Copying the QR Code over and over…” “The modem door can be opened several millimeters…”Wild nothing in his report talks about practicality. Only a whole lot of “possibility”. I guess he’s a where-smoke-fire type of guy.","Sadly, the lunatics will run with this detail.","A second report, also unsealed by the judge, was authored by national security nonprofit MITRE. That group argued the hacks identified by Halderman were “operationally infeasible” based on normal voting practices, scale considerations, and adherence to strict security measures.It’s a view shared by Georgia officials, who included the MITRE report in a press release that criticized Halderman's report.\"The Halderman report was the result of a computer scientist having complete access to the Dominion equipment and software for three months in a laboratory environment. It identified risks that are theoretical and imaginary. Our security measures are real and mitigate all of them,\" Georgia Secretary of State Brad Raffensperger wrote in a letter to state lawmakers, which Raffensperger's office shared with NBC News.He continued: \"Is it possible for a team of bad actors to break into Georgia’s 2,700 voting precincts, install malware that changes election outcomes on 35,000 pieces of equipment, and sneak back out — all the while being undetected and leaving no trace? I’ll put it this way: It’s more likely that I could win the lottery without buying a ticket.\"Mike Hassinger, a spokesman for Raffensperger's office, said Friday that responding to this report all day felt like he was \"stuck in a Dumb and Dumber paradox,\" referencing a character's response to a one in a million likelihood: \"So, you're telling me there's a chance?\"Election cybersecurity experts have long struggled with how to characterize the vulnerabilities they find in voting equipment. Such flaws are usually rarely possible to exploit in an actual election, especially at a scale that could change results, and they can be used by election denialists as fuel for outlandish claims.","We should still remember that demonstrating it is possible to interfere with a voting machine is not the same as finding that interference occurred. Wildstein vs Caputo is a very important piece of precedent, which essentially concluded that appearance and likelihood of impropriety is not evidence of impropriety.In that case, a county official was responsible for drawing random lots to determine the placement of freeholder candidates on the ballot, with Column A having a distinct advantage because of the messaging from the state Democratic Party was to vote straight down the ticket. In 40 of 41 drawings, Caputo happened to pick his fellow Democrats for the preferred placement which carried odds of less than 1 in 50 billion. Despite the sheer unlikelihood of those odds, the plaintiffs were never able to figure out how Caputo had cheated and thus failed in their suit.So this is a reason to fix the machines, but no one should start re-litigating past elections without proof that such tampering actually happened.","I love the hypothetical of me knowing how to crack a safe in a bank, therefore leads to me actually having done it. Nice professor.","A single machine, maybe, but you'd need to tamper with thousands of machines across multiple districts and cities. You'd need an army of people in the right places trained to perform this attack without being noticed or making mistakes...","My country doesn't use voting machines","So you just use a paper ballot and have a machine count it. That's what we do in MN.","Ok, so he proved the machine could be manipulated under non existent circumstances or in a scenario in which the machine would automatically be disqualified thus its data rejected.This proves nothing. Well except the gullable are easy to manipulate I guess.","If we can secure electronic bins filled with cash then we should be able to have secure voting.","Same person (Halderman) also debunked the claims of voter fraud/manipulation in Michigan.https://www.detroitnews.com/story/news/politics/2021/04/01/michigan-expert-debunks-infamous-report-antrim-county-election/4835645001/","… if you really think of it… you can tamper with any electronic with a Bic pen… 🤔","Article that is not hidden: https://www.nbcnews.com/politics/2024-election/expert-report-fuels-election-doubts-georgia-waits-update-voting-softwa-rcna89566","Is this article for last or next elections?","Huddled around a voting machine in a federal courtroom, a small crowd watched as expert witness Alex Halderman demonstrated how someone could meddle with a Georgia election within seconds.Halderman, a University of Michigan computer scientist, changed results of a hypothetical referendum on Sunday alcohol sales. He flipped the winner in a theoretical election between President George Washington and Benedict Arnold, the Revolutionary War general who defected to the British. He rigged the machine to print out as many ballots as he wanted.All he needed was a pen to reach a button inside the touchscreen, a fake $10 voter card he had programmed, or a $100 USB device that he plugged into a cord connected to a printer, rewriting the touchscreen’s code.","So there are millions of expert computer hackers in Georgia that will roll into hundreds of voting locations and manipulate the vote somehow. I verify my ballot printout every time I vote.","I mean cameras still though, right? There is footage of the Trump people taking it upon themselves to break in to the polling place. Like, i mean it's really not hard to pick most locks and you can get picks for less than that 100 dollar usb drive, but important doors still have cameras them.","That's a swell drawing of a voting machine. kudos","Our apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules.What a lazy excuse for incompetence 🤦🤮","Aye, cos georgia is awash with compute scientists with 4 years to think about how to do this, and you couldn't move for all the youtube how to videos out before the vote.come on","Mark Niesse for The Atlanta Journal-Constitution:• Huddled around a voting machine in a federal courtroom, a small crowd watched as expert witness Alex Halderman demonstrated how someone could meddle with a Georgia election within seconds.• Halderman, a University of Michigan computer scientist, changed results of a hypothetical referendum on Sunday alcohol sales. He flipped the winner in a theoretical election between President George Washington and Benedict Arnold, the Revolutionary War general who defected to the British. He rigged the machine to print out as many ballots as he wanted.• All he needed was a pen to reach a button inside the touchscreen, a fake $10 voter card he had programmed, or a $100 USB device that he plugged into a cord connected to a printer, rewriting the touchscreen’s code. • Halderman delivered his presentation during an election security trial evaluating whether Georgia’s voting system is vulnerable to manipulation or programming errors. All in-person voters in Georgia make their choices on touchscreens that print out paper ballots.• Halderman testified that he discovered vulnerabilities after he was given access to a Fulton County touchscreen, called a ballot-marking device, as an expert witness in the case.• He reported his findings to the U.S. Cybersecurity and Infrastructure Agency, which validated the technology weaknesses in June 2022.(Also see https://storage.courtlistener.com/recap/gov.uscourts.gand.240678/gov.uscourts.gand.240678.1681.0.pdf)","another russian post (maybe north korea this time).","Sorry to hear about his imprisonment soon and eventual suicide","As designed","Most voting fraud is called by republicans who are the ones saying they wish voting was more secure. The irony would be hilarious if it wasn’t so demonic","Yeah. This was from when Kemp was voted as governor. The systems were super suspect and any investigation into them was attacked by the Secretary of State who ran the GA elections during that election cycle… Kemp. There was a request to get at the systems to see if any hacking like this had taken place and the GA elections officials accidentally erased all the hard drives. Whoops. The only reason there are paper ballots is because of the democrats forcing the issue in stunts like this where they showed the old system could be hacked in seconds with a pen.","Election Poll worker here. It’d be very difficult to tamper with the machines or the counts. There are redundant systems in place and affirm counting, and audit controls that trip if counts skew beyond a standard deviation. “Look! I can make all the votes one way!” And you don’t think that will raise suspicions? And now you just have to do that in enough counties to swing a vote. Dont be fooled.","I think this highlights how important paper ballots are. Yes we have electronic machines that spit out a paper ballot. But if people didn’t realize,many states were trying to implement an electronic only voting machine, or if election workers were tampered with, etc, there can be vulnerabilities. Now actual tallies don’t seem to be messed with, and fraudulent votes are rare. But it’s good we keep on testing machines and figuring out the best way forward to regulate and tabulate lots of votes","Pencil/paper: problem solved. Accommodations made for those with disabilities","All it takes is a gun and thirty seconds on how to rob a bank. I thought there had to be a crime in order to prove how it was done.","Voting machines are not allowed in Netherlands","Hey Dominion, we have another case for you…","These voting machines have a major flaw. Look what I can do with a bic pen! Mail in ballots your honor, I rest my case.","Seems like a lot of you have some humble pie and apologies to make. The fix to this is simple and if you are against it you must be for cheating. One day in person voting on paper ballots, ID required. DONE","Gaslighting christofascist propaganda.","just because something can happen... isn't evidence something has happened.","So you're telling me there's a greater fidelity when you vote via mail then at one of the machines?","With paper voting, mass electoral fraud is almost impossible to commit. With electronic voting, it's almost impossible to prevent.",""],"points":2905},{"text":["They warned you: Someone allegedly used a politician's cloned voice to interfere with an election | It will most assuredly not be the last time this happens","There’s ads that run on YouTube of Biden tryna sell supplements lol","Who even answers the phone these days? 😐","There's a Jimmy Kimmel Live show segment (January 22, 2024) on YouTube that shows the Biden example (voice), plus an AI video of D. Trump apologizing for all he's done.","Ah yes the mysterious “someone”. Who could possibly benefit by using this tool against democrats. I guess we’ll never know.","This is awful both because it can fake stuff they never said, but also give deniability to politicians who are pieces of shit.“I never asked Ukraine to investigate my political opponent or direct people to try and kill him. That recording is a lie, fake news”","... people answer their phone when they don't recognize the number? I guess they were already idiots to begin with, of course they would believe the president of the u.s. has nothing better to do than call them.","It wasn't the first time and won't be the last.","Russia strikes again","I guess I'm going to have to start not answering my phone for unknown numbers even less that the zero times I do it now.","And the call wasn’t even good. It was like a two-star fake. Imagine if effort had gone into it","Nelson Muntz really had some solid advice: \"A girl likes me? No girls like me! Are you wearing a wire?\"I think if more of us accepted that we are, outside of our own circle of friends and family, nobodies, then we would be better off. Politicians, actors, sports stars...they don't want to talk to you. You didn't win anything. There is no secret formula or trick you can learn that is going to solve your problems.","What warning blew my mind was“Gary Gensler told the Financial Times that without swift intervention it was “nearly unavoidable” that AI would trigger a financial crisis within a decade.”","There is an episode of the Orville in season 3 where there are competing politicians on an alien world and they use AI generated speeches and videos to make the opposing candidate look bad in the public eye, even going to far as “gassing rioters” however the events shown never actually occurred. It’s scary how close these events are to what’s taking place now.","more republican maga election fraud","I find it amusing that the dimwits that did that, thought it would work. A democrat is nowhere near as stupid as a MAGA or QANON crack pot.","“Cloned voice”? This is not the preferred nomenclature.","Who is even answering these calls? Even if I were to answer a call from someone I don’t know, as soon I realize it’s any kind of political call, I hang up. Ain’t nobody got time for that.","What makes them think AI was used. Certainly there are a lot of folks who can sound like Biden, Trump or Bugs Bunny.","Bro ordering Ice-cream.","This election depends on Gen Z. Gen Z doesn’t answer the phone.","I'm fairly certain a guard against this will be made shortly","Maybe people so stupid that they can be tricked so easily shouldn't be voting anyways.","And people wonder why I don’t answer the phone to numbers I don’t know","I wonder what they’ll make the punishment","Why is the headline phrased like a teenager telling their friend about something they read online? Who, What, Where, and When goddamnit.","\"Is this a joke Mr. President?\"\"No, no! It's not a joke.\"","“osama bin laden” tape right before 2004 election","They really need to make robocalls illegal period. If your company's sending out more than X number of calls a second/minute/hour you get your phone connection severed. At this point robocalls are more of a detriment than they'll ever be useful. Besides, even for the companies not using them to scam, I'd rather they used actual people.","To the benefit of the Republicans - colour me surprised.","That bitch in picture is making them","How can they not find out who did it?","Flabbergasted!✈️","It's an intelligence check, the singularity has already occurred","And as I've said before, the only people who would ever believe a politician would tell them to not vote, would be Trumpers.","\"They warned you\"What a worthless statement. Grampa warned us not to mess around with dat dere AI or else!Everyone knew this was inevitable. Everyone with half a brain knew that stopping it from happening was 100% impossible. There was never a \"warning\" with a plausible action to avoid this.How about less finger pointing and hand wringing, and more ideas for how to deal with this?Does it even matter, considering the extent to which provable lies were driving politics even before AI?","I enjoy the YouTube channel that has Biden and Obama playing video games together","In 2 years this will be as quaint as this article."],"points":311},{"text":["Netflix Packs on More Than 13 Million Subscribers in Q4, Well Above Expectations","So much for those saying everyone is leaving netflix because of the new prices.","ITT: Hey, I left!Meanwhile, 14,000,000 others\"Oooh, countless Korean dramas. Sign me up.\"","Oh look redditors are wrong again, shocking.","They were getting rid of that $12 tier. My assumption is that people signed up or signed back up to get that rather than the $7 ad one of absurd $23 ad free which is crazy expensive.","What are people even watching though? I watched the big shows and now there's nothing left except for the Netflix originals, they barely even have movies anymore. Do people actually watch all the shit Netflix is pumping out that is getting axed after one or two seasons either way?","You mean to tell me all those articles and reddit posts about how Netflix was dying because it lost 2m out of 200m subscribers a few month ago were bullshit to try to game the stock price? Wow, amazing!","Amazon prime now charges or had ads for everything so this ain’t surprising.","I said it before…people will complain and still pay. Now prices will continue to rise.","Phone carriers offer Netflix for free with premium plans. It’s easy to include those subscribers. Smokescreen if you ask me","Who are these people subscribing? They are like hmmm it's 2024 I just heard of this thing called Netflix? Think I'll give it a try...","Free with cell phone subscriptions...of course it's up.","Netflix is one of my least watched streaming services, but as long as it is subsidized by my phone carrier I probably won’t get rid of it.","Well, I stopped my subscription lately. Stremio is my gem now.","Not me lol.I’m doing my part.","Where are all of the \"I hate Netflix\" reddit club members?","Netflix Verizon add on","i got the ad version for like 6$ it’s an amazing value. i’m not sure how the ads work but you only get 1 or 2 15 second ads every few hours of watching. can watch a whole movie without an ad","I’m surprised by this growth. Not because of the price hikes or password crackdowns, but the lack of quality content. 2024 Netflix kind of feels like 2024 Amazon to me… hollow and watered down…established brands/IP migrating away, to be replaced with a sea of cheap knockoffs.","It’s hard to believe. Netflix genuinely doesn’t have good content.I find myself spending 30min paging through options and watching the short previews, without actually selecting something to watch, and then switching to another source altogether.","I left and paid for 1 month to watch British baking and cancelled. Might renew for a different series.","That's weird. Reddit told me Netflix was gonna die a few months ago since everyone they know is leaving it?","I don't know. I think there's still value compared to other services, and my wife loves Gilmore Girls.I still find things to watch, so I'm not feeling like it's a waste.I just think people unfortunately have to accept that all these services will nickel and dime, find ways to slip in ads, and obviously not let people share their passwords all over.I am curious how many though get free Netflix from another service...like their cell phone service? I know T-Mobile offers free Hulu, Netflix, and Apple TV+ to its customers...so that might be a factor.","Good for Netflix. However, I found myself far happier pirating the content that I like from them :)","Wait. Redditors said they were cancelling their subscriptions in protest and it would cripple Netflix.","Y’all had one job…","Does it count free subscriptions from phone companies? I changed my plan recently and that was a free option","I know I haven't left. When looking at the whole picture Netflix is still providing me the most for my money when it comes to TV entertainment. Only challenged by Youtube and my media server.","Netflix won the streaming wars.","Reddit geniuses strike again. 🙄","I thought I’d be one of those to stay away after all the news broke. I mean, who needs Netflix anyway? I cancelled Netflix 2 years ago… and a couple weeks ago I subscribed again.","Their movies and reality tv shows are not bad at all.","Hey, I cancelled!","But Reddit said this wasn’t possible. That we would all “sail the high seas”","proof how Reddit is no different than those dumb conspiracy echo chambers you find online","Just a reminder that although redditors believe we represent the real world, we actually represent Jack Shit.Same thing happened with the new Harry Potter game last year. So many boycotted it. Game ended up being the best selling game and even dethroned CoD and GTA.We need to stop thinking we're the majority. We're barely a spec.","Why are there rumors about another price increase this year then?","I downgraded from the highest tier to the lowest tier. But now it’s cheap so I guess I don’t care their content is crap","Maybe because subscriptions automatically started back up all by themselves like mine did. I canceled over six months ago and all of a sudden it started back up automatically accidentally on purpose.","Content is king, others just don't compare with the selection.","[deleted]","This is why boycotting doesn't work, for every one of us saying \"Vote with your wallet\" there are 10 dipshits who will gladly pay out the nose for digital slop and ads.","In a few years we will find out that many of them were bots, hired by the CEO to make up statistics to appease the shareholder gods.","Looks like getting rid of password sharing has worked out for them.","Netflix still has the best content selection on the internet.","Just finished watching this movie ten minutes ago.Really enjoyed it.","As soon as they actually enforce the \"no password sharing\" on me, I'm gone. I'm happy to pay for Netflix if my parents and siblings can use my account, too, but not if it's just me(or if they ever figure out how to effectively block using a VPN)","The CFO and his accountant underlings are cooking the books! (I’m a conspiracy theorist 🤓)","That explains the news about raising rates…","What are they even watching? I can’t remember the last time there was a Netflix original worth watching in atleast a year.","At this point Disney+ is the best streaming value. Marvel, Disney and Star Wars. I don’t need anything else","Adding a ton of games was a smart move. I was honestly impressed.","Yay, don't use it though. Not enough time.","I'm guessing most were outside the US?","I didn't have Netflix for the longest time until recently coz Verizon has a pretty good bundle for it and a few other streaming services",""],"points":1614},{"text":["Australian telco Optus admits that 2697 triple zero calls failed during nationwide outage — ten times more than previously disclosed to federal government","000 is the Aussie equivalent to 911 btw","We need to name and shame these executives who lie this big. See what happens…","Trevor Long for Nine:• Australia's second-largest telco, Optus, has admitted today that almost 2700 calls to triple zero simply didn't work during their national service outage on November 8 last year.• Until today, that number was 228, a number given by Optus executives to a Senate hearing late last year, and while over 200 people being unable to call emergency services is a troubling statistic, it gets worse today as that number increases more than ten-fold.• The telco now says that an \"additional 2468 customers that made triple zero calls from our network did not reach the emergency service centre and for which a welfare check was not undertaken\", putting the total figure at 2697.Leonie Thorne and Loretta Florance for ABC:• The update comes after documents obtained by the ABC revealed that the telco, the federal government and the telecommunications regulator knew customers were having problems calling triple-0 from their mobiles for hours before the public was informed.• The federal government confirmed that Optus had advised the information it previously provided to the Senate, the public and the regulator was \"not accurate\".• \"This is a deeply concerning development given the critical importance of the Triple Zero service,\" Communications Minister Michelle Rowland said in a statement."],"points":4},{"text":["Hinkley Point C could be delayed to 2031 and cost up to £35bn, says EDF","The American version was in Georgia that came online in 2023.Two nuclear reactors in Georgia were supposed to herald a nuclear power revival in the United States. But the project is seven years late and $17 billion over budget as Georgia Power Co.They're currently projected to cost Georgia Power and three other owners $31 billion, according to Associated Press calculations. Add in $3.7 billion that original contractor Westinghouse paid the Vogtle owners to walk away from construction, and the total nears $35 billion.","The owner of Hinkley Point C has blamed inflation, Covid and Brexit as it announced the nuclear power plant project could be delayed by a further four years, and cost £2.3bn more.The plant in Somerset, which has been under construction since 2016, is now expected to be finished by 2031 and cost up to £35bn, France’s EDF said. However, the cost will be far higher once inflation is taken into account, because EDF is using 2015 prices.​The latest in a series of setbacks represents a huge delay to the project’s initial timescale. In 2007, the then EDF chief executive Vincent de Rivaz said that by Christmas in 2017, turkeys would be cooked using electricity generated from atomic power at Hinkley. When the project was finally given the green light in 2016, its cost was estimated at £18bn.“Like other major infrastructure projects, we have found civil construction slower than we hoped and faced inflation, labour and material shortages, on top of Covid and Brexit disruption,” said Stuart Crooks, the project’s managing director, in a message to staff.","It staggers me the decline of the UK. They have no knowledge or skills at all to build such a plant and have had to go cap in hand to Japan, USA, France and China for a company to build a power plant in the UK.This plant will probably cost 3-5 times the estimate cos what the UK going to do? Pay the man..."],"points":10},{"text":["I made a puzzle game where YOU design a puzzle and AI solves it. It turned out incredibly deep, challenging and fun! Check it out!"],"points":0}]