[{"text":["Computers make mistakes and AI will make things worse — the law must recognize that"],"points":0},{"text":["Gene Therapy Allows an 11-Year-Old Boy to Hear for the First Time","That’s science and technology!Can you imagine how far we would collectively be if certain religious and political groups weren’t busy destroying books, immigrants, healthcare, social security, abortion… or undermining masking and vaccine programs, etc?","As an audiologist, articles like this are frustrating. This one particular case is remarkable. Miraculous even. I'm overjoyed this kid can hear so much better...But out of all causes of hearing loss, genetics account for (very roughly) 3% of cases. Out of those 3%, only about 3% are related to the otoferlin gene, as in this article. Otoferlin disease is special in that the hair cells remain intact. For almost all other cases of hearing loss, the hair cells are not intact. If they're not, you can't just flip a genetic switch and get the ear working again. And there's very little hope for hair cell regeneration in the foreseeable future, through any means. The structures are just too small. We would need some kind of hypothetical surgical nanobots to repair them.So for the 0.09% (or less) of all hearing losses that this technique could help, it's great news. But then Joe the Army veteran reads this article, makes an appointment to see me, and tearfully asks if I can help get him this treatment. I have to explain it couldn't possibly work. His otoferlin gene is working fine, and his hair cells are decimated by noise from thousands of gunshots. He gets sad that he had false hope for a moment.I do see that the article mentioned this was a very rare form of deafness, but popular science publications want to get people excited, so they hype up how groundbreaking it is (and it is) and say, \"Yes this only works on otoferlin gene deafness now, but think of the possibilities on the horizon as this technique is refined!\" Only there really aren't very many. When the hair cells are destroyed, they've gone forever. It would take a vastly more groundbreaking development to help the other 99.9%. I just wish that were made clearer by the authors.","How is this new treatment being received in the Deaf community?","I’m curious, when gene therapy is done, does it alter a person’s DNA in a away that would carry onto their future children? Basically, does this little boy’s future children have a lower chance of being born deaf because he was treated with this technology?","I bet the therapy still allows him to selectively tune out his parents.","Do you think we are closer from retinal (eye) regeneration or hair cell (hearing) regeneration?","That’s amazing","Nice","Looks like he’s enjoying what he’s hearing in the world as much as I am.","This Gene guy sounds cool.","Why were we not funding this?","Thought this said “Game Theory” for a second","…and his taste in music is already terrible?","Thanks Gene! You’re the goat!","Interesting I wonder if we are closer to regenerating brain and nerve cells that were damaged.","I’m legally blind thanks to a rare gene causing cone rod dystrophy. I just saw a report saying the eyes being self-contained makes them one of the easiest organs to treat with CRISPR. I’m on the edge of my seat waiting."],"points":153}]