[{"text":["\"Dirt-powered fuel cell\" draws near-limitless energy from soil | Paperback-sized device that nestles in soil, harvests power created as microbes break down dirt.","And…….. that’s the last we’ll hear about it.","Soil powered. Not dirt.","This actually sounds potentially pretty useful for precision agriculture. A wireless network of soil powered moisture sensors could communicate with precision irrigation to optimise water use, for example.","Near limitless!!! fuck fusion I’m getting one of these bad boys!","I thought we were getting away from dirty power.","Now do one I can stick in my ass to keep my phone charged up.","Cool vaporware.","Prepare for the Dirt Wars of 2077","Microbial Fuel Cell. Did a research project on them. Interesting but not the most practical.","So, the team set about creating several new designs targeted at giving the cells continual access to oxygen and water...If I'm reading that right, they are taking soil that would otherwise be a carbon sink, and making it a source of GHGs. Of course it may produce fewer GHGs per watt than other electricity sources, or it may not, but I doubt it's a shame that this is unlikely to be able to be scaled up to produce electricity for the grid.","Dirt cheap?","So annoying it can’t even mention the actual amount of power it produces on acerage","Makes me think compost must be a potential powerhouse then.","Are we really that dumb? Let me nestle. 🤦‍♀️","Yeah…… whoever discovered this is gonna magically fall out of a window.","the sound of a round being loadedbig oil sips teabang","Just a matter of time before Exxon buys up the patent and “buries” it","Ima call bullshit on this one.","Surely it can scale up and the amount of energy needed to produced the scaled up version is recovered! Let me buy this landfill and tear down this waste to energy turbine and install these fuel cells.Oh no!Keeping the right environmental conditions, such as substrate availability, pH levels, and temperature, for my city powered by microbial fuel cells is taking a lot more ENERGY than I’m outputting!I know, I’ll build more to offset it! Let me adjust these break even points for the shareholders while I tell them it’s better than solar.","Literally destroying earth","\"Guys, we are not destroying the planet fast enough. Is there a way to destroy it faster? Like maybe some kind of device that sucks power right out if it?\"","Yup we have aliens on earth that our technology is flying but human humanity is decreasing","Oh my god. What if this will this cause the great Dust Bowl of the 30’s?Are we going to repeat the last century?","If this can be properly scaled up then damn, this could be quite the discovery (if big oil doesn’t wipe them and their research from existence)","How long does it take? It’s kinda neat as a concept, but of course right now it’s probably not up to par to replace anything","New dirty clean energy!","Make living soil gardens everywhere and turn them into beautiful powerhouses","And so, nicoli tricks again!","ok, but what is the actual power output and stability/range of it?","MITOCHONDRIA IS THE POWERHOUSE OF THE CELL, WE CAN HARNESS IT","Remember kids: if it sounds too good to be true, it probably is.","Isn’t there a shortage of topsoil right now? Not sure how this is going to be a viable solution given that shortage…","Welp, rest in peace to the inventor!","Too bad you can’t take it off-grid.","Dirt cheap power for everyone! Just stick your iPhone in the garden with your tomato plants at night and presto!","I’ve not seen a paperback that size, like ever.","Coming to a century near you…","Nickola Tesla pioneered this technology. Imagine where we'd be today had his research not been sized and hidden/destroyed."],"points":381},{"text":["Researchers use wireless sensor 5 times thinner than hair to map brain | UC San Diego researchers unveil a revolutionary brain monitoring system, enabling high-resolution, wireless recording in deep brain structures for diverse clinical applications.","See now THIS is the kind of shit that the 80s were predicting would be in 2024 and I’m here for it","TIA Is the current lingo for a stroke. This reminds me of the monitor In the children’s brains from “Enders game” (although much thinner) and actually real. Lol","Wow!! Imagine the applications, like possibly notifying people of a TIA or oncoming stroke!","so i can heal?","How do you actually build something that small?","Qanon is gonna go ballistic with this.","Another component in the matrix tech stack falls into place."],"points":11},{"text":["Don't let your GPU gather dust. Start Chopping on Salad and earn up to $180 in rewards each month."],"points":0}]