[{"text":["BT Group Converts Telecom Infrastructure to EV Chargers | The telecom giant says 60,000 curbside cabinets could be adapted","Like many places Valencia Spain city streetlights we’re converted to LED leaving a power infrastructure curbside that is under utilized. Valencia is using it to install curbside Level 2 chargers for EVs. There are probably more opportunities out there to utilize existing power infrastructure for charging stations.","I do see like tons of abandoned AT&T Telecom cabinets everywhere from land lines, but they are definitely not in spots that's easy to charge a car.What they need to do is everytime we rip and replace the roads, require multiple conduit to be installed for utilities. This can help make expanding charging and Internet a lot more easier and faster.","Sounds awesome. The only time you should charge at Ionity for £1,000/kWh is when you’re going cross country.","Nice to see an organization being inovative","Six to eight hours to charge a single car? Doesn't sound feasible to me.","You can’t get parked at one of theses cabinets even when it’s your job to work on them, so good luck with that I guess.","I won’t lie this is the only way EV street side charging will develop to a common scale in the UK. In a world without ICE’s on the road it’ll take things such as this given our government."],"points":35},{"text":["Liquid RAM Flexes for Wearables, Robots, Implants. A non-volatile version could be on its way, too.","While organic thin-film transistors built on flexible plastic have been around long enough for people to start discussing a Moore’s Law for bendable ICs, memory devices for these flexible electronics have been a bit more elusive. Now researchers from Tsinghua University in China have developed a fully flexible resistive random access memory device, dubbed FlexRAM, that offers another approach: a liquid one.In research described in the journal Advanced Materials, the researchers have used a gallium-based liquid metal to achieve FlexRAM’s data writing and reading process. In an example of biomimicry, the gallium-based liquid metal (GLM) droplets undergo oxidation and reduction mechanisms while in a solution environment that mimic the hyperpolarization and depolarization of neurons.These positive and negative bias voltages define the writing of information “1” and “0,” respectively. When a low voltage is applied, the liquid metal is oxidized, corresponding to the high-resistance state of “1.” By reversing the voltage polarity, it returns the metal to its initial low-resistance state of “0.” This reversible switching process allows for the storage and erasure of data.","Can it run Tekken?","Wetware","In 500 years people will be finding plastic containers filled with liquid gallium in their crawl spaces and attics filled with people’s porn stashes.","Yeah but can it run DOOM?","Prepare the Acid RAM!","too many tabs open, gotta get more memory liquid-Billy Gnosis","Great just one step closer to the T-1000","But I WANT to wear the volatile version! 😩","Just started reading Prey by Michael Crichton and I’m getting nervous","Hello /r/titlegore"],"points":49}]