[{"text":["Toyota’s chairman doubles down on his electric car skepticism, forecasting that EV adoption will peak at just 30%","If the manufacturer charges 50k for a car with bad infrastructure because no one is developing it (electric cars) and they also have the same car but with gas engine for 20-30k with a well established infrastructure guess what the customer wilk chose.And even in this scenario, electric cars are still being sold, so that should say a lot about the customer's desires.","I currently drive a Tesla Model 3 and am seriously considering a RAV4 Prime right now. Totally sold on electrical, despite the absolutely abysmal quality of the Tesla, which is a good electric drivetrain in a crappy quality car.The RAV4 is interesting for a few reasons:- Toyota quality. Our 15 year old Highlander is in better shape than the not-even-four year old Tesla. The Tesla has to be sold before it racks up more maintenance (already out of pocket $4K and I'm just out of warranty, another 4-6K is supposedly on the way.)- It's an actual SUV (which the model X/Y are not.)- Full electric range is within my normal envelope. As a Hybrid, I'd be driving electric-only 99% of the time, without hauling around 70-odd KWh of heavy, expensive battery.- Road tripping will be vastly simpler. A few places that I cannot make work well, maybe at all, with the Tesla are trivial with a Hybrid. Even places that are easy with the Tesla are easier with a Hybrid.- If I want to tow or carry a canoe on the roof, I can live with the range hit. Easily.- I just looked: the last time I paid for supercharging was July 6 of last year. I really don't need the supercharger network.It's not clear to me that Toyota is going about this wrong. It may well be that consumers are thinking about this wrong. Enough full-electric range is probably around 50 miles. For me, anyway. Even 20 miles would take care of a huge chunk of my driving.","30% is significant. Also, this is a long term thing...not just what will happen in his lifetime. He'll be dead and gone and this won't age well.","I think He confident Toyota can Carter to remote / utility / military needs. Those areas are difficult to electrifiedAlso every nation has different speed transition to EV","This is going age like milk.","Is it already over 30% in Norway?","Toyota; the Kodak of the automotive industry.","If I were a shareholder I'd be looking to remove such an obviously incompetent manager. Of course EVs aren't going to peak at 30%, especially not in richer countries with the money to transition to electric infra.","Current trends seem to support his skepticism.Time will tell if this is a smart move or not.","I am never ever going back to an ICE car. The money I’m saving on gas and maintenance is amazing and I love the thing.How any automaker can be this far behind is beyond me. The world has shifted and they are not keeping up.","I want a hybrid, I think EVs are still 50 years out to be worth it.","Are we witnessing the beginning of the end for Toyota?","remind me in 10 years to post this to r/agedlikemilk","His relevance is revealed in the title where if they called him by name nobody would have any idea who he was.The future is going to enjoy quoting this guy","This is the same company promising a 700 mile range EV.","Toyota must really be banking on hydrogen car development. I hope it works out for them but I imagine it will take a long time to perfect and develop infrastructure.Right now existing hydrogen cars only take 5 minutes to fill up which is already amazing.","Make ‘em work in the cold and go farther as well as fast charging or easy battery replacement and they’ll sell","Who cares what this dinosaur thinks. Renewable energy is the future. Electric vehicles must be adopted. We cannot continue to strip this planet of its livable habitat and warm it beyond its tipping points.","Toyota doing their best Sears impression","As long as these cars remain outside prices for people who need them most, he's probably right. Rich activist types move from fad to fad faster than white girls buy new water cups.","Well this is just a really dumb take. A futurist has to consider any possible likely evolution of technology. Yea, with TODAY’S technology EV will struggle to capture more than a minority share of the market. But to stick your head in the sand and pretend that technology doesn’t move forward is preposterously short sighted for the leader of a company who employs one of the largest engineering organizations in the world. There are dozens of technologies incubating as we speak that will completely alter the coarse of EV capabilities and subsequently impact adoption. Most of these are TRL 2-4 as well! I could understand if you had a slew of TRL 1’s waiting on evolution. But we are WAY past that on many battery, charging and power generation techs!","\"Why would anyone need a computer in their home?\"-the same type of people","I think the whole electric vehicle concept is floored and not very environmental once you take account of gouging out all the materials for batteries and the cost of upgrading everything from power networks to roads as they are way heavier. In time people will realise what a colossal waste they are.","I just want PHEV with 100mile range. It will cover 90% of my commute and will still let me go hiking without risk of running out of charge."],"points":102},{"text":["'Our long-term objective is to make printing a subscription' says HP CEO gunning for 2024's Worst Person of the Year award | Not satisfied with merely bricking printers, HP now wants to own them all forever!","I will NEVER buy another HP printer- no way I’ll support this nonsense. Brother printers from here on out!","My long term objective is to never buy anything from HP.","The Brother b&w laser I've had since 2008 will do just fine, thank you. The few documents I do need to print out here and there are perfect in monochrome, and if I care enough to print it in color most any home printer would be inadequate and far too rarely used and expensively maintained. Thanks moron corpo drone #4487 for your wonderful insight, just confirming how correct my path was.","I had to read the article to make sure it wasn’t a clickbait title, but wow it’s actually real.As if owning a printer couldn’t get worse…","Still using a canon laser printer from 2010, only on my second toner cartridge which cost $60. Don’t think I’ll be buying consumer HP products any time soon.","Reminds me of when the CEO of Coca Cola (Daft, 2001, appropriate name) dreamed of each and every home having a tap that served Coke.HP died a long time ago, no longer an engineer-driven company, now run by greedy execs.","Who still needs to print things so badly?I can't speak for all businesses, but as a personal user and small business owner I haven't needed to print anything in years. The few times a year I actually need a physical copy of something, it's easier and cheaper and less hassle to just put it on a USB drive and take it to my local FedEx store.Printer companies are making themselves obsolete. The technology has not improved in 20 years. They are the most user hostile products there are. EVERYONE hates printers and printer companies.","Suddenly, sales of pre 2005 printers have skyrocketed.\"It is unclear why consumers are so interested in ancient technology.\" -CEO","The real money is in businesses where they print a lot, and those places ALREADY use printing as a service because they lease those big copiers. They can't break into that market unless they can also provide on-site service monthly.For consumers, this will only piss them off right into the arms of Brother, Canon and Epson.","Pulling the plug on my HP inkjet and swapping it for a Brother laser printer was an indescribably liberating experience","This just made my decision easier in picking a new printer.","Anyone have the phone number for their Canadian repair department? I’ve called many online numbers and always get told to call another department and can never seem to find the right one. Warranty is still good, printer stopped working after 3 months of light use. Paid $800 for this piece of garbage.","just stop buying their stupid products, they can do whatever the fk they want to ruin their company.","I haven’t purchased an HP printer for years, a very shitty company.","Bought a printer 5 years ago, only used it until the ink ran out. Never needed it after and ended up throwing it away because nobody wanted to buy it on OfferUp. Apparently HP didn’t get the memo, nobody prints things anymore.","Ok.But you will not be responsible for 100% of the cost and labor for all forms of maintenance for the printers you now exclusively own.I dare you.I fucking DARE you to pull that trigger. I fucking DARE you to make the frankly eldritch issues printers get constantly into your exclusive problem.I fucking DARE you, HP","The ubisoft of printers...Go Brother.You're welcome.","\"Fuck no.\" - consumers. Just bought a brother printer and it's working fantastic. Little expensive but thus far worth the investment in spades. Haven't had to replace any toner despite printing more than my HP envy has EVER printed in one \"ink replacement\" cycle.Fuck HP and stop buying any of their products. I say this as having used to do presale tech support on their enterprise equipment ( and at that time really loving their products.). Down with all subscriptions! They are anti consumer!","I’m amazed of this next level of stupidity!","The reality is HP has signaled they’ve lost the race in other technology fields so they have focused in this space to keep themselves alive. I’d be very worried as an HP employee because draconian moves like this are usually the beginning signals of much larger activities that usually result in divestitures or layoffs","Stick with a Brother, thanks","Haha HP is crap anyways but fuck this guy.","Next time I’m getting a brother laser printer and be done with it forever","Everything wants to be a subscription.  It doesn’t even make sense.","If hell exists, the HP CEO should go to the lowest level possible next to or in the boiler room of that level after death.","HP gunna be wondering in 10 years or less how a heretofore unheard of company became the new tech and printer giant.","HP has been trash for the last decade, at a minimum. No clue why anyone would still be purchasing their products.","And one of the best reasons to not buy into any of it anymore.Recently pointed out the difference between update, upgrades and sabotage, got thrown off the sight for pointing out the obvious especially with always on the net connections that are unseen and always spying on everything you do, which is just another example of a stolen tech not intended for public or private use but something very specific for survival.N. S","This right here is the definition of pure evil","I just bought a Brother printer with Toner cartridges instead. I spent too much money on ink-jet cartridges that dry out because i only print a few times a year. Im just sorry i didn’t do this sooner.","Thankfully our HP Printer just died. It actually lasted a good 10 years.Back to a Brother Laser Printer.","Best decision I ever made for my business printer was turfing my HP printer and picking up my brother laser one, thing was $100 and been working for the last 10yrs","Don’t buy HP, problem solved…","I am done with HP. Just adding my hat to the ring in case anyone from HP researches this thread because I want them to see how overwhelmingly unpopular this is.","Companies like this should go out of business.","I just finished the cartridge and ordered a brother printer","As a lazy person, I like this model. I can completely ignore my ink levels for less than a couple Starbucks drinks per month. I get that’s it not for everyone, though.","I have been consulting on pay-per-page projects in the 2010s. This is neither new nor unexpected, least of all it’s an HP-only thing.","Stop printing","It's already this way in commercial settings.You never own the printer. You subscribe to the \"service\". You pay a fee for the printer, you pay for the ink, you pay for the service, you pay PER PAGE PRINTED, but you will never own the thing.We recently got a new printer at the office.","I used to be a sales rep for HP and it was incredible how they'd overlook sales of every other HP product to priorize only printers. Sold two Omen desktops? Why didn't you bundle a printer with them??? Sold a printer? Why didn't you bundle the ink subscription, Best Buy warranty, and a stylish cover???","Ars Technica article implies it’s a scam related to a theoretical threat. Either way, the solution would be to sandbox the print cartridge code rather than prevent other ink cartridges from working.HP’s old Laserjets were great, but I wouldn’t bother to own one of their modern ones for this reason.","It’s because he knows that printing is a dying technology. It won’t be long now.","If they want to kill this industry and force absolutely every single thing online, which was always inevitable even if far away, this is the way to do it, and quickly.","Anyone else notice the rising cost of printers? They used to be as cheap as $60 bucks now I’m seeing them for $200+","Well… me thinks deskjet tech is likely mature (indicated by move to screw customers rather than improve tech). Time for someone to step in with competition and serve the customer need.","If they make one that won’t jam take my money, until then F off.","If he is talking about business printing this is already the reality. The machines are provided to the business and the business pays per print.","And that’s why I don’t own a printer","Put him through the shredder!!!","I found a 400$ brother monochrome printer at a thrift store for 10$ and Im already in love with it over my shitty epson that wont print black if the cyan is low","Good place HP should start with their business is getting the printers to actually work","No.","I just bought one of their printers and made sure to read the terms. I declined all their subscription bullshit. We’ll see if it keeps them from bricking it.","If HP printers are sold at a loss, I may buy one from time to time, sell the cartridges and bin the printer. I’m also happy to loss-lead on fucking HP up the bum.","How do you serve a M$ bonus to a literal POS?","Do they want to go bankrupt? Cuz when you have an evil plan, youre not supposed to tell your customer, you do like netflix and make it progressively worst until its complete garbage","Wow the other printer company PR departments just got a freebie.I got an Epson eco tank. Costs more for the printer but the ink is insanely cheap and it’s just bottles that’s it.","Good I hate printers, they can have them","Ok you want to make it a subscription? Then I want the printer for free, with free replacement printers (24 hour max delivery) every time your printer breaks.","So…just don’t buy a HP. Unless their model is to give you a free printer and you pay on demand.","Sadly most people don’t pay attention so they will continue to buy HP and complain instead of the obvious solution of buying any other brand. Be one thing if HP actually made really good printers but they don’t. They are cheap crap, prone to breaking and losing their way when need them. Instead they are like the off-off brand of printers that everything mistakenly thinks is the name brand.I got a Brother printer around 7 or so years ago. Besides occasionally needing to reboot, zero problems in all those years. Whenever need to print, just works.","Brother is the way","Fuck hp"],"points":373},{"text":["AMD’s new frame generation technology can boost FPS on most PC games","What’s the downside?","Thanks nvidia.","I don't want fake frames I want real ones!","This tech is amazing, I believe \"lossless scaling\" using similar stuff and that program made my otherwise 30fps game feel so much better on my aging 1060.Minor artifacts though, but worth the fluidity."],"points":8},{"text":["Mass exploitation of Ivanti VPNs is infecting networks around the globe | Orgs that haven't acted yet should, even if it means suspending VPN services.","We've to learn of these critical patches from news outlets rather companies responsible reaching out to us."],"points":3},{"text":["SAP is restructuring 8,000 jobs as it shifts focus to AI","Crazy how sap still has a stronghold in the ERP market. They are somewhat overpriced and extremely difficult and costly to implement.","I used to work for SAP. SAP's most significant achievement is convincing everyone that it is a software company. However, it is not; rather, SAP is a company that sells software. The key to their success lies not in the quality of their software development process but in the effectiveness of their salespeople.","Seeing that they openly support Nestlé is all I needed to know SAP is an unethical business. So this does not suprise me in the least.","Putting the horse before the cart again aren’t we SAP?","I have zero confidence in SAP delivering a useful AI product.","[deleted]","So begins the dismantling of our society as we know it, soon the ruling class vs peasants will be back upon us. the need for profit over humanity meets the constraints of the pocketbooks of the humans they shun.","Man.. I just do not like SAP. I’ve used it for years. I despise it. It’s so annoying… not to mention ugly as shit.","SAP dumped $4.5 billion on Business Objects, then pretty much deleted the product. Kind of says a lot about how they run a business.","SAP is one of those corporate monoliths that is so outdated in its tech but so ingrained in the corporate world that it will exist long past being productive for its clients. It’s essentially the model for a corporate product’s stickiness; become essential in a workflow that controls billions of dollars, be so understood that you create SAP job titles within all corporations, profit.","Why is this being allowed?"],"points":151},{"text":["AI will make scam emails look genuine, UK cybersecurity agency warns","Jokes on you—I don’t check my email","We need to move much faster on data signing in general.C2PA is being developed to guarantee the authenticity of photographyEvery user facing IT system needs to get electronic signing of its incoming communications.","That won’t happen. The misspellings and bad grammar are on purpose to weed out the less educated.","Add those to the other 50k unread emails on my phone, who gives a crap.","The reason scam emails are so obviously fake is to filter out anyone smart enough to see through (and report) it.","There are SPF, DKIM, DMARC, and other security related records/features that validate the original sender. It's very easy to verify the authenticity of the sent e-mail/domain to make sure it's coming from the business the core text says it's coming from. If only the free e-mail providers integrated those checks for inbox delivery. If only. Looking at you, microsoft.","Spellcheck would make scam emails look more genuine.","Say something more obvious in your headline…. Sigh","It’s really going to hit older generations hard especially. Getting a deepfake audio phonecall or video is going to con a lot of people.","Cant wait until AI tries sell me NFTs to prove its emails are genuine","Look as real as you want. I don’t answer emails anymore. I go directly to the source. Problem eliminated.","If you don’t know, you need at minimum two email accounts at all times.One to sign up for spammy shit, and the other one for professional things like work, applications, maybe bills.You can expand it from there and have email accounts for various other categories of things. But you need a throwaway, usually a yahoo, email to hand out for the free trials and garbage websites","People check their emails?","Don’t scammers purposely make them not look completely legit? And its not like scammers can’t make a genuine looking email right now.","But isn’t the whole point usually is scam emails being poorly written so it weeds out the less gullible"],"points":33},{"text":["Mother of all breaches reveals 26 billion records: what we know so far","The supermassive leak contains data from numerous previous breaches, comprising an astounding 12 terabytes of information, spanning over a mind-boggling 26 billion records. The leak, which contains LinkedIn, Twitter, Weibo, Tencent, and other platforms’ user data, is almost certainly the largest ever discovered.","There is higher chance off guessing my social security number than of them using my data after it’s leaked."],"points":2},{"text":["Exclusive: Boeing presses suppliers on tightening bolts after loose parts found in 737 MAX 9 checks","Are they saying they don't inspect the work provided by suppliers?","Just a prime example of CYA , finger pointing, blaming others","Boeing issued a bulletin to its suppliers late last week that laid out practices to ensure bolts are properly torqued after multiple airlines reported loose hardware during inspections of the grounded 737 MAX 9, according to a memo seen by Reuters. The U.S. planemaker said that it is \"imperative\" that suppliers meet quality requirements, according to a Jan. 17 memo seen by Reuters, issued weeks after an accident when a panel ripped off of a 737 MAX 9 jet while in mid-air. \"Ensure that work instructions are mistake-proof and quality is continuously monitored - particularly torquing requirements,\" it states. The bulletin suggests suppliers document torque requirements on work instructions, require mechanics to record how much torque is applied when fastening components, and ensure tools are properly calibrated to ensure bolts are properly tightened. Read the full story for more.","Everyone needs to watch “Downfall: The Case Against Boeing” on Netflix.This wasn’t an accident. This was an eventuality. Boeing has transitioned from a great engineering company to just another cost cutting business.They are treating airplanes like any other product that you can just slowly cheap out on more and more each year.When it comes to flying, if it’s Boeing, I ain’t going. They are the Spirit Airlines of plane manufacturers now.You couldn’t pay me to get on a 737 Max.","Boeing needs to go back to having engineers leading instead of people with MBAs.","There's always somewhere else to point the finger. That's the beauty of aviation in America."],"points":81},{"text":["I made a puzzle game where YOU design a puzzle and AI solves it. It turned out incredibly deep, challenging and fun! Check it out!"],"points":0}]