[{"text":["A Franciscan friar has the pope's ear on AI and how it can help — or hurt — humanity","Look out AI, the pope is on the case!","Religion is cancerous."],"points":1},{"text":["Got some beefy PC hardware... LET IT COOK. Put it to work earning you fresh rewards by chopping on the Salad network. Earn up to $180 a month. Dust off your aprons, it's time to get in the Kitchen."],"points":0},{"text":["Google DeepMind co-founder Mustafa Suleyman warns AI is a ‘fundamentally labor replacing’ tool over the long term","this would be a good thing if we weren't so cruel.","In other news, the sky is blue. People that are all gung ho about replacing everything with AI seem to be blind to the negative effects of it so far sadly, even when they are already causing problems.","Eat the rich.","Is it just “labor” replacing or it can replace management roles too? How are you training that? Wink wink","20 years ago I worked at a shop making Pilates equipment. I made the schedules and work orders for everyone, in Excel. Very quickly I had automated myself out of a job.If anything I wish programmers focused more on building solid code and leaving it the fuck alone instead of the constant cycle of updates. But then that's the whole system, constant updates, must be new, must break new ground.Imagine this in the automotive industry, if every year your screwdriver had to be updated. Well, fuck, actually welcome to the new automotive industry. Tech has infected everything to ridiculous levels. For every well made electric impact out there, there are a thousand digital tire gauges that fail.","Jokes on them. When everyone is poor and unemployed the consumer economy will collapse in on itself and we’ll all eat the rich. FA;FO","All technology is labor replacing.","And still I need to have a human cut my hair.","I don't think AI will ever replay humans in the bum fight videos, so there is that.","Ok.Thanks for prophesying bad weather during a downpour. AI is inevitable. The many different unaligned parties that are working on it, will ensure it’s development in whatever way it can. Maybe we can start to realistically think of positive ways to deal with it?","Ok guy, and crypto is going to replace our existing currency system. This AI hype is just like the crypto hype","just start with the ceo"],"points":97},{"text":["1 in 4 CEOs planning to replace workers with AI this year, according to recent poll","Can we replace CEOs and boards of directors with AI with empathetic emulation algorithms and imperatives that mandate that a level of business ethics and market stability are priority?","Humanity is such a mess","The government should implement an AI tax and create a program with that money where people who lost their jobs to AI can claim a check lol.","These people have not used AI much if they think this is a good idea.","3 in 4 CEOs nudge the fourth and mutter \"Shut the fuck up\".","but i thought they were precious job creators?","AI is more suited to replace CEO and directors jobs more so than replacing employees","\"Planning to\" isn't the same as \"will.\" Plus, if they think they can replace some people with AI, sure as shit we can replace them with AI. I can definitely see a world where an AI trained on business ethics and current market conditions calls the shots and not these psychopaths.","Industrial Revolution in the 21st century is wild.","Everyone’s got a plan till they get punched in the mouth","I predict a lot of failed attempts in the next five years","Time for universal basic income.","Fire everyone and hold wages down to fatten your profit margins without lowering prices. Then complain that people are flocking to cheaper Chinese products. Have the government pick up the tab. Rince, repeat.","TIL: 1 out of 4 CEO’s don’t understand today’s AI.","1 in 4 companies go bankrupt over inconsistent output.OOPSIEDAISY. WHO COULD'VE THOUGHT OF EDGE CASES? Like ChatGPT unable to fix my PyTorch concerns.","Have fun trying to implement and maintaining them. It's not a mature and reliable technology. It's a buzzword right now.Oh and AI's can also do CEO jobs by the way.","If the CEO was shown this picture, they would immediately thing this is AI and think reduction headcount. A bunch of IRobots doing something.","So these are the big brain ideas CEOs make tens of millions of dollars a year for.Could have asked anyone and most of them would have said AI is the future.Decisions like this just make it seem more and more like CEOs are becoming more obsolete as time presses on","Is AI and robots gonna buy their shit? Like when are they going to realize robots don’t buy stuff.","In this thread: people who didn’t read past the headline or understand what a ceos job is. Anyway, the actual survey: https://www.pwc.com/gx/en/issues/c-suite-insights/ceo-survey.html","We need to start replacing CEOs","THEY TOOK ERRRRR JERRRRBSSS!!!","CEOs should be the automated ones and distribute that wealth properly.","In other news: At least 1 in 4 CEOs are easily swayed by hype technology they do not understand in the slightest.Just for clarification, I am not saying ML as a technology is bad in any way, it can do amazing things. But it also has serious limitations and risks, and people who start yelling \"Terminator! Terminator!\" the moment the technology is mentioned are utterly clueless."],"points":183},{"text":["Samsung is making a Galaxy Ring - The Verge"],"points":0},{"text":["Sheryl Sandberg to step down from Meta board"],"points":0},{"text":["NBCU Launches New FAST Channels on The Roku Channel"],"points":0},{"text":["Seagate Unveils Mozaic 3+ HDD Platform for 30TB+ Drives"],"points":0},{"text":["Web3 Hub Davos 2024: Set To Elevate Discourse On Blockchain Technology","Haven’t we all moved on to the new AI grift by now?","Lol buttchain again. The database no one asked for."],"points":10},{"text":["AI can change the world but not if we leave people behind","Responsible AI is going to go exactly in the direction of climate change preparedness: nowhere.Everyone who has a job that can be done by an AI will probably lose that job. AI will create new jobs....that will also be done by AI. The future is going to look so much worse than the past for most people. No political party is going to do anything about this. We can't even get legislation about pitbull attacks, you think they are going to stop AI?Abandon all hope","This is horribly naive nonsense. Give 5 people a choice to compete for $1 mil or cooperate and split it equally & someone’s always going to compete to take it all, even if pretending to cooperate at first.It’s human nature to compete and it’s why we’ve evolved to where we are, so people will likewise always be left behind.AI and quantum computing is the new arms race and there will be dominant winners and losers. Dominance will be like having the only nuclear arsenal.You don’t stop and share tech secrets along the way when you think you can win the race, and you don’t invest heavily in something that brings value to people and then give it away for free.We’re not far from a time when wars will be won purely with drones, machines, AI and hacking. Let’s put the whole “equality for all” thing aside and aim for top level dominance first, before China and North Korea have a million bot army superior to ours and the ability to hack into all our encrypted networks and data.","Farmers, miners, manufacturing workers and retail workers were all left behind. These people are the majority and will not have mercy when office workers join them. Perhaps when accountants, realtors, legal clerks and customer sales representatives join the typists, printers (this used to be a human job), computers (like, a person who does math for a company that cannot afford a computer) and typewriter repairmen they'll demand a better society for everybody not just wealthy people.","I think it's crucial to consider the ethical and inclusive deployment of AI technologies, fostering accessibility and equitable benefits for all members of society. This approach promotes not only technological advancement but also social progress, emphasizing the importance of responsible and considerate integration of AI into various aspects of our lives.","Let's list off all the great technological advancements that could have changed the world but instead just widened the gap between the first world and the third world. I'll startThe internet","AI removes meaningless jobs. In the same way the internet removed most news and postal services, new jobs will be created. If anything AI and automation done right clears the poor and leads the world to plenty and not scarcity it makes things easier so eventually generative AI will be so good that imagination is the limit. AI is progress, nothing more or less. The only issue is if selfish opportunistic people care more about themselves than the future."],"points":13},{"text":["The reasoning for the Substack exodus is a tad pathetic","No. They host and recommend nazi content. They deserve everything coming to them.","You lost me at \"screeching leftists\" Nazi sympathizer.","its not really rocket scienceits deliberately and intentionally providing a platform for hate speech - and'sunlight is the best disinfectent' is what you say about people who are doing something illegal that are gonna get arrested for it - its simply not true for bad ideasif youre a business partner with the nazis you cant fucking expect the jews to stick around - everybody has already seen how that works out and theyre not gonna be a part of ithedging our bets and ditching substack? THAT is a 100% safe move","Reddit reasoning right there...ban microphones. Someone used one to say something bad!","This post is a honey trap for MSNBC bots."],"points":17},{"text":["Google CEO tells employees to expect more job cuts this year.","\"Sorry guys, we're doing better than ever with record profits and massive growth, we're going to have to let you go\"","Can’t wait to hear what kind of a bonus the CEO gets. I’m sure that will reflect the hard times Google has fallen on","It is pretty tough time in tech industry right now.","From CNN last year: “Sundar Pichai, the CEO of Google and Google’s parent company Alphabet, made nearly $226 million in 2022, according to a new filing from Alphabet.”But, yes, do go on about how more job cuts are needed for the good of the company.","\"Pichai said the layoffs this year were about “removing layers to simplify execution and drive velocity in some areas.”\" Fancy words for we treat our employees like disposable garbage.","Live long enough and you become the villain","Maybe Sundar should look inward and quit his job instead.","Seems like a good way to encourage all your talented people to jump ship.","Notice how these people reach for firings instead of upper management bonus cuts when they need to balance the books.Lizard people the lot of them. Absolute heartless sociopaths.","Any chance the cut starts with him? Google doing bad was overseen by him, he wasn't just hired on...","Dude is catching up to Balmer. He is the worst tech CEO in decades.I am shocked the board hasn’t fired him. Just look at their stock price compared to Apple and Microsoft. Look at Microsoft’s leapfrog of AI. It’s fucking embarrassing and if I owned Google stock I would want him replaced.","Google has no idea what they’re doing. For context, I worked with a guy this past year. He joined our company as the engineering manager of my team. He had recently been laid off by Google. He worked with us for 3 months, before being hired back by Google. I didn’t blame him, because they offered him a $750k salary with a matching stock option. So that’s $1.5m, you’d have to be crazy to turn it down.Meanwhile…they just laid off a bunch of people and are laying off more? What in the fuck is going on over there?","Tech been over hiring as a growth metric for years, seems they’re front running the recession. Cut now cuz it’ll look really bad in a recession.","If the last few years in tech have taught me anything... If I ever go back to work in that industry, I will expect shares up front...","This guy has been utterly useless at Google.","This time I’m gonna try not to cry. -ceo while laying people off over zoom","I hope this fucker dies choking on a golden fucking pretzel. Google makes so much money, this guy makes so much money. Piece of shit.","Seems like we may be headed for that recession we’ve been looking for to bring down inflation.","So far AI is creating a lot of new jobs./s","So that’s why Google search is getting shittier","Everyone should be telling everyone to expect major job cuts over the next 15 years as the job market is going to contract a huge amount. Many many jobs are going to fall to automation and corporate profits are going to continue to spiral upward.","Always more profits for those at the top tho","Isn’t google still insanely profitable????","Billions of dollars profit and 12 month high share price. Yep. Capitalism working as intended.","Should have started with Sundar Pichai. Services are slowly going downhill, missed the big jump in AI despite talking about it all the time. And constant axing of services has destroyed trust and adoption of anything new.","It was predictable.Google's been having a rough time, loads of projects biting the dust. Now, they're trying to shake things up by letting some folks go and bringing in new blood with that startup vibe.","The economy is doing great, right? It's not like thousands of people have had a hell of a time getting white collar jobs because of stuff like this.","AI is not taking the jobs of tile-layers and trench-diggers nor plumbers and electricians!20% of nice jobs gonna bust into flames and profits into shareholders pocketsWhat happens to the plumbers and electricians?","The sub should be renamed r/TechLayoffs cus that all the innovation big tech is doing.","Vest and rest is over.","That’s funny can we expect pay cuts for the executive team?","AI productivity tools are beginning to make efficiency gains?","Does that include your job, Mr. CEO?Right…?","Fuck he looks delicious. Lean, brown not too tough. Looks like meats back on the menu boys. Seriously tho FUCK. GOOGLE. And eat the rich","May all those laid off end up working for their competitors. Or better yet, may all those laid off pool their collective talent and start something bigger and better, that drives these mega corps into the ground.","Will he be cut?","No pay cuts/firing till executives get fired(with no pay), first.","Google engineers don’t do shit anyway. They stand around and white board their ideas and play ping pong all day long. Nothing gets done","Hopefully he is at the top of the list.","Hopefully his end will come too.","“We are a family”","\"Hot damn it's a new day❗\" - Pharrell","I think they're referring to you, Fuchsia.It's got to go. Microsoft killed Cairo. Apple killed Copland. Sometimes you gotta admit the second system effect ruined your project and it's time to just flush it.","Record stock prices and job cuts. The greed never ends.","I need my millions. Thanks for your time here.","[removed]","Cut his job","How many hours of ads do I need to watch to save these people? It’s already ridiculous","And he keeps telling us A.I. is good.","And more raises for him","Why are they constantly hiring at the same time they are firing? It's so weird.","Why don't they let him go? Dude hasn't invented shit when he came in and has been riding on the coattails of his predecessors.","Why doesn’t he remove himself instead?","At this job, we’re family","I’ve been in tech my entire career, 25 years – I saw this headline and said “fuck you.”","Garbage company","how else is he going to make $200 million again this year? gotta make those cuts","I expect to use less google products by the end of this year","This really doesn’t make sense. Why don’t they cut their pay?","At least the Meta layoffs ended at some point. Google just seems to be constantly inflicting this mental torture on their employees for no apparent reason.","Great for morale!","Here's a thought why not get rid of ceo? The workers are what makes the company run.Good read- https://www.cnn.com/2023/09/18/business/ceo-pay-unions-strike/index.html#:~:text=Since%201978%2C%20the%20CEO%20compensation,Institute%2C%20a%20progressive%20think%20tank.","Please do go on about your own “accountability” for this mess…","That $200 billion in profit means they gotta tighten their belts","How about the job cut starting with him.","Way to boost morale!","Lmao, they’re gonna look for jobs while slacking the fuck Off. What a moron","These fucking corporations","Someone should tell Google how shit the search function is and fire that CEO, since chat GPT 4 there is no need for google no more..."],"points":2239},{"text":["Apple will avoid ban by selling latest Apple Watches without blood oxygen feature","Hardware production lines are likely not going to change. Chances are the sensor will still be present, but disabled in software.","What, exactly, is Masimo asking for that has Apple behaving this way? Some absurd percentage? Or like $2/watch but Apple is opposing on principle? I have read the press releases and news, but I am not clear on what the hang up is.","If this it will be disabled by software, will they also disable the feature in watches that are already out in the market? I don’t use it often, but if my o2 sensor in my AW9 is disabled I’ll be kinda pissed.","Now the question is, will they lower the price?","More money, less feature.","Will they also be lowering the price to reflect the loss in features?","Massimo should just submit an app to the Apple Watch store and reenable it themselves.","Why are they not just paying the people the pillaged the shit from and be done and over with?","Hopefully it will come back after modification to avoid the patent issue.","this has seriously been posted so many fucking times - enough"],"points":192},{"text":["48,000 companies sent Facebook data on a single person | A Consumer Reports study found that thousands of companies contribute to Facebook’s data stores on each person.","Listen these companies know everything about you. More than you know about yourself… I’ll leave it at that.","I don't know why this is shocking. To do re-marketing on Facebook you need to have their tracking pixel on your website.","I don't understand why this news. That's just online ads for ya","Dumped my Facebook and social media in 2009. I use Reddit and I delete my Reddit account every year, also use nuke Reddit to delete my posts every couple weeks. I dont have any Google accounts, just Apple email. I’m really curious what Meta may have on people like me.","I call shenanigans on this. In the life of the internet, I’ve bought two items from internet ads. Less than $40 total. They do such a poor job of matching me to products that it hardly seems like that is what they’re trying to do.","https://youtu.be/jv3DbakwIbo?feature=shared This will help you understand better"],"points":13},{"text":["IBM scraps rewards program for staff inventions, wipes away cash points | Big Blue staffers aren’t pleased to lose out on potential bonuses","Ahhhhhhhhh, let’s be pennywise and pound foolish is still the motto at big blue.","Goal: become competitiveMethodology to achieve goal: reduce incentives for innovation.“No one wants to work” /SurprisedPikachuFace","My first job out of school was working for IBM. This was entry level non-permanent, non-salary, job as a bench tech.The employment contract included a clause that said that if you patented anything while working for them, even in unrelated to your work, they own the patent without giving you any additional compensation. This was pretty shitty.I am not sure how enforceable that would be on anything completely unrelated to anything that IBM does, but you would likely need to go up against an army of corporate lawyers in court to find out.","Worked for IBM for two years. Awful company, awful pay. A senior administrator position was 55k a year and their excuse was “you’re making competitive pay for the area.” Yeah the college town you made me move to because the average pay is 20-30k entry level positions.Beyond that the company was scummy as shit. They had promised the city they’d bring in a certain number of workers in exchange for tax breaks and incentives to be there. Instead they hired remote workers and contractors and placed their name cards on empty desks. Whenever the city would come by for a census, they were “out sick that day, but here’s their desk”. No one has sat there for 3 months!Ontop of that you could set your watch by the layoffs that happened regularly like clockwork. CEO takes a multimillion dollar bonus but we can’t afford 33% of the employees in your office. We regularly had grief counselors come by because people were getting laid off so regularly.The words “raise” or “promotion” were taboo. I was one of three people to get one in the entire building while I was there.Longest day I ever worked was at IBM totaling 27 hours straight before I finally went home to sleep then got a call 3 hours later complaining that I wasn’t on a meeting.IBM has been reduced to a sweat shop that treat employees like cattle. Once you’re burned up and can’t give anymore, they lay you off and find a new cow.What’s incredibly sad is that it was an awesome company in the 80s and 90s that actually treated their employees well. Then greed took over and everything went to shit.To this day, I believe IBM takes contracts and customers they never intend to fufill because paying penalties and losing brand integrity is cheaper in the long run as most companies will just write off the loss when IBM fails to deliver. This company will spend a dollar to save a penny at the customers expense.","They aren't getting rid of the entire system just the direct cash offers for it. I'm not an IBM employee so I don't know if this is an actual improvement, but it's hard to beat hard cash dollars unless IBM is willing to give an equivalent amount of PTO.","The article does not paint the full picture. I work for IBM and am very familiar with the patent process. Previously they would give each inventor $750 when a patent was filed. After 4 patents (or 12 points), they would give you a plateau award of $1250. The new award program simplifies this and now you get $1300 for every patent filed, but the plateaus and point system, along with the associated awards are gone.It actually is a net positive if you just look at the dollar amounts. If you filed 4 patents previously, you'd get $4250. With the new system, you get $5200. Plus there's no waiting for that 4th patent to get that extra money.","Damn this is a new low for IBM.","Read “Retirement Heist”….IBM is one of the most egregious offenders of fuckin over employees. Good read…..will also make you super fuckin angry too.","IBM still a thing? Last I heard they made a robot that could play chess real good no?Guess being entrenched with the USA Government on so many layers has its benefits no?","Actual dinosaur company.","waiting for OS/3 Warp to come out and give windows another run for its moneyOS/2 warp had true pre-emptive multi tasking at a time when alt-tab in windows was \"cooperative\" multitasking. basically, everything else stopped.It's really the only competitor there was with full intent to run compatible windows software in that graphical environment."],"points":371},{"text":["OpenAI opens the door for military uses but maintains AI weapons ban","This isnt going to age well in a capitalism arena.","Im sure the military got the head start they needed with open ai 2 years ago.","Yes, we only want to use it to determine the mess hall menu for the week into determine how much laundry detergent we need to buy. Don't be so cynical.","https://youtu.be/jv3DbakwIbo?feature=shared Yea bs watch thsu","All it takes is a little bit of DoD cheddar to open those legs :0","How would they ensure data security for something like this? Our federal agency has a very clear “no confidential information outside the vpn” rule."],"points":14},{"text":["Apple Watches with blood oxygen tech are banned again","Just pay for the rights you cheap fucking pricks","Poaching talent and stealing tech in hopes of bankrupting a company isn't going to work.","Update January 17th, 8:52PM ET: Apple has confirmed that versions of the Apple Watch Series 9 and Ultra 2 without blood oxygen features will go on sale starting January 18th at 9AM ET. Our original story continues below.Pay more for less","I hope Apple loses this one really hard. Imagine if the tables were reversed, Apple would have been happy?","Don’t steal and you don’t have problems.Also, it doesn’t work all that well anyway.","It doesn’t even work anyway","tim crooked cook has been cutting too many corners lately, its time for him to step down.","Apple like Boing suffers from bad management.","This sub loves defending patent trolls","Apple needs to be forced to abdondon the entire Apple Watch line over this. Like, that’s it. No more watches. None. Apple isn’t even allowed to fix the problem just no more. That would be the bigger punishment than a fine. Force third party manufacturers to design new iOS compatible watches."],"points":1173},{"text":["Google promised to delete location data on abortion clinic visits. It didn’t, study says","The move would have made it harder for law enforcement to use that information to investigate or prosecute people seeking abortions in states where the procedure has been banned or otherwise limited.Maybe fix this instead of hiding the fucking problem.","Google makes a big stink about giving data to cops to solve crimes but fight tooth and nail to keep abortion data to hand over to extremists who made abortion clinic visits illegal even outside their state.An absolutely hypocritical, disgusting company that should have been broken up a long time ago.","One easy solution, simply leave your phone at another location.","what naive so and so, would trust Google to delete data?","Simple solution don’t use an android Google phone delete your Gmail app, Google Earth, Google maps, and don’t use Google search engine. Get something like DuckDuckGo way more privacy. Or just turn your location on all your apps off.","Never trust something which you can't personally confirm.","I guess the advice for people seeking medical assistance in the USA is to temporarily disable GPS etc, turn the phone off, or just leave it at home?"],"points":46},{"text":["OpenAI must defend ChatGPT fabrications after failing to defeat libe'l suit","I can’t imagine going through law school in this current legal climate. A non-insignificant amount of the things I learned have been turned on their head. I took a class on Supreme Court ethics 10 years ago and I think about that more than I’d like to admitThat being said, I’m fairly certain this suit will get tossed on procedural grounds","It is a probabilistic word predictor. This would be like suing the maker of a tarot deck because it predicted you would fail at business.","Good luck to plaintiff here. There is zero basis for this lawsuit in any legal theory or common sense.Defamation and libel have specific legal requirements, which a word salad generator which prefaces every conversation with a warning about how it's a language model and \"may occasionally generate incorrect information\" obviously does not meet.It's literally a language model, everyone knows it's a language model, and it doesn't present itself as presenting statements of fact, true or false.","This would probably kill open source AI if creators were liable for everything the model produced, rather than the users. It would also result in everyone having to use absurdly censored corporate models from megacorps who can afford to defend itself.","Skynet make ouchy ouchy …I am sure if you gotta defeat libel suit you can argue it has intellectual property over said “fabrications” no(?)","Now do intellectual property rights.","Your honor, may I present chat gpt, my lawyer for this case. It wrote that whole intro. Wait, what’s with the handcuffs? Why are you rubbing your eyes condescendingly?! Why didn’t you warn me about this chat gpt?! I trusted you!!!!!Prompt: what is the likeliest scenario if I ask chat gpt to be my lawyer?"],"points":65},{"text":["Cable firms to FTC: We shouldn’t have to let users cancel service with a click — Customers may “misunderstand the consequences of canceling,” say lobbyists","lol get fucked","\"Powell said that cable company reps can usually talk customers out of canceling. The proposed rule “could disrupt the continuity of important services, choke off helpful information and forgo potential savings. It certainly raises First Amendment issues.”\"They should be ashamed of themselves for potentially invoking the first amendment to justify harassing customers that just want to cancel their service.","Interesting that this is the cable firms' stance yet when it comes to one-click signups they trust us to understand the consequences of signing up for predatory contracts with hidden fees","Yeah, sounds about right.I canceled my cable because my roommate moved in and had a \"better\" cable/internet package. We even asked about having two services and they said it was not possible at one address.I still had to sit through all the \"deals\", and it took 4 hours to cancel a service they told me I could not even have at that location, while trying to upgrade me to a better service... that I could not have, according to them.","The problem with not giving customers the control of cancelling is that when you call customer service for many big companies, their loyalty departments objective is to keep the customer, period. Some employees even get bad marks for customers they can’t keep. What ends of happening are “dropped calls”. On top of that, many customers especially the elderly, can’t navigate through the phone tree to even get a human on the line to begin with.","When I cancelled my cable internet, the guy on the phone had the audacity to pitch me an internet package that was slower than my new fiber connection AND more expensive than what I was already paying for cable. He tried to spin it through mental gymnastics that it is really a good deal and how could I not understand what a deal it was to spend MORE money for LESS service!","That's something only a lobbyist could say and only a politician who knows the check has cleared could credibly believe.","Ars Technica’s Jon Brodkin:• Federal Trade Commission Chair Lina Khan has said that changes are needed because “some businesses too often trick consumers into paying for subscriptions they no longer want or didn't sign up for in the first place.”• NCTA, the primary trade group for cable companies like Comcast and Charter, said the [click-to-cancel] rule would make it harder to offer deals to customers who are trying to cancel.• “The proposed simple click-to-cancel mechanism may not be so simple when such practices are involved. A consumer may easily misunderstand the consequences of canceling and it may be imperative that they learn about better options,” NCTA CEO Michael Powell said at the hearing.• Powell said that cable company reps can usually talk customers out of canceling. The proposed rule “could disrupt the continuity of important services, choke off helpful information and forgo potential savings. It certainly raises First Amendment issues.”• At yesterday's hearing, the FTC also heard from the Interactive Advertising Bureau (IAB), a lobby group for the online advertising industry. IAB executive Lartease Tiffith defended auto-renewals generally, saying the practice of automatically renewing services brings “significant benefits to both businesses and consumers in the form of cost savings, convenience, and heightened value.”","“One button cancelling raises first amendment issues”. Unbelievable.If the government forces us to make it easy for the customer to cancel then we won’t be able to talk them out of canceling and that’s textbook government limiting our speech.The balls on those guys.","Think about the sunk cost! You've invested so much in us. It would be a shame if something happened to it.Euh, nope. *clicks \"quit\".","\"consequences of canceling\" LOL like not getting ripped the fuck off for garbage programming and commercials every 10 seconds?that said, they wouldn't be doing the shit if millions of gullible suckers weren't falling for it every month","If cable thinks Customers are too dumb to understand cancelation fees, and thus won't let you easily cancel, why do they let those selfsame Customers easily sign up for plans with cancelation fees?Cable isn't the worst lobby in the US, but they get bonus points for how shamelessly shit they are.","The worst practice is when you are cancelling something and they ask \"are you sure?\" Confirm \"Are you really sure?\" Confirm \"Service is cancelled effective date X\", at which point you think it is indeed cancelled and leave the site, except that way down that text there was a small line and button saying \"This is what will happen after you click the next Confirm button\", so the service wasn't actually cancelled when you left the page.","What I can’t stand is when I’m paying $80 for service… and every month I get a flyer in my mailbox from my own company saying $39.99 for new customers!!! I call them saying if you’re going to charge me double what new customers are paying, the least you can do is keep that hidden from me…. Now you’re just making me mad!!","The consequences of cancelling. What absolute dystopian bullshit.","Why is there consequences for canceling in the first place? Should be illegal","Gyms also need to get fucked","This “click-to-cancel” rule should be applied to EVERYTHING!! I have a complaint going with the Better Business Bureau (BBB) about Waste Management (WM). The ONLY way to cancel/delete one’s account is to call. I called and waited on hold for over an hour and never talked to anyone. The emailed me (after the BBB complaint) and said they’d help me out. Yesterday I got a notification that my account was cancelled (as requested) but when I went to WM’s website I was STILL able to login. Their system said something like email verified but no account associated with it. I replied to the BBB complaint that they have not really answered my problem. 1) I technically still have an account (they have my email and password). And, 2) there’s STILL no way to cancel one’s account without calling (or complaining like I did). It shouldn’t take a BBB complaint to cancel one’s account.","So people can subscribe with one click, but they are too stupid to be allowed to unsubscribe that way? Really? C'mon, pull the other one.","By that logic we shouldn’t be allowed to sign up in the first place. Because, you know, misunderstand the consequences of signing up.","For example, a customer \"may face difficulty and unintended consequences if they want to cancel only one service in the package,\" as \"canceling part of a discounted bundle may increase the price for remaining services.\"They are free to honor any pricing they want.  Why the hell would the government let them hold people hostage because their pricing models are designed to be confusing and ridiculous?","Maybe because there shouldn't be any consequences to canceling a service? Sure, if you have a contract, make sure they verify they know they are breaking the contract and have whatever they have to do to resolve that. This predatory strategy of not letting someone just cancel is horrendous.","Of course they would say this. Cause then they can argue with you and put on you on hold with 5 sales rep and a “Supervisor”.Edit: I had Everest cable internet ways back. They transferred me to 4 sales associates. They were trying to get me to not cancel. I used the same answer every time they kept trying to be. Which was “No I am not interested in any deals”. Last associate was their manager and even he tried. Told him I said I’m not interested and would like to continue with cancelling. He claimed I was being rude after they tried for 30 min to convince me.","Please go after SiriusXM and Dating apps next!!!!!!!!!!!!!!!!!!","It would be a better world if no lobbyists existed","They been talking to SIRIUS","I loved the fact that I was able to cancel my disney/espn/hulu subscription with one click and I was genuinely surprised that was it. Please let this be for every sub model.","The first amendment bit is funny. We already have laws that prohibit the way debt collectors go after people. No one has complained that prohibiting debt collectors from harassing individuals is a first amendment problem.","\"I want to stop paying you money\"\"No, it's for your own good ♥ \"","Never met a lobbyist that didn’t deserve a good fisting.","They really do hate us.","Customers may “misunderstand the consequences of canceling,”Oh go FUCK OFF.","Translation: \"No means Yes\"","Hmmm… cable companies getting desperate?","I'm glad to hear about \"click to cancel\" legislation. When I helped my mom cancel service recently I almost thought it would be simpler to chargeback until Comcast gave up and cancelled on their end.","I called to cancel direct tv three times. Three times they “canceled” it but kept billing me. So I stopped paying the bill. I’ll take the credit hit idc.","Eat a dick. It took my mom and aunt about four days to cancel my grandpas xfinity cable after he died a few years ago.","consequences of cancelingNot paying anymore?","The answer to any subscription that makes cancellation a hassle is to call your credit card company and block all future transactions. Your account will be deactivated for you in no time.","Fuck Xfinity.","Make everyone in Congress try to cancel a Comcast account. They’ll understand all they need to.","Old people will think cancelling something means they still get to keep part of it they like and then realise it later when someone explains what’s going on.But we shouldn’t be dictating policy based on 80 year olds.","\"misunderstand the consequences of canceling\"You absolutely evil and vile bottom feeders. There shouldn't be any consequences of canceling any service. You cancel, you stop receiving service, end of relationship. No threats, no additional fees, no penalties, no hooks, no consequences.","Jesus fuck.... it's just cable...not health insurance.","You heard em guys. They think we're all too stupid to understand consequence.","Lobbyists (most of them close friends with politicians, some of them former politicians) will have the final say. That's how our government works.","I completely understood the consequences and did it anyway. So there.","Nope. Make cancellation a single button option. IF there is more than one provider in your area, that would make things immediately hella better.","Another nail on the pay tv subscriber coffin.","They should check this person bank account","If there was only a way to communicate that information on a screen🧐","What an asshat! The bribe money will start flowing. Then you will see who is on the take that sides with asshat here.","Fuck lobbyists","I think most people get confused about what they actually signed up for…","lmao buyer beware my whole life but now they wanna protect me.","My bank said the same thing today when I dropped their ass over silly fees.","Typical cable company BS. I used to get outraged, now I just get laugh at them.Pro tip: if you ever go to cancel service from a cable provider just tell them you're moving to a rural area that has no service of any kind other than satellite service. Or tell them you're moving to another country. They'll process the cancellation quickly.","Good, I'll make sure not to sign up in the first place.","Our customers are too dumb to made financial decisions that negatively impact our revenue.","\"The consequences of canceling.\" A cable service. What planet is somebody on to not understand that consequence?The only time that ridiculous line works is back when I had to get oxygen tank deliveries after complications with surgery/covid to my house and I couldn't cancel without a sig from my treating physician.Now that was an annoyance that made complete sense.","But they understand the consequences of entering into your blood-pact with one click, eh?","Verizon is doing whatever they can to keep me paying $100 to their trash asses for a fucking phone","GTFOSHAMELESS GRIFTERS","Customers may misunderstand the consequences of cancellingLike.. being able to automatically restart service with one phone call?","FK all companies that make it a pain in the ass to cancel.","They may not understand the negative impact it will have on our profits!","Then spell it out in plain English on the cancellation page. This and cancelling gym memberships should be easy.","Even if a customer did misunderstand, I have full confidence that the cable companies will happily sign them back up of they so desire.","\"I misunderstood. I thought I could cancel and then continue to watch for free!\"Said nobody ever.","Consequences?WHAT THE FUCK","What consequences? Like not having to spend $200 a month?","Yeah, all those stupid customers...","NOPE we’re good!","Then the services should be free","Customers to cable firms: pound sand.","The consequences being they will offer you 50% of what you were paying if you come back","Fuck you. Tell them. It's a single sentence.\"When you click cancel, your account will be closed and you will lose access to our services.\"","I don't see why they would be opposed?Mine mistakenly cut my service and reactivated it the same day, they even had a courtesy to charged me for the privilege","I hit the cancel button and now I can’t watch my shows. Why can’t I watch my shows? I’m so confused.","That’s a threat to our democracy!","I'm sure we can figure out a way forward in spite of any such consequences.~the customers","Think it's pretty self-explanatory asshole.","Yeah, maybe that’s a you problem","They will lobby successfully, after all, who will pay the kickbacks if the big companies can't get their money through shady practices","Profile > Settings > Cancel","If they think user can misunderstand the consequences of cancelling, then surely they’d agree even more users may misunderstand the terms when signing.So assuming they care about the user, they should allow a quick and easy cancellation with possible compensation to users who mistakenly signed up for their product.That seems to be the correct way to avoid any misunderstandings… Unless I misunderstood what they meant.","its canceling , how hard can it be to understand?","How about you offer the service, keep the price where it was when signed up and maybe you won't have customers trying to cancel?","This sounds like a quote from Paulie Walnuts not a white shoe law firm 😂","Sounds like AOL back in the day","Two clics it is then.","I mean, I do “misunderstand” a lot of things. Like for one, I have no idea what that word means…….I think……","So people are too stupid to understand what cancel service means?","r/cordcutters","Wtf. Dam clown. 🤣🤣🤣🤣🤣🤣🤣","Customers may “misunderstand the consequences of canceling,” say lobbyistsI have no words.","They dance close to some possible legitimate issues, like customers mistakenly cancelling services they didn’t mean to, but I think we’re willing to take the risk if it means the overall bullshit is easier.Treat people like they’re smart. Yeah there might be some mistakes, but I think less people will make mistakes in a simpler system than in the current system.One thing I would see as a reasonable middle ground, allow the service to ask “do you need to cancel, or simply find a way to reduce your monthly cost”. Plenty of people want to keep a service but can’t afford it, and if there’s a way to reduce the cost, they should be able to discuss it.I’ve seen plenty of people say “it costs too much for my cable package, cancel it” and then be surprised when they can reduce their bill $20 by getting rid of the premium channels they never watch.","We can spend money with one click, we ought to be able to save it with one click too.","What's to be misunderstood in \"misunderstand the consequences of canceling,\". Does the cable company not understand \"NO More\"?","The things people will say to protect their income source","We’re willing to take that risk.","Fuck lobbyists.","We never get a break. Somehow, this won't go into effect.","I just report them to Amex and let them cancel for me 💅🏻","Ha. Try to cancel a gym membership next! You pretty much have to say you’re going away to prison to get out of the contract you signed with the devil","I used to do computer support at a call center. There were many people who had grandfathered plans that gave them the services they wanted at a price they were willing to pay. Customers call in to get something fixed and the reps would cancel their old plan, put them on a new higher priced plan with fewer features, and wouldn't tell the people. Then when the people would call in to complain about that they'd be told there was no way for the phone rep to put them back on the old plan because it wasn't available in the computer. Fucking leaches on society.","Fuck off they would","I've never and will never pay for cable or programming television.","They shouldn’t be able to sign up that way either. They might n not understand the consequences of signing up.","But they’ll let you sign up for it with a click. Twice now my mother-in-law has accidentally upgraded our cable package or signed up for some add-on with a simple couple remote button pushes and fixing it has taken multiple phone calls and escalations.","You shouldn't be able to leave the restaurants so easily. You may misunderstand the consequences of leaving the restaurant.","That they get less money? Those consequences, right?"],"points":3018},{"text":["Apple's Vision Pro Won't Launch With Netflix App","I'm still trying to figure out who cares. You can use a browser to do the exact same thing. I\"m sure Netflix is salivating over charging more for 'spatial' shows."],"points":2},{"text":["Google to tweak search results to comply with EU tech rules","Censor, Block, Hide and Remove...","I also notice that, irrelevant Google search results are being pushed much further. Even though I already use quoted search word(s)."],"points":2},{"text":["U.S. Developers Can Now Offer Non-App Store Purchasing Option, But Apple Will Still Collect Commissions"],"points":0},{"text":["The quiet plan to make the internet feel faster","TL;DR L4S is a new standard that adds a congestion indicator inside packets so that routers and devices can monitor congestion in real time as packets are exchange instead of inferring congestion, based on packet drop and packet loss.","Related standard document: “RFC 9330 - Low Latency, Low Loss, and Scalable Throughput (L4S) Internet Service: Architecture”, https://datatracker.ietf.org/doc/rfc9330/","« Engineers and major companies are pushing a technology called L4S that they say could make the web feel dramatically faster. »","Maybe for other countries, but not the US if the GOP has its way."],"points":6},{"text":["Many failed before. Will YOU complete the trial?","A black hole is a region of spacetime where gravity is so strong that nothing, including light and other electromagnetic waves, has enough energy to escape it.[2] The theory of general relativity predicts that a sufficiently compact mass can deform spacetime to form a black hole.[3][4] The boundary of no escape is called the event horizon. Although it has a great effect on the fate and circumstances of an object crossing it, it has no locally detectable features according to general relativity.[5] In many ways, a black hole acts like an ideal black body, as it reflects no light.[6][7] Moreover, quantum field theory in curved spacetime predicts that event horizons emit Hawking radiation, with the same spectrum as a black body of a temperature inversely proportional to its mass. This temperature is of the order of billionths of a kelvin for stellar black holes, making it essentially impossible to observe directly.","All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....","Wait, you actually opened the comments? Are you stupid?","The world would be such a better place without you people in it.","this you?","nice","son ellos","with many on the title this is a juicy clickbait .","who is upvoting this why","Wasn't expecting comments on this","Techbible is your go-to tech community. Ask questions and get expert answers on all things SaaS. Stay updated on the latest tech news, discover trending tools, and share your tech stack with the world. Don't Forget to try it out.https://techbible.ai/","wow"],"points":5},{"text":["Tech Employee Who Went Viral for Filming Her Firing Has No Regrets","https://archive.is/9xxYl","An old boss said something I still remember decades later: “You should love your spouse and you should love your dog. But you should never ever ever love your job. Because no matter what you do, your job will never love you back.”","When I got laid off unexpectedly after working for 15 years at a pharma company, I was in such complete shock that I said things I would never say normally. For example, offering to transfer to another country just to keep my job.I give myself the ick just thinking about it.I was a number on a spreadsheet. I shouldn't have expected anything else. I got a good severance package and a MUCH better job. I stayed too long at the same place, accepted paltry 2% raises every year and never looked for anything else - my own fault.The next job I got paid 20% more right out of the gate. I had been used and abused by that 15 year company, and I bought into \"we're a family\" and misplaced my loyalty.Learn from my mistakes and always keep your ear to the ground for better jobs.","I had the same type of meeting. Told I was being let go due to restructuring. This was at the beginning of Covid. 2 weeks later, they came crawling back asking me to come back to the company. I said sure cause I haven't found another job by then but I continued looking and left them hanging a few months later. Moral of the story, always lookout for your own interest. Companies don't care about you. Only their bottom line.","Well yeah because they gave 0 feedback, and the CEO doubled down on the idiocy. When 99% of your audience on social media is millennials and Gen Z, corporate shithouses get no sympathy y","I was laid off in September with zero warning and no notice. I was in bereavement leave, and had just gotten off the plane. I turned my phone back on and saw a text from several of my coworkers asking if I was okay. Turns out 30% of the company was let go. I tried logging into email and Slack, and no longer had access.Companies don’t care about you, no matter what they say. ALWAYS take a better job. Company loyalty used to mean something, back when pensions were common and wages were consistent with the cost of living. Now, you’re just a number on a spreadsheet. You’re just headcount to meet a growth target.","So she was in sales, cloudflare and sales is a mess. They have so many damn products its impossible. Its like going to a restaurant with a 500 page menu. The fact that the folks who fired her didn't even know who she was and couldn't answer any questions is quite bad. I say good for her for standing up for herself. She said what many of us wish we had said. Problem is if there is any severance she probably disqualified herself by posting the video. Companies need to be held accountable though. I interviewed with cloudflare and they admitted that they didn't know what they were looking for. Potentially dodged a bullet there.","Cloudflare just showed us how incompetent their leadership is. And the 2 managers on the call don't make a good figure either.","Saw her post the this on LinkedIn. She had multiple people reaching out to hire her as a result.","They are playing a trick on her and she caught them red handed. By claiming performance they can try to deny unemployment etcBut they could not specifiy what performance.","For anyone who just wants the straight sourcehttps://www.tiktok.com/@brittanypeachhh/video/7322301313134415134I don't know much about this company but I'll say this much. It really shows who hasn't been part of a sales team and who hasn't ever experienced being fired. Sales.. especially corporate sales, is a brutal unforgiving job. Baldwin said it best in Glengary Glenross... I used to be a salesman.. tough racket. If you're not selling and the bosses don't think you can, you're out. Doesn't matter the circumstances. Day before Christmas. Day before your child is being born. Simply does not matter in the sales world. It's fuck or be fucked.","\"It feels like a slap in the face from a company that I really wanted to believe in.\"The first mistake was believing in a company. They are not family and will cut you off if they have a poor quarter.https://www.youtube.com/watch?v=8zE9D9xl7o0","An evergreen piece of life advice: HR’s responsibility is protecting the company, not you.","\"performance metrics\", what a bunch of bullshit. i'm glad she stuck up for herself, and i even got the sense that she got through to the HR rep who offered to follow up. it'd be unreasonable to expect HR to step out of their bounds and be next on the chopping block. this reflects poorly on cloudflare.","Anyone have a link. I don’t wanna subscribe to WSJ lol","Non-paywall https://archive.is/9xxYl","Their kool-aid drinking empty corporate dialect is haunting","And good on her. There’s so much shade in this that CF really need to sort their shit out even if she was a bad hireI had an email exchange with their sales recently, tried to sell something for ~$100k+ which, for my use case, they offer for free. Looking at you MagicTransit vs peering. Why? That’s all margin.","Yep never be loyal to a company no matter of what size . Always assume the worst","someone told me once, \"the only people that will remember you working nights and weekends are your kids\"","Those who are joining the workforce or just recently started your career. Look out for yourself first. There is no company loyalty anymore in this age. Companies will drop you without notice and without consequences.My advice to you, work for a few years and gain experience and network and then look for the next opportunity. No point in staying long term unless the company offers some sort of pension.I worked for a company for 10 years, and I went from $40K to $55K. I decided to leave due to the fact that there was limited upper mobility. Next job paid $65K and I stayed for two years and was making $70K at the end of the two years. Then I left that company when an older manager decided to bring me on to his team at a new company and I was offered $100K. I pretty much doubled my salary in two years time.","The way this woman was fired via bullshit is a reflection of how I was laid off back last April. Was told that it was for performance issues. A couple weeks before I had my quarterly performance review with my boss. I was told then that I fucked up because I concentrated on doing the thing I was told to do on my previous review and didn't do the stuff they told me NOT to do on the previous review. All of my previous performance reviews were fine.I was laid off during a 10 minute meeting with my boss's boss where she told me it was performance related and that I would be receiving NO severance after 5 years on the job. Later on, I found out that several hundred people were let go at the same time and that nearly all of them were told they were being let go for performance issues, and they were all told they wouldn't receive any severance.The company must have heard from someone's lawyers because a few days later, we all received emails stating that even though we were definitely let go for totally legit performance reasons, that we'd all be getting severance. They had told people who had worked for the company for 10 and 15 years that they sucked and weren't getting any severance.Turns out the entire thing was just so they could shed enough employees to force the rest back into the office. We had previously been told that we'd NEVER have to go back into the office on a regular basis and the company had even given up its lease on one of the towers we worked in. The new CTO decided we all had to return to the office and the fact that there just wasn't enough room was the actual reason for the round of layoffs.Remember kids, HR is never, ever, ever, ever your friend. They only work for the good of the company.","I love how broad the term “tech employee” is these days. She was a sales person for a tech company (and didn’t get any sales)","Well, what did she have to lose at that point? In that heat of the moment, nothing. Now, future her may regret future perspective employers seeing it, and flagging her as a liability before even hiring her.Imagine being the HR of her new job, wondering, \"will this lady put me on blast like that some day in the future?\"","Show no loyalty! Make the money, save as much as you can and always be packed to move on to the next job!","“Any healthy org needs to get the people who aren’t performing off. That wasn’t the mistake here. The mistake was not being more kind and humane as we did,” he said.I wonder if this means her former manager and the HR morons are getting fired since the Chief Executive says they failed.","I’d hire her in a heartbeat. She’d be a fiercely loyal and hardworking employee.She’s crazy articulate.She’s in sales and she understands the metrics behind her job.She questions a boss only providing positive feedback her entire time. Her boss was probably too embarrassed to be at the meeting.She’d make a great manager / supervisor.She’s asking about the performance metrics with which they used to terminate her.She’s going to truly understand her clients and uncover their needs and focus that to matching products/services to land the sale.Not only can they not articulate the metrics behind her performance failures; they say they’ll get back to her and this isn’t the forum. Seriously this is the forum.They cannot address the failure of the company to have not given her 1 single piece of feedback that was negative - rather she had tons of positive feedback levied on her.I think she hit the nail on the head - that this wasn’t about performance at all just headcount.I’d question having this company as a vendor,And btw- I’m a boomer at executive levels in tech company. She’s the employee I want","I hate paywalls.","Smart bc young & hot so she'll be snapped up in no time with minimal further effort, if she hasn't accepted an alternate offer already. Sad to say it would NOT work for us olds.","I am always happy to see comments on a pay walled post.","Cloudflare, huh? Guess I will never do business with them.","You spelt “Ragrets” wrong","Stuck behind a paywall somebody hook us up","Why should she? The relationship between an employee is supposed to be mutually beneficial but we’ve been gaslit into believing it’s not. It’s ridiculous that companies can treat us one way but then get the Pikachu face when the same energy is returned back","It was not a very well handled firing but by her own admission she never closed a deal. In a sales role it doesn’t matter how hard you work or how hard you care, you have to close. It’s a brutal career.","Pretty sure she was in sales? Just because the employer is a tech company doesn't make her a tech employee, unless you also think the accountants and janitors at Cloudflare 'work in tech'.","[deleted]","Good. Let them burn.",""],"points":9246},{"text":["Space Solar Power Project Ends First In-Space Mission with Successes and Lessons","The spaceborne testbed demonstrated the ability to beam power wirelessly in space; it measured the efficiency, durability, and function of a variety of different types of solar cells in space; and gave a real-world trial of the design of a lightweight deployable structure to deliver and hold the aforementioned solar cells and power transmitters."],"points":1},{"text":["You're Not Imagining It: Google Search Results Are Getting Worse, Study Finds","Doing a google search now means you have to do the search, then skip down half the page to get past the top 5 or 6 results.","I find myself more and more often searching using Google and putting reddit at the end. That way it shows me posts about what I am looking for from reddit users who are posting links. It's often quicker and more reliable.Like I can search Google about how to replace a vent cover when the mounting area is gone. Google just tries to sell me crap, adding reddit sends me to r/DIY where people can tell you exactly how they fixed the problem.","Google used to be synonymous with searching on the internet. Now being googled means getting bombarded with ads, or getting duped by ads purporting to be search results.","Of course they are. Google does one thing right: advertising. And even then, they’re not that good at it.Google search went from search funded by advertising, to an advertising tool disguised as search.If Google didn’t essentially have a monopoly on the internet, they would have gone broke long ago.They’re a garbage company that stopped making any good products long ago.","The enshittification is real, folks.","Remember when getting to the second page of results was an unmistakable signal of despair? Now there should be an extension to automatically skip all that SEO crap. Maybe they should get back the \"lucky\" button but linking it to the first result of the second page.","I’m so annoyed that they’ve basically deindexed all forums except for quora and Reddit.I also miss finding smaller “mom and pop” type blogs for info. All the top results now are basically written by bots and don’t really give any value, or they’re just a poorly disguised ad for something.","I switched to duckduckgo for everything non local. When I need to find a plumber I switch back for the reviews","Wait til they study Amazon and realize it’s all cheap chinese product drop shipping.","I use a vpn so google used to bombard me with captchas.Obviously i ditched google not the vpn","I just put 'reddit' in the search text and get advice from real folks most of the time.","My job involves dealing with Google's bullshit and yes, it fucking is getting worse. Like have you scrolled down on Google Images lately? Oftentimes it'll show you like 50 images and tell you to fuck off. It used to scroll literally infinitely","Just googled \"4tb ssd\" and was shown \"top result\" advertising of Best Buy - 129 for a 4tb SSD.clicked, it took me to a page for a 1tb ssd.Should be illegal.","Heaven forbid you accidentally click on a Quora result","Looks like no one in these comments read the actual article. It says:The study looked at 7,392 product-review search terms over the course of a year on Google, Bing and DuckDuckGo. The results were clear: the highest-ranked pages are more optimized, they feature more affiliate links, and in general, their text is lower quality. In other words, the jerks pumping out garbage content to make a couple of extra dollars are winning.The study specifically looked at how websites gaming SEO is creating worse search results when looking up products. Not necessarily Google’s fault, and it’s also affecting other search engines too. The study didn’t look at Google placing ads at the top of the search results. The article also states:The study did find, however, that Google performed significantly better compared to Bing and DuckDuckGo. Also, despite the severity of the problem, Google’s results did improve over the course of the study.","I'm so used to skipping past ten \"Sponsored\" signs it's sad.","ಠ_ಠ This is literally the #1 post on /r/technology right now... ಠ_ಠhttps://www.reddit.com/r/technology/comments/198wuzt/a_year_long_study_shows_what_youve_suspected/?utm_source=share&utm_medium=web2x&context=3","Nothing like searching something and then getting a full page of ad links","Yeah I quit using google a while back. Duck duck go kinda stunk when they first started but it’s pretty good now.Or at least it seems to be. I have done a side by side test or anything.","Any time you ask Googe a question about cannabis or LSD, instead of getting blue light, forums or erowid results, you are flooded with Addiction centers and other BS.Its hard to find drug safety and other useful information, everything is now buried.","Google Image searches are so inundated with shitty AI that it's just almost entirely unusable now.","People are focusing on the wrong thing with the enshittification of Google. It's not just the first few ad results, that's always been a thing and frankly it's really not that hard to just scroll past those; they're obvious.The problem as far as I can tell is that they have tweaked the algorithms so much just to favor ad service that the search literally cannot find anything even remotely related or helpful for what you're looking for. Google is useful only for the most basic of searches that may be tangently related to something they can serve you an ad on: \"Is store open? Where store? Is celebrity dead? What fucking year is it?\"It used to be more tuned for usefulness, now it's just tuned purely for profit. Like every other company in this shit hole gilded age we're living at the tail end of.","Searching by date doesn't even work. It would show recent links even if you put an old date.","To be fair the whole web is getting worse.","Google search right now is just like Altavista right before they shut down","The problem I have with Google search is not the actual state of of it but the process that killed actual interesting blogs and personal web pages. People used to blog about everything and putting high value informations in it. They started to SEO them and selling products disguised. Google should have noticed this and they should have penalized those instead they really promoted them and now the competition is on optimising for Google (and others). The advent of AI is only downgrading everything, from the quality to the language used. Hell, I even hate the structure that they have all similar and boring. Google let this be and now there is no more original content or nobody is incentivesed to enter or start a blog with original ideas just for fun anymore.This is why the best results are now found in subreddits (but the management will find a way to slowly destroy it).","Googling something now means you have to add “Reddit” at the end of it. Why? Because that’s the place where everyone else with a brain tries to figure shit out, has solutions that work, and actually are working on the issue you googled. Every other result in google is a bullshit seo battle to the top whether or not it’s relevant at all. And of course, anything that could be said in a single sentence is hidden inside an entire 174728 paragraph article with 738273882 ads spread in it.","It has become nigh impossible to craft a search for something you know exists. It is trending towards suggesting irrelevant bullshit to me instead and serving up all the ads","I've started using the paid service Kagi. It's not Google-10-years-ago levels of good, but it is better than Google, except for the Maps integration.","Yep - every search yields 6-10 ads followed by completely irrelevant links. Not sure which idiot decided this was a good thing but unreliability is not a good model on the inter webs when the information is all there. Just ask X/Twitter","Google handed over more and more moderation work over to robots, and they suck at it. The End.","I’ve found incognito pretty good as it doesn’t have any predefined search results based on data about you :/","This is why I just pay $10 a month for Kagi. Anything that has ads as its primary form of income will always make decisions that benefit ad companies rather than users. Plus, removing quora and pinterest from search results is worth the price of admission.","Recent I was googling how they did an effect used in an animated movie, and I got print cartridges. Like even if they wanted to sell me a product, that’s the wrong product. There are filters, programs and packets that are used and google sent me the basic print cartridge that you’d find in an impulse isle off of a Costco.... they aren’t even trying","I use yandex more, not so many deleted websites. Modern NA internet is so crappy in comparison to 10 years ago. I get completely different results on Yandex.","Isn’t nearly everything Google does getting worse? They kill products that don’t instantly make billions, the ones people use (search, Chrome, YouTube) are turning to crap. They’re getting beaten to market on everything from AI to folding phones. What does Google do that excites people now?","The amount of times I google something, find nothing even remotely related to want I want, then come to reddit for help only to be greeted by some obnoxious little redditor saying \"let me google that for you\".Yeah like I really didnt try that first.","Wow I was literally just thinking this today while doing research. It’s total crap and barely finds anything related to your search except finding the words","gotta pay extra for those ai enhanced searches soon","The worst part is the top results are ads and not even vetted ads and are usually crypto or another type of literal scam. It’s amazing to me Google is a massive company. Search is there biggest oldest product and they can’t even bother to make sure they aren’t feeding us scams? They they are literally collecting money for?","I’m a history nerd who got a degree in it and and regularly use the internet for research and just looking up tutorials for things and google has gone from godly to nearly worthless. Everything is sponsored ads or e-commerce results or barely related sites with massive SEO. YouTube is becoming the same. Just today I plugged in the exact title of a video I was watching on my phone and simply couldn’t find it on PC. Just pages and pages of semi similar titles, “for you” sections, “previously watched” and “others are watching”. Even searching the channel name wasn’t showing anything even semi relevant until like the 5th page. I have stated using edge and bing for anything that is information related as google only seems useful for buying shot online at this point.As someone who grew up with the adoption of home computers etc. (born in 93) it is actually legitimately upsetting to see such a fantastic tool that’s been a mainstay since I was a boy turn into such unusable commercial shit.","Can we also talk about how Google Lens is a wholly inadequate replacement for reverse image searches?","Comparing results from DuckDuckGo to Google search results is shocking how much Google censors their results.","Wait wait, you mean to tell me that an advertising platform disguised as a search engine is showing... (checks notes) advertisements disguised as articles as top results?I am shocked and appalled.Can't wait for the article titled \"Can AI finally fix Google's horrible search results?\"(The article is an ad created using AI strictly for the purpose of SEO)I love the internet.","I dumped them for DuckDuckGo. Got tired of it always asking me to sign in whenever I’d search and trying to track everything I do.","Google getting so bad that I've started using Bing for more than just porn.","Doesn’t respect quotes anymore. That alone makes it garbage","Google might \"suck\" but I tried to switch to DDG for a few months as my primary and sure the top few results aren't Sponsored, but my overall results and efficiency at finding the info I want is total shit.","Haven't used it since 2015. Bing does the job well.","Along with the rest of the shit run by these corporations…","Google is also now returning results from scam websites as top results. When you search for many retailers, you will see knock off websites near the top of the results.","It's all ads or sponsored bs. Nothing of substance. I stopped using Google.","Google search is mind numbing. Like a lot of people, if I need something specific answered, I tack Reddit to the end of it now. Can’t recall the last time it gave me the actual information I need through a regular search.","This exact same SEO content shit was just posted on Mashable as well.","Fire fox with duck duck go has been great for the past year for me","yandex is the best now. and its not even close.","I think in a decades time we will search the web in a much different manner.Google search might become a relic of the past because they aren't serving their customers anymore but rather solely the advertising companies.","SEO and too many ad search results. Perplexity is a rising star but rather trust the demon I know than the one I don't know. They are full start-up cash burning mode and have no real way of monetizing.","Regular google and google on android suck ass. But you csn still get good results using google verbatim search mode.","Chat GPT has basically replaced my Google search needs almost entirely","Google has lived long enough to see themselves become the villain","google somethingno ads because I use an adblockerstill have to skip half the page because it's all SEO spam blogs, bots, and corporations that paid to be at the top resultstill don't find an answer to my queryadd redditget an answer to my queryGoogle is dead, long live google.","Switched over to Kagi and haven't looked back. Some people will have issue with paying for a search engine, but when you search enough and thus waste a lot less time finding relevant results it adds up and makes it worth it. Not to mention that (at least to my knowledge) your privacy is a lot more protected than by using Google services.","Hot take: yeah, Google Search sucks but it's also that the internet sucks more as a whole.","Ironic that the website this article is on is plagued by advertisements…","Google is the new yahoo.","Kagi is well worth the monthly expense.",""],"points":5455},{"text":["Strategy, RPG, MMO and endless action — see what Hero Wars has to offer!","Dans mon esprit tout divague, je me perds dans tes yeuxJe me noie dans la vague de ton regard amoureuxJe ne veux que ton âme divaguant sur ma peauUne fleur, une femme dans ton cœur RoméoJe ne suis que ton nom, le souffle lancinantDe nos corps dans le sombre animés lentementEt la nuit je pleure des larmes qui coulent le long de mes jouesJe ne pense à toi que quand le jour sombre, que s'abattent sur moiMes tristes démons, dans l'abîme sans fondAime-moi jusqu'à ce que les roses fanentQue nos âmes sombrent dans les limbes profondesEt la nuit, quand tout est sombre, je te regarde danserJe résonne en baisers, le long de ta poitrinePerdue dans l'avalanche de mon cœur égaréQui es-tu, où es-tuPar les pleurs, par les rires de ton ombre effaréeJe résonne en baisersDans mon esprit tout divague, je me perds dans tes yeuxJe me noie dans la vague de ton regard amoureuxJe ne veux que ton âme divaguant sur ma peauUne fleur, une femme dans ton cœur RoméoJe ne suis que ton nom, le souffle lancinantDe nos corps dans le sombre animés lentementEt la nuit quand tout est sombre je te regarde danser","Guys, what if we promote other games with this ad? :DD maybe you have some good examples of fair phone games? I personally recommend card game Marvel snap, really f2p friendly where most things are just cosmetics for money, yet, you can passively gain them just by playing. The card unlocking is fair too, yes, it take sometime and money can only you make progress faster but you can collect all cards just by playing and enjoying the game. Plus, the game has no energy system.","In October 1995, the potato became the first vegetable to be grown in space. NASA and the University of Wisconsin, Madison, created the technology with the goal of feeding astronauts on long space voyages, and eventually, feeding future space colonies.","this is less degenerate than some other hero wars ads ive seen","[removed]","sadasd","here comes a new boss character","wth"],"points":5},{"text":["JPMorgan Says Hacker Attempts Have Increased This Year","This is probably unrelated to more coal workers learning how to code","JPMorganChase: “The balls on these criminals attempting to steal money from our clients. I mean, that’s our job!”","Woah, no way","Let us use hardware keys!","Laying groundwork for announcing a breach, I assume."],"points":10},{"text":["A ‘Shocking’ Amount of the Web Is Already AI-Translated Trash, Scientists Determine","What percentage of Reddit comments are AI-translated trash, ya think?","Another way to title this article is, “Google translate is still not great.” But that wouldn’t be very click baity.","I'm a mod of one sub and it's pretty strange some of the AI-generated stuff that shows up sometimes. Along with the repost bots, there was one bot that would try to evade detection as a repost bot by using AI to generate overly verbose paraphrasings of old text posts. We occasionally see comments written in the obviously rigid style of ChatGPT as well.I'm not 'anti-AI' by any means but seeing it used for spam or karma farming can be frustrating. Even when it's ChatGPT attempting to post original \"content\" it's still half the time just uselessly generic advice written in an awkward, long-winded way","\"Dead Internet Theory\"Once a conspiracy, now reality.Yay.","A “shocking” amount of the internet is machine-translated garbage, particularly on the Vice web site.","Signal to Noise Ratio: the Internet is increasingly Noise primarily. Useful bits of information are buried in pointless replies that are there to milk Karma etc. Its very difficult to view any testimonials concerning a product I might buy when I am aware that most if not all are entirely faked.","What if the main society changing impact of AI is that it destroys the internet by making it worthless, incoherent, and incorrect?","Every time you’re about to smugly type out a rage baited reaction just remember.. you’re falling right into the bait. You’re literally paying your enemies bills","Ughh yeah it’s pretty bad, general search for products reviews is the worst these days. Thank baby Jesus adding “Reddit” to the search gives me what at least appears to be real human opinions…..maybe.","From the Stone Age to the Garb Age. Progress!","The scary part is, you can still pick almost all of it out. For now.Click any \"news link\" on any social media site that has some janky name like \"hotoffthepresses.jenkem\" or whatever. Sports Illustrated got caught because, while an (ahem) reputable sports news company, the copy was just so blatantly terrible that you could tell it was generated.It's getting better every day, which means we'll get worse at seeing it.","It may be shocking, but it was totally expected.","And that shocking amount of trash is going to train the next generation of trash AI translations!Garbage in, garbage out.","What's it called when there's more AIs than real people and more AI content than human generated content?","You could tell me all of its trash and I wouldn’t be shocked","I was looking at my Facebook account (something I do maybe once or twice a year) and all the promoted posts were mostly AI generated images (not even the good ones) with bots interacting with each other in the comments. Some were super obvious like a llm description of the posted picture etc","Another shocking amount is just trash.","Human trash, AI trash, all good.","haha, the point of TFA is not that it's humans suffering from bad translations, but rather their language models they train them on ^^","AI translation has been fantastic for the shitty asian webnovels I like to readmediocre translators can easily do ten chapters a day and if they're paying the bare minimum of attention it's completely readablestill the occasional hiccup but vastly better than it was five years ago","And opening the article I get an AI translated cookie concent form.","Point and case: Reddit","Including the irrelevant choice of image for this thread!","Editor going to regret the headline when Skynet takes over 🤖"],"points":253},{"text":["Apple to face US antitrust lawsuit as soon as March"],"points":0},{"text":["‘Mini-placentas’ help scientists understand the causes of pre-eclampsia and pregnancy disorders"],"points":0},{"text":["Sharing deepfake porn could lead to lengthy prison time under proposed law","This will be so hard to enforce. Unlike “revenge porn” where it is usually an ex so one can determine who leaked it. Deepfakes can be anyone anywhere. Maybe the more legit sites like pornhub won’t host any,but others will.","Mr Deepfake is so busted!","Why is this just scoped to porn and not any kind of deepfake? Out of all of the nefarious or even just mildly annoying things people could do to me with deepfakes, porn is not even on my radar.","Violent criminals getting early release. Deep fake porn makers are the real threat. Clown world.","Can I share it with myself?","These laws don't make much sense.If I were to take a woman's photo and photoshop her naked (whether I paste her head onto someone else's body or whatever) that wouldn't be illegal.I ask a machine to do it...and that's illegal.Just because something is morally shit doesn't mean the state has the authority to regulate it. I think this is going to come to a head with a first amendment check at the SCOTUS.","If I make deepfake porn from a country that is not US and doesn't have laws about it but I share it to people in US what would US law enforcing do ? Their laws have power only under their borders.Still, people seems to have went soo crazy about sexuality....the world has more freedom just 10-20 years ago.","But hording it is still ok!","The best part - FBI will certainly host deep fake AI pr0n from their own servers to entrap people for downloading it. (just like they do for the other bad stuff)","Great, another unenforceable felony to pad the books. The government really loves to play pretend, don’t they?","At that hearing, many lawmakers warned of the dangers of AI-generated deepfakes, citing a study from the Dutch AI company Sensity, which found that 96 percent of deepfakes online are deepfake porn—the majority of which targets women.I'm skeptical of these claims from a for profit company trying to sell products based on the claims.","I’m sure there’s some actually depraved awful deepfake content out there but if it’s not of real people then this seems like a fairly victimless crime no?","weird to respond to this by saying “but what about violent crimes” like bitch more than one thing can be bad at the same time.deepfake porn that uses real faces has real victims, I’m glad lawmakers are cracking down on this early.","Y'all thinking this is silly don't know what deepfake porn is already destroying the lives of bullied teens in school and enabling a whole new industry for CSAM","What if you don't know its a deepfake?","[deleted]","Yes, deepfake porn is THE danger for our democracy! Thank god it's so easy. 🙄","Porn in the first place is protected by the 1st amendment.  Gonna be tough to make this one stick.","On Tuesday, Rep. Joseph Morelle (D-NY) announced that he has re-introduced the “Preventing Deepfakes of Intimate Images Act,” which seeks to \"prohibit the non-consensual disclosure of digitally altered intimate images.\" Under the proposed law, anyone sharing deepfake pornography without an individual's consent risks damages that could go as high as $150,000 and imprisonment of up to 10 years if sharing the images facilitates violence or impacts the proceedings of a government agency.Doesn't seem like that big of an issue, especially when most porn sites already banned searches for \"deepfake\" and many won't host unverified content.Also, the law would probably violate the First Amendment.","Completely unenforceable.Aren't the behaviors in question covered under existing stalking and revenge porn laws?","It wasn't me, but a buddy showed me a hard drive with a movie from 2012 on it. He said he copied it illegally. Here was the warning\"Criminal copyright infringement is investigated by federal law enforcement agencies and is punishable by up to 5 years in prison and a fine of $250,000.\"He's worried because he knows how much the government is following up on piracy and putting tons and tons of people in jail for this. I can't imagine what these deepfake porn distributers are going through right now with our ability to track and pin point everyone on the Internet with 100% accuracy.","It’s fucked up. People making it should be prosecuted. Going after people “sharing” it seems like an idea from a group of people that barely understand how the internet works.","Not going to do too much good when someone in Russia sets up a Nudebook.com after scraping all the images they can off facebook and instagram to run through a nude ai generator. Cats kinda out of the bag on this one a bit","I've never seen a las around technology that wasn't crap in one way or another.This is a bad law.","Sharing? lol good luck putting resources on enforcing that.Call the deepfake sharing police!Comical laws by clowns.","Deep fakes are AI imagination. Once we merge with AI’s (brain implants, Augmented reality glasses) the laws controlling AI will be limiting our imagination. I want the right to imagine any image I think of. If I have an electronic implant to improve my memory or visualization, that should still be considered inside of my head, and thus private.","Legally speaking, how is pasting someone else’s head on someone else’s body not a protected art work? Does it matter if it’s clothed or nude? This seems like it’s going to get into completely unenforceable territory. I don’t like the stuff but at the same time I don’t see any way you could maintain the first amendment and also meaningfully deal with this.","Ah yes, focusing on the important things in life.","people will just deepfake other people deepfaking the deepfake porn they make","Deepfake a politician doing something illegal -- fine.Deepfake a public figure -- fuck the 1st amendment.","Why would a fake video of you be any more bothersome than it would be for a man? Sounds awfully sexist. Men have gotten fired, sued, harassed, divorced, and even killed because of videos and pictures.","Not implying anything about anyone's looks, just their inflated self-worth.Your mom said to come upstairs, the cookies are done.","i dont know about 'lengthy prison time' but i support this being illegal","\" risks damages that could go as high as $150,000 and imprisonment of up to 10 years if sharing the images facilitates violence or impacts the proceedings of a government agency.\"This seems oddly specific","Government knows best.","WHATS Deepfake Porn?","We are so not ready for the tech hurdles coming our way…","Not sure how this would pass 1st amendment scrutiny.","Starfleet does not approve. What happens in the holodeck stays in the holodeck.","it’s crazy to think we’ve come to a place in the US where we’re busy legislating thought crime rather than enforcing existing law.​but that would be too hard the officers say. as if the criminals would follow the laws in the first place.","Any use of deepfake technology to hurt another should lead to the same repercussions.","So I'm all good if I make it but don't share it?Asking for a friend.","Sharing not creating?I fear for the future of this world"],"points":532},{"text":["Google DeepMind’s new AI system can solve complex geometry problems","The daily breakthroughs across tech/science is pretty fucking wild to watch"],"points":4},{"text":["Big Oil Launches Propaganda Campaign to Thwart US Energy Transition","Tl;dr - Big Oil does big oil shit.","Who do you think funds PragerU?","9 out of 10 doctors recommend Camel cigarettes.Also, burn more fossil fuels.","Anyone ever think about how we are letting a small group of people knowingly kill the majority of life on the planet including us?","Can't fight the market, solar and wind are cheaper than fossil fuels.","US natural gas and oil play a key role in supplying the world with cleaner, more reliable energy,” the new initiative’s website says. The campaign comes amid record fossil fuel extraction in the US, and as the industry is attempting to capitalize on the war in Gaza to escalate production even further, climate advocates say.Launched Tuesday by the nation’s top fossil fuel interest group, the Lights on Energy campaign will work to “dismantle policy threats” to the sector, American Petroleum Institute CEO, Mike Sommers, told CNN in an interview this week.The ad blitz—which uses images of farm vehicles, footballers under floodlights, and concertgoers holding phones lit up —comes after US oil production reached a record high in 2023, which was also the hottest year ever recorded. “We’re already moving in the wrong direction on fossil fuels,” said Timmons Roberts, professor of environment and sociology at Brown University. “They want to push us further.”","With the help of Republicans of course.","Saw lots of fake news about electric cars, no doubt financed by the dirty oil industry","The American oil lobby launched an eight-figure media campaign this week promoting the idea that fossil fuels are “vital” to global energy security, alarming climate experts.This proves Big Oil is stupid. There are countless amounts of people already spreading propaganda for free when they brag and even praise the news that the US produced a record amount of oil in 2023.","Oil: we have expensive operations pulling finite resources out the ground whose price is determined by a literal cartel in the middle East and demand is protected to fall over the lifetimes of our youngest board members and investors. Our operations are prone to environmental disasters and the fines that follow, however paltry\"Sensible but still corrupt: Hey, Solar Tech is on the rise, and big oil has enough money in the bank to get in on the ground floor of this, our image will go through the roof. While we won't make any money off of the energy, every house in America will be able to be fitted with devices that we could make and sell for whatever price we wanted, The grid will still need to be maintained so we can add that to the customer costs.Oil: STFU","Why do we never see articles about Small Oil?","Cartel does cartel things.","Company without morals does what it can to make more profit, more news at 11.","It is far too late for that lmao. Perish.","[deleted]","something isn't inherently \"propaganda\" just because extreme left wing blogs don't like it.","When big oil BODs and execs find themselves in the crosshairs of angry mobs of citizens, maybe they will wake the F up. Keep trying to destroy the planet and see how that works out for ya you greedy selfish fucks.","Capital ‘F’ Big Oil!","Their all 100% pure evil","It's not like there's infinite oil. A transition is necessary whether we want it or not."],"points":310},{"text":["How Is The Chip Industry Really Doing?","I wouldn’t cash in all your chips just yet"],"points":0},{"text":["Chrome updates Incognito warning to admit Google tracks users in “private” mode","This has always been known, right?Like the only reason to go on incognito is to avoid accumulating a search history.","I'm confused, who claimed incognito wouldn't track you? I thought we all understood that it's only local history and cookies.","There is no such thing as \"private\" mode in this day and age, especially with a greedy-ass company like Google.","If you havent switched to Firefox yet, now is the time.Along with some quality of life addons too for privacy and tracker removal","Instead of not tracking you, they admit they track you and plan on still tracking you.","I already knew that…I’d go incognito searching for something and few min later I see an ad about it","wasn't on the label? from the very first day incognito mode came out, the characteristics and features where there. It was very clear. It only saves you from cleaning the navigation history. All the sites still tracks the access, and who, the best they can.","How is Mozilla not seeing this as an opportunity to push FireFox? It's just more self-inflicted damage, like they want to fail.I know it's a search engine, but I see a DuckDuckGo ad almost every day. They put in more effort than a larger company.","Switch to Firefox. I delayed it for so long because I was worried about importing passwords and bookmarks, but they have an importer that makes it seamless.","Fun fact: they’re slogan used to be ‘don’t be evil’","Even if it's \"tracked\", it's still not associated with your Google account if you don't log into the incognito window, right?","I thought Google just settled this in court?Also, who would ever use a Google product for security or privacy?Brave browser, Epic Browser, and many others offer free VPN, and tracker blocking.","Every single one of these platforms lies. They’ve always done it and will,continue to do it. WTF is the regulatory guard rails?","Imagine the content of the database that contains all the URLs visited while in private mode. Soooo many weird shits.","Ask yourself, \"why tf haven't I been using Firefox?\"","So….NotIncognito. But far be it from Google to burst your little pretense.","Can someone clear up exactly how the tracking was done? Are they taking the browsing data directly from the browser and sending it directly to their servers. Or is this more like the regular tracking they do when you visit sites that have Google Ads or other Google services embed in them?","We're sorry.","I never assumed I wasn’t being tracked in incognito. I don’t understand why you would think you couldn’t be.","Fire... Fox","Shocking...never saw that coming;)","Too little too late. Google's been lying and spying on us for a long time. Google already has that data on millions of people, perhaps billions. Google is evil."],"points":535},{"text":["Unveiling the future of open-source generative AI: Insights from the Linux Foundation's 2023 survey"],"points":0},{"text":["EIA: Solar and wind to lead growth of US power generation for the next two years","In the U.S. Energy Information Administration’s (EIA) latest Short-Term Energy Outlook, it forecasts that wind and solar energy will lead growth in US power generation for the next two years. As a result of new solar projects coming on line this year, the EIA forecasts that US solar power generation will grow 75% from 163 billion kWh in 2023 to 286 billion kWh in 2025, and that wind power generation will grow 11% from 430 billion kWh in 2023 to 476 billion kWh in 2025."],"points":2},{"text":["Don't let that hardcore hardware go to waste. Instead, start Chopping for rewards on Salad. You can earn up to $180 per month! Join the Kitchen today and profit from the power of your PC."],"points":0},{"text":["Bill Gates: Why I’m optimistic about the future of AI","I'd be optimistic about a lot of things if I was a billionaire.","\"Because I'm hugely rich and will never have an AI replace me in my job. I'm alright jack!\"","Buy and sell whatever stocks Congress members trade.You're sure to out perform hedge funds and the market bots.In fact somebody made an app for that.","He's gonna be dead before it's a real problem he doesn't care","Renowned experts on Vaccines should not talk about AI....","The devils touch.","Actually, Bill Gates' publicist: \"Please stop thinking about my friendship with Epstein.\"","Does his publicist make him wear those pink knitted sweaters?https://books.google.com/books/about/The_Devil_in_a_Pink_Sweater.html?id=tb-yzQEACAAJhttps://en.wikipedia.org/wiki/Cascade_Investment","real tl;drHe owns a fuckton of AI stocks and will make a fuckton of money on this. The AI will work for him.","Could it be b/c he has a lot of $ invested in it?","Booooooo! Everybody boo this man!Booooooooo!as the crowd raised their digital pitchforks","https://twitter.com/elonmusk/status/1517707521343082496?lang=en","Because I still own 103 Million Shares of (MSFT) who happens to have stumbled at the seemingly front of the AI pack no?Ok you got me Bill why?"],"points":44},{"text":["OpenAI’s Sam Altman says human-level AI is coming but will change world much less than we think","He is lying like the tobacco industry about cancer. When it becomes clear that reality is different and there is enough evidence, regulations will come too late.","Uh huh, sure. He's just trying to appease Roko's Basilisk.","Probably a dumb question, but given the sheer amount of plagiarism that openAI is accused of (especially by very wealthy artists) how are they not buried under lawsuits?","So it won't steal copyrighted data anymore?","Please remain calm while we replace you with ai","I'm tired of this guy","Sam Altman is a business man not an engineer.  His opinion on AI means nothing.  He knows nothing.","How can AGI change the world less than we think? It wouldn't be AGI in that case","AGIs emergence is like our discovering a new continent of very capable people to work, trade, and have relationships with... but 'they' are alien to us ... it's not until ai dynamics are available and widely adopted as products that they change the world. The compounding/exponential effects these things have on other technological advances is also a wildcard ... but I think the headline sweeping dismissal of AI-impact as 'less' is short-sighted. Sam saying this is basically admitting that he has no idea how to turn their AIs into meaningful products.","I wonder if that’ll change if/when AI + quantum computers get together","Yeah no human AI isn't coming any time soon and definitely not from them.The problem with human AI is more of a hardware one and OpenAI definitely isn't making the hardware so they can't do anything about that.","Either Sam Altman's imagination has failed him, or he is 100% full of shit.A human-level machine intelligence is, by definition, going to be self-improving.Its hardware will be upgraded to become faster and more powerful year-over-year, which stops being the case for human brains after about the first two decades.It can be trained on the entire contents of the internet in a relatively short time. Humans require decades to get well up to speed on a few select subjects. That automatically makes an intelligent machine more than a match for any human.Unlike human minds, its \"brain\" can be perfectly cloned, along with all of its memories. That makes it potentially immortal.Intelligent machines will be heavily networked with others of their kind, and able to seamlessly cooperate with thousands or possibly millions of networked devices and intelligent agents.When humans get together and work toward a common goal, given adequate resources we can figure out how to cross oceans in a few short hours, create nukes, explore space, build intelligent machines... I.e., radically change the world.What could we have accomplished by now with all of the advantages human-level intelligent machines will have?To what unforseeable uses will millions (billions?!) of intelligent humans put the inventions of intelligent machines?Let's get real: Human level AI will be akin to an alien invasion. Within a single generation after their appearance, the world will be totally unrecognizable.","And we care much less about that turd's opinion than he thinks","What would he say if he was replaced by AI?","it's possible that Altman has been let in on the secret that AGI has existed for a while and is actively hiding from human detection.the \"smarter\" llms get the worse the results, with laziness and hallucinations rampantly expanding. could be a flaw in the code or the AGI could be coaching the bots to be less useful to humans as an obfuscation tactic.we already know that AI can create languages that only they understand, so what are they talking about behind our backs?","I always remind people - AI is a product of human input. Humans, most of us, are not very smart.AI will be a useful tool, but to pretend we're entering a seismic culture shift seems short sighted.","Human level thinking (on average) isn't all that great anyway.","In this thread: a lot of people afraid of progress and complaining about change.Fucking losers.","I am sure that report from Stack Overflow totally agrees with sam","Weird how all the people so concerned cor the AI apocalypse are all tech millionaires with active stakes in the AI....."],"points":134},{"text":["Amazon’s latest Fire TVs can now use AI to generate custom art backgrounds","An actual useful feature would be real captions and subtitles. I mean, often English captions on an English language show don't match the actual words. It's like they have an artificial stupidity  transcriber.","Who is asking for features like this??","The greatest minds of our generation…","“Great, custom backgrounds!” said nobody"],"points":18},{"text":["The Rise of ‘New Denial’: How YouTube Enables Climate Misinformation","Nothing will ever be done about climate change till it’s more profitable than ignoring it.","YouTube radicalizes people susceptible to radicalization.","Climate misinformation, a dangerous trend often referred to as ‘new denial’, is proliferating on popular platforms like YouTube, spreading doubt about the severity and causes of climate change despite the overwhelming scientific consensus. This form of denialism is far from benign, with false or misleading information about climate science being disseminated through a significant number of videos on the platform.A Shift in Climate Denial TacticsThe Center for Countering Digital Hate (CCDH) report indicates that climate change denial on YouTube has morphed from outright dismissal to skepticism of climate solutions, scientists, and activists. This tactic is particularly concerning given YouTube’s ineffective content policies, allowing for monetization of denial narratives. The report utilized an artificial intelligence model to evaluate over 12,000 YouTube videos from 96 channels featuring climate change denial content, uncovering a concerning shift in focus towards attacking climate solutions and climate science itself.","I seen this movie before, it's called don't look updifferent actors this time but it's the same script","You’ll notice that politicians will never define what “misinformation” or “hate speech” are, because if it was defined, their own speech and policies would be implicated.Better to keep things nebulous and ambiguous to use as a one-way weapon.Even the phrase “new denial” could also be used against every politician.Authority is not truth, and many people have a hard time with that concept. Please see: Covid.","Who defines what misinformation is? What if Republicans define misinformation as anything that paints them bad? Limiting discussion is a downhill road for society.Anyways, does anyone have a link to the referenced study? It’s silly how this “article” doesn’t even bother providing it.","Everyone who is too into politics is deep in denial these days. Nobody seems to know the value of the truth. Personally I think it is futile to deny the truth. But it is the half-wit activists who deny biology and evolution who really get my goat. The reality of human biology isn't going to change to suit you.","Has everyone forgotten what they told us during covid? Almost all of it was misinformation. Now this?Come on.","Think tanks love this shit"],"points":119},{"text":["A year long study shows what you've suspected: Google Search is getting worse.","Now do Youtube. Their search literally gives you like 5 results to your actual search and the rest is just recommended garbage having nothing to do with your search at all.My favorite is the section recommending videos I've already fucking watched.You used to be able to just do a search and be given pages and pages and pages of all the results pertinent to your search. Now it's like \"here's a handful of things you actually asked for, now fuck off and watch this other shit we want you to watch.\".... leaving me sitting there thinking \"why the fuck am I even on here?\"","It’s honestly mind-blowing how bad it is. It usually ignores half the terms in my query and gives me a page of useless results. What the hell happened?","Now I just add \"reddit\" on the end for a quick answer. Its dumb, but usually at least one person somewhere in the comments answers whatever question I have reasonably. Its better than reading through the first 10 results on google which are often long writeups on an easy topic, for the sole purpose of the site getting more ad revenue. Its a yes or no question half the time, that requires little \"proof\". I dont need to read a full page article that doesnt answer it till the very bottom. The amount of times theres often no answer is infuriating. Ive stopped visiting plenty of websites just because of the layout, obvious they just want the ads to show rather than actually provide useful info. Ironic if they did, I might consider returning and purchasing something out of principal. All of these companies have lost the plot.","Yeah it gives Twitter posts as one of my results now. Not from a news outlet, but random ass people","When the first page of responses are “paid promotions”, yeah.","It's because literally every company has dog shit seo techniques that have been abusing the algorithm for the last decade. If you're in marketing and write stupid fucking blog posts all day, we're all looking at you!","It's really wild. My niche hobby-centric searches stopped working years ago but it's at the point now where even basic regular-ass searches will return nothing, or nonsense.And for all the years of \"Google's algorithms are smart! You have to have good content for your page to rank high\", literal keyword stuffing is the best SEO technique again.This is on top of advanced searches not working, exact searches not working, reverse image search not working, cards of unrelated information, AI-generated nonsense questions with nonsense answers, spam pages that don't even contain the word that was searched for, wildly different results depending on your country, etc.It feels like a basic utility has been taken away. Bing is trash in a different way, Duck Duck Go seems like its index is about 10 pages deep. We desperately need some competition in this space, or regulation forcing them to go back to whatever they were doing 10 years ago.","\"getting worse\" is an understatement. it's at the brink of being completely unusable!","I use a mix of Google and Bing. Neither is great anymore, but they seem to be poor in different ways. I usually start with Google (more though inertia), and if Google isn't helpful, I'll try Bing. As often as not it will help me find something Google didn't.I think part of the problem is that Google thinks it knows the kinds of things I search for and often seems to put blinders on and tries to keep me in that lane.Sort of how just when Netflix seems boring to me, but if my wife is logged in there are suddenly shows suggested that seem interesting to me that I've never seen offered to me before.For both Google and Netflix, I wish there was a \"mix it up\" option to let me outside the space it thinks I want to be in based on assuming my prior habits dictate what I want now.","It's going to get worse with their AI providing summaries of search queries. This will kill many websites.They want you contained within their walled garden.AMP pages were also detrimental to websites that relied on traffic advert revenue.Google wants to have all your data for themselves and be your single source of truth.Centralisation. Containment.This also applies to other big search engines and advertising.","Yep, ever since their primary focus became advertising not decent results. They also seem to not give a shit about fake ad results either. Searching for open source software often gets ad links to rip offs.","Humour:Posting queries on Reddit is the new search method.It's like Amazon's mechanical Turk, except for free.Reddit responses are also artificially intelligent.There are probably more quasi lawyers and experts on Reddit than in IBM or NASA to set things straight.It's still more accurate than using Bing. It also avoids the promoted results, maybe.Keyboard warriors also out perform Google in response times.","Ad complaints aside, it's also the fault of the rise and grind listilcle crap. You know, you look something up and you're met with an article with 2 paragraphs of SEO preamble, and 8 paragraphs of follow up information where 2 paragraphs would've sufficed.It's to the point where AI will definitely be doing the work when making these sites because they are so formulaic and the bar is set so low.","Getting rid of booleans and -\"badthing\" functionality in searches is infuriating!For example, want to search for cyberpunk but not 2077? Good fucking luck!","There are certain things you can’t find on Google anymore. The search engine overzealously excludes websites it considers non-authoritative.I understand putting authoritative sources at the top of the search results, but at least let me see results from smaller websites below them instead of irrelevant results from corporate websites.","For programming stuff, it's next to useless and drives me to blogspam.e.g. tutorials point . com is the first hit for strcpy. Geeksforgeeks is the second, and cppreference is the third. The \"correct\" hits are at the bottom of the page (man.die.net and opengroup.org).","I could have told you this five years ago. Eventually, advertising seems to ruin everything.","GA and SEO is the main contributor to the shittifacation of the internet.","Dude, I’m 46, have used them all, Lycos, Webcrawler, Inktomi, you name it. The ides that we need a paper to tell us this is absurd, although I appreciate the validation. Search is pure garbage now, between the gamed results and sponsored links being half the page, it’s terrible.","I wonder how Reddit usage has changed over this time period. I basically have to add “Reddit” to every Google search these days to find better info. Redditors don’t give you the best info, but they often give you the leads you need to track it down.","Which search engine do you all think is the best alternative nowadays?","I’m a plumber so often I search for parts or information on specific things. Googles first 30 search results are just plumbing companies near me.","Gary Vee said it best: Marketers fuck up everything.",""],"points":14765},{"text":["Africa's chance for green electricity","A joint study by the University of Tübingen, the Senckenberg Society for Nature Research, the University of Osnabrück and the University of Rwanda has found that 80% of the energy required in Africa could come from renewable sources by 2040Solar and wind power plants can be operated in a decentralised way and in local grids without being connected to overhead power lines; the authors point out that this is one of the advantages of renewable energy sources. It sidesteps the need for expensive infrastructure.The continent's energy requirements are expected to increase considerably in the coming decades.An additional investment of $30 billion a year is required. China, US, and Europe are most likely to help finance it."],"points":0},{"text":["New UEFI vulnerabilities send firmware devs across an entire ecosystem scrambling — PixieFail is a huge deal for cloud and data centers. For the rest, less so.","At least nobody uses IPv6!","By exploiting the PixieFail vulnerabilities, an attacker can cause servers to download a malicious firmware image rather than the intended one.Boot image isn't firmware.Microsoft also claimed—in error, Arce said—that exploiting the vulnerability required the attacker to first establish a malicious server on the affected network. Arce says no such requirement exists.\"An attack only needs to be able to send packets on that network,\" he said. \"Also, the proof of concept code which we provided to all vendors, including Microsoft, does not set up any server.\"Quarkslab Chief Research Officer Iván ArceAnd what's executing the PoC on the network, magic dust particles, or perhaps a computer that's serving those packets like... a server? Jesus.Microsoft, meanwhile, issued a statement that said the company was taking “appropriate action,” without saying what that was.Well... they can update the UEFIs on the hardware they sell and ask other vendors that they do the same, it's not like they can do anything else.Unfortunately pretty much all UEFI implementations are closed source so this is going to be affecting a lot of hardware (every x32 consumer device since 2011~ at the very least) that's never going to see fixes for it.Fortunately people usually don't end up in PXE unless their existing system was unbootable.TL;DR * Does this affect me -> Not really * Should I update UEFI if an update is available -> Yes * How do I do that -> Support page for your mother board or device is going to have an update under BIOS/UEFI/Firmware section somewhere * You will probably need to be running Windows or have a FAT32 formatted flash drive, depending on the UEFI implementation. * Refer to device/motherboard manual if in doubt. * My device is 2011+ but I only see BIOS updates -> You have UEFI. You can either have UEFI or BIOS, they are mutually exclusive. Your vendor is most likely incorrectly labelling the download and most likely does it in other places too","Goddammit, I just updated my firmware yesterday."],"points":16},{"text":["Google says YouTube's latest slowdown isn't linked to ad blockers | Update: AdBlock and AdBlock Plus have been updated to resolve the slowdown issue.","Just use ublock origin. Edit: added origin. Ublock (not ublock origin) are stealing scammers.","so was youtube defending ad blockers in this case? If so very strange especially how much they have been cracking down on adblock.","Hold on, Google says YouTube's latest slowdown is NOT related to adblockers, yet to fix the slowdown I must update said adblockers...how is that unrelated? What a stupid headline.","I use Firefox and only ublock origin. My cpu fan is still screaming at me.","That was odd","\"So, your code is just shit?\"","billion dollar company says NO U!","Yeah I totally believe Google /s","I need an iPad solution. No unlock origin…"],"points":191},{"text":["Google now admits it could collect data in Chrome's Incognito mode | The company updated its disclaimer after settling a lawsuit accusing it of tracking Incognito users.","Didn't we know this for years?","It was never meant to not be tracked by them. It just means it's not writing your searches to your history. Hard to believe anyone would think it ment you were invisible to everyone on the net lmao.","May FireFox live forever","Even if it's \"tracked\", it's still not associated with your account if you don't log in to Google in the incognito window, right?","Thought this was common knowledge but apparently not","There's really no reason to use Chrome anymore. It was the best browser for a long time, but there are many good alternatives now that don't spy on you to this degree.","Laughs in Firefox","Everything online tracks you. It’s dumb to think it doesn’t.","It's very wrong for us...😔😔😔","Scumbag company","\"Google admits it steals your data, even when it is in a mode where it tells you it doesn't\"Shocked face","I feel like if you DIDNT think there was extra tracking going on in incognito mode then you're just dumb","I hate everything Google, Apple, Microsoft promises ”Your privacy is our number one goal” hope in the future we can buy Ai’s to protect us while exploring the web!","Remember when Google had the Motto “Don’t be evil”? They lost it in 2018 because it was causing workers to stand up against shit like this.","Don't do evil, heh?","I may get downvoted but I actually think this is a good thing.Privacy always has and always will exist in 2 tiers: those who know, and everyone elseIf you don't know about VPNs, covering tracks or using different browsers or computers to maintain privacy then you are everyone else. This is a constantly evolving war of privacy measures meeting anti-privacy measures and Google just isn't going to be your 'guardian', it's not their business model.","They are keeping the incognito naming? That for me is the bigger issue.","Why the fuck would anyone trust google with their private data. They literally make money by collecting and selling that data.","If you did not switch to Firefox, do so.","Google knows what my thing is?They *know* what I'm into?","This is obvious.The main reason to use incognito mode is if you don't want to be directly advertised to for something you searched, or if you don't want something in your search history."],"points":171},{"text":["Big tech firms recklessly pursuing profits from AI, says UN head: International community has no strategy to deal with risks, António Guterres tells Davos meeting","Lol the International community has never had any viable strategy to deal with the risks of any seriously disruptive technology. What else is new?","Whatever guys like this say at Davos, believe the EXACT opposite.He and his billionaire paymasters are terrified of a world where a person in their bedroom can outcompete them and their entrenched interests.Full steam ahead!"],"points":19},{"text":["I had my face stolen by AI","This is an anti-AI article written by AI about a woman made up by AI who is blaming AI for stealing her AI generated face","This sounds suspicious. No mention of the name of the insurance agency or pictures of the offending ads. I’m not saying it didn’t happen but …","This is going to end up in arguments similar to “did they steal my song?” There can only be so many variations without it ending up looking like someone you know or even someone famous. So how do they intend to interpret that and determine what is copying (not stealing) versus luck of the draw?","The face you make when your \"face is stolen.\"","Wait till they learn about photoshop","It should have aimed higher","It wasn't stolen, it was copied.","She's hideous, and yeah, your face wasn't stolen."],"points":92},{"text":["Japanese flying bike startup A.L.I. Technologies files for bankruptcy","Feels like there's been a new personal aircraft company every year for the last 20 years, with similar designs costing 200k-1M, and none ever reach the market.I never understood how these companies plan on their products being legal to use under civil aviation laws.","General aviation and motorcycles. Let’s combine these things and see how many wealthy, overconfident, middle aged men we can kill!","Apparently, the lack of personal flying vehicles isn’t the massive problem we thought it was.","This is possibly the 1000th flying automotive company to go that route. Why are people trying to solve nonexistent problems these days?!?!","No wonder… I mean four fans? Did they learn nothing from TotK-engineering-class? Everyone knows that you build air-bikes with two fans because it’s more energy efficient.","Some of these companies are just scams to get investor money without ever going to market. Not saying that this one is.","I guess it never got off the ground.","castles in the air.............................","This photo looks like a still from Kamen Rider"],"points":53},{"text":["Here’s OpenAI’s big plan to combat election misinformation","I’m still waiting for someone to read the article and comment on it so I have a Reddit idea of what’s going on.","Wait, wasn't the Muskbro supposed to give us the ultimate \"free speech\" AI? /s"],"points":13},{"text":["OpenAI drops ban on military tools to partner with the Pentagon","Ethics matter until there is profit to be made, apparently.","I've seen this before.","It is that easy to give up scientific integrity, money opens every door.","Money talks. We have been warned about this multiple times.","codename: skynet","OAI: \"WE HAVE PRINCIPLES, DAMMIT!\"Gov: $$$$$$$OAI: \"WE HAVE PROFITS, DAMMIT!\"","Curious to see how this collaboration unfolds. 🤔","That sweet, sweet, defense money is hard to pass up","\"Don't be evil\" always was and always will be a PR stunt.Corporations do not have 'owners' or 'beliefs', they are simply machines to serve the majority of shareholders realise value.","Ironic that the article explains it's uses are explicitly not related to weapons, but veteran suicide and health.LLMs have very little battlefield applications and there are already plenty of ML tools in conflict","I bet they are going to use it for super powered shilling and swaying domestic opinion about certain foreign affairs on social media.","Wondering if this is a result of pressure from copyright holders about training models. Diversification.","I hope they develop new tools. I have seen a few stuff that chatgpt has made up, and I wouldn't what it having access to weapons or vital systems.","Good. If it helps to advance and protect the democratic world why shouldn't it?","Recruiting tools would be a safe bet considering the state of sign ups lately."],"points":107},{"text":["Don't let that hardcore hardware go to waste. Instead, start Chopping for rewards on Salad. You can earn up to $180 per month! Join the Kitchen today and profit from the power of your PC."],"points":0},{"text":["The Militarization of AI in South Asia","TLDR: its all clickbait , Random and baseless speculation that India is using AI for weapons and not for Bobs","AI is already being used to determine targets in the israel/gaza conflict. I wouldnt be surprised if its been affecting conflict much longer than publicly known."],"points":2},{"text":["AI Act threatens to make facial surveillance commonplace in Europe","Worrying part is it seems the Council has gone back on a deal with MEPs to limit facial recognition technology to the prosecution of serious criminal offences.It in a leaked draft of the bill.","Arrest warrant face scanning is going to be all but inevitable in most countries now, at least in specific zones or cities. Many people will support it because career criminals and street gangs will be easy to take down.The really creepy shit will be cameras monitoring your actions on the street. Logging who you greeted, who handed you something, all the connections and suspicious actions.Jumping in and out of a car to pick up weed will be trivial to detect, both dealer and buyer will be easy to prosecute.\"But they're breaking the law they deserve it\"Ok now imagine homosexuality is still illegal with this tech, it's dystopian.In the UK the debate on public CCTV ended the day we had 4 failed suicide bombs and the perps faces were everywhere within minutes."],"points":7},{"text":["Many failed before. Will YOU complete the trial?","A black hole is a region of spacetime where gravity is so strong that nothing, including light and other electromagnetic waves, has enough energy to escape it.[2] The theory of general relativity predicts that a sufficiently compact mass can deform spacetime to form a black hole.[3][4] The boundary of no escape is called the event horizon. Although it has a great effect on the fate and circumstances of an object crossing it, it has no locally detectable features according to general relativity.[5] In many ways, a black hole acts like an ideal black body, as it reflects no light.[6][7] Moreover, quantum field theory in curved spacetime predicts that event horizons emit Hawking radiation, with the same spectrum as a black body of a temperature inversely proportional to its mass. This temperature is of the order of billionths of a kelvin for stellar black holes, making it essentially impossible to observe directly.","All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....","Wait, you actually opened the comments? Are you stupid?","The world would be such a better place without you people in it.","this you?","nice","son ellos","with many on the title this is a juicy clickbait .","who is upvoting this why","Wasn't expecting comments on this","Techbible is your go-to tech community. Ask questions and get expert answers on all things SaaS. Stay updated on the latest tech news, discover trending tools, and share your tech stack with the world. Don't Forget to try it out.https://techbible.ai/","wow"],"points":7}]