[{"text":["AI robocalls impersonate President Biden in an apparent attempt to suppress votes in New Hampshire","Disregarding that unknown numbers calling are bad news anyway, do candidates running for the top job in that country normally call regular jackoffs like this?I mean, surely people wouldn’t actually be fooled by somebody trying to sell them something over the phone, would they?","The future is here.","Maybe the AI is sentient."],"points":19},{"text":["Meta to let EU users deny cross-site tracking as Digital Markets Act bites","What’s the over under on them getting caught trying to secretly violate this law?","Maybe one day, the US will follow.","Awesome!","EU W","Ironically I can't view this article unless I accept the plethora of cookies and trackers yahoo is running."],"points":30},{"text":["Russian hackers accessed Microsoft's corporate network for a month | Poor secure configuration exposed the software and AI giant to information exfiltration","The attack started in late November 2023, Microsoft revealed, when Midnight Blizzard employed a password spray attack to compromise a legacy, non-production test account. Password spraying is a quintessential brute-force attack where a cybercriminal tries to guess a known user's password from a list of common passwords. The attack is often automated and slowly occurring, as the threat actor tries to fly under the radar.","This was a password spray on a legacy, non-production test account.That is an internal controls failure on the SecOps team to disable or removing it in a timely manner.","I'm guessing someone in the sales department clicked a link?","The Russian hackers were ultimately interested in information regarding their own activities, Microsoft saidSo they wanted to know what Microsoft Security’s got on them? Interesting","Guys. GUYS! Why would Microsoft be expected to have stringent anti-hacking capabilities and training?! It’s a very small company, not at all relevant to tech.","But I thought azure was secure. /s","M$ probably was still using WinXP and Server 2000 internally to avoid the 365 subscription services or Windows 11 ads.","AI giant is…a stretch.","Didn’t they like, make the platform?","I converted to Apple two years ago Windows closed my account because of inactivity Good for me!","Can Windoz suck even more ?","Well, when it is not the Russians it the Chinese these days and when not the Chinese it is India, but the only real difference is why one gets caught while the other two are ignored is because it is a sham to begin with because the end goal for them all is the same.N. S","Not exfiltration!?!","Who is to say if zuck even cares!Hell maybe he gets to make more money on security fixes.","AI giant.Okay. 👍🏼","Putting U2F or TOTP multi-factor would've stopped this type of attack in its tracks.","What can I say about Microsoft management: Incompetent and more Incompetent, Arrogant, over confident, reckless, foolish...extremely sloppy, bad judgement.","And Microsoft wants us to believe that Defender and screensafe are secure and reliable. I call bullshit.","Only for a month tho.","Gosh. Who knew Microsoft was the most vulnerable large operating system in the world?","Seems like there could be a better headline for this.","All that MS Office 360 subscription money being put to good use.","Yawn.. Microsoft security fail is not news.","Haha!","I’d wish we can hack the hackers…I’d like to hear more stories about that."],"points":213}]