[{"text":["Google DeepMind co-founder Mustafa Suleyman warns AI is a \"fundamentally labor replacing\" tool over the long term","Yeah. We know.It'll be used to replace us long before it's used to save us.","I was going to read the article but there’s a paywall. I can guess the gist of it though. It’s pretty obvious where AI is headed. They’re already in the process of replacing people with it"],"points":0},{"text":["Many failed before. Will YOU complete the trial?","A black hole is a region of spacetime where gravity is so strong that nothing, including light and other electromagnetic waves, has enough energy to escape it.[2] The theory of general relativity predicts that a sufficiently compact mass can deform spacetime to form a black hole.[3][4] The boundary of no escape is called the event horizon. Although it has a great effect on the fate and circumstances of an object crossing it, it has no locally detectable features according to general relativity.[5] In many ways, a black hole acts like an ideal black body, as it reflects no light.[6][7] Moreover, quantum field theory in curved spacetime predicts that event horizons emit Hawking radiation, with the same spectrum as a black body of a temperature inversely proportional to its mass. This temperature is of the order of billionths of a kelvin for stellar black holes, making it essentially impossible to observe directly.","All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....","Wait, you actually opened the comments? Are you stupid?","The world would be such a better place without you people in it.","this you?","nice","son ellos","with many on the title this is a juicy clickbait .","who is upvoting this why","Wasn't expecting comments on this","Techbible is your go-to tech community. Ask questions and get expert answers on all things SaaS. Stay updated on the latest tech news, discover trending tools, and share your tech stack with the world. Don't Forget to try it out.https://techbible.ai/","wow"],"points":6},{"text":["How 'sleeper agent' AI assistants can sabotage your code without you realizing. Today's safety guardrails won't catch these backdoors, study warns.","There was a paper concerning a similar attack based on Ken Thompson’s trusting trust Turing award speech. The proposal was diversity of tools cross checking each other (in this case compilers but LLM static analysis would suffice). As long as the tools aren’t colluding the end result is more trustworthy."],"points":0},{"text":["Cable firms to FTC: We shouldn’t have to let users cancel service with a click | Customers may \"misunderstand the consequences of canceling,\" cable lobby says.","Lmao “we don’t want to give them a button to cancel, so they are forced to call us, and from there we overload them with so much information that it seems like they are getting a deal, when in reality we are removing 5 services and charging them $10 extra”","Doing whats best for the customer my ass. I hope the FTC sees right through these shenanigans.","“Oh shit… why my TV no workies no more? Me no understand. I just told them me no wants pay money. Now no TV? Jeeze why no one save me from me?” Said no one.","The Capitalist Profit Motive makes for cold and stark conditions in the marketplace, bone-chilling conditions, when you get right down to it. Lobbying the Fed to make it harder to cancel or unsubscribe?? These blood-thirsty bank-account predators are ice-holes, straight up leave-you-out-in-the-snow, ice-holes.And I say, let's all freeze 'em out, just like they try to with us!","No one believes this at all, but I'll give them props for saying it with a straight face.","No, we completely understand what we are doing!","This is my favorite line: \"The cable lobbyist contended that consumers are happy with cable company cancellation practices\". 😂","“They may not realize how much money they will be saving!”","If you can sign up with a click you should be able to cancel with a click.","Greedy corporations just want to make money upfront with streaming services. No wonder studios have lost their motivation to create great successful shows that could produce 100+ episodes. Those days and great shows are gone.","“After learning the consequences of enrolling”","FTC response: than eliminate the consequences (fees)","Lina Khan and FTC is so useless. There are actual evil fucks like the cable industry and their bad practices. But she want to score a point for her political career.","“Do you realize that not only will you lose your channels but you’ll also stop paying us!?”"],"points":127},{"text":["Apple's Vision Pro Won't Launch With Netflix App","Everyone knows you will have bought it for porn. Not fooling anyone","We'll see, but once the novelty wears off I can't see too many people wearing a headset to watch hours of video.","Oh noes!The thing no one actually wants will not run an app that's available basically everywhere in a dozen other formats.But I guess the innovators that fork over $3500 for this nonsense device will want to use it for everything, so perhaps they'll actually be sad.","I tested the quest 3 recently and i was quite surprised how well it performed. Normally you could assume Apple does these things way better. But that price tag is enormous. I would definitely want to try it to see if it’s worth the money","thank god it'll likely be a 30 dollar special monthly subscription anyways"],"points":9},{"text":["OpenAI must defend ChatGPT fabrications after failing to defeat libel suit","This is so ridiculous.","ChatGpt isn’t even what OpenAI is trying to sell to people, chatbot is just a demo of capabilities…","Skynet make ouchy ouchy … I am sure if you gotta defeat libel suit you can argue it has intellectual property over said “fabrications” no(?)"],"points":2},{"text":["Court bars US imports of Apple watches that read blood-oxygen levels","Apple Watches capable of reading blood-oxygen levels cannot be imported into the U.S. while Apple challenges a government decision that the devices infringe patents, a federal appeals court ruled. The patents in question belong to medical technology company Masimo.The ruling by the U.S. Court of Appeals for the Federal Circuit means the affected watches cannot be imported starting at 5 p.m. on Jan. 18 while Apple appeals the U.S. International Trade Commission's ban. Separately, U.S. Customs and Border Protection on Jan. 12 determined that a proposed redesign from Apple would allow it to import reconfigured versions of its latest Series 9 and Ultra 2 Apple Watches without violating the ITC's restrictions, court filings show. Read the full story for more.","Didn’t they disable the sensor to comply in the meantime so why are they completely banned?"],"points":0},{"text":["This AI just figured out geometry — is this a step towards artificial reasoning?"],"points":0},{"text":["A ‘Shocking’ Amount of the Web Is Already AI-Translated Trash, Scientists Determine","Just look at all those posts on Reddit \"What is your most liked level in the game/beer/song/character in movie or game\" and such. So convenient for AI parsing...","Holy fuck, yes it is.Google, how do I make a (whatever)?Random website - Would you like to make a whatever? It’s very important to know how to make a whatever. In this article we will discuss making a whatever. There are many different types of whatever’s, so it’s important to consider what type of whatever you would like to make. (incomprehensible nonsense)","And so are most of the accounts on large social media sites. Ever wonder where all those people are coming from on Facebook, Twitter and others? Why the numbers always increase and never decrease? Shouldn't it sort of level out after a while with people dying and others getting an account for the first time, not just increasing?How many people are there in the world and how many \"users\" does social media claim they have? Doesn't add up does it?","I know someone who was a writing content creator for a company that creates a ton of “top 9 ways to xxx” type articles (I think it was Word Agents?)Last year they sent out an email letting all their writers that they would no longer be needing them, and if they still wanted to continue working they would serve as editors to AI created content instead.","what’s even more hilarious is the amount of people that consider AI the second coming? It’s the most ridiculous thing.","ask google a question and excluding quora or reddit, every single hit will be an ai generated ghost down blog post","How the AIs will really take over, with misinformation.","The photo on this article is hilarious. Like the guy is devastated to find out he’s been reading AI bullshit all this time","TURN OFF. UNPLUG. TUNE OUT.Fuck the dystopia.","The next big hot skill is editing AI responses before they are released. It fits with the generative concept. We will forever be programming our robots.","Vice probably has AI write its articles","This is one of those things that should be obvious without scientists studying it. Although I guess that helps quantify the issue.","Great stuff to train new AI with","Entropy in action!","Oh no, do we have to go back to the real world now?","Most sensitive stuff on Reddit is already propaganda as well as the comments. The narratives and comments are so predictable.","Newsweek comes to mind...","It's been about a year. If y'all can't see why AI is going to disrupt everything by now, you never will","A ‘Shocking’ amount of the web has been trash long before modern AI came onto the scene.","It’s almost like AI is just a shitty idea. If only there were 100 years of novels movies shows and games that shared that exact notion…. Oh wait…..","It’s already human trash, how is it possible to tell the difference?","If you rely on the web as an objective source of info without due diligence then you are shockingly stupid.","Just flip the switch on and off a couple times and reboot the entire global shitnet","A mind this news, why? I think I give the human race far too much credit for anything to do with intelligence, I think.","I get more annoyed at AI clogging up the image search honestly. Trying to find a non ai stock photo is suddenly way harder and a lot of it looks pretty bad/fake too.","AI written articles are (at least for now) pretty obvious because they’re mind numbing to read.I wish I could delete all of the websites that offer to answer a question only to state in 7 different ways throughout 6 paragraphs the same drivel without actually answering the question.I get it’s probably an engagement metric thing but the one time I fell for it it felt like mental water boarding.","Entirely googles fault. What we consider “the web” is google search results.","The future fucking sucks robot dicks and I hate it","It’s a race to the bottom. I for one have stopped googling most stuff outside of Reddit posts, which is already stupid for me to do. Once that goes, eh… encyclopedias?","It doesn’t help that search engines promote AI trash over websites that have been around longer.","Google is barely even useful to me anymore. You have to sift through a whole page of bs just to get to anything remotely close to your search, and once you do just skip the first 4 paragraphs of that cause it will just be saying obvious shit you already know before getting to the damn point.","What did they think was gonna happen. lol.","Google search blows, Twitter is dead, reddit is a shadow of what it once was, Instagram is Instagram, Facebook has always been shit, Amazon sells everything, ebay resales your unwanted Amazon buys, YouTube is more Ads than content, streaming sites is essentially cable TV in all the worst ways, most newsites are shit, more than half the internet feels like bots and AI... Man, the Internet has become a really sad place."],"points":410},{"text":["'It hasn't delivered': The spectacular failure of self-checkout technology","They work. But not for all situations.Buying 5 items? Good.Buying 100 items? Bad.Over here in the states, we have an odd problem. They will install 20 kiosks, but only have 10 open. And there's a huge line waiting to self check out.I'm guessing at stores in Britain also you will see maybe 20 built lanes, but only 3 open, and the lines are 10 minutes long.Yes, I get it, this is a captivated audience and understanding the rate of processing to customer loss maximizes profit. 10 lanes working 100% is more profitable than more lanes working anything less than 100%. But these are automated kiosks!","Most stores in Sweden have these but I find that most people including myself only use these when you have very few items. Some stores put a 10 item limit as well.","Actually, I love self checking. Much quicker don’t have to talk nonsense to anybody.","Where has it failed? Works perfectly fine where I live.","I do my weekly shopping at Aldi (Chicago) and it’s great. Never a problem with scanning, goes right in the bag, done and done. And, I’m old(er).","Oh dear they’re unhappy with their customer’s job performance","I like self checkout, prefer it even","Here (in Canada) self-checkout is very much a mixed bag, works well in some stores and is a delight to use... and in just as many others is disastrously painful, leading to lots of exclamations of \"F#$% this\" and people going back to a staffed checkout line.","Interesting considering just one kiosk costs over 120k, that’s right, just one. Supermarket chains expect to make up the cost in 5 years. Not likely, I assure you. Whoever was selling these machines, they made out like bandits.","I love self checkout, I hate talking to the cashiers, plus I’m faster than they are. I worked nine years 2009-2018 as a cashier at a grocery store. I used to get asked all the time, about when are we going to get self checkout.","Self-checkout really improved the situation at my local safeway. It's a smaller older one, but really near my home and its super convenient, but before they installed a cluster of self-checkout there was always a huge line for 1-2 cashiers. 99% of the ppl in this store use it to get like 3-4 items for dinner or something, and it's just way faster. Four self-checkouts improved the experience 1000x imo... But yeah, echoing others, it kinda sucks for big trips.","I love it and it’s fucking easy","I once had to wait 20 minutes for the “manager” to give me my money when the self checkout didn’t give me my change. Then he refused because he didn’t like my attitude. 5 minutes later he apparently liked the attitude of the cop I called and gave me my money. Corporate liked the police report even more. I sold the large gift card they sent me and have never been back.","I mean what did they expect? Not only are there dishonest people in this world that take advantage of it but there are people that have no business once so ever even attempting to operate those things. It's been a cluster any which way you look at it.","I like self checkout.","Just let me scan my own fucking ID to buy alcohol. Keep someone around in case someone looks too young. I’ve waited 4-5 minutes for someone. All the while holding someone else from checking out.","Do you remember before we had these, I do, it sucked. Now I’m just upset about the idiot that acts like they have never seen one or just doesn’t care how slow they are, that and the fact the companies refuse to pay their employees a fair wage and thus can’t find good employees to work as cashiers, so to save money they just don’t staff them anymore. Look at pay for a cashier between Walmart vs grocery stores. The tech is really good, the greed in companies is the issue.","This is propaganda. Only corporations and old people don’t like self-checkout","Self checkout ain't going anywhere, anytime soon","Doesn’t save me any money in checkout even though the grocery store is (theoretically) employing fewer people","lots of people don't have any skills, maybe not that bright, can only work part time due to family, or need a 2nd job. Checkout and bagger is a nice job for a lot of people.I avoid the self-checkout. I want people to have jobs and pride in themselves.","Of course it hasn’t delivered. It’s a little kiosk, not a self driving car. Smh","I hate self checkout. I’ll find the one human checkout lane and wait in line if I have to.","Such a failure I see it has expanded everywhere. What is this shit?","Self checkout technology checks itself out.","The problem is not the self checkout but people who don’t know how to use them. If I was a dictator leading my country I would demand retina scans for all customers using them. Customers would then be timed using them. Anyone who is too slow gets banned from using them and has to queue up for a cashier with all the other plebs","Used it yesterday. One of the 3 self check outs open out of 11 that were there","And guess who’s gonna pay for their oversight, definitely not the boards of directors, investors, or the companies themselves.","What ever happened to RFID technology that would allow us to walk through a scanner, add up all our groceries, charge it to our credit card and the give us a receipt as we walk on by?I remember those adds from about 15 to 20 years ago.","Self checkout has saved me from standing in a line of 10 idk how many times","I like them when they work without issues, but they often don’t. And then I have to talk with someone,while my whole motivation to use it was to avoid talking to someone.","In what world is self-checkout a failure? That is just an absolutely insane statement. Self-checkout is ages faster than the alternative. Even a line of 5-10 people will get through self-checkout faster than a single person at the manned lanes. It's been around for 15+ years now and couldn't be going better.","With Giant grocery stores in my area, it’s the perfect set up. You connect to the wifi, open the app. Scan your item. Put em in the bag. Rinse and repeat til done shopping. Click checkout on app. Scan barcode. Pay. Leave.","The simple act of purchasing groceries became so complex with all the coupons, sales, cards and other points based scams retailers invent. Then people just can't use self checkout.Btw, for those who don't know. If you don't buy on some sort of sale you are paying over the top. When you buy item on sale usually discounted 10-20% or more you get normal price as it should be all the time.","In other news, smash and grabs and organized looting rings are on the rise.Self-checkout or not, retail theft is a problem that will eventually close down retail in many areas.","It’s fantastic at CVS. At the grocery store it often sucks.","Who would have thought that giving the general public access to the cash register would result in rampant theft?","Maybe if I got a discount for using self checkout at the grocery I would be more likely to use it. It’s faster to just go by the regular checkout with a trained human. And I can bag my stuff while they scan.","I've used them at various different places across the US and the UK, and the only ones that really work are the ones that don't check item weight. I'll generally avoid them if I know they are the weighing kind if I'm buying more than just 2 or 3 items. Just too much faffing about as it inevitably gets the weighing wrong and you have to call someone over etc.Whole foods in the US and Waitrose in the UK don't weigh.","I reject the premise. I rarely use a manned register. Self checkout is always faster where I live and there is never a line."],"points":212},{"text":["Google now admits it could collect data in Chrome's Incognito mode | The company updated its disclaimer after settling a lawsuit accusing it of tracking Incognito users.","I have always just assumed that any private mode in the browser was only preventing data from being saved in your devices history.","And Troll Trace is one step closer to a reality...","Incognito is only to hide your porn from your girlfriend ffs.","Ever since “the patriot act” passed, I’ve always assumed everything was being collected, even key strokes.","If you still use chrome, you get what you deserve.","Step 1: get caughtStep 2: change ToSStep 3: continue","Lol remember “Don’t be Evil”","Using Google chrome is a form of self hate","Any company can collect data from incognito mode and from any browser. Sad, but true.","Told some colleagues I use Safari instead of Chrome and they looked at me like I had 3 heads.","I'm always amazed at people who don't seem to understand all the various \"private\" browsing modes in any browser only protect you from your spouse finding out you are kinky and/or disgusting. No browsers privacy mode ever protects you from your ISP or Browser knowing exactly what sites you are visiting.","TBH, I think the case was wrongly decided. Google never claimed to prevent websites or services from tracking the user, they claimed that their activity would not be recorded on the device where other users could see it. This was front and centre whenever you opened up a new tab. There was no evidence suggesting that this was intended to mislead.Regardless, the court decided that Google was required to predict what features a non tech-savvy user might expect based on groundless speculation on the name, and disclose the absence of any such features. Saying what the feature does was insufficient, they also needed to say what it didn't do, despite nothing in their materials suggesting such capabilities. And that's a pretty unreasonable standard of disclosure IMO.(And I say this as a daily Firefox user. Definitely no Chrome fanboy here.)","Not surprising in the least. I mean giving the people the imagination that they're anonymous is a f****** joke","Google is a data company. Of course they’re collecting data.","I like Apple Maps and Apple’s Browser. Both safe.","Obviously all GoogleJunk is 24/7 privacy invasion.","“Could”","\"Settling a lawsuit.\"Lawyers get paid. Users get boned. We need a revolution.","Well that explains it. Nothings private. ☺️","Jokes on them. Nobody wants to see my search history.","Is this the daily thread where we shit on each other for what browser we use? Ah, yes it is.","If you have watched The Social Dilemma on Netflix, you will see the power of Google and its mind control capabilities. If you haven’t watched it, then do. It’s literally terrifying. Even Siri is always listening and that is why you may get ads you were never searching online for, you just happened to be having a conversation with someone about. I tried to turn off Siri but it’s just too darn convenient so I turned it back on.DuckDuckGo claims to hide history. I haven’t used it. Thoughts ?","Not my porn history, oh no!","As long as they dont tell my wife anything..","Stop using Google and chrome!","then what the fuck is the point","Seems like Google and Microsoft are racing to see who can be more evil these days. They don’t even try to hide it anymore. Eventually they’ll suffer a breach big enough to get some attention and some laws passed here in the states.","Did anyone ever actually doubt this?","You use Chrome? Then you deserve it","Wym settling the lawsuit? Where’s my class action!","And for how many years did they lie about that one, the creeps.","Google always admitted that. They never hid that fact.","Two weeks old news","People didn't already know this? Doesnt it say it on the incognito tab from the start?","Really!?? Anyone surprised? Hahahaha!!😂😂😂","This is why we need privacy laws passed.Every type of data gather needs to be explicitly opt-in and optional without consequences.Meaning if, in my app, I want to know how many times people use a particular page/form/control - I need to let users know I want to collect this data.Opting out of anything should never reduce user experience unless the experience IS the data collection (e.g. AI stuffs).I should also, at any point in time and very easily, be able to delete my collected non-app-critical data.In fact - let's require companies to quarterly contact you on every bit of data they've collected so far. If Ford wants to \"help\" be via copying my phone history - they need to regularly say \"we've collected 104 contacts to date from your vehicle\". If they are scared to say this boldly and out loud - then they know they are abusing it."],"points":197},{"text":["Big tech firms recklessly pursuing profits from AI, says UN head: International community has no strategy to deal with risks","We’ll probably follow the time tested mantra of letting it blow up then retroactively applying legislation. 🤷‍♂️","international community has no strategy to deal with risksThat’s a good summation of global megacorporations for the last fifty years.","Maybe countries can actually fine the companies at the same scale as their profits. Then give the fines back to the victims. We all know companies make tens to thousands times whatever fines they might get, so they just keep acting unethically. Hold them accountable!","And this is surprising for what reason? Corporations will always use every tool at their disposal to make a larger profit. They don’t give a flying fuck about the ethics of it. Corporations would burn the world to ashes if they thought it would make them and their shareholders more money.","Our society’s laws are still 30 years behind technology, and this is going to make it exponentially worse. Most our politicians are technologically illiterate ffs. I guess once AI starts writing legislation we’ll be fine. 😉","All these firms pursuing AI should be looking to replace their CEOs first with AI. The shareholder value by not having to pay huge compensation and stock options makes this a no brainer."],"points":33},{"text":["Australia Considering Mandatory Restrictions on High-Risk AI Use","Curious to see how they'll navigate the challenges of regulating high-risk AI."],"points":0},{"text":["It has been proven. Light from screens can generate headaches, eye strain, eye pain, photophobia, dry eyes and death of Retina cells."],"points":0}]