[{"text":["DeepMind’s AI finds new solution to decades-old math puzzle — outsmarting humans | Researchers claim it is the first time an LLM has made a novel scientific discovery"],"points":0},{"text":["Open letter calling on EU Member States to defend encryption. As the trilogue is about to start, EU Member States must decide what side they are on: privacy or surveillance.","This is just Tutanota advertising.Proton does the same kind of advertising except they're better at it with their blogs.Keep in mind these services won't let you keep your OpenPGP private keys offline in your own possession. Yes they're encrypted with AES but still out of your possession./r/privacyEFF - USBig Brother Watch - UKNot sure what privacy group covers the EU. Can somebody please tell me who covers the EU for privacy advocacy?Is it NOYB for the EU?","lol wait till the grandpas find out about quantum computing."],"points":1},{"text":["HP CEO evokes James Bond-style hack via ink cartridges - \"\"Our long-term objective is to make printing a subscription.\"\"","Why the hell does anyone still buy HP?","It’s already been like that with the shitty cartridge volume, involuntary ink use from printer tests and the exorbitant costs of the ink racket industry.","C'mon HP! You were never actually cool, but this is just so goddamn pathetic anymore.","Our long-term objective is to make printing a subscription.Oh, we never noticed.","r/assholedesign","This is why I got an Epson Eco-Tank. HP deactivated my ink when I cancelled my subscription. I was pissed, but that was in the terms. I bought ink from a retail store and they were “empty” after 10 pages! I run an organization, and am on the board of another one, so printing is something I have to do on a fairly regular basis.","and that is why I bought an Epson","Well Fuck HP then.","I think this is a good thing, most people don't need printers, so I will happily pay a print shop to handle that pain for me the two times a year I actually need to print things","The ink cartel.It's a racket.You're not going to be getting 50 year lasting ink cartridges just as you're not going to be getting 50 year long batteries.Ink is the new oil.","HP is pulling an Apple tactic with chipping their stuff. Lock in.","I might have news for this guy. Most people are switching to digital printing, even when signing documents. His market is busy disappearing even as he is trying to abuse his remaining customers.Blockbuster video anyone?","Samsung made a good economical laser printer, with each part individually replaceable rather than whole unit swaps, but then sold out.","It's like HP deliberately promoted this attack vector for fear profiteering.","That only makes sense via print shops rather than owning a printer but I don't see HP taking that risk onboard, they just want to print cash"],"points":85},{"text":["New oral insulin delivered via nano-carriers could soon replace injections","while I should be excited, its probably just a new way to charge Americans out the ass for insulin"],"points":0},{"text":["HP cites threat of viruses from non-HP printer cartridges to justify blocking their use, experts sceptical","Why do the cartridges need to be able to execute code in the first place?","I’m still rocking my laserjet Samsung CW480FW that I bought 12 years ago, and I have only changed the toner cartridges once and you can bet your ass they were non-“authentic” cartridges I bought off Amazon.Still prints wonderfully to this day. Too bad Samsung’s printer division was acquired by HP in the meantime.I will probably buy a brother next when this one finally gives out.","Don't buy printers that use ink cartridges - they are all a complete rip-off. The printers may be fairly cheap but you'll be paying the same as you paid for the printer pretty much every year for cartridges.Get ink tank printers. The printer head stays in place and you only top up the ink in the individual tanks. I've been using an Epson one for years - the initial purchase price was a bit higher than for the cartridge printers but that was more than covered by not having to keep buying expensive cartridges. The inks that came with the printer lasted 2 years. Even HP make them.","HP, such a dorky company.","What is the off brand ink going to extort us for a lot of money, feeling them broaching on your department?","How is that even possible?I mean, that’s even stupider than the other guy’s bandwidth gobbling washing machine.","I work with said cartridges and can with utmost honesty say, this is utter bollocks.","This like saying an off brand power cable can create a virus.","HP is a virus."],"points":67},{"text":["College CS Classes Are Tragically Dull","A completely wrong attitude towards CS unfortunately","As opposed to plethora of all the other engineering courses?"],"points":2},{"text":["Telecom Monopolies Are Once Again Funding Covert, Sleazy Local Attacks On Community Broadband Networks","Because that’s cOmMuNiSm /s","Title implies that they stopped. This is a continuous effort."],"points":1},{"text":["Facial recognition used after Sunglass Hut robbery led to man’s wrongful jailing, says suit","Whats disturbing is police just took their word and arrested somebody on the good word of a corporation.","Was it facial recognition by Fujitsu","He totally made up the gang rape partEdit: hiveminds are a funny thing to watch in action. Yep within 6 days of being in jail, my 61 y/o boy gets gang raped hours before he gets released but “couldn’t tell anyone” for fear of his life.Totally believable. He’s going for more of a payout, geniuses. Which, more power to him: police are morons.Joke’s on us, we’re bankrolling this shitshow"],"points":36},{"text":["FTC bans TurboTax from advertising ‘free’ services, calls it deceptive","Well done FTC 👍🏻","Can we just have a fucking free rifling system by the IRS instead of the BS with turbo tax and HR block?","I wish this headline had ended after 3 words.","TurboTax is pure evil. What they’ve done to make almost every single American’s life measurably worse is cause for serious retribution by far more than our regulatory agencies, most of which they’ve already bought and paid for apparently","The ad literally showed up for me on this thread","\"FTC bans TurboTax\"would have been a better headline.","Fuck Intuit! This gem is my favorite:Intuit's research tax break from 2022 alone could have been enough to fund a year of a free e-File program for millions of Americans.https://www.warren.senate.gov/oversight/letters/warren-blumenthal-sanders-porter-probe-massive-tax-breaks-received-by-intuit-while-company-fights-free-tax-filing-for-millions-of-americans","It could also clearly disclose the percentage of customers that actually do qualify for the free service, somewhere close to the “free” claim advertised, the commission saidThis is already how the TurboTax ads have been this year. Seemingly normal person talking about their taxes and then says \"37% of taxpayers can file for free!\" as if that's something a normal person would say in conversation.","Wait til the FTC starts to review all of Intuits shady business practices.","Gotta give credit, Biden's FTC and DoJ have really been going in on businesses with \"questionable\" practices","Make it illegal for them to constantly ask to buy the premium versions after every page of questions","Our credit union is always pushing turbotax in emails and when you log into your account this time of year. Guessing they get a kickback when you use their discount code, they could be telling members about other sites that cost much less or are even free.","Well, that’s ironic.","For 29 dollars it’s pretty fuckin convenient and fast. IRS needs to make an app that’s just as good for free","I am so glad that tax companies can directly donate to make sure that tax reform is never done. A whole industry that can bribe politicians just to stay in business. Gross.","I see that ad on YouTube every day.","Wish I knew how to post the image of the turbo tax free ad right under this article🤣🤣","FUCK TurboTax and their “free, free free” commercial bullshit. Complete false advertising.FreeTaxUSA (which also isn’t free but significantly cheaper) is the way to go."],"points":677},{"text":["Google to cut thousands of search quality rater jobs after dropping contract with Appen","I've been increasingly disappointed with Google search results. What's the best engine thing now?","enshittification in real time","Google’s problem is their CEO is useless and the company is desperate to keep growth going each quarter, at all costs.They’re going to sacrifice every single piece of creativity and value.","Wellp there goes my side hustle. Bummer, it was an easy $15 an hour on my off-time. Ah well. First job loss of many to AI 😅","Given how shitty google search has become, this isn’t surprising","Imagine Google killing search entirely. That would be the most Google thing they’ve ever done.","I noticed it this weekend when I needed some very specific information and Google just kept suggesting the wrong articles. It assumed I had a different (very generic) question behind my question every time i rephrased my question. I was in a black hole and never experienced that before.I went to Bing and those results did not feel fantastic either and when I wanted to go to the second page it asked me to install the app, which felt like such a typical Microsoft fail.I am actually at a loss how to proceed now and following this with a lot of interest.","The CEO is a moron that thinks google can be forever sustained operating as a startup. If the search engine continues to die then everything else goes belly up","It feels like Google got bought by private equity and are being stripped apart. My last 3 phones were pixels but at this point I'm starting to look elsewhere. I'm not over the moon with Samsung but their skin is decent and they have good update support which top my list of musts","Google is quickly nose-diving down into oblivion.","Is Google about to have its Alta Vista moment?","I’m already moving away from Gmail and all the other “free” services. Google has jumped the shark. Amazon will be next.","I haven't used Google in at least the last 5 years. It's been terrible for a decade now. I have no idea why the world is acting like it's been great until now.That said, Google Scholar Search is still pretty nice.Yandex, Yahoo, Bing, are decent.DuckDuckGo isn't much better than Google imo.There's also things like YippySearchEngine that are more of a combination of search engines.","Bring back AltaVista!","They say they don't know but we all know that they're going to replace all the quality raters with AI eventually.","Im using chatgpt as search engine.","Title written by a Yorkshireman; 'appen that's it","i used to do those ratings for extra cash like 10 years ago, they paid surprisingly well for the time and for working from home. super boring though","Google realised A.I. could perform the same task better cheaper faster remember this is just the tip of the iceberg"],"points":1441},{"text":["The US government opens 22 million acres of federal lands to solar","Got to start somewhere. Glad there’s enough federal land available.","That's great, Nevada is the perfect place for solar panels, it's amazing that this wasn't done sooner.","Roofs, parking lots, farms …would be a better place to start. https://www.theguardian.com/us-news/2023/may/21/solar-farms-energy-power-california-mojave-desert","22 million acres in Nevada is enough to produce over 6600 terawatt hours of energy per year using current solar panel technology. That includes the area required for support infrastructure - roads, power collection cabling, etc.6600 terawatt hours is about 50% more than the total electrical use in the U.S. in 2023. So really what we need is capital and storage. Gravity storage is likely to be the most cost effective at scale, and has the added benefit of being fairly low tech with no need for expensive elements like lithium or cobalt.So... basically the country could be using fully renewable energy without any real technology advancement if we just spent the money. Personally I'd be fine with buying a few less next gen aircraft carriers to make this happen, but that's just me.","I'm currently working on a 2000 acre solar farm. We've decimated every square inch of the land. Heavy machinery has to touch every inch of ground around the panels several times, as well as access roads, etc. On our site they drove steel girders 6ft deep, in a 25ftx25ft grid across the entire site to support the tubes that support and rotate the panels.","excellent. NOW STOP THE INTERIOR DEPT AND FOREST SERVICE FROM REMOVING AND KILLING WILDLIFE ON AND FROM OUR PUBLIC LANDSthey need to be drilling for water and planting trees... 640 million acres for wilderness","As a kid who spent a lot of time both in the desert and in Los Angeles, which has a lot of rooftops that do nothing but keep out the sun, this actually disappoints me. Even so-called “barren” desert has beauty, value and life. There’s better options that are less environmentally damaging and far more flexible, but as usual we’re just going for the easiest option instead.","[deleted]","Not enough transmission lines and such. Some solar and wind is waiting years and years to go up."],"points":153},{"text":["Nightshade, a free tool to poison AI data scraping, is now available to try","Useless. They can use this to detect it and scrap off the crap. Complete moot.","What if they blur it slightly in Photoshop?","i will give you the venom and i will give the antidote","Nice idea, would be fairly easy to stop though. But at least people are thinking about this.","Why does everyone hate AI? It’s so cool?","lol that picture of the cat after 100 poisons","Regardless of the long-term effectiveness of this, it's interesting to see it as part of an evolving arms race."],"points":11},{"text":["Google and AT&T invest in Starlink rival for satellite-to-smartphone service","Kinda funny that they're using SpaceX rockets to send their satellites into orbit. Just hoping that there's more competition in the future. No one wants a monopoly."],"points":1},{"text":["EFF adds surveillance hub so Americans can check spying"],"points":0},{"text":["Bank fined A$820,000 for giving home loan borrowers wrong information, after it “chose to use automated systems”","AFR’s Jenny Wiggins:• Justice Robert Bromwich rejected ME Bank’s argument that its failure to correctly notify hundreds of customers of changes to home loan interest rates and minimum repayment amounts between December 2016 and September 2018 was a “minor” offence because it was a technical issue caused by defective software systems.• “The offending was only technical because ME Bank (legitimately) chose to use automated systems,” the judge said in his ruling after the bank pleaded guilty to four criminal charges.• “Whatever goes wrong in such a system will inevitably be technical in nature, with different levels of human input always being a feature.• “But when such systems are used, very high levels of diligence are required and are to be encouraged and, correspondingly, inadequate diligence deterred.”• The bank allegedly sent letters to customers misstating the minimum amount they had to repay after the fixed-rate or interest-only periods of their home loans expired.","From a finance perspective this is wild. I've never done any sort of code switch over where it wasn't exhaustively tested before and after to make sure that the data wasn't altered by the change in an unexpected way.Serious failure of auditing and due dilligence.","Until executives go to jail, this sort of shitty behavior will continue. $820,000 might be a lot of money for you, but for a bank this is hardly even a slap on the wrist.","Bank's new slogan: 'Trust us, we're almost as accurate as a weather forecast.","Automated systems resulting in a net gain for the company is not new. Company looses money? Big issue fixed immediately! Company makes money? Potential issue time to build an incompetent team to “fix it” within a couple years to help in a potential lawsuit.","I'm only imagining when all the automation by ChatGPT will lead us in future","We need another GameStop type movement asap","Eh, $800k is factored into the cost of doing business for them. Heck, they’ll probably get it reduced to $1,000 on appeal. Fines need to be based on a percentage of the gross revenue in order to have an impact.","This is very reminiscent of the British post Office disaster where a new, computerised accounting system had been rolled out without proper testing.As a result, many post offices reported incorrect (too high) incomes, and since the software was believed to be correct, a lot of local postmasters were accused and convicted of fraud. Most of those suffered a total breakdown of their lives, lost the trust and respect of their communities, and several even took their own lives.It was only several years later that the computer systems were found to be the culprit, and also here the upper echelons tried to sweep it under the rug.Needless to say, those same upper echelons never got the punishment they deserved."],"points":157},{"text":["Google lays off “dozens” from X Labs, wants projects to seek outside funding","Google has passed peak Bell Labs, if that makes any sense. Google has had several products not dominate the market and is being beaten by Microsoft at their own game - algorithmic machine learning. Alphabet has to focus on whatever their core mission is and remove middle managers who are getting in the way with cumbersome bureaucracy and administrative budgets. Google's Lab Budget should be 100% for people that create things, not MBAs that put together powerpoints .. a job that will soon be entirely automated by Google's main competitor Microsoft.But unlike MS, Google has the ability to actually change direction. MS doesn't and has committed to becoming Microsoft Business Machines in the same way HP committed to becoming Hewlett Packard Enterprise. Google can still be the best consumer-facing company if they really want to be."],"points":40},{"text":["iOS 17.3 is out, adding Stolen Device Protection for your iPhone","Weird thread, 2 top level comments out of 33 total, both deep in the negatives. I swear reddit is actually a botted ghost town since the protests.","For those not in the loop. It was possible for a long time to entirely takeover someone’s Apple / iCloud with just their iPhone and iPhone passcode. It was a serious security problem that thieves had cottoned on to, and amazing it took this long to even partially resolve","It protects my stolen iPhone? Great!","Phone got wet and my Face ID no longer works. Wish iPhones had a fingerprint reader on the lock button.","The ultimate phone protection mode is having it switched off until you need to look at it (no one answers a phone these days).No one is brute forcing a modern iPhone.Cue 'Ant nobody got time for dat' replies and downvotes!"],"points":423},{"text":["The Absurdity of the Return-to-Office Movement","When my work touted remote work, they came with the data. They said the data spoke to us being just as productive at home. There is no such data presented when being asked to return to office, because no such data exists. It’s “just vibes”","the save corporate realty movement.","I work at a certain OEM and they are embracing work from home. I live 10miles from HQ and fully remote. Come in when I want. It’s ideal and worth the pay cut I took.","I’ve recently saw some list of the most congested and slow cities. Dublin took 2nd place yet many corporations here are still pushing for office return. It’s like they all agreed 2024 will be the Office Return year. Meanwhile public transport is shit, traffic is horrendous. But yeah, let’s clog these streets even more….","The return to office movement is rooted in the fact that millions of square feet of office space will become worthless if people work from home. Employees will use less fuel. They will replace their tires less often. They will buy less fast food to break up the monotony. And most importantly, it will be easier to imagine quitting their shit jobs and working for the competition. It wouldn’t be a whole new routine. It would just be different faces on a laptop.","A whole lot fewer HR issues as well.","My company unfortunately hopped on the RTO bandwagon a couple weeks ago. We all have to be back April 8, despite promises that this would never happen. Their reasoning is super vague: literally just corporate buzzwords with no data to back them up. They were even cheering my department on for the productivity going through the roof when we went WFH. When we question it, we just get told that we have to focus on how we are going to make this work rather than why we are even doing this.Sucks.","No no!!Instead of Teams meetings at home let’s do something totally different!!Teams meetings in the office!!","My work is results-based. If I don't do the work, the work doesn't get done. For three years I have received exceptional performance reviews. I'm not going back. No amount of corporate lying is going to change that. I'm far less productive with people jabbering around me.But even if that wasn't the case, the extra hours with my kids are priceless. In fact, if push comes to shove, I would take a lower paying gig elsewhere if it resulted in forced commute the majority of the week.","For a group of people so incredibly hyperfocused on increasing profits l, literally at the expense of everything else, it is truly vexing to see this same group yearning to spend crazy amounts of money on unnecessary overhead.","Working from home is the future. Employers who understand this will retain/attract the best talent.I (and most of my colleagues) have ZERO interest in working at an office.We all greatly prefer working from home.","If WFH was problematic in any way we’d already be feeling it in a bunch of different areas, but from an outside perspective, besides inflation, I haven’t noticed a difference from pre and post covid.  So it must be working fine.    However, I’m old and greatly prefer working from home, but I could see how it might swing the other way for younger people, or even the just the preferences of some older people.So I think office positions should still exist, and be flexible, but to require some amount of time in the office just doesn’t seem necessary, and we have this great experiment to prove it.","The office had a fire alarm drill today. I left at 2:40 for my train ride home. I'm not sitting around to be let back in 30 mins later. I'm a cloud eng...","Oh I won't be returning to an office 5 days a week lol.","I have too many options that are wfh for me ever to consider return to the office. Would quit my current place of damn near a decade in a heartbeat.","The market will always choose the best and most efficient answer......right?","We lived in homes to support our family garden and some livestock like 150 years ago or less, and yet they act like we can't change, \"this is how we've always done it!\"","Want us back to the office? Then make it worth it. Give me a real cubicle with some privacy and get rid of the open floor plan. Give me a full kitchen so I can make a real lunch instead microwaved garbage or whatever overpriced calorie laden option is available next door. Give me a gym so I can make up on the missed workout time that I now I have to use to commute. Cover my gas and car maintenance fees.","A fucking movement? No, it's the \"Return-to-Office Command\" or \"Return-to-Office or Be Fired\" or \"Commercial Buildings are Losing Value-a-thon\" but certainly not some sort of goddamn movement by people of their own willpower.","Here is my simplistic take. A significant portion of the USA’s economy is based on the service industry. The shift away from traditional offices means a decrease in demand for certain services, such as those associated with office cafeterias, which were once the only nearby food options. Now, people have the freedom to spend their money on better-quality food and other desired items, instead of on commuting expenses like tolls, gas and parking. However, this shift is likely to displace many workers in those service areas. More interestingly, private equity firms and major office space owners, who have taken out substantial loans to invest in commercial real estate, now face the challenge of empty office spaces. This situation has led them to lobby local governments, pushing for policies that would require employers to bring their employees back to physical office spaces.","I work in a factory as a basic assembler. I like the WFH movement because I believe that it has benefits to people’s lives and society. I’ll also get to drive in less traffic.I would hope that if the office spaces collapse that we could work out a solution for the remaining workplaces like mine to make our lives easier. Maybe better public transportation designed specifically for getting us to work out in the suburbs and outlying areas?I have no ideas but if we could ever get proactive on these things that would be awesome 😅. It always seems like we are having to drag companies and the public kicking and screaming to do anything smart nowadays 😩.","WFH has so many benefits for the individual and for society.","My org tried to do enforced 3 days in office and then had to cancel it for a simple reason, they couldn't recruit. Too many options for remote work made it so they couldn't get the best talent who didn't want to move to one of the most expensive regions in america.","One reason for the heavy-handed pressure to return to the office is many Corporations signed legally-binding agreements with cities to create so many thousands of new jobs in return for tax incentives (i.e. zero property tax). This was to attract big companies to relocate and provide new jobs in exchange for tax breaks.If the agreement required physical jobs onsite, remote jobs would likely not fulfill the contract.While it might have made sense prior to the pandemic, these agreements with the county governments are now relics of a bygone era. Hopefully they can renegotiate the terms to allow their top talent to work remotely the same way they did during the pandemic under local WFH employees.","Typical of this view is JP Morgan CEO Jamie Dimon, who claimed in 2021 that working from home “doesn’t work for spontaneous idea generation.”This is a myth. I read on Reddit ten years ago that when they experimented with meeting methods, they found that the ultimate way to get good results from a group of people when it comes to coming up to ideas, was NOT to put them in a room and say \"Brainstorm! Now!\".The ultimate way to get good input was to send out an email to the future participants in the meeting and ask them to come up with 1-3 ideas on Theme X, send the ideas to you at least one day before the meeting, and then the meeting-holder would have great ideas invented at the leisure and with the quiet focus of the person sitting at their own workstation or at home.The problem is that in a group environment the loudmouths set the pace and the focus with their initial ideas, and the smarter people who would've offered better suggestions to the boss either don't have the mental creativity when being pushed to perform live (\"Anyone? Any ideas? I'm waiting\"), OR the better idea-people feel stymied to express themselves or feel that their ideas wouldn't gel well with the half-assed ideas laid forward by the loudmouths.Letting people think alone beforehand makes the future meeting much better because there will be so much more discussion material ready.","They’ve been rewriting this same article for 2 years now.","The managerial class cannot be trusted with our wellbeing. They actively, incessantly work against our best interests and question where our loyalty has gone. Treat people in a way that deserves loyalty and you will get it.","https://www.scientificamerican.com/article/working-remotely-can-more-than-halve-an-office-employees-carbon-footprint/Not even a whisper in the article about the most pressing reason for WFH.","| Further, working from home saves Americans an average daily commute of 72 minutes a day, to say nothing about the reduced pollution and energy consumption that comes from fewer commuters, according to a 2023 University of Chicago study.|this right here basically tells you how the big corporations and CEOs don't care about Climate Change and to call it a movement is stupid unless you add bowel in front of it because these CEOs are just taking a dump all over everyone.","Everyone hates commuting. The farther your employees have to live from the office, the more they will demand to work from home.","Surely it has nothing to do with corporate America’s strong, vested interest in real Americans being as miserable as fucking possible…/s","This is corporate dysfunction at it's finest. Business have too much invested in real estate to absorb the losses (talking assets like furniture, industrial printers, pre-paid non-refundable contracts on things like rent, insurance, and tax incentives). Middle managers who already have no idea how to manage or useful training in how to manage suddenly being thrust into a new environment they don't know how to navigate (let's face it, those managers all predate social media, and sometimes even the internet), and are panicking because they don't know how to set up or track \"productivity metrics\". Executives can't sell \"the lifestyle\" to investors if they can't show off a shiny high tech office full of ride-or-die employees, so they have to actually have a finished product or service to milk their cash (the horror).","If only there was some way to gauge performance other than a middle micro manager staring over your shoulder all day..../s","At my company's previous office, it was a 500 person office. We went through some downsizing and moved to a smaller space right before COVID hit.Almost 4 years later, the old office is still vacant. One of my co-workers is neighbors with the guy who owns the building and some companies have come in wanting to only rent a few stories in the building instead of all 8 but he's said no every time. He's a boomer who apparently thinks that there's still a need for such offices and he's been losing money for the last 4 years because of it.","Just in time for whenever the avian flu \"finally\" becomes human transmittable! Which seems like the possibility could be getting closer given news like the following...17,000 (95%) southern elephant seal pups were found dead on Argentina's Valdés Peninsula in a horrific mass die off attributed to the deadly H5N1 avian influenza virus.... The researchers are now considering that transmissions are occurring between mammals. Scientists had previously assumed that mammals were being infected from contact with birds through fecal matter or their dead carcasses. But Campagna pointed out that pups mainly nurse from their mothers, and therefore would not be consuming infected birds.https://www.livescience.com/animals/seals/bird-flu-wipes-out-over-95-of-southern-elephant-seal-pups-in-catastrophic-mass-death","Everyone who is able to work from home should be working from home. There’s only benefits to doing so.","I have to be here so you do too…that’s the gist I get.","I have been working from home since 2005. I did maybe 5 years in an office during my career because the office was close enough (5-10 mins tops).There's so much distractions across all levels lol. I suppose folks just like to create \"busy\" work to look busy but what's the point?However, I also got sick more often due to folks coming into work when they are sick. Switched back to working from home for the past 4 years and haven't looked back.I know not everyone can work from home depending on the role but there's absolutely no need to be an office when everyone in your team is in a different state.What's the point of going into an office just to get on zoom calls when one can do that from home and get more done without the distractions? These boneheads can go back in the office and stare at the wall themselves.","Show up in the office to get on Teams with the half of the team in India! Right, this makes sense.","Meta and its employees aren't exactly crushing it from the office...","When somebody says \"in-office is better because it can lead to the chance encounter that leads to a great idea\" the appropriate response is \"then why don't you cancel most of the pointless recurring meetings and tell people to just go mingle during that time instead\".","Wonder if MBS and needing the offices filled have anything to do with each other","One person's absurdity is apparently another person's dangerous insanity.","Boomers love bodies in chairs 🪑","The ONLY reason they want return to office is to protect and justify all of their expensive commercial real estate and office buildings. If no one is in the office, then why keep the building? If no one else is in the office for any other companies, who's gonna buy this big expensive building we no longer need. All of a sudden building values collapse.",""],"points":12354},{"text":["Even executives who mandate a return to office admit that it doesn’t improve productivity: tech firm — Atlassian reports on first 1,000 days of its work-from-anywhere workforce","Theoretically, in free-market capitalism such unproductive decision making is supposed to cost a company it's business. Unfortunately corporate-welfare capitalism doesn't work like that.","RTO isn't about productivity, it's about power.","Jane Thier for Fortune:• Atlassian officially rolled out its work-from-anywhere program just shy of three years ago, publishing a retrospective report this week titled “Lessons Learned: 1,000 Days of Distributed at Atlassian,” which outlined the firm’s conclusions and contextualized them against the larger public sentiment.• For the report, Atlassian’s data team surveyed 5,000 internal employees about their feelings on the distributed plan and then worked outward, surveying 100 Fortune 1000 CEOs and 100 Fortune 500 CEOs. (While 200 is a small sample size, there are very few executive roles in those companies, making Atlassian’s representation fairly close to capturing that specific pool.)• Atlassian employees are big proponents of the distributed plan. Nearly all (92%) of the 5,000 respondents said the policy (zero mandated in-office days) is integral to their ability to carry out their best work, and 91% say it’s a banner reason that they’re staying at the firm. • Nearly all (99%) of the chief executives Atlassian surveyed said they believe that distributed work is the way of the future, and it’s only going to grow in popularity from here.• Per Atlassian’s research, 1 in 3 Fortune 500 and 1000 bosses whose companies mandate some amount of in-person work say that the rule hasn’t impacted productivity at all. Those same executives were three times as likely to say that how their people work is more important than where they work.• Even part-time in-office arrangements are a policy failure, Atlassian’s Annie Dean explained, which might be a blow to bosses who think they’re offering a compromise in the form of a hybrid plan. “Hybrid is an illusion of choice,” she said.• As the 1,000 Days retrospective makes clear, the office itself won’t actually solve any productivity, innovation, or creativity issues leaders are facing. “Those are all how to work problems, not where to work problems,” Dean told Fortune back in July—a sentiment the report echoes.","Creating a good company culture will lead to motivated employees, irrespective of where they choose to work.","How are you supposed to feel like a king if you can't see all of your subjects at once?","Are companies just that fat in this world where they just don't give a fuck about what impact their decision has.Always a slap on the wrist.","Return to the office only benefits corporate realestate investments.","If anything the remote work during the pandemic proved that companies can be extremely profitable with WFH. Just that you have higher interest rates now and multiple wars but let’s blame falling profits on so called productivity losses from remote work.","There definitely are advantages to working together in an office: when people don't respond to emails, ignore instant messages and push away phone calls, you can go to their desk.","Don’t forget about commercial leases…ours mandated an occupancy rate, meaning we needed to have so many people in the office","I do less when I'm in the office where I'm surrounded by people and <gasp> an opportunity for social interaction. When I'm at home I just throw on my headphones and mostly just zone out on work for 8 hours.","If I fuck off at home I am going to fuck off in the office. I just hide it better.","Yeah it actually decreases our productivity for life...who wants to do chores after going home after work ugh. Really got way more done at work and life when I was WFH...","I’m shocked they don’t see the trade of lease expense to hiring more employees. Or even paying employees more so they stay longer or forever which limits business disruption.","I only go in now to network and socialize, so I agree. And so do all my peers It's to go in and network Whether it be with partners customers or internal.","They just want people to endure a baseline level of stress and misery.","Gee whiz if people only joined unions instead of listen to corporate and conservative bullshit. But they don’t. Eat your ever diminishing piece of cake slaves.","I don't support RTO but don't just believe this report. Altassian have vested interest as the company that produces distributed work tools. They are also being pushed into fully distributed work by being a Australian company that want to operate globally","Corporations have deals with cities that keeps money circulating in those cities; now that people are not returning to office cities are looking to raise taxes on them. And property taxes are a bitch for the next few months."],"points":555},{"text":["NASA restores contact with Mars helicopter Ingenuity after communications dropout on latest flight","The Little Ingenuity That Could","Helicopter literally too angry to die","Probably just turned it off and on again"],"points":42},{"text":["DOE Announces Nearly $10M in Vouchers to Support 111 Organizations to Accelerate Clean Energy Technology Adoption"],"points":0},{"text":["World’s largest nuclear reactor aims to power the Earth with unlimited energy: ‘Arguably the most complex machine ever designed’","This is just the fusion reactor, again. According to the article budget started at $5.5 billion, is now at $22 billion. And functional operation is now expected in 2035. It’s always 10+ years away. I hope it gets figured out eventually, but there’s no point in these articles when it’s just saying the same thing as they have for decades.","Terrible article. This is a fusion reactor and it's not designed to ever be in continuous operation. It's an experimental design to prove the process so that eventually ANOTHER reactor could be built.","Just clickbait, it is ITER, nothing new, and definitely not going to power the Earth","Tony Stark built this in a cave with a box of scraps!!!","Clickbait. Downvoted.Experimental fusion reactor. By far the largest in terms of cost per kwh generated to the grid. Oh damn, divide by zero is undefined.","I look forward to it coming online in 2040 and then 2050 and then 2060 and then...","What a dogshit tittle. ITER is not even meant to generate power for the electrical grid....","Complex machine complex problems","We already have one of those. We store it 68 million miles away for safety.","So when do I stop paying my energy bill?","Unlimited fusion energy isn’t going to be free. It’s going to be an infinite source of profit for the company that controls it.","I attended the ITER townhall at the American Physical Society meeting a few months ago and it sounded like a logistic nightmare. It has a couple dozen major countries participating and some of them arent talking to each other at this time. Parts were built in different countries and some didnt quite fit each other and are undergoing remachining. There was some concern the radioactivity of some of the structural parts due to intense neutron bombardment was underestimated, so they are exploring new materials. I think they were going to propose a new, slower schedule this year.There are several fusion startups. They are more tightly run than ITER and may achieve commercial fusion first. The one here about most is the one spun out of MIT. It took years to perfect high temperature superconducting magnets, so it sounds like than part is working. Commonwealth Fusion isnt building a commercial size reactor first, but something big enough to test the principles.","If you believe this is actually real then I have a bridge to sell you.","They are activating the pyramids","It's a steam engine.","I was building fusion power plants on sim city in the early 2000’s…what’s the hold up?","But can it blow up the earth with the same energy?","Title reads like a 90's VHS Blockbuster action video description","Oh yeah, this can't miss.","Aaaaaand…. That’s the last we’ll hear about it.","April 1st came early this year.","Clickbait plain and simple.We are still in the early testing phases of fusion.A commercial power producing reactor is a long ways off.","So they’re trying to make a second sun?This will surely work out just fine.","There will be a development spike due to ai in the 5 years. It has already started in several fields such as solid state battery research.","Somehow we will still have stage 4 load shedding","Which will never work because energy companies dont like losing profits","Is it the sun? Cause that's like pretty big and it's a nuclear reactor.I'd rather see money spend on LFTR. It would be so much easier to perfect than fusion. It would give us power for hundreds of years. Then we can fart around with fusion.","Lol Takomak reactors are SOoo 2010.  The current hotness is all Stellarators, now","Fusion is slamming atoms together…","Definitely nothing bad could ever happen right?…RIGHT?!","I feel like a guy with extra arms is going to attack any second...","Just as I paid for my solar installation","How many nuclear reactors can they build for that money now?","I'm all for green energy and believe nuclear fission is going to be a big part of attaining a cleaner energy production until we crack the fusion problem. That said, simpler nuclear plants are probably the way to go. I would rather know my nuclear plant can break in 10 ways versus 1000.Edit: this is why we can't have nice things, a coal fire plant will kill way more people but nuclear bad, read a fucking book.","When I asked ChatGPT, the AI calculated enough deuterium/tritium for 3 weeks worth of energy needs worldwide at an hypothetical 100% efficiency. That sounds far from 'unlimited', but I am guessing the AI is totally off. Does anyone know the right answer?","Arguably the biggest boondoggle ever built. I think the actual returns on fusion power are still orders of magnitude from achieving a 1% return.","Fusion is interesting but wow, does it ever seem like an incredibly complicated way of boiling water to drive a steam engine.","And then we accidentally go Boom! 💥","This sounds like something Tom Cruise hears on TV in his run-down trailer where he went to retire for the simple life at the start of a disaster film where this device explodes and rips open a hole in the fabric of reality, and Cruise has to be brought back into action as he's the only one who knows how to fight the eldritch beings pouring forth from the tear - because his father worked on the precursor project 20 years ago before mysteriously disappearing and Cruise has his notes and the spectrum of radio waves emitting from the hole is the missing piece of the puzzle to make his father's work (that everyone said drove him mad in the pursuit of an answer) make sense.Spoilers: after they manage to contain the threat they find out that the tear in fabric isn't to another dimension, but actually to the earth 10 years from now, setting up a sequel where they have to figure out how to stop that from happening.Oh and there's an ex-wife love interest played by Elizabeth Olsen and he has to save a dog from Cthulhu at one point.","And wont work at all","If it sounds too good to be true then it isn't.","\"We set it all up, but it just keeps saying 42\"","God help the person that has to make it safe for maintenance"],"points":620},{"text":["WHO releases AI ethics and governance guidance for large multi-modal models"],"points":0},{"text":["Solar Storm to Hit Earth Today Causing GPS and Radio Disruption","So it’s already hit right? All good in the hood?","yeah.. More chances of northern/southern lights now","The sun is getting very specific in its attacks.","Not to panic but i think we should start worshipping the sun again.","How often does an event like this occur on Earth?","My initial thought was that the news going around about a solar storm knocking out the internet for “months” turned out to just be a little sun toot that barely disrupted GPS and Radio for like 5 seconds.Would be hilarious and expected if true.","Uhh I literally just started playing a game called New Cycle where modern civilization is wiped out by solar flares.... Why sun, why do you toy with my anxieties...","Can the Sun just stop fucking around and project liquid shit on earth already? Stop with these toots.","The thumbnail looks like a giant fiery arachnid is emerging from the sun, seemingly headed towards Earth. We are doomed","Yeah the cme is actually in progress right now, it’s weaker than I expected though. But this morning we got another one yeeted our way that we can expect to see in a few days. Also as with 99.9% of solar storms, you literally won’t know it happened unless you saw the pretty lights in the sky. For the average person to notice any adverse effects aside from maybe your gps being off an extra few feet, we’re going to need an exceptional storm that not only reaches the maximum classification of G5, but makes weaker G5 storms pale in comparison. (the last G5 we got was 20 years ago and didn’t complicate really anything despite being powerful enough for Aurora to be visible in all us states except Hawaii.) these things aside, space weather can be really interesting, and the next few years are going to be a really good time to see some Aurora for the first time. some amazing resources include spaceweatherlive.com and Dr. Tamitha Skov on YouTube.","Our wifi actually went out! I thought it was the router (and it probably was) but now I can legit say \"solar flares!\".","So that explains my blue erection","Pffft what's the sun waves going to do. Do you see all this snow coming down? Fake news!Obligatory/s","time to speedrun mario 64","Is that why my wifi has been awful today? I just bought my router.","damn the sun really just woke up and chose violence today","Does this explain why my iPad has been taking a hot sec to load YouTube videos?","Just another bs excuse for my internet provider to be dogshit","Disruption to GPS? That explains how a plane to Ireland ended up in Paris.","Huh. I had my phone default to SOS mode earlier today. About 3 mins later 5G was back. Makes me wonder…","Is this why my watch kept flipping out about strong magnetic fields interfering with GPS?","So don’t go back out and work in the garden? I live in the Andes mountains. It sure felt like I was getting cooked running the weedwacker today.","Given the time of impact of this event, I'm blaming it for my computer BSOD today. There must have been too many cosmic bit flips for Windows to properly handle.","A plume of solar plasma. That sounds hot.. I’ll see myself out.","Not sure why these keep popping up as \"news\".In other relevant news, it's probably gonna rain in Florida around 3pm.","The Sun is a deadly laser","Call the police","I felt something in my nacho","My home internet was being kinda spotty around that time today. Any chance it’s related?","Anybody know that story Year of the Jackpot","Scientists are recommending that all necessary precautions be taken.","D ksjd je nskeh,d qllskg wn deian;","So it's war then","How do we see solar storms coming before they hit when they travel at light speed?","I wonder if it hit around 10am PST? KUSC was terrible reception at that time.","My tractor is still driving straight","Oh that must have been what caused an old lady to make a u-turn right in front of me today.","Oh this explains why my internet has been weak today. It was weak on wifi and 5g, guess now I know why.","So that is why it took me 2 more hours to get home last night. The GPS was going crazy and I could not get any news of what was happening on the radio.​Please give us an earlier warning next time so I can plan better.","Thanks for the update, all the more reason to stay at home today.","No fucken wonder my internet was absolute trash all day","My navigation was being weird today. Kept recalculating my route but I assumed there were road closures popping up due to flooding. Maybe this could have been the reason","Next few days hitting like 70 degrees.As a former meteorologist I believe this has absolutely nothing to do with it.","r/2012 moment","has this EVER actually done anything? Arctilces say this all the time and i havent heart of anything once that happened.","is this why my internet connection sucked ass today? it's normally very stable.","If you’re seeing this post, you can be assured we have died. This message was prepared to automatically generate in the event we perished.","My bad y’all"],"points":2098},{"text":["AI can’t replace the majority of jobs right now in cost-effective ways, the MIT found in a study that sought to address fears about AI replacing humans in a swath of industries","I used to own a technical writing business years ago. Despite all the jokes about nobody reads manuals, the work our writers and illustrators turned out was well respected by engineers and customers. Our writers worked very closely with engineering and marketing and understood the products well. Personally, I wrote training classes for engineers and assisted in large upgrade and installation projects.Senior management in some of the large companies we worked for decided it was more cost effective to outsource tech pubs to India. Without going in to a ton of boring details, it did not go well.Six weeks ago, a writer I’d worked with in previous years was laid off because the company said AI could do her work cheaper. The race to the bottom continues.","...researchers modelled the cost attractiveness of automating various tasks in the U.S., concentrating on jobs where computer vision was employed — for instance, teachers and property appraisers. They found only 23 per cent of workers, measured in terms of dollar wages, could be effectively supplanted.So much to unpack here. - They're measuring \"jobs\" in terms of dollar wages. Not in terms of positions. So this could very well mean that more positions are actually lost, but since they are lower -wage jobs, they don't make up a majority of \"dollar wages.\" I.e. if one person makes a million dollars, and 10 people make 40k, you could lay off those 10 people, and still have not laid off the majority of \"dollar wages.\" - Their focus on \"jobs where computer vision is employed\" is a weird sample group. I'm not clear how much we can extrapolate these findings to the overall labor market. - Regardless of the last two points, 23% is still a huge number of jobs. Imagine getting put into a room with all your coworkers, and the CEO comes in and says, \"23% of you are about to be laid off.\" This isn't going to reassure anyone, lol.","Just because it’s not smart to do so doesn’t mean shitbag c suite won’t do it anyways to save a buck and try to make a name for themselves","Right now is the key phrase in that headline. AI and robotics are improving exponentially each year. Not hard to create an incentive to replace workers when AI/robotics work 24/7/365.","Right now is doing a lot of work here.","I imagine most major companies will realize it's smarter to say this and claim it's not going to happen or is not possible until the moment it is. MIT's not exactly wrong, right now it's not really a thing. That being said, I'd guess we'll slowly see smaller/more niche jobs get supplemented or outright replaced by AI every now and again until major advances are made. Also won't be surprised if a bunch of companies pull the trigger too soon and end up with an \"AI\" that doesn't actually work for whatever intentions they had as well, probably happening already.","Not the majority of jobs. Just 49.99% of them. Nothing to be worried about","It’s not right now that we need to worry about, it’s 10-15 years from now that we need to worry about.","I feel like a cow being pet by the rancher in front of the door to the back of a truck while reading this article “it’s ok heffer, alrightie now Bessie, just go in there now” 😭😭😭 and I’m just like “mooo”","Key word is \"cost effective\". It can replace your job, but it costs money. For now. GPU performance grows faster than CPU's so the cost of running/training these models is going to plummet over time.","Wait 5 years","Yes, not now. My grandpa was riding a horse as a kid, and purchased a car in middle age; he saw the first man on the moon and the first nuclear bombing.I was born in a world with no cellphones and no internet; my first computer was a ZX Spectrum, were I learned to code. The only way to send a computer in the cloud was burning it.I am now responsible for IT support in a company with 350 technicians in various capabilities distributed in several countries.Yet, here we are. Lots can change. For good and for bad. I am close to retirement, my aim is to watch those changes from a rocking chair in my porch 😉.","Here’s my take on this.Let’s say you have two companies. Company A and Company B. They’re in competition with each other to make [product] in their factories.Each of their workers can make 1 [product] every day, and each company employs 100 workers. So each company is producing 100 units of [product] per day.Now let’s imagine that Company A invents a technology that lets the worker double their output to 2 units per day.What would happen in this scenario? Would Company A’s CEO fire half of the staff because now they only need 50% of the workers?Of course not, that would be silly. Instead, they’re going to double their output to 200 per day and out-compete Company B once and for all.My point is that AI isn’t going to replace humans until the human’s involvement itself becomes a hindrance rather than an enabler. In other words, the AI has to be better on its own vs AI with a human.To say that we’re nowhere near that is an understatement, even with the acceleration that’s happening. There’s a serious long-tail problem towards AGI that still needs to be traversed.","Technology takes time, especially in the corporate world. Trust me, all CEOs and upper management are taking courses on how to radically shrink their workforce using AI. It just takes time to shift structure and work contracts to expire. Software based tech companies are mostly digital, so they shifted faster as there is little bureaucracy besides assigning new user roles.","In other word “duh” we coulda told you that. But we need these studies to throw at the business side of house trying to justifying laying off people because “muH Ai”","In other news, the people in charge don't know how to implement AI before they fire the people doing the work while they implement AI solutions that replace them.","You don't need to replace jobs in the majority of industry. You only need eliminate few percent to depress the wages of everybody left over as those out of work compete for the still existing jobs. It's economics 101.","The artists being replaced are unable to believe this news","“We find that only 23 per cent of worker compensation ‘exposed’ to AI computer vision would be cost-effective for firms to automate because of the large upfront costs of AI systems.”Oh, only 23% of 167.45 million people, so the real headline should be:** 38.5 million people could have their jobs taken by AI. **","I'm not sure how AI will be better it's already neutered and tells me it can't do half the things I ask.So it's far too pc","Just because they won't be able to doesn't mean the CEO's won't do it anyway and cry later.","The only people who want to replace people with ai are managers.","Seems like we’re inching towards either workers refusing to use AI or workers that are using AI suddenly suffer a string of mysterious coincidental accidents?","I believe AI will be a transformative enhancer more than an outright replacer, in the near term.Honestly, there’s a lot of work that is currently not getting done at all, in spaces that aren’t obvious to anyone not deep into various unglamorous industries, where AI could help effective employees work better at scale.I think this is the ideal target for AI in the near term.For example, I have an employee who is a subject matter expert with 10 years of difficult to learn knowledge. He spends a lot of hours and attention each week aggregating and delivering information vs working on opportunities with customers. It is basically impossible to justify hiring a full time employee and training them to do 10 hours of work each week, but if we can get AI to do that 10 hours of work, he could legitimately double his revenue generating productivity.I do that once, then I can justify hiring another full time person and train them, knowing they can use AI to scale their abilities up, as well. There are more marginal dollars to play with in terms of upside.Eventually, I can work on all the projects that I believe will generate massive returns, but we don’t have the bandwidth of expertise and capital to currently pursue.Rule of thumb in my industry is that if I want to hire someone, there needs to be an upside of 5x their salary in gross profit dollars. AI can make that number much easier to hit.So I’m not looking to cut headcount- I’m looking to increase productivity with my current headcount, so I can hire more people to do all the things I see that need to be done for us to improve as a business.I’m at the forefront of advocates in my company in pushing for AI adoption. Trust me, we all make way more money if we increase productivity, hire more people, and grow the business, than we do if we increase productivity and cut people.","Thanks for sharing this article on AI. It's interesting","We also have to make sure that automation is exclusively focused on desirable work such as art and acting.","And there it is","For what it's worth, this is a lie. There are jobs that require a level of novelty and intuition that AI cannot yet perform on its own, w/o a human in the loop. But not as many as you think. Many jobs can be automated away, using AI. People just break those workflows and then claim silly retorts such as \"it's too expensive.\"","That’s something Ai would cook up to leave everyone’s guard down /s","Only if new player that use people and are cost competitive will most corporations stop the move towards mass automation. It’s not only that is looks cost effective, the thing is that most big corporations that have the resources to do the AI move are monopolies or oligopolies that have no competition. And when you factor not dealing with so many people for years to come it becomes more appealing.","Aren’t they funded by an AI group ?","Only need to keep humans out of job until humans accept doing same job for peanuts, because starving is a disadvantage over always on AI servers.","You don't say","I can produce twice as much with AI as I can without (blog posts, PowerPoint presentations, spec documents, etc.).It can’t produce it at the level a decently smart human can, but it greatly speeds up a smart human. If it can double the productivity of content creators, it will reduce staffing by 50%.Did it take the place of a single human worker? Of course not, but that’s a moot point IMO.","Turning that frown upside down.","We’ll whatayaknow, I’m cheaper than the electricity costs to power the AI to replace me. Now gimme a raise.","Well there is already a big pool of people denied dignity in America at least. Hopefully all these mouse click workers getting thrown onto the pile brings us that much closer to a big collective bargaining moment, imperative."],"points":304},{"text":["10 must-have security tips for digital nomads","I travel a lot for work, and all these recommendations make good sense.","Very helpful, thank you!","[removed]","2 in Oaxaca, Uber doesn't operate, and they don't have subway and taxis are safe.Oaxaca has Uber operated by taxis, and they don't have a subway and also more than 3 floor buildings because it's the biggest active sismique region in MX.This post is dumb or really old, he lost me there in #2."],"points":9},{"text":["BT Group Converts Telecom Infrastructure to EV Chargers | The telecom giant says 60,000 curbside cabinets could be adapted","",""],"points":0},{"text":["Sceptics, look away: a mostly renewable electricity grid is highly feasible","Why can’t people see the massive benefits of “Mostly renewable”?Even if they only work half the time, it’s still much better than what we have now and reduces the use of other fuels, it’ll only get better over time.","Well I read “skeptics\" as septics, and thought that was going to be about using human waste as energy lol","Why are those solar panels pointing in opposite directions?","California just removed most subsidies to install solar and is not forcing builders to add solar to new buildings anymore because we dont have anywhere to put the extra electricity we generate during the day.Shoulda coulda woulda","We the people are not skeptical of its feasibility, we are skeptical of how corporations will ruin this as they do with everything else! Our livelihood shouldn't be at the whims of their profits. This could easily be the best thing for future society but their greed will block and deny it!Imagine if every roof and every open space was collecting sunlight and evenly redistributing it back into the entire world grid. No one would ever struggle for energy and it could someday be entirely free but then how will they line their pockets???","I think you mean ‘Cynics’.A sceptic is someone willing to engage in a conversation and to have their minds changed with new evidence. A sceptical society is absolutely to be encouraged- it means a population using their brains- cynics choose a position and never change.","Puerto Rico runs on 87% fossil fuels. It has common blackouts.It is a sunny island. Solar, wind, tidal energies. But “skeptics” (read investors in fossil fuel) carry the conversation","We need to stop pussyfooting around and embrace nuclear energy. We’d be set for life and we could tell the entire Middle East to shove it up their ass","It's been feasible for awhile, the challenge isn't exactly that people think it's impossible. Part of it is that a lot of people just don't agree with renewables for whatever reason(s). Half of the battle is politics alone, convincing people that it's a better option than others. On the other side you have all the major institutions and companies who would be investing or directly footing the bill for all that and you also have to provide a product that will make them money or at least be cheaper than what they have as is. Not to mention meeting whatever requirements they have as well.All in all, it's certainly feasible. Whether or not you can convince everyone that is another question, there's a lot of people out there who still profit from fossil fuels and such. They also really don't want to lose their money/business either.","Of course it is, you just need an assload of batteries, be they lithium, thermal, hydro, molten salt or whatever.Also needs the NIMBYs to stop having a fit about having to look at a couple of wind turbines while simultaneously being totally ok with the coal or gas power plant just down the road.Massive underground storage project got knocked back in my area recently because some people complained that it would increase traffic on \"their\" road by however many workers cars and or vans would go up to it daily.","This is so exciting!","It’s not about skepticism. It’s about capturing the money they’d lose to people who would deploy their own solar. Just like electric vehicles are priced at a rate to capture the gas money.","Why use land for solar parks when you can put them on roofs? Let that land become nature and store the panels on roofs of buildings that otherwise aren't used anyway, so we can also increase biodiversity in one go.","Australia’s electricity could be over 95% renewable by 2035, according to the latest release of Australia’s electricity market operator’s Integrated System Plan. But many people are sceptical. They regularly witness days with little wind and sun and deduce that relying primarily on wind and solar generation will lead to disaster. They firmly believe that 24×7 baseload generators are an essential ingredient in our energy mix.​Seeing countless arguments of this variety on social media, I decided that a useful contribution to this debate would be to model a near real-time simulation of a mostly renewable electricity grid. Whenever someone claimed that a day wasn’t particularly windy or sunny, I’d be able to point them to the day in question and they could see how the electricity supply may have looked on that day.","Zero emission is a much more urgent goal.Nuclear is zero emission and can push the need to transition into fully renewable sources decades if not centuries back.Zero emission and renewable leaves pretty much only solar, thermal (volcanic), wind, and hydroelectric which is a much taller ask than if we buffer it with nuclear to get off fossil fuel faster.","the consequences of the anti-nuclear movement have been a disaster for the human race","The phrase, \"with 5 hours of storage\" is doing a lot of the work here. Nowhere has anywhere close to that much energy storage in reality and the cost would be astronomical. Simulations like this don't really say much because it's pretty much a given that you can do anything with infinite money. The real debate here is over cost, not theory.","The vast majority of \"Skeptics\" are Fossil Fuel Industry Shills, and dim witted Republican voters.","Cheap and big batteries are coming to solve storing energy to be used when there's a need. I am talking about battery farms that can power cities. I bet it's already in effect in China.","Every roof should have low efficiency cheap solar shingles and micro wind turbines. They don't have to generate 100% of the homes usage, but 30 to 40% across millions of homes would be massive. Hell even 20%","We cant even get enough transformers made to last the winter and you think this is feasable?","to just cover the increase from now till 2050, just the increase in world energy demand, would require wind turbines covering an area the size of Russia. Just the increase, still leaving 60% of the world using fossil or nuke.","I know it's technically feasible. It's the implementation I'm skeptical about. As soon as renewables start taking a chunk out of fossil fuel profits, owners will dump massive sums of money into funding pro-fossil fuel fascist movements","Is the problem right now that renewable energy can’t be consistently made no matter the weather? Or is the problem that it’s not at all feasible to be able to create enough electricity for the entire grid?Because I feel like the problem of inconsistent creating power can be fixed with battery farms. I remember reading a few years ago one of the military bases in Colorado were building a giant one for not crazy expensive. Batteries are easier to build when you aren’t in as much space constraint like with cars or even homes","I don't trust any person that chooses that nonsense over nuclear.It uses less resources, requires less landmass, produces much less waste and is much healthier for the environment.It also doesn't require as much slavery.","It's getting cheaper to have a mix between renewables and non renewables too. The only ones actively arguing for 100% fossil fuels are oil, coal, and natural gas companies who are trying to propagandize the mushy brained people that watch fox news.","I question whether using hydro as the author suggests is feasible. Dams/rivers have multiple uses, ranging from flood control to water supply to recreation to environmental to transportation...as well as electrical generation. So you also have to meet these other uses--and that is going to restrict when you can generate electricity.","Lol pull the other one","It’s definitely possible, particularly with grid-scale energy storage solutions. Theoretically you can power almost everything with wind, solar, and stored energy from peaks of those. Then you can have oil or gas peaking units for areas with a large amount of volatility in the load. In areas with especially huge base load you might have a nuke plant or two.This is all doable. We do not need to be burning coal and natural gas for base load anymore, we’re running out of excuses.","oil companies sending john wick rn","Lewk— ah whey !","The progress made in the past decade is incredible","There's nothing better than nuclear power yet.","TIL: skeptics and sceptics are the same wordI will however point out an artificial shortage of skepticism and a plentitude of control by big oil and big energy. They use things that rhyme with coal. They lobby, and they push, and they have a lot to push with. We don't even know how much they push, because citizens united. It's just girls gone wild, as much as they want.We all know it's highly feasible, and I appreciate this article showing me why.But please, the very first few words of the headline, the author needs to be told you are preaching to the choir.","Massive solar farm going in near family farm. People are already trying to steal the panels. This proves solar works.","Ya but how am I going to hear my home in winter when it’s -40°c?","Ummm... not without a cheap, reliable energy storage technology it's not."],"points":401},{"text":["Dune, but IRL? The Pentagon warns of ‘warfighting’ in space","If I was to talk about war fighting in space, Dune would not be the Sci-fi series I'd first think about.",".....fucking dune? What? I don't think they know what dune is given the series as a whole for that matter doesn't have any space fights at least that I know of.Why not star trek? Why dune?","Did someone Google sci fi series and pick Dune at random without realizing there’s no space combat? The Expanse is such a much better example of what space combat could be once the tech gets there.","So on the one hand, Dune is an odd reference when we literally have Star Wars for space fighting.But in thinking on it, dune makes sense because of the reason for the space fights:Resources.Star Wars kinda goes into it but it’s usually about fuel or people for soldiers. Dune goes much deeper into the exploitation, extraction, usage, and fighting over their primary fuel for hyperspace.","No spice, no Dune. It's like comparing apples to orangutans.","Just give people affordable housing and healthcare…","Can I healthcare first?","Fucking AI that is not really AI piece of shit article","Since most redditors are here to say how stupid of a reference Dune is…. Can anyone recommend some good books that involve space fighting? I enjoyed The Expanse and I’m looking for more like it.","What a terrible headline.","That’s fucking rad!","yawn. call me when it's warhammer 40k","AIs leading a battle in space (from Voyager).","Space Force! Team America Part II - Don’t Worry Planet, Everything is Under Control.","Oh heck yeah! Battle Pugs in space I can't wait for it.Spice is life!","Specifically, they aimed to frame US Space Force efforts as a “deterrent” to armed conflict beyond Earth’s atmosphere, citing threats from both Russia and China, but let’s be honest... we all know what that means.Yeah, of course we know. They want to be the only ones with space warfare capabilities.","To do that would be a massive disaster. Much of our technology relies on satellites. We also don’t have the ability to fly easily to extra-orbital space. Thus, if there were to be wars in space the resulting debris would eventually harm all of the Low Earth Orbit satellites. That would effectively end GPS and loads of other telecommunications that rely on satellites to route communications. Spying would get harder but then so would lots of way finding and other communications. You could kiss starlink goodbye as well as the ISS. All peaceful use of space including future travel off planet for nearly any reason for likely centuries would be impossible.","Space war will consist of destroying each other's satellites in Earth orbit with missiles. We do not have the technology or budgets for anything else.","Presumably this is why we formed a Space Force.","Everyone raging over the Dune reference doesn't realize it was made intentionally to get your clicks. And it worked.","I would have gone with literally any other series. Like 40k.","Dune? Really? That's not on the top 500 of any sci-fi space combat reference."],"points":244},{"text":["Cops Used DNA to Predict a Suspect’s Face—and Tried to Run Facial Recognition on It | Leaked records reveal what appears to be the first known instance of a police department attempting to use facial recognition on a face generated from crime-scene DNA. It likely won’t be the last","Everything is cool until a false positive incriminates you with no possible defence in court.","DNA does NOT contain information about the 3D structure of the organism it is coded to create, at least not in any way that is currently decipherable by modern techniques. This is unreproducible, garbage \"science\" that is basically astrology and has no place in our justice system. I'm glad the article addresses this.","Some highlights from this investigative piece:Parabon NanoLabs ran the suspect’s DNA through its proprietary machine learning model. Soon, it provided the police department with something the detectives had never seen before: the face of a potential suspect, generated using only crime scene evidence.The image Parabon NanoLabs produced, called a Snapshot Phenotype Report, wasn’t a photograph. It was a 3D rendering that bridges the uncanny valley between reality and science fiction; a representation of how the company’s algorithm predicted a person could look given genetic attributes found in the DNA sample.The face of the murderer, the company predicted, was male. He had fair skin, brown eyes and hair, no freckles, and bushy eyebrows. A forensic artist employed by the company photoshopped a nondescript, close-cropped haircut onto the man and gave him a mustache—an artistic addition informed by a witness description and not the DNA sample.In a controversial 2017 decision, the department published the predicted face in an attempt to solicit tips from the public. Then, in 2020, one of the detectives did something civil liberties experts say is even more problematic—and a violation of Parabon NanoLabs’ terms of service: He asked to have the rendering run through facial recognition software.“Using DNA found at the crime scene, Parabon Labs reconstructed a possible suspect’s facial features,” the detective explained in a request for “analytical support” sent to the Northern California Regional Intelligence Center, a so-called fusion center that facilitates collaboration among federal, state, and local police departments. “I have a photo of the possible suspect and would like to use facial recognition technology to identify a suspect/lead.”The detective’s request to run a DNA-generated estimation of a suspect’s face through facial recognition tech has not previously been reported. Found in a trove of hacked police records published by the transparency collective Distributed Denial of Secrets, it appears to be the first known instance of a police department attempting to use facial recognition on a face algorithmically generated from crime-scene DNA....“It’s really just junk science to consider something like this,” Jennifer Lynch, general counsel at civil liberties nonprofit the Electronic Frontier Foundation, tells WIRED. Running facial recognition with unreliable inputs, like an algorithmically generated face, is more likely to misidentify a suspect than provide law enforcement with a useful lead, she argues. “There’s no real evidence that Parabon can accurately produce a face in the first place,” Lynch says. “It’s very dangerous, because it puts people at risk of being a suspect for a crime they didn’t commit.”...Greytak characterizes the company’s face predictions as something more like a description of a suspect than an exact replica of their face. “What we are predicting is more like—given this person’s sex and ancestry, will they have wider-set eyes than average,” she says. “There’s no way you can get individual identifications from that.”...According to an internal New York Police Department presentation cited by Garvie in her report, NYPD detective Tom Markiewicz wrote in 2018 that the department has tried running face recognition on forensic sketches and found that “sketches do not work.” In another infamous example that Garvie cites in her report, a detective from the NYPD’s Facial Identification Section, after noting that a suspect looked like the actor Woody Harrelson, put a photo of the actor through the department’s facial recognition tool.“Because modern facial recognition algorithms are trained neural networks, we just don’t know exactly what criteria the systems use to identify a face,” Garvie, who now works at the National Association of Criminal Defense Lawyers, tells WIRED. “Daisy chaining unreliable or imprecise black-box tools together is simply going to produce unreliable results,” she says.“We should know this by now.\"This whole process sounds a lot like the classic GIGO (Garbage In, Garbage Out) scenario. Unfortunately, with a shiny veneer of technology applied over top, it's easy enough to convince people that the outputs are legitimate, which is an everpresent danger with these kinds of practices.","We have entered the Minority Report timeline where cops bust people using unripe technology just because they share DNAs with other people. Every guest now becomes a suspect. It is impossible to hide.","But they wont recover stolen property when you can tell them who did it, where they are, and that they have the property on them, which you can prove is stolen.","An article just came out that bite mark analysis is a lot of hocus pocus, but is still admissible in court.https://www.nbcnews.com/news/amp/rcna133870They’re now using the 911 calls to erroneously pin blame onto the ones calling for help. Some junk science that says if you say “please” or “sorry” while on the phone it means you’re the murderer, and not just someone who found a dead body.https://www.propublica.org/article/911-call-analysis-fbi-police-courtsBoth of these things will lead you to prison if the police need to close a case. I have no doubt that DNA generated facial recognition will be used if there’s money to be made.","Just think of the tax payer money pissed away on this, not to mention investigative time and resources (which are perpetually in short supply).","Ethics and legality haven’t caught up with the technology.","This doesn’t make sense. You can’t possibly use DNA to determine facial features. People get plastic surgery, have injuries, get acne or scars. Hair colour can be dyed, eyebrows plucked, piercings, tattoos.Illness can affect your appearance. People gain or lose fat and muscle. Get tan, become pale.There is no possible way to predict what someone looks like currently based solely on DNA. This is grotesquely negligent.","Y’all better stop doing those 23 and me and other tests where you voluntary submit your DNA. They are selling that information to whoever wants to pay for it. God forbid it get mixed up in a crime scene that results in imprisonment for a crime you didn’t commit.There have been too many instances where innocent people have been convicted because local authorities felt pressure to convict somebody (anybody) of a crime for favorable positioning in the public eye. This is a disaster waiting to happen.","So this is where the Minority Report starts","What scares me about the proliferation of AI models like this is not how powerful the can be but the dangers associated with people using tools like these but lack the skills or are just to complacent to validate the results.Im read more and more about using models like these that seem to work really well when tested in a controlled way but start to give bad results when given real world tasks.","Police \"We wont attend robberies\"Also Police \"We'll use cutting edge untested and dangerous technology to try and find people who maybe committed crimes\"","Wow. That's just hot garbage. That's just using AI as an excuse to create random suspect pictures.We are still nowhere near being able to predict most characteristics from DNA, let alone facial features. Most forensic DNA sequencing technologies only sequence a tiny part of the genome, enough to be mostly certain DNA is a match with a person with an error of approx 1 in a million (depending on exact process). So in a country like the USA there would probably be a couple of hundred people that match. And the genes that determine facial structure are much more complicated than that. To actually get an idea of how a face could look would require a much more detailed sequencing, and knowledge of how that relates to facial features, this literally does not exist yet. And this is before we consider how environmental and developmental factors can affect facial structure.With that in mind, I don't think this is good enough to even give probable cause for arrest. Certainly not good enough for a warrant (though some judges will grant anything admittedly). It's a random number generator in facial form.","Couple this with the massive racial disparities in the accuracy of facial recognition software and they can now fabricate even more “evidence” to imprison (i.e. enslave) even more innocent POC.","but somehow we cant get cops to stop murdering people.","Gonna end up like that movie Brazil","this is so unreliable technology now but they will continue to develop and improve this kind of technology im sure","So someone leaves dna at a crime scene in Washington state… they have a face similar to mine, I’ve never been west of Colorado but because of my fb I am now the prime suspect… yeah.. that’s gonna work out","They had to come up with a new excuse to illegally search people, since \"pot smell\" is no longer allowed?","WhAt cOuLd pOsSiBly go WrOng?","Just another entry in the long history of police using pseudoscience to put innocent people behind bars.","I don't knee-jerk trust the cops or government, but the outrage and paranoia in these comments is ridiculous. People aren't arrested or convicted just because they match a police sketch, it's just a tool law enforcement uses to narrow down suspects, so why would this be any different? \"But It wOulD bE UseD aGainSt MiNoriTies!!!!!\" No more than police sketches already do. It's just another tool in the box.","Well if its a sex crime there is almost definitely a moustache involved","Elliot?","Wow so lazy detective work at its finest","Let the rounding up begin! Holy shit.","So?","Am I wrong in the head? I think methods like this will be so good to not let murderers/rapists/criminals get away with their crimes. As long as the facial recognition technology is used as a suggestion than a golden standard, it can show the police the direction of a criminal.False accusations could cause problems but I fail to see how it be a big problem in this case. Well, if the cops are stupid, they will find a way, but they already find a way right now. But in this case, it is easy to refute such allegations with a dna test? They already have dna, they might have suspects but when a dna test will solve all your problems, why should we not use this powerful tool to find criminals?","Fully support this.If you're killing and robbing and raping and so on, let them use every means necessary to hunt you down.I have zero sympathy for your privacy rights. Rights only exist if we mutually respect them. Once you commit a crime, you validated there is no longer mutual respect.","lol bro what? You can’t build a face from dna","So when a Trans commits a crime and leaves DNA, will the face match then?","Some of yall get things done 😂 that nose job may just save you some jail time 😂","“ so we’re looking for a black guy?)","Minority report here we come.","DNA to facial mockup sound incredibly dubious.","So Minority Report is real?","Crime Junky be talking about this a year ago","Time to rewatch psychopass","Good thing this was invented by Angela on Bones…","An ouroboros of garbage in, garbage out. In fact, more reminiscent of the decision making equivalent of a human centipede if its diet already consisted solely of excretia.This thing will 100% be used to apportion false blame.","Might as well ask AI to give you a photo of the perp","Next time it's easier to blame a random member of the public, why the extra steps?","But, oh that's sooo inaccurate wtf.","Wait wasnt that the plot of minority report?","Don’t tell us: They executed an innocent man.","Defense attorneys are going to have a lot of fun with this. No way this would hold up under cross examination.Of course, that's cold comfort to someone who's been falsely accused in the meantime. But at best, this could only be used to try and find a suspect, so you could then try and get a warrant for a DNA swab.But even then, I'm not sure if something this unproven would be recognized as PC for a warrant.","Abusers who don’t know they’re abusers are usually just trying to control undesired outcomes from happening.","The problem with this is DNA is just a blueprint for what you might look like. Gene expression which can be determined after birth will also impact your final look. How you ate growing up, and illness messing with gut biome, and more will influence the outcome and have no reflection in your dna.I mean they’re literally just saying oh “some white gut with medium length hair”. Which is like 40% of tbe population. You don’t know if he’s fat or skinny, balding with an orange tan or whatever.","I took a 23 and me. Let me just say dna tests are not up to making accurate predictions. My eyes are a blue/hazel mix not brown. My skin is light olive not fair. I do not have any freckles.","Are they trying to catch Mr. Robot?","On a tangential note, why do regional parks (not to mention school districts) have their own police force and detectives?","They literally do this in Bones. Unfortunately, most procedurals don’t seem to capture all the false arrests","now this is junk science","The minority report is such an underrated movie","It's Roberto Alomar circa 1993","Seems about as good as a police sketch artist interviewing an eye witness.",""],"points":1118},{"text":["A ‘Shocking’ Amount of the Web Is Already AI-Translated Trash, Scientists Determine","Oh how I know! The AI drivel on most websites is unreal! It’s sad, especially if you’re wanting to do real research. It’s getting harder and harder to find something viable to read, and the AI written content is so obviously baloney.","Anyone who has tried to use google to troubleshoot a technical issue or read product reviews could have told you this.I’m back at square one of never trusting what I read on the internet… I also can’t overstate the thrill I feel when I stumble upon an old HTML website, or actual forums.I miss the old internet.","lol literally just this morning I walk into work and my coworker is raving about these novelty slow-cookers designed to look exactly like a mini pick-up truck. The pictures look totally legit. But he couldn’t find a price anywhere, and I said it’s probably AI generated bs. Then he finds a “video” showing off the product, and the video is so obviously AI generated he finally realized it’s a fake product. The internet is fully enshittified","A shocking amount of the web was trash before AI","And future AI are trained on this trash too !","Any plugins for my browsers to hide known-to-be-generated articles? The sooner this ish gets ‘buried’ the more relevant searches will float to the top. 2024 finally the year of signed keys on /everything/ to prove your humanness?","The frustrating thing is, google had a solution to this and killed it over a decade ago. Google Reader gave them a curated list of resources, labelled and aggregated, with an absolutely gold standard popularity score. It would have been an absolute gold mine, especially now. Killing Reader was the worst thing to ever happen to the internet, and it pretty much killed the open web.","What was a convenience of an abundance of information has turned into a chore. It used to be data in, data out, now it's either a lengthy search through pages of a search engine or an exercise in futility.Has there been a corresponding increase in library use/visitation?","The title of this article appears to be intentionally misleading. The researchers are talking about \"low resource languages\" which are basically uncommon minority languages on the internet. They are also talking in terms of translation quality, and not whether effective communication is being carried out with these poor quality translations.","And the rest is porn","Formulaic online recipe sites with 5 pages of fluff to justify ads and untested recipes are already terrible, can AI make them worse?","Ai is going to make the web just a very function orientated space. Buy something, fill out a form etc… everything else is going to become meaningless except if some high calibre news/information outlets keep it up. I mean social media is fucked except where you interact with known, validated, family and friends. It’s difficult to see how something like reddit will be maintained.. it’s a lot of bots now anyway","I'll be honest:Between SEO absolutely destroying search engines and AI-written crap text, I am for the first time since the early 90s using less internet now. It's just not enjoyable and it's becoming less and less useful as a reference.","The only thing AI innovated is spam","Kinda reminds me of Recursive Translation if the output is used for training as wellNow that I think about it what if the Universal Translators in Star Trek be upgraded to the point where instead of merely translating something the output is just whatever that will get what you want (which would have implications for the AI box experiment)","This is what is driving the trend to having local sites with locally generated news, sales, forums, social media, etc.The local \"news at ten\" will not be taken over by AI, because people generally dont want it taken over by AI.","It’s been like that for a while. If you are excited about a game or a movie coming out and there hasn’t been any real news about it for a while, all the recent articles you find are just paragraphs of ai generated content with zero information.","Dead internet theory revived","Here’s some news… the internet has been trash for ten years or more now.","I’ve seen it a bunch on YouTube videos. Was watching a body cam video and it put the n-word in the text. They said something else completely.","Yeah, we know.","most of the comments here for examplelooks out across an empty lonely spacehello?","I have found (or at least suspected) that many “how to” guides and even advice or explainer articles on various sites are actually AI generated. Possibly posted by authors who were paid for their “writing” but used chatgpt….","Don’t worry. AI is merely an accelerant. Humans are determined to change the planet so it can’t support human life. Just enjoy what you have left.","A ‘Shocking’ Amount of the Web Is Already AI-Translated Trash, Scientists DetermineLet's be fair here, there's a large amount of human created trash on the web too.","This is legit the fifth time I’ve seen this posted either here or elsewhere on Reddit. A shocking amount of AI is already pushing this article","We need a grading system for webpages related to news. Leaving it up to the user to suss out what’s going on doesn’t cut it anymore. We are well past the traditional line of the Turing test and AI has saturated every corner of the market.","Trash goes in, trash goes out, trash goes in, trash goes out","Yeah, no shit.","Garbage in - garbage out.","Let's take a stroll down my YouTube main page. I like science and science related news. Chances are within the first 10 on the splash page, 2 are AI generated bot content.It's obvious to me now from the channel name and thumb nail. But soon... who knows.","I had exhausted google, ddg, and bing.... and resorted to finding my medical info on youtube of all places.WTF.","It always was","So basically reddit?","Those scientists are looking at Google indexed webs.","shocking number of you reddit buffoons didn't read the article","If 99% of the web would go poof nothing of value would be lost.","Web 3.oh shit.","I'm guessing we as a race are due another dark age","“In this article, I will show you 3 ways that makes the web already AI-translated trash”. Translated trash and automated trash","Just looking at my reddit frontpage I'm sad how much seems to be AI generated garbage hunting for likes..."],"points":951},{"text":["For a moment there, Lotus Notes appeared to do everything a company needed","I remember when Lotus Notes was the big dog on the street, and Outlook was the challenger. The problem with Notes was that it was a monolith; it tried to be everything to everyone and ended up doing nothing particularly well.","One of the choices in my IT career was to be a Lotus Notes/Domino administrator.That and a Novell Networking engineer.I don't work in IT anymore.","I remember my dad's computer back in the day had an icon on the desktop that was a skull and crossbones labeled \"Kill Lotus.\" I thought it was cool and a little scary, and still remember my disappointment when I asked him about it and he said all it did was force quit Lotus Notes","Managed a Lotus Notes installation with +20.000 users. It was a great solution in its time and the downhill started when IBM put it hands on it and started to milk its customers for shareholders profit instead of product development of Lotus Notes.","We still use Notes at our company. Goddamn is that application a pain in the ass. Yea sure, plenty of integrated workflows, but nothing that more modern apps can't do better. But since tons of data is siloed into it, you're stuck with it. And it still didn't follow/update to any modern trends/tech, either. E.g. paste an image into an email, it'll turn into a fucking GIF of all things.","Bro, where I work, we legit migrated off Lotus Notes in like 2018...That was a hell of a task asking these users to switch from something many had been using for 20 years to outlook. We are definitely better for it now!","It probably was a friday afternoon.","Man I remember being forced to use this in my job back in the late nineties. Everyone hated it but that's the contracted software we had.","We have A LOT of Lotus Notes solutions that we’re struggling to retire.","I loved Lotus Notes/DominoI started my first online shop using it.Hated it as a client for email and such, but it did some stuff really well.","And then IBM spent 20 years not improving it.","We used Notes at my first job back in 2005. It was so bad!","God I hated supporting Lotus Notes. We had IBM admins on the team but they were utterly clueless.","My aunt wrote the code that became Lotus Notes. Mitch acquired her company. She took cash instead of stock, sigh.","Great post. Thanks for sharing.","Notes purported to do a bunch of things, but it was almost nonfunctional.One of my company's primary use cases was sending e-mail with attachments, which was a solved problem in the 90's. Using Notes, emails would routinely take hours to arrive, so we'd do something like carry a writable CD with the file down the hall instead.The excuse at the time was that the data had to go through a server in Texas, but ... Texas is milliseconds away from California on the network. Notes was just supremely bad software, that's all.","Lotus Notes = the original ransomware","I remember windows 3.1 having it. Heady times.","I loved lotus notes, good times.","Migrating Lotus Notes into Office Applications was not an easy task.","I miss my Lotus Organizer. I may even try and get it running on Win10 or 11. Supposedly it can be done","I spent most of my early years in IT repairing NSF databases but still think it was a fantastic product. Then again, this was at IBM so its deployment was spot on.","Worst application I have ever used. Hands down.","We used it for email until 2 years ago. It was fine, but people didn't didn't like the learning curve","Did you know one of the USA’s largest banks still uses lotus notes heavily. They didn’t migrate off lotus to outlook for email until 2018-2019","Just think, ibm bought Lotus and did nothing with it.","2010 “We really want your company to help us get 960 users off Lotus notes to Exchange. It’s a few tenets we are looking to consolidate and is deeply integrated into the company workflow. We have told 1000 hours of labor from other vendors because they think it’s too difficult.”(Maid from Family Guy) “No, No”","My career early on was redesigning green screen apps/forms as Lotus Notes databases/apps. It was a narrow window of time before the web was a thing, so not long after we were converting Notes databases to web forms.","Where I work we are still on IBM Notes... Even though they sold it years ago..."],"points":233},{"text":["We have entered the age of TikTok face","So blonde and blue eyes….Meet the new boss, same as the old boss","More worried about TikTok brain","No different to how Facebook, Instagram, Tinder etc have warped peoples brains about beauty standards. Of course, throughout human history it has existed in some form, social media just amplified that with associated societal consequences. Since the advent of mass media. Every generation gets more hooked, every generation suffers ever so slightly more.","This is a problem that's easily solved. In fact, I didn't even have to do anything!","i'm not going to be goaded into being angry about modern beauty trends.","What the hell means \"bunny pretty\"?","I just don’t understand the red nose. Looks like a cartoon drunk from the 60s.","They all look the same to me","So, ducklips are out?","What I would give if we could Thanos all these apps like tik-tok. The west would improve so much.","Holy cringe","Fuck the PRC.","I'm a guy... so should I ask them what I am? A dog, bull, wolf or a horse handsome?Didn't take long to see how dumb this is.","so?","The Sophie Rain pout","Just please don't start talking and spoil the illusion that I've constructed. /s","They all look like Love's Baby Soft to me. Whats the deal?","The red nose is hideous. Looks like rocesea.","On another note, the article of using your menstrual blood for spells, makes me even more questionable about our future."],"points":459},{"text":["Google admits Chrome Incognito mode tracks users — what you need to know","That is for my wife to not track me, Google can wank along if they want!","It pretty much says that when you open the incognito browser.","You're telling me people actually thought this mode worked like a complete anonymizer? I always assumed and only used it for not saving browser history and browsing websites unpersonalized without logging out my account.Screw Google though so I don't mind that the tech illiterate people made a lawsuit.","Article is tryin to frame this as news. Open chrome and open an incognito tab. You'll see the text from the thumbnail of which reads.\"Incognito only hides your browsing history from other users of this computer. Your network administrator and ISP will sill be able to see all your traffic.The incognito landing page. Since the feature was released fully informed users that their data was still able to be recorded.","Wasn't that always the case? I thought the point of it was so you could browse without peristant history and cookies.","I know that hating on google is popular, but basically the article boils down to this argument:​it doesn’t actually prevent websites or your internet service provider (ISP) from tracking you and knowing what you’re up to online.​Which ... is obvious? Does anyone expect something else from their browsers incognito mode?People are already jumping on \"use another browser then\" wagon, but honestly, which browser does not have this \"issue\" in its incognito (or whatever they call it) mode?","When you first open a new Incognito window, you’re creating a new Incognito browsing session. Any Incognito windows you open after that are part of the same session. You can end that Incognito session by closing all open Incognito windows.In Incognito, none of your browsing history, cookies and site data, or information entered in forms are saved on your device. This means your activity doesn’t show up in your Chrome browser history, so people who also use your device won’t see your activity. Websites see you as a new user and won’t know who you are, as long as you don’t sign in.If you’re browsing in Chrome Incognito mode, you are, by default, not signed into any accounts or sites.Your school, Internet Service Provider, or any parental tracking software may be able to see your activity. You can check if your Chrome browser is managed.","what you need to knowDon't use Google stuff.","I knew people on average didn't understand technology, but I hadn't realized just how deep the ignorance went.","this is really stupid. and the title is misleading. Incognito mode isn't doing any tracking. its just not magicly preventing anyone with a man in the middle position from monitoring your traffic, which anyone can do with any traffic that isnt encrypted","Are we shocked? We shouldn’t be shocked.","I guess Google knows all of my porn kinks. They knew everything else about me already.","This is true of practically every browser, how is this newsworthy?","I thought it was obvious. I mean, the dude is staring at me with binoculars and a detective hat on.","We all know incognito mode is “porn mode” 😂","\"With so many aspects of our lives now taking place, it’s no wonder [...]\"Ah yes, aspects of my life are definitely taking place.Quality journalism, this article.","Class action lawsuit. Seriously... what the fuck.","I never assumed it didI just use it when watching porn to prevent the situation of typing in a website with someone watching and it autopopulating baddiehub. Or streaming sports.","With so many aspects of our lives now taking place, it’s no wonder that Google Chrome’s incognito mode is so popularWas this article written by AI?","If you didn’t know this already, you’ve just had a lesson in how un private your life really is! 🤣","How is this still news","Lmao that’s fine, watch porn with me","Chrome is so shit. People really need to delete it","I don't care what they track, they can suck my dick.","I don’t understand why anyone would assume it doesn’t track you.","obviously, otherwise they may have made all incognito","What you need to know1: install FirefoxThe end","I don't understand how FireFox hasn't jumped on this or the news of Chrome will remove ad blocker extensions.","Delete Chrome","The very first step anyone concerned about privacy should take is DUMPING ANYTHING GOOGLE. Firefox, Brave both good alternatives. Start there and then slowly keep working on privacy.","Further evidence that Google cannot be trusted.Their mantra used to be, \"Don't be evil.\"Clearly, they have not believed that for quite some time.","[deleted]","I kinda figured that out when my pornhub username was getting auto completed.","::Laughs in Firefox::","“What you need to know”Firefox","You need to know the URL for the Firefox download.","Just keep deleting your browse history.","All you need to know is that Firefox exists","What you need to know is to use Firefox and abandon spyware.","Know this: Chrome is 25/7 privacy invasion","Chrome sux anyway, havent used for years","In opera we trust","This is why I have multiple browsers with varying levels of privacy controls.","I learned this long ago when I started getting targeted ads from things I only used incognito for. I figured they could see them, but didn't think they acted on them like they did.","To anyone wondering how you do browse the internet privately, you need to use a VPN service. But ultimately, if the FBI come knocking, that want protect you either.","didnt they just lost like 5bln lawsuit about this","That’s spose to be between me and my cookies","Before I was smarter Google already managed to learn that I like porn of women that look like my wife, but with more kinks… shrug","Honestly I don’t really care so long as those searches don’t affect my general algorithm. I will occasionally use incognito to look up various people who I think may be a right wing shit head or the like and want to research them a bit without ending up with their content suggested to me anywhere.","Just porn. Lots and lots of porn.","This has been posted several times in this sub. The problem wasn't what the incognito window said, it was that Google marketing sold it as a better product/solution than competitors. And that's enough for the courts to find Google in fault. If you allow customers to be mislead, it doesn't matter what the actual small message said, all your messaging should say the same thing, and Google did not.","shocked face","Somebody at Google with a movie screen sized monitor watching thousands of Americans wanking at once… It’s poetic.","People still believe that their ISP or government can't catch them since they use incognito mode 🤟🥸","Who didn't know that Chrome was effectively spyware?","What you need to know is, don’t use chrome ￼","It was basically their way of trying to find out what you really want to see on the Internet. You think you’re safe, but you’re not.","All you need to know is don't use Google","No shit ?","Opera has a very decent privacy browser, and even comes equipped with a VPN.","Switch to Safari. Has Private mode that does not track you at all","If you thought I feel bad for you","Guess Tom's Hardware is going downhill. Chrome very specifically tells you that websites and your ISP can still track you in incognito mode.","Admits?They’ve announced it for over a decade every time you open an incognito window. It’s always only been the equivalent of clearing cookies, cache, and history upon closing the window.","All people need to know is how to uninstall chrome and install firefox.","This seems more related to ip tracking (or maybe pc fingerprinting) which incognito mode, of course, does not prevent. Which is not Googles fault, perhaps it gave users the false impression they won’t be tracked.Although I remember a clear disclaimer has been visible for a long time.","Oh noesAnyways…","Weak ass google piece of shit chrome.","Wasn't it obvious? Even if google says they do not track users I know they do","Oddly enough I have to use incognito mode to do our payroll online with Paychex.","Why do people continue to believe that customer = friend","Class action lawsuit when?","How is this not considered legal fraud?Notice I'm not trying to pull dicks here with buzz words like right to privacy. But this is blatantly fraud.If I made a soda pop and said it had all the same components as Cococola. And it did not in fact have all the same components, that would be fraud. And the government gets on people's asses for far less than that."],"points":2167},{"text":["Mac at 40: User experience was the innovation that launched a technology revolution","Just going to link to the original article here as it seems that website hasn’t properly followed the rules relating to using content from the Conversation. They should have provided a link which seems to be broken.  Also anyone interested in this might want to check out Doug Englebart and “The Demo” for more historical context.  https://theconversation.com/mac-at-40-user-experience-was-the-innovation-that-launched-a-technology-revolution-220535","Ripping off Xerox PARC was the smartest thing Jobs ever did!Seriously. Would we all have seen those radical new things like a mouse and graphical user interface if he hadn't put them in early MacOS?","Computer Literacy- High School 1992, zero period (before first bell class)."],"points":8},{"text":["WiFi 7 is officially here, but routers are pricey. Do you need it yet?","Saving you a click. You don't need it now. Wait till it gets cheap and buy it later.","LOL 6E is barely affordable and how many of your devices actually have it…","Until my Internet egress reaches those speeds, no I do not need this.","I'm still using DSL internet in my rural ass town.","The answer is always NO. YOU DON'T NEED IT NOW.","I'm gonna say no... you can easily stream 4K at 120 FPS to multiple devices with no problems on WiFi 6. So unless you are constantly transferring massive files between multiple machines over WiFi, you probably won't see much benefit of 7, or even 6E over WiFi 6.","Boo Paywall","To answer the title: Not for a while.Just like 4K TVs coming out, there's very little reason to get one unless you have, or soon to have, something that can supply real 4k content to the TV.Back around say 2012, I worked electronics at walmart, the number of people who came in wanting a 4K TV, but didn't have anything that supplied that kind of resolution, all were 1080p DVD/Blueray users, the rest were satelite with 90% channels 720p/720i and the rest 1080p (if not 1080i). Many people were happy to find out about this difference, and either didn't buy, or bought a 1080p with the same fancy features just without the resolution. Yes, there's upscaling, but a 1080p frame is still 1080p, with or without the processing changes before, after, or without 4k upscaling, there isn't enough benefit to the cost (at least back then, arguably feedable today).As for the fast wifi, other than the range and penetration capabilities, a faster wifi can only go as fast as the weakest link. If the cable is rated for 100Mb and not 1Gb, not going to get over 100Mb in speeds (most cables are 1Gb capable, but people don't throw out 10year old network cables, much like phone cables, they all look the same at a glance). Internet not nearly as fast as the wifi? I'd say routers or switches, but 95% of those in use (including those older but still kicking, I replaced one last month) are 1Gb capable now, though some routers might be 1Gb capable, add in some firewall rules, and the processor is likely not fast enough to keep up.Then you have the winning agreement argument. Do you have any devices capable of using that Wifi7 setup? There's some backswords compatibility, sure, but not getting all of the capability of wifi 7, do your research and weigh your priorities vs costs.If you need more coverage, use wifi APs, please avoid wifi bridges/repeaters, each wifi hop only makes the connection slower in speeds and responsiveness. Wifi APs are more like your cell towers, (most) wired into a main line, instead of repeating off of each other, and you move between the APs like Cell towers, with very little to show you moved, while Bridges/Repeaters can result in different wifi names causing hand offs to be unreliable or very slow.Edit: I allowed autocorrect to do its work while I'm still waking up, that's not the word I was looking for...","The answer is always no if there is a question in the title. ￼","The answer to do I NEED it is almost any technology is no. This is of course true here as well. Wifi 7 is basically just stable wifi 6e at a 2x markup right now with less than 1% of device support. Just wait until a solid 40% of the devices you regularly use have support for it before even considering it. IMO it’s not worth it until 2.5 gbps ports replace 1 gbps ports EVERYWHERE as the default standard and become commodity devices.","Still dreaming of broadband that is more than 28mbps","Pretty sure I just have Wi-Fi 1.","I still have my original Google WiFi pucks that have been solid for 7 years. Do I get 1 or more Gbps bandwidth to my phone, well no, but who tf actually needs that? What I do have is 40-50 active devices on the network at any given time and upwards of 60 at peak (kids and all their devices), and my home Internet speed of 300 Mbps has never failed us.I get that these technologies are great for pushing the limit of what's possible, but practically speaking I don't see how useful this all really is except maybe in enterprise environments or perhaps very dense living situations.","None of the cheaper mesh routers have actual VPN support baked in, they all use their own shitty proprietary remote in from a distance VPNs baked in. The expensive TPLink Wifi 7 router is the only one that I've found that lets you slap on any VPN you want.","The 6 is still fast enough for the local monopoly's slooow DOCSIS interwebs, so no, I don't, and probably won't for the next few years."],"points":141},{"text":["OpenAI bans bot impersonating US presidential candidate Dean Phillips","TIL Dean Phillips is running for president?","Who?","And this weekend, a faked Biden robocall went out to Democrats in the state telling them to stay home.I'm not saying it's definitely Dean Phillips' super PAC.But I am pointing out that Dean Phillips' super PAC has already shown a propensity for supposedly impersonating candidates without their permission. And that Dean Phillips obviously is one of two candidates who would benefit from Biden voters staying home.","It's funny how this guy popped up and somehow news outlets were giving him attention like he's a legit candidateThen I saw him on stage with Andrew Yang and I'm all, \"oooh, I love the circus.\"","https://www.rollingstone.com/politics/politics-features/dean-phillips-ads-tech-super-pac-sam-altman-1234942841/Biden Challenger Gets Boost of Sorts From Super PAC Tied to Sam AltmanWe Deserve Better is running cringey ads promoting Dean Phillips, who is challenging Joe Biden in the Democratic primary","Is he “really” a candidate or a distraction?","I live in his district. We don’t need a bot to make him sound stupid. He does that all by himself.","Who?","Yeah, well... we all know where this is eventually going. That ship has sailed.","That’s one way to get your name into the feed of unsuspecting Redditors.","who?","Are all the “who?” ‘s genuine or is it a diss? I would have thought people in this sub would have heard the name. I feel like I’ve seen the name a couple times.Running as a third party can hurt votes, but just in the primary. More options the better.","Well if they are not impersonating the GOP or attempting to undermine another Biden presidency, whose team are they on? Team Kompromat?","OpenAI bans bots since they have more of a personality than him","Best ad/ most publicity this guys gonna get lmao","Who the fuck is Dean Phillips","Seems subjective.","....Who?","AI is gonna need to develop AI to prevent AI from AIing all over the place","Who?"],"points":268},{"text":["Google Backs Starlink Rival AST SpaceMobile for Android Satellite Support","That’s nice, I actually launder all the lab coats for this company. Pretty neat.","Interesting, Whilst AST has demonstrated phone to sat calling, it has just two birds in orbit. With just 5 launches paid for, using guess who, SpaceX. With SpaceX being the only launcher with any capacity, they win either way. AST seems ahead in contractual promises, whilst Starlink is way ahead in both actual launches and potential to maintain a network.Remember LEO coms sats don’t last and require a constant renewal to function as a network. Which only works if you can pay for launches."],"points":8},{"text":["LoanDepot says 16.6 million customers had ‘sensitive personal’ data stolen in cyberattack","What amount of damage can the borrowers sue for?At some point I hope there will be a law which force these companies to write-off all loans which the customer info has been leaked.","Well that really sucks for me.","Conjugate loan..Loan Emporium, LoanDepot, Loanify"],"points":28},{"text":["Sony Walks Away From $10B Merger With Zee Entertainment In India","I don’t know shit about Zee Entertainment other than the CEO is crying right now since his retirement just walked out the door 😂","Vell, I guess zey don't vant Zee Entertainment.","Lot of ignorance in this thread from people who know nothing about this deal. Let me try to give some info from an Indian perspective.Zee and Sony (this is Sony’s India division) have historically been huge players in the TV market. They’re entertainment titans with long-running television series, reality shows etc. Both tried to pivot to streaming but they’ve not done well, Zee in particular.Two years ago, they decided to enter a merger. This was huge news - on the scale of Paramount and Warner Bros exploring to merge last December. As you can expect, regulators cracked down on this immediately. Regulators even cleared the merger recently, but suspended Zee’ CEO. Ultimately Sony and Zee can’t decide who should run the combined companies (Zee want their own man which Sony don’t).Retail investors in India are heavily leveraged on Zee stock and options and really want to see this through.Now word on the street is, this merger will definitely happen. Sony is playing hardball to get their terms. There’s a pretty big breakup fee involved here too which Zee would definitely not want to pony up. But this explicit declaration by Sony is very interesting and the latest twist in what has been a topsy turvy battle already.","Im surprised anyone ok'ed a merger like this. Sony is too large to swallow up another company.","Sony is wise","Zee TV is garbage complete trash programs with shitty ass psychic advertisements and healers claiming to bring you back to health. Glad Sony made the right decision","Sony released a statement saying “Like if there were two Indias, it would make sense.”","Someone must have tipped them off about what would happen if they didn't submit to the religious nationalism propaganda machinery.","Sony campany know good her goals , so any décisions be good to campany it my opinion","And again Sony Mgmt shows that Due Diligence plays out."],"points":1440},{"text":["Apple might have sold up to 180,000 Vision Pro headsets over pre-order weekend","According to analyst Min-Chi Kuo's calculations based on pre-order inventory and shipping time, he reckons the company sold somewhere between 160,000 to 180,000 Vision Pro headsets during this past weekend. This already far exceeds Kuo's earlier production figures of 60,000 to 80,000 units targeting the initial release on February 2, which is no wonder that the Vision Pro was sold out immediately after pre-orders opened.This subreddit is just going to be flooded with analysts pulling numbers out of their asses, isn't it?","Apple MIGHT have sold 5 over the weekend. See how that works?","Was Reddit ￼around when the first iPod or iPhone was released? I would love to see the threads from back then.","How many of these were to development companies?","Can’t wait to pick one of these up at my local tj max in a couple years for 10 bucks.","Damn ppl love to buy shit nowadays","Opticians are going to see a roaring trade.What a time to be an optician.","So now that all of the ultra Apple fanboys have bought the part now who will they sell it to?","And 95% of them will be collecting dust in a week like all headsets.","Seems kinda low considering you have over 30k units plus of the rabbit r1 piece of tech.. admittedly different price range and functions","Ok, so what does it do? Will they have developers making games for it or can you just link it to a steam account? It's apple so I'd assume you can only access apple store stuff or is it like a vive or other VR headsets where it's just a device you can access VR titles. If not than what a waste of money.","Scraping the barrel with that headline. Must have been a really slow week.","Yes and now they’re on eBay.","I'm just thinking about how much of that money could have been used to feed hungry people.","Well whatever it sold its still a bad and the people who bought will used it once or twice and be done with it since it really has nothing that would make something use it consistently.","I doubt it's that high. I'm also going to assume ~80% or more are devs/companies who want to design apps for it.","For a whooping $3499? That's the Apple ecosystem price tag","Apple might have sold up to 180,000So Apple may have sold some amount between 0 and 180,000 units, but they also could have sold more than 180k. A+ headline, no notes.Edit: For the downvoters, how is this a better headline than \"Analyst estimates Apple sold 160k-180k Vision Pro headsets over pre-order weekend\"? What Engadget wrote is a bad headline that conveys absolutely nothing.","So they still found that many idiots?","Who in the hell is buying these things, and why? Even for an apple product this thing seems drastically overpriced (and pointless).And before the apple fanboy mob comes for me with pitchforks, I'm fully in the apple ecosystem.","At the current price tag, that’s like $3 trillion dollars worth.","Apple will never disclose anything I swear lol","If they want to speed adoption, these need to be free with game consoles or home internet plans with a 2 year subscription. My first iPhone was the 4S and it was free. I’ve never purchased any other brand.","Big company, sold many number, to lotta ppl. Wow!","What’s the standard deviation of the orders? 1,000? How did they sell exactly 180,000?","[removed]","[removed]","I feel like we could write the first 6 months of headlines about these headsets already.","Curious on what this actually offers in functionality at that price point. I'm glad so many people were willing to take that plunge.","$900,000,000.00","It’s so over dude.","It seems cool. Have to get my hands on one first before I would buy it.And that is the problem. I’m sure many people think like I do. Yes they can demo but the process sounds laborious and there are only so many places you can go to try it.It may be amazing and after the demo I may want one, but getting me past that initial scepticism takes time and effort.","Where are most of these orders from? Country/demographic breakdown avail??","Hope I can watch sports on these things someday soon"],"points":598},{"text":["Meta will let EU users unlink their Instagram, Facebook, and Messenger info ahead of DMA","Can I use IG without a FB account?","Shouldn't that reversal, unlink option be standard from the get-go?","So I can have a messenger account without Facebook now?"],"points":25},{"text":["European gas and electricity prices tumble as wind power surges","European energy prices tumbled on Monday, with natural gas futures hitting a six-month low as Storm Isha brought unseasonable warmth and boosted wind power generation.Benchmark natural gas futures dropped as much as 6.4 per cent early Monday, falling to the lowest since July. Intraday power prices in Germany and France fell below zero for several hours. They turn negative when supply outstrips demand.While hurricane-force winds brought by Storm Isha are causing disruptions to travel across northern Europe – as well as power cuts in some areas – elevated wind generation offers some respite for the region’s energy supplies after a recent cold blast. Some models point to unseasonably mild weather well into early February","New high voltage DC lines help bring electricity to where it's needed most.","Reminder: just because market prices for Energy falls (even below zero), does not automatically translate into price reductions for households - does nobody think about those poor shareholders anymore that need more profits?","If only republicans didn’t exist, we could have the same windfall in the states.","Hmm octopus local UK gas supplier recently raised my gas prices.","You wouldn't think it living in Ireland.","Isn't this going to cause dolphin cancer or something?","Does not translate to consumer prices. Greece is a prime example of this...","Nothing tumbled here.","How secure is an offshore,wind farm based, power grid, in a war with say Russia(surprise!)? I prefer green energy like this. We work with Siemens making them in the states. My question is the vulnerability if a country were to go to war. My first move as an aggressor would be taking out the power grid. Seems easy to take out when it’s all offshore based.EDIT: This is not a Renewable vs Fossil comment. It’s an offshore dependency vs inland issue.","When the weather passes, prices will readjust.","Tumble? But they had gone way up thanks to EU embargo of the Russian energy. I guess it went up ten times than went down a bit from that. Better than nothing I guess."],"points":210}]