[{"text":["The next generation of nuclear reactors is getting more advanced. Here’s how.","Well god I’d hope so","Hopefully the next generation of humans get smarter as to stop fearing the nuclear energy.","That looks a like 55gal drum lol","So how many generations and advancements ahead are we from the last one built in the USA? Probably 4 or 5? Newest reactors we build go on aircraft carriers the military trusts in combat on the seas, and we won’t even give one a chance bc NIMBY so we’ll just frack and coal our way to oblivion.","The old generation of reactors is going to just talk crap and call the new generation of reactors lazy and tell them to eat less avacados to save more","Awesome. Look forward to seeing them be planned for 20 years and then abandoned as too expensive.","All those key points and not a single mention of waste disposal.","Are we ordering from Temu now?","Are","now just find a way to deal with all the nuclear waste and make it cheaper then wind/water/solar...","Yeah nah. Same old warmed over, decades old technology.New nuclear is producing power 300-500% more expensive than renewables. It's just not cost competitive against renewables. Game over for nuclear I'm afraid","And that is how Nuka Cola was born!","Bc also - science. In this industry they continuously study, apprenticeship, and have to learn every aspect of each others jobs (at the plant).","The alternative is to go full battlestar galactica to protect us from AI.","I'm surprised when reading these articles why no one ever mentions Thorium. Sure it's a bit harder to work with, but there is no big boom possibilities either. It seems the only reason, as far as I could read, is it can't be used for nuclear weapons like uranium and plutonium .","“Nuclear power plants generate electricity via fission reactions,”Sounds like the reactor is generating electricity but all it does is heating water and running a turbine.","Why does the picture look like a still?Micro reactors! Now with booze function!","No nuclear reactor build since 1951 has been built without subsidies. In fact if you remove all the subsidies, every single nuclear reactor had lost money in real termshttps://reneweconomy.com.au/nuclear-energy-is-never-profitable-new-study-slams-nuclear-power-business-case-49596/Nothing new here just the nuclear industry with their hand out for more taxpayer subsidies."],"points":93},{"text":["Researchers develop artificial 'power plants' in the form of tiny leaf-shapes to harness energy from the wind and rain.","Ok this has to be a joke at this point right? Every day we see news about some new source of energy yet we never see or hear about it again.","Realistically this concept could be turned into artificial turf and be a much more practical solution","So it’s a magic peace Lilly? Because the image I’m seeing with this add is a peace Lilly with highlighted flowers.","Oh no, not again","Super cool! Wondering how many will/are inspired by something like this and go on to create something awesome, or build on this! The biggest potential downside here is creating another monoculture that destroys habitat.","Fake trees that absorb carbon better and use rain to generate electricity in the future"],"points":24}]