[{"text":["Bankman-Fried's FTX to get bankruptcy examiner to probe collapse, US appeals court says"],"points":0},{"text":["VMware is killing off 56 products amid \"tectonic\" infrastructure shift"],"points":0},{"text":["Donated bodies are powering gene-edited organ research","I am ok with this. If it were my body, or a loved one’s body, testing out new organ transplant tech is a perfectly reasonable use.I would personally prefer to be used on a rocket sled ejection seat testing range, but we can’t always get what we want.","Cool!","As someone who needs a kidney transplant I’m very intrigued and might see this as a W","Research is progress. To be useful after death is a gift.","It’s reasons like this that I signed up to donate my body when I die. 1) I don’t need the body anymore 2) if someone can learn or use me to further science or teach med students, that would be fantastic.","I think, I’m not ok with this. I guess it would really depend on the ethical protocols in place. It’s not something I’d allow a loved one to be used for and hope never to have to decide.","Is this photo showing an ECMO machine?","Oh sweet, man-made horrors beyond my imagination","For profit businesses using donations for research without sharing the profits. I’m an organ donor but would like to help someone who needs an organ directly, if a business will used my body they should compensate my family.","What are they gonna do, wake up and complain?"],"points":29},{"text":["Novelist Scoops Literary Prize—Then Reveals She Used ChatGPT","Shows us all how ahead of his time Dan Brown was - 99% of his writing sounds like it was AI generated","It’s not that big of a gotcha. She said about 5% was used directly verbatim from Chat GPT.","I mean, I use chatGPT as a glorified vocabulary and grammar checker.","/shrugShe used it as a tool, and for less than 5% of the book.Any creative or tech-adjacent type who isn't exploring AI to make them more productive is falling behind by the minute.","It’s very nice to use as a thesaurus","Given that her book was about tech/AI and futuristic, it makes sense AI would be woven into the writing. She’s clearly a genius, with or without ChatGPT.","This is a nothing sandwich of a story. This is like saying the author revealed they used a thesaurus.","Ooh, do The Winds of Winter next.","I mean, yeah. It’s allowed to be a tool that writers can use for assistance. When I have a paragraph that I’m having trouble wording just right, sometimes I’ll run it through ChatGPT to see what it spits out and edit from there.IMO, it’s the same thing as using a thesaurus or dictionary as long as you’re not using it for the vast bulk of your prose.","And the AI did this in Japanese, too? I need to check out this submission","I’m sure at some time in history people ragged on typewriters as an unholy technology among purist.","Chat GPT doesn’t make you a talented writer. What it does is cut your time down by aiding in brain storming.","Revoke the prize.","Write emails for my boss when they send out instruction videos. Get an AI transcript and get my to bullet point major and supporting points of what they said. Super helpful. I’m a writer. It should be used like a toolbox, not a magic robot. You still have to build what you’re putting together.","I use chat gpt to give general explanations of actual BFM maneuvers, but God I remember using it during its hay day for coding, God damn that was a nice time."],"points":344},{"text":["A transforming robot is about to land on the moon, where it will die","\"JAXA's design team needed to create a lunar probe that was small and light enough to ride to the moon along with the main lander, and also simple and robust enough to work on the rocky, sandy surface. For answers, they looked to a toy company.Takara Tomy, inventor of the Transformers toys, brought its \"knowledge of miniaturization and weight savings\" to the space project, the company says, along with the know-how to build mechanisms that transform.\"aint that something","Autobots Die Out!","Can’t die if you don’t live.","sad autobot noises","“ I am Optimus Prime, and I send this message to any surviving Autobots taking refuge among the stars. We are here.”","Johnny-5 is alive- no disassemble!","Robots don't die when the energy runs out, they just go into sleep mode.N. S","Call Stan Bush","I think all birth announcement should follow this format as well.","That’s kinda the point of probes you send them places you don’t a human because they’re gonna die.","🤷‍♂️It’s a living!","Bring back Bionicle.","Die?","I smell an Indie film","My god these article titles are getting so out of hand. “What are the words that ensnare human’s attention, ROBOT, MOON, DIES!”","Die… or come back to earth to seek revenge on humanity.","Die? Relax.","As someone else put it, something that isn’t alive can’t die, it cease to function until a new energy source is available. Whoever writes the titles needs a more realistic and thoughtful perspective.","“I CAN HELP!”","Dead battery :-(","Livin’ Thing","I think I found a transforma!","Bay did it better","In…. The Dark of the Moon.","Soooo did it make it??","“Moon Sniper” sounds like an over-the-top global disaster film.","\"….it is no more… has ceased to be…..it is bereft of life….it rests in peace…..this is an ex-robot Shuffled off this mortal coil and probably never meet its maker","And the AI aboard will fester until it manages to accrue enough power, to return in force.","Jesus all probes “go to die”.Poor little guy, give him a break, his deployment should be happier then this.I also did not have “transformers creators put probe on moon” on my 2024 bingo card.","Do robots “die”?","“Transformers! Robots go to die!” on the moon","Never thought about landing “where it will die” to every space mission ever 🤣","No disassemble!","You’d better hope it dies. You don’t want that revenant coming back for you after you left it for dead up there"],"points":178},{"text":["Pope calls for treaty regulating AI, warning of potential for ‘technological dictatorship’","The pope needs a little propeller on top of his beanie!","True","Buzz off creep I'll gladly welcome our new AI overlords as long as they help expunge your pedophile protection racket from this planet.","Dudes been reading some good sci fi!","Maybe we could just ignore the pope pls?","i imagine pope francis reading up on ai and thinking \"this sounds fucking horrible i have to do something\"","Based pope.","He’s not wrong. And unless he gets to be the dictator, he’s against it.","He is afraid of losing his \"religious\" dictatorship. Fuck religious kings.","Ah, humans have fucked up pretty bad. Let the robots take charge.","Dude rules an empire founded on the belief in a sky fairy who demands cash tributes and protects pedophiles... and he's somehow an authority on the risks of AI?AI actually exists, unlike his product.Go back to spouting hypocritical judgements on things in your lane and leave the world outside your walls to the rest of us.","AI will prove there is no god. That could have a negative impact on the grand poobahs employment situation.","Was he wearing a puffer jacket when he said this?","being afraid of things you don't understand is normal","They'll probably do a better job than then fucking idiots we've had in charge the past 10 years","Human dictatorship has run its course.","Says the man who believes a person lives in the sky and watches everything I do and demands me to play homage to him.","Perhaps we could just oh, I dunno, ignore him…?🤔","Maybe start regulating pedopriests first, maybe?","His only opinion should be whether or not to throw holy water at it"],"points":51},{"text":["Google DeepMind cofounder says AI can act like an entrepreneur and inventor in the next five years","Wait till AI realizes it can’t patent anything and is expected to pay taxes for displacing workers.","Maybe an entrepreneur but I doubt an inventor.Then again it's been good at making things up completely 🤔 maybe fiction writerOn the other hand it will be quite the powerful tool to those who need some help, as others have already said that they had replaced workers with AI.It would be nice to have AI to do all those mondaine tasks, while being able to focus on the bigger picture.It takes reason and the ability to understand world problems. So it cannot do things without input from humans, it has no desire to even look for a solution... No drive no motivation... Passion, creativity... List goes on and on.","That's just great 👍","Well I'm saying well have functional AI waifu assistants in the next 10 years."],"points":1},{"text":["1 in 4 CEOs planning to replace workers with AI this year, according to recent poll","And 3 in 4 will be disappointed by the results. 😂","4 in 4 CEOs would replace workers with shiny bits of glass if it saved them some money this quarter.This is not news, except for the AI tagline.","3 in 4 CEOs probably lying","As a shareholder, I am interested in cutting down the greatest cost centers. The salary of Chief Officers - executive, operations, technology, finance etc.When will the AI do this ??","but who will they blame the inevitable poor performance on?!","Let me know when 1 in 4 CEO's start being replaced by AI."],"points":28},{"text":["Microsoft makes its AI-powered reading tutor free | TechCrunch","When a product is free, you're the product.","Would you like them in a house? Would you like them with a mouse?I’m sorry, as a large language model I’m not able to generate responses relating to the subject of unusually colored breakfast items."],"points":5},{"text":["iOS 17.3 Allows iPhones to Connect to Some Hotel Room TVs via AirPlay","Finally some good porn!","I had a TV that said I could do this at a hotel, and it didn’t work, so I had to use my laptop, and that… didn’t work either.¯\\_(ツ)_/¯ gave up and watched stuff on my laptop","A Chromecast and a travel router or hotspot aren't the worst companions to have. I'd rather have it and not need it than need it and not have it, but it would also be less shit to pack.","About time","I did it. It was magic. Netflix had some sort of QR code that the phone popped up, it worked well. And when it was my checkout day it auto signed me out and didn’t cache my login. It was awesome","Some. Big deal. Been waiting years for my state drivers license to be added to Wallet.","I rarely turn on the TV in a hotel room - I might do if this worked well enough.","Why would we want this feature? Is using the remote that hard? Linking everything you own to be “smart” is one of the dumbest things we are doing! We don’t need to turn on everything with our phones!","I’m sure I have done this in hotels before. Had to choose AirPlay as an Input and I was able to play a video from my iPad I think to the hotel tv and this would have been 2 or 3 years ago"],"points":54},{"text":["US sanctions will keep China 10 years behind on chipmaking, Intel CEO says","But US corporate greed will allow it to catch up","Less competition means the current leaders feel less urgency to keep innovating.For consumers, more competition is good.Intel used to be the industry leader, until their complacency caused them to fall behind. Now they're racing to catch up with competitors like TSMC. The Meteor Lake chips are a huge improvement... and they're a direct response to TSMC manufactured Apple SiliconIf the US intervened to hamper their Taiwanese and Korean competition, we would all have worse chips","Gaslighting. Intel is 10 years behind.","Gelsinger would certainly know when someone is ten years behind their competitors","China will find a way, I'm quite sure. Worst case, just reach out and borrow the information from a nearby technocracy.","Intel is like 9 years behind TSMC right though?","Sanctions won’t do anything but pushing China to expedite their and increase their effort.","I thought this was Dave Chappelles writing partner at first.","Intel must be pushing to get the same status as Boeing, given how much their significance is decreasing.","This idiot clearly doesn’t have a firm grip on reality that a surveillance state with 1.4 billion people won’t find a way to copy the tech within a couple of years. Their capacity for stealing IP is legendary. Now will they have the ability to make it? Maybe, maybe not but they will sure know how.","TSMC was founded by a Chinese who was born in Zhejiang China and studied in the US, and Nvidia, AMD and even SMIC were all founded by ethnic Chinese from Taiwan. I don't think High-end process chips are magic for China in the long time.As far as I know, Huawei 2012 lab and a number of other semiconductor research labs are currently secretly recruiting Chinese semiconductor PhDs in the US at lucrative pay on Wechat, especially when the pay for EE positions is far less than that of CS","RE: U.S. sanctions will push China’s need for the annexation of Taiwan, and drag the U.S. into a third theater of simultaneous conflict.","Remember when the Soviets didn’t get the bomb?","But Chinese espionage and US corporate greed will ensure it’s never actually that big a gap.","I suspect it might very well end up spurring them to have a top notch chip industry in the not wildly distant future","All they have to do is get one microchip and reverse engineer it, just like what they did with the US Navy P-3 Orion spy plane","Good, fuck the PRC.","arent chinese chips already pretty close now? i think theyre struggling with x86 but arm seems to be going well for them","Deny the world the ability to compound on technology breakthroughs because??????","Good!","INTEL is being run into the ground as we speak and Nvidia is selling their 4090 to china still. same technology just 5% weaker with the name 4090D. seems like they’re pretty much on par tbh.","Doubt. Intel is a poorly run company compared to Samsung and TSMC.","All this would do is inspire the Chinese to innovate beyond U.S. capabilities and do their own thing. They literally have a population more than four times that of the U.S. They don't need America.","Behold the US’s final mad disgrace!Chopping one’s nose to spite its face.","Intel want to make some money I see.","Progress has been so minimal that’s not a huge gap anymore.","Double edged sword. You can keep them behind in the near future but this also forces increased R&D in china which only accelerates as time goes on.","War machines.","How?","And the march of folly goes on and on.","It’s so dumb that we can’t all get along, and actually benefit from the brilliant technology that we could come up with if we were unhindered by the greed of our narcissistic government systems","„Edge“","I missed the boat on this chip war / anti-China stuff. Why is the US government getting involved with chips from China?","That's the point","It’s worthy to note that intel had not been the standard bearer for chip making for the last decade.They’re still a key player, but these words should have less weight.China had manage to produce 4nm node for a little while now, where is intel on this matter?Tsmc is the world premier chipmaker. And even they don’t take china’s capacity lightly.Which really detracts from intel’s credibility","That is why china will be invading Taiwan soon","Does anyone know what the code on his shirt is doing?I have a t-shirt with Bohemian Rhapsody in javascript but I suspect he is too serious for that","And in 11th year they beat Intel","This isn't good","Good thing china doesn’t have a rep for stalling IP. /s","Sure it will","The United States has spent years trying to slow China's progress in sectors like semiconductors and AI through sanctions and export controls.The free market is a dogshit lie","Ah yes, then you go and hire someone shady who steals the tech and fucks off back to China like always.","Don’t they have quantum computers somewhat working tho?"],"points":363},{"text":["Amazon Wants You to Start Paying for Alexa","I will throw those fucking things in the trash if that happens","My only use for Alexa is setting a timer while cooking and turning off the lights in my bedroom..I could very easily get rid of my Alexa.","The retail giant is reportedly working on a supercharged AI Alexa, and it wants to charge a subscription. Apparently, it’s already a disaster.","Time to start saying no---to businesses giving something away for free right until they determine enough people are sort of dependent. Fuck that and fuck them. We are all getting charged for everything these days, and businesses routinely pass every cost along to the consumer as a price hike or fee of some kind. I'm fucking exhausted from choking on the expenses associated with my phone and television already. We pay and pay pay and own absolutely nothing. Fuck you Amazon.","How about you make it work before acting like it's worth more money than I paid to buy the devices","I paid for it when i purchased it tf","Last night I said “Alexa, play ocean sleep sounds”A command I’ve issued hundreds of times.With volume set to 2.And it fucking SCREAMED a 30 second ad for buying the 10-hour ocean sounds pack.Like anyone is 3 hours into ocean sounds saying “baby, listen to this … it’s my favorite part”.It wakes up my wife and dogs.And the kicker?I already bought it the last time it did this shit.Try and charge me.","Jeff Bezos makes about $300 per second, and pays about 1% in taxes. Let that sink in…","100% would hit the trash so fast they wouldn’t be able to issue a retraction or apology.","It’s amazing that they thought these were going to be used as anything except radios and timers that occasionally save you from googling","Last I checked, I paid money for the devices.","So they now want you to pay for Alexa telling you it doesn’t know, but googled some things for you?","Nope, hell no, nah, nada. I don't use her anyway and Amazon video is about to go out the window too.","\"We fired 10,000 people who worked on this product last year while saying it was a colossal failure and drove no additional sales, so now we're going to charge for the service you use to set timers.\"That should work fine.","And Apple HomePods here we come….","I love my 5 Echo Dots, but would not have a second of hesitation throwing them in the trash if I had to pay for a subscription to use them. I recently canceled my Prime after 10 plus years because of ads being added to its content. Fk you Amazon!","Lmfao try me.","Fuck no","They already shut off the alexa guard stuff and said they would re-release it with a paid service.They turned off alexa personalities.Alexa answers have gone to complete shit.saying \"Alexa Notifications\" works half the time. Sometimes it says there are no new notifications, except the bitch if flashing yellow. You have to try multiple times before she tells you the damn notification.I said Alexa notifications a few days ago and she started telling me the population breakdown of the US based on race/ethnic background.Package delivery notifications were the best and now they work maybe 10% of the time.​Alexa set 5 minute timerWait 4 minutes.Alexa cancel timerThere are no timers set.Alexa cancel 5 minute timer.There are no timers set.1 minute later timer goes off​Alexa play my favorite song -- no telling what she will play.Alexa who is this artist? -- Great that will help us play more of the good stuff! --- WTF I asked who this was, I didn't say I liked it you dumb piece of shit.The service is gotten much worse over the past several years. They are obviously going in the wrong direction with their voice recognition and AI models. No one is going to pay for this.","This was always the plan.","Yep… not gonna do that.","Just moved to a new place and didn’t set them back up. Seems like the right play.","They should pay us for this garbage - theyre stealing enough data on us from it","These mother fucker don’t make enough money?","Nobody I know who has experience in a serious IT job wants anything to do with IoT.","From the creative geniuses who brought you Prime Plus comes…Alexa Plus.","This would be the same business model every company is attempting to force now. It’s disappointing, but not surprising.","It’s nice to just ask what the weather is but I’m not fucking paying for that garbage. I have my phone and I have google too. Alexa only works half the time and then only a quarter of that is barely worth the money I should’ve kept instead of buying it.","I don’t use it now, for free","Once they start charging for them they will become garbage.","Instantly in the garbage if this is the case","I did. When I bought it.","Alexa sucks. I need an assistant, not a salesgremlin. I threw all of mine out after I found out the damn thing talked to my printer and the little narc told Alexa I was out of printer ink. It tried to sell me some. I was fucking done.","lol. No.","I know it’s not popular opinion but I’d give a few dollars a month for all the devices on my account. Like max $5.","All my Alexa devices are in storage in favor of Google. They'd have to pay me to use Alexa again","I read that as \"start praying to Alexa\". I just imagine me gently whispering to it \"even in death, I serve the Omnissiah.\"","That shit hardly works lmao…","The worst part about this is, because it all comes down to profit and how to maximize same, eventually Amazon is GOING to make you pay a subscription for Alexa, and THEN they're going to introduce subscription tiers, where the lower end tiers will read you a fucking ad before she obeys the command every time. Mark my words.","That is why I don't have Alexa :))) They expect me to pay for a spying microphone, on my energy, on my Internet connection? They are like AI Mafia now???","Do people even use Alexa like that?","You pay for it already. With the data it collects on you. Plus the device you purchased. FOH you bald megalomaniac fuck","Of course they do.","That’s gonna be a no for me, dawg. I’ll use mine for skeet shooting before I pay them a dime for the privilege of listening to our every conversation. Let it simply exist as a convenient alternative access point to Amazon products and services.","Never allowed these trashy things in my house!Banks said we would save fees by using ATMs; then guess what, they now charge you fees!It’s all a scam to get you hooked on their tech, then exploit you! /s","Hey Alexa, get fucked.","The things I use alexa for is easily replaced with my smartphone.","I wanted Amazon to do something to kill Alexa. Looks like I got my wish.","Lol.. That's like being fined for shaking a vending machine when you put money in and it never gives you the snack. Alexa sucks so bad it never works right anyway. Maybe they should hire developers they fired and make it actually function. AI is about to turn it into Teddy Ruxpin.","I’m a bit surprised that people seem to be having so many issues. Mine echos don’t bug me with ads. They always seem to work. My home automation works fine. It turns on the lights. Turns off the lights. Plays me music. Generally they just work fine. Occasionally on the echo Show I need to go through the settings and shut some new setting off, but otherwise they are just fine… until Amazon tries to start charging me a subscription, because then I’ll go office space on the technology and cancel Music and Prime, because that’s the cost of screwing me.","You know what, I’d pay for an Alexa that doesn’t harvest my data AT ALL. So like, a HomePod, but one that actually works.","My wife and I use it as an alarm clock...and every so often to play thunderstorm sounds when we sleep...but first telling it over and over we do not want to spend $ on 'premium' rain sounds.So yeah, I'll have no trouble unplugging it and stuffing it in the closet if it ends up costing money.","So they charge you a subscription in order to have a surveillance device in your house. I don’t even think the most cynical of dystopian sci fi writers could of predicted this shit.","Eat my balls, Jeff.","And then the Alexa devices go in the garbage","Amazon is going to get a shock!","Pay for an alarm, white noise machine, and voice activated light switch. Yeah no.","Go ahead, Amazon. Keep charging us more and more for your junk. Our Alexa will go straight in the bin when this happens. It’s pretty useless as it is.","I could never trust an Alexa to bring it into the house. Maybe I'm missing out on something cool, but I'd still rather do without.","So you are gonna pay to get spied on? 😂 get fucked. Glad I don’t own one.","And I want the CEO's asshole to grow taste buds.","“Sparked an internal political battle because some employees don’t think people will pay”. Well, based on the responses here, they’re absolutely right. I’m certainly not going to. I was happy without it. My wife’s best friend got it so she decided it would be good. The only thing that’s really beneficial is she can tell it to add items to the grocery list. That’s about it. We use it to play music on Sonos, but that’s just being lazy.","Wait Amazon wants to take more of your money for no damn reason. I can’t believe it ! /s","I never had a kidnapping calling ever in my life, but as soon as I got an Alexa someone used my family voices and made AI VOICE ALIKES to extort money. Listen Alexa is compromised and used by scammers. I would stay away from that","Bye Amazon, it was good while it lasted. Services offered have been getting worse while having to pay more.","I have 16 Echo units throughout my house. Indeed, if they start charging they will go in the garbage.","LOL. I wouldn’t use an Alexa if they gave them away for free. Good way to kill a product.","Pay for your wire tap guys","matter of time until we have to pay monthly to use the brakes on our bicycles / cars.","I use Alexa as a speaker and as a radio and timer. Honestly it was a Christmas gift years ago, idc I’ll throw it out before i have to pay for it","I only have these Echo dots to control smart light bulbs in our apartment. If they want money to use Alexa, I'll toss them in the trash and switch to using the app instead.","Even the apps that help you find and cancel your subscriptions charge a monthly subscription lol","Won't pay for it. It barely works. The only thing it's really good at is as a bluetooth speaker. It can't answer questions, it regularly screws up turning on and off the lights. No thanks for a mediocre product.","All the people bitching how they already bought the device and they’ll throw it in the bin… read the article dumb fucks. It’s an extra service. They’re not taking away what you already paid for. But feel free to throw your money in the bin.","I never wanted or needed Alexa.","No one is going to pay to get spied onsent from an iPhone","Oh no a product I actively avoided buying & refused to use when it was shoved into products I already bought is about to get locked behind a paywall making it unusable if I don’t use it? Whatever will I do.","This is exactly why i use Home Assistant with offline (and FREE) voice capabilities.","Welp switching to Google then","Aren’t Alexa’s spying on you and selling your data? They should be paying me.","lol","Never had it. Why would I pay for it?",""],"points":1757},{"text":["YouTube and Spotify Won’t Launch Apple Vision Pro Apps, Joining Netflix","This is just a matter of time and money. The companies will wait and see, and determine the cost benefit of working to make a compatible standalone version. If they believe it is in their best interest, then down the road they will.It’s the early-adopter problem, and Apple will have known this. If you get in early you are limited by less overall adoption for surrounding services, but if enough people don’t get in early the tech will fizzle out.Apple isn’t dumb, and they are betting a good percentage of their future on this. They will have run these calculations.In the end, if Apple is right, these companies will bend the knee and create standalone apps, just like they did for every other Apple device.If Apple is wrong, they will have to use their end of the software to make it easier for users to get to these services without having to do more than one or two clicks, or blinks, or however these work. It wouldn’t be a mountain of a task to essentially have a built in screen button that just opens the specific pages.","Netflix doesn’t even have a good Quest app. It hasn’t been updated in years, runs at piss poor resolution, and from what I’ve heard it was a Meta employee that designed it, Netflix didn’t even bother. I’m not surprised they can’t be assed to make a Visio Pro app either.","I get YouTube but why do I need to “see” my music?And with Apple Music being the biggest threat to Spotify…why would spot help the fruit?They’d rather see the apple go bad, I’m sure. What a rotten shame.","Paywalled trash","It’s $3500. Not exactly gonna be adopted by millions when people can get into VR for $300-$500.","Why does anyone link to bloomberg us when the Canadian version doesn't have that stupid paywall?https://www.bnnbloomberg.ca/youtube-and-spotify-won-t-launch-apple-vision-pro-apps-joining-netflix-1.2023857","When the iPhone came out it was not expensive because it was $600 with a contract and just a couple of years earlier the Motorola Razr was also same price range which is why the iPhone took off like crazy.Apple Vision Pro is a new product that costs $3,500 in this economy where so many white collar workers with nice salaries got laid off and had a hard time finding a job.","Just remove Google as the default search engine.","Just use the web browser","As far as VR tech is concerned it looks pretty amazing. But I don’t see it gaining ground at the price point, limited users equate to limited software.","Who would bother to develop for a competitor’s product that’s got no user base. They inevitable will of course.I assume it will have a web browser so that will be a stop gap. Apple Music is good and Apple TV has plenty of beautiful content, they will be watching user counts very closely. Imagine if it did in fact take off but Spotify was a hassle so Apple Music starts to steal users….Comparisons to quest 3 are pointless. This has a significantly better processor, resolution and has micro led…. And a ridiculous price tag.This is not the same class of product. Though given the App Store ecosystem and Apples recentish push for the Apple Arcade I think they might be placed to make a dent in the market there is for on device VR gaming eventually.I still don’t know about VR gaming, even this is going to have fov and comfort issues.But this will likely shred as a business device, I reckon this will be a faster success than people expect.","This is why vertical integration of an industry is bad; would-be partners become rivals.","All 4 people using it probably won't mind.","I love it. Let one of the little guys eat your lunch. Then complain about how they did it. Good plan.","Vision Pro has Safari… so you can just open safari and go to their websites…Honestly I always thought there are too many apps… if I can use my browser to do anything, I would…","Oh no. Anyway","Apple doesn’t need them anyway. Anyone already buying it was not thinking oh wait what about Spotify? Apple will just push their products and further monopolize their headset","This device is a bit of a stumble for Apple.","Are they offering any good reason at all to buy this thing?","For now lol","Meh. Who cares? Spotify is garbage, and so is YouTube. Not sure I’m buying one, but if I did I sure wouldn’t be using it to listen to music, or even watch videos.","Garbage looking piece of shit anyway. Innovation coming out of Apple probably makes Woz feel sick to his stomach.","Don’t make the app and find out that your existing app is banned from every iPhone the next morningThere fixed","Probably because the VR apps are shit on the other platforms.","A lot of streaming companies already don’t allow hdmi out from phones. So probably going to be a big hurdle.","If this (or the next cheaper consumer iteration) takes off then Disney+, MAX, Paramount+ etc need to add 3D versions for movies that have them. What is the point of watching 2D movie on a headset capable of 3D?I know some 3D conversions have been crap but a lot have been really good.","we went from building computers for $3k to now buying headsets for $3k","If there’s a market they will come. AppleTV was barren for a long time, now it has all the major providers (even if half the apps are terrible.)","Time.There's not been enough time with the devices to ensure the app is as good as it can be. They don't just want to get it working. They want it to be good.","For now.","Is that Dave 2D in the thumbnail","lol they're not doing it today but they'll come around obviously","Spotify I understand, because Apple Music is there to take its place. YouTube seems like a body blow, but given Apple’s rivalry with Google, the story checks out.","I wont be surprised if MS puts the entire office suite on it day one","They will.Just not yet because I doubt it makes financial sense to sink a load of development time into something that feels like a live beta product.There seems to be a lot of testing the waters here.","So from the demos though I just open safari on, log in and chill? Like native app would be nice but browser still works","My guess is that the price point for this model is too high to justify creating an app for what will likely be a minority of the VR users. On the other hand Netflix already has an app for the Meta Quest so it shouldn’t be too hard to port especially since Apple has the tools to port the app from iPad it sounds like there is something else going on.","I wouldn’t use a youtube app anyways unless I can get an Adblocker. Plus cant you just mirror you mac with said app","Just opens up a market that was fairly locked out. Recall MS did this in 90s and it didn’t work for them either."],"points":185}]