[{"text":["360° View for a hotel rooms , intended for a single hotel just for advertising"],"points":0},{"text":["Font Awesome integration: JS + SVG - loading time optimization - 859 KB?"],"points":0},{"text":["Levis v1.0 Released - Lightweight PHP Framework"],"points":0},{"text":["I am being almost crazy with webpush ios :(","same issue here for my pwa. currently I'm just adding instructions for the user to \"Add to home screen\" :/"],"points":1},{"text":["Are progressive web applications (PWAs) still good this 2024?"],"points":0},{"text":["GA4 Alternatives for E-Comm and Site Tracking","Do you already know Matomo? You can also host it yourself and it is also available without cookies."],"points":0},{"text":["Estudiando una certificación en programación, ¿qué me recomiendo ser front end o back end?","Creo que tu solo te diste tu respuesta. Se front end. Como ya dijiste, seria mas conveniente ser front end ya que estudiaste diseño y seria contraproducente ser back end. Pero si realmente tienes la dedicacion y el tiempo puedes intentar ser fullstack y ser los dos. Sera mucho mas dificil pero tus posibilidades de conseguir un buen trabajo seran mucho mejor."],"points":1},{"text":["What is your preferred backend framework?",".NET","Other","Spring Boot","Ruby on Rails. I love how fast I can get an MVP up and running, along with the amount of Rails jobs in my area.","Interesting results so far. All of these frameworks are good and perfectly capable of taking on basically any project. Laravel has come a long way over the years and the performance/scalability you can get out of php/laravel these days is absolutely insane. Ruby/rails is like the OG that keeps hanging in there and will never die, and I pitty the fool who thinks otherwise. Django is great for this new generation of developers who are so data oriented, it makes it so simple to take their knowledge in data science and apply it to build fully featured web software. Nest has built on the back of giants(express) and will undoubtedly continue to slowly absorb projects wanting to expand from ExpressJS, although I would not count AdonisJS out of that race just yet.Also, just another thought here, I know this discussion is about backend, and I wont get into frontend frameworks but I will add just a little spice. I predict a major shift from the way we are building frontend these days, a new paradigm is coming into play and currently working out some of the disadvantages of the current industry standard. And to that I will leave you to your imagination.Its truly remarkable to sit back and think about the continual evolution of web frameworks I have witnessed throughout the years.","I am a Rails guy. JavaScript frameworks don't come close in features. Django is almost abandoned (look what brought the latest version -- nothing). Laravel looks great on paper, but I left PHP and not going to return... so it's Rails.","Axum.","Express.js seems to be leading the poll here. What appeals to you about Express.js? The simplicity and freedom of it? What about lack of immediately available ORM, etc, and various other features of other frameworks?","Axum(Rust)https://docs.rs/axum/latest/axum/https://github.com/tokio-rs/axum/tree/main/examples","I'm still a sucker for CodeIgniter. :)","Actix, believe it or not it is not as complex as people say and it is ..... wait for it.........\"BLAZINGLY FAST\"","Since I'm Python fan, Django is my preferred one always. But Rails is my second because I started my coding path with Ruby long time ago and it's kinda special to me.","Flask","Phoenix without any doubt"],"points":35},{"text":["Should I use Nestjs if my app is only a login system?","I'd guess stick to Express if it's pretty straightforward and doesn't need the bells and whistles of NestJS. If it's not broken and you can do what you need to do, why fix it or change it?"],"points":0},{"text":["Write websites in pure Lua! This template lets you create static sites with pure lua, and run lua on the browser easily"],"points":0},{"text":["Embedding a heavy SPA in an MS Teams tab","UXer here. We UXers have no idea about much, but somehow get dragged around to every part of the business because we need to translate to human machines at work and their machine's problems.If it helps a little, Teams is nothing but Chrome Electron, and your app will be... likely rendered... in an iframe. Performance-wise, being in an iframe, you'll get your own process thread, so performance-wise it should not be awful. CSS is contained as well. I suppose you'll be using some iframe messaging via JSON to teams for whatever functionality/communication with teams is available. Notifications, get user data, the works.If it helps a little, Teams is nothing but an Electron instance running Chromium, and your app will be... likely rendered... in an iframe? Performance-wise, being in an iframe, you'll get your own Chromium process thread, so performance-wise it should not be awful. CSS is contained as well. I suppose you'll be using some iframe messaging via JSON to teams for whatever functionality/communication with teams is available. Notifications, get user data, the works.Uh, I just remembered they were going \"native\", but still, you'll be running web regardless, but in Microsoft Edge WebView2. I'd say you are still good, regardless and the above still applies.I wish I could help. All I can do is share your pain."],"points":2},{"text":["WebToApp.app - Convert your Website into an iOS and Android app in minutes"],"points":0},{"text":["Many failed before. Will YOU complete the trial?","A black hole is a region of spacetime where gravity is so strong that nothing, including light and other electromagnetic waves, has enough energy to escape it.[2] The theory of general relativity predicts that a sufficiently compact mass can deform spacetime to form a black hole.[3][4] The boundary of no escape is called the event horizon. Although it has a great effect on the fate and circumstances of an object crossing it, it has no locally detectable features according to general relativity.[5] In many ways, a black hole acts like an ideal black body, as it reflects no light.[6][7] Moreover, quantum field theory in curved spacetime predicts that event horizons emit Hawking radiation, with the same spectrum as a black body of a temperature inversely proportional to its mass. This temperature is of the order of billionths of a kelvin for stellar black holes, making it essentially impossible to observe directly.","All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....","Wait, you actually opened the comments? Are you stupid?","The world would be such a better place without you people in it.","this you?","nice","son ellos","with many on the title this is a juicy clickbait .","who is upvoting this why","Wasn't expecting comments on this","Techbible is your go-to tech community. Ask questions and get expert answers on all things SaaS. Stay updated on the latest tech news, discover trending tools, and share your tech stack with the world. Don't Forget to try it out.https://techbible.ai/","wow"],"points":7},{"text":["I spend too much time with css and layout instead of practicing javascript","I understand. I personally love working with CSS and it's solely because I enjoy making beautiful and accessible designs more so than building business logic. But on the other hand, that logic is necessary. You can make a set of CSS variables to speed up your dev time across projects and focus on building the logic first then working on perfecting the design.","Bootstrap","I love building my own design systems from scratch. Not all of them are perfect, but so what. Don’t beat yourself up too much. There are plenty of JS developers that don’t have a deep knowledge of CSS. Thus the reason why things like Tailwind exist.","I started using Tailwind and just copy pasting component markup. Free ones from tailwindcss or flowbite.","This is why frameworks exist, for everything. Many of us can't be bothered to mess with styling everything, we have more important shit to build.","I think i will use bulma or bootstrap components, i just spent 2 hours building a login","Ive been doing a ton of CSS for a contract this week and nearly zero JS. It’s been bliss. I will happily do 10 hrs of CSS before one hour of JS.That said, better is the enemy of done, and pixel perfect layouts are a fools errand. Make it responsive and sensible.","I'm the same. I like the JS logic, but all my designs look terrible. I'm sure I would get somewhere if I approached CSS with the same gusto, but I just want it out of the way.I would use Bootstrap, but it has that bootstrap look that a lot of Bootstrap sites has. Like those half- assed shopify sites you see.And don't get me started on responsive design. You will find breakpoints where your work will look terrible.I don't know where you are in your career. As I am starting out with the hopes of being a freelancer, I'm going to have to get good at it all. If you are lucky to work to your strengths, that's awesome.","Do you mean designing them or building them? Because building them shouldn’t take thaaaaat long or be a perfectionist about. Once you get the margins and paddings and container widths and gaps of the design it’s just plugging them in the css and letting it be. Like if there’s a container with two Div groups inside of it and on desktop the left one is 600px wide while the right one is 400px wide and they are on opposite ends of the container. Easy. Start mobile first, make the container class a vertical flexbox. Gap of like 48px, widths on the two Div groups 100% and max with at 600px for the left and 400px for the right. On tablet set Flexbox to row direction, justify-content space between and let it grow and you’re done. Nothing too fancy in that layout. Let the flexbox do the work.","I felt the same. I just use bootstrap and dabbling with tailwind. Pico is cool too.","Can I give you crazy advice? Don’t fucking touch css until you’re done with the JavaScript lol. “Get it right in black and white”At the VERY most just put in some flex boxes or whatever so you can get a basic layout.Get all your JS on the page first. Once all your elements are rendering, go nuts on that css and watch it all clean up so nice.","I'm the opposite. I need to have solid functionality first then I beautify it. put the bare minimum effort and only the elements you need to get something working then pretty it up before moving into the next thing. I understand though. CSS has more instant gratification than JS."],"points":53},{"text":["Email Integration","Purelymail is for receiving mail as well.Signup for Sendgrid for transactional and marketing email sending. They have a free plan you can use."],"points":0},{"text":["Why are the phone numbers overflowing?","I was asked to add an element shown in the picture to a website. I consider myself pretty good at wrangling flex, but the overflowing phone numbers have me stumped. I have figured out that the issue can be fixed by not using flex in the rows and just changing the child elements to inline-block, but I'd really like to know what I'm missing here. Any ideas?EDIT: The real width of the icons is 16px, the flex-basis of their containing element, .consultant-address-icon, ends up being 24px. When I set it to auto, the phone number moves by exactly the right amount to fit within the bounds. Applying an 8px right margin to .consultant-address-icon or an 8px gapto .consultant-address-row restores the spacing AND everything resizes properly.Still, I think my original solution should've worked too.EDIT2: Setting width: 1.84615rem on .consultant-address-icon along with the existing flex: 0 0 1.84615rem also fixes the issue. I think I would consider this to be the \"correct\" solution to the problem as it is. However, I have decided to go with the inline-blocks instead.HTML:<div class=\"consultant-address-container\"> <!-- This is a containing div within the white panel -->    <address class=\"consultant-address\">        <div class=\"consultant-address-row\">            <div class=\"consultant-address-icon\"></div>            <h5 class=\"consultant-address-info consultant-address-name\">                Abcdef <strong>Info-line</strong>:            </h5>        </div>        <div class=\"consultant-address-row\">            <div class=\"consultant-address-icon\">                <i class=\"icon-phone\"></i>            </div>            <div class=\"consultant-address-info\">+555 5 555 555 55</div>        </div>        <div class=\"consultant-address-row\">            <div class=\"consultant-address-icon\">                <i class=\"icon-phone\"></i>            </div>            <div class=\"consultant-address-info\">+555 5 555 555 55</div>        </div>        <div class=\"consultant-address-row\">            <div class=\"consultant-address-icon\">                <i class=\"icon-globe\"></i>            </div>            <div class=\"consultant-address-info\">www.abcdef.com</div>        </div>    </address></div>SASS (don't mind some of the weird numbers, they're calculated dynamically and I inherited this thing):.consultant-address-container     display: flex    flex-flow: row nowrap    justify-content: center.consultant-address-list     flex: 0 0 auto.consultant-address     font-size: 1.23077rem    font-style: normal    &:not(:last-child)         margin-bottom: 36px.consultant-address-row     display: flex    flex-flow: row nowrap.consultant-address-icon     flex: 0 0 1.84615rem.consultant-address-info     white-space: nowrap.consultant-address-name     font-weight: 700    strong        color: red","It might have to do with your flex-grow being 0 and nowrap being set but idk. I'll tinker later when I'm at my laptop .Real weird one, idk why the container isnt growing to fit the child elements here.",".consuktation-address: width:auto; or max width auto"],"points":2},{"text":["E-commerce Solution for Software","Ask your ChatGPT client? lol","Have you tried swearing at your computer? I find that helps, sometimes.","There's a membership system in PHP called aMember Pro which would suit your needs. It's been around a long time, but still maintained and updated. I'm sure there are other similar solutions, but I know this one will cater for everything you need."],"points":2},{"text":["My staff BE eng vs senior FE eng are getting pretty heated on who's responsibility it is to decode a URL, would like to hear some opinions","If it's JSON, it should be escaped for JSON. &amp; is a escape code for HTML, and requires any usage of the API to assume that a certain value is escaped for a different encoding. What if you're not using the API from a HTML-based frontend? Then you suddenly have to include HTML entity decoding without ever using HTML.The backend API should give a pure URL without any HTML escape sequences embedded; the only escaping done should be that which is required by JSON.","It’s pretty simple: this is a JSON document from an API. The string contains html entities. An API should be agnostic to the application consuming it. Would you expect a native desktop application to decode this escaped html string, even though there is no html in that context?","&amp; is unfortunately not decoded by decodeURI -> therefore it's not trivial to do in frontend.I always use the principle: if doing an action once in the backend saves the frontend work for every API call, it's probably better done in the backend.","First: This is fucking stupid and it should be trivial to do in the BE.The answer: Do it in the BE. It's presumably coming out of one place which means one place to do it whereas potentially many in FE. There's no guarantee the URL has to be encoded either. FE can decide to encode it if needed.","It's worth noting that in webdev subreddit you're gonna get folks slightly more skewed towards frontend alignment and sympathies, but ... in this case they're right I think. This is a JSON payload from a backend API. It's inappropriate for it to return anything but a string representation of a URL unless its specifically formatting it for some frontend use-case as part of some optimization.","Why is the BE HTML encoding it in the first place?Sounds like the BE is not upholding separation of concerns, and is involving itself in the FE's concerns right off the bat. Stop encoding it, problem solved. Just return the data like ur supposed to, and let the FE worry about what to do with it.","I'd find out why it's being stored like that in the first place. It's not html, it's a url. Only possible reason I can think of is it's coming from an xml document in which case you should be using cdata sections.","Always do it in backend unless it's needed in front end.Case in point - form validation: This needs to be done on backend. Should this also be done on frontend? Yes.","BE","This isn't that hard to check:```decodeURI(\"https://site.com/thepath/?queryvar=something&nextvar=somethingelse\") 'https://site.com/thepath/?queryvar=something&amp;nextvar=somethingelse' ```Which is to say, decodeURI doesn't actually decode this URI because its using HTML elements.Additionally, as others have noted, an API design shouldn't be based around someone needing convenient access to a decodeURI equivalent in their language in order to consume your API. Its just not a great design decision. Particularly since escaping the URL does actually nothing for you in this situation.","Fits the definition of Bike Shedding...","Trying to parse your edit… <a href=“http://foo.com?ben&amp;jerry”> is valid HTML. <a href=“http://foo.com?ben&jerry”> is invalid html (but the kind browsers will generally accept). So, if that’s the case, backend guy is right.The actual example you gave makes it look like this is some JSON payload that has a string value. In that case it shouldn’t be HTML encoded from the backend. They don’t know what context it will be used in. Encoding for HTML doesn’t make sense if the URL ends up getting passed to some non-HTML context.Now, you also have escaped forward slashes, which makes me suspect this isn’t just a JSON payload. Is this also inside an HTML document? (Ie does it have a script tag with some JSON-like blob in it?). In that case, I’m honestly not sure whether the ampersand ought to be encoded or not.","Staff level eng should know better than this, I'd keep a close eye on that one","Look at the RESTful spec. Links are part of the spec and are not encoded.","If the API spits out the encoded version, then it forces two assumptions:that the consumer is JavaScript, or at least has some decodeURI equivalentthe UI has to assume that the URL needs to be decodedBoth of these might be true now, but won’t be forever. For example if the API consumer becomes a mobile app, do Swift or Java/Kotlin have built-in URI decoding? I’d assume so but I don’t know. Are they as easy to drop in as JavaScript’s decodeURI? I have no idea. The same questions arise if the consumer is another backend service, written in something that isn’t Node.For the front end assumption, calling decodeURI(response.cta) might work now, but what if the API changes and the URL is just an unescaped URL? Will it still work?What if the URL is something like …&amp;nextvar=something%20else? decodeURI will spit out …&nextvar=something else which is not a valid URL.If the backend API instead responds with a normal, unescaped URL string, all these assumptions and pitfalls go away.","This is just bikeshedding and if your team is spending time on stuff like this idk what to say, doesn't feel productive. Are they in conflict because of something else and this is just how it manifests?","Inho do it on BE.  If you don't have access to BE or if it's too complicated (how it can be completed if you have workers) do it in FE.","https://www.techtarget.com/whatis/definition/Parkinsons-law-of-triviality-bikeshedding","How is it sent to the backend? If the front end is sending it to them through another API then the format should be the same as it’s sent.I’m just wondering how it’s being encoded in the first place. But ultimately if I had to make a decision then I’d say it should be given the way it was received.","The backend should never trust that the front end is doing things right. The front end should never trust that the back end is doing things right.","Well what are their arguments for doing it a certain way?","Wow 😮","Frontend guy as always is correct, you are sending JSON.Don't believe me, go see any top tier company network tab.","Just use decodeURI, I don't know why the FE eng would spend time arguing this. Not everything needs a debate.","I feel like you should always use decodeURI on the FE by default.","Entities aside, why are the slashes escaped?","I don’t know your exact use case and why the ampersands are encoded here in the first place so it’s easy to make wrong assumptions. But just for the json itself you wouldn’t need it. I would also suggest to respond with a json that holds the url without html entities in this case. If you push this responsibility to the frontend you need to make sure that on all occasions where you fetch the api this decoding has to be done which is easy as long as you only have one frontend that you control. But it also means that if you ever want or need to support more than one client or open your api to third party apps etc every client needs to deal with this encoding/decoding.","BE should do it","If my back end is sending you a json response { \"content\": \"<div id=\"test\">text</div>\" }I have sent you invalid json.How do I avoid this?","BE needs to do his job.","At my company we clean that up on the backend to keep the front end as clean and smooth as possible","Seeing as the Backend and API are the single source of the data, then it should all be done in the BE. You could have multiple front ends connected to that API and each one would have to have the logic to decode every response. If you have a front end connection that isn't using HTML then why would you expect them to decode for that? The API if responding in JSON should escape any of the HTML that would break the response. Same for when the front end talks to the backend. The API should know that JSON responses that contain HTML were always escaped.","Sheesh","This sounds like a backend thing to me, personally.","Every layer should be encoding or decoding it as necessary based on the interface requirements.","I find it odd the API is returning a complete/absolute URL, as well as it being encoded like that. I would assume the API to return partial or relative links, and the client to build the complete link.","You shouldn't really make your consumers have to work to get the correct format of data if its an likewise issue.That said, every team and system is unique and context ought to be applied to the given situation at hand. So given that general rule, it does seem like BE work, but given the fact the front-end has to do smelly work anyway I'd say it can go either way.I'd say there's a bigger issue overall regarding the passing of a elements that have urls inside. This is kind of just shit? Maybe something can be done instead of that method...? probably a win/win.I wouldn't like \"heres the raw html, you parse it\" type approach. But as you said since the FE needs to work with this and essentially create its own application to do this work, why not add an extra step in that process? Maybe you guys just need to both step back and structure it better, if possible.","If the BE is rendering it, it’s BE’s responsibility. If FE is rendering it, it’s FE’s job. Wherever it is used should be wherever it is decoded.","If you have staff and SR engineers arguing about this type of nonsense, you have deeper problems my friend.This is no offense to you, btw.","The Backend dev should do it.But honestly, if they are arguing over something simple like this, it's likely something bigger that's actually causing them to fight.Maybe there's some personal conflict going on under the surface","Sounds like a pretty cool argument. Wish mine were like that.","Sounds like it should be stored in db differently or it’s a backend problem to solve. Not the worst thing to do FE but objectively worse given the info","If I understand this correctly, you’re sending a json response where there’s a content key which contains escaped HTML, then in the frontend you parse that HTML and depending on what you find there you instantiate the React components that match this content. You never put the html you received directly into the DOM. Is that right?It might be a bit more work, but if I got the situation correctly and I were in your shoes I’d consider how feasible it would be to do ALL the parsing work in the backend, so that instead of returning an html blob to the client it will return a valid json tree that represents the DOM the client is going to build components for. Basically a conversion from HTML -> json tree of html elements with their props.This will solve this (and future) similar discussions, as well as provide a much cleaner API. I believe it will be more secure due to being able to server side remove insecure tags (such as script, on click props, etc). And one of the most important benefits, it will cause less cpu work for your users browsers, which will make your frontend more responsive and drain less the battery on mobile devices.","One other argument nobody mentioned is that sending & instead of &amp; will save the backend some precious bytes of network traffic!But seriously, BE should always send pure non-contaminated values","backend should give clean ready-to-use url. or if that is impossible (though i see no reason here), frontend can decode it without any war effort. did you ask why those kids haggle over such minor things?"],"points":998},{"text":["Does employer expect me to know everything?","If an interviewer expects you to memorize all methods then that interviewer is terrible. Interviews should be about how you approach problems and solve them, not like an exam at school.","no.","Absolutely not. I care that you know how to solve problems, are able to read and understand code, prioritize task, work well in a team, can gather business requirements and convert them into technical requirements…I don’t care if you need to look up if the index or object comes first in the function you pass to map.","Depends on the company and position.For junior level jobs they may require a bit of knowledge of the basics of the framework and language of their choice. For coding interviews mostly they give you a problem and they are interested in how do you solve it. How do you come up with a solution - if you can come up with one on the fly by yourself actually, then describe how would you do that in that specific programming language, and why like that. And if you find that some detail is missing or it is wrong, then how do you approach to fix it. Can you do brainstorming, find solutions with search, or do you just get brain freeze because of the pressure. These are basic skills for any programming job. They would like to see how do you perform, do you have the needed skills to fit into the team. At least that's what I've been looking for when interviewing new candidates. Others may do it differently.For medior or senior level jobs we require deeper knowledge not only specific programming languages and frameworks but paradigms, design patterns, the application layers, architectures, integrations and how can the candidate structure and build/arrange each of these parts together for the big picture. Again, how does the candidate come up with solutions, what approaches did he/she take in the past for common problems, what projects they've been working on before and what role did they have, and by that we can tell approximately how deep knowledge does he/she have on different topics including communication skills, how many programming and scripting languages can he/she understand, plus what kind of servers does he/she have experience with, different dbs, APIs, containers, maintenance, scaling, managing projects, does he/she have experience with cloud providers, and is it enough to give him/her the position to lead the development and review others. So for these kind of candidates we are really interested that their experience can be useful for our company's projects.","If the interviewer asked you about every method and gotcha questions then you really don’t wanna be working there. Interviews reveal so much about the company culture and tendencies. You don’t need to memorize everything. You just need to know how to break the problem into smaller parts and how to find out how to solve it.","Employers only see if you can make them profit."],"points":16},{"text":["Anybody here use Vuetify?","After they botched the transition to Vuetify 3/Vue 3, I have very low confidence. This is a shame, because it was an excellent library.I’m using PrimeVue now and find it wonderful to work with.","You already used it on two projects. What else is there to learn? It's just a UI library like any other. There isn't really much to learn. It's basically copying and pasting components."],"points":3},{"text":["Interactive Flowchart from JSON data"],"points":0},{"text":["Is there a way to simplify website bookmarking process to a phone home screen?","AFAIK, there's no easy way, on purpose."],"points":1},{"text":["Scaling Airbnb’s Payment Platform","Just the essentials:This post, written by Angela Zhu & Karen Kim from Airbnb Payments Engineering, delves into the evolution of Airbnb's payment platform. Initially, Airbnb's transactions were offline and cumbersome, leading to the decision to handle payments in-house. The early system was simple, using PayPal for guest payments and paper checks for hosts. As Airbnb grew internationally, the need for a more sophisticated, global payment system became evident. This led to innovations like integrating local payment methods, such as Boletos in Brazil, and addressing the complexities of currency conversion and regional payment preferences. The payment infrastructure underwent major changes, moving from ad-hoc integrations to a more structured system with a Billing Interface API, a unified Payments Gateway, and a scalable Financial Data Pipeline. These upgrades facilitated easier integration of new payment methods, improved financial reporting, and supported Airbnb's global expansion. The post highlights Airbnb's commitment to owning and continuously improving its payment system, which has been pivotal to its success as a global travel platform.If you don't like the summary, just downvote and I'll try to delete the comment eventually 👍"],"points":2},{"text":["Vite vs live server doesnt render same thing","Vite in dev mode does not reload files as they change the way other dev tools do. Vite in dev mode streams changes directly to your browser. This is how it can do its thing ~100x faster than other dev env tools.Vite will build your files into a production-ready bundle, but that's a different process.The upshot of this is you can't easily mix-and match vite for bundling with another tool for hot-reloading. Not that you would want to, vite is orders of magnitude faster than most other hot-reloading dev env tooling."],"points":1},{"text":["Cost of developing a small web app","$10,000 USD to make a minimum viable product. 1 month turnaround time. This is a rough estimate, to be sure.","This is definitely a more backend intensive gig. Meaning, you may (should) not focus on creating a beautiful looking UI. So the most time spent as the developer will be on the backend portion.Personally, a project like this would take me roughly about 50-90 hours of work at a rate of $65 an hour. I would say closer to $4k - $7k.","I'd do it for $10-12K for an MVP.","10K would be reasonable, you'll also have to give API (probably purchase) keys for sending email and text messages. I assume this needs auth too.","The requirements can be fulfilled by Azure Synapse/AWS. Why do you need a web-app to be developed?","On the surface of it it seems simple enough however it sounds like you need an integration between the clients db and your own. Be it a small api setup on their server or a dedicated connection to their database. Things like this require integration testing and tbh 10k sounds reasonable.","Ι would ask around 4 to 5 k But the cost of developing isn't as much as the cost of the server.I would ask around 500 per month for hosting an app that would stretch my server every 2 minutes.","I’ll do it","1 - set up a script that runs on the clients machine on a schedule that pulls the data and hits an endpoint on the webapp for ingesting the dataprobably the least invasive way to do it, IT wise. I'm available if you need help","I could probably do that in a weekend or 3.Minimum estimate if we're goin off hourly rate, $60 x 10 hrs x 6 days (optimistically) = $3600If things go straight to hell and there's problems on problems it may take longer, or if it's a median between optimal and hell, only marginally longer, in either case it means you'd be paying more.How much more? Dunno till it happens, but that's the part you have room to haggle with in contractual conditions.","We can do that in 4k. Just let me know your thoughts."],"points":82},{"text":["Handling Private Messages?","Try pusher or build your own node/go service"],"points":0},{"text":["Creating an Immersive 3D Digital Experience in Three.JS to Help Drive Sales (Case Study)"],"points":0},{"text":["small question about hexadecimal in web apps","It isnt a hexadecimal. It is an UUID hash.","Depends on the web site.Most likely you are seeing an internally generated \"unique id\" for the media. It could be a hexadecimal representation of a UUID, or something else unique to that application or web site.40 hex digits equates to 160 binary digits (1.46e48 possible values). The set of possible values are so large that simply \"guessing at random\" isn't practical. You'd need an index or catalog to find out which values are legitimate.","No, not really. That 40-digit hex can be anything, but it's likely a SHA-1 hash of the file. 40 digits of hex == 20 bytes == SHA-1 hash size, which is still common to use for file hashes.File hashes are handy to ensure that a file hasn't changed. If the file changes, the hash in the file name changes, so you never have to worry about accidentally using stale cache. Without the worry of stale cache, you can cache for MUCH longer, like a year.It saves a lot of money, if you have the ability to tag your files with a hexadecimal hash digest (such as SHA-1).","No, that's usually the point. It's used to prevent enumeration.","Those 40-digit hex codes are unique IDs for media on the site, made to prevent unauthorized access. Trying to guess them is a no-go — it's against the rules and can be illegal. They're usually random and not meant to be predictable, for security reasons."],"points":23},{"text":["How to create a low latency geometry configurator"],"points":0},{"text":["Setting up windows as a linux guy","Just do everything in WSL if you are at home on the terminal. You'll have a pretty good experience. I did. I'm also a terminal enthusiast. That's all I've got, because I haven't used windows for dev for about 5 years.","If you’re using node nvm-windows https://github.com/coreybutler/nvm-windows","I like Microsoft Powertoys. Specifically the Alt + Space to search or open a program. I like it more than using the Windows key for searching. It comes with other things too.","WSL2 on Windows 11 is a very compelling platform. Easy to setup, easy to install Ubuntu, easy to get started in a dual Windows/X11 GUI environment.It's a two way street (even inside of Ubuntu): you can access your windows C:\\ directory from Linux's /mnt/c, launch chrome.exe from an Ubuntu shell, and launch Ubuntu X11 apps like gimp and be happy that the integration is very tight and very smooth. Awesome engineering feat, MS.","Oh, and you'll need a good text editor like notepad++","If you like using the terminal, just install VS Code, then just choose Terminal from top menu --> New Terminal, install all your shit from there. It's basically just a Powershell window running within VS Code.If for whatever reason whatever program or CLI etc you're trying to run responds with a message like:The term 'hit' is not recognized as the name of a cmdlet, function, script file, or operable program.It just means you need to add that program to your Environment variables PATH variable. Just tap WIN key then type 'Environment' and it will come up and you can modify it there (usually requires a restart of Terminal to reflect it)Other than that you can do everything in VS Code or for backend I prefer Visual Studio (for C#) or Eclipse (for Java). Its actually not much different","I use MAMP but I'm a hobbyist, not a professional. There is also WAMP. I think MAMP was originaly designed for Mac users but I prefer the windows version of MAMP over WAMP.Local WP is good if you're doing any WordPress development. https://localwp.com/","Check out scoop or chocolatey for program installation :)","If you don’t want to use WSL, you could put Virtual Box on windows and run you preferred Linux box that way/ or dual boot into Linux on another partition.","Git bash + cmder or windows terminal (it is actually a goid thing now)","Since I don't know what your tasks are, it's a bite hard to give specific advice. So I'll just describe some of my working habits. I work with Windows and Debian, but for different tasks. I manage my vhosts through putty in a bash shell, but on Windows I rarely leave my IDE, as it has all the tools I need integrated. My dev environment runs on WSL2 Debian, and tough it is not quite as performant it is fine for me. Got everything set up in de IDE and I'm running all build, testing an qc tools through shortcuts from my IDE.My general advice is: embrace the pros of each system. Windows is, imho, just the best GUI client and I have tons of shortcuts and macros set up, that make working with it easy. Windows Explorer is imho the best file manager - shipped with an OS - and you can control almost everything with shortcuts. WSL is all the Linux goodness integrated in a system that also runs your favorite games.I would of course never run a production apache2 or postfix or whatever on Windows, and still use the bash shell very often for server tasks. But I also love working on Windows and recently leaned hard into the VCS tools of my IDE, and now feels stupid that I merged my stuff like a caveman. But a commit? still on the terminal ;-)Conclusion to all the rambling: don't be a fool, use your tool. The terminal isn't the best at everything, and a GUI is sometimes just a hindrance. But on Windows and with WSL you have a real choice to get the best of both worlds and an OS that runs just everything that is compiled for an x86. I don't think there is a really good and viable alternative to that.Now, I'm doing this for over 20 years, so I probably forgot how cumbersome the way to get here was. But I went through stuff like Windows ME and NT 3.5 and SUSE Linux and no package manager at all. It's never been easier to get going on a computer, and fuck some stuff up, than it is nowI love them all (except for macOS, fuck that shit).","WSL2 + Windows Terminal and you got linux in your windows.But if you would like to not emulate linux, I would recommend Cmder for terminal.Also you can turn off animations and transparenices if you go to settings > display to make things a bit snappier.Furthermore, windows 10 (and win11 even more so) can be annoying with some features(cough bloatware cough) but you can turn them off if you are willing to do some registry fiddling.","A lot of people are saying WSL, but I find MSYS2 easier to use. WSL runs on a virtual network drive, but MSYS2 uses your real drive - you can even make it use your windows home as it's home (so c:/user/yourname = ~). It also works well in the Terminal app, so you can switch between Msys and PS easily.I also recommend going through the group policy editor and disabling stuff that you don't need.Lastly PowerToys provide some power user things you might be used to on Linux (best of which is a tiling wm replica, which acts like the one in newer versions of KDE).","If you’re used to using a window manager, glazeWM has been working for me. I switched for school a bit ago.","Definitely BonziBuddy. /s"],"points":38},{"text":["What's your go-to solution for sending emails from a web form?","> Considering trying Python if it's easierWhen you run into an issue, throwing an entirely new language onto the stack is almost never the solution.","PHP Mail: Check the php error logs, this is the tell. Make sure it's setup correctly in the php.ini. Check the recipient spam folder too. For more details check out this post.SendGrid: follow their documentation more closely because if it isn't working you probably didn't set it up or use it correctly.","You gotta explain the issues. Changing languages won't solve any of them.","Maybe PHPMailer? That's what I use anyway.","\"keep running into issues\"When you're asking for a solution due to a problem, you should usually elaborate on the problem if you want a solution to it.​We have a contact form with a honeypot, CSRF token, captcha, IP rate limiting which then sends to our PHP backend to verify everything is legit. If it is, we use the Sendgrid API to send an email to us.","If you're doing anything production grade I would recommend a third party service like Amazon SES, mailgun, mandrill, etc. you'll want to handle bounced messages, DKIM validation, etc.Configuring your own internal SMTP server in a way that won't be abused and handles all the message signing, etc is kind of annoying versus paying AWS a couple bucks a month.","I use PHPMailer. It is fantastic.","Check out Formspree or Netlify Forms.","I use MailGun usually, fired off via JS or whatever language I'm working in. They have a toolkit and API that works pretty easily across everything.Would be good to know what kind of issues you're running into. Issues from PHP sending the emails, or clients blocking them/spamming them, etc.","Nobody else still using formmail.pl from Matt’s Script Archive? :)","I use mailelite they have an api for sending emails if the website is public you should make your own api and then from there make the api call to the mailerlite api(or any other service you use) for me it took me 2 or 3 days to set it up because I didnt know anything about sending emails but mailerlite has a great documentation most of the time went to searching for a service that I can try for free","Netlify forms + Zapier!","https://github.com/PHPMailer/PHPMailer","Mailgun is pretty simple to use.","I’m running sendgrid on all my projects. With the dynamic templates. Have you used the domain verification or sender address setup tool in SG? That might be the auth issue you’re running in to.","I've had no negative experiences with nodemailer","Phpmailer.","I just did this last week for my web app and used EmailJS. Took an hour to set everything up and got it working since then with no issues whatsoever","PHPMailer","Just serialize your email object to json, then throw an exception with the json in the body. Then setup a global error handler that uses SendGrid or whatever.","Sendgrid or Amazon SESBoth production ready systems able to handle traffic and security items like DKIM.Both have great documentation and community resources online."],"points":181},{"text":["Issue with sharing link","We transferred the domain from IoNos to GoDaddy.You poor sap.","If i understand ur scenario accurately, ur site from godaddy should be available at www.blah.com over the internet, but when someone types www.blah.com in the url bar it redirects to www42.blah.com ? This could be bcos of an incorrect DNS redirection rule setup at your domain registrar side aka godaddy. Have you tried asking their support?It could also be if ur wordpress site is being redirected to another domain and the redirect is configured incorrectly. Have u checked the wordpress site like they mentioed here ?"],"points":0},{"text":["Screen recordings with no narration"],"points":0},{"text":["What r some remote job worthy projects for entry level Position","Imo, there are no projects that will guarantee a job. And doing side project after side project will not impress employers. What employers are looking for in entry level positions are: 1) an obvious passion for what you are doing 2) the ability to communicate effectively (verbally and non verbally) and 3) basic knowledge of your preferred language. There are just way too many people jumping into the industry that personal projects hardly give you an edge. I’ve had multiple potential employers tell me in interviews that they don’t even look at peoples projects anymore. Seek out any personal connection you have already in the industry, as that is going to be your absolute best resource to finding a job."],"points":0},{"text":["How to run an iOS app through a web app?","There are services like appetize.io that stream mobile devices and can be accessed through a website, but you're going to be paying far more to stream and run a mobile app as a website than just recreating it for the web, it'll also be more complex in the long run."],"points":0},{"text":["I need help on somthing.","If the website was just launched, it won't be immediately available on Google. Even when it gets listed, you need to do SEO to climb the rankings. Check this out: https://developers.google.com/search/docs/fundamentals/seo-starter-guide","I would have a conversation with the developer about the domain. Failing that, we (this sub) would need more information to see exactly what's going on.How, exactly, do you access the site at the moment? Where is it hosted?As far as Google goes. It can take months to years for a site to rank. This depends on how well the site provides it's identity and proves that it is the canonical source (or, at very least, a trustworthy source) for the information it provides. You can submit the site to the various search engines to get it crawled quicker, but that doesn't mean it'll rank.You can also pay for ad placement, but that can get pricey pretty quickly depending on the industry.","What he needs is some kind of SEO evaluation and a potential action plan to ensure the site is getting the best rankings possible given the context.","Could be that the robots.txt is not allowing site to be indexed. It happens when developing WordPress or any other type of site. The developer turns indexing off, so that Google doesn't index the site while it's being developed. And it can happen that the developer forgot to allow robots once the site goes live.Source: happened to me 😃So have your developer check robots.txt file.Also submitting a sitemap to Google should help and it will also give you info if the site indexing is blocked or if there are any other errors.This should also be done by the dev, it's prey simple to do for WP sites since they usually generate sitemaps automatically.","You might need to go into Google Search Console and ask Google to index it. Your developer should have done that, but I guess they didn't.Do you have access to your dad's domain registrar? You'll need to go in there to add a record to verify to Google that you're the owner of the site.As someone else said in another comment, Google will take months to index the site, so get started ASAP.","Generally, a website is hosted on a specific IP, and this IP is referred to by DNS by a name.If you type in \"Facebook.com\" into the address bar, you are actually typing in the IP Address of Facebook, which returns the website.What you are looking for, is something called \"SEO\", meaning Search Engine Optimization.Google only showcases links that it likes at the very top. If you search for Facebook on Google, the correct website shows up because of SEO. This is a very big topic on it's own, and you will need to consult an expert for your specific search engine needs.","I don't know if this will help you, but there are browser extensions that can check the SEO of your website's pages and make recommendations.I don't remember which ones are the best, but I think you'll easily find articles on the subject.Maybe this will give you some clues as to what is missing or could be better configured.","Download the yoast plug in for WordPress. Yoast will tell you what needs to be optimized for SEO. Optimize the keyphrase and meta description and add alt tags to all your media. Sprinkle in some internal and external links. Theres a bunch of yoast tutorials on YouTube that can help you.","You need to purchase a domain name to your liking (very cheap, usually 10 dollars a year) to have something like 'www.myawesomewebsite.com'.​People pay money to google to have searches put your stuff at the top","gpt told me to this: Google My Business (GMB): and Search Engine Optimization (SEO): can help. any tips or maybe other ways?","what?","The website needs to be indexed and basic onpage SEO has to be done. Further such scenarios are common with amateur web developers."],"points":44},{"text":["Guide me please!","Protip: do not mention anywhere or check the domains availability on godaddy without registering it immediately unless you want to pay a few hundred dollars for it.","No issues with that. Buy the domain and turn on auto-renewal.","Yes, although I would highly recommend Cloudflare, in fact it's the only service I would recommend for domains. It's possible that you need an extension they don't offer, in that case, Namecheap is not bad either.","Lol yeah man. I have like 3 or 4 good ones that are in queue for \"Dev time\". If it's previously unregistered it's usually only like 12 bucks a year.","I have domains that I bought 10 years ago that I’m still waiting for development time.","Yes, definitely buy now! Some people make a \"career\" out of thinking up marketable domain names and buying them so they can sell them on when a company wants it.I've bought about three domains \"just in case\" that I'm not currently using.","I wouldn't even put the name into those services without really buying it. Some \"check if the domain is available\" services will actually nab it up. You should buy it immediately."],"points":11},{"text":["Many failed before. Will YOU complete the trial?","A black hole is a region of spacetime where gravity is so strong that nothing, including light and other electromagnetic waves, has enough energy to escape it.[2] The theory of general relativity predicts that a sufficiently compact mass can deform spacetime to form a black hole.[3][4] The boundary of no escape is called the event horizon. Although it has a great effect on the fate and circumstances of an object crossing it, it has no locally detectable features according to general relativity.[5] In many ways, a black hole acts like an ideal black body, as it reflects no light.[6][7] Moreover, quantum field theory in curved spacetime predicts that event horizons emit Hawking radiation, with the same spectrum as a black body of a temperature inversely proportional to its mass. This temperature is of the order of billionths of a kelvin for stellar black holes, making it essentially impossible to observe directly.","All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....All this squares make a circle....","Wait, you actually opened the comments? Are you stupid?","The world would be such a better place without you people in it.","this you?","nice","son ellos","with many on the title this is a juicy clickbait .","who is upvoting this why","Wasn't expecting comments on this","Techbible is your go-to tech community. Ask questions and get expert answers on all things SaaS. Stay updated on the latest tech news, discover trending tools, and share your tech stack with the world. Don't Forget to try it out.https://techbible.ai/","wow"],"points":7},{"text":["How to use hls audio only with multiple audio tracks?","HLS uses the stream wrapper to define multiple instances of the same media but at different bitrates.If you want multiple languages, you'll need multiple HLS stream wrappers each with a different language, not one stream wrapper with all the languages.Add each of your language .m3u8 files as <source> in your <audio> elementTell video.js about each one using AudioTrack.``` <audio id=\"my-player\" class=\"video-js\" controls> <source id=\"lang-en\" src=\"https://domain.com/en.m3u8\" type=\"application/x-mpegURL\"> <source id=\"lang-es\" src=\"https://domain.com/es.m3u8\" type=\"application/x-mpegURL\"> </audio><script> const player = videojs('my-player');const langEn = new videojs.AudioTrack({ id: 'lang-en', kind: 'translation', label: 'English', language: 'en' }); player.audioTracks().addTrack(langEn);const langEs = new videojs.AudioTrack({ id: 'lang-es', kind: 'translation', label: 'Spanish', language: 'es' }); player.audioTracks().addTrack(langEs);</script>"],"points":1},{"text":["Website & Domain Not Working (PLEASE HELP)","Give it some time, sometimes dns propagate 24 hours or more."],"points":2},{"text":["DevTools Podcast: Rethinking Open Source Security Beyond Buzzwords"],"points":0},{"text":["Seeking Best Practices: Streamlining Validation Across RESTful APIs and Frontend Forms"],"points":0},{"text":["What frameworks should I use for this app?","SvelteKit","Check out frameworks with SSR (server-side rendering), Next.js is an option.","Well.. we'll need a bit more info than that. What kind of app is it, what do you want it to do?​fast interactions​well if you want something that renders really quickly then vue.js and other DOM oriented frameworks will be the 'fastest'.however, keep in mind that these 'fast' lightweight frameworks are that way because they're stripped down to the essentials. You'll end up writing more javascript to implement basic features than you would using a more robust framework.If you want something that'll minimize time between an api call and the response... that'll largely depend on the API you're calling (how fast it executes to do what you asked) and the network latency ( at the end of the day, the data needs to go back over the wire to the user.you can mitigate some of this with caching (the first call takes forever, but subsequent calls just use that first cached response) Or, if you've got money to spend, a CDN and co-located servers to reduce latency that way.As a general rule for frameworks:fast, good/reliable, easy-or-quick-to-implement; pick 2.​minimal client javascript​Well.. this is hard to answer without knowing what you're doing.If you're writing a game, and dont want to define a million little functions to handle the gui, then you'll want a framework like P5.js that already has alot of what you need in it.If you're doing complex math in your page, then something like theorem.js will have all the basic math functions built in and implemented for you.IMO, if you dont want a calculation done on the client side, you'll need to build a back-end API for the client to call to do the calculation.in enterprise level software, this is usually how it's done. The UI should only contain JS for making API calls and logic for rendering data. Any calculations or 'heavy lift' computations should be done by a separate API.","HTMLX","I think this requires a bit more information about the app. What's the scale going to be? How much interactivity do you need? First, you need to decide between MPA vs SPA. Generally SPA is better but more difficult to set up and more JS heavy. If it's a simple app with minimal JS and not intended to scale, I would say go for MPA. Otherwise you may want to use a framework like React, Angular, Vue, Svelte or Lit. For the backend, I would recommend Express or Fastify. I love Koa but I'm not sure about its future. It's possible to use some other frameworks like Nest but I don't like having to transpile on the server.","Go/Java/C# backend that serves html.","In my experience the absolute fastest stack right now is going to be with SvelteKit.","Definitely worth looking at next.js imo. Not sure about it satisfying your minimal client javascript ask, but it’s great for rapid development and comes with some great server <-> client features."],"points":14},{"text":["React Server Components","all you need to do is run an effect hook or something like the mount event before the renderEffects run after initial render anyway... usually you would pass data store to react outermost component that already has data in it that react can use to render correct state.Server components still require SSR but the way they work and what features they offer when comparing to simply rendering on server side is quite a big difference.Server components render exclusively on server and they are immutable. There is no state, no side-effects and component itself is a async function.Basically you want to use server components when you have to render pure visual components.You don't have to use it if you don't want to but there are use-cases where you may benefit from it, especially if you have to render a lot of display data. The component itself will be less complex than using side-effects and states."],"points":3},{"text":["How we reduced Laravel SaaS app Database from 85% to 45%","Please don't give advice you're not qualified to give.Using PURGE BINARY LOGS BEFORE NOW() is a great way to make your replicas lose data/be out of sync.The correct approach is documented in the manual here — in short, check the slave status to see what the oldest log currently being replicated is and only purge to before that date.An better option is to set the binlog_expire_logs_seconds system variable to something approaching your maximum replica lag time (default is 30 days, you could likely set it to 1 day and reap most of the space saving benefits without any concerns). This also means that it will be automatically maintained rather than needing to periodically run the PURGE BINARY LOGS statement.On a final note, a 25GB DB is tiny in the world of data, and giving results in percentages is silly when it's not a fixed size thing you're talking about, if the DB were 2.5TB, you would've gone from 0.85% down to 0.45%, and it's highly unlikely if you were using 45% of 2.5TB that you would balloon to 85%, and even if you did, these tricks would be unlikely to yield the same result.","So the hot tips for using less disk are:Disable debugging in production.Have a log file management strategy.This is basic stuff. If you're running an app that has real user data and not doing these, you need to consider hiring some professionals.Next hot tips, slow query optimisation, indexing and partitioning...","Hi there, I recommend you purchase and read the book “designing data driven applications”. This book explains what the log data that you just deleted is used for and why it’s important.","Lmao, I’m no expert and not going to tell OP what he should/shouldn’t have done but from seeing the comments I get that he’s getting absolutely roasted right here","Laravel documents clearly states (https://laravel.com/docs/10.x/telescope#introduction):\"Laravel Telescope makes a wonderful companion to your local Laravel development environment. Telescope provides insight into the requests coming into your application, exceptions, log entries, database queries, queued jobs, mail, notifications, cache operations, scheduled tasks, variable dumps, and more.\"So, this is in fact a rookie mistake to enable this in production. The tip here should be: do not enable in production what is for development only"],"points":43},{"text":["$100k in grants for open-source web games","Rune seems like an interesting platform, but I have a couple issues with this program:A grant is an up-front cash payment that enables someone to do work they couldn't otherwise fund. It's not a grant if devs need to build and release the completed game before seeing the money. It's spec work. Once you've made devs submit an application and be accepted, show a little trust and cut that check.Insisting the game be MIT-licensed is not cool. Devs should be able to choose any open-source license they are comfortable with. The website says \"your game remains yours completely,\" but is that really true if anyone can fork it and profit without sharing the improvements they make to the code? I don't think so.Bottom line: You're asking a lot for $500, which, where I live, is a couple weeks worth of groceries and gas. And $5000 is not enough for that MIT license restriction, even if I already had a game made with Rune sitting here, ready to submit.","I was interested and clicked through immediately! 100k!!Then I saw the page and laughed bitterly","How are you all defining multiplayer?","Is the server proprietary? We can't self host?","We at Rune believe there's lot of awesome multiplayer games just waiting to be made by talented web devs. So we made this grants program to help support devs interested in making a game on Rune. You can apply with a new idea, an existing multiplayer web game, or even an existing singleplayer web game that can be adapted to multiplayer.We think it's a win-win for everyone:- New exciting multiplayer games on Rune- Interesting open-source code that others can learn from- Free money for web devs having fun making a gameI'm one of the organizers, just let me know if you have any questions :)","403 forbidden on the form? Yeah, no.","Why"],"points":131},{"text":["When I upload my web optimised images to the website the textures go weirdly pixelated. The images have tightly packed detail (the serration in the ramps). I tried changing the quality and different sizes. It happens to old pictures as well taken in lower quality. Is there any way to avoid this?","Scaling down the Dimension of the source image will fix that","It’s a moiré effect","https://youtu.be/OnFlx2Lnr9Q?si=S3uW_r-zxtkY2F0B","I would use a blur or desharpen tool in a photo editor to select the troublesome areas and apply a subtle blur (to the original images). You should get less moire effect during the optimization phase."],"points":38},{"text":["Tell me about the best Dev you worked with? Lol or the worst Dev?","Best: humble senior that had a positive spin for every problemWorst: over confident junior that left a mess I am still untangling","Best: Humble older Lead dev who had seen so much that he just knew what to do 99% of the time because he'd done it before. Very generous with his time. Had many a late night conversation with him when I was on call and ended up having to phone him to escalate something, then got talking. Great to drink with. I could see he was the one to learn from, so I actually followed him to new employers twice. Nothing to prove. Still in touch.Worst: Asshat younger Senior dev who would lord what little experience he had over you, nitpick unnecessarily in meetings (to the point where higher ups once told him to \"shut the fuck up now\"). ALWAYS failed code reviews no matter what. I got a failure for a magic number once. Usually fair, except the constant was called thisSpecificThingWithUnit and had a nice comment explaining what it was. It was hardware-related and needed to be defined somewhere in the executable... Nobody else on the team knew what he expected, and neither did he. It passed without change. Wouldn't give you the time of day unless told to. Also loved to piss and moan about every facet of working life at the company, but had been there for 5 years and wouldn't just move on. Constantly trying to prove he was the smartest smarty that ever smarted. Very much not in touch.","It's interesting that a lot of responses say \" humble senior dev' for best and \"incompetent junior dev\" for worst. That's been my experience as well.","Worst: MeBest: I wouldn't bloody know!","Best: current team lead. Sometimes a bit slow to catch up on your issues, but once he's there, he's moving steadily towards a solution and you learn a lot from him.Worst: senior dev that had the development speed of an intern. It's still a meme that if there's very wonky code, chances are you're gonna find his name in the Git Blame.","Best: a humble senior who was an absolute god at coding. Very approachable, I think I learned more from him in a week than I did in a year’s experience.Worst: a lazy dev who was a supposed subject matter expert that never even bothered posing a story. Eventually another senior engineer and myself just waded into the unknown and tried to complete his work. It took us under 3 hours to complete a story he had been “stuck” on for over a month.","Junior I managed, who worked remotely.Attention to detail was terrible (I was understanding as he's a junior and tried to coach him), quality of work would sometimes be good, other times it was awful, refused to jump on calls when I wanted to, would always delay, or some up with ridiculous excuses.Turned out he was outsourcing the work I was giving him to a random bunch of other junior developers who didn't even work for us...Figured he might have been doing this when he was completely unfamiliar with a project he was the main developer on, and when screen sharing, he couldn't even find various repositories he'd supposedly been working on.Needless to say, he was let go!","I once reviewed a pull request where the person had run some code for every number between 1 and 10 by copying and pasting the function 10 times and changing one number.","Best: lead that dealt with everything and was still able to code.Worst: a guy who would talk himself up every chance he got but his code was garbage and he didn't do anything.","Worst: A senior \"styling expert\" that told me using grid for a complex layout is a hack. He was the most lazy dev I know, if it wasn't for nepotism i doubt he would have a job.Offline/away for the majority of working hours. And every time he took a feature, he would overestimate it by a shit ton, would not add anyone but a single person that was in on his deal with the company as a reviewer on his PRs. He also has the biggest defect turn over rate in the team for QA.When a change request comes that affects something he has written. I avoid that ticket like the plague no matter how small it may seem.Best : A very slow paced meticulous dev that quadrupled check everything and questioned every change. I loved working with him cause I was the complete opposite. I worked and thrived in chaos, multiple PRs at the same time. Git worktrees, multiple branches, rebasing and cherry picking. Working with him made me realise that I need to slow down by a lot and be much more methodical.","My first senior was amazing, he introduced me to TypeScript, Clean Code and Solid. Most motivated guy I know, he read so many coding books and all about architecture and structures. Writes the most clean code I know, although sometimes he overdo it.I learned a lot from him, funny enough he went trough a big process as I see some of his old code and gave name to each phrase, like the code gold phrase, the mega over engineering phrase and so on.Today he’s the team lead at a different company, hoping he’s a good manager, but he was a great mentor for me, and I am glad I took the shortcut by him teaching me the final phrase and I didn’t had to go through them myself","For a trick, my best and worst is the same person, after he got good management.Mid-level engineer who made everyone feel dumb whenever they talked to him, and he snickered and chuckled anytime someone asked him a question or made a suggestion in a meeting. People genuinely hated him. It took a lot of coaching, good managing, and then also some understanding from others working with him, and putting him in the right spot, and now he's one of the best members on the team.He's not actually *the best* I've worked with, but he's great to work with especially for people who know how to work with him.","Worst: All the junior/mid developers who ive had to work with who dont dont pay attention to details and test properly. So whenever i have to code review/test their code i know it will be a shit show. You explain coding standards to them and their next pull request has all the same mistakes the last one did. Code doesnt even work when it reaches you with their last comment being \"Should work\".Best: Senior/tech lead ive been working along for a few years. The man machine. Juggles idk how many projects and is still by far the most productive coder of all of us. Super knowledgeable, always willing to jump on a call. Not the best explainer as i feel hes not always good at ELI5, but eventually he will help you to solve anything.","Not web devrelated but c++. it was a startup where a guy had been developing solo for years with little code oversight. I came in to take over his role while he worked on other things. Turns out his code was awful and uncommented. To make it worse when you asked him for assistance to understand it, his response was if you cant understand it youre not a competent dev. The company was knew he was a dick but still let that stuff slide. I didnt stay long","Worst: Someone who refused to learn new things. Every suggestion of trying to do things in another way was met with hostility. They were using display: table and table-cell to create layouts, and since I was lower experience than them, I had to use them as well. When I had tasks where I was the only person on the project / fronted, i was writing layouts using flex and grid and I tried showing them how they work. They had no interest, and only recently, after nearly 2 years, I've seen them using flex and grid, but without much understanding on how they work.They would only use var and for loops in javascript, they would create tables or write data to a SQL db only through the GUI, the controllers would be full with copy pasted code instead of creating an abstraction and so on. Generally very messy code and an attitude of \"I already know everything\" and \"If it works why bother\".Best: idk anyone who bothered to write documentation.","Best: meWorst: me","The worst developer I ever worked with was at a company that put workforce diversity above competence. That individual would not have been hired if not for the obsession with diversity quotas. An awful developer with a terrible attitudeI have worked with some very talented people, it’s hard to narrow it down. But they are by far the seniors who are approachable, willing to take the time to explain and help, knowing that 30 minutes now saves hours later.","I wish that the technically best dev was somewhere near the list of the best devs with personality…","Best: Pragmatic, easy-to-talk with and always motivated.Worst: Technical architect with a goal to overtake the company with intentional technical dept & no documentation, that made all of our lives miserable.","Best: senior that questions himself constantly and is still ahead of everyoneWorst: non-web dev that had to help on a project and had no interest in learning or doing stuff the way the web-team did...","Best: someone who took initiative to help with work and learned the new stack. Worst: someone who obviously copy/pasted their way through their journey and who couldn’t solve a single task by themself when it came to project time leaving me to do even more work everyday so we could get done on time.","Worst: current “senior” engineer who might have lied on his resume. Legitimately can’t trust him to write even simple code and ends up causing a cascade of pointless “process” meetings that are really just ways we can put up more guardrails for him. Total detriment to the team.","Best: I work with a team of the smartest, and nicest people I've ever met. Every one of them VERY good at what they do, and always willing to help everyone else. The quality of code they output is some of the best I've seen.Worst: I worked with a person that was the opposite of this team - complete loner, and aggressive, VERY aggressive towards everyone. I was scared to go in to work."],"points":135},{"text":["How to test SAML without paying for a business account?","For O365 you can easily get a test tenant with https://learn.microsoft.com/en-us/office/developer-program/microsoft-365-developer-program-get-started renewable as long as you are doing \"active\" development.For others, I guess you need to contact them directly and hope they accept to create a test environnement for you."],"points":2},{"text":["Payment gateway issues for travel industry in Australia?","Run for the hills.If you can't do that, do whatever the reputable processors say, they will have those restrictions for a reason, and trying to worn around it with a dodgy provider will likely result in a sting.","At the moment the API provider is suggesting capturing the card details including CVV number and using public key encryption to transfer them by email. Then running the payment through manually.I'm sorry, what?!I mean, I know Aussies are at the bottom side of the earth, have miserable internet, and every animal on the continent is out to kill you on a daily basis, but surely even they have moved on from that.I'd suggest they get their clients to physically mail their credit card to the head office. Then use one of these bad boys to process the payment before mailing the card back to the customer 👍","The travel industry has very low average margins - around 2% I think - but refunds and chargebacks can have high individual values. Add to this that when travel companies go bust it can cost a lot to repatriate travellers to their home countries - which is why these companies usually need to be licensed and hold a bond with someone like ATOL.For this reason, it’s common that payment processors have a default position to not work with these companies. If your company has higher than average margins, you can potentially present a case based on that, your licensing, historical refund/chargeback rates etc and try to persuade a processor such as Stripe that you are a reliable partner.But never get involved in handling card details yourself, even encrypted.","Would accepting payments over Bitcoin be an option here guys? Maybe a link to a payment interface you could use with your card or maybe a QR code to pay with?Can you use your card to pay over bitcoin? or do you need to set up a wallet etc?"],"points":9}]